{
  "formatted_address": "Sumang Walk, Blk 218, Singapore 820218",
  "geometry": {
    "location": {
      "lat": 1.4031399,
      "lng": 103.8957788
    },
    "viewport": {
      "northeast": {
        "lat": 1.404454930291502,
        "lng": 103.8971227802915
      },
      "southwest": {
        "lat": 1.401756969708498,
        "lng": 103.8944248197085
      }
    }
  },
  "name": "218 Centre Hokkien Mee",
  "place_id": "ChIJ8b0jouEV2jERbEPr32WKvuc",
  "rating": 3.3,
  "reviews": [
    {
      "author_name": "Doraemon",
      "author_url": "https://www.google.com/maps/contrib/112665277904119154671/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX2VSCcaT9axvOwx2nD8XD3PgZ8V5VFnv420aocMSfLa6GlcEmN=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 3,
      "relative_time_description": "3 months ago",
      "text": "Kitty and I were cycling around Punggol, looking for a good dinner spot when we stumbled upon this coffee shop we'd never visited before.  We decided to give 218 Centre Hokkien Mee a try, and it was a truly unique experience.  The coffee shop itself had a classic Singaporean hawker centre vibe - bustling, lively, and full of energy.\n\nThe stall is run by a Chinese auntie and uncle, along with two Indian guys.  The auntie takes orders, and the uncle prepares the food, with the Indian guys doing the actual cooking.  It was fascinating to see this mix of cultures working together to create a traditional Singaporean dish.  However, after the meal, Kitty and I found ourselves wondering if this unique combination somehow affected the taste of the Hokkien Mee.\n\nThe auntie was incredibly friendly and provided great service.  They have a system where they give you a chip that buzzes when your food is ready.  It was a clever way to manage the flow of orders.  However, the Hokkien Mee itself was a bit of a disappointment.  Both Kitty and I found it to be quite bland and lacking in flavor.  We were hoping for a more intense wok hei and a bolder taste, but it just didn't deliver.  The prawns were fresh, but the Hokkien Mee itself lacked the characteristic flavor.  It felt like something was missing, the essence of \"Hokkien Mee\" itself.  We had to use lime and chili to try to cover up the blandness, but even the chili was a bit of a disappointment.\n\nWe also tried the fried oyster egg, but it wasn't as good as we expected.  The oyster starch wasn't flavorful, and the egg itself wasn't as flavorful.  The chili wasn't as satisfying either.  The oysters themselves seemed fresh, but they left a strong, lingering fishy aftertaste.\n\nReading other Google reviews, we noticed a common thread. Many reviewers have mentioned a decline in the quality of the food in recent months.  It seems like the Hokkien Mee, once a popular dish, has lost some of its charm.\n\nOverall, it was a very unique experience, but the food itself didn't quite live up to our expectations.  The unique staff combination and the efficient service were interesting, but the lack of flavor in the Hokkien Mee and the fried oysters egg made the experience a little disappointing.",
      "time": 1739280738,
      "translated": false
    },
    {
      "author_name": "P",
      "author_url": "https://www.google.com/maps/contrib/114233986620350380991/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJPz7Qjuy2z3SixqTCSUe14FoOCmK92PqP2LUhmF7-BkQifCBpf=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "tried their fried hokkien mee for dinner, prawns are really fresh! (i added prawns because i really love their fresh prawns)\n\ntried to ask if additional chili need to add money, auntie shared with me that they have removed the “add chilli for $0.50” and told me as long as i don’t waste it, is fine.\n\n🌶️ chilli: ⭐️⭐️⭐️⭐️⭐️\nhkm: belong to the wet version, love it",
      "time": 1733320575,
      "translated": false
    },
    {
      "author_name": "oXRYSTALo Ong",
      "author_url": "https://www.google.com/maps/contrib/114556064085815871377/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSTtKcF9FYMbh-XNbDu8f7Whl3gi-ZY6T8pFPOm3v9Y98Ws7jL=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 3,
      "relative_time_description": "3 months ago",
      "text": "218 Centre Hokkien Mee (Punggol): A Unique Experience, but Flavor Falls Short (3/5 Stars)\n\nRating:\n\n• Atmosphere: 3.5/5 (Classic Singaporean hawker centre vibe, bustling and lively)\n\n• Food Quality: 3/5 (Hokkien Mee and fried oyster egg were both underwhelming in terms of flavor)\n\n• Service: 4/5 (Friendly and efficient service from the auntie, with a clever chip system)\n\n• Value: 3/5 (Prices were reasonable, but the lack of flavor made the value questionable)\n\nOverall: 3/5\n\nDonkey and I were cycling around Punggol, looking for a good dinner spot when we stumbled upon this coffee shop we hadn’t visited before. We decided to give 218 Centre Hokkien Mee a try, and it was a truly unique experience. The coffee shop itself had a classic Singaporean hawker centre vibe—bustling, lively, and full of energy.\n\nThe stall is run by a Chinese auntie and uncle, along with two Indian guys. The auntie takes orders, and the uncle prepares the food, while the Indian guys do the actual cooking. It was fascinating to see this mix of cultures working together to create a traditional Singaporean dish. However, after the meal, Donkey and I found ourselves wondering if this unique combination somehow affected the taste of the Hokkien Mee.\n\nThe auntie was incredibly friendly and provided great service. They have a system where they give you a chip that buzzes when your food is ready—a clever way to manage the flow of orders. However, the Hokkien Mee itself was a bit of a disappointment. Both Donkey and I found it to be quite bland and lacking in flavor. We were hoping for a more intense wok hei and a bolder taste, but it just didn’t deliver. The prawns were fresh, but the Hokkien Mee itself lacked the characteristic depth of flavor. It felt like something was missing—the essence of “Hokkien Mee” itself. We had to use lime and chili to try to enhance the taste, but even the chili was underwhelming.\n\nWe also tried the fried oyster egg, but it wasn’t as good as we expected. The oyster starch wasn’t flavorful, and the egg itself lacked richness. The chili wasn’t satisfying either. The oysters were fresh but left a strong, lingering fishy aftertaste.\n\nReading through Google reviews, we noticed a common trend—many reviewers mentioned a decline in food quality in recent months. It seems like the Hokkien Mee, once a popular dish, has lost some of its former appeal.\n\nOverall, it was a unique experience, but the food itself didn’t quite live up to our expectations. The interesting staff combination and efficient service stood out, but the lack of flavor in both the Hokkien Mee and fried oyster egg made the experience a little disappointing.",
      "time": 1739286930,
      "translated": false
    },
    {
      "author_name": "Ronald Lee",
      "author_url": "https://www.google.com/maps/contrib/110772363482309595502/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJLz1cH5SKJMrdoqIUTjdSFDRUKdhEnwmTNAFG_IVXJ89Br4w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "To me I feel it still delicious compare to last time even there is a lot of bad review ,fyi the old uncle have passed away quite sometime left the wife which is the auntie standing outside I still support them. Consider a good Hokkien mee around Punggol",
      "time": 1723611473,
      "translated": false
    },
    {
      "author_name": "Shirlene Lim",
      "author_url": "https://www.google.com/maps/contrib/103437680272658217794/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIHwZS18xyVlW4rTFmb2xS2ZDmXkH4pDp-fEkc-3meV7Ks0xg=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "I bought a pack of fried prawn noodles and fried carrot cake to try. The prawn noodles lacked flavour and salt and there was a strong burnt aftertaste (does not taste like wok hey). The pork lard was fragrant but became soft because I bought takeaway. Fortunately, the carrot cake did not disappoint. It is delicious and not too greasy, there is fragrance from the chai por and had enough salt.",
      "time": 1701861426,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16698936638489445228",
  "user_ratings_total": 319,
  "vicinity": "Sumang Walk, Blk 218, Singapore"
}