{
  "formatted_address": "618 Yishun Ring Rd, #01-3238, Singapore 760618",
  "geometry": {
    "location": {
      "lat": 1.4188027,
      "lng": 103.8356195
    },
    "viewport": {
      "northeast": {
        "lat": 1.420037280291502,
        "lng": 103.8370014802915
      },
      "southwest": {
        "lat": 1.417339319708498,
        "lng": 103.8343035197085
      }
    }
  },
  "name": "57 Medical Clinic (Yishun)",
  "place_id": "ChIJ85fBgFwV2jERr6uEk45sFec",
  "rating": 3.9,
  "reviews": [
    {
      "author_name": "Tamayanthi Kuruppiah",
      "author_url": "https://www.google.com/maps/contrib/101093850094750322348/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIUpPvqYdKdoLWlXx7SAGFVDlJshnlqTPLVjE6I-CiIPUqwuA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I am always happy to be seen in this clinic.the lady doctor is a wonderful and very caring person.she diagnosed the symptoms well and her treatment is very good. So happy in our neighhood we have such wonderful doctors. Most doctors in this clinic is very appreciated.",
      "time": 1742553932,
      "translated": false
    },
    {
      "author_name": "Amanda H",
      "author_url": "https://www.google.com/maps/contrib/100953665696045645828/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJD2wxyP_jnP_OB51liuvIKZj5_tGTLRcAzhKqXqCkec94Z3w=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "Company doctor. So far only had 2 positive experiences with the doctors at this clinic. A young locum doctor and a female doctor. Was seen by a Dr Low on 2 separate occasions. Both times felt like he was more interested to end his shift than to seeing patients.\n\nOn my last visit, I reckon the entire consultation was less than 5 minutes. I'm not sure what he's hearing with his stethoscope if he merely placing it on your body for less than a second before switching to another part. So on this unfortunate visit, I felt that the doctor was not interested to listen to your medical history leading up to the visit. I was sent away with Zyrtec (idk how many tabs I've finished at home before visiting the doctor), cough meds and some anti inflammation/phlegm meds. Semi lost my voice by the next day and my cough + runny nose got worse. Had to visit another clinic today only to be told I am having a sinus infection.\n\nAlso, it is runny nose, not running nose.\n\nEdit: I just wanted to add - Dr Low, an itchy, scratchy throat is not the same as a sore throat.",
      "time": 1738834307,
      "translated": false
    },
    {
      "author_name": "Kenneth Thow",
      "author_url": "https://www.google.com/maps/contrib/105006610106477848764/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJmtwg7gGZOLNdF2eMEhtxXZJwek_yulcvn9GWSAagPLLuisQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "Young Malay female receptionist is arrogant and rude.\n\nUnable to pick and choose medication needed as we would have it at home. E.g Panadol.\n\nShe was happily eating curry puff in the morning and use her oily hands to pass pen to patients to fill up details.\n\nIs the clinic that money minded or is the counter girl just lazy to make changes to the bill?\n\nDoes the staff treat the clinic as her canteen and it is so unhygenic to be eating and serving customers at the same time.\n\nPlease investigate she is really not fitted to be front of house.",
      "time": 1734673697,
      "translated": false
    },
    {
      "author_name": "Aurora Blaze",
      "author_url": "https://www.google.com/maps/contrib/102586363820127169001/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKCaJwOAKHvQ612gYwcOyrbOfWLDQen7WU7HfF8WEoMNSr6qkw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "10 months ago",
      "text": "If you can avoid this place, avoid it. Firstly, the wait time is ridiculous even if you make appointment. I had appt at 6pm for covid vaccine and only got out of the clinic at 730pm. Secondly, their queue system is weird. I was holding number 7 and after 6, they called for 8. I asked the receptionist why skipped my number, she said, \"Ohz I thought you are not here.\" Does that even make any sense? Thirdly, the receptionist is very insensitive. During my wait there, I could hear all the medical issues of other people being broadcast loudly by her. \"What's wrong with you today? Diarrhoea ah? How many times? Oh, 5 times ah?\" Or \"You want receipt ah? Claim your $5 from company is it?\" The lady was so embarrassed to get her receipt after that. Please be more sensitive and efficient.",
      "time": 1720537437,
      "translated": false
    },
    {
      "author_name": "Allen Pang",
      "author_url": "https://www.google.com/maps/contrib/106015899811479063590/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKolxjSxgVEZ3V0jTtYRHt2VJR668jtj6ZLLpqqBm2Bi5DXCg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Had my appointment 0830 am for \"vaccine\"\nThere were patients already at the clinic\nWhen it was my turn to register, I was the 12th\nHowever, I was call into Doctor's room, after a patient was done\nMy vaccination was done professionally almost as soon as I enter,  and doctor is ready for the next patient\nDoctor is friendly and so are the staff\nI believe the doctor knew that my vaccination will take only about a minute",
      "time": 1737075653,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16651334556888378287",
  "user_ratings_total": 62,
  "vicinity": "618 Yishun Ring Road, #01-3238"
}