{
  "formatted_address": "1 Stadium Pl, Singapore 397628",
  "geometry": {
    "location": {
      "lat": 1.3042979,
      "lng": 103.8724464
    },
    "viewport": {
      "northeast": {
        "lat": 1.305709230291502,
        "lng": 103.8736566302915
      },
      "southwest": {
        "lat": 1.303011269708498,
        "lng": 103.8709586697085
      }
    }
  },
  "name": "A1 Porridge",
  "place_id": "ChIJR9D0wEsY2jERwuW2I3T-MF0",
  "rating": 2.2,
  "reviews": [
    {
      "author_name": "Kim Jun Hong",
      "author_url": "https://www.google.com/maps/contrib/115322490341831324881/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVbbaPeY7qivr4pI3RZ8rnEW7jssq1iGZNjpkT9QqGoSzHQpESw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "a year ago",
      "text": "Visited A1 Porridge for the first time on Lunar New Year's Eve, and the experience was a mixed bag of pleasant surprises and slight letdowns. Here's a breakdown:\n\n👅 Taste:\nThe highlight of the visit was undoubtedly the taste of the food. Everything we ordered was flavorful and satisfying, living up to the expectations one would have for a special occasion like Lunar New Year. It's worth noting that despite the holiday period, the prices remained reasonable, which was a pleasant surprise.\n\n🍽️ Ambience:\nHere's where things began to diverge from expectations. Given the significance of the date, we anticipated a festive atmosphere, complete with Chinese New Year songs to complement the dining experience. Unfortunately, the place was devoid of music, leading to a rather subdued environment. This, coupled with the fact that only 2-3 tables were occupied, contributed to a quieter ambience than expected. While some may appreciate the calm, it felt like a missed opportunity to elevate the festive mood.\n\n⭐️ Service:\nThe staff were polite and friendly, which added a nice touch to the overall service. However, there were moments of forgetfulness, such as missing out on our drink orders despite the restaurant not being busy at the time. These lapses were minor but noticeable, especially considering we were the only table at that moment.\n\n💰 Price:\nAt $36 per person, the meal was priced on the higher end, but considering the occasion and the quality of the food, it felt justified. The restaurant managed to keep the pricing fair even during a high-demand period, which is commendable.\n\nOverall:\nDespite the minor hiccups in ambience and service, A1 Porridge offers a good dining experience, especially if you're in the mood for tasty food at a reasonable price during the festive season. While the lack of festive music and occasional forgetfulness in service were drawbacks, the quality of the food and the friendliness of the staff make it worth visiting. It's not every day you find a place that maintains reasonable prices during Lunar New Year without compromising on taste. I'd recommend giving it a try, at least once in a while, for a decent meal that won't disappoint taste-wise.",
      "time": 1707408596,
      "translated": false
    },
    {
      "author_name": "Vincent Loh",
      "author_url": "https://www.google.com/maps/contrib/109140273498131166811/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLBcAUKjD4SOzqeGNSlgcQ8xjdAKSXhtzbDUkyZE2yY5xPAJg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "Ordered century egg with mincemeat porridge and was shocked to find so little mincemeat (barely visible) for a $10plus porridge... seriously is cost really so high that need to reduce ingredients to this low level...Disappointing...",
      "time": 1738497535,
      "translated": false
    },
    {
      "author_name": "Jeff",
      "author_url": "https://www.google.com/maps/contrib/101763540896756605183/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocInoXXW0RswXKg-uMYrNMOu8Jb84FErwZg6IxStvgUb-Km2Ag=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "6 years ago",
      "text": "Mediocre hawker food at restaurant prices. Note, staff’s attitude needs to be improved too. See the abalone noodles. Never knew such tiny abalone is available. It’s about the size of a 5 cent coin. And the portion of noodles is hardly enough for a man. The sauce is too salty.\n\nWon’t waste my calories and money at this place and be subjected to poor service. Staff seems to be more interested in chatting and playing with their phones than actual service work.",
      "time": 1530369054,
      "translated": false
    },
    {
      "author_name": "tom how",
      "author_url": "https://www.google.com/maps/contrib/114567298353461353097/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKzSk8Wf4d7J3h6Kv1b8A88cpmLCwVdG6nWCcpqsrpwildvUA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "Never come across order taker cancel your order by saying it will taker longer waiting time for a fried egg dish, and was told not to add him why?\n\nBy the way, most of our neibouring tables were having it, and the other food seems to be served fast enough either\n\nWhat a great service.",
      "time": 1731756548,
      "translated": false
    },
    {
      "author_name": "Reeve Liew",
      "author_url": "https://www.google.com/maps/contrib/110201189489029147103/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWshChIflC8Bqhjfs87Dh-297Bo1V6oeu_9kyLrcX8JS0dvoxPYvQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "4 years ago",
      "text": "Delicious food and staff are friendly...\nAmbience : 👍🏼👍🏼👍🏼\nFood : 🤤🤤🤤\nPrice : 💲💲💲💲\nService : ✅✅✅✅",
      "time": 1604211668,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6715146819178259906",
  "user_ratings_total": 11,
  "vicinity": "1 Stadium Place, Singapore"
}