{
  "formatted_address": "450 Clementi Ave 3, #01-285 Clementi, Singapore 120450",
  "geometry": {
    "location": {
      "lat": 1.3135086,
      "lng": 103.7654817
    },
    "viewport": {
      "northeast": {
        "lat": 1.314817380291502,
        "lng": 103.7667420302915
      },
      "southwest": {
        "lat": 1.312119419708498,
        "lng": 103.7640440697085
      }
    }
  },
  "name": "A Dental Clinic @ Clementi Central",
  "place_id": "ChIJv8YoMo4a2jERHWne_4aSz3g",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Phua Hh",
      "author_url": "https://www.google.com/maps/contrib/102381074513494763902/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKv7Mqb6JC4cpfXenOFmgVMK3FEgtcFCPaZi7yu2z4-4zfM=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "🟨 Dr Keith Ong is always detailed in giving explanations whenever I ask him on the state of my teeth.\n\n🟦 I go to him for teeth cleaning regularly every 6 months. He is very patient and kind and is also a skilled and experienced dentist.\n\n🔷️ Kaylee, the receptionist, is always cheerful & friendly. 🙏🏻All in all, my experiences are good here.🔷️I highly recommended this dental clinic.",
      "time": 1729726685,
      "translated": false
    },
    {
      "author_name": "Cecilia Han",
      "author_url": "https://www.google.com/maps/contrib/102486435916947342283/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJTWEgHJqZ79hbNvGMOSh6upsNFhCLhbYtnf9yAnA2Srlhv2Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I chanced upon A Dental Clinic @ Clementi Central. The receptionist was polite and helpful to \"squeeze\" me into an available time slot despite not making prior appointment ( I walked in with another lady as we went to another dental clinic and were told it was closed though it stated it was opened half day).\nDr Keith Ong was very patient with me as as I kept asking same repeated query. He is experienced and skilled dentist I have ever seen. I am glad to visit this clinic.",
      "time": 1743928576,
      "translated": false
    },
    {
      "author_name": "Joanne Loi",
      "author_url": "https://www.google.com/maps/contrib/102299483277712093521/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL1K1U8Dn7T1b85ETYC74q14akNWC3ZyT4gyw3KAAPBKUBMKw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Great experience with friendly receptionist. Dr Keith Ong is skilled with extraction of my tooth. Waiting time with appointment is timely. Starting my journey with straits up smile aligners. Hope all is well.",
      "time": 1737453821,
      "translated": false
    },
    {
      "author_name": "Florence Leow",
      "author_url": "https://www.google.com/maps/contrib/102656561598060120185/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWWAO5NDzda0lWfeRJhWD1zQtDlUm5XL-zVuqnQGNv9Rilxc3M7=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "🔵I have been seeing Dr Keith Ong for teeth cleaning and other dentistry issues since 2008.\n\n🟢 When he moved to this Clementi clinic, I followed him to his new workplace. I go to him regularly for general teeth cleaning twice a year.\n\n🟨 Dr Ong is very patient, kind and detailed in his work. He has a very good positive attitude and will explain things nicely if you ask him about certain issues.\n\n🟦 The receptionist, Kaylee, is cheerful and efficient in her duties too.",
      "time": 1729826431,
      "translated": false
    },
    {
      "author_name": "Clara Chen",
      "author_url": "https://www.google.com/maps/contrib/101332623571636986122/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKpf7Dr0i5eddLUi3KiT5NzPXJElyYdnyY-LBIwuf6v872bnCc=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "9 months ago",
      "text": "The two times I visited this dental clinic left such a bad mark in my memory that I have to warn others if they are even considering coming here for services. The male dentist is quite rough and poorly skilled, plus the dental and clinic assistants are also inexperienced and helpless; both times I leave the dental clinic traumatized.\n\nMy first visit was for x-ray and dental impression for my aligners. The appointment was pre-arranged and I was quoted a rate for this appointment. As we got started, I laid on the dental chair when the dentist announced he will be doing scaling & polishing too. When we were done, the bill was ~$100 more than the original quote I got beforehand. I found out that was to cover the scaling & polishing service, whose cost he failed to inform me of before he commenced the scaling & polishing.\n\nRegardless, I accepted it as a misunderstanding and returned later to get my aligners bonded.\n\nMy next appointment was for bonding the new aligners & shaving my teeth. He kept hurting my gums even though he knew they are sensitive; like I said earlier, the dental assistant was helpless. He shoved dental floss on my gums so they hurt & even bled a little - to which he said to just let it stop on its own. While shaving my teeth to fit, on the dentist’s instructions, the dental assistant used a mirror to press against my tongue to “protect” it. However when he started the shaving process - which was terrifying due to the sound, smell, and vibrations on my gums - the dental assistant made space for him and removed any protection for my tongue so it was left dangerously hanging in the air while the shaving is being done.\n\nAll this time, I made uncomfortable sounds, fidgeting in the dental chair and asked him to stop at times. So he was fully aware of my discomfort.\n\nAt the reception when I got my bill, I asked the clinic assistant if it’s supposed to be $50 less as I recalled I was quoted a fewer amount. She was snappy and said it couldn’t be. I checked the original quote and discovered she was right - so I apologized for my oversight. She replied with a snide remark that no one would offer to do this for a lower price.\n\nWhen I got back and checked my teeth; the dentist had left a sharp edge on one tooth when shaving and it looked like he had done it halfway. And my gums continued to bleed.\n\nI seldom give a bad rating but given this terrifying experience, I do not recommend you visiting this dental clinic. Try their neighbours instead - there are two others next to them which are reputable and value for money.",
      "time": 1723536200,
      "translated": false
    }
  ],
  "types": [
    "dentist",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8705337713246497053",
  "user_ratings_total": 19,
  "vicinity": "450 Clementi Avenue 3, #01-285 Clementi, Singapore"
}