{
  "formatted_address": "20 Mandai Lake Rd, #02-01 Bird Paradise, Singapore 729825",
  "geometry": {
    "location": {
      "lat": 1.4078933,
      "lng": 103.7805691
    },
    "viewport": {
      "northeast": {
        "lat": 1.409357280291502,
        "lng": 103.7819938302915
      },
      "southwest": {
        "lat": 1.406659319708498,
        "lng": 103.7792958697085
      }
    }
  },
  "name": "A&W Mandai Wildlife West",
  "place_id": "ChIJmylCUcUT2jER6kVEQ__QzdM",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "June",
      "author_url": "https://www.google.com/maps/contrib/105169174857655588987/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXBLfXBzDCtAkvpFz1SnbMXjrgJSoSspWfNoYDn6aBAdMdPyzqspA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Food is good. Chicken is crispy. Better than KFC. Place looks clean, floor isn’t sticky or oily. Service is quite fast on weekday lunch. I wished more fries were give , very addictive.\n\nTrue to other comments, we have to pass the receipt separately to the drinks counter to get our drinks. Not a huge issue personally.",
      "time": 1745599491,
      "translated": false
    },
    {
      "author_name": "Euphorie Liew",
      "author_url": "https://www.google.com/maps/contrib/102306923068386332783/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVqWpm7XKNL7diLCfwGQ7JyPdpcOUwPsZYu7Ee343mMg18kY_fR=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "2 weeks ago",
      "text": "After visiting the parks, we went to have lunch at this outlet at around noon time. It was not crowded on a Tuesday. Firstly we need to order the food at the kiosk, then collect the drink at the collection area and show the staff the receipt.\n\nHowever if you are paying cash, you have to bring the receipt to the counter and make payment, after that queue again to collect your drink. It seems the outlet is short handed as there was only one staff at the counter to handle both cashier payment & issuing the drinks.\n\nThe restaurant has indoor & outdoor seating, tables are actually quite small, it may be squeezy if someone who is bigger size sitting down might feel uncomfortable.\n\nWaited a while for our food, I got my burger pretty fast, but for my friend who ordered the fried chicken, it took quite some time to get his.\n\nRoot beer float was served in big cold mug which made the drink more cooler! I got myself the Chicken Burger With Premium Cream Cheese, taste not bad actually. Curly fries tasted ok but just a bit cold. Fried chicken was served piping hot, so have to be really careful while eating. Chicken was quite dried so my friend only eaten half of it.",
      "time": 1746063884,
      "translated": false
    },
    {
      "author_name": "William Lu",
      "author_url": "https://www.google.com/maps/contrib/115969486686664081306/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWyuRisFOll54oVs7HxOSI6-SCcNbJroHEXUOjXeW5Tra49I2E=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "You need to know that after order even though with food pager that drink still need to show receipt to collect. They should combine this collection with food. I had bad experience at other outlet on this, they put drink counter in the center and cashier at left and right, the queue was messy, I don't even know which for cashier and drink, someone just cut me on the line and went to the cashier queue.\n\nFood was ok. Golden aroma chicken was crispy, coney dog was good.\n\nFor chili sauce, it is troublesome I had to ask for more to the staff, they should just let people take the sauce themselves.\n\nNo wash basin for hand in the outlet. Need to go out to wash hand before eating the chicken or fries with hand.\n\nYou could go multiple times to collect since they didn't prepare everything at one go.\n\nReturn tray counter didn't specify anything, saw people put the glass on the tray return then I knew where to put the glass. I had to check first where was the trash bin cause it wasn't really clear.\n\nOrdering system a little bit slow on showing the items, also instructions on the option was not clear, some items gave option some default, I wasn't clear on what I have ordered on the set, even though I ordered anyway.",
      "time": 1743652160,
      "translated": false
    },
    {
      "author_name": "Anson Chew",
      "author_url": "https://www.google.com/maps/contrib/114748016520143042702/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXieD39-A9eoO6fr1C0GST49jgmiCQTgTI0MZ4DG_s2ZHViuHOH-w=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 2,
      "relative_time_description": "8 months ago",
      "text": "Located just outside the entrance to Bird Paradise, A&W doesn't offer the 20% F&B discount for \"Friends of Wildlife\" members, which is a bit of a letdown. Ordering is pretty straightforward—you pick your items at the self-service kiosk, punch in your buzzer number, and pay. But here’s the catch: there’s a tiny note on the receipt telling you to collect your drink separately, which I only noticed when I was pointed to another counter after getting my food.\n\nI went for the Mozza Burger & Marina Fish Sandwich Combo, which included curly fries and root beer. Unfortunately, the fries were overcooked and lost their usual springiness, and the burgers, despite being in \"biodegradable\" packaging, were a bit of a letdown. Even though they push a \"no straw\" policy, they handed me one without asking. Plus, at the tray return area, there wasn’t any clear signage on how to deal with leftovers.\n\nThe place has both indoor (air-conditioned) and outdoor seating, and surprisingly, it stays pretty empty even during lunch. While the location is convenient and the ambiance is decent, the food quality and some small service quirks made it hard to fully enjoy the meal. With a few tweaks, they could definitely live up to the A&W name we know and love.",
      "time": 1724546944,
      "translated": false
    },
    {
      "author_name": "General Twilight",
      "author_url": "https://www.google.com/maps/contrib/114314523990529053400/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXsFRuZl8RX0cufOjQccrkQrp1fP5M0CTI0gAIp4R28Pj79638=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "It was great, have a great variety of food and even kids meal. It is a good dinner after walking throguh the rainforest wild asia. The staff and atmosphere here are alright. Saw a lot of families here at dinner time. And it is rare to have A&W in Singapore so it was a nice outing with the family.",
      "time": 1744562490,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15262084506992264682",
  "user_ratings_total": 140,
  "vicinity": "20 Mandai Lake Road, #02-01 Bird Paradise"
}