{
  "formatted_address": "64 Hillview Ter, Singapore 669277",
  "geometry": {
    "location": {
      "lat": 1.352637,
      "lng": 103.7569427
    },
    "viewport": {
      "northeast": {
        "lat": 1.354064780291502,
        "lng": 103.7582921802915
      },
      "southwest": {
        "lat": 1.351366819708498,
        "lng": 103.7555942197085
      }
    }
  },
  "name": "Absolute Kinetics Consultancy - HQ Office",
  "place_id": "ChIJw1IvYEYQ2jERwYKOAygGPLk",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "p y",
      "author_url": "https://www.google.com/maps/contrib/112532739647028430383/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLjOzzz1wF0G4-skLBESyG_Yte3x9cbUhbTSG5DSkbGCdqZwQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Remind everyone that if you are going to take a food hygiene English class, don't go here to class, because there is an Indian male teacher who is very impatient with the students and has a very bad tone.\nThanks for your reply\nClass time: Saturday, April 5th, 9:00am\nClassroom No.8 (English)\nAt first, the Indian male teacher asked me in a bad tone why I signed with a pencil\nI said because there were only pencils on the desks in your classroom. Later, he lent me a fountain pen. I let it go because his tone was bad\nWhen the class started, he asked questions that I didn’t know the answers to\nHe was very impatient and asked me to use Google to find the answers\nBecause I don’t speak English very well, but I can still write English\nHe kept asking me to answer questions and I didn’t know. He kept saying: I won’t pass you for today’s exam. He repeated this sentence 3 times. The students present can testify\nI only attended the class for 30 minutes that day and left. The person in charge also helped me change the class to next week. Finally, I just want to tell you that this Indian male teacher must reflect on himself. I paid money to learn, not to be bullied. Thank you",
      "time": 1744029085,
      "translated": false
    },
    {
      "author_name": "D H",
      "author_url": "https://www.google.com/maps/contrib/107267698650866797124/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIstrSAfkxqAlNdqihdVgTMyWylnWr75yLwMvfTjbzkRESyEA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "The classroom facilities were in poor condition, and the toilets were unhygienic. I attended a heavy forklift course but was not provided with any learning materials—something I’ve never experienced before after attending multiple courses from other training providers.\n\nThe trainer’s approach was extremely lacking. The theory class was barely taught, and many exam questions were never covered in the lessons. I especially feel for the foreign workers in the course who were visibly confused. Unfortunately, the trainer seemed uninterested in teaching, skipped important aspects of operating the machinery, and was impatient—often resorting to shouting at trainees.\n\nEven though I passed the course, I left feeling like I had learned nothing, which is unacceptable for a course costing over $700. The overall experience was disappointing, and I cannot recommend this training provider.",
      "time": 1740358345,
      "translated": false
    },
    {
      "author_name": "Samuel Low",
      "author_url": "https://www.google.com/maps/contrib/101261407761450573910/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUunl9XfVbf3baUqi7xFSJA8fNkrr4HE5Apbo7O15p471QGUl2eJw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "attended COSC course. trainers are ok, although day 1 and day 2 trainers taught different stuff and there was visible confusion, but trainers are otherwise friendly. also, if you got the ground floor rooms, the stench of urea is overwhelming. The toilets are right beside and im not sure if they have ever been washed before. having to withstand the stench of urea for 2 days is no joke. the irony is that we're attending a course that covers health and safety.",
      "time": 1740124656,
      "translated": false
    },
    {
      "author_name": "Karthik knk",
      "author_url": "https://www.google.com/maps/contrib/104727635413433391441/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKHg-I_E2395uX-KGaOu4-YVxr8SI3Y9kosb_T0umRlnSiysA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "7 months ago",
      "text": "I had attended SOC course this month. The instructor on the 1st for the theory class was Mr. Rahim. His teaching was very bad. Instead of teaching on the course he was just talking about personal and work life for most of the time. I dint learn anything useful.\nWhen he was telling those stories of his life, he was making fun of other races and countries so easily.\nI did stopped him once for mentioning my county in a wrong way, he apologised once then started doing the same with his other examples. It was really annoying to listen to all the nonsense, then I had no other choice but to ignore.\nThe practical instructors on the second day were very good and professional.\nIt’s my suggestion only to focus on the safety course topic instead of telling their own assumptions on other race and country. I hope it goes to instructor Mr Rahim.\nIt was really a bad experience for me.",
      "time": 1729151598,
      "translated": false
    },
    {
      "author_name": "Jessie Lee",
      "author_url": "https://www.google.com/maps/contrib/110548990208251357270/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUGX0SlCd0B0OovsY1i_Bta-u8hazN-3y8ARB7mW5Z_caIu6wU=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "The class is interesting & benefit me a lots",
      "time": 1734322988,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13347550164547437249",
  "user_ratings_total": 272,
  "vicinity": "64 Hillview Terrace, Singapore"
}