{
  "formatted_address": "#01-01 Viva Business Park, 750D Chai Chee Rd, Singapore 469004",
  "geometry": {
    "location": {
      "lat": 1.3226213,
      "lng": 103.9214277
    },
    "viewport": {
      "northeast": {
        "lat": 1.323968980291502,
        "lng": 103.9228264302915
      },
      "southwest": {
        "lat": 1.321271019708498,
        "lng": 103.9201284697085
      }
    }
  },
  "name": "Academy Kidz Inc Pte Ltd",
  "place_id": "ChIJi_d4g74i2jER438olkSP5N0",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Prabodha Tilakaratna",
      "author_url": "https://www.google.com/maps/contrib/108883701724465703466/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVkI-hnHZRKCtR3jGxZJ5EmDcpCXW8zTYRm4JKidY_uIBrB27FX=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "This is a great place for any parent who is looking for a safe and carefully nurtured childcare / infant care in Bedok, Chai Chee area.\n\nBoth my son and daughter are going to Academy Kidz. This is my daughter’s second pre-school and I’m really happy I’ve chosen this school over the previous one. Both of them are really enjoying their school time.\n\nI could see some significant improvement in them. Every day they learn new songs, new words in both English and Chinese languages, and some new learning content. Also, they are having a really fun time doing lots of play dough activities, coloring activities, experiments, hands on activities, outdoor activities, etc. Every week the teachers update the kids’ progress with pictures and videos.\n\nAll the teachers, administration staff and principal Ms. Grace are very kind, helpful and most importantly, very responsive. We can see the affection, care, and support all of them are showing to our kids. Thank you Ms. Grace, and all the Academy Kidz staff members for your amazing work!",
      "time": 1710731964,
      "translated": false
    },
    {
      "author_name": "Priscilla Li",
      "author_url": "https://www.google.com/maps/contrib/103326433500089083706/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLdeDh7gpnaaRmHeN6WC0AIHDQEqBljaWXUPCPpmJKxQT88Tg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Very thankful to academy kidz for taking care of my daughter and helping her to grow into a conversant little girl who can write part of her name at 3 years old. Teacher Anne is immensely caring and really loves children. Principal Ms Grace is easy to communicate with and takes feedback well. Uniform is also gorgeous! My girl loves the food in school as well. Kudos to all staff!",
      "time": 1677250049,
      "translated": false
    },
    {
      "author_name": "Cynthia Cheng",
      "author_url": "https://www.google.com/maps/contrib/108147167940686312777/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLFQ2ruUvMfBRaOc6wm2COTojeOclR7NH_uITmAkxSlqP1Hwg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "My son has been with them since PG until this year, proudly graduated from there before stepping into his next milestone.\n\nI remembered vividly that my son first enrolled for childcare- he was wailing away which got us worried. But he was happily looking forward to his teachers & friends just the second day! Teachers are very patient, responsible and caring towards the kids. Environment is very conducive and rather large for the kids to explore around.\n\nMs Grace , the preschool in charge is very responsive with all of our queries and very concerned with the kids well-being.\n\nWe are very grateful for all the teachers’ time and effort spent together with us to nurture our son into a well-grown child.",
      "time": 1672395175,
      "translated": false
    },
    {
      "author_name": "Carla Perlado",
      "author_url": "https://www.google.com/maps/contrib/101619018471253298806/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKfw0qvdSaA8JRbwgfMcbh9Ye0j6jIc52gkgh21_EFWETJITg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "My daughter started attending infant care last February when she was just 10 month old. I have a lot of worries on how she will be able to adapt and of course, if she will be well taken cared of.\n\nBy the time we inquire, we already like the place as it has a lot of space for kids to play and for my girl, to practice crawling, standing and walking. We also felt comfortable with Principal Grace and Teacher Alice. (All teachers are very nice to us. :)) They are very accommodating and reassuring us that my baby is in good hands.\n\nThe first few weeks were very hard but they always update me and my husband by sending us pictures which I appreciate so much. And until now, I can say communication is very well established. I know my baby is safe, nurtured and happy in school.",
      "time": 1618931723,
      "translated": false
    },
    {
      "author_name": "Hao Zhong (Aaron)",
      "author_url": "https://www.google.com/maps/contrib/117770389562575199974/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXuGht9KoMREgyxUaLGW6GZiuOUUWpiIo8EEfAGQ3nDOIw3zffk=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "My son has just graduated from here, he has enjoyed his preschool since day one of PG. He has not only learnt for the knowledge, but also learnt how to get along with others. We want to give our greatest gratitude for the tireless efforts put in by the school staff.",
      "time": 1672751414,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15989062101811888099",
  "user_ratings_total": 6,
  "vicinity": "#01-01 Viva Business Park, 750D Chai Chee Road, Singapore"
}