{
  "formatted_address": "288B Jurong East Street 21, #01-378 Block 288B, Singapore 602288",
  "geometry": {
    "location": {
      "lat": 1.339146,
      "lng": 103.7427873
    },
    "viewport": {
      "northeast": {
        "lat": 1.340462380291502,
        "lng": 103.7442171802915
      },
      "southwest": {
        "lat": 1.337764419708498,
        "lng": 103.7415192197085
      }
    }
  },
  "name": "Ace @ Work Childcare (JE288B)",
  "place_id": "ChIJ4Sum4RAQ2jERyMJbYdtZq-M",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Kay Jun Tan",
      "author_url": "https://www.google.com/maps/contrib/113713738481903826585/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLfKc57MMDzJXKEW7kVh35tRPMvKqdbemDQecenfzztyZDu4g=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Coming from a parent whose kid had one year spent in myfirstskool, Ace @ Work in this centre is really awesome!\n\n1) Principle & teachers seemed more involved\n2) A lot of different activities planned\n3) Never lacked celebrations for kids\n4) Outings done without parents shows a lot of confidence in how they handle kids\n5) Pro active in their school’s app chats\n6) Never once I brought my son home smelling bad. They are quite good in handling overall hygiene. (Unlike my previous experience in another school)\n7) Involved N1 & above in K2 graduation, which made me really impressed as my son is able to coordinate a dance with his classmates.\n\nOverall a very positive experience and would highly recommend to all parents staying nearby! Already sent my daughter in and recommended to my relatives nearby.\n\nHope this helps!",
      "time": 1732939742,
      "translated": false
    },
    {
      "author_name": "Kathleen Marie Fastidio",
      "author_url": "https://www.google.com/maps/contrib/106758384388085268384/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX_NZgnbD-PZRVwCqD4_plsoV-o1qbsBeZHFJK_h-SouhoEnw6U=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "I would like to thank all the teachers and staffs Ace at Work Jurong East, especially Ms. Dina, Teacher Charmaine, Teacher Donna and Liuna Laoshi, for their guidance and support. My child stayed with them for 4 years and I am very secured on how they took care and taught my child. The environment inside is the cleanest childcare I have ever visited. And the teachers and children in this childcare are very kind. The apps used for communication between families and educators is also very convenient for parents to know their children’s daily situation at any time. Teachers and the principal will also communicate with each parent in a timely and patient manner. Also, the distribution ratio between children and teachers is appropriate. Almost every child receives timely care and attention. They have lots of activities to enhance the children’s talents and skills (arts, music, sports, etc). Thank you for the 4 wonderful years at Ace at Work and for being a great support to all the parents. Indeed, highly recommended.",
      "time": 1672154521,
      "translated": false
    },
    {
      "author_name": "Zhe Rui Choo",
      "author_url": "https://www.google.com/maps/contrib/108885801758458435602/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJbjuUm3ZOiFXBOiQGqru7WeSjuLn0axWDhBI-b-cwOuPJYgQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My girl has been there since 2.5 years. Really appreciate the teachers effort in making it a fun and enjoyable place for both the kids and parents. The teachers organize events to involve parents too such as mother's day lunch and father's day Spartan race. My girl really love the school.\n\nReally gratedul for mdm Dina, the principal for letting us have a year of fun with the team. Shout-out to teacher Tia, 週老師, teacher farhana, teacher verda and teacher hana for taking care of my girl from n1 to mid of n2. While we have shifted away from jurong, my girl still misses this place and ask us to visit the teachers whenever possible.\n\nThis shows how much of an impact the teacher has on the kids.\n\nAce at work is a really well rounded school, from language, to numbers and even national education. I think any kids would love going here. 5 star place!",
      "time": 1689433814,
      "translated": false
    },
    {
      "author_name": "Sherlyn kok",
      "author_url": "https://www.google.com/maps/contrib/115990251038381870767/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVAs-TMQWN083dsrFtaTb9TU-xfXbGH5vQkb8Zxw2ed84m8Drpe=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "My girl has just started her first 2 weeks in this school and our experience has been nothing short of amazing. From the first call with the Principal Mdm Dina till the hug from the Teachers today, I can feel their passion, love and care for the students. My girl just turned 2 not long and is at a stage where she is more aware of the environments and also have a mind of her own. She started off isolating herself, refusing to join in the class activities and just watching from far till now enjoying the companion of the students and teachers! I think most credits go to the teachers for making my girl feel safe, loved and comforted. The Teachers also constantly send us photos of our girl and keep us updated of the progress, and attentive to our needs and questions raised.\n\nI hope my girl will love school one day and I believe this day is coming soon 👍🏼 Many thanks to the amazing team of teachers and of course Mdm Dina",
      "time": 1641979962,
      "translated": false
    },
    {
      "author_name": "Adlyna Abdullah",
      "author_url": "https://www.google.com/maps/contrib/108116245926790252755/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIm-l_sJE58gk4bOWDVC_P4UTsqwucGZsiYQOv9KBGBYwTsQg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "My son entered this school only for 1 year but i can see there's a lot of improvements especially in his confidence level to interact with people. All the teachers is skilful & professional in handling young kids who just experience 1st time of schooling environment. Highly recommended to join Ace@Work Childcare!!",
      "time": 1670048086,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "school",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16405304866393277128",
  "user_ratings_total": 15,
  "vicinity": "288B Jurong East Street 21, #01-378 Block 288B"
}