{
  "formatted_address": "31 Holland Cl, Block 31, Singapore 270031",
  "geometry": {
    "location": {
      "lat": 1.3068684,
      "lng": 103.7972721
    },
    "viewport": {
      "northeast": {
        "lat": 1.308446230291502,
        "lng": 103.7983887302915
      },
      "southwest": {
        "lat": 1.305748269708498,
        "lng": 103.7956907697085
      }
    }
  },
  "name": "Aces League 31 Food Court",
  "place_id": "ChIJdcdzao8b2jERBlUnVnBnY14",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "Hrmgr",
      "author_url": "https://www.google.com/maps/contrib/113770174448938389729/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLqnb6aXPKqLBnCIKwaSt7YY6gBBZLl0tX7UWSIc8mx4QGnGg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "Tried this Mala store for first time but was very disappointed. I picked a large piece of squid tentacles and fish meat along with other ingredients. After collected the cooked dish in a bowl, I already realized it was much less than what I selected. Going through I found only 2 small pieces of the squid and fish which did not make up the big pieces I selected. Some items are so hard while the instant noodle was soggy. Will not patronize again for sure.",
      "time": 1737885846,
      "translated": false
    },
    {
      "author_name": "Men in Black 2",
      "author_url": "https://www.google.com/maps/contrib/104072991053122590633/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU4BwPitRe6ce700XUXys1HFGrnYL_eNElVJKHZkAV2ywAs_poQ9Q=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "2 years ago",
      "text": "14 Aug 2022\nI came back here to eat the curry rice for takeaway. One fried fish, taugeh, fried egg, mince pork fried tofu. $5.50. Plus one yuan yang from drinks stall. Not too bad because got two meat. Taste is acceptable.\nMy wifey ordered Tom yum carrot cake, XO fried rice with pork cutlet. Quite heaty as I ate and got scratchy throat lol\nThe yuan yang in a cup is quite messy though. Too soft I press it spill out. The straw also so soft can’t push in easily. Use packet will be easier.\n\nI’m actually quite ok with the Hainanese curry rice stall. Not too bad in terms of taste and most of all the price I thought quite reasonable.\n\nFirst visit in July 2022\nThat’s what I ate for my brunch as I missed my breakfast. The curry/Nonya mutton with tumeric rice is priced at $6.80 so I thought if I ordered a la carte it would probably be the same. Nowadays economy rice is no longer economy 😂\n\nI was quite pleasantly surprised when I ordered plain rice, go lo yok, tau geh, fried egg. Only $3 something. Very fair. I added one more curry vegetable $4.40.\nThe drinks also ok lah. We had one yuan yang iced and kopi c. About $5.\n\nThe bak Chor Mee normal order is $4. Very reasonable.\n\nThe deco is also new and comfortable. Looks clean and not full of arid smoke. If I’m in the neighbourhood having lunch here is no issue I believe. It’s a simple and easy place to do so.\n\nEnjoy! ☺️",
      "time": 1660459422,
      "translated": false
    },
    {
      "author_name": "Ginger Bier",
      "author_url": "https://www.google.com/maps/contrib/101652262300830037879/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXPAnsdXHFUbRJnySVcbhfEt-w389-30iN5q3aYcWuUMulyst3j=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "3 years ago",
      "text": "Liking the new look for this coffeeshop :)\n\nHowever , my family tried a stall at this location called :\n海南咖哩仔\nWe would only give it 1.5 ⭐.\nThe only saving grace was the spicy curry and the keropok.\nAuntie was not attentive when I was standing there waiting for her to order and there were no other customers. Gave me a  small piece of pork cutlet when I pointed out another bigger piece to her. bear in mind I was the only one standing there and she was taking her time to pick and choose the smaller pieces even though I pointed to her the bigger piece which she picked at first then threw back into the pile then proceeded to chop the smaller piece to seal the deal.🙄\n\nMaybe that turned out to be a blessing coz the pork cutlet wasn't fantastic and coated with thick breading.\nThe mutton curry we ordered was decent actually.\nMeatballs were cold and meh.\nSotong had too sweet sauce and overcooked so they were rubbery.\n\nWe won't likely come back for the Hainan curry rice since the food seems to be left out for some time  BUT we will try other stalls .",
      "time": 1634477266,
      "translated": false
    },
    {
      "author_name": "Wee San Low",
      "author_url": "https://www.google.com/maps/contrib/104193174503991545162/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ2XmGAQsAEiej3_7Y6dxPXU9ivCDDly4X2RGrmstSdf64sEg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "3 years ago",
      "text": "This food court is a total renovated from the former coffee shop below a HDB. The place is currently new and clean. There are many varieties of food offered and the price is on a slightly higher end. Hopefully, the stalls will be able to maintain their business as the location, Holland Close, is quite deep inside the Holland neighborhood.",
      "time": 1633070779,
      "translated": false
    },
    {
      "author_name": "James Lim",
      "author_url": "https://www.google.com/maps/contrib/106010167895603930681/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJD3WYbBvBiQCLJazgCOPa6gOBTS9WWcrRnPAkQEJMP0rgyLQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "Just head to another coffeeshop\nThe only saving grace is king of fried rice stall.\n\nThe new Vietnamese drinks stall aunty has big time attitude issue.",
      "time": 1738210640,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6801393594438997254",
  "user_ratings_total": 25,
  "vicinity": "31 Holland Close, Block 31, Singapore"
}