{
  "formatted_address": "80 Barker Rd, Singapore 309937",
  "geometry": {
    "location": {
      "lat": 1.3199349,
      "lng": 103.8349402
    },
    "viewport": {
      "northeast": {
        "lat": 1.320821830291502,
        "lng": 103.8357321302915
      },
      "southwest": {
        "lat": 1.318123869708498,
        "lng": 103.8330341697085
      }
    }
  },
  "name": "ACS Oldham Hall",
  "place_id": "ChIJq6qq-uQZ2jERdfKH1sSDpl8",
  "rating": 3.2,
  "reviews": [
    {
      "author_name": "Wirawan Tiojaya",
      "author_url": "https://www.google.com/maps/contrib/110784423506194774909/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKOIuWd5Ggj83k-8EQJK5uGt4KVX5-R1ML4-s90PZv6GfOlRw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "Stayed here in 2008 for the whole year and it was one of the best year living as an international student.\n\nThe accommodations are modern, clean, and well-maintained, creating a comfortable and welcoming environment for students. The rooms are spacious and thoughtfully designed, offering plenty of natural light and functional furniture. The communal areas, including the lounge and study rooms, are perfect for socializing and group work, while the kitchen facilities are well-equipped and clean, making meal preparation easy and enjoyable. There were student activities and international events organized by the management for all of the boarders throughout the year.\n\nOne of the standout features is the attentive and friendly assistant hall masters. They are always available to assist with any issues and go above and beyond to ensure that all residents feel at home. The secure entry and on-site management provide a sense of safety and security, which is crucial for students living away from home.\n\nThank you ACS Oldham Hall!",
      "time": 1723361913,
      "translated": false
    },
    {
      "author_name": "Putu Erny",
      "author_url": "https://www.google.com/maps/contrib/116915658697504903159/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIb-gKLF9AUkjxhQsLh74t8ETK1YrEVIs2Ei3e8Fi3lr9hg2A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "ACS Oldham Hall has been more than just a boarding school for me; it's a place where I've grown, learned, and formed lifelong friendships. The warm and welcoming atmosphere, coupled with highly dedicated staff, has made my experience truly exceptional.\nThe best boarding school I've been to in Singapore!",
      "time": 1730175734,
      "translated": false
    },
    {
      "author_name": "An Siyue",
      "author_url": "https://www.google.com/maps/contrib/101968346136781358606/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUAhxl4CkRqGOCqS3z87T8cIP-4gVIFtBetmcQ3NIx59r7V90w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "My two years in ACS Oldham Hall are full of joy. Staff and AHMs are considerate and supportive. Having made lots of friends there and spending many unforgettable days with them, I’m really loath to part with them. Although I have to transfer to another boarding school, I’ll always miss OH and remember the happy experience while staying in OH.",
      "time": 1728651115,
      "translated": false
    },
    {
      "author_name": "Yindy Teh",
      "author_url": "https://www.google.com/maps/contrib/101302761980309936698/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLL0kARcSqLPA0ycL0fjh3NZzyDfGE4K7v2jCeJQbA0mzwU_vI=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Oldham Hall has always been my first home away from home since I came over to Singapore as a 16 year old. The place full of fond memories. Despite being on my own, I got over my homesickness fast thanks to the love and warmth showered by the Assistant House Masters/Mistresses here, they treated me as part of their family and we still keep in touch till date. Here, I was given the opportunity to pick up various skills, like playing guitar, choir, photography, video-making and even honing soft skills like discipline and leadership.\nIn my recent visit, I was quite impressed by the various renovation done, and slightly envied that the current boarders got to enjoy the very well-thought of, newly renovated features in the hall",
      "time": 1725114579,
      "translated": false
    },
    {
      "author_name": "Vincent Hui",
      "author_url": "https://www.google.com/maps/contrib/107295286828498393470/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJZ8PxRn4eNDj1bIuhJeD9ZBCaVvvoe2m8F8h8uipsbhS0mSQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "Stayed here in 2008 and enjoyed the experience. Laundry service, facilities, and the constant events organised by the hall-teachers were my positives of the hall.\n\nFrom my personal experience, this hall and its teachers are a sanctuary for foreign students who are away from their parents. It provides safe space for students to meet and connect with individuals from diverse backgrounds, some of whom remain close to me 1.5 decades down the road.\n\nThank you Oldham Hall.",
      "time": 1723607175,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "school",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6892341161173185141",
  "user_ratings_total": 81,
  "vicinity": "80 Barker Road"
}