{
  "formatted_address": "Bukit Timah, Singapore",
  "geometry": {
    "location": {
      "lat": 1.336198,
      "lng": 103.8156191
    },
    "viewport": {
      "northeast": {
        "lat": 1.337613830291502,
        "lng": 103.8168881302915
      },
      "southwest": {
        "lat": 1.334915869708498,
        "lng": 103.8141901697085
      }
    }
  },
  "name": "Adam Drive Colonial Houses",
  "place_id": "ChIJmZMAQgAR2jERijwGDpAbJgc",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Forest BK",
      "author_url": "https://www.google.com/maps/contrib/116448453673911455728/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL76LHGcdk_DWwI1Uwpxr5pFf5padq-ZcHhARkF7WFUdeyixQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "12 months ago",
      "text": "The black and white houses at Adam Drive were sited on the hill slope, slightly above the Adam Drive road. Most of them were single storey.\nBefore the lead up to the war, the British military started building their new HQ at Adam Drive. New houses were also being built for their officers. But before they could finish, the war broke out. The houses were not finished. Only the concrete platforms and drains were done. But they had to abandon it and retreat to Fort Canning as the Japanese invaders were closing in.\nDuring the Japanese Occupation, the Japanese took up their uncompleted houses and turned them into POW (Prisoners of War) camp housing the British and other POWs, including women and children. The British and Australian POWs were moved here from Changi Prison to build the Japanese Shinto Shrine at nearby MacRitchie Reservoir.\nAfter the war new, stone houses were built on the platforms to house the military.\nCurrently, SLA (Singapore Land Authority) had appointed Colliers International to manage some of these renovated Colonial houses for lease.\nNote: During the war, Adam Drive was known as Sime Road Camp.",
      "time": 1716528637,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=515129512905030794",
  "user_ratings_total": 1,
  "vicinity": ""
}