{
  "formatted_address": "120 Lower Delta Road, #10-12 Cendex Centre, Singapore 169208",
  "geometry": {
    "location": {
      "lat": 1.2802849,
      "lng": 103.822894
    },
    "viewport": {
      "northeast": {
        "lat": 1.281717180291502,
        "lng": 103.8242417302915
      },
      "southwest": {
        "lat": 1.279019219708498,
        "lng": 103.8215437697085
      }
    }
  },
  "name": "AddedEducation",
  "place_id": "ChIJGeHAkQ8Z2jER6K3rivAhLvQ",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Sanjana Rao",
      "author_url": "https://www.google.com/maps/contrib/114867371740664245085/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWHUjiHw6vm9cIrnqkflSM1ZjppEc5yNRhbZBYkhz5uXpT-loqV=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I couldn’t have asked for anything better than AddedEducation Counselors. Right from the start they were very supportive. From understanding my aspirations and passions to shortlisting colleges and guiding me in my applications and esaays, they have been super helpful. I’d like to thank the entire team for helping me build a strong profile for college. I’m excited to start my journey at Duke University.",
      "time": 1685610503,
      "translated": false
    },
    {
      "author_name": "Dhruv Maini",
      "author_url": "https://www.google.com/maps/contrib/112777092170204698675/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVsEYtGEeZRndJcP-Chq1NTHDf7aUeBMLNx8l_Fxxr236YMqFeWKQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Guys don’t go for this consultancy. Trust me, the person who contacted me for initial call couldn’t answer my questions and was moving in circles. After 15 minutes she said that she wouldn’t be able to move ahead with this and then the call ended.\n\nEdit: Answer to the firm’s reply.\n\nI don’t know how you understood that I am looking for a “free of cost” service, when I didn’t say that at all.\n\nYes, I agree, your firm spends a lot of time trying to find naive clients or people who simply don’t want a world class education and just want to go to average schools. According to your firm, clients can only thrive at average schools where your firm can actually get them admitted. I asked during the communication if your firm had any admits at any of the world top 10 schools for my course, and the answer was unsurprisingly “No”.\n\nAlso, I have communicated with a lot of firms during my admission process and you’re the one and only firm who supposedly “can’t proceed without parents’ consent”. Your firm called me first and then when I asked for more details regarding the conversation I was told that we can’t move forward without parents’s consent. Why did you call me in the first place then? 😂\n\nIf someone is legally an adult and capable of funding the education themselves ( or even taking a loan in their own name), who are you to say whether you need to be in contact with my parents or not? Of course my parents would’ve been a part of the process, this is not a small decision for anyone. But, I won’t disturb my parents for such a bad firm, who can’t even handle my questions, let alone my parents’s questions.\n\nIn a nutshell, your firm was incompetent, didn’t have knowledge, didn’t have any record of previous admits at any of the world top 10 schools for my course, and then you expect me to connect you with my parents. Sure, why not.",
      "time": 1685607757,
      "translated": false
    },
    {
      "author_name": "Chirag Chavan",
      "author_url": "https://www.google.com/maps/contrib/108518544418160827144/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKpXQKCgveBF0KuWnX5MAOdPU66HVv_-2-tRZL3agB3jH3HyQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I can’t thank team AddedEducation especially my Counselor who guided me in every step of my admissions to Columbia university. It feels like a dream come true. Thanks so much AE.",
      "time": 1685600551,
      "translated": false
    },
    {
      "author_name": "Neetu yadav nee2",
      "author_url": "https://www.google.com/maps/contrib/109941146886834835126/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocItDSAadE7_521ixl-Root4pLlssHgnGrjuHx3-oxh9U5MSEA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "AddedEducation has guided us the right away which we couldn’t get from the other Counselors we consulted earlier. I’m happy with the excellent service and their approachable Counselors.",
      "time": 1685609631,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17595038111189675496",
  "user_ratings_total": 4,
  "vicinity": "120 Lower Delta Road, #10-12 Cendex Centre, Singapore"
}