{
  "formatted_address": "415 Pandan Gardens, #01-117, Singapore 600415",
  "geometry": {
    "location": {
      "lat": 1.3207737,
      "lng": 103.748281
    },
    "viewport": {
      "northeast": {
        "lat": 1.322094780291502,
        "lng": 103.7495501302915
      },
      "southwest": {
        "lat": 1.319396819708498,
        "lng": 103.7468521697085
      }
    }
  },
  "name": "Ah Hua Teochew Fishball Noodles",
  "place_id": "ChIJc5voSDUb2jERgH8IuKAn6sI",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Michael TAN",
      "author_url": "https://www.google.com/maps/contrib/106408988733162382676/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVGAjuh8S8gbEqh5OkY7ZRGEQ0hL9kLAp_M0Sg1Y7RFF15DFWHj=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "a week ago",
      "text": "Overall, the Mee Pok is no big hype. The Mee Pok was cooked perfectly. But I felt that it’s a little too expensive. I ordered the medium and it cost me $6.00. The noodles took me 5 mouths to finish the noodles. I wish they would increase the noodle portion. I feel that the high price is because of the quantity of stuff in the soup like fish balls, prawn ball etc. The fish balls etc… are soft and spongy. So if you like the bouncy fishballs, this is not for you. My Kopi O kosong was $1.20 and if I wanted with ice, have to top up 40cents. If my other favorite Mee Pok shops are closed and I crave for Mee Pok, I would probably come here or choose something else to eat.",
      "time": 1747109053,
      "translated": false
    },
    {
      "author_name": "Zhenxi Ong",
      "author_url": "https://www.google.com/maps/contrib/115603941718627345391/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUNUfk1vHQM5IcFLsZaZ2amBQOpv0oWZoIQ6nmbZ5Nnt5BZl00V=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Friendly lady boss. Loves children. The Indian or Malaysia staff can speak amazing good mandarin. The signature is good. Sauce is simple and not too sweet. May be good for people who do not like strong flavour. Not spicy too. The mee Pok mee Kia is spicy and very good. The high lights are the hand made fish balls, meat balls and prawn ball. Very soft. Real fish meat. Rare good standard even among hand made fish balls. Delicious.",
      "time": 1745048899,
      "translated": false
    },
    {
      "author_name": "CK C",
      "author_url": "https://www.google.com/maps/contrib/114345555265183607362/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ0m70NQj0bnpa391gSdR9Fgk6LU3yy-v_P_hMWOqmVM9s3nYJM=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "Prawn rolls were exceptionally good.\nNoodles were delicious but not worth the long commute, long wait and high price. Waited for 50 minutes even though the place was less than 50% full. Prices were not clearly indicated. Staff were polite, although they could have helped with clearing the tables instead of relying on the customers to do the job.",
      "time": 1735984691,
      "translated": false
    },
    {
      "author_name": "SuperShades SG Sunglasses and Barbershop",
      "author_url": "https://www.google.com/maps/contrib/117050154147996934685/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXVOQ2y9YWlBLfrsTi1KTvK2Tk9T0AGZ98WPboJBILLZYRDCO9Ncg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Hi all , after all the hype and “hidden jem” reported by the millennial food influencers, I decided to give this famous stall another try after almost 8 years.\n\nI was greeted by many black birds hopping around the place and flies flying around the tables. Cleanliness is bad. Vegetables was placed right outside the toilet. Oh god. For the hype and  I paid higher price i expected food to be delivered by them since they have many helpers and place is small but they chose to use digital token system self serve. Bad.\n\nFor the long queue and you need to carrying bowls of hot soup, it is just accident waiting to happen. Do not recommend older people or kids to come. If you come during lunch prepare to sweat and wait and sweat. For your info medium is $6 and large is $8. Which is quite high for HDB kopitiam price with no aircon.\n\nFood taste is normal only barely even passable. My friends said during lunch time quality drops maybe because they are rushing. In my humble opinion, Many other places are better and with bigger portions. I would say their fish ball is ok a bit soggy,  wonder if it is like that for hand made. There is no visible difference between medium and large so when I went to ask, the lady with a black face just threw me a tiny tiny abalone which does not taste like one. Then an Indian lady said the noodles portion is more also. Looked the same as the medium my partner got. So no mistake . I joked that the noodles would be hardly enough for a hungry primary school kid. Some other patrons beside me burst into laughter.\n\nOverall this place is not worth the hype and time to travel. If you live nearby seems like no choice lor, nothing else similar within reasonable walking distance but I am pretty sure outside if u travel further there are better and cheaper choices. But like I said if u want me to pay premium for such small portions u got to work harder on the things like bigger fans, I not asking for air con, improve cleanliness, food safety and maybe a bit of service like bringing to the table. The soup Is hot and many customers are elderly so it makes sense to help them. safer also if there are kids running around.",
      "time": 1743044574,
      "translated": false
    },
    {
      "author_name": "Jeffery Hoo",
      "author_url": "https://www.google.com/maps/contrib/117662227856219289631/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU2auVXSJYeIWHC6Ay4G5YF7y-Op2s6LpN2NiZqwaONYqBei_q4=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "An excellent of bowl of fishball…. and I would stop at that - the fishballs were indeed outstanding, bouncy and full of flavors. It’s top notch. Prawn paste was cooked to perfection as well. These are excellent ingredients I would want for my hotpot. Alas the noodles are rather disappointing - overcooked and flavors are meh - the mix of chili and vinegar isn’t as robust as some of its peers out there. Maybe just get the soup version next time!",
      "time": 1743176319,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14045081959144128384",
  "user_ratings_total": 319,
  "vicinity": "415 Pandan Gardens, #01-117, Singapore"
}