{
  "formatted_address": "201 Chestnut Ave, #01-K1, Singapore 679525",
  "geometry": {
    "location": {
      "lat": 1.3717652,
      "lng": 103.779883
    },
    "viewport": {
      "northeast": {
        "lat": 1.373174630291502,
        "lng": 103.7811914802915
      },
      "southwest": {
        "lat": 1.370476669708498,
        "lng": 103.7784935197085
      }
    }
  },
  "name": "AIRE MTB (Chestnut Nature Park)",
  "place_id": "ChIJFbpNYQYR2jER6PTwvbEsKTk",
  "rating": 3.2,
  "reviews": [
    {
      "author_name": "Syafiqah I.",
      "author_url": "https://www.google.com/maps/contrib/116089352282595275359/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVKmJB7q1yGyWLUkhtg5BCelaA6ER9JrqXiuIzO-kh2ScJOyUs2=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "4 years ago",
      "text": "They don’t have many options and the ones that we got were not the best. I feel like the brakes don’t work that well and the tires have not much friction. But this was also my first time doing mountain biking so I may not know much.\n\nI rented just an hour, finished the trail within 45 mins. The cycling itself was fun so I might be back here to rent the bikes but I’m only doing that cos I don’t see any other alternatives haha",
      "time": 1609375858,
      "translated": false
    },
    {
      "author_name": "Hazel Yeo",
      "author_url": "https://www.google.com/maps/contrib/111431029362622389095/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIsUl7qtg8AvTXptop_noXk4Kr8L5Fi3wrgxtCtpp1GHrcjTQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "1st time trying mountain biking, challenging but exciting. Rented from AIRE MTB for 2 hours with reasonable pricing. Anthony was very helpful, our chain broke and he helped to fixed it and gave good advise on what to do as a first timer familiarising with the bike and terrain. He advises us to go southern loop and low gear, don’t fancy going fast especially at the beginning. Will rent from them again!",
      "time": 1640836282,
      "translated": false
    },
    {
      "author_name": "Sanghyun Lee",
      "author_url": "https://www.google.com/maps/contrib/107415244879251761229/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV1qxmHuGewlF4Uk-yndWRjVZuri0hXI8z3BQrLVViXRXvQISSVJQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 1,
      "relative_time_description": "5 years ago",
      "text": "Staff was kind and helpful. Yet, the horrible condition of the bicycle and the non sensible price ($18 dollars for one hour) make it just one star. I would not come here for the bike rental. I would come for drinks and or repair perhaps.",
      "time": 1580626343,
      "translated": false
    },
    {
      "author_name": "Spencer Phua",
      "author_url": "https://www.google.com/maps/contrib/103206652113995835065/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKrmvfVot-tSLDRAwRA4XomL0HIm7OAQ-n20hOIL92KmGOwMA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Paid $120 for 2 tier 2 bikes (hard tail) for 2 hours.\n\nBikes worth riding are tier 2 and up for the trails. I'd honestly not recommend trying the tier 1 bikes. Owner was brisk and upfront on price. Also very clear on the fact that if I broke the bikes, I'd have to pay for repairs. (Fair in my opinion)\n\nI got what I paid for. The 2 bikes felt lovingly maintained and performed excellently. Gear change was smooth, brakes worked excellently.\n\nEnjoyed the heck out of riding the trails. Well worth the expense in my opinion. At the end of the trails, I parked, had a good chat with the owner and left.\n\n10/10 would come again.",
      "time": 1635063312,
      "translated": false
    },
    {
      "author_name": "Doreen Tok",
      "author_url": "https://www.google.com/maps/contrib/108771389781936174085/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKWH5IQP7-3FvxwQ8uh8hQT5Il3vbI9PeWod-JXdPW9NVoJPVQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 years ago",
      "text": "Extremely disappointed by the quality of the bikes and service. The \"tier one\" bikes were rusty and in terrible shape. One particular bike we rented was nearly impossible to ride as the gear chain kept coming off despite us putting it back in place time and again. A biking trail that would usually take an average rider a maximum of 30 minutes become a long and arduous 2 hour journey for us as we had to dismount and physically push it most of the time.\n\nAs first timers on this trail it was difficult to estimate how far we have came along compared to the distance ahead of us. After going through 20 minutes of bumpy and wet trail, common sense was to trudge ahead instead of returning back.\n\nUpon returning back to the shack, we gave our feedback to the employee and he questioned our integrity by asking us why didn't we head back after 15 minutes of knowing there was an issue. By then we would have past many uphills, downhills and potholes, why would we turn back? Furthermore, if we did, we would be going against the flow of other riders which is extremely unsafe. And i do believe that it is evident enough that we walked more than we cycled by the duration we took to complete the trail.They should also probably be self aware of the quality of their bikes given the number of poor reviews on them.\nTo say the least, the employee was rude and was more concerned about winning an argument instead of resolving the issue.\n\nWould go back to ride again, but with our own bikes for sure.",
      "time": 1625508461,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4118872476114547944",
  "user_ratings_total": 60,
  "vicinity": "201 Chestnut Avenue, #01-K1"
}