{
  "formatted_address": "79 Robinson Rd, #01-03 CapitaSky, Singapore 068897",
  "geometry": {
    "location": {
      "lat": 1.2771267,
      "lng": 103.8479306
    },
    "viewport": {
      "northeast": {
        "lat": 1.278511580291502,
        "lng": 103.8492212802915
      },
      "southwest": {
        "lat": 1.275813619708498,
        "lng": 103.8465233197085
      }
    }
  },
  "name": "Akasa | North Indian Restaurant and Bar",
  "place_id": "ChIJHb8nsh0Z2jERM6DSok5ZvC8",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "SK Teo",
      "author_url": "https://www.google.com/maps/contrib/110440298807723121771/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKeXf_hhf8iTBrT3hgJmCEvTtkwAXbCLHOcTd8LKbOTCep6Vw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "The Asaka North Indian restaurant is located very near Tanjong Pagar MRT. It has a cosy ambiance, ideal for a relaxed evening with friends.\n\nWe started our meal with a scrumptious panipuri and masala chai which was thick and well-spiced.\n\nThe Mushroom Galouti Kebab offered a unique vegetarian option that melted in the mouth. The Mutton Seekh Kebab was fragrant and exceptionally soft.\n\nWe also had Butter Chicken which was creamy and savoury. The highlights of the meal were the Paronthia Naan, a signature six-layered naan with saffron and nuts and the off menu comfort food dish - scrambled cottage cheese.\n\nWe ended on a refreshing note with the Kulfi Falooda and lime juice.\n\nThankful for a wonderful evening with good food and even better company.\n\nWould highly recommend this place for a date or chill evening with friends!",
      "time": 1745419135,
      "translated": false
    },
    {
      "author_name": "Charlene",
      "author_url": "https://www.google.com/maps/contrib/105829945082656019557/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIXMC-aHGA2kMbbQGLkAZnIoG29Mv277IabNsLNwuRMF5hmrg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "It was our first time dining at Akasa, and we had an amazing experience! The flavors of their North Indian dishes are truly authentic. The ambiance is warm and inviting, making it a perfect spot for both casual meals and special occasions.\n\nAs newcomers to North Indian cuisine, we weren’t sure what to order, but the staff was incredibly friendly and guided us to the perfect selections without encouraging us to overorder. The service was top-notch and personalized, making our visit even more enjoyable.\n\nWe can’t wait to return and try more dishes!",
      "time": 1729912637,
      "translated": false
    },
    {
      "author_name": "Raja Dutta",
      "author_url": "https://www.google.com/maps/contrib/111819877060679553869/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV66-Wg6WkGhdbWQLJmvRV1vYlZXGgg-rTXuZRnxDeXazaoowJ-=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Akasa is definitely in the top bracket of Indian restaurants in Singapore. Great location and open layout with a glass wall keeps a positive vibe to the place. They have a diverse range of Indian cuisine. The one's I enjoyed in our team dinner are Mango Lassi, Daal Makhani, Mutton Biryani, Mutton Pepper Fry, Chicken Kebabs, and the Kofta. Special callout for 3 dishes - (1) Mango Lassi - In most Indian restaurants I find the Mango Lassi too thick and viscous and gets heavy with the food. The Mango Lassi in Akasa was a standout. Mild flavour, just the right sweetness, and the right thickness. (2) Daal Makhani - This is a tough dish and many restaurants in India also struggle with this dish. Just the right level of richness in the Daal Makhani and their freshly made naan, parathas made it a good combination. (3) Dum Biryani - The Mutton Biriyani is definitely a worthy try. The genuine dum and tenderness / flavour / rice were a great experience on the taste buds. The breads served were an assortment and freshly prepared. They also have an interesting twist to their dessert which you should unveil when you visit the restaurant. Overall amazing hospitality of the staff. Keep up the great work.",
      "time": 1741947772,
      "translated": false
    },
    {
      "author_name": "Nihit Mohan",
      "author_url": "https://www.google.com/maps/contrib/102748893564119019136/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX5HmiKXXtDwSMnXcru5P1r337kpuVDsTKRBC9QctIIAupOdrFY=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Finally, a good Indian Option in CBD Singapore. Akasa Singapore is a top-tier Indian restaurant that excels in flavor, ambiance, and service. It's perfect for a refined dining experience, whether you're celebrating a special occasion or simply indulging in quality Indian cuisine or even bringing your clients and teams. With minor improvements in portion sizing and vegetarian options, it could further solidify its position as a must-visit dining destination in Singapore.",
      "time": 1740745385,
      "translated": false
    },
    {
      "author_name": "Harveen (Saluja)",
      "author_url": "https://www.google.com/maps/contrib/105038044860954881656/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL0-1_dlPZkwPMYW1_HNPbBeceXpIjkq5_yUbhGEKuqqct3wg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Went on a Friday evening, loved the vibe and the food. The food presentation was extremely attractive and the food had that ghar ka taste. From the chaat, to the juicy paneer tikka and mutton kebab. The saag was a pleasure to have. All in all was such a great evening. Will definitely be back!",
      "time": 1743916032,
      "translated": false
    }
  ],
  "types": [
    "meal_takeaway",
    "bar",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3439722409678250035",
  "user_ratings_total": 123,
  "vicinity": "79 Robinson Road, #01-03 CapitaSky"
}