{
  "formatted_address": "1G Cantonment Rd, #01-07, Singapore 085701",
  "geometry": {
    "location": {
      "lat": 1.2755371,
      "lng": 103.8412516
    },
    "viewport": {
      "northeast": {
        "lat": 1.276909830291502,
        "lng": 103.8426608802915
      },
      "southwest": {
        "lat": 1.274211869708498,
        "lng": 103.8399629197085
      }
    }
  },
  "name": "Alfa H Mart",
  "place_id": "ChIJudI6b2wZ2jERhryOvIWndFM",
  "rating": 3.5,
  "reviews": [
    {
      "author_name": "K M",
      "author_url": "https://www.google.com/maps/contrib/110369307508109927121/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLVvTELyXAbfnMmvgCnNdUuv_hmUowvEC2auAX_p9prm4ACcZ0=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Bought an item off of grab mart. They do false advertising. I received an item that is totally different from the photo. The item I received is a very poor quality product. Do not give business to this business. Poor ethics. They deserve to be out of business.",
      "time": 1745053818,
      "translated": false
    },
    {
      "author_name": "Sam",
      "author_url": "https://www.google.com/maps/contrib/113473124941723004003/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUXYddt52awxqGEp1ClN-lrh3u0_4CwFBYl99EXjiT5d-wUCCY=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "Just watched the cashier try to rip two young boys off. The young lads were coming home after football practice and wanted a cold drink. Both looking for a drink (dead obvious that they're buying together), the first boy gets to the counter with a $1.50 drink and within a moment the cashier has mumbled $5 minimum for card and then the encourages a card tap, the young man taps with confusion on his face. The second boy arrives to the cashier 2 seconds later with a $2.50 drink to try and pay together, but the cashier has already tapped the first $5 minimum and then tried to charge the second boy $5 before I intervened.\n\nHe tried to charge them $10 for around $4 worth of drinks.\n\nBe careful, I've been shopping here for >12 months and I'm not at all surprised by this behaviour.",
      "time": 1736067701,
      "translated": false
    },
    {
      "author_name": "Niharika Kohli",
      "author_url": "https://www.google.com/maps/contrib/116604207229871770514/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW1tYcV9FpCazZc2Bka4Lw9tRyzYSo-T3R_LyytSCeQ2gygv20Q=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Update: I’ve noticed a marked improvement in this store’s organization. More items have prices on them. There is more tidiness and it is easier to find things. I think there’s new owners running the place now. The customer service can be better though.\n\n——————————————————\n\nOlder review: It is incredibly convenient having a store that stocks Indian items very close by but I have to admit they are not very good at organizing or managing things. Most things are not labeled with prices. They are always understaffed. And often the quality of the goods is not up to the mark (expired or rotten).\nI implore the management of the store to try to do better.",
      "time": 1734352575,
      "translated": false
    },
    {
      "author_name": "Javen Leow",
      "author_url": "https://www.google.com/maps/contrib/103533744765056843646/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWTLUpcDbqWof7KrapjPymL5t189mndtX6g4MyUOGkEK0KueC3_=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Good grocery store to shop in. This shop has shelves dedicated to Indian groceries such as spices; however they also stock other products like drinks and a few electrical appliances.\n\nThere's a small corner away from the cashier where produce such as vegetables are sold.\nA fridge next to the cashier sells drinks and other beverages like lassi.",
      "time": 1728277844,
      "translated": false
    },
    {
      "author_name": "R Yap",
      "author_url": "https://www.google.com/maps/contrib/112159169227060576833/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKUNbALYqgwHRhDlpB7kwhyQ-usWx62qfng3e4x2ynEXiDRxEM=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "1. Came once and paid using card, and the cashier charged me the wrong (higher) amount on my purchase, which I only realized after I left the store. When I went back the same evening to address it (showing the paper receipt and the  wrong charge on my statement) the man was utterly unhelpful, denying that his colleague charged me wrongly, and refused to help me, and I had to resort to my bank for the refund instead.\n2. Came a second time months later to drop off a Ninjavan returns parcel. The guy took it but could not send me a confirmation receipt even though I kept asking for one, even handed me the phone and told me to try and figure it out myself, and told me the receipt will be sent to me eventually. I later found out that this place does not do returns parcels so I had to go back and get it and drop it off somewhere else.\n\nWhy does this place still exist? The store always smells bad and the guys taking care of the counter are incompetent. And you know what, incompetence is one thing bc maybe we are all learning as we go, but my god they’re also so RUDE!!!! Especially after wasting a bunch of your time because of their incompetence, adding insult to injury. Pls be better!!!!!",
      "time": 1733291982,
      "translated": false
    }
  ],
  "types": [
    "supermarket",
    "grocery_or_supermarket",
    "store",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6013615595282414726",
  "user_ratings_total": 66,
  "vicinity": "1G Cantonment Road, #01-07"
}