{
  "formatted_address": "101 Irrawaddy Rd, #12-12 Royal Square Medical Centre, Singapore 329565",
  "geometry": {
    "location": {
      "lat": 1.3206053,
      "lng": 103.8432372
    },
    "viewport": {
      "northeast": {
        "lat": 1.322038230291502,
        "lng": 103.8445538802915
      },
      "southwest": {
        "lat": 1.319340269708498,
        "lng": 103.8418559197085
      }
    }
  },
  "name": "Alpha IVF Centre & Alpha Women's Specialists",
  "place_id": "ChIJZ61a4r8Z2jERQsAZJLSp4j0",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "F L",
      "author_url": "https://www.google.com/maps/contrib/100138408660772789985/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXP5ln6lDHvEbDZZrKAKuoisi7hZKS7nvaM5SyTz8JsBJhl8fQn=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Dr. Lily Kho is an exceptional gynecologist. She helped us navigate through a very challenging pregnancy with such professionalism, patience, and care. From the very first appointment, she made us feel comfortable and reassured, which was exactly what we needed during such a stressful time.\n\nHer knowledge and expertise are unmatched, but it’s her personal touch, -her calm, kind, and even funny demeanor-, that truly sets her apart from others. She took the time to explain everything in detail, never rushed us, and always made sure we felt heard and supported.\n\nWe are incredibly grateful for all her help and advice throughout this journey. We wholeheartedly recommend Dr. Kho to anyone looking for a compassionate and skilled gynecologist.",
      "time": 1745043835,
      "translated": false
    },
    {
      "author_name": "Cheryl Berylla",
      "author_url": "https://www.google.com/maps/contrib/117067559990329926935/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL9Rzk57p6E3lqUAxQ_fjLAY-NmlS8ZVouchzif9wXr0SGotA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Doctor Chua Ka-Hee is the best doctor you could ever had. He’s a skillful OB-GYN and fertility specialist whom is always very assuring and patience answering my doubts and validating my worries.\n\nHe’s also friendly, genuine and has good bedside manner. He doesn’t rush through consultation and  very approachable; someone you can talk about your medical problems to without any stress. I’m always looking forward for each appointment.\n\nWe did IVF under him, and all transferred were successfully implanted and had our child deliver by him too. From conceiving to delivering our baby, we knew we were in good hands. Doctor Chua has gentle hands; FET are done smoothly and painlessly, and all were successfully implanted which resulting to positive pregnancy.\n\nDuring my pregnancy, he is very detail and accurate in his scans and calculation of baby’s weight too as we were planning when to induce our baby due to some pregnancy complications. He did assure me that he will be there for my delivery and he did what he said. As he was in kkh back then and he was busy running consultation in clinic, he even send his team doctors to check on me until he was available to come over to see me in the labour ward. He spend the whole friday evening with us when I had active labour and he delivered my baby safely into my hands. I had 2nd degree tear due to natural delivery, he patiently stitch for me which was beautifully healed without any scars. He even came to the ward to check on me over the weekends during my stay in hospital.\n\nEven during days when I see him for my miscarriage, other than managing the medical aspect of such unforeseen situations, he is empathetic and always there to listen. My concerns and thoughts are always heard and address by him with compassion.\n\nI’m really blessed to have Doctor Chua as my OB-GYN. He is someone you can really count on for fertility issues with all his knowledge and excellent skills he has as a surgeon.\n\nI was his patient at kkh and now followed him to Alpha. Grateful to have Doctor Chua all these years assisting us in our ttc days.  He is very skillful which something we can’t deny, and always putting patient  interest first. Definitely we will want Doctor Chua to deliver when we manage to conceive again.",
      "time": 1740751874,
      "translated": false
    },
    {
      "author_name": "Bei Jia",
      "author_url": "https://www.google.com/maps/contrib/109063594946602896088/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKW7KxfqC1GXOZjkI3WU2Ka_tKVWpDgvOJLNm-0Kbo-lrpk_w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Thank you Dr. Chua Ka-Hee for being our gynaecologist!\n\nFrom the start, he had been reassuring and supportive every step of the way. Each consultation was unhurried and he always took his time to address our concerns with patience and care.\n\nDuring the cesarean, Dr Chua’s calm and encouraging presence made a big difference. The procedure went smoothly and the recovery was easier than we had anticipated. We’re truly grateful to have had such a composed and confident doctor by our side throughout this journey.",
      "time": 1746515567,
      "translated": false
    },
    {
      "author_name": "Fiona Xie",
      "author_url": "https://www.google.com/maps/contrib/117844916283821578909/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXbLfRh_Tk6oLEFDzz2sGdsaHkZFXquutSuJtPMMOTTtpSQIKMr=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "I want to thank Dr Chua Ka-Hee & Nurse Rahmah for assisting me every visit.\nI did my very 1st IVF with Dr Chua Ka-Hee at KKH, I was his last patient before he going over to Alpha. He told me anything can just go find him. Which I did, as some mishap happened. Thank goodness, he help me thru this difficult times. I’m super thankful to him to help me and gave me a miracle baby which I’m gonna see in a month or so.\nNurse Rahmah is so friendly and kind, making me feel so welcome and was there when I’m lost or needed help.\nI am super super thankful for these 2 kind hearted human! Once baby is born I will tell him that this 2 kind soul. One created you, the other guide & helped mama till the end.\nIt’s a bit shame that I couldn’t have Dr Chua to deliver for me, maybe hope in the future if I’m gonna have another baby I will wish he will be my gynae again.\n\nThank you again!",
      "time": 1747279297,
      "translated": false
    },
    {
      "author_name": "Bruce Liang",
      "author_url": "https://www.google.com/maps/contrib/116918278276527601904/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLyihMcLog43EgcXj-wwgCBFmL7oD1aR-AK_FpqIdS1Krxz6g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Amazing care and services by Dr Lily and her team of amazing nurses. We are happy and grateful to her for helping my wife go through her first trimester smoothly despite having minor complication. Now she is in her second trimester and is doing well. Highly recommended to whoever is looking for a gynaecologist to consult Dr Lily.",
      "time": 1741922238,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4459313172215087170",
  "user_ratings_total": 87,
  "vicinity": "101 Irrawaddy Road, #12-12 Royal Square Medical Centre"
}