{
  "formatted_address": "524A Jelapang Rd, #03-01 Greenridge Shopping Centre, Singapore 671524",
  "geometry": {
    "location": {
      "lat": 1.3853755,
      "lng": 103.7663006
    },
    "viewport": {
      "northeast": {
        "lat": 1.386711030291502,
        "lng": 103.7676747302915
      },
      "southwest": {
        "lat": 1.384013069708498,
        "lng": 103.7649767697085
      }
    }
  },
  "name": "Amazing Star Montessori House",
  "place_id": "ChIJF9AEVJgR2jER6vSYNysn5Oc",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Chloe Fam",
      "author_url": "https://www.google.com/maps/contrib/109898042363187074943/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKnVY8CL3guk7TKWSFVtlzrOYT2R0znJ7uCq_Nqv5vvEdsvEw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "I am thrilled to share how much Isabelle looks forward to going to Amazing Star every day. After experiencing several schools in different areas due to our relocations, I can confidently say that Amazing Star stands out as the best. The school syllabus is advanced and rich compared to others, providing an exceptional learning experience. Additionally, the focus on morals and manners is truly commendable.\n\nThe food is another highlight—Isabelle always raves about how delicious and healthy it is, often asking for second helpings. The school’s care for the children extends beyond education, as they provide daily showers and wash their hair every other day, a service we haven’t found elsewhere.\n\nThe teachers are very experienced and have been serving the school for many years, which adds to the stability and quality of the education provided. They also provide us with monthly reports on Isabelle’s progress, which helps us stay informed and involved in her development. There is also a good number of staff to ensure there is enough manpower to take care of all the children, which is something we didn’t find in the previous two schools Isabelle attended.\n\nThe variety of enrichment classes adds an extra layer of fun to Isabelle’s school day. I highly recommend Amazing Star for its outstanding curriculum, dedicated staff, care, and overall environment.",
      "time": 1721889241,
      "translated": false
    },
    {
      "author_name": "Rasaporn Sampachanya",
      "author_url": "https://www.google.com/maps/contrib/107379703622212691163/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL-gxSZ7BNWVh7attLWuGCnPXKVTUlo0-AB9zcu2mkH2ItaBA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Highly recommended childcare for our lovely kids! Very good and attentive teachers. Homey environment. Montessori curriculum, which supports the child's growth and learning.\n\nMy elder son who's now in P1 still misses his memorable times at Amazing Star. It had been truly a second home to him. Now my younger son is in nursery. He loves going to school and has never cried on any school day since day1!",
      "time": 1732983037,
      "translated": false
    },
    {
      "author_name": "Jocelyn Tan",
      "author_url": "https://www.google.com/maps/contrib/114107174578555050180/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI-zjj6feclc_MHmwho4NOZVvaR6klj42R2_yjL9WOb_1vENQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "My kids attend Amazing Star (Greenridge) and we are very happy to say that this school is amazing!\n\nThe centre principal Tr Jaz, teachers and aunties are all very professional, dedicated and friendly. Special mention to Tr Shereena and Li Laoshi, they are passionate in what they do and they always make learning a fun and creative experience for the kids. Both my kids love them so much and truly enjoy their time in school and look forward to the activities, excursion and celebrations.\n\nWe are glad that we made the right choice to send both my kids to Amazing star! :)",
      "time": 1729172036,
      "translated": false
    },
    {
      "author_name": "Farn Sharkieboy",
      "author_url": "https://www.google.com/maps/contrib/113290003951942050786/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLhtkwDzCNuf17zWj3RFLQ2Jt-5nlVkyE06_qTsYzUIlcX_xQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "Amazing Star Greenridge is truly exceptional! As parents, we feel completely at ease sending our daughter to this school. She loves going to school and is always happy when we pick her up. The teachers show genuine care and concern, often giving hugs and radiating warmth. We couldn't ask for a better environment for our child.\n\nKudos to all the AMAZING teachers and staff! We see and appreciate all your efforts ♡",
      "time": 1721951479,
      "translated": false
    },
    {
      "author_name": "Terry Teo",
      "author_url": "https://www.google.com/maps/contrib/103298399111202045860/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJoFl_dQbbGsQIwth_fkTtCP33AFl9Lw-Ncg7HvMHq1AJsEdw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "We enrolled both our daughters into Amazing Star and we are very confident with the teaching staff and the overall environment. My younger daughter is still in K1 and Teacher Shereena and Li Laoshi have been nothing short of amazing. The fact that they always inform us even if it is just a knock on the table gives us huge assurance that our girl is in very good hands. My girl has been progressing well under their teachings too. The aunties are very pleasant and my daughter loves the cooking. I'm really glad we made the change from another school and my elder daughter still has the fondest memories there even after she has left for P1 this year.",
      "time": 1722047704,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16709523584021230826",
  "user_ratings_total": 27,
  "vicinity": "524A Jelapang Road, #03-01 Greenridge Shopping Centre"
}