{
  "formatted_address": "30 East Coast Road Mall, Level 3 Unit 20 Katong V, Singapore 428751",
  "geometry": {
    "location": {
      "lat": 1.3037401,
      "lng": 103.9028757
    },
    "viewport": {
      "northeast": {
        "lat": 1.305070430291502,
        "lng": 103.9041747802915
      },
      "southwest": {
        "lat": 1.302372469708498,
        "lng": 103.9014768197085
      }
    }
  },
  "name": "Amber Family Clinic",
  "place_id": "ChIJMyQ0dr8Z2jERaRGLf-YnDQc",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Princess Iu Yu",
      "author_url": "https://www.google.com/maps/contrib/109156681813324871958/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLQfeSpTTGzcR8tLrPfSPXQspczzM9tRJYmORKJfOpxBJMyXg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I’ve seen many doctors and this is my first visit to the clinic today, also first time ever doing a doctor review. I’ve been unwell for 3 weeks (seen other doctors prior). Dr Wong took the time to listen to all of my concerns without rushing, asking thoughtful and detailed questions to fully understand my situation. Her thoroughness in explaining my diagnosis and made sure I understood everything clearly and answered all my questions with patience and care.\n\nWhat truly stood out was Dr Wong attention to detail ensuring that every aspect of my health was considered. Her calm and reassuring demeanor made me feel comfortable and confident in her care. It’s rare to find a doctor who combines such expertise with genuine kindness and patience.\n\nIf you’re looking for a doctor who truly cares and takes the time to provide exceptional care, Dr Wong is the one. I’m so grateful to have found her!",
      "time": 1740707433,
      "translated": false
    },
    {
      "author_name": "Evelyn Teo",
      "author_url": "https://www.google.com/maps/contrib/104006184237169775964/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK50Q4JElBdkI5JqIII2klv3NHn4THzzezNd7MiDSFFMR6xj7Y=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I had a wonderful experience at this clinic with Dr. Wong. I was searching for a place with flu vaccines since cases have been rising, and I was impressed by how prompt their response was. The nurses were polite and efficient, making the process smooth from the start.\n\nDr. Wong, in particular, was incredibly patient and kind. My daughter was very reluctant to take the jab, and instead of rushing us, Dr. Wong took her time to comfort her. She hugged her  never once showed any impatience even though it took us over 20 minutes to pacify her. Her warmth and care truly made a difference, and I’m so grateful for her professionalism and kindness.\n\nHighly recommend this clinic, especially for parents with young children! Thumbs up to Dr. Wong and her team!",
      "time": 1739374212,
      "translated": false
    },
    {
      "author_name": "Amin Shariati",
      "author_url": "https://www.google.com/maps/contrib/114498484737792637697/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVh_YwMkT_QkePxif0KPCLI7juFwbQCAZj2-UpPQC2SL-UmM19tuA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I had a very good experience at Amber Family Clinic. The staff are very friendly and attentive, making the visit smooth and comfortable. I was seen by Dr. Wong, who is excellent—she is patient, took the time to understand my concerns, and explained everything in a clear and detailed manner.\n\nI also did my health screening here, and I really appreciated how Dr. Wong went through each item with me, ensuring I fully understood my results. The clinic itself is easily accessible, which is a plus.\n\nOverall, I’m very impressed with the service and would definitely recommend this clinic to anyone looking for professional and caring healthcare.",
      "time": 1738549196,
      "translated": false
    },
    {
      "author_name": "5 fur",
      "author_url": "https://www.google.com/maps/contrib/112663258156254816763/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKSjVrydfbiIWNWFoahPolOK8SpfuZUMzriDCC9bAVnjg1hZg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "My family member had good experience after a recent visit to the clinic so I came to this new clinic at katong village ( above ntuc ) instead of my regular clinic at marine terrace . Doctor Wong is detailed and cares for her patients. She followed up with me personally via WhatsApp to ensure I return for my review and then recommended me to go for my 2nd review with a specialist . In addition she also WhatsApp me to see and if I had gone to see my specialist . She has done more than what I had ever expected and imagined. So this is the kind of doctor I will rely on and she has set gold standard on what to look for in a family doctor . Thank you Doctor !",
      "time": 1741198263,
      "translated": false
    },
    {
      "author_name": "YR J",
      "author_url": "https://www.google.com/maps/contrib/116588766637493061141/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIVrzBifmPJEfk3pYDktmBB2ga3eyNZznl3dXzVi0mG8nXRxw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 weeks ago",
      "text": "Terrible time management. I had an appointment booked for 1130 am, but ended up waiting until 1220 pm with no updates. When I finally asked, they told me there was still another patient ahead who had booked at 1045am and hadn't been seen yet! I had to leave and find another clinic because my child was already exhausted and overdue for her nap. This was our first visit and definitely the last. If you have an hour or more to waste this might be the place for you. Otherwise, avoid.",
      "time": 1746426246,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=508106203898515817",
  "user_ratings_total": 16,
  "vicinity": "30 East Coast Road Mall, Level 3 Unit 20 Katong V"
}