{
  "formatted_address": "4300 Ang Mo Kio Ave 6, Singapore 569842",
  "geometry": {
    "location": {
      "lat": 1.3748331,
      "lng": 103.845503
    },
    "viewport": {
      "northeast": {
        "lat": 1.376102780291502,
        "lng": 103.8469449802915
      },
      "southwest": {
        "lat": 1.373404819708498,
        "lng": 103.8442470197085
      }
    }
  },
  "name": "Ang Mo Kio Public Library",
  "place_id": "ChIJ____L-gW2jERhNi3iyGZ39w",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Jacelyn",
      "author_url": "https://www.google.com/maps/contrib/111010667983647437264/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIuKYvM5xGFgQcAbGEHfsmCTARLaZkbPUKCQ0NiPMvzpYESKw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "The librarian Fadilah is so helpful, kind and approachable. I tried to search for a few books by the shelf no could not allocate it. So I approach her and she went through all the self with me to search one by one for the books I want. Excellent service. It makes my day",
      "time": 1743303567,
      "translated": false
    },
    {
      "author_name": "Nirmal Balasooriya",
      "author_url": "https://www.google.com/maps/contrib/106413501068372675984/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUIQg47bOiuG5BiHR1YaiF6XVcHUnHByhQFneL3n3veowOn8gm1=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "The location may not be the most convenient, but it offers a quieter atmosphere with fewer people compared to other malls or libraries near MRT stations. While it may lack the modern aesthetics of newer libraries, it compensates with ample space. Additionally, there's a cafe for those who enjoy a peaceful coffee or meal. Booking a study table online is now possible, though the system could use some improvements. Luck plays a role in securing your preferred timeslot and seat number, as the availability status may not be entirely up-to-date.",
      "time": 1703924294,
      "translated": false
    },
    {
      "author_name": "Joshua Chew",
      "author_url": "https://www.google.com/maps/contrib/100928805220966571942/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVqNrQqhJfCpzz6Zq4B5AAPGoXCZJYHEkFcMYWGWtFbXZLH7xm6Cw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "A nice public library. The library was quite secluded, and is about 1km walk from Ang Mo Kio MRT station. The library is 2 storeys high, and it's quite a quiet library with fewer patrons during off-peak hours. There were quite a number of empty tables at the Adult Fiction Section and power points were quite readily available. There was a water cooler at the 2nd storey. The place is highly recommended for students and readers who want a conducive environment. However it was slightly inaccessible and had some problems navigating from outside. But overall, I had a pleasant experience. Would come back again.",
      "time": 1683023966,
      "translated": false
    },
    {
      "author_name": "Harry Ng Kok Jing",
      "author_url": "https://www.google.com/maps/contrib/117559906518166100684/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKG93VOvMZBOyqC7sClKTVlc-ns5cvyhF_rvsZ3LmZLU9m1gA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I was studying at AMK NLB, when the person who was sitting at my table took my charger by my mistake after she left. I approached the staff for help and they were able to swiftly locate the person and retrieve back my laptop charger. I want to thank the NLB staff for this.",
      "time": 1745143266,
      "translated": false
    },
    {
      "author_name": "Xoom Too",
      "author_url": "https://www.google.com/maps/contrib/105863133358477079886/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVLRzhuxFKh1jOBQiJLb1bjferwZ-xPRZ7v7ReqgRp2P_uVyh9Y4Q=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "3 years ago",
      "text": "My rating: 4/5\nWhat I like in libraries: Books that are available that I originally have on my online To-Be-Read (TBR). Spacious environments. Multiple book genres.\n\nThe Ang Mo Kio library is very easy to find once you use Google maps. I think the library is an OK library, not horrible, not perfect. There are two levels. The first level has a children's section and adult fiction books. I'd say the adult fiction section is actually really nice. I read through a few of the books and I took multiple pictures to basically remind myself to check them out again.\n\nThe children's section isn't really a room; it's just some shelves out in the open. The second level has young adult books. The selection had some books that I've already read, and a lot that I have on my To-Be-Read (TBR).\nThere are some Chinese magazines, English fiction books, and Chinese books. More in the corner, there is a space where there are multiple black seats spaced apart. The second level has two tables with computers originally on it, and 6 seats for each of the tables.\n\nThere is a quiet reading lounge, and at the time I was there, there weren't that many people. But the layout is really nice because there are 9 seats where you can use your phone, read, and listen to an audiobook. But there’s also a few desks with seats where you can read, and maybe use your computer.\n\nOverall, I think that the Ang Mo Kio Library is very well organized, spacious, has a nice quiet reading lounge, nice children’s section, and a good place to use your computer and read.",
      "time": 1643094953,
      "translated": false
    }
  ],
  "types": [
    "library",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15915607977507674244",
  "user_ratings_total": 326,
  "vicinity": "4300 Ang Mo Kio Avenue 6, Singapore"
}