{
  "formatted_address": "6 Ang Mo Kio Street 22, Singapore 569362",
  "geometry": {
    "location": {
      "lat": 1.3672319,
      "lng": 103.8426326
    },
    "viewport": {
      "northeast": {
        "lat": 1.368602630291502,
        "lng": 103.8439745302915
      },
      "southwest": {
        "lat": 1.365904669708498,
        "lng": 103.8412765697085
      }
    }
  },
  "name": "Ang Mo Kio Secondary School",
  "place_id": "ChIJQSLoaN4W2jEREKEaoTFSjXA",
  "rating": 3.6,
  "reviews": [
    {
      "author_name": "leezy banks",
      "author_url": "https://www.google.com/maps/contrib/112567063495611510217/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIqHetziWl4YrkTTKM9TEpba8FA_Nno98BiFtaiwMxCBOnzAQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "i heard from my cca teacher that some teachers in the staff room will talk about u behind the back.and the teachers all dont teach properly and i had to rely on myself studying. for prelim i got L1R4 30 and for O level i got L1R4 17. i feel like thats a good improvement but however during my results day,my teachers didn’t say any words of encouragement instead they just hand me the results and thats it.I dont think thats professional as a teacher because till this day i cant get that out of my head,like i feel like when a student had that type of improvement,they should be complimented.and also speaking about my prelim.after i got my prelim results or WA results (i couldn’t remember which) me and my form teacher (ms ong) had some 1 to 1 conversation,i didn’t remember what we talked about but i remembered she said “if i carry on like this id go to ITE”.i feel like this remark is very unnecessary and unprofessional for a teacher,and till this day i cant get that out of my mind.even my mother was angry for her to say remarks like that (PS — i didnt end up in ITE,im now in SP business school ). I didn’t really have any fond memories going to this school and i know for a fact im not going to bring my future kids to this school. i really didn’t thought ill be writing this but i just had to get that out of my chest. overall this school is very big and there are many equipment that your child can use after school, such as the gym,the basketball court and foods field.i really hope that students receive constructive feedback rather than criticism .to whoever reading this,i have really nothing against this school,i was just saying my experience, enrolling your kid is truly your decision\n\nWritten by Stanley.D (4/2 2024)",
      "time": 1743659720,
      "translated": false
    },
    {
      "author_name": "Fayth Chan",
      "author_url": "https://www.google.com/maps/contrib/116954424474601918157/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUaAyPiAh6jBnycB4CCPg3nTJ_zZA1yGX8Lt7ZTFwsK-cOBNoJb=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "6 years ago",
      "text": "The definiton of a neighbourhood school, but it is simply better in most ways! There are a lot of additional facilities for the students such as a grand piano and a gym for. They also recently added a room with board games and other fun activities for students to engage in! The only downside is that the toilets are sub-par and the choice of food in the canteen is very limited. It also has amazing performing arts CCAs!",
      "time": 1542881844,
      "translated": false
    },
    {
      "author_name": "William Lee",
      "author_url": "https://www.google.com/maps/contrib/105655517848208987917/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXbQPr8IUkFo-42aVcUv9f4AXRn7VSQVogPZ5nmP37fOEc04_8JGg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "4 months ago",
      "text": "This school is big but some teachers are biased. Has a variety of CCAs but the toilet has no toilet paper inside each cubical.",
      "time": 1736407021,
      "translated": false
    },
    {
      "author_name": "Sein Lee",
      "author_url": "https://www.google.com/maps/contrib/111223774665335363276/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLObfq0faXrcbnln2b32KQBFbbAYsYahNU6Pk6Uk6CO6Izn4A=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "School toilets are dirty , students are unruly and school looks atrocious. The new toilets do not have benches for students to put their stuff to change on. Many teachers cannot teach. Do not reccomend this school",
      "time": 1735654516,
      "translated": false
    },
    {
      "author_name": "HOLY MACARONI MAMMAMIA",
      "author_url": "https://www.google.com/maps/contrib/105847503645320438194/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVA5adUnL3WC5rBuhFVrn7ak7LE9yUKXONfuyGU3eiCGbvHrJEu=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "a year ago",
      "text": "I got called autistic by people that I don’t even know, for wearing sunglasses in preparation for learning journey. Too much bullying and students who talk about inappropriate stuff. The Chinese teachers are so chaotic and the classes too. The students act like literal monkeys (including me). People were judging me for no reason (at least I think it’s for no reason). There are many nice teachers and many problematic ones. The food is okay and the prices are fair. Classes way too dirty that once I slide the side of my shoe against the ground, the whole entire shoe becomes grey. There are Irresponsible, toxic students that litter all over the place.",
      "time": 1706280219,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "school",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8110228877073883408",
  "user_ratings_total": 50,
  "vicinity": "6 Ang Mo Kio Street 22"
}