{
  "formatted_address": "17 Ang Mo Kio Ave 9, Thye Hua Kwan Hospital, Singapore 569766",
  "geometry": {
    "location": {
      "lat": 1.3840204,
      "lng": 103.8396755
    },
    "viewport": {
      "northeast": {
        "lat": 1.384949580291502,
        "lng": 103.8415007802915
      },
      "southwest": {
        "lat": 1.382251619708498,
        "lng": 103.8388028197085
      }
    }
  },
  "name": "Ang Mo Kio-Thye Hua Kwan Hospital",
  "place_id": "ChIJdeglPr8W2jERxZe-u-hFSqc",
  "rating": 3.4,
  "reviews": [
    {
      "author_name": "DR DAVY GOH",
      "author_url": "https://www.google.com/maps/contrib/100178836333366849641/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXgw59O9S7vDEVVAfvnlh8FjGqH7dJNCO1Ny29_mPQYDa7ZKqnxOg=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "3 years ago",
      "text": "Located in Yio Chu Kang area. Not close by to MRT stations or major bus lines. So not really convenient for those without their own personal transport.\nSufficient parking spaces for the visitors. The parking charges are reasonable.\nThe staffs were extremely stretched, so it was an amazing job well-done for the staffs given the limited resources, moreover, to manage some of the difficult patients, it must have been both mentally and physically challenging for the staffs.\nThe environment was quiet, good for recovery for the patients. The place was kept clean too.",
      "time": 1652351456,
      "translated": false
    },
    {
      "author_name": "au yong kwok son",
      "author_url": "https://www.google.com/maps/contrib/109765435114941714904/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWDGwICtvjwYubsYA5BbGDXTB-fvRy1tvi05wetLXe9sZoZpd6u=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Don't stay at this community hospital the nurse here is double standard they see patients and there arrangements is lousy for medical appointment can tell u they not enough of staff u go yourself .if can don't stay here",
      "time": 1742804266,
      "translated": false
    },
    {
      "author_name": "K C",
      "author_url": "https://www.google.com/maps/contrib/104747641519736016245/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKpwmNMng6LrlL5Oh38JioyRH74m3yXD4u5625E0ciZqvxxqA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "11 months ago",
      "text": "My mother was transferred here from main hospital after THR for rehabilitation. Overall, If there are other choices, do not send to this community hospital.\n\nSingle ward service (A ward) & food already bad, I wonder how the other class beds are treated.\n\n1. 1st day of check in to her single room ward, her belongings was taken into inventory checks and noted down (like going into prison). This was repeated throughout the day on the 1st day of check in.\n\n2. All meals given was grossly tasteless and badly cooked. It was not just bad tasting, it was really vile but for survival and wound recovery, better supplement your own nutritious food from home for at least 1 meal.\n\n3. Visitors allowed only from 12 pm to 8 pm sharp.\n\n4. Physiotherapists were okay for my mother's recovery. Would give a 4/5.\n\n5. Bed was too soft (it was sunk in and caused pain for my mother's operated hip), probably due to usage and not changed. For spinal issues patient, these kind of soft sunken bed would cause discomfort/pain.",
      "time": 1717554878,
      "translated": false
    },
    {
      "author_name": "Ben",
      "author_url": "https://www.google.com/maps/contrib/110574132991564433243/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIqI-MYnvHuo5YTVo1PCIKMp0OncjBqoEzamRBl1RLQ1GpNeQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "The staff, and care provided, at AMK THK are commendable. My dad was recently warded there (1110/1227) for about 2/3 weeks and he only had positive things to say - that the nurses, physiotherapists and doctors he came across were professional and compassionate. My own experience, including with the admin office, reflected the same - the staff are empathetic and professional. My family and I are grateful to AMK THK, and do keep up the good work.",
      "time": 1719128492,
      "translated": false
    },
    {
      "author_name": "Dennis",
      "author_url": "https://www.google.com/maps/contrib/117107229074498541918/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKUArtheomp78BTMYD_YdjU1ESc-1-h35VePnL4-IQcN0e6qw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "My mum was injured by a nurse when she was in AMK hospital. A nurse literally ran her into a wall in the toilet. She let out a scream and the nurse said sorry. My mum did not think much of the incident as there was no immediate pain. A couple of days later, my mum's ankle was swollen and a doctor called me. I request for an update call but no one call me. I visit my mum later in the evening and request for a report. The staff nurse promised me a report in the next day which was a Friday as she was off on the same day. She claimed they will do a thorough investigation but no one interview my mum on the incident. Even the X-ray and dressing of the wound was done 8 hours after the report by the doctor.\n\nOn Friday, when I requested for the report, the Nursing Assistant Director said that some staff are not back from off and vacation.\nI request a written report from the Service Quality Exec and he agreed. On the next Mon, I was inform that the report will be delayed to Wed afternoon. On Wed, I met with the Nursing Director Joanne, Operations Director Nicholas and Doctor Derrick. They claimed that they completed their investigations and none of their nurses remember any incidents regarding my mum. Also no written report will be provided to me. As her X-ray was ok, Nicholas said that the hospital was not responsible for her injury as no staff provided any injury report. For the fact, my mum can hardly stand and is a \"fall risk\" patient, must less kick out and injure herself. My mum also mentioned that when she was bathing herself most of the days, the nurses were playing their handphones rather than paying attention to her.\n\nThe lack of integrity and responsibility of the senior management is shocking. The repeated inabilities to meet their promises and their claim of non-responsibility speak for itself.\n\nBut I must commend the therapists Cherie and Brina for helping my mum with her therapy sessions. Their cheerful and friendly attitude and attention to details were the highlights of my mum's stay. Kudos to the 2 of them.\n\nEnough said, one can check the staff reviews on Glassdoor for the problems and issues with the hospital.",
      "time": 1716200206,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12054524218495113157",
  "user_ratings_total": 108,
  "vicinity": "17 Ang Mo Kio Avenue 9, Thye Hua Kwan Hospital"
}