{
  "formatted_address": "313 Outram Rd, #02-01 Tan Boon Liat Building, Singapore 169073",
  "geometry": {
    "location": {
      "lat": 1.2871692,
      "lng": 103.8346657
    },
    "viewport": {
      "northeast": {
        "lat": 1.288607180291502,
        "lng": 103.8360120802915
      },
      "southwest": {
        "lat": 1.285909219708498,
        "lng": 103.8333141197085
      }
    }
  },
  "name": "Angie's Oyster Bar & Grill",
  "place_id": "ChIJRZFcSgkZ2jER9LXZJKxrAW8",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "jjthia",
      "author_url": "https://www.google.com/maps/contrib/109403171083577989090/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKJgAVyIKqZAqoCZWnvVTpqYoVJvfhJzuGoqqwYqRqanTg4jmA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "in the last week",
      "text": "A cosy unassuming restaurant nestled in the Tan Boon Liat building, known for its unique furniture and furnishings.\n\nAngie’s ocean (seafood) platter includes a myriad of seafood suitable for sharing - I especially liked the oysters, clams and snow crab because they are so fresh.\n\nThe beef steak was well seasoned and delicious, albeit slightly overcooked (we ordered it medium, but was served medium well).\n\nYou can’t go wrong with the sides either, russet potatoes fries and truffle mac n cheese, perfect for sharing with friends.\n\nThe squid ink pasta was also great, but it might be surfeiting as a main course, better suited for sharing.\n\nThe desserts and the service from the staff were average, not the best I’ve had, as we have to keep prompting them for services (missing cutlery, plates) and the food takes some time to arrive.",
      "time": 1747388926,
      "translated": false
    },
    {
      "author_name": "David M",
      "author_url": "https://www.google.com/maps/contrib/107345381570989890261/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ1U4RkMlNQEo1oSpQU1m-7z75W84oddj0jZnWAlwftR-VADA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Although the location is a bit off the beaten path, it’s totally worth the trek.\n\nThe food was amazing, with the fish and chips, lobster roll, and langoustine pasta being stand out. Probably the best fish and chips I’ve had in Singapore.\n\nService was top notch. Staff were attentive and proactive.\n\nGood promotions encourage larger groups to explore the menu and share.",
      "time": 1746810612,
      "translated": false
    },
    {
      "author_name": "Peiyi (Potato)",
      "author_url": "https://www.google.com/maps/contrib/114036053255574074804/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWUF7R5ZmdEp2MK5WsEgNvNtqlyJhBoKkUGpcZshMKDEEHG4Dpe=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Food is overall pretty good but on the pricey side. Oysters are nice and fresh. Clam chowder is very tasty and filling. Tater tots are super crispy. Mushroom side was a bit underwhelming tho. And their mains took really long to be served, we’ve already cleared our sharing sides and oysters  but the mains still took another 10-15mins to be ready. I felt the mains were a little underwhelming too, probably due to the long wait? Desserts are quite nice.",
      "time": 1740658288,
      "translated": false
    },
    {
      "author_name": "Jr Lim",
      "author_url": "https://www.google.com/maps/contrib/116730822572936862131/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXGXlvn2XwHbmB20un6sBi9kd-7wl912Pmmkl1XkzLxBfrxCzMC=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I had the seasonal set menu. 6 course at 98. It was probably the best valued set I had. Food-wise, if you choose lobster linguine, it's one of the best out there. The lobster course itself is worth the entire menu price. It was a big fresh juicy plump cooked to perfection grilled lobster. 🤤 The steak in the seasonal menu was ok. We paired our dinner with free flow wine which was very easy to drink. Had a fun time with friends with it. Food was arranged very well. The whole experienced was brought to the next level with Mario and Kelvin. Oysters is very good if not one of the best, you won't go wrong with any of the wide selections. I would love to come back for more to try their other seasonal menu.",
      "time": 1741562744,
      "translated": false
    },
    {
      "author_name": "S “Corgi” Chan",
      "author_url": "https://www.google.com/maps/contrib/101221158849919007911/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLfGAHsJJi0Q1uDa0imk1iQOI3bbS3s4iwC2W4bRODcX72XhA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Loved the clam chowder and apple pie. Oyster in the pasta was a tad salty but the crispy and fragrant garlic bits saved the day. My friends enjoyed the blue crab capellini and burger.  The wait staff broke out singing happy birthday when the apple pie arrived with a candle as my friend had indicated that it was a birthday celebration.  Would like to thank Kelvin who waited at our table for being attentive and helpful. There were two other tables celebrating birthdays as well. We thoroughly enjoyed our evening.",
      "time": 1741675400,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "bar",
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7998792800283506164",
  "user_ratings_total": 1319,
  "vicinity": "313 Outram Road, #02-01 Tan Boon Liat Building"
}