{
  "formatted_address": "24 New Industrial Rd InSpace, #01-04, Singapore 536210",
  "geometry": {
    "location": {
      "lat": 1.3442808,
      "lng": 103.886479
    },
    "viewport": {
      "northeast": {
        "lat": 1.345661880291502,
        "lng": 103.8877477802915
      },
      "southwest": {
        "lat": 1.342963919708498,
        "lng": 103.8850498197085
      }
    }
  },
  "name": "Aqtelier Pte Ltd",
  "place_id": "ChIJYY2lchQX2jERgdScyuP7kS0",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Nicholas Loh",
      "author_url": "https://www.google.com/maps/contrib/101569660725992734742/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIaBh8A1CKJf0Tu6t806yExLYfdlToWwVH-YYfOZOOBZaZuzA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Amazing experience with Lorenzo, Kaysen and Anthony.\n\nInstalled a Waterbox Marine X 110.3 with them, and purchased several accessories with them.\n\nFrom start to finish, communication was great. They provided expert opinions on many matters from customizing my own separate cabinet project to what sort of equipment is worth getting (even if it’s not from them).\n\nWhat does it for me, is their passion for reefing and their sincerity in delivering value-added service. During installation day, despite some hiccups, Lorenzo and team were very accommodating and delivered well beyond my expectations. From cable management to onsite installation of equipment - very satisfied.\n\nWhen buying a tank from Aqtelier, you’re not just buying a glass box. You’re paying for an individualised experience, good customer service, expertise from those having lived the reefing or aquarium dream.\n\nHighly recommend!",
      "time": 1743470589,
      "translated": false
    },
    {
      "author_name": "andylim6680",
      "author_url": "https://www.google.com/maps/contrib/115920602100932399130/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKNlyyYIQZcibs8iTiVYplALqhpCbkB3DtWKFy3zAUlRS-t2A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I have known Lorenzo few years back when he design a rockscape for me in my previous tank. I decided to engage the team to transfer my items to a new setup. The process from shifting every thing over to the removal of old tank was done in a very professional way which was hassle free. The new tank is very well done up. The team provide very good advice on the equipments needed. For those looking for a trustworthy and professional team go look for them, you won’t regret.. thanks AQTELIER.",
      "time": 1741330013,
      "translated": false
    },
    {
      "author_name": "Rion Yiu Hui",
      "author_url": "https://www.google.com/maps/contrib/114047298979332789361/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVfEnK2lRGEficR61gF5bRg6rPtGcPQTxHDWN6sFjvrz78PE9_6=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Highly recommend. From drawing plan to execution with 0 issues.\nVery satisfied with the outcome and result. Fishes are happy too. Family loving the new tank.\n\nRevamp pipeline\nInstallations\n\nBought\nWaterbox Marine X 120G\nDD Jumpguard\nSK3000G3\nNeptune flow sensor\nArctica 1HP commercial chiller\nUV 36w Oasia",
      "time": 1741531325,
      "translated": false
    },
    {
      "author_name": "MeePokMan",
      "author_url": "https://www.google.com/maps/contrib/108679166273384478520/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJnqi9oNm4qZHOO-Mo3ZKBfjBU56D7zx8ybAV4RS83AhuSk5A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Lorenzo is truly a one-in-a-million service provider, and I can’t emphasize that enough. He has come to my rescue not once, but twice, saving my tank from disaster both times. Each time I reached out to him, he immediately sprang into action without hesitation. This is exactly what top-notch service should be.\n\nOne instance that stands out is when I was overseas and in full panic mode over my tank. Despite the distance, Lorenzo jumped in and resolved the issue without question. His responsiveness and dedication are unparalleled.\n\nI’ve purchased two tanks from him because of how exceptional his service is. My decision to get a second tank from him was an absolute no-brainer.\n\nBoth times, his service was impeccable. Lorenzo not only answered my endless questions and concerns, but he also addressed every single one of my requests—even the more demanding and unrealistic ones—with patience and professionalism. What truly sets him apart is his ongoing support. Even long after the sale is done, Lorenzo continues to answer my questions and offer help. He’s definitely not a fly-by-night supplier—his commitment to his customers is genuine and lasting.\n\nOn top of that, Lorenzo is always sincere and never pushy in sales. He genuinely wants the best for his customers, and it shows. I never felt pressured to buy anything; instead, he offers honest advice and lets me make decisions at my own pace.\n\nI can’t recommend him highly enough!",
      "time": 1729251706,
      "translated": false
    },
    {
      "author_name": "Lee Kelvin",
      "author_url": "https://www.google.com/maps/contrib/104183283126261344464/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKxstX0MrEefD6pQdGMwWgtsrpbqMDAUW4cz-RZHqQm9D8Mhg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I have chosen to start reefing with a second hand reef tank and show sign of leaking in just 3 months, had I bought a new tank I would be able to get more advice and set up fully done by Aqtelier team!\n\nHighly recommend everyone to consider this shop for their new tank, they decom and set up my new tank seamlessly!\n\nThe attention to details are top notched, finally I can show off the sump cabinet as the cable management have been done perfectly. They also help me to modify the sump for refuge.",
      "time": 1741941359,
      "translated": false
    }
  ],
  "types": [
    "aquarium",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3283682559105225857",
  "user_ratings_total": 28,
  "vicinity": "24 New Industrial Rd InSpace, #01-04"
}