{
  "formatted_address": "115A Alkaff Cres, Singapore 341115",
  "geometry": {
    "location": {
      "lat": 1.3363147,
      "lng": 103.8730392
    },
    "viewport": {
      "northeast": {
        "lat": 1.337608030291502,
        "lng": 103.8743819302915
      },
      "southwest": {
        "lat": 1.334910069708498,
        "lng": 103.8716839697085
      }
    }
  },
  "name": "Artemis Preskool @ Woodleigh",
  "place_id": "ChIJC_UbPxMX2jERpMRun18bIOY",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "xiaoyun wang",
      "author_url": "https://www.google.com/maps/contrib/114645964793550481153/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJmPYnMV8h41nFrRx6G_Ip6J66W8bjMuwvKX4MzychjJNqY4A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "As the school year draws to a close, I wanted to take a moment to reflect on my daughter's wonderful kindergarten journey at Artemis Preskool @ Woodleigh.\nOverall, it has been a happy and fulfilling experience for both her and our family.\nFrom the very first day, we felt welcomed by the friendly and warm atmosphere created by the principal and teachers. Their approachable nature and genuine care for each child have made a significant difference in my daughter's learning experience. It is clear that they are dedicated to nurturing a positive environment where every child can thrive.\nThroughout the year, the school has organized numerous events and celebrations that have enriched my daughter's education. These activities were well organized and meaningful, providing opportunities for the children to learn, bond, and share their accomplishments with others. It has been a joy to see my daughter engage enthusiastically in these events, fostering her social skills and confidence.\nI am especially thankful for the teachers who have taken the time to understand my daughter's individual needs and strengths. Their commitment to her growth and development has made a lasting impact, and I am grateful for their efforts in encouraging her curiosity and creativity.\nIn conclusion, I would like to express my heartfelt appreciation to the entire staff at Artemis Preskool @ Woodleigh. Mrs Carol, Tr Guin, Kong Lao Shi, Qing er Laoshi, Tr Pearly, Tr Eileen, Tr Rose, Teacher Lim… and so many more teachers names that my daughter keeps mentioning.\nThank you for making this kindergarten journey a memorable and joyful experience for my daughter. We are truly grateful for your hard work and dedication!",
      "time": 1735618491,
      "translated": false
    },
    {
      "author_name": "Doreen Chitra",
      "author_url": "https://www.google.com/maps/contrib/105621639774574265096/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV493jG-pS6ukvXSushIuIHpFMIiMIuW-370QumvfKu3bHMxFQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Artemis Preskool at Woodleigh is a good childcare with many smart kids, trained by passionate and patient teachers. I can feel a very good progress on my son since he started the PN class there.\nThe principal, Mrs. Carol, is a very capable lady who handles and tackles things very efficiently. She tries to solve problems as soon as possible and thinks of the best way to do so. 👍\nThere are many pretty teachers there too 💕\nOn the 18 Nov 2023, Artemis held a graduation ceremony 👨‍🎓 for the K2 students at SingPost Centre.\nStudents from N2-K2 participated in performing together. I was surprised and delighted to see my K1 son perform so well. He had never shown me the dance movements at home before. I will definitely signed him up again to participate for the next year graduation celebration.\nThe ceremony went well, and the teachers are actively taking care of the students.\n\nMy daughter just started to join the school last month. Because my son was there, my daughter didn't feel unfamiliar. She is adjusting well after the first month of crying and adapting, haha 😄.\n\nThere's a weekly report from the English and Chinese teachers on their progress and what they have learned.\nEvery month, there will be an update on the curriculum for that month.\nEvery semester, there is a parent-teacher meeting.\n\nOverall, I'm happy to send my son and daughter to Artemis Preskool at Woodleigh.",
      "time": 1700702135,
      "translated": false
    },
    {
      "author_name": "Farah Rassemi",
      "author_url": "https://www.google.com/maps/contrib/117157853170935676232/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUjwyGEUu65dpFxKzcRWm3aaypBLDyalWtDZEMPYKf-EFNQy94Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I would like to express my deepest gratitude to the educators at Artemis Preschool @ Woodleigh. The dedication and effort they put into planning engaging events and activities are truly remarkable. I especially appreciate how they prioritise parent involvement and emphasise the importance of a strong partnership between school and home, which I personally believe is essential for a child's development.\n\nMy children speak highly of their educators and genuinely enjoy going to school every day. The passion the teachers have for their work is evident, and it shows in how my children often share stories about their experiences at school.\n\nThanks to the nurturing environment at Artemis, all three of my children have grown to be confident, curious, and excited about learning. It truly feels like a family at Artemis, and I thoroughly enjoy attending the thoughtfully organized events they host.\n\nA heartfelt thank you to Mrs. Carol and the entire team for bringing out the best in my children❤️",
      "time": 1735615777,
      "translated": false
    },
    {
      "author_name": "Leon",
      "author_url": "https://www.google.com/maps/contrib/116821378257050655731/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJorwp_fDjn5gGhhFVtcm_PzddqEcjTQQp7O898rswiiRxNStY=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Artemis @ Woodleigh has been fantastic for our kids. The staff and caregivers are warm and attentive. It's a huge relief knowing our kids are well taken care of. I highly recommend Artemis @ Woodleigh to any parent looking for a nurturing and positive environment for their kids. Thank you once again to all the staff in Artemis @ Woodleigh and take care! 😘 - Z Family",
      "time": 1742477801,
      "translated": false
    },
    {
      "author_name": "Chua Wilson",
      "author_url": "https://www.google.com/maps/contrib/108458363876654885566/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUkhIEd3dODUipdqVaA-ClJWzZYjdVJw9Q4eHUm3HAm1hCDqPbM=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I am writing this review to express my deep appreciation for Artemis PreSkool At Woodleigh. They have created a truly special environment where my two children, not only thrive, but flourish.\n\nHolistic Learning:\n\nWhat sets Artemis PreSkool At Woodleigh apart is their commitment to holistic development. They go beyond traditional academics, incorporating music, art, storytelling and physical play into the daily routine. This approach allows children to learn and explore their world in a multi-faceted, engaging way, nurturing their cognitive, social, emotional, and physical growth.\n\nDedicated Teachers:\n\nThe heart of this exceptional learning environment lies in the dedicated and passionate teachers. They are not just educators; they are caregivers, mentors, and encouragers. They possess a remarkable ability to connect with each child on an individual level, fostering their unique strengths and talents. Their patience, enthusiasm, and genuine love for children shine through in every interaction, creating a safe and supportive space for all.\n\nEngaged Parents:\n\nArtemis PreSkool At Woodleigh understands the importance of parental involvement. They actively engage us in our children's learning journey through regular communication, parent workshops and family events. This open communication and collaborative approach have made us feel like partners in our child's education.\n\nOverall Experience:\n\nWe are incredibly grateful for the positive impact Artemis PreSkool At Woodleigh has had on our family. Both my children are confident, curious, and excited to learn every day. We highly recommend this preschool to any parent seeking a nurturing, engaging, and holistic learning environment for their child, led by dedicated and passionate teachers.",
      "time": 1709201829,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16582283925488845988",
  "user_ratings_total": 38,
  "vicinity": "115A Alkaff Crescent"
}