{
  "formatted_address": "598 Yishun Ring Rd, #02-01 Wisteria Mall, Singapore 768698",
  "geometry": {
    "location": {
      "lat": 1.4178819,
      "lng": 103.8413551
    },
    "viewport": {
      "northeast": {
        "lat": 1.419582830291502,
        "lng": 103.8423528802915
      },
      "southwest": {
        "lat": 1.416884869708498,
        "lng": 103.8396549197085
      }
    }
  },
  "name": "Artemis Preskool @ Wisteria Mall",
  "place_id": "ChIJGZORw-wV2jERYX-PgHOEPho",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Perlyn Goh",
      "author_url": "https://www.google.com/maps/contrib/102432325197910928585/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIlx5JaX3BRJbaL7EGYJhqku-UtDm4dKlIMdFdZNFLE5Gbnkw=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "I had a truly empowering experience with the LO ifc days, which featured regular communication with the former principal and teachers, and I would like to extend my heartfelt appreciation to Teacher Faith. The centre provided a log sheet that allowed me to monitor my child's food intake, nappy changes, and sleep duration, which was truly enlightening. However, I have observed some differences in PG that present opportunities for growth. I believe it is essential for parents to receive critical information, and I was disappointed to find that I was not introduced to my child's new teachers, which I believe is a crucial step in building trust. Furthermore, I had to inquire about the changes, and it was disturbing to learn that the centre did not notify parents about the change in management, which I believe is a vital communication. Additionally, I was only informed one week after my child started attending PG that parents were required to pack fruits for their children every Friday, as the school does not provide this, which I believe is a wonderful way to promote healthy eating. This information was only shared with me during a conversation with the teacher, and I believe it would be beneficial to share this information with all parents. In my opinion, the centre can rise to new heights in these areas. Nonetheless, I do appreciate every teacher's hard work and dedication towards the little ones, as it's not an easy job, and I am inspired by their commitment to providing exceptional care.",
      "time": 1741788707,
      "translated": false
    },
    {
      "author_name": "Joey Ng",
      "author_url": "https://www.google.com/maps/contrib/112920953538065715036/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUiNOiHycc4vkTMzQ6CES9MELPyg7plnHgX2y-Zcn5BFiAmHbTq=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "The environment of this school is nurturing, safe, and full of joy. The teachers are patient, and caring. They create fun, engaging activities that help the children grow emotionally, socially, and academically. We are grateful for the dedication the teachers have shown.",
      "time": 1744463811,
      "translated": false
    },
    {
      "author_name": "Siti Siti",
      "author_url": "https://www.google.com/maps/contrib/105806716635480416402/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJcRCW8Cir0k0YLYRawoOsIPk57JnYRij5xyMv6XEknyi-CIWc=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "The management is highly inefficient. WhatsApp replies are consistently delayed, and the school app is rarely updated.\n\nTeachers often pack bags carelessly, and most are unhelpful during dismissal.\n\nOnly one or two teachers speak English fluently or make extra efforts to care for the children and address parents’ concerns.\n\nThey also changed teachers frequently. For some reasons, teachers are transferred out or quit or on “leave”.\n\nThe school does not provide food for infants over six months, requiring parents to bring their own.\n\nThe principal is frequently on leave, and the admin staff lack efficiency and responsiveness to queries.\n\nMy baby was scheduled to be withdrawn in December, but the staff informed\nthe father of the baby personally instead of replying to WhatsApp messages that I had not signed the required form, even though they never provided it to me.\n\nFrom the day I mentioned that I wanted to withdraw my baby, most of the teachers were aware and even asked me why, expressing their disappointment. Yet, during all that time, no one gave me any forms or provided any information. It was confirmed that my baby’s last day was supposed to be December 31, 2024, correct? This lack of communication continued for over a week.\n\nThey refused to backdate the withdrawal for unclear reasons, possibly to charge additional fees. Instead of explaining the procedure, they simply stated that my baby must attend at least one day in January, without clarifying why or explaining that his last day would actually be at the end of January instead of December.\n\nNow they’re saying that because they prematurely entered the information into the system, my baby cannot be withdrawn. How deceitful can they be? Why are parents being held responsible for the mistakes of the staff? The principal never responds, and many of the staff seem clueless and disorganized.",
      "time": 1737344685,
      "translated": false
    },
    {
      "author_name": "XQ XQ",
      "author_url": "https://www.google.com/maps/contrib/100529871904599077391/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL6Ss9pob_Db7NFp2IqGNvcVjVXSLf1DTJ4LngCPP6erO4vEA=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Teacher Ren is the only PG teacher that will constantly provide feedback on my baby and this is something that I am really appreciate.\n\nOne area that really needs improvement is on the admin side. Few months ago when applying for preschool subsidies, I have submitted all the required docs but the admin told me that ECDA rejected my application and need me to provide additional documents. The application has been delayed for like a week so I personally called ECDA at my side and to my surprise it was the school that missed to upload my documents. I informed the school about this via WhatsApp and they just replied “ok noted” without apologising. Currently I need the school to extend the SA and I received email from the government side that they are unable to reach out to me. After checking with them, they told me that the school has provided my mobile number wrongly. Really hope that there is no further issue for this SA application",
      "time": 1742199768,
      "translated": false
    },
    {
      "author_name": "LP NG",
      "author_url": "https://www.google.com/maps/contrib/103517782767304902056/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWGK1LWPn7kTvfZ1_pF-Wtsq5sLt7JRCK05w68vzd548T_5X-LMMg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "New and clean environment. Love the low staff child ratio. The teachers are attentive and responsive too!",
      "time": 1744117838,
      "translated": false
    }
  ],
  "types": [
    "shopping_mall",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1891094525155180385",
  "user_ratings_total": 8,
  "vicinity": "598 Yishun Ring Road, #02-01 Wisteria Mall"
}