{
  "formatted_address": "46 Kim Yam Rd, #01-02 New Bahru, Singapore 239351",
  "geometry": {
    "location": {
      "lat": 1.2928106,
      "lng": 103.8386992
    },
    "viewport": {
      "northeast": {
        "lat": 1.294155880291502,
        "lng": 103.8401258302915
      },
      "southwest": {
        "lat": 1.291457919708498,
        "lng": 103.8374278697085
      }
    }
  },
  "name": "Artichoke",
  "place_id": "ChIJzTqqFLsZ2jEROOgjd_-TM7k",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Calcen Chan",
      "author_url": "https://www.google.com/maps/contrib/115834873482306911999/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXT603jF3iasuOEQ5ZVJflKD2LpfKhDiJ2YL4svOEhIs55pTG0HYg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We thoroughly enjoyed our meal here. The falafel was excellent, and the hummus and bread were truly superb, boasting a delightful texture. The cauliflower was equally impressive, with generous servings. The staff were friendly and efficient, adding to the relaxed and pleasant atmosphere. While we booked ahead, the restaurant wasn't overly busy on a Sunday afternoon.",
      "time": 1743307166,
      "translated": false
    },
    {
      "author_name": "Dinitha Thevar",
      "author_url": "https://www.google.com/maps/contrib/103568358271109087649/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUJirogAk9G2qM4bhyvIfb2TGlzBz9LbukMMLMKCtBOh9EtUTGl=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Amazing team and service. We sat outdoors and took advantage of the cold weather. One of our guest was a little baby and it was lovely of them to set up a chair and cutlery sets for him. I have had their menu at their other location years and ago and I felt the food was much more mind blowing. Having said that, we ordered plenty from the menu and everything was lovely. The lamb is gamey so if you’re not into strong flavours, skip that. Bread could have been served warm but nevertheless the other dishes made the company great! The new location has some really great vibes and truly was a wonderful dinner with friends.",
      "time": 1737007391,
      "translated": false
    },
    {
      "author_name": "Mal T.C",
      "author_url": "https://www.google.com/maps/contrib/103724284154398504661/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVlVF3xfWZSyHwSvnha8s-L402EA0lpL8M2RkxZtfLNTInuU7_I=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Lovely environment.\nThe portion is pretty huge, we order a number of dishes to share and it was lovely.\n\nThe fried chicken sandwich was a tad salty with chewy and soft bread. Huge piece of chicken we shared amongst the four of us. Not too sure if it was over fried or there a lot of spices coated on the skin. Very crispy.\n\nOur favourite is the hummus plate with juicy grilled chicken. Drizzle with yummylicious sesame and olive oil. We love the taste of the olive oil, its so fragrant and we wanted to ask for a dip for our breads. Yum.\n\nShashuka was alright, not too fancy. A little watery. We all love the ayran. Good.\n\nDefinitely will visit again for dinner someday for another gathering. But note that their dining time is pretty short with 1.5hrs for lunch and 2 for dinner. Very good business.",
      "time": 1741273299,
      "translated": false
    },
    {
      "author_name": "Suzanna Chia",
      "author_url": "https://www.google.com/maps/contrib/103346615814945354246/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUmcVAeyUIpw6DQQ3nyUWNaeJIxTdJ0UnzhZbj8usakZx45E-QZGQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "One of my favourite restaurants since their time in Middle Road. Love their roasted Cauliflower in rice and mango sauce and grilled chicken, egg and mushroom with hummus and bread. The amount of hummus was not overpoweringly excessive and balances the acidity of the ginger and pickles.",
      "time": 1744963368,
      "translated": false
    },
    {
      "author_name": "Aman Talwar",
      "author_url": "https://www.google.com/maps/contrib/118343362461642512984/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJNS0-Mx0yzlf2nI2DXxPx1zTfzGZdgkY-a_TXOk6q_ct7frPpx=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "2 weeks ago",
      "text": "Despite confirming the order twice, the server still got a simple karak tea order wrong — we ended up with two completely different drinks, both incorrect. And when it arrived, it was lukewarm at best.\n\nMy husband enjoyed his scrambled eggs with falafel plate, but my chicken shakshuka was a letdown. It was overly oily, the egg hadn’t set properly, and chicken was sparse. For $28++, the portion included just one egg and tiny pieces of leftover chicken from the dinner service - it felt it was prepared hastily. I noticed the shakshuka at the next table looked much better, so some consistency issue.\n\nWhen I asked for a spicy sauce, one waiter outright said no, while another, more experienced lady server, eventually brought me some zhoug.\n\nOverall, the experience was marred by inconsistencies in both service and food quality.",
      "time": 1746433495,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13345172846253697080",
  "user_ratings_total": 1636,
  "vicinity": "46 Kim Yam Road, #01-02 New Bahru"
}