{
  "formatted_address": "Blk 2 Balestier Rd, #04-641 Balestier Hill Shopping Centre, Singapore 320002",
  "geometry": {
    "location": {
      "lat": 1.3263908,
      "lng": 103.8433981
    },
    "viewport": {
      "northeast": {
        "lat": 1.327743780291502,
        "lng": 103.8447842802915
      },
      "southwest": {
        "lat": 1.325045819708498,
        "lng": 103.8420863197085
      }
    }
  },
  "name": "ARTrend Design Pte Ltd",
  "place_id": "ChIJScs7e98Z2jERjE1mPealG9M",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Jenny Wong",
      "author_url": "https://www.google.com/maps/contrib/101200400454172293972/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK-SWWosufLLAGSLxWzia4nRt9unswxTqWC2nPfTsw6M3rcEg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "I wanted to minimise sound echo in the aircon restaurant. ARTrend gave me a quotation that is much lower than another contractor. The final finished product was so fantastic . It is visually appealing , and it works  well. Besides ourselves being satisfied, our customers gave all good compliments. I will strongly recommend readers to go to ARTrend for all your design and renovation work. It’s reasonably priced making it good value for money; they are fast and the boss knows what he is doing. Very professional and sincere.  Thanks Artrend",
      "time": 1724936680,
      "translated": false
    },
    {
      "author_name": "Connor S",
      "author_url": "https://www.google.com/maps/contrib/113200202254280122701/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKf7zKk6qIh7xdbvfPJcOAuX4Zw--weU_XLf8YUGNLE5HI8z3k=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "This is Connor, I am the owner of Slow Green. Kelvin from ArtTrend had helped Slow Green with our submission and main contracting for our retail shop at JEM mall at Jurong. Kelvin was responsible, capable, and delivered the project well per the scope and timeline agreed. Would recommend Kelvin for similar retail projects.",
      "time": 1747033088,
      "translated": false
    },
    {
      "author_name": "Ping",
      "author_url": "https://www.google.com/maps/contrib/102447566696274160602/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUjLwSvGq5ldtZVAOxtSx33cjLGE3fT_ZzydC40RGx4iCLPviGQOA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "ARTrend Interior Design, founded by Kelvin Chua, has been around for more than 30 years and that by itself speaks volume of an established design house managed by a very experienced founder and team!\n\nThis is my 2nd time engaging ARTrend to design and renovate my new apartment after a first awesome experience working with them some 10 years ago. They left me with a lasting good impression then and therefore, I had no qualms using them a second time round. My last home also managed to fetch a good price at the current property market and that was largely due to the classic interior design and layout created by ARTrend then!\n\nThis time round, Kelvin personally saw through my home design and renovation works. He is not only meticulous, responsible and patient, he is also very open to new ideas and provided timely advice and alternatives, while keeping budget and design practicality in mind. My final home design and renovation turned out as beautiful as what they had created in the 3D drawings at the beginning. My friends and relatives also gave praise to the intricate and beautiful carpentry and granite works created in the living area, toilets and bedrooms.\n\nKelvin and his team (namely Victor and Jim) were also very responsive to all my calls and whatsapp queries during the renovation period and they remained contactable at all times. Even though there were some work delays due to Covid restrictions that was not in anyone’s control, I was constantly updated on progress and that really gave me assurance that my home renovation was in good hands.\n\nEven after we took over the new apartment for a few months already, Kelvin and team still respond to me on some small issues that popped up in the apartment and this goes to show professional aftercare service and support. Thank you once again ARTrend for a job well done!",
      "time": 1665556850,
      "translated": false
    },
    {
      "author_name": "Marcus Teo",
      "author_url": "https://www.google.com/maps/contrib/108561359867150634169/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK58HRCoD6ChRegMJniROnUdSwZ-wkFbjFFzjehdiaLq1YZng=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "My parents had used ARTrend and Kelvin many, many years ago to design and renovate our house.\nNeeding to redesign a room from a study room to a new bedroom, needless to say, we once again approached Kelvin and his team to help us come up with a design, and help bring it to life, with some input regarding closet design and color scheme from our side.\nWe were impressed by his designs and suggestions.\nSpecial shoutout to Jim as well who was the onsite manager and helped us to relay all our queries and request to the other sub contractors.\nThe process was quick and efficient and the room was complete within a few weeks, in time for the wedding and marriage.\nIf you want a good ID firm who is reliable and effective, do approach ARTtrend.",
      "time": 1684486406,
      "translated": false
    },
    {
      "author_name": "Rosie Chow",
      "author_url": "https://www.google.com/maps/contrib/100233826285307796031/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKyOLt_yUcnZHXgw7GoV3MO6Gv1ouUJET1XjgmIFwKmAJ5cqQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Kelvin is a very professional designer. I have known him for more than 25 years, with him helping me with my 2 houses. I have recommended his services to my relatives, they are all satisfied customers. His designs are unique, he helped me custom made my bed, wardrobes, even to design a wooden 2 door to cover up a window at the aircon area in my master bedroom.. (Look at the picture). Many of my friends & relatives  admired his unique design in my living room. He is very meticulous, very detailed, responsible, he has a good eye for details. Recently I engaged his service to rebuilt my kitchen cabinets. I highly recommend him for any home designs. He has a team of professional carpentry colleagues. All thumbs up for his dedicated service.  Once again, kudos Kelvin! Keep up the good work!! Appreciate your service!",
      "time": 1649502982,
      "translated": false
    }
  ],
  "types": [
    "general_contractor",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15211934574665158028",
  "user_ratings_total": 36,
  "vicinity": "Blk 2 Balestier Road, #04-641 Balestier Hill Shopping Centre"
}