{
  "formatted_address": "6, Blk 2 Tampines Street 92, unit 03-10, Singapore 528893",
  "geometry": {
    "location": {
      "lat": 1.3432322,
      "lng": 103.9423159
    },
    "viewport": {
      "northeast": {
        "lat": 1.344680530291502,
        "lng": 103.9437822302915
      },
      "southwest": {
        "lat": 1.341982569708498,
        "lng": 103.9410842697085
      }
    }
  },
  "name": "Artysticks Drum Academy",
  "place_id": "ChIJw7L2akM92jERGnIo4Q27ErM",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Patricia Lee",
      "author_url": "https://www.google.com/maps/contrib/102161822563003570643/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLVjqNMqRdj51TqGPsPO0-F-RWyAKisMqaGdzZGMDCdyvbtsg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Jeremy has been a very encouraging and inspiring teacher to my son. My son’s drumming technique has improved tremendously after being under his tutelage.\n\nWe are also very grateful to the academy for giving its students the opportunity to perform onstage in collaboration with other performing institutions.\n\nJiayou Jeremy!",
      "time": 1704197702,
      "translated": false
    },
    {
      "author_name": "Joanne Ong",
      "author_url": "https://www.google.com/maps/contrib/113668824079773091715/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL8FPJU3vaB31wCYM-hTODza2_i-e4wSVelGqGVMv1ApUgJtg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "My son has been learning drum from Jeremy for almost a year. His drumming skills have improved tremendously. Jeremy has his ways of making the lesson fun and easy to understand. He catered his lesson based on the learning ability of the child. Almost every lesson, Jeremy will send us videos of the lesson and these videos also help my son practice at home. My son enjoys going for his lessons. I highly recommend anyone keen to pursue drum playing to sign up with Artysticks Drum Studio!",
      "time": 1638184147,
      "translated": false
    },
    {
      "author_name": "Siti Jawiah Abd Malek",
      "author_url": "https://www.google.com/maps/contrib/108645311362020877711/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVVH4VthLRCNKMJ817eQSHOILJJDpZ-QFCFMP-p-6CBFoeDznOyUA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I was intimidated for years to learn drums and was thinking if it’s too late for me to learn a brand new instrument. However, last Sept 2023 after a friend taught me drums for fun for 1hour, I decided to learn drum. And I’m glad I did and made a right choice in learning at Artysticks.\n\nIt’s my 1st time properly learning drums. Iain and Jeremy has broken down the lessons making it super easy to digest. They are also great at providing inputs on how to improve my drumming such as the stickings to dynamics to how to make the drum sound much better. The drumming techniques that was taught is made easy to follow.\n\nEach lessons has always been fruitful for me with knowledge and encouragement to challenge myself even further. And my friends said that I’m getting better and better at drumming. Thanks Artysticks!\n\nWe are also allowed to book the studios for our self-practice. And since it’s located in Tampines which is close to my home, it’s very convenient for me to schedule my self practice when i have the extra time.\n\nThanks to Artysticks, I managed to complete initial, grade 1 and grade 2 & now learning grade 3 within 6months.\n\nI would recommend to any WFH working community to Artysticks! And also it’s never to late to learn drum! And don’t be scared to learn drums!",
      "time": 1708431065,
      "translated": false
    },
    {
      "author_name": "sherrey chng",
      "author_url": "https://www.google.com/maps/contrib/113689109220961176718/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKJGTIeSOpQtxhtD8ajp66vssz_BQoV_AUuTG4DNR53CxYeUw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "My son loves going for drum lessons with Jeremy and finds him engaging, fun and kind. He had taken drums previously but when Jeremy started teaching him, he has improved tremendously  to a whole new level. Jeremy has the patience and ability to bring out the strengths and talents in his students and partners with the parents to develop them. I would highly recommend Artysticks for any kid (or adult) wanting to explore and develop their drumming talents!",
      "time": 1638059280,
      "translated": false
    },
    {
      "author_name": "Marvin Lowe",
      "author_url": "https://www.google.com/maps/contrib/104306629763006598199/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXb3hqsl-s7MfxJ1VnLEXPh0SsTHB4HoaIl0JR7St4jWSYtztkBKQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "This is probably one of the best places in Singapore to learn drums. Jeremy is a really fun and jovial guy. He's great with kids and knows how to guide young children in their drum learning journey. He has trained and taught many young drummers to play in church or school. Jeremy is a very experienced drummer as well, touring with many mandopop stars before. Despite his vast experience, Jeremy is a really humble guy, always willing to share and teach others. 5 stars for a great teacher!!",
      "time": 1585323509,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12903581550656385562",
  "user_ratings_total": 39,
  "vicinity": "6, Blk 2 Tampines Street 92, unit 03-10"
}