{
  "formatted_address": "10 Anson Rd, Singapore 079903",
  "geometry": {
    "location": {
      "lat": 1.2760158,
      "lng": 103.8459349
    },
    "viewport": {
      "northeast": {
        "lat": 1.277337330291502,
        "lng": 103.8474019302915
      },
      "southwest": {
        "lat": 1.274639369708498,
        "lng": 103.8447039697085
      }
    }
  },
  "name": "ASIA DERM | Dr Daniel Chang",
  "place_id": "ChIJ399AoZYZ2jERP_T9jszbu88",
  "rating": 5,
  "reviews": [
    {
      "author_name": "s a",
      "author_url": "https://www.google.com/maps/contrib/110840927164675689057/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWq5kIiMgLpxAi3x7XPz5FbtP-ytQ6NuvHO1_Akr4jfMOyhfKqg3Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "I had an amazing experience with Dr. Daniel! From the moment I walked in, he was very friendly, patient, and made me feel at ease. Throughout the entire consultation, he took the time to explain the procedure in detail and answered all my questions without rushing.\n\nDuring the Pico laser treatment, Dr. Daniel constantly checked in with me to make sure the pain level was tolerable and that I was comfortable at all times. His professionalism, care, and attention to detail really stood out. I felt like I was in very good hands throughout the entire session.\n\nThe whole experience was smooth and reassuring, and the clinic environment was clean and welcoming as well.\n\nAn awesome doctor with a great attitude — highly recommended for anyone considering treatment!",
      "time": 1745727503,
      "translated": false
    },
    {
      "author_name": "Phaedra Goh",
      "author_url": "https://www.google.com/maps/contrib/113233086777730261836/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK7r_y5AbDBQtsF1uvSOxxgFMTcpeByLzFi1tDV_bqYxhQ_jg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "I recently had a Pico laser treatment with Dr. Daniel Chang, and I'm so impressed! He took the time to understand my concerns about my sun spots and tailored a specific treatment for me. Throughout the entire process, Dr. Chang was incredibly informative, explaining everything clearly and making me feel comfortable.\n\nThe follow-up check-in from the front desk was also a lovely touch and showed their commitment to patient care. I highly recommend Dr. Daniel Chang and his clinic for anyone considering Pico laser treatments",
      "time": 1745407718,
      "translated": false
    },
    {
      "author_name": "Clara Do",
      "author_url": "https://www.google.com/maps/contrib/103429726315367601140/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXIBfYxl6viFqwmOnhJv7lEJnepIGLKAZt0mU3CrZD22moT9VIQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I had an amazing experience with Dr.Daniel Chang for my skin treatment! He has excellent skills and knows exactly what your skin needs. The procedure was completely painless, and he made sure I was comfortable throughout. He takes the time to understand your skin concerns and expectations, delivering great results. My skin feels so much healthier and more radiant after the booster and laser treatment. Highly recommend for anyone looking for professional and effective skincare!",
      "time": 1741167630,
      "translated": false
    },
    {
      "author_name": "dinar wahyudi",
      "author_url": "https://www.google.com/maps/contrib/107915400454934700251/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLk4D9il-ulvOxe1Lc-A9fASQ2XbDr6eVuOL2-_r7qehy1Vrg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "It was a fantastic experience. The course covered a lot of useful knowledge and included hands-on workshops that really helped me understand and practice the skills.\n\nDr. Daniel Chang made the classes interesting and engaging, always keeping us involved and eager to learn.\n\nWhat stood out the most was his kindness and supportive nature. He made sure everyone felt comfortable and confident, which made a huge difference in my learning. Thanks to this course, I feel much more confident in my professional abilities. ❤️",
      "time": 1718807253,
      "translated": false
    },
    {
      "author_name": "Katherine Aiko",
      "author_url": "https://www.google.com/maps/contrib/106152680543525044534/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUp10B8Y56D3OHXIk3JNPnHN5XlKeiKhxLyYlQ-V3dcMfKVknYKFA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I had PDRN injections and Pico Hybrid Laser with Dr Daniel, and the experience was great! He is very friendly,  knowledgeable and took the time to explain each procedure in detail, ensuring I felt confident and informed. What truly stood out was the doctor’s gentle approach, precision, and attention to detail—I felt minimal discomfort, and the post-treatment care was thorough and well-guide. Highly recommend for anyone looking for effective aesthetic treatments",
      "time": 1743156683,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14968799458114794559",
  "user_ratings_total": 184,
  "vicinity": "10 Anson Road"
}