{
  "formatted_address": "6 Napier Rd, #05-01 Gleneagles Medical Centre, Singapore 258499",
  "geometry": {
    "location": {
      "lat": 1.3072201,
      "lng": 103.8200328
    },
    "viewport": {
      "northeast": {
        "lat": 1.308578830291502,
        "lng": 103.8213842802915
      },
      "southwest": {
        "lat": 1.305880869708498,
        "lng": 103.8186863197085
      }
    }
  },
  "name": "Asian Obstetrics & Gynaecology Centre - Dr Harvard Lin 林振佳医生",
  "place_id": "ChIJu6PztjMb2jERZHNZ8Kubjyg",
  "rating": 5,
  "reviews": [
    {
      "author_name": "varna arun",
      "author_url": "https://www.google.com/maps/contrib/111377751081797953538/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVC-8V88YsZrU-qGqBHHizHyBtjfg6wwyCWSRwScTvIa1kbiNGWVg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Dr. Harvard Lin is truly an outstanding physician. From my very first visit, I was impressed by the way he took the time to explain my condition in detail, outlining all possible options with complete clarity. He patiently answered all my questions with full transparency, ensuring that I felt informed and confident in my decisions. His approach made a huge difference in my experience, and I deeply appreciate him.\n\nBeyond Dr. Lin’s expertise, his staff is equally excellent—prompt, professional, and always making each visit smooth and pleasant. I highly recommend Dr. Lin to anyone looking for a doctor who genuinely cares and takes the time to provide the best possible care",
      "time": 1743304988,
      "translated": false
    },
    {
      "author_name": "Zi Xiang Ong",
      "author_url": "https://www.google.com/maps/contrib/109697404710168318183/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWpx0-6HRWynVft3kqjzULsx2CycU_L7AX2ZPHug9HT-rKld-aa=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "Many thanks to Dr Harvard for his professionalism and care for my wife’s recent surgery. I felt very at ease that my wife was under his care and I no need to worry so much. Also very appreciative of Hanah who picked up the call in the late night when my wife had to go the A&E due to her intense pain and she was attended shortly after.\n\nVery glad that my wife is much better now and thanks to everyone in the clinic.",
      "time": 1747233550,
      "translated": false
    },
    {
      "author_name": "Celeste Yap",
      "author_url": "https://www.google.com/maps/contrib/107065561655536597905/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLi2DDOrWbTB9YUF8UeHoP8BD25PWSY8UeZylXdFNZMgRLlDw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I would like to express my gratitude, appreciation and thanks to Dr Harvard and the clinic nurses Hanah and Kelly.\n\nDr Harvard was very kind, helpful and patient in explaining the issue that I was facing for the past 1 month and the procedure went smoothly. He listens to my problems and I am very glad the issue had resolved and am able to be back to my normal energy as before.\n\nTo Hanah & Kelly: Thanks for being patient and very responsive in answering my queries despite being busy with your other clinic patients and other administrative work. I'm also very thankful they you all were very understanding that I'm also very busy with my own work and helped me with the insurance process for my procedure.\n\nThanks alot!! 😍😍😍",
      "time": 1744186061,
      "translated": false
    },
    {
      "author_name": "Marilyn Sim",
      "author_url": "https://www.google.com/maps/contrib/115884911138126623703/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVI4lSjJs7-Z-dCzZLynhX2Y18U9DtCMPpdsl9n06FdOsva7O9L=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Many thanks and appreciation to Dr. Harvard and his team of nurses. Dr. Harvard is very patience in explaining every detail. After procedure, he will also be following up closely on my condition to ensure I can move forward to my next treatment. Also, thanks to Hanah for the prompt feedback. Although I have queries over the weekend, I can receive her reply within the day. She is also very supportive and providing comfort for me during this hard time. Thank you so much!",
      "time": 1742380440,
      "translated": false
    },
    {
      "author_name": "Carina Athwal",
      "author_url": "https://www.google.com/maps/contrib/109411684333052990820/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJML81kDMGM3g_5Rwqbxk6gwZexnkle3QcuMcPA283g1cmbFQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Dr. Harvard Lin is the most fabulous doctor I have ever met! He is incredibly gentle, kind, and truly listens to his patients. From the very first consultation, he took the time to explain everything thoroughly and made sure I felt comfortable with all my options.\n\nThroughout my treatment, he was extremely caring and attentive. He explained each step in detail, ensuring I understood what to expect. His level of care is exceptional—he consistently checks in on his patients and is always available to address any concerns.\n\nNot only is Dr. Lin an exceptional doctor, but his staff are also so sweet and kind. They are always warm, welcoming, and go the extra mile to make patients feel at ease.\n\nI am beyond grateful for Dr. Lin’s professionalism, patience, and genuine concern for his patients. If you are looking for a doctor who truly goes above and beyond, I highly recommend Dr. Harvard Lin and his amazing team!",
      "time": 1738287702,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2922725845960848228",
  "user_ratings_total": 188,
  "vicinity": "6 Napier Road, #05-01 Gleneagles Medical Centre"
}