{
  "formatted_address": "80 Bras Basah Rd, Level 2 Fairmont, Singapore 189560",
  "geometry": {
    "location": {
      "lat": 1.2943476,
      "lng": 103.8536698
    },
    "viewport": {
      "northeast": {
        "lat": 1.295756430291502,
        "lng": 103.8550765802915
      },
      "southwest": {
        "lat": 1.293058469708498,
        "lng": 103.8523786197085
      }
    }
  },
  "name": "ASIAN MARKET CAFE",
  "place_id": "ChIJXQAA0KUZ2jERFCgZPgCSAts",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Elijah Tan",
      "author_url": "https://www.google.com/maps/contrib/109287346354369266778/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVWtHrxo86gP-DEbafUkFEz0xnnpKZRZxd-QtVchBqDlpxNdDZO=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "a week ago",
      "text": "We recently celebrated our mum’s birthday at Asian Market Café, and it was our first time dining there. It was a special occasion for our family, and while there were highlights, we also hope our feedback can help the team enhance the experience for future guests.\n\nWhat We Loved:\nThe fresh seafood station was the star of the show for us! The prawns were incredibly fresh and juicy, and the crab claws were a real treat. We just wished this station had been replenished more frequently, as it was clearly a popular one.\n\nWe also really enjoyed the dessert selection. The local flavours were a nostalgic touch—cheng teng, durian pengat, and teh tarik ice cream stood out for us. It’s lovely to see traditional favourites presented so thoughtfully.\n\nThe beverage options were also a pleasant surprise. We appreciated the variety, from rose syrup with lime to water chestnut juice, pineapple juice, and freshly brewed coffee and tea. It was refreshing to see such a range available.\n\nRoom for Improvement – Service Suggestions:\nAs it was a birthday celebration, we were hoping for a slightly more attentive experience. A few things stood out:\n•\tThe staff presence on the dining floor seemed limited. Our plates piled up during the meal, and we ended up clearing them ourselves before the cake-cutting moment.\n•\tWhen the birthday cake was brought out, we weren’t given any plates or cutlery, which made it a bit tricky to enjoy the cake together.\n•\tThe cake itself was quite dry. At $35 for 500g, we felt there’s potential for a more moist and flavourful option, especially for special occasions.\n\nWe understand it might have been a busy day or the team could have been short-staffed, but with a little more attention to these details, the overall experience would have been even more memorable.\n\nFinal Thoughts:\nWe’re glad we chose Asian Market Café for our mum’s special day. The food variety and local touches are great, and with a bit more warmth and attentiveness in service, it has the potential to be a go-to spot for celebrations. We hope our feedback is helpful, and we look forward to seeing how the team continues to grow and improve.",
      "time": 1746631769,
      "translated": false
    },
    {
      "author_name": "Alex Yong",
      "author_url": "https://www.google.com/maps/contrib/105832228050818088557/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVgM7mqcQeZm9kDnW9C7yHNIZZf2VvZya4yLj_xRjeGsLyCvWXemA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Asian Market Cafe is an absolute delight for anyone craving authentic and diverse Asian cuisine! From the moment you step in, the vibrant decor, featuring festive arrangements like the beautiful pussy willow branches with red accents, sets the perfect ambiance for a memorable dining experience.\n\nThe buffet offers an incredible variety of Asian dishes, catering to every palate. The fresh sashimi and seafood platters are a standout – the salmon is so fresh it melts in your mouth. The laksa is rich and bursting with flavor, while the chef's station adds an interactive element where you can enjoy freshly prepared noodles and other delicacies.\n\nBeyond the food, the service is outstanding, with attentive staff ensuring every detail is perfect. The wide range of dishes, from traditional favorites to creative specialties, makes it a great choice for any occasion. Highly recommended for anyone looking to explore the richness of Asian cuisine in a warm and inviting setting. I'll definitely be back for more!",
      "time": 1738031915,
      "translated": false
    },
    {
      "author_name": "Cindy Tan",
      "author_url": "https://www.google.com/maps/contrib/116706705506549813871/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWM0Up1EFQi_3eGyUrZyqXCGZgHar5vxJjS9YxC7ITtBrWwanPphw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "4 weeks ago",
      "text": "Had our team lunch on a Monday.  There is a 50% promotion.  Wide variety of Asian cuisines.  The highlight is the durian purees.\nService is excellent.\nMinus 1 star for atmosphere as there are flies around.",
      "time": 1745213905,
      "translated": false
    },
    {
      "author_name": "Alya Raudha",
      "author_url": "https://www.google.com/maps/contrib/110509512220705608747/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLWcVolvsZ2gCXfnX-eb-0G7XhToiZJN4oqk6H_CnZ26ZfMoA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "The new menu here is fabulous. I personally love their Lychee sorbet. After all the heavy indulgence on those yummy food, you cleanse your palate with their so delicious self-made Lychee sorbet and other ice-creams. Well done. Will definitely come back.",
      "time": 1745412073,
      "translated": false
    },
    {
      "author_name": "Chrissy C",
      "author_url": "https://www.google.com/maps/contrib/101476957313842897375/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI5LRBaDhw--LsgSt_wWJle_dBcJhzTMhAOrQqWj6Wbr8uJwg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Good variation of food, desserts and drinks. Staff are friendly and very attentive too. Personally I love the chilli crab and seafood. My kids love the steak and meat options. Their local desserts are better than other buffet place.",
      "time": 1730503858,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15781336573999130644",
  "user_ratings_total": 862,
  "vicinity": "80 Bras Basah Road, Level 2 Fairmont, Singapore"
}