{
  "formatted_address": "283 Bishan Street 22, #01-185, Singapore 570283",
  "geometry": {
    "location": {
      "lat": 1.3589776,
      "lng": 103.8447546
    },
    "viewport": {
      "northeast": {
        "lat": 1.360152380291502,
        "lng": 103.8460602802915
      },
      "southwest": {
        "lat": 1.357454419708498,
        "lng": 103.8433623197085
      }
    }
  },
  "name": "Aspen Clinic",
  "place_id": "ChIJIUkbqhgX2jERuGi1fXJQeY0",
  "rating": 2.6,
  "reviews": [
    {
      "author_name": "SHANE O MAC",
      "author_url": "https://www.google.com/maps/contrib/101190108051124653506/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK94A-cb601J6usqYeKXtBBYgi0TcTrFczadO0_hPmlrMeddQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "Very bad experience visiting this clinic yesterday. The counter receptionists, one middle age and one old, not polite at all, strictly quite rude tones. Especially the old one, very rude tone. Waiting time is very long. Doctor also not so professional. One day I will complain to CMB. Cough Syrup drink already, keep on sleepy, only want to sleep, cannot do work at all. What’s the point of going to this clinic. Unprofessional, Service bad and medicine cannot cure. One more thing it’s expensive too. Whoever read here, be it your own clinic staffs, please wake up and improve, if not just quit or close down. To public, don’t go to this clinic.",
      "time": 1736933334,
      "translated": false
    },
    {
      "author_name": "Jerlin",
      "author_url": "https://www.google.com/maps/contrib/106437911629480659395/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIkHCLJPLe2T6qHgE079jwCnlUCHwCIfQBrggoxdBbKt7A2Jk0=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 3,
      "relative_time_description": "4 months ago",
      "text": "I came to the clinic because of Dr Wong... but the 2 auntie receptionist are just rude. I dislike their service esp towards people to are unwell and visit the clinic. They don't have a way of talking to patient.\nIn the line of hospitality but has zero empathy and etiquette.... even the basic also they don't have...\nthey should have been trained long time back.... shocked to see them still here .....",
      "time": 1735610038,
      "translated": false
    },
    {
      "author_name": "Jen Faith",
      "author_url": "https://www.google.com/maps/contrib/116914637428251250392/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLTX7Nu9QDJr9NonPqgrSqH28bOccUG90s3u544pGYKevT9YA=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "4 months ago",
      "text": "Dr Wong is ok ... gentle and patient, but I hate going Aspen cos of the long wait time, made even worse when the front desk staff are slow, rude and loud.\n\nWas the first patient when clinic opened after lunch, yet being made to stand in front of counter to wait for the two staff to take their own sweet time to do don't know what, before I finally got to register after about 10 mins. The older staff spoke very loud and I was not happy she said my name, IC and contact number so loud everyone can hear ... no privacy at all. After registration was done then she told me no stock for the jab, so I wasted like 15 mins there all in all.\n\nAfter an hour, the older staff called me to inform me the jab is available now, asked if I want to go back. I told her I already left Bishan and its ok.  Guess she didn't hear properly cos I was outside, quite noisy. After another hour the younger staff called me and asked if I'm coming. I told her I already did the jab at another clinic. She said \"you should have told us if you are not coming right?\" I told her I informed her colleague. Then she kept arguing and in the end exclaimed \"fine!\" in a very rude way. Can't she just say something like \"oh ok no worries, thank you\"?\n\nDr Wong really need to find more customer oriented front desk staff to manage his clinic before all his patients decide to visit other clinics instead. No lack of clinic in the vicinity.",
      "time": 1735372293,
      "translated": false
    },
    {
      "author_name": "Kelvin",
      "author_url": "https://www.google.com/maps/contrib/104504336495143525716/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJCTFdGqfalBEThQQk4sMUK1bFCX3rvzQV2JAcYKAqsdzPF=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I can see that there are many mixed reviews here haha.\n\nFor my personal experience, the receptionist was very friendly haha, I appreciate greatly when she says thank you and all^^\n\nWaiting time was alright! Not too long when there were 12 people before me. Went to eat my lunch in between haha.\n\nThe doctor is my favourite haha, he cares about his patients and would always ask me questions to fully understand what I faces and explain to me in details with the knowledge he has. I feel genuinely cared for whenever I come here when I am unwell.\n\nOverall this is a clinic that I enjoy coming to when I am sick and where I trust^^",
      "time": 1697084028,
      "translated": false
    },
    {
      "author_name": "Audrey Sng",
      "author_url": "https://www.google.com/maps/contrib/101936698042033779257/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX5GNBvm-HMMX-2EtXdj52NaIjqjjJH7_YRHlAwcxqGjdinrhIH=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "Been seeing Dr Wong since I was a kid, so kinda my family doctor. Dr Wong is patient and asked many questions during consult, really good doctor if you can ignore the 2 auntie receptionists. When they get overwhelmed, they tend to be a bit rude, loud, impatient and direct so yea.\n\nYou are lucky if u meet the young lady or young man receptionist, the guy who is very friendly, patient and knowledgeable. The queue to see the doctor can be long sometimes. Try to avoid morning time. Afternoon 2-4pm slot has lesser people usually.",
      "time": 1723353561,
      "translated": false
    }
  ],
  "types": [
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10194267684195363000",
  "user_ratings_total": 101,
  "vicinity": "283 Bishan Street 22, #01-185"
}