{
  "formatted_address": "No. 15-A, Jalan Nadi 3, Taman Bukit Senadi, 79000 Iskandar Puteri, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.4400173,
      "lng": 103.6320076
    },
    "viewport": {
      "northeast": {
        "lat": 1.441504230291502,
        "lng": 103.6334215802915
      },
      "southwest": {
        "lat": 1.438806269708498,
        "lng": 103.6307236197085
      }
    }
  },
  "name": "ASPIRAS Property Management Sdn. Bhd.",
  "place_id": "ChIJC3MfGT1z2jERqKKq1Z_z-mA",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Naim Nasah",
      "author_url": "https://www.google.com/maps/contrib/115222946247470118367/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVXXodWkRlnSZ9IpQZJH-zqX_KcaPynZ1ac_N67yyDOnBmHjwH3=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "I love the concept for the herbs garden in Ujana Executive Apartment . its really help the residents for those who love gardening that no have space in hi rise building ! and also the composting bin is a really amazing idea . Thanks to Aspiras Property Management for make it real and  Ujana Executive Apartment become more peaceful",
      "time": 1607481972,
      "translated": false
    },
    {
      "author_name": "zulfauzi zakaria",
      "author_url": "https://www.google.com/maps/contrib/101048821561020489917/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUiVFIL5GK7A8LaVK5jPbEM-Byt8EEdj2jsXveLkuAYxoOURPjK=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Good service from this company. Already used their service almost 4~5 years. A lot of issues they settle for our taman including issues with local authorities, maintenance and many more.",
      "time": 1735702389,
      "translated": false
    },
    {
      "author_name": "Mohd Nadzri Ahmad",
      "author_url": "https://www.google.com/maps/contrib/102321462144308539420/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKbHd8Y9hdEQQiAeW8dL_vFqR8jQqMGJYu9kGrHQ1ekBRqtNg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Good service from this company. Already used their service almost 5 years. A lot of issues they settle for our taman",
      "time": 1735193100,
      "translated": false
    },
    {
      "author_name": "Kavitha VijayaKumar",
      "author_url": "https://www.google.com/maps/contrib/106533225395970091839/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLFJVt6blzOM3uYYhdU0EarLI-GGPnzwV_Rj9PblualUPi6zA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "As an Ex-JMB Committee Member of The Twin Residence Apt since JMB formed in 2017, the accusation by one of the resident is not relevant to the management agent. Aspiras Property Management Sdn Bhd (formerly known as HBA Property Management & Consultancy Sdn Bhd) took over from previous Management Company without any proper hand over on Jan 2018. The previous MA deleted all the data from the system. The data for all units have to be keyed in one by one and it took time for the MA to complete the task. They updated the accounts and submitted to the auditor (appointed by the developer) at the end of 2018. Auditor came back with the draft audit on September 2019 and the AGM was called on 15th December 2019 (The finalising of the Audit Report is delayed because a lot of documents were missing due to the previous MA and Aspiras need time to recover the missing documents). From July 2019 on onwards, MA already posted all the income and expenditure details and minutes of meetings on the notice board. As Ex-JMB members we are really happy and satisfied with the service provided by Aspiras. Furthermore after the takeover, Aspiras also checked and listed out all the defects left by the Developer and filed the case in court and manage to get a compensation amount of RM475, 000.00 from Johor Land Berhad. I take this opportunity to thank the MA Company (Aspiras Property Management Sdn Bhd) for job well done.",
      "time": 1622198672,
      "translated": false
    },
    {
      "author_name": "eagle bikers",
      "author_url": "https://www.google.com/maps/contrib/105465672422208937422/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJLu6Yq0w_mRLtK3mT8Jg7QLp0Ugn9MM2NSt6JQTHBKVsFiiA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "What professional property management companies, for us this is our second year dealing with Aspiras Property Management Sdn Bhd (formally know as HBA property management). They understand what was the expectation of residents and the JMB, the first year when we handover to Aspiras from the developer there is a deficit of account. Most of them seem like first-time buyers find out didn't follow DMC & House regulations, then only Aspiras Senior Manager who came in to picture (Mr. Shanmugam @Shan). I was amazed at his knowledge of building management, work hard to resolve all problems in months. The second task, commend area electrical bill always 30k to 50k monthly, we sit down with Mr. Shan and discuss how to reduce it. He was really good in the case study and callup the developer and check any leakage underground or not and the finding was negative. The situation does not end their base on his experience, he find out TNB double-tagged JMB & end up he claim up to 200k from TNB for cause of their negligence. The third task they move to a collection, so far collection up to 80-90%. When the developer time this property we have only 6 CCTV cameras, the collection is good upgrading works ongoing now our apartment got 32 units of CCTV cameras. Because of them, our property value is up and we leaving safely now, In an incident that happens their response is super fast don't even care day or night & day off or public holidays. Good organizations always lead by a good leader like you Mr. Naga, thanks to the higher management team as well. Hope to get this kind of aid always.",
      "time": 1607487872,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6988165639628825256",
  "user_ratings_total": 34,
  "vicinity": "No. 15-A, Jalan Nadi 3, Taman Bukit Senadi, Iskandar Puteri"
}