{
  "formatted_address": "38 Irrawaddy Rd, #05-21/22 Mt Elizabeth, Specialist 329563",
  "geometry": {
    "location": {
      "lat": 1.322244,
      "lng": 103.844043
    },
    "viewport": {
      "northeast": {
        "lat": 1.323574930291502,
        "lng": 103.8454159802915
      },
      "southwest": {
        "lat": 1.320876969708498,
        "lng": 103.8427180197085
      }
    }
  },
  "name": "Astra Women's Specialists by SMG (Novena)",
  "place_id": "ChIJkxQZrOAZ2jER9VeIG1qN2fc",
  "rating": 3.2,
  "reviews": [
    {
      "author_name": "JS Tan",
      "author_url": "https://www.google.com/maps/contrib/104489940031298369580/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJRFnSDkns6WfLQrlJ74AzOQ0eWa6CBZqSPcin16VvITRUYdc6r=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Worst experience ever with Dr Cathryn Chan. Even with appointment the waiting time will go up to at least 2 hours. If you all do not have patience please do not visit .  The nurses will keep tell you 4 more in front and after one and half hour they will tell you one more in front. Just keep go on and on and on. Waste of your time. Going to polyclinic might be even faster than this appointment. Please do not waste your time to visit.",
      "time": 1740716821,
      "translated": false
    },
    {
      "author_name": "Arlene Kho",
      "author_url": "https://www.google.com/maps/contrib/105451342142141252662/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWXMzZOKgOZy4v-bWxxBJVKJLyGOhDixl_GSRNLnNkyyb38Km-t=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "Back in 2020, I visited gynaecologist for the very first time and got Dr. Cathryn Chan as I prefer a female gynae. It was the worst possible experience ever. She was extremely impatient and rude, didn’t explain anything but gets annoyed when I asked questions.\n\nI kindly told her that it was my first time and told her I was scared and would appreciate if she could be gentle. She was very, very rough with the pap smear, it’s almost she was in a hurry. It was painful, so naturally I flinched and she immediately scolded me. She got annoyed and again scolded me when I was breathing faster from the pain and nervousness.\n\nThe worst part is that she was scolding the attending nurse the entire time, be it over where the nurse was standing, the speed she’s walking, whatever. At one point, she asked the nurse to take something behind her, the space was tight so naturally the nurse brushed against her and the doctor got very annoyed and kept scolding the nurse for a good 5 minutes.\n\nOnce she was done, she said nothing. She started cleaning up and washing things. I was on the bed, wide open and cold, and the nurse and I locked eyes. I mouthed to her asking if I could get up, the nurse didn’t dare to answer me. At this point I was also too scared to ask so I laid there for 10 minutes while she quietly did her own thing.\n\nShe was also hard-selling the HPV jab, and kept calling me to convince me to sign up. I would’ve but the thought of going back to that room with the doctor scared me.\n\nI was young, naive and scared. To this day, when I chance upon her picture online, I get a flash of bad memories. It made me a little scared of gynaecologists and I’m glad the ones I’ve met after this have all been nice.\n\nI hope things have changed since then, but posting here for any young girls out there looking for their first gynaecologist, you might want to find someone friendlier :)",
      "time": 1733411938,
      "translated": false
    },
    {
      "author_name": "A Tiew",
      "author_url": "https://www.google.com/maps/contrib/117997497245152812318/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLXJ6BivoT9l-ceEBk_loTYUVPvQlNECic3S6SR8zkaVef_gQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "Visited Astra Women's Specialist for almost 13 years. Previously was with my babies gynaecologist. And now visiting Dr Cathryn Chan for my ovary cyst follow up. The appointment booking was always easy, simple, clear and quick. All nurses are friendly and supportive.\n\nSpecial thanks to Dr Cathryn to her exceptional care and detailed examination.  She communicate clearly and display genuine concern to my matter every time I visited her. Dr Cathryn understand we, as a patient, always have many questions and doubt that wish to clarify.  Thank you for listening, being patient, and not rushing through exams. It feels great to know Dr Cathryn has my best interest at heart. This gesture really make me feel at ease each time after my visitation.",
      "time": 1722306763,
      "translated": false
    },
    {
      "author_name": "bb huang",
      "author_url": "https://www.google.com/maps/contrib/101996588516118957809/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXMlyrbYVRiHdPPPh7-9lLfUvFRf5A2BMOYoeNeKSJMtYvE8YS4=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 2,
      "relative_time_description": "8 months ago",
      "text": "The clinic environment was pleasant and the staff at the desk were friendly and professional.\n\nHowever, Dr Cathryn Chan was the complete opposite. The doctor was late to our appointment but she also had other patients before me, so I had to wait almost 2 hours after my appointment time to see her. This was not a matter of other patients before me being tardy, as the doctor walked into the clinic late while all of us patients were waiting for her. There was no apology for her lateness from the doctor herself.\n\nHer bedside manner as a physician was lacking in empathy and compassion. She seemed more concerned with reprimanding her staff for a minor printing error during the actual appointment rather than explaining my results and answering my questions about my diagnosis.\n\nI would not recommend her to anyone seeking medical care. Perhaps a different doctor at the same clinic would have been a better experience.",
      "time": 1724737150,
      "translated": false
    },
    {
      "author_name": "Rachel Tan",
      "author_url": "https://www.google.com/maps/contrib/111944693421479428043/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLU1L_1FLbF8QryOTWMUVTuI1Coe8qsHmopCZ70HjldOZVu2g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "Thankful to see Dr James Lee, an excellent, skilful, patient and gentle gynae.  He took time to listen to my issues, successfully did my open wound hysterectomy as I had multiple fibroids (more than 10). Everything went well and smooth under his care and direction, even the anaesthetist he used, Dr Lim Yong Chuan was effective. Nurses in the clinic are warm and helpful, Yee Shin & Joanna. Grateful to have a renewed body and life!",
      "time": 1723786879,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17859461215462905845",
  "user_ratings_total": 79,
  "vicinity": "38 Irrawaddy Road, #05-21/22 Mt Elizabeth, Specialist"
}