{
  "formatted_address": "290 Orchard Road #07-09, Medical, Tower 1 Paragon, Singapore 238859",
  "geometry": {
    "location": {
      "lat": 1.3044544,
      "lng": 103.8360724
    },
    "viewport": {
      "northeast": {
        "lat": 1.305633030291502,
        "lng": 103.8376267802915
      },
      "southwest": {
        "lat": 1.302935069708498,
        "lng": 103.8349288197085
      }
    }
  },
  "name": "Atlas Eye Specialist Centre @ Paragon Medical",
  "place_id": "ChIJC-9XNZIZ2jER9zOK-o__cug",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "GLENN CHO JIN",
      "author_url": "https://www.google.com/maps/contrib/117657373952301141739/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK9LpHQkwnVQhM_EyAVFddPUpRJMlmz31p0laM2YhgMAohJze4=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "I recently underwent PRK eye surgery at Atlas Eye Specialist Centre and had a great experience from start to finish. The staff were professional, attentive, and reassuring throughout the entire process. Dr. Chan and his team provided clear explanations and excellent care, making me feel confident and well taken care of. Recovery was smooth, and I’m very happy with the results. Highly recommend Atlas Eye for anyone considering vision correction surgery!",
      "time": 1746693829,
      "translated": false
    },
    {
      "author_name": "Joyce Padfield",
      "author_url": "https://www.google.com/maps/contrib/114278110506128214052/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVT1ugEs6Djo1tQ7yjItbcSv4BYmBzvg_OcqfbpsypQDmDlbIEY2w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I had cataracts surgery done by Dr David Chan a month ago. From the first to the final consultation, my experience with Atlas Eye, Dr Chan and all the staff involved has been extremely pleasant and seamless. My journey started with a detailed eye examination which put me at ease as I now know the exact conditions of my eyes. After the surgery date was confirmed I was briefed on what to expect pre and post surgery. Communication has been seamless throughout as my queries  were attended to professionally every time whether in person or through WhatsApp. It was never rushed and I felt I was well informed and looked after. On the day of my surgery which was split into 2 different days, the staff were there on both days to make sure I was ok.  During the surgery, I was quite anxious to begin with especially during the first surgery on my right eye. However after witnessing Dr Chan’s expertise and what an amazing job he did, I was able to relax during my left eye surgery 2 days later. The post surgery instructions were succinct and mediations packed in such a organised manner that nothing can be misunderstood. I will not hesitate to recommend Atlas eye to anyone who is looking for first class eye care.",
      "time": 1743067072,
      "translated": false
    },
    {
      "author_name": "Xin Ling",
      "author_url": "https://www.google.com/maps/contrib/105390734943805128079/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLDyY8vVFRC_oIAVotAJtN_zNHxN2LW3CkJCzXgYlFrB9B2Fw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "Great experience at Atlas Eye Clinic! Dr Wong attended to me even though I made an urgent appointment on a Saturday morning due to a cut in my cornea. Dr Wong was professional and answered all my enquiries patiently. The whole consultation was not rushed at all and he took time to explain my eye situation and solution to me. The receptionists are friendly and helpful too. Thank you for the excellent service rendered!",
      "time": 1747362615,
      "translated": false
    },
    {
      "author_name": "Angeline K",
      "author_url": "https://www.google.com/maps/contrib/103992113204582290861/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKtf9hG2sIfRUDl2l3AMoB2q9ZPUS0Jd2yAVpvp9O89eCG7Gw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "After one year back for my review Dr Wong assessed my eye condition, very happy with his professionalism, very friendly and detailed.\n————————————————————————————\nThe best decision that I’ve made!\nDr David Chan and the whole team expertise and care have truly made a difference in my eye health. Thank you for your dedication and professionalism.\nFrom making appointments to my surgery only took me one month plus, no long waiting time during appointments although there’s always quite a number of patients in the clinic. I had done my cataract with multi focus lenses implant. So far my vision is almost perfect as it’s just 5 days after my surgery. No regrets! No glasses needed anymore :D. The whole surgery process was pain free 👍🏻  it solved my reading and short sighted problem. Glad that I come across your clinic when I google online. I’m so lucky!",
      "time": 1741161511,
      "translated": false
    },
    {
      "author_name": "Douglas Lin",
      "author_url": "https://www.google.com/maps/contrib/105163989426127914305/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV3OR8BBQjTE5rmM2NrmxLfYiuTFaW1XM1UnUrx8zsiAPXtxRo=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I brought my wife to the clinic recently for an eye issue, and we were both really impressed with the care she received. Dr. Wong was incredibly warm and friendly—he made her feel comfortable right away. He reassured us that her corneal abrasion would heal quickly, but also took the time to explain what steps to take if things got worse. The staff were professional and the whole experience was smooth and reassuring. I’d definitely recommend this clinic to anyone looking for quality care.",
      "time": 1745027288,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16749730957993063415",
  "user_ratings_total": 1162,
  "vicinity": "290 Orchard Road #07-09, Medical, Tower 1 Paragon"
}