{
  "formatted_address": "116 Changi Rd, #02-08 WIS@Changi, Singapore 419718",
  "geometry": {
    "location": {
      "lat": 1.3164491,
      "lng": 103.9012131
    },
    "viewport": {
      "northeast": {
        "lat": 1.318006880291502,
        "lng": 103.9025185802915
      },
      "southwest": {
        "lat": 1.315308919708498,
        "lng": 103.8998206197085
      }
    }
  },
  "name": "AtTartil Quranic Institute",
  "place_id": "ChIJIyMxa98X2jERcw82WDazmMI",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Muhd Alqushairy",
      "author_url": "https://www.google.com/maps/contrib/110459534213291387181/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL8wrrzu8zrB4O22mFvPNOHtAO04c1wqSMUow8H44fZCW3KEw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "My journey with AtTartil Quranic Institute goes way back since 2015 and it has been transformative.\n\nI first enrolled in the Refresher Solat course with AtTartil.\nFollowing that, I joined the Belajar dan Mengajar Al-Quran program at Assyafaah Mosque.\nUnder the guidance of Ustaz Zulkiflee, I progressed from a basic reader to achieving my ARS Tier 2 certification.\n\nMotivated to further my learning, I then enrolled in Quranic Language Made Easy (QLME 7).\nThe structured and engaging curriculum offered by AtTartil deepened my appreciation for the language of the Quran and sparked an interest in Arabic.\n\nBuilding on this foundation, I pursued a Diploma in Arabic Language at Zuhri Institute and successfully graduated. Alhamdulillah, thanks to the strong Arabic base I gained through QLME, I was able to enroll in the Diploma program from Nile Centre in Egypt. I was even granted exemption from several semesters based on my entrance interview test—something I credit to Ustaz Zulkiflee’s impactful teaching and guidance throughout my journey.\n\nAlhamdulillah, I’ve since completed the QLME program and graduated with two diplomas in Arabic language with good results. I am deeply grateful to AtTartil, Ustaz Zulkiflee, and all the dedicated teachers for playing such a significant role in my spiritual development.\n\nWhat I value most now is that I can truly appreciate the speech of Allah — the Quran.",
      "time": 1747109502,
      "translated": false
    },
    {
      "author_name": "Raihan Mohamed Wapa",
      "author_url": "https://www.google.com/maps/contrib/109485698773123741128/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVJrZenuDlIQSG9bNafHuwto8LCK4xxXoPW788R1jBPV1gyoiq-=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "I was a graduant of the Quranic Teacher's Preparatory Course (PICGAS) batch 2. Alhamdulillah and Masya Allah, At-Tartil QI and its esteemed line-up of trainers has made me realize that reading the Quran is incomplete without understanding and application. At-Tartil QI has repeatedly driven home the point that skills and tools learnt are secondary to the primary reason that we learn the Quran; which is to embrace the messages of Allah contained in the miracle which is Al-Quran..",
      "time": 1747101741,
      "translated": false
    },
    {
      "author_name": "Noraini Dawi",
      "author_url": "https://www.google.com/maps/contrib/103472197464986345487/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLPNcTaWRFSggkpPKAFxzUaklyjjgofj2xjxED7s_n5vHfLzQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "Alhamdulillah.\n\nMy journey with AtTartil began in 2010 when I started learning tajweed and attended the FBDS course (Understanding Recitation in Prayer) at Masjid Alkaff Kampung Melayu under the guidance of Ustaz Zulkiflee Bachik. It was truly eye-opening—understanding our prayers through the surahs and basic Arabic grammar back then helped me discover the beauty and sweetness of solah.\n\nI’m deeply grateful to Ustaz for his dedication and patience in nurturing students—from tilawah to tadabbur. Biiznillah, with his continuous encouragement and motivation, I was able to persevere and graduate from the Qiraati Teachers Certification Programme at Masjid Mujahidin in 2011, attain the ARS certification, and complete the Quran Language Made Easy (QLME 3) programme.\n\nAlhamdulillah, I am now honoured to be part of AtTartil as a Quranic teacher.\n\nThank you, Ustaz, for being a visionary educator—recognizing our potential, inspiring us to teach, and guiding us with care. You showed us that students can grow into teachers.\n\nUstaz’s approach to Arabic grammar through the lens of the Quran was transformative. It brought the verses to life and revealed the deeper meanings within the structure of the words. Even with no prior foundation in Arabic, I was able to follow his lessons, thanks to his structured and beginner-friendly method. This sparked my curiosity—not just about the language, but also the wisdom the Quran holds.\n\nWhat sustains me is the realization that this journey is an act of worship. Understanding the Quran isn’t about instant mastery—it’s about sincerity, patience, and allowing its words to gradually transform our hearts and lives.\n\nTo those just beginning: don’t be discouraged by the challenges—they’re part of the journey. Stay committed, and remember—every small effort is seen and rewarded by Allah. The Quran is a light for all who seek it.",
      "time": 1747288729,
      "translated": false
    },
    {
      "author_name": "Noor Lailee",
      "author_url": "https://www.google.com/maps/contrib/111734506853961952014/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKNvujmsxz9xEWhtH0qP0kMobl4WqVHqBi2Q1bzQySo53CqRg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "I have completed PIQAS 1 in 2021 and overall, it was a positive experience before I embarked on my journey to Zuhri taking up Diploma in Quran n Sunnah.\nThe course was  – informative, engaging, challenging and the  Ustazs were very supportive and knowledgeable.\n\nI would recommend this course to anyone interested in the subject.",
      "time": 1745237071,
      "translated": false
    },
    {
      "author_name": "Sharul Nizam Bin Jamiaad",
      "author_url": "https://www.google.com/maps/contrib/117899700214849751917/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKfj-4CQE352_MQdaJM7hec04raD_5q2QiFPHSrodVZ86nhTok=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "I enrolled in a Quran recitation course jointly organized by At-Tartil and Masjid Assyafaah and was thoroughly impressed by the structured teaching method. The materials provided were organized and visually structured , which helps in understanding and retaining the information. I remember Ustaz Zulkiflee Bachik telling us \"Saya tak nak awak tahu. Saya nak awak master.\"\n\nUnder the dedicated guidance of Ustaz Zulkiflee Bachik, I also successfully completed and passed the Qiraati programme. Following that, I went on to apply for and attained the ARS certification.\n\nCurrently, I am enrolled in At-Tartil's Quranic Language Made Easy (QLME) course.\n\nI highly recommend At-Tartil for anyone seeking to start on their Quranic learning journey.",
      "time": 1747527952,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14022154485807583091",
  "user_ratings_total": 44,
  "vicinity": "116 Changi Road, #02-08 WIS@Changi"
}