{
  "formatted_address": "9 Temasek Blvd, #29-01 Suntec Tower 2, Singapore 038989",
  "geometry": {
    "location": {
      "lat": 1.295515,
      "lng": 103.858999
    },
    "viewport": {
      "northeast": {
        "lat": 1.296813780291502,
        "lng": 103.8604581802915
      },
      "southwest": {
        "lat": 1.294115819708498,
        "lng": 103.8577602197085
      }
    }
  },
  "name": "Autism STEP",
  "place_id": "ChIJVQC1B68Z2jERc7FSiFzUFVA",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Jonathan Poh",
      "author_url": "https://www.google.com/maps/contrib/105038509030586401585/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLDji5_b13OjtGeT4RTwJNrVcXgDswXeUKI0Adxc_QvAZH4TQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I would strongly recommend AutismStep. My bahy had a 3 months session with them and already within the 1st two weeks he had shown very big improvements. They are very transparent when it comes to the pricing when u consult them so that you would not have any surprise charges. Ms Aryssa was my child's Case Manager. She clearly knows what my son needs and tackle his weaknesses. My child loves having classes with her. 👍.",
      "time": 1740458345,
      "translated": false
    },
    {
      "author_name": "lola Lalola",
      "author_url": "https://www.google.com/maps/contrib/113716478323545674455/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUNUJvyeEISn53255fUwfw07oRhC3FGmObtyJuRpeyZrTKERq2cZA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I highly recommend Autismsteps for anyone seeking early intervention for their child. The therapists (Teacher Iffah and Teacher Bavi) who worked with Ali have made a tremendous impact on his development, particularly in his speech delay. Over the past three months, Ali has shown remarkable improvement, and we are truly grateful for their dedication and support. Their expertise and personalized approach have been invaluable in helping Ali progress. If you’re looking for effective and compassionate therapy, Autismsteps is a fantastic choice.",
      "time": 1740382827,
      "translated": false
    },
    {
      "author_name": "Natasha Lai",
      "author_url": "https://www.google.com/maps/contrib/114045605511527553500/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIZilNZlXcd46BxAnC8YVkLGRQZiphgnPXnl61LFTjU4l0ocoU=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Our son was 3 years going 4 years old when we decided to engage AutismSTEP to intervene. In fact, we noticed that he displayed some signs of mild autism since he was about 2-3 years old but we were not sure if it was autism or if it was something he would outgrow.\n\nOur son seemed to be in his own world at times and he would go into meltdown mode if things were changed from what he expected them to be. New experiences were also overly stimulating for him.\n\nWhat made us seek professional help was that although he was perfectly vocal and speaking in proper sentences at 4 years old, whenever he was in social settings (e.g. playing with other kids at the playground), he would 'roar' at other kids and chase them, then get upset when they didn't want to play with him. When I asked him to tell them nicely that he just wanted to play with them, he cried and said \"I don't know how to say it!\"\n\nFauzia was the therapist assigned to work with our son at our home. Initially, our son would throw tantrums whenever he didn't want to do the activities that were planned or if he had to comply to certain behaviours, such as asking for permission to leave the room to get a drink. He would cry and kick and hit.\n\nAs the sessions progressed, Fauzia taught our son to communicate his needs/wants and slowly learn to accept that sometimes things don't go the way he expects; that sometimes he may win at games and sometimes he may lose. Our son became more tolerant of 'losing' and of unexpected outcomes. He also learned appropriate behaviours for social settings.\n\nIt was a 7-month journey with AutismSTEP and we could see improvements in our son's behaviour. He became more receptive to suggestions by his peers and caregivers on different ways of play, and he learnt to confidently express how he wanted to play with others or do certain activities. Although at times he would still forget to communicate his needs and wants, we recognise that this is still a work-in-progress, and that we could tap on the benefits that the therapy had brought for him and us.\n\nThank you AutismSTEP and especially to Fauzia for your patience with our son since he started therapy, and also for changing the activity plans to cater to his needs and interests. We are deeply grateful! =)",
      "time": 1696078058,
      "translated": false
    },
    {
      "author_name": "Abdul Muhaimin",
      "author_url": "https://www.google.com/maps/contrib/117385746251672137064/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL5bE_Iy6N7tKM7baC1TbVT9-4ZuTjTkMWsQbLDO-EvP4iH6U4=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "I had an excellent 6 months of service with Autism STEP.\n\nTheir case manager was excellent and my son manage to settle with her very well.\nMy son manage has better speech interaction now.\nThank you for being the bridge while he was waiting for EPIC school!",
      "time": 1729379308,
      "translated": false
    },
    {
      "author_name": "Charizz CE",
      "author_url": "https://www.google.com/maps/contrib/109210178098234699110/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJj7UhmMHH7_yb-v6eraa13oiqJ5ceC3UF9tSG5O5_icEaeGKs=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "Having engaged AutismSTEP's services for two years now, I'm thrilled to share the remarkable progress my 4-year-old has made. Before starting therapy, I worried about his ability to make eye contact, follow instructions, and communicate effectively. However, from the very beginning, the experience has been smooth and reassuring. Thanks to the dedication of the therapists, my child has shown significant improvement in all areas – he now confidently makes eye contact, follows instructions, and communicates non-verbally. While the professionalism and skill set of AutismSTEP are commendable, there is room for improvement in punctuality and attendance among some therapists. Nonetheless, my overall experience has been generally positive, and I'm grateful for the support and progress we've achieved.",
      "time": 1709739515,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5770751991434359155",
  "user_ratings_total": 47,
  "vicinity": "9 Temasek Boulevard, #29-01 Suntec Tower 2"
}