{
  "formatted_address": "131 E Coast Rd, Singapore 428816",
  "geometry": {
    "location": {
      "lat": 1.3061134,
      "lng": 103.9049587
    },
    "viewport": {
      "northeast": {
        "lat": 1.307416330291502,
        "lng": 103.9062602302915
      },
      "southwest": {
        "lat": 1.304718369708498,
        "lng": 103.9035622697085
      }
    }
  },
  "name": "Awfully Chocolate",
  "place_id": "ChIJ4dRMyXIY2jERHIjGP0HvM-M",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Lim Xin Yi",
      "author_url": "https://www.google.com/maps/contrib/109587617487766634821/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU28b7G9RkyiQ8lr0etiQxrQFuG2jXpA7_S8pXbOTThcAo9NkzvNg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "Got the dinner set (starter and main). It was our first time there and we were immediately pleasantly surprised by the friendliness of all the staff, who greeted us with warm smiles.\n\nFor the starter, waiter recommended the Singapore Borscht, which was alright, I liked the depth of flavours but BF thought it tasted quite regular. I got the beef mille-feuille, which I loved!! The puff pastry was crispy and light, and the beef pieces were tender and generously dished. The chocolate sauce was an interesting part of the dish that went well with the rest of it.\n\nBoth of us got the steak for the main, which was cooked and seasoned really well, especially for the price!! Loved the truffle fries too; crispy and light.\n\nWe also added on the Pample Mousse Lemonade, which was refreshing and delicious. Had a slice of chocolate caramel cake too for dessert! Overall 10/10, would come here again. ☺️",
      "time": 1745244024,
      "translated": false
    },
    {
      "author_name": "La Ken",
      "author_url": "https://www.google.com/maps/contrib/111893255516042188632/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKZq_ZUH7Al-B8K5x3p14h402wwU9EETTbUKV4-iX6cLPFUIM2D=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "The Awfully Chocolate buffet is absolutely worth it! We loved the crab pasta—so flavorful and well done. And what a surprise to see Mike again here after meeting him at the Wisma branch. He's still just as kind and very helpful—we’re so glad he was around during our Mother's Day brunch. Our mom was really happy with the service, and it made the whole experience extra special.\n\nAnd of course, as always, the chocolate buffet is a total winner! Love it here 🫶🏼\n\nPS! Get their fresh chocolate milk. 🥰",
      "time": 1746932855,
      "translated": false
    },
    {
      "author_name": "Borja Ferraz Velez",
      "author_url": "https://www.google.com/maps/contrib/103148674442629790905/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWGpUnGsi6IaPKizznuHFXGFAu4v0EufjBPuXCBlwo2QRmKpd-37A=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "Weekend brunch. They mean well and have good manners and smiles. They work really hard but they have too many customers for the brunch. The place is too small for that amount of people so you feel a little bit trapped, not comfortable. Food is just ok but desserts and chocolate are delicious. Drinks are overpriced and not included, only coffee and tea with a discount. Hazelnut truffle is amazing as most of the treats. Price is reasonable for the amount of food and quality of desserts you get. The yogurt bar is top. As a chocolate bakery it cannot get any better. As a weekend brunch it does make my top list but is still good, especially for the desserts.",
      "time": 1745124916,
      "translated": false
    },
    {
      "author_name": "Benedict Chua",
      "author_url": "https://www.google.com/maps/contrib/111915063884081471920/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW44Exu8eSHVeMyDdQtphGxFuiwwWGfqszZOYtRJGioprC74XU=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Great buffet that consistent of a very westernized breakfast we picture in movies - processed meats, eggs, mushrooms, bacon. The desserts were great - of course. Their main dish well-prepared, offering a spread of pasta, pie and burger choices.\n\nThe innovation from their owner can be seen, who as we know was a talented lawyer. Taking up the challenge of expanding business from desserts to main courses, and doing it quite well! This adventurous entrepreneur mindset is something worth taking notes for other businesses.\n\nHowever, this westernized breakfast buffet could be further elevated if it was transformed into a buffet that serves seasonal food or local food, such as Nasi Lemak or Laksa. The desserts do not need too much improvement, because it is specialised in that aspect already.",
      "time": 1742659196,
      "translated": false
    },
    {
      "author_name": "Dazzledear Co.",
      "author_url": "https://www.google.com/maps/contrib/112655256843349426684/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVb8pwza89KDlhoL_7ptoWRTDtiiDJWUNj-gaOY8VpYxnOyF0JO=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "We had a great brunch buffet in Awfully Chocolate. We love the brunch, the coffee and all the desserts especially the chocolate raclette! Our little one ate the yogurt and the fruits which she love very much. Staff are very attentive and thoughtful. Will surely come back.",
      "time": 1746864550,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "bakery",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16371692133943773212",
  "user_ratings_total": 2072,
  "vicinity": "131 East Coast Road, Singapore"
}