{
  "formatted_address": "S-09-01, Pusat Komersil Visi Medini, 2, Persiaran Medini, Bandar Medini Iskandar, 79250 Iskandar Puteri, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.4168013,
      "lng": 103.6223717
    },
    "viewport": {
      "northeast": {
        "lat": 1.418136830291502,
        "lng": 103.6237839302915
      },
      "southwest": {
        "lat": 1.415438869708498,
        "lng": 103.6210859697085
      }
    }
  },
  "name": "Ayam Penyet Banjir Bandar Medini(Legoland )",
  "place_id": "ChIJ_XjW980L2jERLeJcSJyKG6M",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Dion L",
      "author_url": "https://www.google.com/maps/contrib/101836653562900623873/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIoxqJapfUPU-JKHo-ZsMu-xWLCOQ0b-M8VR4LC4bqAbwR-oqg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "So happy to find another nice penyet house around the area! I tried cili hijau and lemak cili api with ikan keli, and they both tasted very good! Both cili not too spicy so it’s great for me and people who couldn’t consume too much spiciness. Their tempe has daun selasih if I’m not wrong, which tastes even better than others. Lemak cili api goes very well with plain rice. Ikan keli fresh. And the teh  tarik, at first too sweet although I ordered kurang manis but after their staff adjusted for me it’s spot on. Rare nice teh tarik you could find around here (better than the mamak next to it I would say). So overall very recommended.",
      "time": 1741962263,
      "translated": false
    },
    {
      "author_name": "Victor Ng",
      "author_url": "https://www.google.com/maps/contrib/115343125507441223772/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKcqOK80-PeAlasZdZRu6VWPvo1x0vjbJzMGsEdA_v3s_1M4Q=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "9 months ago",
      "text": "Lemak Ciliapi 👍\nVery fragrant and distinctive aroma.\n\nAyam Penyet 🫲\nNice presentation. Chicken not bad. Sambal chilli lacked punch.\n\nAssam pedas 🫲\nGravy was flavourful and well balanced. But ikan pari was dry and overcooked. Rm17.50 for 3 tiny pieces of fish not worth it.\n\nBakso 🫲\nSoup was good but the meat balls were of low quality.\n\nTeh tarik 👎",
      "time": 1722642321,
      "translated": false
    },
    {
      "author_name": "Marie Amira",
      "author_url": "https://www.google.com/maps/contrib/111761153277097722330/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUTroWas2ql_TbweGTl80XNWuPLW7YI-8qDQQDTlaLTt9feET-CpA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "7 months ago",
      "text": "Edited on 22 Oct 2024\n\nHave to comeback here and edit my review mainly because of the staff.\nOur latest visit early Oct, 3 times visits.\n\nWhat we ordered.\nAyam Penyet: Same good taste.\nAsam Pedas Ikan Pari: pari tu keras. but okay je la maybe dia guna pari besar tu and the kuah still nice.\n\nStaff:\nFirst visit\nThere are 2 staffs, a chubby and skinny.\nThey always sit around. Most of the time the skinny girl will assist with orders. Yet the chubby girl will sit the whole time while others do work. She will have loud voice when she go to the hall towards the kitchen talking!\nThere's another girl (the tall) was commenting my next table order. Might be she's a regular there and im sorry i misheard the conversation but i think its inappropriate . The staff was commenting 'tak bosan ke order benda sama'  i know it's uncomfortable for the person because her face didn't know how to react with that comment. They should know how to play with words, instead of judgement statement they can just suggest something else.\n\nSecond Visit\nThese 2 young lady (chubby and skinny) will play mobile legends in front of the shop, the chubby will raise her voice 'order wei' instructing others to take order from us. Might be its their rest time, but you should know anyone working in service industry that is not the way you show your behavior in front of customers.\n\nThe third time we came, the same girls. The chubby was on video call. Talk with loud voice and was talking bad bout her friend. I didnt care bout the talking bad abt the friend but its that the way and place you should do your personal things. Its making other people uncomfortable with your judgement and comments throughout the conversation.\n\nMaybe they are too comfortable with the workplace till the point they have no respect towards the customers. I think its getting out of control. Even if the chubby girl is the owner's daughter/ niece or other relative, you should know how to have good manners during worktime. I took her picture but censored it with stickers for public but the owner or PIC will definitely recognise her.\n\n------------------------------------------------------------------------------\nMasak Lemak dia The BOMB\n\nTried few times sebab dekat je dengan rumah, around 10 minutes.\n\nFirst glance, macam tak cukup je nasi n lauk. But when you ate it just nice and actually a recommended healthy portion.\n\nSince we been here often, we tried mostly everything on the menu.\n\nMasak Lemak semua the bomb, but daging salai tu liat sikit. But the taste and the smell just meet the delicious expectation. Macam orang tua Nogori masak.\n\nThere is 1 time datang, nasi mentah sikit (forgiven since its just one time)\n\nTiming plak stated 10am, but i pernah datang 1010am and masih half of the shutter buka. I didnt bother to ask so i just left.\n\nThe owner is friendly, they always around to ask for any feedback. They didn't ask us, but it's okay. We just observe.",
      "time": 1729591289,
      "translated": false
    },
    {
      "author_name": "Anonymous",
      "author_url": "https://www.google.com/maps/contrib/115471202590728702632/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUeyO9T49oELizIljvnUINwc5JKftZBATWEMSopw1YvtRu5Z2ZM2Q=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "Very disappointed with the staff.. they will stare you like you did something wrong when entering the restaurant,, but why?? I didn’t do anything leh.. please educate your staff!! 😔😔",
      "time": 1747134211,
      "translated": false
    },
    {
      "author_name": "Otnam",
      "author_url": "https://www.google.com/maps/contrib/113049556423083295099/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVKvVz6FNFNj1fYWu1SVaAYftazahJSXdlotu_NSlyLntmL2OfZ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "Worst takeaway ever. Won't be coming back!!!",
      "time": 1739073096,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11753140056387019309",
  "user_ratings_total": 64,
  "vicinity": "S-09-01, Pusat Komersil Visi Medini, 2, Persiaran Medini, Bandar Medini Iskandar, Iskandar Puteri"
}