{
  "formatted_address": "163 Ang Mo Kio Ave 4, #01-430 Mayflower Shopping & Food Centre, Singapore 560163",
  "geometry": {
    "location": {
      "lat": 1.3739204,
      "lng": 103.8376773
    },
    "viewport": {
      "northeast": {
        "lat": 1.375431730291502,
        "lng": 103.8390121802915
      },
      "southwest": {
        "lat": 1.372733769708498,
        "lng": 103.8363142197085
      }
    }
  },
  "name": "AZKEN",
  "place_id": "ChIJBVnEscQW2jERcu731uzbqkk",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Sahana Sengupta",
      "author_url": "https://www.google.com/maps/contrib/117093087817744571477/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWt9meRgEx4SQFpB43mBG1YhAvAvUvefZ_shoueqqGp1cQ8j6jX=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I started AZKEN for emath and amath in the earlier half of this 2024 based on a friends recommendation. Under Mr Lims guidance, I went from a C5 in Emath and C6 for Amath for secondary 3 end of year examinations, to an A1 in Emath and A2 in Amath for O levels. I attribute my great improvement to his teaching style which helped me first understand each topic, then allowed me to practice application of what i’ve learnt for that topic until I have thoroughly understood it. Mr Lin also gave me free extra lessons so I could catch up with previous topics, which was very generous and helpful of him. Joining AZKEN was likely one of the best decisions that I have made this year, and I am grateful to have had the pleasure of attending it.",
      "time": 1736601838,
      "translated": false
    },
    {
      "author_name": "Vivian Seow",
      "author_url": "https://www.google.com/maps/contrib/113726300650598611525/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJGhwP2Qcq4pBRlv3z4HENqh0X-XS-V83h89OdEvjVj4_vJUA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Was very thankful to attend  AZKEN through recommendation by a friend.  Mr Lim was a very experienced teacher who ensure that his students keep up to the learning pace.  My son had been weak in his Math but under the guidance of Mr Lim his math result had improved from 50 to 74 marks within a short span of 3 months.  Now my son is more confident to tackle difficult question and also had better attention span in school.",
      "time": 1725630521,
      "translated": false
    },
    {
      "author_name": "Rita Kok",
      "author_url": "https://www.google.com/maps/contrib/103711316807189900150/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXUuZGujb19qSGLZ-_qoO6fDT1Dtq8J0tZj5YAziZyhmr07kfJd=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "We are incredibly grateful to Mr. Lim for his dedication and expertise in teaching Mathematics to our daughter. Under his strict yet caring guidance, she not only improved her understanding of the subject but also developed the discipline needed to excel. Mr. Lim’s teaching methods are stern but effective, pushing students to reach their full potential while always showing genuine care for their success. Thanks to his support, our daughter achieved an AL1 in her PSLE Maths 2024 —a testament to his commitment and exceptional teaching. Highly recommended for parents seeking a teacher who prioritizes both learning and excellence!",
      "time": 1732081859,
      "translated": false
    },
    {
      "author_name": "Eunice Liew",
      "author_url": "https://www.google.com/maps/contrib/107927653985911096928/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXJ8apFOJjWpMokGUBI1sTHGchmoC_IYRmS26pDNoRnXxs_-g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "I'm thrilled with Mr. Lim's Math tuition for my son! Despite only attending for a few months, the impact has been remarkable. Mr. Lim's dedication, patience, and expertise have created a supportive environment that's boosted my son's confidence and understanding. I've seen significant improvements in my son WA3 result. His commitment to his students' success is evident, and I feel grateful to have him as a mentor for my child. Thank u Mr Lim",
      "time": 1726009861,
      "translated": false
    },
    {
      "author_name": "callie lim",
      "author_url": "https://www.google.com/maps/contrib/109095407466775519058/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJWROb_z08gEWcko8x1F5y9pSs9yD_2gy1QDfhguLkFUpmxJw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "I discovered Azken Centre through a fellow parent whose child also attends the math class. I enrolled my daughter, Yvette, in late May as she needed to strengthen her foundations. Mr Lim has been incredibly patient with her, focusing on her weaker areas and helping her build confidence in math. She's now able to assist her classmates and has shown significant improvement. Although Mr Lim is strict, his passion and commitment to ensuring his students understand the material are evident. Despite being intimidated by him, Yvette continues to attend his classes, indicating that she finds them valuable and beneficial. I am glad that we made the move to join Azken.",
      "time": 1725602187,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5308296921074888306",
  "user_ratings_total": 129,
  "vicinity": "163 Ang Mo Kio Avenue 4, #01-430 Mayflower Shopping & Food Centre"
}