{
  "formatted_address": "86 E Coast Rd, Katong Square, Singapore 428788",
  "geometry": {
    "location": {
      "lat": 1.3050837,
      "lng": 103.9041376
    },
    "viewport": {
      "northeast": {
        "lat": 1.306537680291502,
        "lng": 103.9054196302915
      },
      "southwest": {
        "lat": 1.303839719708498,
        "lng": 103.9027216697085
      }
    }
  },
  "name": "Baba Chews",
  "place_id": "ChIJZcQkYHIY2jERsDS_lBU0k_Y",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Ollie",
      "author_url": "https://www.google.com/maps/contrib/118163545905313468025/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI8ewAYhaDAvm6OGrjFSZQFtiPxbWWkrJK9ORTa3YK5J2TrMw=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "a week ago",
      "text": "The establishment is a clean and aesthetically pleasing restaurant with a rich history and Peranakan ambiance.  However, while the cuisine offers a fusion approach, my parents found the dishes unremarkable and lacking in authentic flavors. The char kway teow, priced at $22, was considered subpar. Service was slow, even with a moderately populated dining area, requiring multiple requests for attention and ultimately necessitating self-service.",
      "time": 1747066621,
      "translated": false
    },
    {
      "author_name": "Lim EV",
      "author_url": "https://www.google.com/maps/contrib/104896742533066212703/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXENA-YNNm8t4pXZUBBIFxmf6XiqTVYfOqI4MDj9diInls5xJvcfA=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Here for a company brunch and absolutely good food in terms of quality, taste and portion. Thank you for giving a great peranakan food experience. The keluak could score 5 stars if it’s left in the seed shell ;)",
      "time": 1743502776,
      "translated": false
    },
    {
      "author_name": "Felix Tang",
      "author_url": "https://www.google.com/maps/contrib/116717690657419692306/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV9BkXmsietx5zHzp_6GaF-21iaFDMBr-vID_x45Ey_LbAVgmbHkw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "2 months ago",
      "text": "Decided to give this place a try since I'm living in the neighborhood. Perhaps it's just me, but I wasn't 100% used to the Nonya fusion cuisine.\n\nNo doubt food was tasty, including the Kueh pie tie and dry bak kut teh. However I was anticipating more authentic flavours coming thru the food, which was muted probably to cater to western/foreign taste palettes.\n\nFor tourists looking to have a taste of Nonya cuisine, this would be a good place to start. Asians who are familiar with spice and diverse flavours may find this a little underwhelming.",
      "time": 1741182033,
      "translated": false
    },
    {
      "author_name": "Lizzy Mair",
      "author_url": "https://www.google.com/maps/contrib/102183569720474573051/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVPS8tAmMZniE89uOfUxDTfSEZ7IKMZX51NcJ-S3WDFU1fd7RdvJA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "Update on 5/1/25 - we had a much better and attentive experience with breakfast. Management came to us and genuinely wanted to learn about our dinner experience, and how to improve. We appreciated this gesture and decided to up our review as they really did a much better job at breakfast. The staff at breakfast was amazing and cared about giving a great experience.\n\nWe had a reservation at 7pm and our dinner ended after a very long 2.5 hours. Although the food and portions were good, the service was unfortunately abysmal. After ordering, the service became very slow with our water bottles were empty for 20 mins plus. I eventually had to get up myself to approach the bar table to ask for water. This is all with the restaurant not being full and a majority of tables were empty.\n\nWe waited 20+ mins for them to clear our entree plates, after waving someone down. The worst part was dessert - my husband’s dessert was first given to the wrong table and finally when it did come, it was different from what was advertised on the menu (AND different from another person of our party who ordered the same item). The mistake and inconsistency of the item made us feel like the restaurant didn’t care about customer satisfaction nor the quality of their dishes. The wait staff apologized for the delays and mistakes, but we don’t recommend the restaurant. It’s one of those situations where no matter how good the food, our experience told us it wasn’t worth it.",
      "time": 1736042485,
      "translated": false
    },
    {
      "author_name": "JA",
      "author_url": "https://www.google.com/maps/contrib/106754547848872225678/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWnCDMJrWQQhekveyZ2Rfg-LKWiHBR7cg3DEcF_PaiDi-m3ueUd=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "3 months ago",
      "text": "While the service provided by our waitress was excellent, unfortunately, the rest of our dining experience fell far short of expectations.  The food tasted stale and old, quite unlike what we anticipated based on the menu descriptions.  The drinks, advertised as elaborate mocktails, were disappointingly simple – essentially just syrup and soda water – and excessively sweet.  After the appetizers and drinks, we were so concerned about the quality of the main courses that we decided to cancel them.  The total bill of $68 felt like a significant overcharge for the poor quality of the food and drinks.  We were very disappointed with the overall experience. Furthermore, the male waiter was just coughing and sneezing in the establishment. Please look into personal hygiene.",
      "time": 1739614197,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "cafe",
    "bar",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17767602222201255088",
  "user_ratings_total": 977,
  "vicinity": "86 East Coast Road, Katong Square"
}