{
  "formatted_address": "31 Biopolis Wy, #01-06, Singapore 138669",
  "geometry": {
    "location": {
      "lat": 1.3043022,
      "lng": 103.7923788
    },
    "viewport": {
      "northeast": {
        "lat": 1.305484480291502,
        "lng": 103.7936334802915
      },
      "southwest": {
        "lat": 1.302786519708498,
        "lng": 103.7909355197085
      }
    }
  },
  "name": "Back Street Alley Kitchen & Bar",
  "place_id": "ChIJe5jFSxob2jERQIHIQ7Vz1fk",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "daniel",
      "author_url": "https://www.google.com/maps/contrib/109807255779824482297/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUfVUr9q1xmYH65UNNneUsHbZVvrjUpBEIX6maugSkO6A2Jy4ok=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 4,
      "relative_time_description": "8 months ago",
      "text": "Cozy atmosphere for a nice dinner! The server greeted us warmly and provided us with cordial service throughout our time here! Food also tasted yummy. Fish and chips and the pastas were great but the pork katsu was slightly tough for our liking. Drinks were good too and overall a nice place for a dinner, would come again!",
      "time": 1726921108,
      "translated": false
    },
    {
      "author_name": "Stephen Chan",
      "author_url": "https://www.google.com/maps/contrib/118174780318131705942/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVyfI1UMejzjIau9GlBvSFnPo2zH-PChQYs7xTQEG2FDzaSKcXi=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "This is a casual restaurant for after office hour drinks and food.\nThe fish and chips was very good. The chilli crab pasta was also quite unique. Grilled tiger prawns were fresh and juicy. We also had the special for the weekend, the Chicken Enchiladas. It was pretty good too.\nIn all, this is a place for good quality food amidst a casual setting.",
      "time": 1711267640,
      "translated": false
    },
    {
      "author_name": "Zelda Ang",
      "author_url": "https://www.google.com/maps/contrib/113793551078056374145/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJqsTISwSiCjSNv5RVXrR2vaT7ivQvs-vbetDYgJ_qYVkRA-g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Came for lunch and was warmly welcomed by 2 staffs, Sherlin and a younger lady. Both have provided very exceptionally service throughout our late lunch. They were both very patient, attentive and always smiling which put us in a good mood.\nWe were impressed with the fish n chips which the fish was fresh and can see the steam coming out when cutting it.\nThe mentai baked cheese scallop was also highly recommended as they were very fresh, big and baked in cheese til perfection. Definitely worth the money. The chilli crab pasta was quite a unique fusion of local delight with pasta. Overall,it tasted delightful filled with spicy sauce with bits of crab meat infused in the sauce.\nThe mentaiko fries came hot and full of mayo n mentaiko. Prob a great side when drinking.\nAnd we were able to top up $5 each to get a free flow bubble tea drink and with the types of topping and various choices of tea and it also included  a dessert of the day.\nOverall, it has been a very pleasant lunch with nice ambience, great service and good delicious food in good reasonable serving. Would definitely recommend to anyone who like fusion food.",
      "time": 1706272629,
      "translated": false
    },
    {
      "author_name": "CS Cheong",
      "author_url": "https://www.google.com/maps/contrib/113908243104221280056/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLPDwiojJ-SvJwEaOsCN63Jb-4vENIRK595PCNH-4UyOBWUvw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Was referred to this place and we organise a company gathering. We were blown away by the atmosphere, food and service. Place are cosy and too bad it was drizzling else we will have taken the outdoor sitting. Service are good and food was super!  I love the prawn and soft shell crab pasta!",
      "time": 1709864380,
      "translated": false
    },
    {
      "author_name": "Jed Jasman",
      "author_url": "https://www.google.com/maps/contrib/117282947560379570581/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLHv36Nr6B3wxqq-0V9fWCppILkrV1uaNEbOCGlJ9WcA4Upgw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Started off the dining experience with a pair of extremely friendly staff who were eager to serve us and patiently explained what was more famous on the menu. They also told us about the specials and 1for1 cocktail deals that they had.\n\nOrdered the truffle parmesan fries for starters and we were pleasantly surprised by the distinct truffle taste coupled with just the right amount of salty parmesan flakes. The taste was not overbearing and the fries were fried to crispy perfection\n\nWe had tiger prawns and bacon and mushroom carbonara pasta for our next items. The prawns were fresh and succulent topped with a tasty sauce while the pasta was rich and creamy. Presentation was 10/10 as well which enticed us to snap many pictures to show off to our friends.\n\nWe ended off our dining experience with a Rib-Eye main which was medium done. The meat was soft and had a smokey finish to it, complemented with nice garden greens and a great barbecue sauce to top it all off.\n\nWe ended our night with the aforementioned 1for1 cocktails which were stronger than expected and mixed really well.\n\nOverall, a really chill place both inside and outside of the restaurant. It was a nice cosy enclave and we are definitely hesitant about leaving this review as it would alert more customers to this great venue but good things must share! Hope yall enjoy your meals there as much as we did :)",
      "time": 1709385815,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=18002422307846914368",
  "user_ratings_total": 50,
  "vicinity": "31 Biopolis Way, #01-06"
}