{
  "formatted_address": "106 Faber Dr, Singapore 129415",
  "geometry": {
    "location": {
      "lat": 1.3204281,
      "lng": 103.7563832
    },
    "viewport": {
      "northeast": {
        "lat": 1.321788480291502,
        "lng": 103.7578511802915
      },
      "southwest": {
        "lat": 1.319090519708498,
        "lng": 103.7551532197085
      }
    }
  },
  "name": "Baker & Cook - Faber Drive",
  "place_id": "ChIJmWG7VY4b2jERC5lKQWodEwk",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "C",
      "author_url": "https://www.google.com/maps/contrib/108121427451405924195/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUVEFBMqVdde84YgM7RmJUjTlK2YyphjppNJiT0NgrZFZyAG6RYYA=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "Baker & Cook is a well-known artisan bakery and café brand founded by celebrated New Zealand baker Dean Brettschneider. Since its launch in 2012, it has become a staple in Singapore’s café scene, offering handcrafted breads, pastries, and hearty meals made with high-quality ingredients and traditional techniques.\n\nThe Faber Drive outlet is a cozy, neighbourhood-friendly spot that’s great for casual meals or picking up freshly baked goods. I had the Smoked Ham Quiche — it was decent, with a flaky crust and savoury filling. It’s also a good place to get quality bread, with a range of sourdoughs, baguettes, and loaves available daily. I’d rate it a 4 out of 5 — reliable, welcoming environment, and a solid bakery-café option in the area.",
      "time": 1747025085,
      "translated": false
    },
    {
      "author_name": "David Or",
      "author_url": "https://www.google.com/maps/contrib/115610539914534401779/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUXAj_8GcihNhiTsFHvUo0q9QGidTjw8HGLUuLYd843wQu3sWdAMA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "9 months ago",
      "text": "Went during a quiet Thursday afternoon, we were the only customers in the cafe. Ordered a simple sausage roll and coffee, price came back to $20.99. What ?\n\nEven though we were the only patrons, the sausage roll took an excess of 15 min to come. When it came, it was cold on the inside, which somehow surprised the staff despite her putting it in the oven (maybe microwave, idk) for less than a minute. Not sure why it took 14 minutes to turn the microwave on, 🫠\n\nThey then took the roll back, sliced it up even more, and put it back in the oven/microwave. Not sure where the $20.99 comes from though.\n\nWe live nearby, so have been coming here for years, and as of late, the standard/QC has dropped so badly! Management come on!\n\nStaff is nice though. Kind of. Overall standard is just poor.\n\nEDIT: wrote this before eating the roll. it tastes stale",
      "time": 1721899483,
      "translated": false
    },
    {
      "author_name": "Alvin Choo",
      "author_url": "https://www.google.com/maps/contrib/113288475978172355218/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWx2YoR8jyv9CXYEN2bZx05b7TTzWyN74pTQaSK0qxdPbY6by8H=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 2,
      "relative_time_description": "a year ago",
      "text": "Wanted to get brunch and decided to give this a try. We ordered the avo smash and mushroom omelette.\n\nThe food was rather difficult to get through. Bread didn't seem to have been toasted before serving so it was quite difficult to get through with the cutleries. The flavours were also of the individual components and didn't come together. Coffee was pretty run of the mill, nothing to shout about. At the prices they were charging, it really tarnished the entire experience.\n\nNot a place I will likely step food into again.",
      "time": 1711271658,
      "translated": false
    },
    {
      "author_name": "Yan L",
      "author_url": "https://www.google.com/maps/contrib/110111310600429209355/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocICM7GAcweHGcewSlPBO4yF1r0GXi3Zdpa49i2LD6WrHrfS0w=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "Arrived before 8.10am on a Saturday and it still had plenty of seats.  Nice ambience.\n\nOmelette was done very well. Not burnt on the outside and still slightly runny on the inside.  Generous with bread portions. Yummy.\n\nEggs Benedict was disappointing.   The yolks were overcooked when it should be runny.  We ordered 2 sets and the other one was bad, the egg yolk was almost fully cooked.\n\nWe had to ask for jam and butter which they gave without charge.\n\nCoffee was good.  Service was good and food was served to you. Found it a bit on the pricey side but its okay if you plan to stay for a while.  The tables are well spaced out and doesn't make you feel that you can hear every word from the neighbouring table.\n\nBought the Olive Baton home and its really good.  Nice place if you are looking for some quiet place to hang out in the morning.",
      "time": 1687221926,
      "translated": false
    },
    {
      "author_name": "J C",
      "author_url": "https://www.google.com/maps/contrib/114770297586934358958/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI7-JWLi_MY8FvX-988km8_aoFQTwH9x1aUYSzmQEhCPwVUEw=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "7 months ago",
      "text": "This place has changed a lot in the past 3 years. It used to be vibrant with very friendly staffs and good food. Now it’s lack of personal touch (feel hostile even when taking order) and staffs talking loudly amongst themselves, the cafe is empty at 9am. This cafe don’t feel welcoming anymore. I used to come here every other day and my children enjoyed their breakfast and dinner here. The standard has dropped so much and I haven’t been here for the past few months. It’s very disappointing to come back and know that nothing’s  improved. Even the latte now looks like it’s a sad way to start anyone’s day.",
      "time": 1729473628,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "bakery",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=653898713098000651",
  "user_ratings_total": 176,
  "vicinity": "106 Faber Drive"
}