{
  "formatted_address": "598 Yishun Ring Rd, B1-K15, Singapore 768698",
  "geometry": {
    "location": {
      "lat": 1.4182745,
      "lng": 103.8410316
    },
    "viewport": {
      "northeast": {
        "lat": 1.419798930291502,
        "lng": 103.8422120302915
      },
      "southwest": {
        "lat": 1.417100969708498,
        "lng": 103.8395140697085
      }
    }
  },
  "name": "BANANA",
  "place_id": "ChIJR0JJcQAV2jERd81M2dKn5QI",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Zozo",
      "author_url": "https://www.google.com/maps/contrib/109173464175521287422/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVKBtxIeuwXbYjOBJHsgK6gUhsdytO1pcx35OtD2jcTAaA43Wk=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Seriously, their crunchy, sesame-infused golden batter is so addictively crispy, I almost finished all 3 boxes by myself\n\nTheir signature Thai fried pineapple? Sweet, juicy, and perfectly balanced with a subtle crispiness. Despite all the frying, I barely felt any grease—thanks to their oil-draining machine, making this a slightly healthier indulgence. Plus, the ingredients are sourced directly from Thailand, so you know it’s top-notch!\n\nShoutout to the amazing staff who tirelessly keep frying up fresh batches 🙌",
      "time": 1745812205,
      "translated": false
    },
    {
      "author_name": "BarleyField",
      "author_url": "https://www.google.com/maps/contrib/105174903882902925867/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIe3X5sDNCFamPoTnNUwYWJVvQZB32k_WoX0GjPS9KD3l1TLNEP=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I recently tried the Thai fried bananas at BANANA in Wisteria Mall @Yishun B1, and they were fantastic! Crispy, fragrant, and not overly greasy, the batter had a lovely coconut aroma with a nice crunch. The banana inside was soft and naturally sweet. A perfect snack—highly recommended!",
      "time": 1742029139,
      "translated": false
    },
    {
      "author_name": "Jeff Cheong",
      "author_url": "https://www.google.com/maps/contrib/112693683234454408737/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI6qz2RtYrWIZ3P7-5IrMmXC874j-MukEaHTNK0MOFWJJfJzHI=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "in the last week",
      "text": "May I suggest you educate your staff not to insert the whole bare hand into the paper bag to open it before packing please? It doesn't look hygienic by doing so especially Covid is back again. Your staff can just simply shake it to open or use the thong to do so.  Appreciate your kind understanding.",
      "time": 1747306824,
      "translated": false
    },
    {
      "author_name": "Matthew Lee",
      "author_url": "https://www.google.com/maps/contrib/109397825257995094119/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIixaYVl0wJURE1BHYld5TXrWto_XXPpGQMy1A8MucbvABWdg=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "5 months ago",
      "text": "Saw this place on social media and decided to visit and give it a try.\nVisited on a weekday afternoon and it was rather quiet and no queue. It's located at the basement but definitely not hard to find because their signboard with the word banana is really very easy to spot.\nThis is a takeaway place so there are no seats and you have to find somewhere to sit and enjoy them.\nNot a lot of items on the menu, but it's special because it has fried pineapple! Had someone to share with me and we wanted to try everything so we ordered a mix, and had to order the fried pineapple separately as it is not included in the mix and match.\nPreparation was very fast because there were already some in front of the display. The packet we got was somehow still a little warm for some items, but the pineapple ones were like just out from deep frying so it was still quite hot.\nDecided to eat while fresh so had to find a place to sit and try. Tried the mix and match, everything was okay, the banana tasted pretty good. The sweet potato balls were light and hollow and was a little lukewarm so didn't taste that crispy. The fried sweet potato was not bad but the yam one was dry and cold.\nThe highlight for me was definitely the pineapple because it was hot and fried to perfection. It's kinda unique cause it's not common to find deep fried pineapple and you know that pineapple actually sweetens itself after applying heat on it. I felt that the sesame actually enhanced the taste of the fried items a lot and it's more pronounced here and more fragrant as well.\nCould feel that the oil was well drained from the fried items couldn't feel that it was greasy from holding it or feel sick eating something oily.\nI would love to visit again, though it's a little out of the way for people not visiting Yishun. Not near the MRT and requires shuttle bus there.",
      "time": 1732813240,
      "translated": false
    },
    {
      "author_name": "Yang",
      "author_url": "https://www.google.com/maps/contrib/103078870952547064508/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocId_1lGfxky38DqCAG4qG79S251nWu4Fvg1B3RWg1m5PK-DvQ=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "The new fritter snack shop, BANANA, has opened in Yishun’s Wisteria Mall, bringing crispy Thai fried bananas and other fritters to the area. Known for their oil-free, low-calorie treats, BANANA uses a special oil spinner machine to create a non-greasy, crunchy snack. I tried the Mix & Match ($7) option, allowing you to choose up to nine items from an assortment of Thai Fried Banana, Yam Fritters, Sweet Potato Fritters, Sweet Potato Balls, and Purple Sweet Potato Balls.\n\nEach fritter had an impressive crunch, enhanced by the coconut-flavoured batter and a sprinkle of sesame seeds for a light nutty taste. The Thai fried banana was soft, fruity, and naturally sweet, while the yam and sweet potato fritters offered a nice bite with mild sweetness. The sweet potato balls, both regular and purple, were pleasantly puffy and chewy, though fairly standard in taste.\n\nBANANA’s clean and oil-free finish makes these fritters a guilt-free snack worth trying. I’ll definitely be back for their fritters!",
      "time": 1730484782,
      "translated": false
    }
  ],
  "types": [
    "meal_takeaway",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=208757481773256055",
  "user_ratings_total": 33,
  "vicinity": "598 Yishun Ring Road, B1-K15"
}