{
  "formatted_address": "165 Tg Pagar Rd, #01-00, Singapore 088539",
  "geometry": {
    "location": {
      "lat": 1.275521,
      "lng": 103.8436042
    },
    "viewport": {
      "northeast": {
        "lat": 1.276925880291502,
        "lng": 103.8449098302915
      },
      "southwest": {
        "lat": 1.274227919708498,
        "lng": 103.8422118697085
      }
    }
  },
  "name": "Bar-Roque Grill",
  "place_id": "ChIJKZoOX2sZ2jERhJqFXCG1oAw",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Andrew Chwee",
      "author_url": "https://www.google.com/maps/contrib/106675725944888485190/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLKb1BUW6m0rLQtZW5y8xp9NIPhhCYilalB60BgQr4YVnZt2A=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Bar-Roque Grill is a delightful spot that manages to blend a warm atmosphere with excellent service, making it a great choice for any dining occasion. From the moment we walked in, we were greeted with genuine hospitality. The staff was attentive and friendly, ensuring that our needs were met without being intrusive, which is always a plus for a dining experience. We decided to start with the Beef Platter, which offered a variety of meats. While it was an interesting selection, one of the cuts was on the dry side. However, I was impressed by how quickly and efficiently the kitchen responded to our feedback by offering a replacement. This level of service truly reflects the restaurant's commitment to guest satisfaction, and we appreciated the effort they put into making things right. On a brighter note, the Tuna Wellington stole the show! It was masterfully prepared, featuring a flaky crust that perfectly enveloped the tender tuna, and the flavours combined beautifully. It was definitely a highlight of our meal and something I would order again without hesitation. We also dug into the Grilled Octopus and Sausage, both of which were delicious. The Grilled Octopus was tender and seasoned well, showcasing the kitchen’s skill with seafood. The combination of smoky flavours and the charred texture made it a delightful dish. The Sausage added a hearty touch to our meal, bringing a nice balance with its savoury flavours and satisfying crunch.",
      "time": 1744980991,
      "translated": false
    },
    {
      "author_name": "Dylan Lastname",
      "author_url": "https://www.google.com/maps/contrib/109440871742785497262/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUWYQ4QLzMU0HIOsRyVv9VUp0rMeehJ9TV-YOlnK-0NmbLAT69k=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "The service is excellent. Staff are friendly and very helpful with wine and food selection.\n\nFood is also great, portions are generous.\n\nI'm so sorry I can't remember our servers name but after we left he called us to inform that we had left a pair of glasses there. He very helpfully arranged to have it returned to us within 2 hours.\n\nAbsolutely top notch service. 10/10 would recommend.",
      "time": 1746969206,
      "translated": false
    },
    {
      "author_name": "Anna Iwanowska",
      "author_url": "https://www.google.com/maps/contrib/113834080074769632160/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU32vJ6C3DKu4bJyyrGmotdpnV5Vbq4L1NTa9mltTzMe5TWFLshVg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Our party of five had a wonderful dinner at Bar Roque Grill last night. The food was absolutely delicious, with a great variety beyond just meat – the fish and seafood options were excellent too. And the desserts were incredibly tasty! We were impressed with the beautiful presentation and service of every dish. A special thank you to our amazing waitress, Evelyn! She was truly outstanding – so attentive, always ensuring our wine and water glasses were full, and incredibly friendly and welcoming. She's a top-notch server! We had a fantastic evening here! 🤩🤗",
      "time": 1746916823,
      "translated": false
    },
    {
      "author_name": "Sunny Kay",
      "author_url": "https://www.google.com/maps/contrib/112487278266318428283/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLoV7H5YmVR-gdU1f_Bmv_PcKvvqwhsTXqx9El824WTd4iopA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Had a fantastic dining experience at Bar-Roque Grill.\n\n1. The ambience was warm and inviting. The place has a cozy vibe yet elegant setting.\n\n2. The staff were exceptionally friendly and attentive, making us feel welcome from the moment we arrived.\n\n3. A special mention to Evelyn, who took great care of us throughout the evening. She was personable, attentive, and ensured everything was just right.\n\n4. The food was amazing as well. I ordered the burger, which was juicy, flavorful, delicious and cooked to a perfect medium rare.\n\nOverall, a wonderful experience, and I’ll definitely be coming back!",
      "time": 1741396954,
      "translated": false
    },
    {
      "author_name": "Y. K. Lee",
      "author_url": "https://www.google.com/maps/contrib/110266229454705438837/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJtfuunf-FpcbosyttePrYgth8-w7hX9YqRnmK8SG5hNZhIzg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Had an enjoyable night at Bar-Roque Bar for my family gathering. The service attendant is very welcoming and rumorous, great hospitality for the night. Must recommend their octopus appetiser, not too chewy, to match with the avocado puree, it is another level of surprise. The rest of the food are well-prepared too, except the tenderloin under beef platter is slightly less medium per requested, but still acceptable.\n\n👍👍👍",
      "time": 1740934122,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=909926279619648132",
  "user_ratings_total": 1242,
  "vicinity": "165 Tanjong Pagar Road, #01-00"
}