{
  "formatted_address": "273 Thomson Rd, #01-03/04 Novena Gardens, Singapore 307644",
  "geometry": {
    "location": {
      "lat": 1.3205135,
      "lng": 103.8420709
    },
    "viewport": {
      "northeast": {
        "lat": 1.321922130291502,
        "lng": 103.8432582302915
      },
      "southwest": {
        "lat": 1.319224169708498,
        "lng": 103.8405602697085
      }
    }
  },
  "name": "Bari-Uma Ramen Novena Gardens",
  "place_id": "ChIJo0GiwNoZ2jERoHCqbLCr7mk",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Martin Lee",
      "author_url": "https://www.google.com/maps/contrib/100300413269320600546/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXp9fKQRy6B4X98iibrBKaL_TKFXUDA8tYD1rPh2-p86B7s_feB=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Got to know of Bari-Uma Ramen from Nana from Japan Instagram. As we just came back from Japan just the last weekend, we began to miss the taste of ramen and have high expectations seeing that a Japanese recommends this place. And Bari-Uma Ramen met them.\n\nWe got a Ajitama-Uma, a Bari-Uma, a Tori-Uma and 5pc gyoza. The broths of both the pork and chicken flavored soups are rich and flavorful yet balanced with the other ingredients. The egg is done perfectly with a texture that gives a burst of umami on the tongue. And the gyoza is juicy and taste great even without the sauce.\n\nOverall, we really enjoyed the meal and will definitely return again in the near future",
      "time": 1744974956,
      "translated": false
    },
    {
      "author_name": "Eka Buyung Lienadi",
      "author_url": "https://www.google.com/maps/contrib/108749183152658668929/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXxo8oB0AaG71RDSzyFyN1ZrWZxlJgoxAsjGYSWi7M26j5PlQIE=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "One of the most authentic tonkotsu ramen in SG. The broth is thick and very flavorful, coupled with the rich and flame-torched chasiu before serving. You can smell and taste the smokiness of the Chasiu. Just that price is a tad on the higher side, still redeemed by the quality of the flavor.\n\nI ordered the ajitama ramen, where they are having a promotion of extra chasiu. Definitely a treat",
      "time": 1743950399,
      "translated": false
    },
    {
      "author_name": "Jessie Lee",
      "author_url": "https://www.google.com/maps/contrib/102477248367236393822/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLyhNf-3Z2FrJSyg1iZ2GtX7g2Q6FAWfE7tClIB7QVjfppSOBE=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "16 Feb 2025\nOur first time visiting this ramen store after seeing the good reviews. The soup broth was thick and good to our taste. The ingredients and texture of noodles were acceptable. The staff was friendly to tell us when we were finishing the meal that the broth could be adjusted to our liking such as the level of saltiness which we felt the default was okay and we even finished up. We ordered only just 2 bowls of ramens with no additional drinks or anything. Total $40.55\n\nNovena garden is a little out of the way for us especially with the ongoing construction.",
      "time": 1739714557,
      "translated": false
    },
    {
      "author_name": "Christopher Kuhn",
      "author_url": "https://www.google.com/maps/contrib/103631312286593473473/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUzbZdtAKSUMjZRq2r-N4tVIkuRP3YUytTMHPM4kZQMDwXJbx8=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "2 weeks ago",
      "text": "Busy on eve of PH so might need to prepare to wait\n\nFlavour a little flat to my liking Vs ippudo or Keisuke level. Noodles + meat + egg no issues all good standard. Spice level is good.\n\nIt’s alright a solid 4* but I woudnt go out of my way",
      "time": 1746015674,
      "translated": false
    },
    {
      "author_name": "Ong Zhi Yuan",
      "author_url": "https://www.google.com/maps/contrib/104417804420531473764/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXIKT6Cu9TEMxrk2g1XVOPPdJDxx3WhsAXEK-kpKj4513VdnYs=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I came across Bari-Uma on several food blogs and decided to give it a shot. They specialize in tonkotsu ramen and Japanese fried rice (chahan), so I was excited to try it out.\n\nI arrived early on a Saturday around 11 am, and the place was still relatively empty, making it easy to get a table. The restaurant is spacious with comfortable seating, and the staff were incredibly polite and helpful, offering recommendations on food and add-ons.\n\nFor this visit, I ordered the Ajitama Chashu-Uma Ramen ($23.90) and the spicy pan-fried gyoza ($9.50). The food came out surprisingly fast - in 10 minutes.\n\nThe ramen was absolutely phenomenal. The noodles were soft and soaked up the thick, flavorful tonkotsu broth beautifully. Bamboo sprouts and spring onions added a nice crunch to balance out the texture. The chashu was tender, well-marinated, and paired perfectly with the noodles.\n\nAs for the gyoza, they were crispy, generously filled with minced pork and chives, and packed with flavour. The spicy chilli drizzle on top gave them an extra kick that made them even better.\n\nMy only small gripe is that I prefer my noodles to be a bit firmer for that al dente bite, but that’s just personal preference.\n\nOverall, this was an excellent find and easily one of the better ramen spots I’ve visited in Singapore. 9/10, highly recommended!",
      "time": 1739591136,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7633227192665272480",
  "user_ratings_total": 412,
  "vicinity": "273 Thomson Road, #01-03/04 Novena Gardens"
}