{
  "formatted_address": "494 Tampines Street 45, Singapore 523494",
  "geometry": {
    "location": {
      "lat": 1.3628707,
      "lng": 103.9557292
    },
    "viewport": {
      "northeast": {
        "lat": 1.364187780291502,
        "lng": 103.9571424302915
      },
      "southwest": {
        "lat": 1.361489819708498,
        "lng": 103.9544444697085
      }
    }
  },
  "name": "Basil King (Tampines)",
  "place_id": "ChIJZ6D3NgA92jERK-vAc3_wVHg",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Ferdi",
      "author_url": "https://www.google.com/maps/contrib/101089507334323086805/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUZLkxEsZk_sj6GJNZAImMLvuuLj5qUlZJ3o_AJNFHwPHchDofgvA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "in the last week",
      "text": "Second Visit Review: good food, but execution concistency can improve.\n\nThis was my second visit, and honestly, I found the first one more enjoyable—which is why I came back.\n\nWhat I liked:\n\nThe pad krapow stands out for its drier, more savoury profile compared to others that often lean too heavily on sweet soy sauce. A little more basil leafes would have made the aroma even stronger.\n\nThe fried sunny-side-up eggs are a highlight. Uncommon in local Thai food scene, they’re simple yet so good.\nI’d say two yolks should be the standard—they really elevate the dish.\n\nCan be improved:\n\nCooking consistency: This time, I upsized the meat for all three dishes and added triple eggs to two of them. We ordered two pork dishes—one with level 4 spice and one non-spicy. It seemed they were cooked together, with the chilli added only at the end for the spicy one. As a result, the chilli flavour didn’t infuse properly—it lacked the depth and kick I remembered from the first visit, where the chilli was clearly cooked into the dish.\n\nOvercooked prawns: mushy and curled tightly.\n\nRice: slightly undercooked and more suited for fried rice than as a base for pad krapow. Some grains were even hard to chew. This issue happened on both visits. It’s another reason to have at least two eggs—the yolks help soften the rice.\n\nService: On the first visit, the young staff member seemed unsure while taking orders. He forgot to add my meat upsize request, even after I confirmed with him. I didn’t check the receipt immediately, which was my oversight—but I noticed a similar issue with the customer ahead of me too.\n\nI also tried to place a takeaway order for just meat (pork and prawn) without rice. The staff seemed confused and had to consult another team member. I was told they couldn’t sell just the meat—even after I offered to pay full price. This seemed unnecessarily rigid; I wasn’t looking for a discount, just a rice-free meal.\n\nOn the second visit, a different staff member took my order. I asked for pork with pork upsize, but he misunderstood and asked if I meant pork with prawn upsize—suggesting a mix-and-match option.\nI thought it might be possible, so I tried ordering prawn with pork upsize, but that led to more confusion. Realising it might be too complicated, I ended up sticking to prawn with prawn upsize.\n\nThey’re still relatively new, so I’m hopeful they’ll smooth out these bumps over time.\n\nThe branding feels a bit too similar to Phed Mark’s. Honestly, their concept and food quality are strong enough to stand alone. A fresh brand identity would do them justice—and help set them apart on their own merits.",
      "time": 1747551843,
      "translated": false
    },
    {
      "author_name": "sh",
      "author_url": "https://www.google.com/maps/contrib/104852292426516942929/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXhKvxrexhS3g8UiKn_sYsC1kuSa64pszyreNGKd5EJUzDHggQy=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "in the last week",
      "text": "Decent plate of basil pork rice. Eggs cooked well. Meat was a little dry. A bit overpriced imo",
      "time": 1747769150,
      "translated": false
    },
    {
      "author_name": "Chunyi Kwek",
      "author_url": "https://www.google.com/maps/contrib/103429555539887495343/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWE2VowH0w1Tb0BpxOu9G7XmnDyRvz3H6yGkBorGoFGg2o_10Q5=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "in the last week",
      "text": "You should consider spending your money elsewhere, rather than this blatant rip off of another person's business. Their concept, slogan, branding and logo are almost exact copies of an existing business overseas. Their response to being called out for plagarism was also a gross \"lol\". Cocky and lazy. Terrible behavior.\n\nSadly I did not know it from before. Left a bad taste in my mouth. I do not reccomend.",
      "time": 1747568405,
      "translated": false
    },
    {
      "author_name": "VaZ",
      "author_url": "https://www.google.com/maps/contrib/103214899366784471057/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUZ_070jVhtYCaQ4Bf5EYbU-x4rEjrUEVaTaK3zuv9YBoY4E6A=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 3,
      "relative_time_description": "in the last week",
      "text": "i got the basil chicken single yolk & spicy level 2. For a 'basil' dish, the basil is on the little side.. taste is on the sweeter side. Portion could be more too. Overall taste is not bad but definitely can't compare to the ones in bangkok and especially to the real Phed Mark",
      "time": 1747534691,
      "translated": false
    },
    {
      "author_name": "Rachel",
      "author_url": "https://www.google.com/maps/contrib/113924937138702658927/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJSL7toWIfPkCnIu7irmE-gAnUUvB9m-NE6nqe9B8PzbAgz=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "in the last week",
      "text": "egg is nice but basil king no basil",
      "time": 1747464674,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8670819612788583211",
  "user_ratings_total": 12,
  "vicinity": "494 Tampines Street 45"
}