{
  "formatted_address": "1220 ECP, #01-03/04 Lagoon Food Village, Singapore 468960",
  "geometry": {
    "location": {
      "lat": 1.3066633,
      "lng": 103.9352858
    },
    "viewport": {
      "northeast": {
        "lat": 1.308279280291502,
        "lng": 103.9366673802915
      },
      "southwest": {
        "lat": 1.305581319708498,
        "lng": 103.9339694197085
      }
    }
  },
  "name": "Bbq Seafood Kitchen 海邊燒烤海鮮",
  "place_id": "ChIJ4XieepUi2jERrU3HNaXMPic",
  "rating": 3.8,
  "reviews": [
    {
      "author_name": "CP",
      "author_url": "https://www.google.com/maps/contrib/113861923464679544218/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX12jQdPullVvmdJ_F9lzja7BzbsejtQ6gORrDzIGMNfBvWRpEM=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Dining at East Coast Lagoon Village nowadays in a treat. The selection of great local food is without a doubt. But on top of this is the ambience that resembles alfresco dining without the burning a hole in your pocket in more expensive restaurant. This is one stall that I patronise whenever I want local bbq food fix. It is the place for a chill and to fill your stomach with local delicacies after a hard day.\n\nUpdate: Compared to a year plus ago when I last ate here, the quality of food is even better. The grilled squid with just pepper is the best grilled squid I had. The fried pork is also very good. I highly recommend this place if you are here at this food centre.",
      "time": 1687266072,
      "translated": false
    },
    {
      "author_name": "J.K. L",
      "author_url": "https://www.google.com/maps/contrib/115260701833322512948/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL_gZ3yyVwjgi7frMAGaokfLUwAqWL-JKKRvOQdnFY8fmcY0A=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "090325 Dinner $53 / Hubby enjoyed his dinner.  All the 4 dishes were good n well executed... for me,  the white bee hoon was abit too salty. Prices were reasonable and because the stall was at the corner,  there are more sitting capacity n the lady taking orders was friendly, helpful n patient. Will patronise again.",
      "time": 1741586222,
      "translated": false
    },
    {
      "author_name": "Darren Cheong",
      "author_url": "https://www.google.com/maps/contrib/111136407063098297690/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXWLh4PmuyyeKhCPTvKw_Z9SuOINsdTSNsDVbwWihIan0V6LCAd=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "2 years ago",
      "text": "1. Salted Egg squid - the cuts are reasonable.. but the \"zhap\" not enough... so can't really taste the salted egg+squid...\n\n2. The pork cutlet very ordinary... taste normal..\n\nThe price and portion average\n\nServing speed was fast..",
      "time": 1680702510,
      "translated": false
    },
    {
      "author_name": "W L",
      "author_url": "https://www.google.com/maps/contrib/100791229611271215684/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLx9V4Zf2uhjmd1hutK3sl0nIWxWipjCCXwDOREx4YPtVjjGA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "I do not usually write reviews but this store deserve a mention.\n\nTotally unethical and disorganised. Zero star would fit more to them. Only know how to collect money and lie! (Despite knowing they are overwhelmed, while waiting for the food to almost 1hr+, they still let the other customer know its 30 min wait)\n\nOrdered 3 dishes and ask the tattoo leg guy how long it would take and he answered 20 mins. I am very fine with waiting for that time. However, almost 1 hour not a single dish came out to our table. We proceeded to confront him, he claimed that he never say 20 min, then we ask the cashier (presumably the lady boss) for a refund, she claimed that it will be out shortly, so I continue to wait, but to no avail after 15 min, I asked her for a refund again. She say kitchen is already preparing and blamed on the guy with spec  (presumably the boss). The guy claim that they never said it and that was when the tattoo guy also denied.\n\nWe as consumers are willing to wait, but being lied multiple times is a NO GO service.\n\nTotally a mess from their store.\n\nEven if they offered a free meal again or their food is michelin star, we wouldn’t patronise ever again! (Btw its salty)\n\nPlease learn on how to run a business, and do not lie to customer if the food will not be ready in time\n\nDo not just know how to collect money first and make empty promises to customer first and cant refund even the order is not even prepared to cook yet!\n\nSummary, this store the staff just make empty promises to customer despite knowing customer waiting for more than an hour still continue to take order and worst let them know its 30 min wait when its not!\n\nThe issue is never ever about waiting, but the lies the store gave to the customers that makes few of us pissed off.",
      "time": 1738389841,
      "translated": false
    },
    {
      "author_name": "Jennifer teh",
      "author_url": "https://www.google.com/maps/contrib/112609317626320056683/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWCFq4gch-wL6WS8JEDJ8abQE0qYVsTUS4HXj3hLFbbAfL60DqrDQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Before covid-19 I always be there to eat the dinner with my friends at this BBQ seafood kicthen. The seafood there so fresh and the staff is very friendly.\nThe food here was yummy special I like a lot deep fried fish so crunchy.\nAll the food was so yummy. I like alot.... I will be back again.",
      "time": 1658064393,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2827922625979174317",
  "user_ratings_total": 39,
  "vicinity": "1220 East Coast Parkway, #01-03/04 Lagoon Food Village"
}