{
  "formatted_address": "#04-249 Jurong Gateway Rd, Blk 131, Singapore 600131",
  "geometry": {
    "location": {
      "lat": 1.3345668,
      "lng": 103.7401844
    },
    "viewport": {
      "northeast": {
        "lat": 1.335890730291502,
        "lng": 103.7414811802915
      },
      "southwest": {
        "lat": 1.333192769708498,
        "lng": 103.7387832197085
      }
    }
  },
  "name": "BeadtleSweet",
  "place_id": "ChIJc6zIfr0Z2jERUX1EYMxYFLQ",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Shuhui",
      "author_url": "https://www.google.com/maps/contrib/102734712648121588489/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV82I97CGFa3bgfizJ7-s7t4dmwSZ_uCXuqFV-vETkH0Hpeq6bMOA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I highly recommend Beadtlesweet to anyone who loves crafting! I attended their basic jewelry-making classes and had an amazing experience. The instructors are incredibly experienced and patient, ensuring each student gets proper guidance. They even assign a teacher specialized in the technique you're learning, which makes the process smooth and enjoyable.\n\nBeyond jewelry-making, they also offer other classes, such as sewing, making phone straps, and more. If you're interested, you can visit their store in Jurong or give them a call to find out more. When it comes to purchasing materials for practice, the staff are equally helpful and attentive. They patiently assist in preparing the materials and even offer great suggestions for color matching. Overall, it was a delightful experience!",
      "time": 1736611680,
      "translated": false
    },
    {
      "author_name": "Sharifah Omar",
      "author_url": "https://www.google.com/maps/contrib/103795898797432653971/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWLlEINqhDKvTrU3NwFYkBxhzPdSHpWok-TOLKq5cJr-kK3IPM=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Learned a lot of different types of beautiful jewelry. The trainers are very knowledgeable, helpful and patient. Everyone at BeadtleSweet is friendly and welcoming. Very encouraging and inspiring too. Every lesson was super fun and i enjoyed every one of them. I recommend newbies to crafts and beading jewelry to go to Beadtlesweet. You won't regret it. Next, i look forward to intermediate classes. =)",
      "time": 1738318526,
      "translated": false
    },
    {
      "author_name": "W Lim",
      "author_url": "https://www.google.com/maps/contrib/112806132464605223103/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ9oEfZ6ZilYLYxSm5mmDHxY9sqGwgVX5a5Uxkn_D1kzBD1Qw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "The teachers are patient and very thorough, never short cut in their teaching. My daughter enjoys every lesson and has grown more confident in her jewelry designs. A special thank you to all the teachers, especially Ms. Kate, for her constant encouragement and meticulous approach to her work. I highly recommend this school to anyone truly committed to their artistic development!",
      "time": 1736675599,
      "translated": false
    },
    {
      "author_name": "hkwong",
      "author_url": "https://www.google.com/maps/contrib/115124798245094324643/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIIbSwJh7B2HeGLuXc19zWBYHdzqQ-qQd2bkTLazQ0FkVucUg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "After collecting all sorts of beads over the years, and learning how to make necklaces using stringing wire from YouTube, I was keen to improve my jewellery making skills. I compared various courses available locally. Finally, I chose ‘Fashion Jewellery Making’ course, by Beadtlesweet, based on the course fee, duration and the type of techniques taught.\nI used Skillsfuture credit to pay for the course. This course has 10 lessons, each lasting between 2.5 to 4 hours. We completed the jewellery in class for each lesson. Altogether we made 13 jewellery pieces (bracelets, earrings, pendants, ring). All materials were provided. Techniques covered include knotting, stitching, 2D and 3D weaving, crocheting and wirework basic such as looping, wrapping, coiling, twisting, etc.\nThis is my feedback and the reasons why I enjoyed, learned a lot, and have benefited from the course.\n1) I had one lesson per week. As such, I have enough time to apply what I learned; I could test out various things, like making necklaces using the technique learned after making bracelets in class, changing up the colour combination, the type of beads/ crystals, etc. to suit my personal preference.\n2) The instructors guided and encouraged us to create variation of the jewellery that was made in class. It was convenient to pick up the materials needed to make our own piece, in the shop, right after class. I also got help from the instructors on colour combination choice. After we completed our jewellery piece, the instructor would kindly provide feedback on our work. I greatly appreciate that; it is like getting free consultation from industry veteran.\n3) Simple and Systematic way of teaching –\nFirstly, the class size was small, so the instructor gave each of us enough attention. They are very helpful, patient, and they made sure we absolutely understood what was being taught.\nTo ensure we enjoy making jewellery long term, right from the beginning, our main instructor, Kate, painstakingly instilled in us good habits and posture when making jewellery.\nProgressing through the wirework lessons, we experienced, learned and understood how to create durable jewellery piece, using different wire gauges for different techniques and purposes.\nThe instruction sheet, especially for, stitching, crocheting and weaving lessons, was clear with precise steps. During lesson, the instructor also made sure we understood how to read the instruction sheet! These are important reference materials, weeks after the lessons.\nAside from teaching jewellery making techniques, during lessons, Kate would share jewellery industry knowledge. This additional information broadened our perspective.\nThe course fulfilled my learning goal, and I had a wonderful experience. Importantly, it has equipped me with new skills, to more creatively make use of all the beads that I have, to make new jewellery pieces.\nI recommend anyone who is keen to learn the technique of making jewellery, and to uncover more things related to making jewellery to take this course.\nI take this opportunity to thank my instructors: Kate, Shirley, Suzy and Thera for their dedicated efforts teaching me.",
      "time": 1744096515,
      "translated": false
    },
    {
      "author_name": "Evangeline Wong",
      "author_url": "https://www.google.com/maps/contrib/106044847740332098862/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX-96y_35mBwiLQe_hUPf7z68ZX1Z1IGPrqV9-sFwP-mX3mH4s=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Completed the \"Fashion Jewellery Making\" course via SkillsFuture. The lessons covered a diverse range of methods, from wire bead wrapping to crochet jewellery and cord knotting. The teachers are very patient and are very good at conveying the lessons to beginners. I recommend their classes for those interested in learning jewellery making as a hobby! ☺️\n\nThe store also is in a convenient location, a short walk from Jurong East MRT. (Particularly good for those living in the west). The store sells a wide range of pretty beads and jewellery tools as well, and the staff are all very friendly.",
      "time": 1725683822,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12976094061172915537",
  "user_ratings_total": 89,
  "vicinity": "#04-249 Jurong Gateway Road, Blk 131"
}