{
  "formatted_address": "2 Bayfront Ave, #B2-20 20A, Singapore 018972",
  "geometry": {
    "location": {
      "lat": 1.2840276,
      "lng": 103.8586157
    },
    "viewport": {
      "northeast": {
        "lat": 1.285099330291502,
        "lng": 103.8605095802915
      },
      "southwest": {
        "lat": 1.282401369708498,
        "lng": 103.8578116197085
      }
    }
  },
  "name": "Beanstro",
  "place_id": "ChIJgzvcVbgZ2jER2Tnb5sQQq_o",
  "rating": 3.4,
  "reviews": [
    {
      "author_name": "megan",
      "author_url": "https://www.google.com/maps/contrib/100978343250742524720/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVAG_lZegJnuZQi3I_irvE16h7Oad1DOlQqSkI9XbiHjoVM82-f=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 2,
      "relative_time_description": "2 months ago",
      "text": "The chicken tomato pasta was ok. Pasta wasn’t overcooked but it wasn’t mind blowing\n\nThe fries were also not extremely hot but they were good enough unhealthy finger food\n\nThe waffles were dry…but at least the banana had a mediocre caramelisation. The fruits tasted okay but the waffles were so dry…\n\nThis is a coffee bean and tea leaf outpost that is way too overpriced. The service is also really not prompt",
      "time": 1742575249,
      "translated": false
    },
    {
      "author_name": "Herry Verdyansyah",
      "author_url": "https://www.google.com/maps/contrib/115258994903977064204/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLOPCTHokLDliWxwn2-Ux6H49fHgjIuKnrNZ_z5RR11TpFZwg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Nice place. Delicious food. The Aglio Olio it’s really good. Fried calamari taste good and delicious.\nThe place is really good to see the water fall up close.\nDefinitely gonna comeback to this place anytime.",
      "time": 1744384649,
      "translated": false
    },
    {
      "author_name": "Chad Tann",
      "author_url": "https://www.google.com/maps/contrib/102422277019326143913/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJyImdGaFKU4PcR2ldHsJYJav8DGEjVwSByVlYfjk_AoFzmnS4=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "The food is aweful and so expensive it’s pre made. Calamari is rubber and waffle is stodgy. Nothing made fresh. Speciality coffee is definitely not a high grade and roast is too dark",
      "time": 1743229847,
      "translated": false
    },
    {
      "author_name": "Le Roy",
      "author_url": "https://www.google.com/maps/contrib/111921839193192652409/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJbgc2kqZ1fBFV6EGVq7HXxUL1ItF0dNkr9llprdxePPaw4HA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "**Poor Experience at Your Establishment and Unacceptable Service**\n\nI am writing to express my dissatisfaction with my recent experience at this establishment, which will be my last visit. This was my third time coming here, and unfortunately, it has been a series of disappointments.\n\nFirst, we were placed in a queue and waited for approximately six minutes before being informed that our table was ready. However, when I tried calling the number provided, I received no response. The message instructed us to return after five minutes, but despite our rush, no one was present in the front area when we arrived. We had to go inside the café and search for someone to assist us, which made us feel very awkward.\n\nUpon sitting down, we received our drinks and food, but the food was placed on the table without any cutlery. Are customers expected to eat with their bare hands? We had to request cutlery at the counter, which further added to our frustration.\n\nThe food quality was also disappointing. I ordered a burger for $39, and it was the driest and most unappetizing burger I have ever had—both the bun and the patty were extremely dry. The drinks were equally overpriced at $14 each.\n\nTo make matters worse, the staff were unfriendly, with no smiles or effort made to provide any level of customer service. Even though the café appeared to have sufficient staff, the service was subpar.\n\nI would highly recommend considering other dining options in Marina Bay, as there are much better places to spend your money. This experience was far from acceptable, and I hope you take this feedback seriously.",
      "time": 1735147824,
      "translated": false
    },
    {
      "author_name": "J G",
      "author_url": "https://www.google.com/maps/contrib/103689009046237488530/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW-rClnkWcDlFm8lDOa_Oftxj03lRkz5ykbLwgXzN9Ami3byraL=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Love the fried calamari. Tasted so good on its own, didn’t need the dippings it came with. Scrambled eggs on Breakfast platter was delicious too. Strawberry cheesecake is just the Chicago cheesecake with fresh strawberries on top. Mocha & Latte was smooth & nice. Virgilio who served us was very friendly & efficient. When my mocha was served, he spotted something on my mug & immediately got my mocha changed. He was also very professional when he helped us take a photo, noting the time of the water fountain. Overall great first experience at this bistro.",
      "time": 1726405845,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=18062549168372267481",
  "user_ratings_total": 515,
  "vicinity": "2 Bayfront Avenue, #B2-20 20A"
}