{
  "formatted_address": "111, Wilkinson Road Katong Swimming Complex, Singapore 436752",
  "geometry": {
    "location": {
      "lat": 1.3020911,
      "lng": 103.8863923
    },
    "viewport": {
      "northeast": {
        "lat": 1.303554730291502,
        "lng": 103.8873490802915
      },
      "southwest": {
        "lat": 1.300856769708498,
        "lng": 103.8846511197085
      }
    }
  },
  "name": "BearyFun Gym @ Katong",
  "place_id": "ChIJ6_Z7axoZ2jERFee5gNC_QPI",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "R. W.",
      "author_url": "https://www.google.com/maps/contrib/112554922376404699171/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLYYXN4v41nrfakp4YtwpRmIg4A-SbKZi1Of4gB70pfGDSWbw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I highly recommend this gym to parents who are considering gymnastics for their children.\n\nMy son had never participated in any extracurricular activities before, as he showed no interest in anything. When I first arranged a trial lesson, it was only for his younger sister. I explained his situation to the coaches, asking them to let him join only if he expressed interest. Otherwise, I was prepared for him to simply watch, as he usually did.\n\nBut when he saw the amazing coaches and how much fun the students were having, for the first time ever, he said, “I want to try this!”\n\nDuring the trial lesson, he was fully focused, and afterward, he confidently declared, “I want to do gymnastics here!” It felt like a miracle. Watching him participate brought tears to my eyes, and I felt immense gratitude to the coaches.\n\nThe coaches are truly exceptional. They always use positive language to encourage the children and never miss the opportunity to celebrate their achievements. Their encouragement, perfect timing, and genuine smiles create a truly supportive and inspiring environment.\n\nThis gym not only helps children develop physical abilities but also boosts their self-confidence. It’s an extraordinary place, and I’m so grateful to have found it.",
      "time": 1735890043,
      "translated": false
    },
    {
      "author_name": "Nora Abdul Karim-Bonnick",
      "author_url": "https://www.google.com/maps/contrib/107586553205759030357/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLwEeR7Umxy-_VwIkRzfjPjL9jFDFz3ctelWrvRYzkAtBUdZQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Long overdue review here! My son has been attending Bearyfun gym @ Katong since Feb this year and he's enjoying it tremendously. There are days when he asks to go to gymnastics instead of school! 😂 The coaches here are very friendly and amazing with kids! I have seen vast improvement in my boy's movement over the months! Customer service is top notch as well. I definitely recommend to all parents who are thinking of starting gymnastics for their kids. Special mention to Ms. Rif and Ms. Joanne for being so patient and accommodating with Zayn! 😊",
      "time": 1731747750,
      "translated": false
    },
    {
      "author_name": "C T",
      "author_url": "https://www.google.com/maps/contrib/118358049978283801079/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK_5IBHX2_lRcCuLobqiTAzWMxWZICPvRQtyxZUfQC2Y7XzGg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Chanced upon BearyFun Gym Katong when I was searching for a gym for my toddler and signed up for a trial class. Based off first impressions, they were very prompt with their replies, professional and friendly (replies still are prompt even after I signed up), not hard sell at all.\n\nWhat sealed the deal for me to sign him up, was how professional their coaches Ms Joanne and Ms D are! Even with a class full of (sometimes rowdy) toddlers, I've observed that they are both attentive and encouraging - not just encouraging to the kids but towards the parents as well :')\n\nThere was once my toddler suddenly had a meltdown and I was flustered, frustrated and just feeling awful about it. Then after class, Ms D came up to me and was just so sweet and assuring. It's the little things like that, that make a difference.\n\nBoth Ms Joanne and Ms D also know how to read the room really well, when the toddlers all happen to be rowdy or distracted, they will do a different activity to get their attention again. My toddler likes to wander off and they would always try to get his attention to get him to participate.\n\nThe toddlers are always so happy to see the both of them, especially since they are always so chirpy and smiley! (The other coaches who sometimes join the class are just as lovely!)\n\nThank you guys for such a great experience. :)",
      "time": 1693047335,
      "translated": false
    },
    {
      "author_name": "Lyana Shaffiee",
      "author_url": "https://www.google.com/maps/contrib/103178135792450607400/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWAnRY1nECqEfEXmzx9vAyrED5k5qFXb6K2rByKO2een_JyFwhG=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I enrolled my 3 year old about 3 months ago. He always looks forward to gym class here. The coaches are sweet, encouraging and provide good feedback. I've seen tremendous improvement in his confidence at navigating climbing structures at the playground, and an increased willingness to engage in risky play, where previously he was overly cautious. The waiting area for parents is comfortable and you can observe your child during lessons.",
      "time": 1702444939,
      "translated": false
    },
    {
      "author_name": "Clara Shanti",
      "author_url": "https://www.google.com/maps/contrib/104531565223370129951/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU646Uo35Gw90a55kk30aOGYKyMkUVeNTG3bbpfYsUeukzU1g=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My boys have been attending this gym for the past 2 years. The coaches are kind and friendly. Always motivating the boys to do better. My boys are now more flexible and have learnt so much from the coaches. The coaches always update the parents on the kids progress. The boys look forward to their classes every week. Special thanks to Ms Joanne and Mr Yippi.",
      "time": 1693722513,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17456163057921812245",
  "user_ratings_total": 14,
  "vicinity": "111, Wilkinson Road Katong Swimming Complex"
}