{
  "formatted_address": "11 E Coast Rd, #01-18, Singapore 428722",
  "geometry": {
    "location": {
      "lat": 1.3044802,
      "lng": 103.902127
    },
    "viewport": {
      "northeast": {
        "lat": 1.305744930291502,
        "lng": 103.9034536802915
      },
      "southwest": {
        "lat": 1.303046969708498,
        "lng": 103.9007557197085
      }
    }
  },
  "name": "Beastly Girls Sandwich Bar",
  "place_id": "ChIJ4YqL6IwZ2jERFjPVB3SQl4Y",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Aviral Bhargava",
      "author_url": "https://www.google.com/maps/contrib/100329667357262400557/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL195XX4sQ62wYGvONC15ILMoaa5M2TJvNIQVg3qAB_6-Sk2w=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 2,
      "relative_time_description": "3 months ago",
      "text": "The food was just average. Nothing to rave about or make me want to come back. That said, I have to give credit where it’s due—the service was attentive and pleasant, which made the experience better.\n\nHere’s what I ordered:\n-The Full Monty: A decent plate, but nothing particularly exciting. For the price, I expected a more generous portion or at least something that stood out flavor-wise. It checked the boxes but didn’t leave an impression. (Rating: 2.5/5)\n-Breakfast Sandwich: A standard sandwich with an odd flavor combination. The sweet tomato relish, paired with cucumbers, just didn’t work for me. The sweetness threw off the balance and made the whole thing feel underwhelming. Definitely not something I’d order again. (Rating: 2/5)\n\nOverall, while the service was commendable, the food didn’t justify the price or the visit. Not terrible, just forgettable.",
      "time": 1738504248,
      "translated": false
    },
    {
      "author_name": "tung how run",
      "author_url": "https://www.google.com/maps/contrib/108019475651876754079/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJXj2WgVtvFpbIlXoncEH-ofuPE1jlkoMwzQfygT61B1x8qXeM=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I absolutely love the ambiance and coffee here. The single-shot oat milk latte is a must-try. Sitting at the counter bar for breakfast was a special experience, surrounded by the rich aroma of freshly brewed coffee. This pet-friendly café can get quite busy in the morning, so it’s best to reserve a spot in advance.",
      "time": 1743301405,
      "translated": false
    },
    {
      "author_name": "Ava Cheong",
      "author_url": "https://www.google.com/maps/contrib/112703434252278770841/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUYgiKd9KZmkXlwKimfq_x469Oz_TCIUkzXp3TjXedT_fsIhCUR=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Had an amazing lunch a while back and I’m still thinking about when I can next try the rest of their menu.\n\nThe Sandwich Special was light and refreshing! While I did enjoy the Beastly Girl burger, it was moreish and I don’t imagine I could finish the whole thing on my own as the flavours were super full on. But the sandwich, I could polish off easily! It was too good! Excited to see what’s next on their seasonal menu.\n\nThe Halloumi Spinach Salad was pretty tasty. Happy that they grilled the halloumi. Flavours and textures blended well. I especially loved the roasted peppers!!\n\nWill be back for sure!",
      "time": 1733587423,
      "translated": false
    },
    {
      "author_name": "Gabriel Kwek",
      "author_url": "https://www.google.com/maps/contrib/103041500099542034816/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKe15roVHlg3pSPr4ZZUxdfVdS81Qhela2RqmhY91rJB-7c_w=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "The music, ambience, wonderful caramelised onion smell and waves of coffee smell that just swings into your nostrils - we totally love the space and the food! The sandwiches were done really nicely (fresh veggies, nice homemade pestos that just accentuated everything, love the aged cheddar and the surprise in flavours - I think mine even had a 老干妈 chili oil flavour somewhere hahaha). The portions left us filling satiated at just the right amount and the chips were definitely light and crisp! 🥪\n\nFor drinks and dessert, coffee was great and you can see people dropping by just to order coffee for take-out. I had the hot chocolate and it was tantalisingly rich, warm and frothy!☕️ the churros were soooo crispy on the outside with such a generous sprinkling of cinnamon sugar and a lovely chocolate sea salt dip! Everything was just done with so much heart! 🥰🥰💖💖\n\nWould definitely recommend everyone to drop by for the wonderful food and inclusive experience and environment! 😍😍",
      "time": 1726901614,
      "translated": false
    },
    {
      "author_name": "Yolanda S",
      "author_url": "https://www.google.com/maps/contrib/118187051031060889986/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVN-zBBfDgc3sPnDSV3Nj0Az_5xWqS1C0USA1uhQOtNZIk3aFPh=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "A Hidden Gem Sandwich Bar\n\nThis sandwich bar is a hidden gem! 💎 The atmosphere is cozy with great music, and the ingredients were fresh and delicious. The staff is incredibly friendly and attentive, making my visit enjoyable. There’s even an option to create your own breakfast platter, as well as a variety of lunch options. Highly recommend for anyone looking for a fantastic sandwich experience!",
      "time": 1722487137,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9698379150587671318",
  "user_ratings_total": 106,
  "vicinity": "11 East Coast Road, #01-18"
}