{
  "formatted_address": "86 Bedok Rd, Singapore 469371",
  "geometry": {
    "location": {
      "lat": 1.3240103,
      "lng": 103.9541411
    },
    "viewport": {
      "northeast": {
        "lat": 1.325329630291502,
        "lng": 103.9556477302915
      },
      "southwest": {
        "lat": 1.322631669708498,
        "lng": 103.9529497697085
      }
    }
  },
  "name": "Bedok Methodist Preschool",
  "place_id": "ChIJ-5TFdtMi2jERzRc9Vcbr_F4",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Jac Mary",
      "author_url": "https://www.google.com/maps/contrib/114770590038529497619/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXGllohbG8NAaw1QSTnYqaMU8LpG708NsbR9-PQoXxmLcFrm8GS=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "My most precious had attended nursery to K2, including the extended 6 hours ALP curriculum in BMCK (now known as The Methodist Preschool Bedok). His favourite teachers are Lin Lao Shi (she always holds his hand during all school outings to make sure he returns safely), Mr Jorino (like a father figure to him), Mrs De Cruz (self sacrifical and empathetic), Mdm Ho (the most humble, God fearing and experienced VP) and Jamie (our young and pretty admin who always walks him to his class even though he was late for school). These teachers never treated him as a special needs child (he is dylexic) but always encourage him to push himself to strive for the better. They don't compare him to others and focused on his character development as his academics is affected by dylexia (but they remain hopeful that he will overcome his learning disability as he gets older). I would like to thank current principal Mrs Audrey Tay who is inclusive and non judgemental; she cares for our young ones in her quiet but friendly way, very understanding since she too has a small child. I'm also grateful to Mrs Patsy Wee as she was a very hands on ex-P who left last year. On the whole, there is a transition in both edu structure and leadership during his 4 years studies here, but my most precious survived and trumped. This preschool is one of the very few left whereby our most dedicated cook, Maggie is still around to plan, buy and cook for all our kids and staff... this I believe is the biggest strength of this preschool nestled in an aging population private enclave... where else can you make sure your child gets to eat nutritious home cooked delicious food by our very own Chef Maggie? I would also like to thank Teacher aides especially Mrs Pillay and Mrs Leong who helped to toilet train him in his early years, sincerely thank you! All his best friends, the children here are quite international, kind and inclusive to attend all his birthday parties and everyday he looks forward to playing after school in the school playground (somehow always shaded even in the afternoons) and scooting or just running aound the church's extra spacious and windy fellowship deck with his class and school mates.\n\n2024 Alumni is currently in Tao Nan, Red Swistika, ACS, MGS, St Hildas, St Stephan School, St Anthony Convent, CHIJ Katong, Temesek, Ngee Ann, Bedok Green and Middleton, Dimension. If you are preparing to send your own precious to the above primary schools, do entrust your toddlers and preschoolers to The Methodist Preschool (Bedok) / BMCK now.",
      "time": 1733603197,
      "translated": false
    },
    {
      "author_name": "Marselyn Jonatan",
      "author_url": "https://www.google.com/maps/contrib/110818894969599993843/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWNOlVH-H2yckSiTT2i-RTT7QZcs7CoVMqv7XgGaG3H2EB4rXn6=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My son had a good learning experience in Bedok Methodist Preschool. The teachers are caring and the programmes are exciting.",
      "time": 1695256491,
      "translated": false
    },
    {
      "author_name": "Jasmine Hoon",
      "author_url": "https://www.google.com/maps/contrib/111763875535092236373/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKRTMA8GtPvfQwKWPsTdaCrqGuGJ9CdT6CWp_hYXaT7GKbFUw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "BMP provided a very loving and fun pre-school experience for my 2 kids. The principal and teachers are very approachable and caring. My 2 kids enjoyed fun activities in school such as cookery classes, paper making activities, water play and hands on experiments etc. My kids look forward to going to school everyday. The termly show and tell experience since nursery also prepared my kids well for their show and tell in primary school.\n\nThe parent volunteer opportunities enabled me participate in the school’s fun annual activities such as book day, children’s day carnival, racial harmony and also the cookery lessons. It allowed me to attend lessons with my kids and watch them enjoy the various activities in school.",
      "time": 1696386662,
      "translated": false
    },
    {
      "author_name": "Agnes Tan",
      "author_url": "https://www.google.com/maps/contrib/103694845066827057232/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSIXbGNpcKdniFo969yUusdM-oRr7UPuHOIq3mKxdvgt-XDn8PPw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I sent 3 of my sons to this school. She houses skilled, caring, and loving teachers. There are ample space and facilities, coupled with \"out of classroom\" lessons that promote holistic learning for any child. My sons are thoroughly equipped not just with knowledge but ethical and Godly values imparted. It is definitely a school that you can entrust your child.",
      "time": 1695902732,
      "translated": false
    },
    {
      "author_name": "kaiqing chew",
      "author_url": "https://www.google.com/maps/contrib/113919468504954655098/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVrlCnOlbDEwV8IDcDSJRWvjkKaEZXI-U2Zr4HzIovUbbrmPYER=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I have been extremely pleased with Bedok Methodist Preschool since my daughter started attending in 2022. The teachers have consistently shown care, creating a positive environment for her to learn and grow. The termly outings have been a highlight for my daughter, and she eagerly anticipates them. Her enthusiasm for going to school is a clear testament to the school's quality.\n\nWhat's more, the school's commitment to cleanliness and safety has made a noticeable impact on my daughter's health – she falls sick less frequently since joining. I'd like to express my heartfelt gratitude to the school, especially to teachers Ms. Inez Chan, Wang laoshi, Ms. Rey, and Mrs. Yeo, for their unwavering patience and guidance in helping my daughter reach her fullest potential. Bedok Methodist Preschool has been a wonderful choice for our family, and we couldn't be happier with the care and education they provide.",
      "time": 1695878333,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6844604770762430413",
  "user_ratings_total": 26,
  "vicinity": "86 Bedok Road"
}