{
  "formatted_address": "991E Alexandra Rd, #01-27, Singapore 119973",
  "geometry": {
    "location": {
      "lat": 1.2733771,
      "lng": 103.8026774
    },
    "viewport": {
      "northeast": {
        "lat": 1.274769030291502,
        "lng": 103.8040219802915
      },
      "southwest": {
        "lat": 1.272071069708498,
        "lng": 103.8013240197085
      }
    }
  },
  "name": "Beecroft Animal Specialist & Emergency Hospital",
  "place_id": "ChIJH_J3lxkb2jER55nivLabKZo",
  "rating": 3.9,
  "reviews": [
    {
      "author_name": "Lemmy Lamb",
      "author_url": "https://www.google.com/maps/contrib/106750842167260589965/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUZRZR83e_8iubkfg6vqdpIKTvGcJ_SzbwiAMhRm4egnPs3CNnw8Q=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "20240628\nSubject: Deepest Thanks for Saving Puss\n\nDear Veterinary Team,\n\nI’m reaching out to express my deepest gratitude for the exceptional care you provided to my beloved Puss, especially in those critical moments. Your swift diagnosis and prompt actions were nothing short of lifesaving, and it’s clear that your medical team’s expertise and compassion were essential in bringing him back to health.\n\nI am particularly grateful to Dr Geoffrey from Kin Vet, Dr Nigel and Dr Denise from Beecroft Animal Specialist & Emergency Hospital for their dedication and diligence in addressing Puss's medical needs so thoroughly. Your quick intervention and thoughtful approach left a profound impact on me. I can't thank you enough for the skilful and considerate treatment Puss received.\n\nThanks to your team, Puss now has the best chance to make a full recovery and I am truly appreciative of the care and commitment shown to his well-being. Your efforts have made all the difference and I am eternally grateful for everything you've done for him.\n\nWith warmest regards,\nLemmy",
      "time": 1729859382,
      "translated": false
    },
    {
      "author_name": "R S",
      "author_url": "https://www.google.com/maps/contrib/106168904010341654237/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIWKTQWEwTj8u_vxUWOI2d-i4zmviSbYwuyUl95GqFWkN2ll-M=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Part 1/2\n\nHighly DO NOT recommend this clinic/hospital for your pets if you  feel that your fur babies deserve the better or best. The staff's experience and attitude are subpar at best.\n\nIn the last quarter of 2024, I sent my dog to Beecroft because the Vet said he needed chemotherapy for the control of his mast cell tumour after the removal of it. Vet was very insistent & persistent on my pet to go through the chemotherapy  because it will help him, and if he doesn't go through the chemotherapy, she mentioned that my pet will only have three months left to live at most. But with finishing the chemotherapy course, he will have at least a year lifespan more. I was very hesitant in putting my pet through chemotherapy because he is 8 years old and the toll / side effects that will take on his body. Who wouldn't want the best for their pet right? So we took the doctor's words and had put our pet through the chemotherapy for 15 weeks.\n\nDuring and after my pet's chemotherapy, he was losing weight although his appetite was keeping up, so where are all the food going? This was the scary part but not even the vets could explain. And his course of chemotherapy finally ended in February 2025. Weeks later, my dog started to bleed and excrete blood when he does his big business, we updated the Beecroft clinic through email/whatsapp, but they just brushed it off with telling us to continue monitoring him as it was just straining on his rectum/anal.\n\nIn April 2025, rushed my dog who vomitted twice and lost a pool of blood through his stools, down to Beecroft in the middle of the night. My dog was already breathing heavily and still bleeding profusely through his anus upon reaching the clinic. After some time of wait, we were finally greeted by the vet and was told my dog is being placed in the ICU but he's well taken care of and there's nothing to worry about, he just needs to be hospitalised for 48 to 72hours and he will be able to go home. My dog has his bloods taken for test, and the vet adviced us to go home and wait for her update through the phone call and the phone call will be good news on just updating his blood results. We asked for a chance to take a look at our dog before heading home and we were granted a minute or two to take a look at him before we left for home. We could see that he was covered in a blanket which was the \"warmer\" for him and there are still blood stains around which shows that nothing was done to stop his anal from bleeding or just maybe the vets thought it was no big deal.\n\nUpon reaching the house's carpark, we received the call from Beecroft stating that our dog has already passed on, and they did CPR on him but only managed to get him back once for that short while and he left again. We rushed back down to the clinic immediately, but were still kept waiting at the counter for a good ten minutes. If you were ever in that situation you would know that ten minutes felt like ages. And the vet came out and pulled us to another room to explain his blood tests etc. In my mind, was just are you serious about even explaining these tests results right now, when my pet is inside being given CPR inside and I don't even know what's the status going on for him. It only shown light to me that this place has no compassion, no procedures, they do not understand pet owners at all. I was so done with her explanations on the test results that I just cut her off and asked to see my dog, and the moment I walked through the door seeing him being performed on with CPR, I more or less knew he has gone as his urine has already started to flow out uncontrollaby.\n\nWe lost our furbaby of almost nine years that night, we stayed with his body that turned cold and hard for eight hours till the morning at Beecroft until the pets cremation worker came to pick my dog up. And at the end of it, no concrete explanations were given by the vet on how things came to this state or what was the cause that led to my dog's death or sudden loss of blood through his anus.\n\n-Refer to image for Part 2/2-",
      "time": 1745147348,
      "translated": false
    },
    {
      "author_name": "V&K",
      "author_url": "https://www.google.com/maps/contrib/112790891149443131670/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXwnOvQNS4CEg81qjUCiiLHNM-9eW6Zih4Z_jNUSoZjIWmu9Zk13Q=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Thanks Dr Cleo, Dr Athena and team taking care of my rabbit. Both dr are able to give me the honest and clear advice with their experience that allows me to understand the condition. I am very grateful for their understandings towards the worries and concerns that I had. They didn’t stress me on doing further invasive investigation. Thanks Dr Athena for spending time speaking to me patiently on the phone answering my queries and explaining the conditions in detail. She also gave me a call after checking the blood glucose right after as promised after our first call. She also met me in consult room  assuring me that he’s in peace during his last moment… Thanks for the patience and empathy … it’s much appreciated. Its very tough when thousands of thoughts coming to your mind while u want to provide the best care for the dear one, in addition to manage my own emotions, the empathy and clear picture provided really help me and my baby… thank you…",
      "time": 1744770983,
      "translated": false
    },
    {
      "author_name": "ho yvonne",
      "author_url": "https://www.google.com/maps/contrib/111692738846266590525/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLhbR32c0wIYp5anKyEDjQ_xx8iabvNBJR1aKLrmff1wYiPlA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Great rehab team, always very patient with our dog Bailey. All therapist are very professional.\nAfter 2 session of hydrotherapy, Bailey’s LP improved a lot,  lesser limping and slipping off the floor.\nBailey look forward to next session, he will be very excited when I start packing his bag.\nRehab team is very accommodating, I have request to find weekend slot, they will notify me whenever there is a timing that match my request.",
      "time": 1728713773,
      "translated": false
    },
    {
      "author_name": "lynn looi",
      "author_url": "https://www.google.com/maps/contrib/117145702746527988997/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXESpc-O2WMJKRPW_Ec5oBdJpl7TuJE2u5N5c0W_8JX2uchsutV=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Our 16yo dog was admitted as he collapsed at home. Our family can’t thank Beecroft enough and would want to express our deepest gratitude to the surgeon, nurses, and medical team for the successful surgery and the exceptional care given to our dog. Their skill, dedication, and kindness have made all the difference during this time.",
      "time": 1741349570,
      "translated": false
    }
  ],
  "types": [
    "veterinary_care",
    "pharmacy",
    "store",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11108581165041359335",
  "user_ratings_total": 253,
  "vicinity": "991E Alexandra Road, #01-27, Singapore"
}