{
  "formatted_address": "253 Choa Chu Kang Ave 1, Singapore 680253",
  "geometry": {
    "location": {
      "lat": 1.3773615,
      "lng": 103.7444531
    },
    "viewport": {
      "northeast": {
        "lat": 1.378737230291502,
        "lng": 103.7458989802915
      },
      "southwest": {
        "lat": 1.376039269708498,
        "lng": 103.7432010197085
      }
    }
  },
  "name": "Berjaya Eating House",
  "place_id": "ChIJOexKQsQR2jERjvauVQk06-s",
  "rating": 2.6,
  "reviews": [
    {
      "author_name": "Wolfy Ng",
      "author_url": "https://www.google.com/maps/contrib/104732385523821259829/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJngWmxl_QgCqiC6l5BHQ0TUpo286xI5l4mAahUhV6igEriWQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "Drinks stall lady boss is full of attitude, wouldn’t allow to even take drinks for medication etc before our food and chase us away despite explaining to her that it’s for medication purpose and we are intention to buy drinks. Infact we always buy drinks when we have our breakfast and lunch her. But her attitude is way beyond understanding and arrogance. My goodness, what an extremely rude lady. Better don’t come here if possible , go to the coffeeshop beside.",
      "time": 1745908957,
      "translated": false
    },
    {
      "author_name": "Ruth Ng",
      "author_url": "https://www.google.com/maps/contrib/102194143601338596326/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIp5hurW7YNnCFy9pQgqTP5Ed9o9ifQoFgDyPm8OISL1SDfWA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "Food stalls here are nice but the drink store is terrible and notorious especially the lady boss. I’ve gotten food from the stall, waiting for my husband to finish his order and we will go get drinks, while waiting I’m just drinking my fiber before I start to eat, the lady boss immediately sent a worker over and tell me I cannot drink from own water bottle and must keep our bottles (my hubby is going to gym after this). Knowing that she is just a worker, I went to the lady boss to tell her it’s just a fiber supplement which I have to take immediately before I eat my food, she dismissed me and insisted that I cannot do that. Not even giving an option of if not you buy my drink. She is adamant in us not eating at the coffeeshop. If I am drinking from another store that is not hers, I can understand that, but I am not and I will be buying drink (which she doesn’t believe even when my hubby went to talk to her). She made me so infuriated that we took away our food. The wanton stall aunties are nice enough to pack our food for us. And the Prata shop uncles were also understanding. I’ve been having my breakfast at the coffeeshop for a while now after I sent my kids to school and this shall be the last time i will sit at the coffeeshop and drink from that stall.",
      "time": 1745904836,
      "translated": false
    },
    {
      "author_name": "Rachel Shi",
      "author_url": "https://www.google.com/maps/contrib/112162741524675862861/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIh2499zDC8v_4JPZrwTLcdslVjI49aE3dIvzO0p6WAJRihDQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "11 months ago",
      "text": "Probably the worst coffeeshop in singapore that I have ever been to. My mum and i were eating our breakfast- 1st time dining there. The auntie at the drink stall ( I guess she should be the lady boss) came storming scolding and embarrassing us for our stuffs on the table. Those stuffs were packed food and drinks for my kids at home. She scolded us so loudly saying she dont welcome any food and drinks from the coffeeshop beside which I can understand but my point is we are not even consuming those packed food. Both of us were eating the wanton mee bought from 1 of the stalls in the coffeeshop. She continued to accusing us saying this was not our 1st time there, bringing outside food and we were not welcome in there. There was no outside food or drink being consumed while we were in the coffeeshop and yet being treated this way. This is just too ridiculous and you may want to think twice to patronise this coffeeshop.",
      "time": 1719017888,
      "translated": false
    },
    {
      "author_name": "adrian lee",
      "author_url": "https://www.google.com/maps/contrib/115769476555866860763/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIj8DyLa7Fci29N7jVOZLygoRtmabEgzf0z4bDsfzs_J_2B5w=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "in the last week",
      "text": "Literally one of the worst coffee shop in Singapore. I ordered a plate of chicken rice for dine in. I had a bottle of water with me ( brought home) and was ask to put it away or I have to leave. The boss said this is a private property, which means no outside food and drinks. He literally didn’t even allow me to put it on the table. I can fully understand if I ordered drinks from another store just opposite them and drank there. I ordered FOOD from the coffee shop and all I wanted was plain water from home. Jesus, I’ve never witness such tyrant in my life.",
      "time": 1747214395,
      "translated": false
    },
    {
      "author_name": "Zatarie Hoe",
      "author_url": "https://www.google.com/maps/contrib/115063186209477778569/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUWV4p_vK-2F7i_gCRcxeIq7dqVa3_HNMk0P-0PRJpV2mlxWfjCKg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Food here is delicious. Loads of food to choose from —> chicken rice, Hokkien mee, CKT, mala, wanton mee! If I end work late I’ll eat the tze char. Food is delicious and cheap. Would definitely recommend! Mala is my personal favourite ❤️",
      "time": 1674791277,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16999738433136948878",
  "user_ratings_total": 22,
  "vicinity": "253 Choa Chu Kang Avenue 1, Singapore"
}