{
  "formatted_address": "154 W Coast Rd, B1-19A, Singapore 127371",
  "geometry": {
    "location": {
      "lat": 1.3037119,
      "lng": 103.766029
    },
    "viewport": {
      "northeast": {
        "lat": 1.304861580291502,
        "lng": 103.7670550802915
      },
      "southwest": {
        "lat": 1.302163619708498,
        "lng": 103.7643571197085
      }
    }
  },
  "name": "Berries World of Learning School (West Coast)",
  "place_id": "ChIJW1XW7PEa2jERVW5EAW6n6wQ",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "J",
      "author_url": "https://www.google.com/maps/contrib/101432351314419437088/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLyuCp27kRax4ZloMr-NEfj17dDo5XZFt6vIGohNO8_B2W01ZA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I recently had the opportunity to enroll my child in Berries at West Coast Plaza, and I am thrilled to share my positive experience with others. Berries is an exceptional enrichment centre that offers quality Mandarin language education for children.\n\nFrom the moment we stepped into the centre, we were greeted with a warm and inviting atmosphere. The staff members were friendly, approachable, and knowledgeable, making us feel welcome right away. Their dedication to creating a supportive learning environment was evident.\n\nBerries at West Coast Plaza has well-equipped classrooms designed to foster a conducive learning environment. The facilities are clean, organized, and filled with engaging learning materials. Each lesson is carefully planned and delivered by experienced teachers who have a deep understanding of how to engage young learners effectively.\n\nThe teaching methodology at Berries is highly effective in helping children develop their Mandarin language skills. The curriculum is thoughtfully designed to make learning fun and interactive. Through engaging activities, games, and songs, children are encouraged to actively participate and develop their listening, speaking, reading, and writing abilities.\n\nOne aspect that truly impressed me was the individualized attention given to each child. The class sizes are kept small, allowing teachers to give personalized guidance and support. This approach ensures that every child receives the necessary attention to thrive and progress in their language learning journey.\n\nThe progress I observed in my child's Mandarin proficiency since joining Berries has been remarkable. Not only has their vocabulary expanded, but their confidence in speaking and understanding the language has grown significantly. I credit this progress to the expertise and dedication of the teachers at Berries.\n\nOverall, I highly recommend Berries at West Coast Plaza to parents seeking a reliable and effective Mandarin enrichment programme for their children. The friendly staff, well-equipped classrooms, engaging curriculum, and individualized attention create an exceptional learning environment. Berries has exceeded my expectations, and I am grateful for the positive impact it has had on my child's language development.",
      "time": 1686620099,
      "translated": false
    },
    {
      "author_name": "lili liu",
      "author_url": "https://www.google.com/maps/contrib/100950194857138573161/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLEm0m9ob9YomsFSHqDN-749xPz6dq7jLseCqz7c0OXAbReEg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Kid loves to come. He likes his teachers. And he will remind us to take him to school couple hours before the class starts.",
      "time": 1689027659,
      "translated": false
    },
    {
      "author_name": "陈荟荃（Tracey Tan）",
      "author_url": "https://www.google.com/maps/contrib/108815022567140305672/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU1ykHHW6aT-lAwH9TTappia66t78QK_MyODgxvkJbn7khnjpP8=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Good environment for children learn Chinese. Teachers are professional on teaching.",
      "time": 1677245564,
      "translated": false
    },
    {
      "author_name": "Benjamin Loh",
      "author_url": "https://www.google.com/maps/contrib/103447438984274060287/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUNu3qMKvxMItwENqSIQTn4RTXtS41IYTqjei9ByTC4-GyXjiI=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Kid loves his Chinese class. I don’t know how they do it, but he looks forward to coming every week and his Chinese is improving.",
      "time": 1650543778,
      "translated": false
    },
    {
      "author_name": "ko ko liu",
      "author_url": "https://www.google.com/maps/contrib/110807818563979166204/reviews",
      "language": "en-US",
      "original_language": "zh",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKoByaFXzujXNfr5cYXVeN0VMyCzs2TB6iaBuPJqUqhvVdldg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My son likes to go to Bailiguo class very much. He goes there half an hour early every time and says he likes the teacher very much. My family has been going to Bailiguo since K1, and my Chinese scores have always been excellent. Thanks to the teacher for his patient teaching!",
      "time": 1710505038,
      "translated": true
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=354561086588218965",
  "user_ratings_total": 16,
  "vicinity": "154 West Coast Road, B1-19A"
}