{
  "formatted_address": "12 Marina Boulevard, Tower 3, Level 2 Marina Bay Financial Centre, Singapore",
  "geometry": {
    "location": {
      "lat": 1.2792145,
      "lng": 103.854603
    },
    "viewport": {
      "northeast": {
        "lat": 1.280543980291502,
        "lng": 103.8560738802915
      },
      "southwest": {
        "lat": 1.277846019708498,
        "lng": 103.8533759197085
      }
    }
  },
  "name": "Better World Café (exclusively for DBS Employees)",
  "place_id": "ChIJlTCMpu0Z2jERznDPsPyeGhI",
  "rating": 3.8,
  "reviews": [
    {
      "author_name": "Xiu Ling Lim",
      "author_url": "https://www.google.com/maps/contrib/103964625598585734103/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV2j3yUiEJHVofy4m-SvAuzcVdGd9HdefDS2zviOSqFzOydIYEK=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "The Better World Cafe is exclusive to DBS employees and is beautifully designed. A staff pass is required in order to enter the cafe. As a DBS staff, it is relatively convenient to grab lunch and helps to save time, especially when we have to get our food within a short time frame before the next meeting. Food can be ordered in advance via the QR Code and there will be a SMS notification when the food is ready for collection. It is also a good escape from the large lunch crowd in the CBD area.\n\nFood wise, there is a good variety of dishes and cuisines to choose from. Prices are comparable to food court prices. Overall, this cafe is a good initiative and beneficial for staff.\n\nNearest Train Station: Downtown MRT",
      "time": 1716004528,
      "translated": false
    },
    {
      "author_name": "Srd G Bains",
      "author_url": "https://www.google.com/maps/contrib/100632680324370910290/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXdGRO9USM8YPWrexNqtvdL6neapjzF5ddD601klzP5LbC4batgRA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Good but expensive only for DBS staff\nIncludes halal , cafe items n non halal\nHalal have lots of choice n reasonable price\nNasi lemak bowl is the best with different desserts\nMust try",
      "time": 1745499628,
      "translated": false
    },
    {
      "author_name": "La Madame NomNom",
      "author_url": "https://www.google.com/maps/contrib/118395200523287063467/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVDfQfgprvRaZdvRDFsjb0ZJZxu0qLB4GQ_2STz7h1qkjmEb4aQ2A=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "2 years ago",
      "text": "This is a \"DBS staff only\" cafe or if you're accompanied by DBS staff as guest. The food tasted real good! Spacious dining area and most importantly this cafe promotes sustainability.\nVegan and vegetarian options available too.",
      "time": 1665042103,
      "translated": false
    },
    {
      "author_name": "Al is me",
      "author_url": "https://www.google.com/maps/contrib/110425125801623374530/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKCoTU3bu61Du9CwVaPUREWSs8C05IwRllzku823ZB07jfvcg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "For a $12 Fish & Chips, the portion is shockingly small and pathetic. Not exaggerating from the picture but the size of each fish is as 'large' as the scooping part of the spoon.\n\nAlso waited 45 mins for takeaway because they 'forgot' about our orders. First and last time at BWC.",
      "time": 1681733554,
      "translated": false
    },
    {
      "author_name": "Basil Yap",
      "author_url": "https://www.google.com/maps/contrib/103023309861566591900/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWDKzgNjWCtkudsqBUYSNxZVBkXO0OxwKh7fhr00SdZcH88Y7WS=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "The design of Better World Cafe (BWC) is woefully inadequate. The cafe was designed without thoughtful consideration of the needs of DBS staff members.\n\nIt's design is pleasing to the eyes but highly inefficient for the preparation of meals and providing adequate seating for diners, which causes employees to spend more time waiting than eating. There are four different food stalls available but all it's food options are centered around only one, causing there to be a bottleneck with insufferably long service times whenever there is any small uptick in demand. Furthermore, despite having a footprint of three shop units, diners are afforded barely any dine-in seating whatsoever and are more likely than not forced to take out food. For an establishment that touts eco-friendly principles, it would've been nice to have been provided high capacity seating arrangements to avoid generating additional waste in the first place.\n\nOf the four times I have purchased a meal in BWC, three times I have waited more than 40 minutes for my food. BWC seems more like a fanciful design project done by college students than a well-thought and practical food option for employees of a multi-billion dollar company. The additional time spent by employees waiting for their meals could have been better spent improving the lives of it's customers and increasing the profitability of the company.",
      "time": 1679897930,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1304529850212511950",
  "user_ratings_total": 10,
  "vicinity": "12 Marina Boulevard, Tower 3, Level 2 Marina Bay Financial Centre"
}