{
  "formatted_address": "11 Northshore Dr, #01-11 Marina Country Club, Singapore 828670",
  "geometry": {
    "location": {
      "lat": 1.4151523,
      "lng": 103.8989929
    },
    "viewport": {
      "northeast": {
        "lat": 1.416391280291502,
        "lng": 103.9005872802915
      },
      "southwest": {
        "lat": 1.413693319708498,
        "lng": 103.8978893197085
      }
    }
  },
  "name": "Big Boss Chef",
  "place_id": "ChIJ2wjrUHUV2jERLlvOC2mn0xQ",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Ong Angelia",
      "author_url": "https://www.google.com/maps/contrib/104021388441581773250/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVzePgplx-eSilgI1HW14k2C4BY9zwsSj0cik_ro4brDt6b3li-NQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Had a very delicious and enjoyable Mother’s Day dinner here. Although food came a little slow due to the crowd but it was Delicious! The environment was nice and we took some pictures with the decors. Family members were full of praises for the food and services. I have also recommended friends to come and they also like it.",
      "time": 1746984571,
      "translated": false
    },
    {
      "author_name": "Meng. Chai",
      "author_url": "https://www.google.com/maps/contrib/104908480851850700518/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJxfUG50WPrgp6jXnmZ5-zf1vecSv6jSj-PnyiugI7VXJ1NSA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "Went on a Saturday , hence all tables were occupied!  Even though the food was preordered, our table waited over 30 min for the food also had to remind the servers twice to bring the beverages. Noticed diners brought their pet dogs to dine together. Overall, food was above average. The crabs were a tad sweet but acceotable. Other dishes was acceotable.",
      "time": 1746968671,
      "translated": false
    },
    {
      "author_name": "Kai",
      "author_url": "https://www.google.com/maps/contrib/103961412486889059100/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVu8fMZsK8VICJpIhG-TkOCDo-GvUxKgoaTgfepun3_I5cHcaVg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Didnt realize Dai Lou changed hands to his Big Boss Chef 😄\n\nGood Tze Char overall. The signature chives fried hor fun was great. Service was warm, friendly and awesome. Much better than previous Dai Lou.\n\nThey even provided complimentary dessert after our meal. The lady boss let us in that they make different desserts daily, like green bean soup, taro paste (orh nee), orh bi beh and others. Which are not on the menu.\n\nTaste:\nSigntature Chives Fried Hor Fun 5/5\nLychee sweet and sour pork 4/5 (tad too sweet)\nGreen dragon vegetables (5/5)\nSliced fish soup 4/5\nYang Zhou fried rice 2.5/5\nLoklok 2/5\nGreen bean soup dessert 5/5",
      "time": 1739710215,
      "translated": false
    },
    {
      "author_name": "Jolyn Wong",
      "author_url": "https://www.google.com/maps/contrib/102937708302821021428/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIAN-z36wFUvOUiZ5BFgQ-HwC0RVlSfwZeHcDDWly7MHCYSbg=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "3 months ago",
      "text": "Having CNY set dinner tonight at the restaurant. Crab and pig trotters some portions are cold. Most of the food is not hot, it is just warm. Dessert was neither cold nor hot, thus it tastes weird. The dessert was not those freshly made, it was those shelf kind. Shouldn’t it be a proper serving of fresh dessert since the restaurant already prepared for CNY. Disappointed as the whole dinner was not cheap but food quality was not up to standard. Since the restaurant charge so much, I think food should be the important component.\n\nThey change plate at the wrong timing. Changing plates when we are finishing the last dishes and the last dish which is the dessert doesn’t not need plate.\n\nLooking forward to the dinner but was really disappointed with the CNY set meal.",
      "time": 1737819648,
      "translated": false
    },
    {
      "author_name": "oXRYSTALo Ong",
      "author_url": "https://www.google.com/maps/contrib/114556064085815871377/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSTtKcF9FYMbh-XNbDu8f7Whl3gi-ZY6T8pFPOm3v9Y98Ws7jL=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Big Boss Chef (Kapong Marina): A Relaxing Dining Experience with a Standout Hor Fun (4/5 Stars)\n\nRating:\n\n• Food: 4/5 (Signature Preserved Vegetable Hor Fun was fantastic, but the lok lok didn’t quite hit the mark)\n\n• Service: 5/5 (Warm, attentive service with thoughtful follow-up and a complimentary dessert)\n\n• Atmosphere: 4/5 (A cozy outdoor setting with marina views, ideal for a laid-back dinner)\n\n• Value: 4/5 (Good prices and a varied menu with plenty of drink options)\n\nOverall: 4/5\n\nDonkey & I were out cycling, looking for a bite to eat, when we stumbled upon a familiar sight—the restaurant in Kapong Marina that used to be Dai Lou. However, a sign proclaimed a new name: Big Boss Chef. Curious, we decided to give it a try. The server informed us that the restaurant had undergone a complete revamp in the past five to six months, with a new chef, menu, and even a lok lok offering.\n\nBig Boss Chef specializes in Chinese, Asian, Seafood, and Singaporean cuisine. It offers a charming, outdoor dining experience, complete with a stunning view of the marina. The soft lighting and gentle sounds of the marina created a relaxing atmosphere, enhanced by the fact that some tables are sheltered, making it perfect for a casual dinner even when it rains. The restaurant boasts efficient service thanks to a talented team of chefs, and their menu features fresh, flavorful ingredients. With its late-night opening hours (until 2:30 AM daily) and pet-friendly policy, Big Boss Chef is a great option for those seeking a casual supper or a fun night out with furry companions.\n\nThe restaurant itself has been tastefully renovated and is quite cozy. We were happy to find ample bike parking outside. It was fairly quiet when we arrived at 6 PM, but by 7:30 or 8 PM, it became much livelier with more customers.\n\nThe server recommended the San Lao Hor Fun and Signature Preserved Vegetable Hor Fun, which we were eager to try. I also added broccoli lok lok, one of my favorites, along with some Chinese sausage and quail eggs which was Donkey favorite. We decided to go for a beer deal—three bottles for $16—which seemed too good to pass up.\n\nThe San Lao Hor Fun was decent, but the true standout was the Signature Preserved Vegetable Hor Fun. It was a unique and flavorful dish that we really enjoyed.\n\nOn the flip side, the lok lok didn’t quite live up to expectations. As someone who has tried lok lok at various places, I found the chili sauce a bit underwhelming, and I didn’t love the powder they sprinkled on the skewers. The skewers also didn’t seem grilled long enough, which made them feel a bit off.\n\nA delightful surprise came after our meal when the restaurant treated us to a complimentary dessert. It was a nice touch, even though it was a little diluted. To round off the experience, the server kept bringing us more peanuts as we finished each bowl, which was a thoughtful gesture. Their friendly, attentive service made the evening even more enjoyable.\n\nThe ambiance was calm and relaxed—perfect for a catch-up with friends or family. While some dishes didn’t quite meet my expectations, Big Boss Chef is still a lovely spot to unwind and enjoy a meal with loved ones.",
      "time": 1737642936,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1500727170455984942",
  "user_ratings_total": 72,
  "vicinity": "11 Northshore Drive, #01-11 Marina Country Club"
}