{
  "formatted_address": "1220 ECP, Singapore 468960",
  "geometry": {
    "location": {
      "lat": 1.3071847,
      "lng": 103.9365023
    },
    "viewport": {
      "northeast": {
        "lat": 1.308617830291502,
        "lng": 103.9377641802915
      },
      "southwest": {
        "lat": 1.305919869708498,
        "lng": 103.9350662197085
      }
    }
  },
  "name": "Bike Stop @ East Coast Park Area E2 (Coastline Leisure)",
  "place_id": "ChIJLTh2WZUi2jER98cYww3Qiig",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "mselia88",
      "author_url": "https://www.google.com/maps/contrib/101664909258538253753/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXu2hKf6ke2VjPT_VNu0U8WHfAOSlZDVRnitRF-p6FGmJra--Dj=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "First time getting family bicycle,  for family with 4 adults 3 kids. Got us 1 big ($60 per hour) and 1 small ($40 per hour) family bicycle for  3 hours. After sitting down and getting use to cycling, we realised all could fit into 1 big family bicycle. So we went on to return 1 small bicycle within 10 mins.  The person sort of say can settle later so we proceed on our 3 hours ride. After returning the big family bicycle, we thought they will refund us the small bicycle money, as we paid $40 X 3 hours beforehand. But they did not. I feel that they are not very honest. They could have been clearer to us. Just be careful with your decision, make sure you try on and see what suitable before you pay them. They could have advise us with what is suitable as this is their core of business. Didn’t even refund $40x2 hours (since we used for 10 mins +/-) or give us any voucher to come back to use the unused credits. Just be careful. $120 may not be a big amount to some, but the experience is totally disappointing. Other than that, the bicycle is decent. During our ride, we still thought about coming back every weekend, as it could be really good family activities. But no, not anymore.",
      "time": 1738407047,
      "translated": false
    },
    {
      "author_name": "Daniel Purchase",
      "author_url": "https://www.google.com/maps/contrib/110392707115916281068/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWV1wydlBkASQHs34_PoBrr631N8v1Dzh3-Tb0qWWS6Ff2qzBTh=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "I took out a 3 hour rental. I was advised I could return to any of their branches on the East Coast Park. The general quality of all the bikes is poor. Some maintenance and care is badly needed. I decided to take the cheapest bike after testing a few because the quality was poor all round. Rusty breaks, wonky pedals, loose seats etc.\n\nUnfortunately I got caught in a horrific storm and tried to return it to this branch as the other one was a 30 minute ride away. I was already drenched, shivering and deeply uncomfortable. How sad it is that they ask for money to return the bike to a different branch. Then I try to pay, they charge a fee to actually make the payment (I know, hard to explain).\n\nPlease avoid this if possible. Try the Bicycle Hut on Clarke Quay - I had a wonderful and pleasant experience with them.",
      "time": 1741435002,
      "translated": false
    },
    {
      "author_name": "Stephen Poulson",
      "author_url": "https://www.google.com/maps/contrib/101893932757333545590/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVXrGrx1fBR2nyZ0CQhK0nV_wdFGEiUpRBCsTKoBbr_FD_r1Grk=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "I’d give you a -1 if that existed.  It’s a sad day for the bike community when a biker can’t drop by to borrow a pair of pliers for ONE minute to allow me to reinstall my tire valve.   You’ll forever get a shite rating from me.",
      "time": 1731717697,
      "translated": false
    },
    {
      "author_name": "Link",
      "author_url": "https://www.google.com/maps/contrib/114600269748721669879/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK8e-br1g1CRhPJZZKIbKaLCPwah-3xELVkNNSUFl8gvBMqpQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Staff not upfront with prices which can be very confusing, wanted a bike for $16 for 3hour and communicated that but when it comes to check out it became $24, wanted to change it but was told i can only change once. The next bike I change to, I was told that it’s $15 for 3hours but when i went to the counter it became $20. Left a very bad taste in my mouth, will not patronise this shop again.",
      "time": 1743683715,
      "translated": false
    },
    {
      "author_name": "A R-T",
      "author_url": "https://www.google.com/maps/contrib/117945263201862639410/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU-3kMDhyslDut1wHWZCwLXkFbPtqz1OHghDamiF08qSeCJLs58=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "Stopped here to borrow a wrench to help a friend loosen a nut for adjusting her seatpost. First, they would not lend any tools at all, citing possible theft. When I asked if he might then help us loosen the nut, they said the charhe FOR ADJUSTING A SEATPOST was $10 to $15!!! And they absolutely insisted that payment was required. We left this unhelpful shop and vowed never to return. Disgustingly, shockingly bad customer service.",
      "time": 1731157291,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2921376065829521399",
  "user_ratings_total": 769,
  "vicinity": "1220 East Coast Parkway"
}