{
  "formatted_address": "151 Tyrwhitt Rd, Singapore 207564",
  "geometry": {
    "location": {
      "lat": 1.31176,
      "lng": 103.8602
    },
    "viewport": {
      "northeast": {
        "lat": 1.313065480291502,
        "lng": 103.8616008302915
      },
      "southwest": {
        "lat": 1.310367519708498,
        "lng": 103.8589028697085
      }
    }
  },
  "name": "Blanc Inn Singapore",
  "place_id": "ChIJ825fOskZ2jERqkBjNDBh-Ls",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Gary Soh",
      "author_url": "https://www.google.com/maps/contrib/107590729125958695859/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLnNfrDHCKDcoPfekLyqpme6KxyWyZuUR1Mljz2dYjpY19w3BA_=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "The only downside of the hotel is it needs a better sound proofing… noises can be heard easily if neighbouring rooms are moving/talking.\nI couldn’t use the ironing board as someone burnt their clothes and it left a mark. The hair dryer can be improved as it overheats easily and stopped working.\nSafe is available in the room, and the aircon fan temperature is just nice. The bed and pillow provided is cozy enough for a good sleep.\nI have to say the laundry price is too expensive lol 8 dollars for 15 pieces of clothing\nThe hotel is located near Bendemeer and Lavender MRT. Coming out from Lavender is just one straight line walk to the hotel.\nFor foreigners that want to go to a gym, there’s ActiveSG, a 3 min walk away from the hotel. It costs only 3.30 dollar per entry, but you have to bring your own towel.\nFood is not a problem as there are hawker/restaurants and bars nearby.",
      "time": 1735825140,
      "translated": false
    },
    {
      "author_name": "Alyana Raye Batan",
      "author_url": "https://www.google.com/maps/contrib/114280646070596177027/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWAZdCGJBSax6SCweWmeSsrnR2OZYQFWjMnJI3rMITAoouqFhkw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "The place have lots of food options around the area, the place is very clean for a hostel and rooms are nicer since they have privacy walls. The owner is really nice and very accommodating. All are secured by codes which will be provided after the self check in - in front of the hostel. The rooms are also well ventilated, towels are provided as well as sanitizer every room door, hand wash in every sink, body wash and shampoo in shower rooms. They also have hot and cold drinking water, shower heater , and common area for dining, as well as hair dryer in changing room. Rooms are provided with adaptor so you don't need to worry about the sockets. Also very affordable. 🤌🤌🤌",
      "time": 1728310743,
      "translated": false
    },
    {
      "author_name": "Prawika Utary",
      "author_url": "https://www.google.com/maps/contrib/105066293953487483350/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUa01R8_63Lds7Ka1Fhv0I6UsB2UP0gFeE1JU2VpE3XhUT-beug=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "stayed here for 2 nights but I felt very comfortable and had a pleasant stay here.  All rooms are clean, have quite large common areas.  The staff was also very warm and friendly, when I was doing check in, he also explained all the things we need to know about this hostel, as well as the area around the hostel. Even though the MRT station is quite far, the environment around is safe and comfortable for pedestrians. When I return to visit Singapore, this hostel will be my first choice for sure.",
      "time": 1701439181,
      "translated": false
    },
    {
      "author_name": "이아름",
      "author_url": "https://www.google.com/maps/contrib/111725971929615828225/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUFQXLXts3klmKKqK6Rx2GjwZFaVgQsCEUi7KqDmCRpKiSy2bDK=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "I recently stayed at Blanc Inn and was pleasantly surprised by my experience. I booked a room with a double bed and was pleased with the high ceiling, which made the room feel fresh and airy. The air-conditioning was also a great addition and kept the room cool during the hot days.\n\nThe staff were incredibly friendly and accommodating, making my stay even more enjoyable. The shower and resting areas were reasonably clean for the price and provided a comfortable place to relax after a long day of exploring.\n\nThe location of the hotel is in a quiet and safe area, providing a peaceful retreat from the bustling city. However, it's worth noting that the hotel is around 10 minutes away from the train station, which can be a bit hard to access if you're carrying heavy luggage. On the other hand, the area itself runs till late night, making it easy to grab a beer or two if you're in the mood.\n\nOverall, I had a great experience at Blanc Inn and would highly recommend it to anyone looking for a comfortable and affordable stay in the area. The combination of a friendly staff, clean facilities, and convenient location make it a great choice for any traveler. In fact, I would definitely stay at Blanc Inn again on my next visit to the area.",
      "time": 1680332356,
      "translated": false
    },
    {
      "author_name": "andréa paige",
      "author_url": "https://www.google.com/maps/contrib/107402519546703237635/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWFfAttdEXYRRuB8mX8vsLEyrsAhW0eV0iIpBpctg33bvJ0DIUJ2Q=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "a year ago",
      "text": "The staff was very kind. The rooms were incredibly noisy. You have 1-2 rowdy, unconscious people stoning around the stairs, and you won’t be able to sleep. They need sound proofing. It’s literally one step above a capsule hotel, but to be honest, you’ll sleep better in a capsule hotel.",
      "time": 1707784550,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13544682738982011050",
  "user_ratings_total": 118,
  "vicinity": "151 Tyrwhitt Road"
}