{
  "formatted_address": "450 N Bridge Rd, #05 01, Singapore 188732",
  "geometry": {
    "location": {
      "lat": 1.2977727,
      "lng": 103.8553004
    },
    "viewport": {
      "northeast": {
        "lat": 1.299170880291502,
        "lng": 103.8565791802915
      },
      "southwest": {
        "lat": 1.296472919708498,
        "lng": 103.8538812197085
      }
    }
  },
  "name": "Bloom by Roseanne Personal Make-up School",
  "place_id": "ChIJjxIycnIZ2jERPGPkV3Ib3dw",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Gladys Leong Yi Shuang",
      "author_url": "https://www.google.com/maps/contrib/116742092596390843991/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUVM1ECiVGxUbTZbpQ0iIrq8GdtRtjeUwFHXcQ_OVoO4Isw8vz0=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I’ve signed up for Roseanne’s 1-1 make-up class and I think she taught me not just make-up stuff but also helped me gain more confidence. Not only is she knowledgeable in the field of make-up, but she’s also incredibly patient in explaining the various steps of a make-up, and explaining the different uses for different brushes. She is super nice, gentle, soft, and helpful. I’ve had a wonderful 1-1 class and I’d recommend amateurs like me to sign up for her class!",
      "time": 1741075262,
      "translated": false
    },
    {
      "author_name": "sabrina teo",
      "author_url": "https://www.google.com/maps/contrib/107546490659916216591/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUDrZS9aw2Nu03_Kf7GbdB4uxbQeQj0Xw6eFYfFQvQMZB3Z6IB6=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Signed up for the 2 hour signature make up workshop with my sister. It was overall an enriching experience! Roseanne was incredibly patient and professional, making the entire session enjoyable and informative. She provided excellent skincare tips, guiding us how to prime our skin well before the make up. She also carefully selected shades that suited our individual skin tones, and shared practical makeup techniques that were easy to follow and apply. We definitely feel so much more confident in our makeup routines now. Thank you for such a wonderful session!",
      "time": 1735218738,
      "translated": false
    },
    {
      "author_name": "Jingwen Phua",
      "author_url": "https://www.google.com/maps/contrib/102297102810901499669/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJtKRLN9VUEFibPzX-c58VfhjGlVa8SrJJVdShVPdvHI4x0qQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "My friend and I booked a Signature Workshop, and Nadia was really kind and helpful. She helped me to find out that I actually have an olive undertone and was so patient with the two of us makeup-idiots. She advised us on the products we could use from the ones in the school, but also suggested more budget-friendly options. We really appreciated her and recommend her to anyone interested in learning the basics.",
      "time": 1743995538,
      "translated": false
    },
    {
      "author_name": "Lydia S",
      "author_url": "https://www.google.com/maps/contrib/103152187048380418613/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVrH5L326UIt-2QBhdlGathf0HNxK7zP4I4gahawb0nKLAPRS3b=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "TLDR: HIGHLY RECOMMEND. I can not recommend this enough. You will not regret this.\n\nI visited Singapore and decided to give the one to one 3 hour make up lesson a try, I was initially unsure as it is not cheap but I am so glad I did it. Before my lesson I used to somewhat dread wearing make up as it didn't look great and I didn't know what I was doing, after this lesson I have worn make up almost everyday as I find it so much fun, I genuinely look forward to occassions where I can put it on.\n\nFurther reasons why this was so helpful are below:\n- I had no idea which products to use and which products are good, the products Roseanne used are great, normally priced and all available from Sephora, even from London, making it very accessible.\n- the key to me is that I have literally no idea what colours I should be using for foundation, contour and blush. This is incredibly difficult to get right. Having a professional make up artist look at you and put the colours in front of you saves you so much time and money. I didn't like trying colours in store and I also wasn't sure what the 'right' colour was. This alone will save you so much time and money.\n- This is such a worthwhile investment as it is something you can practice every day or a few times a week which means you'll only get better. I was doing some things completely wrong for years as I once read it in a magazine or saw a reel that doesn't work for me.\n- The colours pretty much are likely to stay the same for the rest of your life which alone saves you so much time. Especially for busy professional women who really don't have the time to deep dive into colours, products make up theory.\n- The lesson was so much fun, I took so many notes and photos, Roseanne followed up with a big list of products used and the method.\n- It was completely tailored to what I wanted. I thought that may not quite be the case despite it being on the description but Roseanne helped me with exactly what I wanted and in a very structed intelligent way. We were able to work through my 3 looks.\n- Roseanne does not push any products or services on you, she literally teaches you and it is very chill, she actually tries very much to help you use your exisiting make up. She is very honest.\n- Roseanne really got the right level for me, she didn't make it super complicated or detailed or overly focus on one part, she really went through skin, eyes lips all at the right level.\n- I really couldn't recommend this enough, if I lived in Singapore I'd be back as I enjoyed it so much and would have loved to have done the hair style lesson and regret not booking that one in.\n\nThank you Roseanne!",
      "time": 1746173537,
      "translated": false
    },
    {
      "author_name": "Nadia",
      "author_url": "https://www.google.com/maps/contrib/110923531322926748467/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJOOqhlvutXj9f5RaCul2aqe4SK9UKOnQqwbalDylG5QpDwhw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "I'll just summarise here why you would consider the Artist Course from Bloom PRO:\n1. It's beginner friendly. You literally just have to turn up for the classes - everything else is provided. Especially for model - because it is such a hassle to find a model on your own for every class. Also, it would cost a lot more if you have to buy all the make up needed.\n2. It's a good opportunity to explore make up from different brands. The tools and make up provided are brands from Sephora/Watsons/Guardian - basically good quality materials provided.\n3. Flexibility - schedule are planned based on availability of both Roseanne and the student rather than a fixed plan. Roseanne also updated/refined her teaching based on trends/the skills or style of the student.\n4. It's a good price for a one to one course - there's trial courses before spending so much money and realise that you don't like it. Also, centralised location which make travelling more convenient.\n\nLastly, special thanks to Roseanne being accomodating and encouraging through out the whole course. She's reassuring when things are done correctly and strict when there's a need for adjusment/improvement. Overall, it's a pleasant experience and defintely highly recommended course to start your journey as bridal MUA.",
      "time": 1645373470,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15914906836112007996",
  "user_ratings_total": 121,
  "vicinity": "450 North Bridge Road, #05 01, Singapore"
}