{
  "formatted_address": "8 Jln Limau Purut, Singapore 468182",
  "geometry": {
    "location": {
      "lat": 1.3226458,
      "lng": 103.9465536
    },
    "viewport": {
      "northeast": {
        "lat": 1.324084530291502,
        "lng": 103.9478688302915
      },
      "southwest": {
        "lat": 1.321386569708498,
        "lng": 103.9451708697085
      }
    }
  },
  "name": "Blossom Creative Centre (Bedok) | Preschool & Childcare",
  "place_id": "ChIJMfkSTcwi2jERljVBbx7KyeM",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Shabnam Gany",
      "author_url": "https://www.google.com/maps/contrib/106592728199694374233/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKIBoRzr2TbyD2AhbP-oJZQkof7eLU_7cdTNoBgQraUcOAuRQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "We've been a part of the Blossom Creative Centre family for nearly five years, and I couldn't be happier with our experience! The preschool provides an amazing, homely environment that makes both children and parents feel at ease. The teachers are incredibly caring and dedicated, always going the extra mile to ensure each child feels valued and supported. Hygiene and child safety are top priorities here, which is something we truly appreciate. The friendly staff not only take excellent care of the children but also promote good values, helping them grow into kind and thoughtful individuals. I highly recommend Blossom Creative Centre to any parent looking for a nurturing and safe place for their child.",
      "time": 1724636251,
      "translated": false
    },
    {
      "author_name": "Didier Vermeiren",
      "author_url": "https://www.google.com/maps/contrib/105494644171885072651/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV9UWMWDXF3zNjNY6-ihP-XQkoZFdHArYWoC2sQ9BUnKmR36oY7=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Knowing that finding a good school for early childhood development is an important decision a parent has to make, I praise myself lucky to have found Blossom Creative Centre. In all my interactions with the management and the teachers, they have been very friendly, supportive, responsive and professional, but foremost my children's learning curiosity is constantly being sparked, and they love to go to school every single day.",
      "time": 1625462044,
      "translated": false
    },
    {
      "author_name": "Candy Chua",
      "author_url": "https://www.google.com/maps/contrib/117113913661081243797/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXuB22HcdZpTlrzo0huHyXHktk9WDa4BZfNswMDWwFDopGYJ0o=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Grateful to have found this school!!\nSince 2018, I have sent my first born to this school; Management, teachers and staff are kind, dutiful, extremely responsive, engages 2 ways communication pro-actively with parents and amazing when coaching my children with life skills; toilet training, dental hygiene etc.\n\nWhen we moved house in 2019, due to the distance we changed to a school closer to our new place and boy, did we regret! Within 1 month, despite the distance, we’ve sent my first born and now even my second born to Blossom creative centre @ bedok! 4 years now… both my kids are enjoying their time at blossom!\n\nI highly recommend this school who takes parents’ feedback seriously and plays an active role to engage parents. As such, I feel assured and focus at work knowing that my kids are in good hands. Thank you Management and staff of Blossom!",
      "time": 1625458332,
      "translated": false
    },
    {
      "author_name": "Lynn Ong",
      "author_url": "https://www.google.com/maps/contrib/117295235001321629587/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL-b4Ok4819pVRbwX9TwDet97_4xnef1pn7bPAOU2UFEvbQ2w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "My eldest graduated half a year ago and my youngest is still with Blossom. They enjoy Blossom tremendously. I love fetching them from Blossom, listening to them chat about what they learn and enjoy in school.\nMy eldest really struggled with phonics in her kindy years and her form teacher worked closely with me to support her in grasping reading. She was aware of my eldest’s introverted personality and took into consideration of that while teaching her. My girl breezed through reading by graduation. Blossom is also aware of the struggle parents have with Chinese language and has done up a solid curriculum to help children transit to P1 Chinese well. My eldest still enjoys singing with her younger sister of the Chinese songs and poems her blossom teachers have taught her. Blossom teachers really make learning fun for them!\nAcademic aside, the thing that really stands out for me for Blossom is the teachers. They are warm and caring and are often able to quickly give feedback on my children whether it is during PTM or casual chatting during pick up, which reflect their understanding and love for my children. My younger girl is a slow eater and gets stressed when her peers finish before her. She would tell me how her teacher assures and comforts her during meal time. This was also communicated to me by the teachers. This is but one of the many examples of the care the teachers take in my children.\nI highly recommend this school to anyone who appreciate a well thought-out curriculum and management and teachers who are always ready to listen and work with parents.",
      "time": 1625556969,
      "translated": false
    },
    {
      "author_name": "Jevon Peh",
      "author_url": "https://www.google.com/maps/contrib/112970321794807004254/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIoY5b3jsuqoqu-L3QFCqOr4OywhWWALQGm9qek6bdP48vgCw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "We just had the K2 graduation.  Before my thankfulness fades..\n\nThank you teachers n aunties for all your love n patience for these kiddos.. my boy has indeed blossomed in the short 1yr 9mths he's there.\n\nNot a single complaint during ptm.. tho I know my boy is bit of a tough cookie.. and whenever I feedback about any negative emotions my boy had abt school,  teacher wei en n Qi laoshi will always take time to observe n guide him/ class along.\n\nThank you all, teachers n aunties of BLOSSOM creative .. it takes a village to raise a child.. and BLOSSOM creative has been that village for me..\n\nMy boy joined early K1.. had lots of complaint from previous childcare teacher n principal.\n\nOne negative is I felt the hfmd cases is bit too much.. but it could be after effect of CoV .. just put in additional UV sanitising etc..",
      "time": 1702099111,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16413872548992857494",
  "user_ratings_total": 12,
  "vicinity": "8 Jalan Limau Purut"
}