{
  "formatted_address": "97 E Coast Rd, Singapore 428794",
  "geometry": {
    "location": {
      "lat": 1.3056658,
      "lng": 103.9041394
    },
    "viewport": {
      "northeast": {
        "lat": 1.306945480291502,
        "lng": 103.9055326302915
      },
      "southwest": {
        "lat": 1.304247519708498,
        "lng": 103.9028346697085
      }
    }
  },
  "name": "BOMBAY GARDEN",
  "place_id": "ChIJVSfKfosb2jER24ku7qSgm44",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Raaina Bindal",
      "author_url": "https://www.google.com/maps/contrib/113887462599188276716/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWcnZ4f9CB5d32Lj-stJV-oILBNLqHGutGPUPqSCakRxhTAOixRGg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Bombay Gardens is a true gem for food lovers! From the moment you step in, the warm and welcoming staff make you feel right at home. The ambiance is vibrant, with a fantastic live band that enhances the dining experience, creating the perfect blend of music and delicious food.\nThe menu is a delightful mix of vegetarian and non-vegetarian dishes.\nWhether you're looking for a cozy dinner, a lively evening with friends, or a special celebration, Bombay Gardens is the place to be. Highly recommended for its delicious food, amazing live music, and exceptional hospitality!",
      "time": 1739090686,
      "translated": false
    },
    {
      "author_name": "Siddhi Jain",
      "author_url": "https://www.google.com/maps/contrib/101857993673172536754/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLbrBKXLlp9Tm3uIWNEIZMgM-lWF8Yo5NTWddT9Xvr3kaUVDw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "If you’re looking for a place with delicious Indian cuisine, a warm ambiance, and top-notch hospitality, Bombay Garden at East Coast, Singapore, is the perfect choice!\n\nWe recently celebrated a friend’s birthday here, and it was an unforgettable experience. The restaurant was incredibly accommodating, allowing us to stay till midnight to cut the cake, which made the celebration even more special.\n\nThe food was simply outstanding—authentic, flavorful, and perfectly cooked. Every dish was a delight, making it a true feast for the senses. The service was impeccable, with friendly and attentive staff ensuring that we had a fantastic time.\n\nA special mention to Mr. Deepak, the owner, who is an extremely kind and hospitable person. He personally attended to us, making sure we were comfortable and well taken care of. His warm approach truly enhanced our dining experience.\n\nThe cozy ambiance and live singing added a wonderful charm to the evening, making it an ideal place for celebrations or just a great meal with loved ones.\n\nHighly recommended! We’ll definitely be visiting again soon.",
      "time": 1739091375,
      "translated": false
    },
    {
      "author_name": "Shubhi's dance Academy",
      "author_url": "https://www.google.com/maps/contrib/114805472930657618295/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXqs4HMJ-K6vBz8Jik5spM2VRVftkmrUinIEnr5fTH34SnEmuk4=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I celebrated my birthday at Bombay Cafe, and it was an amazing experience! The highlight of the evening was the live music on the upper floor, which made the celebration even more special. We were lucky to have Sakshat, a talented singer from Mumbai, whose soulful voice won our hearts. A special mention to the Malaysian artist who sang a few Hindi songs beautifully—truly commendable!\n\nThe food portions were generous, and the flavors were spot on. The staff was extremely friendly, ensuring a smooth and enjoyable experience. A big thank you to the owner for the warm welcome and for making my day extra special.\n\nIf you’re looking for great food, a lively ambiance, and soulful music, Bombay Cafe is the place to be! Highly recommended!",
      "time": 1739016252,
      "translated": false
    },
    {
      "author_name": "Shilpa Kamath",
      "author_url": "https://www.google.com/maps/contrib/103726721906899417287/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVWwqBzzUnlLixylDy3wOlAP6TePQGrG5DZ92OmG_QFeub7_cJG=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Amazing Indian restaurant in the heart of Katong area opposite the Indigo hotel.\nVery warm staff and owner.\nLoved the food, music and hospitality.\nMust visit when in Singapore.",
      "time": 1743132652,
      "translated": false
    },
    {
      "author_name": "Amarjeet S",
      "author_url": "https://www.google.com/maps/contrib/108988038506899019971/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX4agNl1j8bcYbPog6WzQeKW_oJ9Dkht2FnPcvWT2AbhFVo6UzgiQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "We had the pleasure of dining at Bombay Gardens for our family lunch which was organised on the Christmas eve and I must say, it exceeded all my expectations! The moment we stepped in, we were greeted with warm smiles and welcoming hospitality. The culinary experience was top-notch! The flavors were rich, and the presentation was impressive. The chef's attention to detail was evident in every bite. Special applaud to the girls serving on table. They were attentive, knowledgeable, and friendly. The ambiance was cozy and intimate, with a warm atmosphere that made us feel right at home. The staff were courteous and accommodating, making sure we had everything we needed.The live music was the cherry on top! The talented musician's soulful melodies added to the restaurant's charm, creating a truly unforgettable experience. Overall, Bombay Gardens is a must-visit for anyone looking for exceptional food, outstanding service, and a warm atmosphere. We can't wait to come back. Special thanks to the owner of the place, he is truly a gem person and deliver what he promises. Will we return? Absolutely",
      "time": 1736085305,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "bar",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10275983605007026651",
  "user_ratings_total": 160,
  "vicinity": "97 East Coast Road"
}