{
  "formatted_address": "1 Commonwealth Ln, #04-12/13 One Commonwealth, Singapore 149544",
  "geometry": {
    "location": {
      "lat": 1.3044917,
      "lng": 103.7967223
    },
    "viewport": {
      "northeast": {
        "lat": 1.305763330291502,
        "lng": 103.7980176302915
      },
      "southwest": {
        "lat": 1.303065369708498,
        "lng": 103.7953196697085
      }
    }
  },
  "name": "Bonfield Private Limited",
  "place_id": "ChIJbaUag0ca2jERonrbLi8FLWQ",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Sai Pillay",
      "author_url": "https://www.google.com/maps/contrib/111416252231118705724/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVrwli26fzAGY65DrD2QK5wGF5ZyvWSy7uC1L59Khxj0HHm6Nds=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Had my watch assessed by watch master Eric, extremely knowledgeable and helpful. Removed links from my ceramic J12 as well. Highly recommend their service.",
      "time": 1645158711,
      "translated": false
    },
    {
      "author_name": "Ken Lian",
      "author_url": "https://www.google.com/maps/contrib/103572206917788091942/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL1bPWHaaV5shtMjKBWNdbtFRMYPO-h8aQ7WrIcaR1rCDnnMA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "They quoted me a very high price to repair a Watch. Then, the watch was not working soon after, I went back and they repaired it. After a few months, it was not working again. Then they said this watch should be changed. I went to the authorised centre service (Hour glass) and got it repaired with 20% of the price. Never went near this shop since.",
      "time": 1707296697,
      "translated": false
    },
    {
      "author_name": "Eiy Sha",
      "author_url": "https://www.google.com/maps/contrib/110484003363696314471/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKuIeXfB6gKU7UgzfB3Z13SMy6ZoI0tHYiA3IUK1nazLX-OkA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "the best and nice stuff. . . good seller, friendly watch with very good quality recommend👍👍👍👍",
      "time": 1675765650,
      "translated": false
    },
    {
      "author_name": "Caroline C",
      "author_url": "https://www.google.com/maps/contrib/115648722058416063184/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUDK_2sul8LW9mq894FhO0WpPAp_QVx-0enQsDirLhyRg3QmYR-=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "Disappointing service. Went over to Bonfield to see if they could help me with a battery replacement for my watch as it didn't look like I could DIY it myself. Upon entering the shop, the sales gave a pretty unwelcoming reply after enquiring for help, but eventually I gave in as my choices were limited.\n\nAfter changing the battery, the first thing I noticed were the number of new scratches at the back of the watch, which was very obviously avoided by the staff after seeing my reaction. The staff then quickly brought up a new problem- she asked if my watch face was already tilted, and to my dismay the tilt was obviously not supposed to be there in the first place. They offered to take a look at the watch again to see the issue, so I left my watch there to come back and collect the next day.\n\nI came back today to collect my watch, hoping that all is good as new (except the scratches), but was disappointed to find out that the bigger problem still persists. The watch face even seemed to be even looser than yesterday, and there was a sizable gap in between the glass and watch face. I was then told that if I were to wear the watch tightly against my skin, the watch will not rotate as badly- mentioning this very casually as if to completely evade the problem they inflicted on the watch.\n\nI felt hopeless at this point, whatever I tried to bring up was being avoided and also highlighted that 'this is just a battery replacement service, and mechanics are not covered'. I decided to pay the $25 battery replacement service and walk out to lose this battle. Thankfully, my watch is an inexpensive everyday pair. I cannot imagine how heart broken I would be if I brought a priced luxury pair here for repair or maintenance, to get such treatment and service.",
      "time": 1676446877,
      "translated": false
    },
    {
      "author_name": "Shawn Yang",
      "author_url": "https://www.google.com/maps/contrib/111147105169339084738/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLt-CPZ7ix5mjPIGoS5ZfCU_dgCgB6sqZUeCja4QrVpOQXmww=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "Went to this place awhile back, all seemed pleasant at first. but once u decide not to proceed with the repairs after receive a too high quotation, 180 degree turn. Arrogant and dismissive attitude and badmouthing other repair shops. I ended up going elsewhere for 1/3 the price at a v reputable service centre. It seems to me they have bought some 5 star reviews a month back (the funniest is 2 reviews with exact same comment buying watch for their mum but both reviewers are of different race.. haha) to boost their overall rating. Was not intending to review them but i hope that this will allow potential customers to make a more informed decision.",
      "time": 1680252485,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7218431477952510626",
  "user_ratings_total": 102,
  "vicinity": "1 Commonwealth Lane, #04-12/13 One Commonwealth, Singapore"
}