{
  "formatted_address": "2 Pandan Cres, Singapore 128462",
  "geometry": {
    "location": {
      "lat": 1.3026416,
      "lng": 103.7612915
    },
    "viewport": {
      "northeast": {
        "lat": 1.303781780291502,
        "lng": 103.7627211802915
      },
      "southwest": {
        "lat": 1.301083819708498,
        "lng": 103.7600232197085
      }
    }
  },
  "name": "Borneo Motors New Vehicle Delivery Centre",
  "place_id": "ChIJ1fanHeMa2jERutqmWNkn7Ag",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Rambutan FAVOURITE",
      "author_url": "https://www.google.com/maps/contrib/101209633545677267290/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVWw4UiY03l-XGGQ1RMeUYKVPg24uJnkmNVXghg9SuFFbTIVn36wA=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "Visited borneo motor at pandan cresent. Understand my car engine had been replaced and is waiting for paper work to be sent to vicom for inspection before it can be release to me. I question the service adviser. He told me by this week should be ready. This morning borneo workshop call me saying tgey ate still not sure when the car can be ready. I told her I saw the car parked in a corner collecting dust. They should quickly fo the paper work and sent for inspection. I can only suspected they delayed the handover deliberately becos I post too many negatives feedback on their inefficiencies and unable to resolve my car problems. It's been 2 months already and now I am still awaiting. Today already another 3rd week rectify the engine problem. Engine ordered n received and installed. Tested and now they told me can be another week but not confirm.  Lets see how long they get paper work done n sent for inspection. Toyota still the best but ground staffs managing the problems need to buckle up.",
      "time": 1744691511,
      "translated": false
    },
    {
      "author_name": "Mandy",
      "author_url": "https://www.google.com/maps/contrib/104001346126126489843/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKhmJe-ShOd6Sg3pTfPK_TPH-7PNgqBJa-b73ZKOCbJhs8L4w=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "7 months ago",
      "text": "Went to repair car over here and my husband forget to take he’s coins container when sending in the car. When we collect the car the money was gone. Really very dishonest. Disappointed.\n\nMy advice better take all your valuable and important things before passing them the car.",
      "time": 1729251062,
      "translated": false
    },
    {
      "author_name": "Hambaly Yusof",
      "author_url": "https://www.google.com/maps/contrib/109319781673254809531/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWRix_VKgUw-iMPOUDppoHMGrfDhsUPPasjMG03lv-775P0jAVU=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Had a pleasant experience when collecting my car. Delivery consultant Haidah did an exellent job in going through all the car details and explaining everything. Overall great service from other staffs also.",
      "time": 1680146676,
      "translated": false
    },
    {
      "author_name": "HONG L T",
      "author_url": "https://www.google.com/maps/contrib/117408007446068704652/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLrwuGsFndNtYuByWIMgzppVVXnOIHt68sOIpFIlv-e5Nzh8w=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "This is an efficient workshop, from leaving your there until picking up the car. Ernesto Ogena, the service engineer, always keep his customer well informed of the car status. He serves with passion on his job. Customer is always well informed the price and to agree before vehicle parts are being changed. No hard selling. I highly recommend Toyota Owners to seek professional view from Borneo Motor whenever they have technical issues with toyota vehicle.",
      "time": 1697537318,
      "translated": false
    },
    {
      "author_name": "inc ben",
      "author_url": "https://www.google.com/maps/contrib/115686890772584978593/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLYTTxWjbmj4zQztfBbZqreAs0K2LtYUduH5ebJfo6mEj44fQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Terrible. I am too trusting with this company. The first time when my car was being towed for 3days, workshop manager said that he would file a claim for me so that I won't have to pay car rental for those 3 days. That was a while back, 3 months ago. He DID NOT FILE THE CLAIM FOR ME. $210. Now my car was in workshop for days, Mei Yen said that she would file a claim for me. This time round it was $500+. Called GRAB but the staff said there were no claims made. You see me being nice, doesn't mean you can suka2. Do your job properly. She also lost my charger. I lost my passport here. She had the audacity to gaslight me with \"Sir who want to steal passport\". How the heck am I supposed to know, if the item is stolen means it's stolen. Very dismissive. No customer service heart. She told me she would try to find and get back to me. Didn't even update me whether she found it or not. Don't know whether she even bothered. Don't let them gaslight you.",
      "time": 1684922274,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=642932661255854778",
  "user_ratings_total": 107,
  "vicinity": "2 Pandan Crescent"
}