{
  "formatted_address": "231 Bain St, Singapore 180231",
  "geometry": {
    "location": {
      "lat": 1.2966145,
      "lng": 103.8540002
    },
    "viewport": {
      "northeast": {
        "lat": 1.297880880291502,
        "lng": 103.8550778302915
      },
      "southwest": {
        "lat": 1.295182919708498,
        "lng": 103.8523798697085
      }
    }
  },
  "name": "Bras Basah Complex",
  "place_id": "ChIJtxaD8KQZ2jERgCmvEt9PdiU",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Buren",
      "author_url": "https://www.google.com/maps/contrib/103975090698079167241/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWAW6S8iH0P3hdkbnNjDwY-1QnTYpxJkwDDT-YDbzHNPYcT3cRF=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "2 weeks ago",
      "text": "It's slightly different now, but it used to be heaven because I love books. There were stores and stores full of books and I could spend hours roaming through them. Now, when everything changes to digital and the interest of book has unfortunately dwindled down,  and some of my favorite shops are gone, I don't visit this place as often.\n\nAt least, it has Art and Friends here, which is probably one of the last interest. There is still a bookstore, but the charm of weird and wonderful collections of books is not as what it used to be.\n\nIt is still charming though, a older style of shopping complex with its unique shop compared to modern malls that populate the rest of Singapore.\n\nCome here by City Hall or Brass Basah MRT. There is motorcycle and car parking as well.",
      "time": 1746432479,
      "translated": false
    },
    {
      "author_name": "The Travel Hunter",
      "author_url": "https://www.google.com/maps/contrib/112702441126152817912/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjViyU8VDQNpC7RWExvw3bruVfyZtmqWkZfXAJrtvXSW4Tm_f8AWGQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "1.\t“A Book Lover’s Paradise!”\nBras Basah Complex is an absolute gem for book lovers! It’s a haven of second-hand bookstores, niche bookshops, and specialty art stores. I always discover hidden treasures and unique titles that you can’t find elsewhere. The retro vibe of the place adds to its charm—perfect for a relaxing afternoon.\n2.\t“Great for Art Supplies and Stationery!”\nThis is my go-to place for all things art and stationery. From professional-grade materials to affordable supplies for hobbyists, Bras Basah Complex has it all. Art Friend is a standout store here, offering a wide variety of products. The staff are knowledgeable and always ready to help.\n3.\t“A Slice of Old-School Singapore!”\nBras Basah Complex offers a nostalgic experience. The mix of independent stores, cozy cafes, and niche shops feels like stepping back in time. It’s a refreshing break from modern malls and a great spot to find unique items and support local businesses.\n4.\t“Perfect for Collectors and Hobbyists!”\nWhether you’re into vintage books, rare comics, or musical instruments, Bras Basah Complex has something for everyone. I’ve found amazing deals on preloved books and vinyl records. The shop owners are friendly and passionate about what they sell.\n5.\t“Hidden Gem for Unique Gifts!”\nIf you’re looking for one-of-a-kind gifts, Bras Basah Complex is the place to visit. From beautifully crafted notebooks to handmade art pieces, there’s something special for everyone. It’s a treasure trove of creativity and culture!",
      "time": 1736665116,
      "translated": false
    },
    {
      "author_name": "Leo Siu",
      "author_url": "https://www.google.com/maps/contrib/106652578780054846077/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIETWKUj1PdykI9cK37qJaYa5bYonA8U7Th-gGqauYThdTx7g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Went there for famous Yu Plus Solution Lab in xhs. Bras Basah Complex is an absolute treasure trove in the heart of Singapore! As a book lover and art enthusiast, I was blown away by the eclectic mix of stores here. From cozy second-hand bookshops filled with rare finds to specialty stores stocking art supplies, stationery, and unique crafts, this place is a paradise for creatives and bibliophiles alike.\n\nThe vibe here is nostalgic and vibrant—imagine rows of stores bursting with colorful art materials, shelves stacked with books in every language, and friendly vendors happy to share recommendations. I stumbled upon a quaint café on the upper floor, perfect for a coffee break between exploring.\n\nWhat makes this complex special is its cultural charm. It’s not just a mall; it’s a community hub where art, literature, and history come alive. Plus, its central location near the Singapore Art Museum and National Museum makes it a must-add to any itinerary.\n\n**Pro tip**: Take your time to explore every nook—hidden gems await! Whether you’re hunting for a vintage novel, stocking up on sketchbooks, or just soaking in the creative energy, Bras Basah Complex won’t disappoint. A definite 5-star experience!",
      "time": 1745163282,
      "translated": false
    },
    {
      "author_name": "Ben Panuts",
      "author_url": "https://www.google.com/maps/contrib/114708667205849300566/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWhCxZ820tD5R-WugqG10gI_rsNlUgSt5lQPAJu0YitxU6BUmREEg=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "It is a center of books and art, surrounded by educational institutions and organizations related to art and design.",
      "time": 1746952702,
      "translated": false
    },
    {
      "author_name": "Justice Okai-Allotey",
      "author_url": "https://www.google.com/maps/contrib/117426043620417923402/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXag34nuDN6ZRvZuOWAJ0kqovwOI33m6wEH9nmuGCBLL66iJhWj-A=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "This was a complex I visited for an event during my time in Singapore. It was a walking distance from my hotel. Was easily accessible and had visible markings and very disability friendly. I found the complex I was visiting easily when I asked the security around.",
      "time": 1736343696,
      "translated": false
    }
  ],
  "types": [
    "shopping_mall",
    "book_store",
    "jewelry_store",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2699432846164961664",
  "user_ratings_total": 7861,
  "vicinity": "231 Bain Street"
}