{
  "formatted_address": "10 Bayfront Ave, B1/01-81 The Shoppes, Marina Bay Sands, Singapore 018956",
  "geometry": {
    "location": {
      "lat": 1.2833468,
      "lng": 103.8584
    },
    "viewport": {
      "northeast": {
        "lat": 1.285086830291502,
        "lng": 103.8613259
      },
      "southwest": {
        "lat": 1.282388869708498,
        "lng": 103.8574247
      }
    }
  },
  "name": "Bread Street Kitchen by Gordon Ramsay",
  "place_id": "ChIJC3BflwUZ2jERgMDIKbg-Aso",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Jeena Mary",
      "author_url": "https://www.google.com/maps/contrib/117481443152865501475/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXd6I-d7StCjc-cCeBktacMSk0TCmxpQrcmKerUf-aMPEaOiwHC=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "It was my first time dining here, I had booked reservation beforehand as well. The moment I was greeted till the end, the service was amazing! Everyone was so friendly and made me feel so welcomed. I ordered the famous Beef Wellington, toffee pudding and a sour whiskey. The vibes were very immaculate and I enjoyed every moment there! The food was delicious, enjoyed every bit of the beef Wellington! Amazing service, thank you! Definitely will be back again.",
      "time": 1747131343,
      "translated": false
    },
    {
      "author_name": "Jason Denison",
      "author_url": "https://www.google.com/maps/contrib/116680624709157646423/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVN9JQImhcmKrJfezWe9lus7yIr8XDdTOamnTVVseIIB9Cc9u1Tcw=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "UPDATE 3-19-25: Took my parents here today, first time they've been to Gordon Ramsay place. The waitress was super rude from the start. We sat there for 30 mins not even water. The bread finally came out but still no water. We ended up walking out, which is such a sad ending. We were super nice and professional and shocked at how we were being treated. We've tried to figure out why she was so rude. Normally we get first class service. I've eaten at Ramsay places all over the world and as an influencer have even had Gordon like my post on instagram. I do not know what happened but it takes a lot for us to walk out. We will never come back to this location.\n\nOriginal Review 3-18-25: This was absolutely amazing. I've been craving a good steak and it was cooked to perfection and seasoned to perfection. Tasted so good. I opted for the cream spinach which was also really good.\n\nThe mocktail ginger Pooh was ok better in Bangkok but still decent.\n\nThe bread was ok not the best, again better in Bangkok. I think Gordon hasn't been here in a while maybe and needs his touch and refreshing 🤷🏻‍♂️\n\nOverall though food is good, decent prices and staff was wonderful. I highly recommend.\n\nLocation is near the Apple store at the bay. It's rest to find and get to. I recommenda reservation at night especially.\n\nYou can't come to a Gordon Ramsay restaurant without getting his awesome Toffee Pudding dessert. It's a requirement 😁 although again it's so much better in Vegas and Bangkok... Not sure what's going on here. Taste burnt and not light and fluffy here in Singapore. See pictures\n\nEnjoy!",
      "time": 1742396066,
      "translated": false
    },
    {
      "author_name": "Passion Fruit",
      "author_url": "https://www.google.com/maps/contrib/109062856401555392866/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJGMUgyJZMvvL-T4qySPkCaLFAJNkmB-Gu8oTozi8-RCfPyqg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "My first time at this place. Tried the tasting menu which consisted of the lychee chicken, beef Wellington, and the famous toffee pudding. My companion ordered the truffle cannelloni and the cream spinach, both of which were pretty good. Overall, all was good although I had expected more from the beef Wellington. The pastry was good along with the mushroom but the beef flavour was a little lacking. Service was warm and welcoming. The place was a little noisy though. Nonetheless I would come back again as I believe the rest of the dishes would be good.",
      "time": 1744388419,
      "translated": false
    },
    {
      "author_name": "aharon einav",
      "author_url": "https://www.google.com/maps/contrib/104899291794113166065/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJNL6DMCy9rkzywNw9_czesTY3GA0yIoVhIcF5IHScHUudDsA=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "in the last week",
      "text": "I visited Bread Street Kitchen by Gordon Ramsay restaurant twice on my visit to Singapore on 12.3.25 20.3.25. On the first visit I ordered the tasting, it was delicious and properly made.\nOn the second visit I ordered fish Fish & Chips was delicious and Roasted Cod This dish can be improved, I expected delicious and better made.\nThe restaurant is very expensive.",
      "time": 1747221485,
      "translated": false
    },
    {
      "author_name": "Yvonne Song",
      "author_url": "https://www.google.com/maps/contrib/114737128515669656450/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIeB3wzk-GypR0__Lx9EOCBC_13XZVR4SFdaEMF1mI64cqUbg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "It was an amazing experience! From the start, the staff was welcoming and professional. The atmosphere was warm, though it got a bit stuffy when crowded (peak period), so we opted for outdoor seating. Special thanks to the manager, Apple, for being incredibly friendly and attentive, making sure we had a great evening. The lamb chops were delicious and a highlight of the meal.\n\nOverall, a fantastic experience, and I’ll definitely return. Highly recommend Bread Street Kitchen for excellent food and service!",
      "time": 1741305730,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14556265906310791296",
  "user_ratings_total": 4359,
  "vicinity": "10 Bayfront Avenue, B1/01-81 The Shoppes, Marina Bay Sands"
}