{
  "formatted_address": "190 Ang Mo Kio Ave 8, #03-02, The Grassroots' Club, Singapore 568046",
  "geometry": {
    "location": {
      "lat": 1.3806484,
      "lng": 103.8465345
    },
    "viewport": {
      "northeast": {
        "lat": 1.381879680291502,
        "lng": 103.8475868302915
      },
      "southwest": {
        "lat": 1.379181719708498,
        "lng": 103.8448888697085
      }
    }
  },
  "name": "Bright Path Inclusive Preschool",
  "place_id": "ChIJwfd1o5UQ2jERFeAod_wRT7Q",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Joyce Ang",
      "author_url": "https://www.google.com/maps/contrib/116473971512079876521/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjViY_6WZhT5Tn7BBPccjQ3MEk8r0J__-DlaIbqkCm4AKtRPa7eP=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "I regret to say that my recent visit to this school did not meet expectations. Unfortunately, there was no feedback provided on the assessment, which, regardless of whether it’s for the school’s reference or not, would have been helpful. Feedback is a valuable tool for parents in guiding their children’s education, and the absence of it leaves the impression that the school may not prioritize this important aspect.\n\nAdditionally, the center director seemed more focused on asking if we had any questions rather than offering insight into what the school has to offer, which felt a bit disengaging. Visually, the school also appeared somewhat unkempt, which is concerning when considering the overall environment for children. I believe there is room for improvement in these areas to provide a more welcoming and informative experience.",
      "time": 1744088864,
      "translated": false
    },
    {
      "author_name": "Rina Adam",
      "author_url": "https://www.google.com/maps/contrib/102146726363586293591/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWsfrZChS3PSweQlBSycfp_4DCjKkLSNZwFkmwMQLKUcGRN-kpBSA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "The principal and teachers are very friendly and attentive towards my child. I have seen a lot of difference since he started at Bright Path.",
      "time": 1730863878,
      "translated": false
    },
    {
      "author_name": "Juffrey",
      "author_url": "https://www.google.com/maps/contrib/106747231694663034308/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUoloh0cvx4SWg7EwAmFl2hLAKNxzDTdu2dMXZN7PZWJYBnNFYe6A=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "Visited the centre and  it was such a delight to be greeted by the friendly centre principal Ms IQ who brought us around for a centre tour. She shared with us on the curriculum and also the early intervention programmes that they offer, to children with special needs. Besides the lovely and conducive environment, the staff are all smiles and professional at handling the children. I love the sensory pathway, with the different types of textures and the spacious outdoor area. Classrooms were well lit up and many were materials seen. Love the idea of the low teacher child ratio and they cater to mainstream children. The distance would be a problem if you are not driving especially coming from the East. Overall, a pleasant tour and all the best!",
      "time": 1587032198,
      "translated": false
    },
    {
      "author_name": "ninarizzzl",
      "author_url": "https://www.google.com/maps/contrib/116653316708716061639/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLR3iA1mTwKp8t4YdN4yrQnpwS2Jqac3-A-9ez6mLLZaF7iPQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "I recently had a visit to the school. It has a spacious and lovely outdoor compound, complete with a garden and a playground for the children. With the environmental settings around the school, it makes for a very conducive learning environment. I also noticed how well-kept the centre was and how the children could explore the outdoors and indoors safely. The educators and other staff were also very helpful and friendly. Overall, it was a very nice preschool to visit!",
      "time": 1583214648,
      "translated": false
    },
    {
      "author_name": "Beverly",
      "author_url": "https://www.google.com/maps/contrib/112395411403891024513/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIhCq2XnJHopybD3-w0HvIyUllxnC6P3hKgsy2i5aXLlNUxIg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "Our son Daniel,4.5  years old, enrolled in Bright Path Preschool in January 2020. After 3 months, we observed the following improvements in Daniel:\n1. Able to  establish eye-contact when we speak to him\n2. Able to understand and follow instructions\n3. Able to express himself with more words (now we understand his needs better)\n4. Able to ask help (once he dropped an egg and he immediately shouted \"Help!Help!\")\n\nWith the recent  home-based learning, we noticed that Daniel shows interest in learning and is able to concentrate on the task. Upon completion of his works, he will \"proudly\" show us.\n\nWe are very pleased to see Daniel's improvement and we look forward to seeing more progress. We are grateful and like to thank the Principal, Ms Iqlimah, Daniel's Teachers and Therapists as well as all the support staff at Bright Path Preschool for their constant care for Daniel.",
      "time": 1587025382,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12992623226015768597",
  "user_ratings_total": 12,
  "vicinity": "190 Ang Mo Kio Avenue 8, #03-02, The Grassroots' Club"
}