{
  "formatted_address": "764 Mountbatten Rd, Singapore 437764",
  "geometry": {
    "location": {
      "lat": 1.3000756,
      "lng": 103.892544
    },
    "viewport": {
      "northeast": {
        "lat": 1.301638280291502,
        "lng": 103.8938244302915
      },
      "southwest": {
        "lat": 1.298940319708498,
        "lng": 103.8911264697085
      }
    }
  },
  "name": "Brighton Montessori Mountbatten",
  "place_id": "ChIJ274WNWgY2jER0iQuYhIlnSA",
  "rating": 4,
  "reviews": [
    {
      "author_name": "ayaan sameer",
      "author_url": "https://www.google.com/maps/contrib/112820420964688058765/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWYtHEDK7bD_nB2Fio8Xsd7wCZHWR_CecmzF1ucYleNBIJL5zI6=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "As a parent deeply invested in providing a holistic and enriching educational experience for my child, enrolling them in a Montessori school has been a game-changer. The Montessori philosophy is not just a method of education; it's a transformative journey that fosters independence, creativity, and a love for learning.\n\nOne of the standout features of our Montessori experience is the child-centric approach that permeates every aspect of the curriculum. The classrooms are carefully designed to stimulate curiosity and exploration. The materials used are not just tools for learning; they are gateways to discovery. Watching my child engage with the carefully crafted Montessori materials, I can see the joy and enthusiasm that comes with hands-on learning.\n\nThe teachers at our Montessori school play a pivotal role in creating a nurturing environment. They act as guides, fostering a sense of responsibility and self-discipline. The emphasis on respecting each child's pace of development has allowed my child to progress at their own speed, building a strong foundation for future academic success.\n\nWhat sets Montessori apart is the emphasis on practical life skills. From pouring their own juice to cleaning up after themselves, children are encouraged to take ownership of their actions. This not only instills a sense of responsibility but also enhances fine and gross motor skills. Witnessing my child confidently tackle daily tasks has been immensely rewarding.\n\nThe community aspect of Montessori education cannot be understated. The mixed-age classrooms encourage collaboration and mentorship among students. Younger children learn from their older peers, while the older ones reinforce their understanding by teaching. This dynamic fosters a sense of community and creates a supportive learning environment.\n\nCommunication between parents and teachers is open and transparent. Regular parent-teacher meetings provide insights into our child's progress, allowing us to actively participate in their educational journey. The Montessori school doesn't just educate children; it educates parents, creating a partnership that enhances the overall learning experience.\n\nIn conclusion, our Montessori experience has been nothing short of exceptional. It goes beyond traditional education, nurturing the whole child – mind, body, and spirit. The emphasis on independence, hands-on learning, and community engagement sets Montessori apart as a beacon of educational excellence. If you're seeking an educational journey that inspires a love for learning and prepares your child for a lifetime of success, a Montessori education is undoubtedly worth considering.",
      "time": 1701662952,
      "translated": false
    },
    {
      "author_name": "Mehak",
      "author_url": "https://www.google.com/maps/contrib/100983786050330404187/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVcgnrY8XDiwEQRmzBvQ_Ga6TdebmoAAWbWFD0otdMqrLc4bw3y=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Both my children have been blessed to have studied at Brighton Montessori. The teachers have been amazing and I always felt that the staff goes an extra mile to contribute to overall development of the child, mentally, physically and emotionally. Special shout out to Ms. Audrea, Ms. Yatea and Ms. Fai! We all love you",
      "time": 1689131420,
      "translated": false
    },
    {
      "author_name": "jeinyoon",
      "author_url": "https://www.google.com/maps/contrib/111445400479559251170/reviews",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW1l1KtNxZIZJAvXR6L6bYwQrkyF15ENooMm62hG9DdEKUlpb0=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "",
      "time": 1727847457,
      "translated": false
    },
    {
      "author_name": "Rain Lu",
      "author_url": "https://www.google.com/maps/contrib/103442385811475215387/reviews",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVN01jSGs_ZxTf-qRatPm5KN-xlcluLgWDLWfAZ2gkVbFn6TYMK=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "",
      "time": 1715736738,
      "translated": false
    },
    {
      "author_name": "michael",
      "author_url": "https://www.google.com/maps/contrib/100185383100775398029/reviews",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWTugsCo3MqA2Zbw901HEiOHeQUICdjLcvNGD7BXdO1qpjex46l=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "",
      "time": 1706074201,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2350075341444097234",
  "user_ratings_total": 9,
  "vicinity": "764 Mountbatten Road"
}