{
  "formatted_address": "1 Hillview Rise, #01-02, Singapore 667970",
  "geometry": {
    "location": {
      "lat": 1.3621008,
      "lng": 103.7644225
    },
    "viewport": {
      "northeast": {
        "lat": 1.363400930291502,
        "lng": 103.7658416802915
      },
      "southwest": {
        "lat": 1.360702969708498,
        "lng": 103.7631437197085
      }
    }
  },
  "name": "Brighton Montessori Hillview",
  "place_id": "ChIJAem0sTgR2jERFRsl0jTRBx0",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Mel G",
      "author_url": "https://www.google.com/maps/contrib/116473367637375494194/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKa5g-MPjkwY8rRKGMjKNYYodlp0lUZLntpxiZOMC4x13mAeylz=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Our 2 boys (PN & K2) transferred to Brighton Montessori @ Hillview in December 2024, and we couldn't be more pleased with our choice.\n\nThe transition process, which often concerns parents, was handled expertly by the Brighton team. Both our boys adapted remarkably well to their new environment, a testament to the staff's warmth and experience in welcoming new students.\n\nThe school's physical environment is spacious and bright, with well-thought-out learning areas, clean and organised spaces, and purpose-designed activity zones.\n\nWhat truly sets Brighton Montessori apart is their outstanding teaching team. Their loving and accommodating nature provides great reassurance to working parents like us. The teachers demonstrate genuine care and attention to each child's unique needs.\n\nCommunication with the team has been excellent, including comprehensive weekly updates, regular photo sharing through their app, parent-teacher meetings, and quick and helpful responses to our queries.\n\nThe curriculum weaves together structured learning and play-based activities, staying true to Montessori principles while incorporating creative and engaging elements. Educational experiences are thoughtfully planned and tailored to each child’s developmental stage.\n\nThe teachers' dedication is evident in the effort they put into creating engaging activities, which we can see through frequent app updates. Their commitment to documenting our children's learning journey helps us feel connected to their daily experiences.\n\nWe are incredibly thankful to have found Brighton Montessori @ Hillview. The warm, nurturing environment combined with their strong educational approach continues to exceed our expectations. We look forward to watching our boys grow and develop under the care of this dedicated team!",
      "time": 1743561913,
      "translated": false
    },
    {
      "author_name": "龄之之之",
      "author_url": "https://www.google.com/maps/contrib/110879399952721658322/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVZPWkKUKv8IFsbxj_4HGx9CIOBXghstCzyVibxMEVlXyzQ4v-M=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Brighton Montessori has been an amazing experience for our family! My daughter started here at 18 months, and she has truly thrived. The teachers are incredibly caring and attentive, always creating a warm and nurturing environment for the little ones.\n\nThe Montessori approach has helped her develop independence and a genuine love for learning. It’s heartwarming to see her come home excited about the activities and eager to share what she’s learned.\n\nThe location at Hillview Community Club is fantastic, with the added bonus of a lovely playground on Level 4 that my daughter absolutely loves. It’s a great space for kids to explore and play safely.\n\nWe’re so grateful to have found such a wonderful preschool that truly feels like a second home for our daughter. Highly recommend Brighton Montessori to any parents looking for a loving and supportive start to their child’s education!",
      "time": 1733228107,
      "translated": false
    },
    {
      "author_name": "David Toh",
      "author_url": "https://www.google.com/maps/contrib/108962651477387088817/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLz6Ohy0fVfdBi597XQoWIlJaajmW8lCDH9Eh1kpaKNlpFIcg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Our son has been attending Brighton Montessori @ Hillview since he was 18 months old, and we've been consistently impressed with the nurturing and supportive environment the teachers provide. They are patient, and genuinely care about the children's development. We've noticed significant improvements in his social skills and independence. The curriculum is engaging, and the learning materials encourage curiosity. Overall, we feel confident that he's in a safe and enriching place. Highly recommended!",
      "time": 1729349868,
      "translated": false
    },
    {
      "author_name": "Su Vien Tan",
      "author_url": "https://www.google.com/maps/contrib/111467406935566391967/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI1AYn0cGNst0Y3j83Qh_DwlgKuWTVt830XzRoIo7-i40dSCA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Miss Das is an extremely nurturing, kind and patience teacher. Our son has thrived under her care in N1 and he enjoys going to school everyday. She is very observant towards my son’s needs and has given us great insights to his learning style and preferences. We are incredibly grateful for Brighton Montessori’s care and love towards our son, especially the dedication of the N1 teachers Miss Das, Miss Jeslin, Miss Jesmin and Kexin Laoshi! Thank you so much teachers",
      "time": 1741270383,
      "translated": false
    },
    {
      "author_name": "Pamela Lim",
      "author_url": "https://www.google.com/maps/contrib/117554170517441214813/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLs6LxON9VPms9NyT2JpoOrVNuqOhAu3TZWfHEL3wq7EkygoQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "We made the decision to send our child to Brighton Montessori (Hillview), after visiting a couple other schools. The teachers are great - Ms Sze Ing, Zhai Laoshi (PN) and Ms Dassini, Kexin Laoshi (N1). Our son loves them and always shares about how school was.",
      "time": 1741963641,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2091870576731036437",
  "user_ratings_total": 17,
  "vicinity": "1 Hillview Rise, #01-02"
}