{
  "formatted_address": "Blk 764 Pasir Ris Street 71, #01-246, Singapore 510764",
  "geometry": {
    "location": {
      "lat": 1.376379,
      "lng": 103.9342209
    },
    "viewport": {
      "northeast": {
        "lat": 1.377770080291502,
        "lng": 103.9356118802915
      },
      "southwest": {
        "lat": 1.375072119708498,
        "lng": 103.9329139197085
      }
    }
  },
  "name": "Bright Kids @ Pasir Ris",
  "place_id": "ChIJmxKO9pY92jERSh39aTpWR2w",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Anis Sakinah",
      "author_url": "https://www.google.com/maps/contrib/117081791672281008459/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX1EzlCbDCJEZIv31BBEM_A6oigWqFXHGy_EvdwRKFJ3B_8mnNg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "Disappointing Experience with Lack of Specialized Support\n\nWe had a very disappointing experience with Bright Kids @ Pasir Ris. Our child has been schooling there since she was 18 months old and is now 3 years old. However, in December 2024, we were informed that she would need to withdraw, with her last day set for the end of March 2025.\n\nThis unexpected decision, after so many years at the center, gave us limited time to make alternative arrangements, causing unnecessary stress. Clear and timely communication should have been provided much earlier to avoid such an inconvenience. Parents who require specialized support should be cautious when considering this center.",
      "time": 1738924491,
      "translated": false
    },
    {
      "author_name": "Benjamin Oh",
      "author_url": "https://www.google.com/maps/contrib/103959284516828932259/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKplxhtn2B0TV66YYb8NFsCqatqcBL0WVJJAVUSQWzIvO6_ZA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Great school, my daughter enjoys her classes very much, and very much look forward to going to school. The teachers are dedicated and take the time to let us know what are her strong points and where she needs to brush up on. Love the curriculum as well. Awesome place to send your children!",
      "time": 1688648072,
      "translated": false
    },
    {
      "author_name": "Seri S.",
      "author_url": "https://www.google.com/maps/contrib/107920558589172450137/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVgI9d3pP9zRGchFYePhLYWiCfcGpLua8zFFOnjLCOnvuWLKdns=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My kid loves the school. He is very happy with his teacher. He is well developed being here and his teachers give every attention to his behavioral development. The school teachers are pleasant as well as the principal and the environment is encouraging for learning. I highly recommend the school to any parent that is considering.",
      "time": 1689328114,
      "translated": false
    },
    {
      "author_name": "Fahmi Daini",
      "author_url": "https://www.google.com/maps/contrib/110766941174084452867/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK9DkdUoFQrLuBZjk2zdbQjaXe99c4WWB8Ud_v10FSJ-5Rtug=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I cannot recommend this childcare center enough! From the moment I walked in, I felt the warmth and care from the staff. The facility is clean, safe, and filled with age-appropriate learning materials and toys.\n\nThe caregivers and teachers are exceptional—knowledgeable, patient, and truly invested in the children’s development. I love how they tailor activities to each child’s interests and needs.\n\nCommunication with the center has been outstanding. They keep us informed about our child’s progress, daily activities, and any special events. It’s evident that they value open and transparent communication with parents.\n\nOverall, our experience has been nothing short of wonderful. Our child is thriving here, and we couldn’t be happier with the level of care and education they receive. Choosing this childcare center has been one of the best decisions we’ve made for our child’s early development.",
      "time": 1689853194,
      "translated": false
    },
    {
      "author_name": "Mei Jun low",
      "author_url": "https://www.google.com/maps/contrib/111757478030159737229/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK_690Qsuatxb9gYZdgkoHMa2AR2p9OQ0a11kH6wvmByFJgLA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My child has enrolled into the school since 2019 and she has improved a lot in terms of communication, playing well with other kids and dancing.\nIt was great to see that some teachers had been there for long time, indicating that the working environment is good and good retention by the principal.\nThe school has also been awarded with healthy preschool for their balanced diet meals.\nThe teachers and principal have also maintained good communication with us via the little family room app which keeps us informed and updated of the school events, parental involvement activities and Covid cases updates during the Covid period.\nI will definitely recommend the school to other friends.",
      "time": 1688467112,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7802299688328961354",
  "user_ratings_total": 46,
  "vicinity": "Blk 764 Pasir Ris Street 71, #01-246"
}