{
  "formatted_address": "1 Jurong West Central 2, #02-24/K5 Jurong Point, Singapore 648886",
  "geometry": {
    "location": {
      "lat": 1.3399257,
      "lng": 103.7062886
    },
    "viewport": {
      "northeast": {
        "lat": 1.341495080291502,
        "lng": 103.7076496802915
      },
      "southwest": {
        "lat": 1.338797119708498,
        "lng": 103.7049517197085
      }
    }
  },
  "name": "Brio",
  "place_id": "ChIJxblKLZMP2jERj9R0TfxXNyA",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Irfan Baharudin",
      "author_url": "https://www.google.com/maps/contrib/109184589702713256029/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJnE8BO8S07hd6N05w7gWe8KkjKQNo4uyhH8OttDRcHzJarkA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Brio – A Gem That Keeps Calling Us Back\n\nEvery time we find ourselves in Jurong Point, there's only one place on our minds — Brio. This isn't just a restaurant; it's our go-to comfort spot, our \"must-stop\" destination. With every visit, Brio reminds us why it's always worth coming back — and we do, wholeheartedly.\n\nThe food? Always satisfying. The flavours are bold yet balanced, and the presentation is just the cherry on top. Whether it's a quick bite or a full-on feast, Brio delivers every single time. Their menu strikes the perfect chord between variety and quality — a rare combination that makes each meal memorable.\n\nBut what truly sets Brio apart is the consistent warmth — both in the service and the atmosphere. It's the kind of place that feels like home, but better. You walk in and you're greeted not just with a smile, but with a sense of familiarity and care that’s hard to find.\n\nBrio is always a gem — shining brightly in the heart of Jurong Point. If you're ever in the area, do yourself a favour: go to Brio. And if you're like us, you'll find yourself always coming back.",
      "time": 1746227136,
      "translated": false
    },
    {
      "author_name": "Doris Ang",
      "author_url": "https://www.google.com/maps/contrib/115430332043773943288/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJT87DU97A0OToC2MFH8t_7e5NFi9pimzrZdz63SccpTpjbfg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Have small group dinner. Food is really nice especially the pasta and choc lava cake. Calamari is fresh tender and dip is refreshing. USA Ribeye my first time trying - a bit fatty otherwise it is delicious cos pretty tender. Mushroom sauce is fragrant. Potato puree is very smooth and taste is just right for me. Oh peppermint tea is very fragrant too. Will recommend and come again.",
      "time": 1746029147,
      "translated": false
    },
    {
      "author_name": "BH",
      "author_url": "https://www.google.com/maps/contrib/103525834037477960680/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU68rueJ0CY-EMsppug4HDwgtq_Ms-8GOnD8qzRKVRQ7n0N1OMd=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I came for lunch time on a weekday and the customer service was immediately top-notch. Waiting for food of ",
      "time": 1736475620,
      "translated": false
    },
    {
      "author_name": "Ken Tan",
      "author_url": "https://www.google.com/maps/contrib/100121205735734303463/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXTcQv1vWXTxJuDFx5fWUqmS73amTgtvuHiApLBS-BEB96nAFFs=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "Lunch set comes with either free soup of day or choice of drink.  Chicken and salmon were nicely done seasoned well and not being too dry. Salmon Thai Basil Cream Linguine also tasted delicious with its spicy sour sauce. Salmon was also tender without overly cooked.   Service from staff prompt and great.",
      "time": 1745212438,
      "translated": false
    },
    {
      "author_name": "Rach",
      "author_url": "https://www.google.com/maps/contrib/100368288078910287205/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLCyLjaBJ2Krp5ZkBJFmd9P94xLudV3Bl_Ov-uPfVITnnQG53M=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "4 months ago",
      "text": "Overall food taste: 3.5/5⭐️ Finally dropped by to dine in at this place after seeing some previous good reviews! I had the fish & chips - a menu item I was looking forward to try after coming across those few positive reviews. I liked that the fillets were rather sizeable and nicely deep fried - not too greasy/overdone👍🏻 and fries were crisp and light as well. Salad was quite refreshing too. My order came with tomato soup (of the day) as appetiser, which tasted quite ok though a tad lukewarm.\n\nOnly gripe would be that the fillets tasted extremely healthy and bland - seemingly as if cooked without any seasoning at all. Not a problem for the super health-conscious; I personally would prefer this to it being overly salty/oily, but may not be to the liking of majority.\nMy plate was replaced after the waiter initially served the food though, as he somehow noted that the original fillets served were notably smaller in portion size (than pictured previously) and appeared much oilier to me as well🤔. Kudos to the kind gesture though, much appreciated!💯\nWould probably try the other menu items if I drop by again in future🙂",
      "time": 1735911827,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2321420874075657359",
  "user_ratings_total": 765,
  "vicinity": "1 Jurong West Central 2, #02-24/K5 Jurong Point"
}