{
  "formatted_address": "1 Commonwealth Ln, #08-18 One Commonwealth, Singapore 149544",
  "geometry": {
    "location": {
      "lat": 1.3044917,
      "lng": 103.7967223
    },
    "viewport": {
      "northeast": {
        "lat": 1.305763730291502,
        "lng": 103.7980176302915
      },
      "southwest": {
        "lat": 1.303065769708498,
        "lng": 103.7953196697085
      }
    }
  },
  "name": "BubbleBee Speech Therapy Services",
  "place_id": "ChIJV-4CoowZ2jERxFCEUVaW4fQ",
  "rating": 5,
  "reviews": [
    {
      "author_name": "leng huang",
      "author_url": "https://www.google.com/maps/contrib/101058225314547098392/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK0HY9wIxvh1HloRg0BcL4_MkWnIJdpUC2TMOgJkHCbwscj6g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "We are grateful to have found Agnes! She has been an invaluable partner on our journey to support our son’s communication development.\n\nAgnes is a very experience speech therapist and especially good with young children. Her floor time , play—based / child - led approach is holistic and made sessions fun and engaging for our son. What impressed us most is her ability to connect with our son, making him feel comfortable and confident , which in turn helped him open - up / express himself. Through these sessions, she is able to provide valuable insights to us parents on how best to support and enhance our son’s communication skills.",
      "time": 1725785267,
      "translated": false
    },
    {
      "author_name": "Carmen Tang",
      "author_url": "https://www.google.com/maps/contrib/109540765145367089073/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLea28SBt2b7rfMjf0729tgz16R3lPBQTZXs0FvU4seGcZVkQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "I’m so grateful that we chose Agnes as my son’s speech therapist.  My son has ASD and non-verbal.  Before we started speech therapy, he was lack of playing skills, eye contact, joint attention and many other problems. Agnes mentioned that all of these fundamental skills are crucial in order to build meaningful speech.  After years of consistent training, my son now has shown a significant improvement in engagement, play skills and self- regulation. With all of these in place, my son can now say and copy words that are spoken to him.  My son really enjoyed playing and learning at Agnes’s therapy.  Agnes is very professional, skillful, kind and patient.  The techniques and tips that she has given me were all practical and valuable in order to incorporate the same methods at home.  Overall, I highly recommend Agnes’s speech therapy.  She did an amazing job helping my son to build his speech.",
      "time": 1726715693,
      "translated": false
    },
    {
      "author_name": "Liang Liu",
      "author_url": "https://www.google.com/maps/contrib/116505727421246868130/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIGGruzEUNXeVcQSV06iJNNSg-amy5lvOBmflbpNM_QY9em-A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "My son has been seeing Agnes since 2 years old. I still recall the day that he spoke out load and clear for the 1st in his life in Agnes's therapy. Agnes therapy really helped him expand his interest and improved his ideation, which helped him to express himself much better and build up his confidence. Along the way I also get to know the reason behind certain behavior of my son and am now able to guide him better at home. Really appreciate it!",
      "time": 1724859369,
      "translated": false
    },
    {
      "author_name": "Cuppa Tea",
      "author_url": "https://www.google.com/maps/contrib/113030347283279019463/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJAPXiexwPoE3-PORdJQ_VGw2p_An_3udpJm9t_j1H26ntGew=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Agnes is a very experienced speech therapist.\n\n(1) She has been able to help us understand more about our daughter's condition, and how through play can help her improve her communication.\n\n(2) She has been teaching us parents how to communicate with our daughter. An important factor in communication is not to assume for the child or order the child to do this/that.  This has been a mistake for many parents or even therapists. It is important to listen to the child who would communicate via non verbal cues or verbally.  Let the child lead from there.\n\n(3) She has the ability to understand children and their intentions. This is crucial in building confidence in our daughter since she has little confidence. Once she knows that we are there to try to understand her, she will be more willing to continue to communicate with us.\n\nIt has not been easy for us to find a suitable therapist who could engage our daughter as we have been through a few therapists.\n\nTo all the parents reading this: May you be able to find one who can help you and your child.",
      "time": 1724826935,
      "translated": false
    },
    {
      "author_name": "Chia Ming Lim",
      "author_url": "https://www.google.com/maps/contrib/116961535911811001865/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU-_FrA4TffqvkAzLDb4fffUesRgXBT-3O1ZyfAW3aqQkeN0q-F=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Agnes is a seasoned and dedicated speech therapist who is able to empower parents like us to guide in speech development and see significant breakthroughs in our child's communication skills.",
      "time": 1724832862,
      "translated": false
    }
  ],
  "types": [
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17645550112493293764",
  "user_ratings_total": 7,
  "vicinity": "1 Commonwealth Lane, #08-18 One Commonwealth"
}