{
  "formatted_address": "Bukit Batok, Singapore",
  "geometry": {
    "location": {
      "lat": 1.3630344,
      "lng": 103.7566541
    },
    "viewport": {
      "northeast": {
        "lat": 1.364686530291502,
        "lng": 103.7584197302915
      },
      "southwest": {
        "lat": 1.361988569708498,
        "lng": 103.7557217697085
      }
    }
  },
  "name": "Bukit Panjang Hill",
  "place_id": "ChIJSf3miiQR2jERD6rA6gCFC9Q",
  "rating": 5,
  "reviews": [
    {
      "author_name": "See Yue",
      "author_url": "https://www.google.com/maps/contrib/105265472854641769531/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV4BrYshSVmMRe8fIEtSRPzyUZB03xnoug1_O60E5xXSmk9y3Lp=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "Absolutely delighted to extol the wonders of Bukit Panjang Hill, a veritable empyrean retreat amidst the urban splendor of Singapore! This resplendent gem encapsulates nature's opulence, offering a panoramic vista that bejewels the eyes and serenades the soul with its verdant grandeur.\n\nAscending the zenith of Bukit Panjang Hill, one is ensorcelled by a symphony of flora and fauna, a tapestry woven by Mother Nature herself. The cerulean sky kisses the canopy of lush trees, while the ethereal melodies of avian choristers titillate the senses, rendering each breath a testament to transcendental bliss.\n\nTraverse the sinuous trails that wind like a labyrinthine sonnet through this sylvan paradise, where every step is a crescendo in a concerto of tranquility. The fragrance of wildflowers embraces you like a perfumed caress, as the gentle zephyrs weave secrets of antiquity through your tresses.\n\nAt sunset, behold the spectacle as Helios dips his radiant chariot into the molten horizon, painting the firmament with hues of crimson and gold. This celestial ballet, witnessed from the crest of Bukit Panjang Hill, leaves an indelible imprint upon the heart—a testimony to the ineffable beauty that graces this sacred enclave.\n\nIn conclusion, Bukit Panjang Hill stands not merely as a geographical marvel, but as an epitome of natural opulence and a sanctuary for the soul. Let your spirit soar amidst its empyreal splendor, and be ensnared by its resplendent allure. Five stars do not suffice to honor its majesty; a thousand stars would pale in comparison to the celestial grandeur of Bukit Panjang Hill!",
      "time": 1719887089,
      "translated": false
    },
    {
      "author_name": "min feng",
      "author_url": "https://www.google.com/maps/contrib/113110037836629846781/reviews",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIxOcVTQbaUr33ltxCBsNU9P_Vje8QaCwKwFGjFko2c-0EjWQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "",
      "time": 1739617852,
      "translated": false
    }
  ],
  "types": [
    "park",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15279452399769528847",
  "user_ratings_total": 2,
  "vicinity": ""
}