{
  "formatted_address": "55 Siglap Rd, B1-28 Siglap Centre, Singapore 455871",
  "geometry": {
    "location": {
      "lat": 1.3125941,
      "lng": 103.9231451
    },
    "viewport": {
      "northeast": {
        "lat": 1.314082680291502,
        "lng": 103.9244230302915
      },
      "southwest": {
        "lat": 1.311384719708498,
        "lng": 103.9217250697085
      }
    }
  },
  "name": "Burlinson Dental Surgery",
  "place_id": "ChIJ1VxJiKMi2jERsTOaVoLcxWk",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Pearly Fynn Mh",
      "author_url": "https://www.google.com/maps/contrib/103453598961776297605/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU9rE90sw-S4CWcyNgIxDfvTy17bYyf0p7alKKKQK8nWdDFm6lq=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I been coming to Burlinson for the past 10 year. I love this place. From the front desk to Dr Graeme and his assistants, they are all doing an excellent and great job. They are so gentle and are always be so accommodating to my request. Dr Graeme himself is always so caring with my teeth condition and are so generous with his fees. This is highly recommended dental clinic and I will never want to change my dentist doctor anymore. My crooked teeth now look like a new brand teeth thanks to their braces hehe thanks doctor! 😁😁😁",
      "time": 1735550681,
      "translated": false
    },
    {
      "author_name": "Joanne Lim",
      "author_url": "https://www.google.com/maps/contrib/117688434205269393382/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVEfe1PJoJt6ZzeR3boOfzvxLMckERGqZEcTICPber_FG1rADk=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "If you ask me what’s the key takeaway from my experience with Dr. Chan, this is what I have to say.  Dr. Chan is super gentle when she cleans my teeth.  She’s likely the most gentle dentist I’ve ever seen, but she’s also extremely effective. In previous visits she gave me fluoride treatment and antibiotics for a bacterial infection. She also suggested that I stay hydrated to prevent decay in older teeth. I used to dread dental cleanings until I found Dr. Chan. On her dental chair I get distracted by the likes of Toy Story 4 playing on her office ceiling, right above the chair. Two thumbs up for Dr. Chan and her competent and amicable team!",
      "time": 1740624000,
      "translated": false
    },
    {
      "author_name": "WM W",
      "author_url": "https://www.google.com/maps/contrib/114884463600457708883/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJfF2rk37KYGSfOdZtAE8gz55MwEM2o8BCfcedwQ3-zr_nmUg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I've had very good experiences with Dr Graeme. He is practical, emphatises and get things done, unlike other risk adverse dentists I kept meeting before who would rather leave a tooth with a hole untouched than fill it. He offers his opinions and advices if you are willing to ask, instead of just pros and cons that one can Google or ChatGPT too.",
      "time": 1741160741,
      "translated": false
    },
    {
      "author_name": "Belle Serene Ho",
      "author_url": "https://www.google.com/maps/contrib/101671257871618384121/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXkzR0YxCTm5jZGo5dsCH8UZgmGmtQRgrAdLyXMfXBX3lrl48Os=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I'm very afraid of visiting the dentist so I only go to Dr Graeme. It all started 10 years ago when I emailed many clinics for their price on braces and Dr Graeme was the only one who actually bothered asking me what was the exact issue with my teeth. After understanding that it was teeth gap, he proposed filling instead. From that incident, I knew he is a very kind dr who doesn't put money before patients' needs. That was the day he started to gain my trust and gives me full confidence. Once, I had very severe pain from wisdom tooth yet I could not match his slot the last minute so I had no choice but to visit a dentist in my neighbourhood. That was also the day when I was even more assured that no other drs could be as passionate and kind as Dr Graeme. Today I visited him for Periodontics treatment. He was constantly asking me if I was feeling ok and if I needed a break in-between. He is the best dentist I met. Thank you, Dr Graeme! I'm still very scare of going to dentist but definitely not to Dr Graeme. The one and only dr who makes me feel at ease on the dental chair",
      "time": 1737467932,
      "translated": false
    },
    {
      "author_name": "Hamada Saadon",
      "author_url": "https://www.google.com/maps/contrib/110797853323866860729/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI2_bbJLE9qsfHrXf8k6MyBYhWQl1ydAZoX1lEvryrQmlXu-iKw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Did root canal with Dr Graeme many years ago  and so blessed to have found in 2024 to do veneers. And it worth every single cents of my money and with a millions dollar smile. Dr Graeme really made an oldie but with new young smile now\nSOOOO HAPPYYYYYY.\n\nONCE AGAIN THANK U SO MUCH DR GRAEME aka handsome  and macho dentist\nSpecial to Ms Esther Lim for her motherly care\nKelly thank u  ur so gentle\nAnd adik Iza the baby so humble and gentle.\nWE SHALL MEET AGAIN❤️🙏",
      "time": 1737972812,
      "translated": false
    }
  ],
  "types": [
    "dentist",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7621740396751238065",
  "user_ratings_total": 174,
  "vicinity": "55 Siglap Road, B1-28 Siglap Centre, Singapore"
}