{
  "formatted_address": "163 Tanglin Rd, #02-127/128, Singapore 247933",
  "geometry": {
    "location": {
      "lat": 1.305035,
      "lng": 103.823845
    },
    "viewport": {
      "northeast": {
        "lat": 1.306505530291502,
        "lng": 103.8251393802915
      },
      "southwest": {
        "lat": 1.303807569708498,
        "lng": 103.8224414197085
      }
    }
  },
  "name": "Caffe Beviamo Tanglin Mall",
  "place_id": "ChIJVaxrUIoZ2jER_OTAixbDOl8",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Ivan Loh",
      "author_url": "https://www.google.com/maps/contrib/114542374982525257775/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWDD-8mEu7F0HJkx-qBTXjltLLKPwUo6tt56idMhexkNdcmQDlMmg=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "We had breakfast at Caffe Beviamo (Tanglin Mall) yesterday morning at 10am. While we were first in line, we still had to wait about 20 minutes for a table. We were asked to check the menu and place our orders while waiting, which was fine since it meant getting our food faster.\n\nThe food itself was quite good. The wholemeal toast had a great texture and tasted very fresh. The poached chicken fillet sandwich was flavorful, and the coffee was really good.\n\nHowever, the service left much to be desired. Our food was served without cutlery, and I had to ask two servers before receiving it. My aunt had to use her teaspoon to spread butter on her toast as it was getting cold. My toast order was also missing one of the spreads I had requested, and I had to go to the counter to ask for it since no server was available. Similarly, my daughter's pasta was served without children's cutlery, and I had to ask for it at the counter. Interestingly, the table next to us had everything served correctly, including children's cutlery, without needing to ask.\n\nThat said, the staff were polite and did bring things to our table when requested. While the food was decent, the service experience was frustrating, which is why I'm giving it three stars. Hopefully, they can improve on this aspect.",
      "time": 1743479833,
      "translated": false
    },
    {
      "author_name": "Isabelle Tay",
      "author_url": "https://www.google.com/maps/contrib/104140455507701408773/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXwS14sC6cmx3V32vPbnuT83KC1X-6goucv3u8I-ZKsEAr2ddE1=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "Came here for a late lunch. Service was slow and you can tell some of the waiters saw you but pretend not to. Stood at the entrance awhile only to be served after asking. Staff had a really black face as well. Sat us near the counter and served us from the back, lazy to walk to the table. Only the younger staff was more hardworking.\n\nPasta was average only. Kitchen staff eating while cooking, not sure why they do an open kitchen concept then... only saving grace was the milkshake which was really rich.\n\nNever. Ever. Coming. Back.",
      "time": 1745498121,
      "translated": false
    },
    {
      "author_name": "Jancy Chua",
      "author_url": "https://www.google.com/maps/contrib/107358995051517565164/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVnxey5JcowmLa9_5coL8ZLXCmrwE5VC12N67ZRgBOInTYHZpSk=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Reasonable prices for the pasta. We love the Pavlova. It is not something commonly offered on the menu in cafes and even in European restaurants in Singapore. This one comes with ice cream and passion fruit syrup to balance the sweetness, and topped with beautiful fruits. Perfect for two to share! Go for it, because it’s reasonably priced too.\nStaff was attentive, polite and served us two glasses of warm water even without us asking. Really appreciate the warm water as it was a wet and chilly day today. I entered the cafe wearing a shawl and requested to sit at a table. The staff lady immediately informed me that it would be cold as that seat is under the vent. Very thoughtful!",
      "time": 1732275101,
      "translated": false
    },
    {
      "author_name": "Pui Shee Hui",
      "author_url": "https://www.google.com/maps/contrib/107771724443590971664/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUc_ecOiAC7sYUfNezWIPO6nunyhBpD7qAjW4TRjc9UNGzu4jo=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 weeks ago",
      "text": "I was quite shocked by the pricing here. I wasn’t feeling well and wanted something light, so I ordered an egg mayo toast and a chamomile tea for takeaway. I knew the chamomile tea was $8 because it comes with free refills when you dine in, but I didn’t expect the takeaway version to be so underwhelming.\n\nFor $8, I received a small cup, probably around 250 to 300 ml, definitely smaller than a tall size at Starbucks. To make things worse, they didn’t even include a tea bag, so there was no way to refill it at home. It felt misleading and overpriced.\n\nThe toast was okay. It looked like a quarter loaf of sourdough, cut into slices and topped with egg mayo and tomato. It’s something you could easily make at home for under $10. That said, the egg mayo was well prepared and the tomatoes were fresh, so I do give credit for the food quality.\n\nBut charging $8 for a small cup of chamomile tea without a tea bag included, especially for takeaway, feels like a complete rip-off.",
      "time": 1746586102,
      "translated": false
    },
    {
      "author_name": "MITHILESH MISHRA",
      "author_url": "https://www.google.com/maps/contrib/117882085291937325018/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVm3PwucSlchxca4eVHMZ5YVBRZW_RWKzdN6TaPTK3ueCCLMEF97A=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Beviamo Tanglin Mall: A Cozy Coffee Haven with a Surprising Pizza Twist\n\nBeviamo, nestled within the tranquil ambiance of Tanglin Mall, offers a delightful escape for coffee enthusiasts and casual diners. The café's inviting interior, with its 40-seater capacity, creates a cozy atmosphere perfect for leisurely afternoons or quick pit stops.\n\nThe coffee offerings are a highlight, with the mocha and cappuccino proving to be refreshing and well-balanced. The Affogato, a harmonious blend of espresso and ice cream, is a must-try for dessert lovers.\nWhile the coffee steals the show, Beviamo also surprises with its culinary offerings. The Margherita pizza, a classic choice, is a delightful surprise. The crust is perfectly crisp, and the toppings, including fresh tomatoes, mozzarella, and basil, are generously applied. The base sauce and a drizzle of olive oil elevate the flavor profile to new heights.\n\nThe service at Beviamo is commendable, with attentive staff ensuring a pleasant dining experience. The provision of baby chairs and cutlery demonstrates their commitment to catering to families with young children.\n\nOverall, Beviamo Tanglin Mall is a hidden gem that offers a delightful combination of great coffee, tasty food, and excellent service. Whether you're seeking a caffeine fix or a satisfying meal, Beviamo is worth a visit.",
      "time": 1732460065,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "meal_takeaway",
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6862011483853743356",
  "user_ratings_total": 363,
  "vicinity": "163 Tanglin Road, #02-127/128"
}