{
  "formatted_address": "262 River Valley Rd, Singapore 238308",
  "geometry": {
    "location": {
      "lat": 1.2945922,
      "lng": 103.841979
    },
    "viewport": {
      "northeast": {
        "lat": 1.295906980291502,
        "lng": 103.8433047302915
      },
      "southwest": {
        "lat": 1.293209019708498,
        "lng": 103.8406067697085
      }
    }
  },
  "name": "Cambridge @ River Valley",
  "place_id": "ChIJJ1rP4p4Z2jERTuGtVjG6BZE",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Cynthia",
      "author_url": "https://www.google.com/maps/contrib/109062818807279554067/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIrCvXLMeXCGby66UA1UvG05G2KAHtw66JFYwSHOWfiGO4IhKw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Cambridge Robertson Preschool has been an absolute blessing for our family!  From the moment we walked in year 2018 for a tour, we felt a warm and welcoming atmosphere.\nThe facilities are bright, clean, and well-equipped, creating a stimulating STEM environment for learning and play.\nBut what truly sets this preschool apart is the incredible team of educators, and in particular, our child's teacher, Teacher Joy\n\nTeacher Joy is simply amazing.  She has a genuine passion for teaching and a remarkable ability to connect with each child on an individual level.  Our child, Rykeer joined during playgroup and has blossomed from his Nursery to Kindergarten years under all the wonderful Teachers(Zhao Lao Shi, Li Lao Shi, Zeng Lao Shi , Aunty Li, Senseis, Principal Mas and Principal Ria) as well as admin staff Celeste.\n\nAs a seasoned educator for 25 years, Teacher Joy's patience, understanding, and gentle encouragement completely transformed my child. She fostered a love of learning in everyone, and helped them develop confidence and social skills that we never thought possible.  We've seen such a positive change in my child's personality and enthusiasm for going to school.\n**Fun fact, my child at 18 months since Day 1 of Cambridge Robertson has never once cried when we dropped him off to school, in fact when we pick him up, he never wants to leave! 😄**\n\nWe are so grateful for Teacher Joy's dedication and the positive impact she has had on our child's growing years.  She is truly a gifted educator, and we feel so fortunate to have had her as part of our child's early education.  Cambridge Robertson Preschool, has laid a strong foundation for Rykeer's future success.\nWe highly recommend this preschool to any family looking for a nurturing and enriching learning environment.\nOne thing to highlight also is; they celebrate a myriad of festivals and it has taught my child so much about different cultures and races! You name it they celebrate it, my child is dressed up for Halloween, Deepavali, Mid Autumn Festival, Hari Raya and so much more!\nAlso the friendships that were forged continues even after we graduated, even among the parents, its amazing!\nGrateful from the bottom of our hearts!",
      "time": 1739596687,
      "translated": false
    },
    {
      "author_name": "Boatman Family",
      "author_url": "https://www.google.com/maps/contrib/115722618783764873475/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJEze1_hfW-si-dz8fNKooWTQuAhTD7bMCc-NGCMaJ56Tg_jw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "Our sons attended Cambridge @ Robertson for two years before we moved back to the UK. It is a wonderful pre-school, so caring and nurturing. The STEAM curriculum meant our children were ahead when we moved back to the UK. The teachers are incredible, very kind and loving. We have many happy memories of all of the fancy dress activities, enrichment classes, shows and activities such as parents coming in and booking their national dish with the class.  Four years later we are still in touch with Principal Ria and Teacher Skye and had a wonderful reunion visit with them when we returned to Singapore on holiday. So many happy school memories. Can't recommend highly enough.",
      "time": 1723800207,
      "translated": false
    },
    {
      "author_name": "chris whitton",
      "author_url": "https://www.google.com/maps/contrib/114767193582963505744/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV4GZkKWvjy_2IaVUGwdAwldRn4QyVpk_Q2N9UGgNelzb-6i2o=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Cambridge is a school that is very welcoming has a friendly staff and has an excellent learning environment. Parents can choose from an array of classes each semester such as coding and robotics, sports class, Chinese, dance and other enrichment courses. Additionally, the instructor go above and beyond to help the development of children, completing detailed report cards and parent teacher conferences so parents always know how their child is progressing and where we can help continue development. One perk of sending our child here is the photo gallery that shares to me moments in our child’s day. This really helps me feel more connected to my child when I’m not around and seeing how they interact with others. Overall, Cambridge is a school that really cares and I am so thankful for all the time these instructors have put in to help shape our child’s future. I feel confident that our kid will be successful in their learning career thanks to this wonderful school.",
      "time": 1710771452,
      "translated": false
    },
    {
      "author_name": "Diana Papyan",
      "author_url": "https://www.google.com/maps/contrib/115981130724418790899/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU-tyN9DoJaUHe4-TAVODqmxzvICPM7w7lQtSJdmlRS270I8pucdQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "The best preschool and nursery in Singapore!\nGreat curriculum, teaching system, mission and learning vision together with great values are being shared with the parents and children.\nHighly recommended for all children of the world.",
      "time": 1724151194,
      "translated": false
    },
    {
      "author_name": "A Ng",
      "author_url": "https://www.google.com/maps/contrib/100025387060673996176/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUzu8CcwaOvNS8xweabq8PIXGSvPoXvprD4kwvZFLvSVWDc2icG=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Teachers Joy and Qian Ping Liao Shi deserve a 10/10 rating! Finding teachers with genuine passion and positive energy is truly a blessing, and we feel fortunate to have them. They proactively provide updates and encourage curiosity, which is invaluable. Most importantly, my son eagerly looks forward to going to school every day because of them. I also want to give a special shout-out to Teacher Celeste for her exceptional patience and helpfulness with both parents and children. She's fantastic!",
      "time": 1715527678,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10449963231453503822",
  "user_ratings_total": 13,
  "vicinity": "262 River Valley Road"
}