{
  "formatted_address": "Opp Victoria JC, Singapore",
  "geometry": {
    "location": {
      "lat": 1.3026253,
      "lng": 103.9198688
    },
    "viewport": {
      "northeast": {
        "lat": 1.304345130291502,
        "lng": 103.9210977302915
      },
      "southwest": {
        "lat": 1.301647169708498,
        "lng": 103.9183997697085
      }
    }
  },
  "name": "Campsite Area D",
  "place_id": "ChIJk4Db5Zoj2jERVZcIjMAMAlE",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Forest BK",
      "author_url": "https://www.google.com/maps/contrib/116448453673911455728/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL76LHGcdk_DWwI1Uwpxr5pFf5padq-ZcHhARkF7WFUdeyixQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "⛺Camping at East Coast Park seems more popular than other camping locations around Singapore.\n⛺Perhaps it's because of the amenities, like being near food sources, water source, toilet and the availability of a whole range of activities like cycling, jogging, beach ball, swimming, fishing, children playground, skating, etc.\n⛺Area D and Area G are the 2 campsites.\nMore tents are pitched at Campsite Area D than at Area G.\nThis area here is clean, flat, very windy and close to the sandy beach.\n⛺It's the closest to an ideal site for camping.",
      "time": 1731564084,
      "translated": false
    },
    {
      "author_name": "Nursharina Roslan",
      "author_url": "https://www.google.com/maps/contrib/101153613645951897173/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVCDEiP49uWq3NO5yn0xwgcffH41jL8Z4_sSWAJu2WlL0upWg3SkQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "8 months ago",
      "text": "It's been a while since I've gone camping with my family. It was the kids' first time sleeping outdoors. We set up a tent on a Saturday afternoon. We also BBQ-ed and stayed overnight. The toilet is so clean. There is still the urine stench, but overall is clean, so much better than last time.\n\nEvening had a lot of people, and a lot stayed the night. It was a bit noisy due to some groups still singing and laughing loudly in the wee hours of the morning.\n\nBut in the morning, a lot of the visitors who stayed the night did not clear their rubbish and the beach was so dirty with a lot of rubbish bags. Hope for people to be more responsible.",
      "time": 1726651870,
      "translated": false
    },
    {
      "author_name": "A V",
      "author_url": "https://www.google.com/maps/contrib/116768699501663000789/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVXbCq93DtQCbAZ8BmOoPsu3upHPaGc5Vk-uw6tej0FFOBXR1Yrpg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Third time camping in Singapore after West coast park and Pasir Ris.\n\nSo far, West Coast park is the worst because the view is on the port's infrastructures, it was very noisy with the children playing at the nearby playground until 2 am, and too much light. I couldn't sleep at all the while night.\n\nPasir Ris would be second although it could be noisy because of being nearby BBQ pits but the view is nice and the waves are not too loud.\n\nEast Coast Park seems to be the best one because all the activities you can do nearby the campsite for children and for people who like all kind of sport: volley ball, kite surfing, biking, running etc.\nWe appreciated the toilets that are of better quality than in the other 2 campsites above mentioned. But the water pressure for the shower is too strong with very thin water drops. It hurt my sunburn skin when I took a shower.\n\nHowever the choice of Campsite D is a very confusing because it is vast and NO information about the limit of the campsite D could be found either on internet or on site. We could say there is a campsite D1 (nearer to the playground) and campsite D2 (nearer to Long Beach restaurant, Jumbo and foodcourt).\n\nSo we were at the campsite D1, nearer to the playground, Mc Donald and carpark D. It was a bit busy and unfortunately for us people partied with noisy voice, shouts and music sound until 5 am not only at the BBQ pit but also about everywhere... Some even sleep on the grass without any tent.\n\nThe waves sound was also too noisy but there was not too much light. I enjoyed running and doing some workouts here and my daughter taught me some yoga moves :-) We spent 2 nights here.\n\nOur next camping destinationwill be either the campsite G or D2. The grass at D2 seemed more green and maybe less people camp there.",
      "time": 1653228712,
      "translated": false
    },
    {
      "author_name": "Jie Gu",
      "author_url": "https://www.google.com/maps/contrib/113691209971213095357/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXhg2WciFPJDfDMNQvXYk4Fka8LJIeoOIWfnWugpc6g95-hRIvl4g=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "a year ago",
      "text": "We set up our tents at the beach just opposite PS cafe as it's closed to the carpark and toilet. However, I would suggest overnight campers to stay away from this area as it got really noisy and crowded at night and even more so after midnight.\n\nA group of foreign workers gathered very near our tent and chatted very loudly for the whole night till dawn.\n\nWhat's worse was another group of foreign workers played music super loud with a speaker and shouted together to cheer, untill 3am.\n\nI doubt anyone can sleep under such condition.\n\nI had a stroll around 2am towards east and noticed it was much quieter and less crowded after 500m towards east.",
      "time": 1689067971,
      "translated": false
    },
    {
      "author_name": "Captain Q",
      "author_url": "https://www.google.com/maps/contrib/100258362433448061515/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSm7VSudpNDrYDBBwU-vJXpyr6hrf7WxnmGpxZFC1KeveyLwj9=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "6 months ago",
      "text": "Very crowded if during public holiday or eve. Feels like you are not in Singapore from the campers.",
      "time": 1730612460,
      "translated": false
    }
  ],
  "types": [
    "campground",
    "park",
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5837242088148211541",
  "user_ratings_total": 16,
  "vicinity": "Opp Victoria JC"
}