{
  "formatted_address": "258 Bukit Panjang Ring Rd, #01-44 2-Opposite POSB Bank, Singapore 670258",
  "geometry": {
    "location": {
      "lat": 1.3776717,
      "lng": 103.7732083
    },
    "viewport": {
      "northeast": {
        "lat": 1.379038730291502,
        "lng": 103.7744862802915
      },
      "southwest": {
        "lat": 1.376340769708498,
        "lng": 103.7717883197085
      }
    }
  },
  "name": "Candy Tree Language Centre 糖果树华文学堂",
  "place_id": "ChIJ13h6ZWoR2jERXHa-vFFi8D0",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Wei Gen Sia",
      "author_url": "https://www.google.com/maps/contrib/116107003348509235750/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI8Y4yEw0FHdm_7bDjY2tupiyZPHIcfh1vmByhXnPrNyJ9xcA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "Both Liu Lao Shi and Li Lao Shi are experienced, responsible, and dedicated teachers. They are current/former MOE teachers who continue to teach in MOE school,  ensuring they stay updated with the latest curriculum and exam formats.\nInitially,  I was concerned about how my daughter would benefit from a class with students of varying levels,  but they assured me with their effective use of differentiated teaching. If you are looking for a tuition centre that tailors its teaching pace to your child's need,  Candy Tree is the perfect choice.\nTheir teaching materials are highly effective,  reinforcing vocabulary and idioms from previous lessons.  They also encourage students to memorise the points from oral exercises, which not only enhances oral exam performance but also improves composition writing.\nAdditionally, Liu Lao Shi and Li Lao Shi consistently provide sincere and timely feedback about my children 's progress. They also work closely with parents to ensure continuous improvement.  This stand  in stark contrast to my previous experiences with other Chinese tuition centers, which rarely provided feedback or offered only generic, unhelpful comments.\nI would like my express my appreciation to Candy Tree Language Centre!",
      "time": 1745236599,
      "translated": false
    },
    {
      "author_name": "zhi en cheong",
      "author_url": "https://www.google.com/maps/contrib/102727221593726507781/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWUOcKoj4ERrsnegUaumAhakEGqdivfqjtrBCpW_1-rLjg5x3c=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Ms Liu has been my Chinese and Higher Chinese teacher from Secondary 3 to 4. She has helped me in my O level Chinese and higher Chinese examinations. Her method in teaching is clear and she is also quick to catch on my mistakes to help me improve. She also provides a vast amount of resources and exercises for us to practice with. I went from failing my compositions and scraping a bare pass in comprehension to ultimately attaining an A1 for Chinese and A2 for HCL respectively. She also teaches with a lot of sincerity, by providing additional lessons to help during that crucial period and also having extra consultations with her. Candy Tree has definitely helped improve me Chinese!",
      "time": 1741405594,
      "translated": false
    },
    {
      "author_name": "Wenn Ng",
      "author_url": "https://www.google.com/maps/contrib/109496476673240111269/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLCQ2zDysZJP-vXkiRfZVCrpHM7laDx7gF1q5Ylr8sN_KYoFg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "We decided to sign up with Candy Tree due to the proximity in location initially but very glad that we made the right choice a year ago! My child used to be very weak in Chinese as we were quite late in introducing tuition/enrichment programs to him. I recall my comments to 刘老师 back then about him were that he disliked conversing in Mandarin, and had difficulty in word recognition. A year on, I noticed that he can read more words and has less resistance to learning Chinese in general. We were pleasantly surprised with his recent Year End results too, given that he used to fail/borderline pass his P2 papers.\n\nCommunicating with the teachers here (刘老师，李老师) had been a breeze and I can truly feel their patience and sincerity in wanting my boy to be better, progressing at his own pace. It is very thoughtful of them to organise Children's Day/Graduation party with many activities for their students to have fun and even extended invites to their siblings!\n\nAppreciate that Candy Tree offers trial class and referral program this year so parents can enjoy savings while signing up fellow siblings. We learned it is better to instill habits and build up the child's confidence in learning Chinese early on.",
      "time": 1731407459,
      "translated": false
    },
    {
      "author_name": "Joyee Miaoru Yan",
      "author_url": "https://www.google.com/maps/contrib/117704400024607076560/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVJQ14XGvifD1hlHbht_pLRTPDCJlqDObZF4K79CZSErJvcQZUMFw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I was struggling to get my child to speak Mandarin and decided to look for help at the start of the year. As I was looking for options near my place, I came across this tuition centre and reached out. Liu Laoshi responded to my inquiry very quickly, which was a great start!\n\nWhat I appreciate about this centre is that they don't try to teach faster than the school curriculum. Instead, they match the school's pace and focus on reinforcing what my child is learning in school, ensuring a strong foundation before moving on to the next topic.\n\nThis has made a huge difference. My child is now more confident and comfortable with Mandarin. Highly recommend!",
      "time": 1731289220,
      "translated": false
    },
    {
      "author_name": "lina Chin",
      "author_url": "https://www.google.com/maps/contrib/105623313694174894630/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIjuvmeaT-DoK2PSwQuxDMGE6QHvIQBhiOzfzc4z6tx6Juyew=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "We join Candy Tree middle of the school year (2024) because our children need help on oral, and for my older child, coping HCL exams for the first time in P5. Both gained confidence in oral conversations and we observed improvement in both Paper 1 and 2. Outside of curriculums, though Chinese is not their favourite subject, both Li Laoshi and Liu Laoshi manage to engage my children. My P5 tells us she wants to continue HCL, giving a chance/go on the subject in PSLE. Other than seeing improvement in results, it's very important that the teachers are able to connect and make sure our children do not resist Chinese, imho",
      "time": 1734589653,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4463175333922633308",
  "user_ratings_total": 54,
  "vicinity": "258 Bukit Panjang Ring Road, #01-44 2-Opposite POSB Bank"
}