{
  "formatted_address": "62 Lakeside Dr, Singapore 648321",
  "geometry": {
    "location": {
      "lat": 1.3425547,
      "lng": 103.7187397
    },
    "viewport": {
      "northeast": {
        "lat": 1.343915030291502,
        "lng": 103.7200950802915
      },
      "southwest": {
        "lat": 1.341217069708498,
        "lng": 103.7173971197085
      }
    }
  },
  "name": "Caspian",
  "place_id": "ChIJM7Kvx3QZ2jERxlME7E0Zxhc",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "CoderFox",
      "author_url": "https://www.google.com/maps/contrib/107337791836910102052/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWlBkaC1CpRwhPiR8WABh-phpI5Js8kKppRGiZ_zDug3OrAegI=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Spacious apartments and a variety of facilities throughout the complex such as swimming pool, poker table, gym and tennis court. Very good location. 3 mins walk from Lakeside MRT station",
      "time": 1726400031,
      "translated": false
    },
    {
      "author_name": "Jimmy lgw",
      "author_url": "https://www.google.com/maps/contrib/114214366801912172489/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWPgiwkjdooqfFHwVoHfIrk1forVh8DylwY10mUwbwpdqBAQni4DA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "I love it it has 17 levels and 2 basements! I been here for 11/9/2020 It also have a swimming pool! Oh yeah that in dancing at the pole xD",
      "time": 1601017711,
      "translated": false
    },
    {
      "author_name": "Mark HDB Reviewer",
      "author_url": "https://www.google.com/maps/contrib/115530603300721453607/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUAy2pUVPuPI5DZhSWpPY3EiQZc7F264SgB8v3NOvy002KpNg8=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I recently had the pleasure of residing in Caspian, and I must say it was an exceptional experience. From the moment I moved in, I was impressed by the quality of living, the outstanding amenities, and the exceptional service provided by the management and staff. Here's my detailed review of this remarkable apartment building.\n\nLocation and Accessibility:\nCaspian enjoys a prime location that offers the perfect balance between convenience and tranquility. Situated in a thriving neighborhood, it is within easy reach of shops, restaurants, entertainment venues, and public transportation options. The proximity to major highways and public transit made commuting a breeze, making this building an ideal choice for professionals and families alike.\n\nArchitecture and Design:\nThe architecture of Caspian is nothing short of stunning. The building boasts a contemporary design that seamlessly blends in with its surroundings. The thoughtfully planned layout provides spacious, well-lit apartments with modern fixtures and high-quality finishes. The attention to detail in every aspect of the building's design is truly commendable.\n\nAmenities:\nOne of the standout features of Caspian is its extensive range of amenities. The building offers residents a state-of-the-art fitness center, a sparkling swimming pool, a rooftop terrace with breathtaking views, a beautifully landscaped courtyard, and even a dedicated pet-friendly area. The on-site concierge services and 24/7 security ensure that residents feel safe and well-cared for at all times.\n\nMaintenance and Management:\nThe management team at Caspian is exemplary. They are professional, responsive, and always go the extra mile to address any concerns or issues promptly. The maintenance staff is skilled and diligent, ensuring that the building and its amenities are well-maintained at all times. The level of service provided by the management team truly sets this apartment building apart.\n\nSense of Community:\nLiving at Caspian offers more than just a place to reside; it provides a vibrant community atmosphere. Regularly organized social events and activities bring residents together, fostering a sense of belonging and camaraderie. The building's communal spaces are thoughtfully designed to encourage interaction and create opportunities for residents to connect and build lasting relationships.\n\nIn conclusion, Caspian is a superb place to call home. The combination of its exceptional location, breathtaking architecture, remarkable amenities, outstanding management, and strong sense of community make it a standout choice among other apartment buildings. If you're looking for a modern oasis that combines comfort, convenience, and a sense of belonging, I highly recommend considering Caspian for your next home.\n\nNote: Please remember that this review is based on my personal experience, and your own experience may vary.",
      "time": 1687249466,
      "translated": false
    },
    {
      "author_name": "SL M",
      "author_url": "https://www.google.com/maps/contrib/100038477702587830233/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXURbepXd4d_yc_z7ruPUNjSGxWOb9R7jdJHUbpX_34U2xuLp4=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "2 years ago",
      "text": "Very good condo. I like the swimming pool as the design is very creative. Prices are reasonable and location is close from Lakeside MRT. It is like the transport capital. Guards are nice too and you want to live in here.",
      "time": 1659448880,
      "translated": false
    },
    {
      "author_name": "Jon liang",
      "author_url": "https://www.google.com/maps/contrib/114181212055511837902/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJMKc16fnh-8Z1iWuzUvhOVfx0iVmEPZamr0smQ0GOM3qZsSA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "MRT track noise from 6am to 12mid night. 18hrs of track noise. Beside 5 lanes boon lay way road. Noisy",
      "time": 1713264485,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1713084530723935174",
  "user_ratings_total": 113,
  "vicinity": "62 Lakeside Drive"
}