{
  "formatted_address": "123 Bukit Merah Lane 1, #01-110, Singapore 150123",
  "geometry": {
    "location": {
      "lat": 1.2863085,
      "lng": 103.8035961
    },
    "viewport": {
      "northeast": {
        "lat": 1.287706130291502,
        "lng": 103.8047934302915
      },
      "southwest": {
        "lat": 1.285008169708498,
        "lng": 103.8020954697085
      }
    }
  },
  "name": "casual poet library",
  "place_id": "ChIJyQRybQAb2jERcZDtFhEVnqY",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Maisie Cheong",
      "author_url": "https://www.google.com/maps/contrib/102602769468042522004/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXx5V8Am0U30nzCJO3Sy10JRf_nCyShvwqfVDFtOrvSb5ms1Os=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "My second home away from home - this little library of humans and books is the healing third space you never knew you needed. If you’re a book/story/human lover, this is the best place to just -be- in no great hurry. Come for the space and the company of books and humans - the space may be free to use and books free to browse, but the experience and connection you’ll feel is priceless. Do something nice for yourself today and enjoy the space to just take a breath - you deserve this library! 💜",
      "time": 1741771012,
      "translated": false
    },
    {
      "author_name": "Melissa Chong",
      "author_url": "https://www.google.com/maps/contrib/112046234996275656699/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUZpjSs4g7Gu71OV0pSv6XK6rZJ8WYbAyVRKPGeXuTapgluUYf0=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "casual poet library is a place that feels like home the moment you step inside. Tucked away in the heart of the neighborhood, it’s more than just a bookstore—it’s a warm, welcoming escape. The shelves are lined with everything from classic novels to hidden gems, and the inviting atmosphere makes you want to linger over a cup of coffee and get lost in the pages.\n\nWith its soft lighting, comfy corners, and friendly vibe, it's the perfect spot to browse, read, or simply enjoy a quiet moment. The owners and staff always greet you with a smile, making it feel like a personal visit every time. Whether you're a regular or a first-timer, the cozy charm of this quaint hideout is sure to leave you feeling right at home.",
      "time": 1745896963,
      "translated": false
    },
    {
      "author_name": "Lyn 芊诺",
      "author_url": "https://www.google.com/maps/contrib/113622952552013625158/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUY7dvpyZedWehrDcGAXsTgD025wOXw0QFCEkpfElHTByoXEBZr2w=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "this little space is the true epitome of a sanctuary, a place of community that brings readers together.\n\nevery shelf encapsulates a book lover’s life story and reading taste. behind each nook is a curious curator, passionate about sharing the joys that literature brings, the solace it provides in times of need, the inspiration it offers in life’s journey.\n\nvisitors can also rely on their volunteer librarian for recommendations. if i were a local, i would have signed up for their $25 annual membership. 5 books a month with no late fees is a treat! nevertheless, my short visit here has further fueled my dream of owning a literary space like this some day.\n\nthank you for existing, casual poet library. the Bourdain memoir “Medium Raw” (btw, every logophile, writer and foodie should read Anthony Bourdain) on the window display was enough to get me pumped up before entering the library. absolutely returning to this library the next time i’m back in singapore!",
      "time": 1731507585,
      "translated": false
    },
    {
      "author_name": "Plus Ultra",
      "author_url": "https://www.google.com/maps/contrib/101137263342201758782/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX1vgPOMXflpHELVVaHdjTlA1vnRfKAku8YuRfGT_Fy90dW17E=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "Was there for the first time this afternoon (Monday, 19/8/2024). Great place to be at for all who love books and meaningful quotes. Shelves are well maintained and some of them are decorated with personal items that are carefully curated.  Much like Books Actually but with a smaller space. Hope this place can make enough money to give it the longevity it deserves.",
      "time": 1724051332,
      "translated": false
    },
    {
      "author_name": "Marilyn Lim",
      "author_url": "https://www.google.com/maps/contrib/114282561901443027974/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXT9zzfcmhJuPBZh69k6XJlRnnuEm61NAIoOzJ8VvaCBXcg9regLQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "Each shelf a space for self expression and giving back to the community.  Each note/drawing conveying the idea behind the shelf is a unique voice - spent more time reading these than scanning the books.  A library that shows and shares the power of loving books.  Love it.  Support it.",
      "time": 1722955264,
      "translated": false
    }
  ],
  "types": [
    "library",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12006056819759616113",
  "user_ratings_total": 40,
  "vicinity": "123 Bukit Merah Lane 1, #01-110, Singapore"
}