{
  "formatted_address": "2 Tampines Central 5, Level 5 Century Square, Singapore 529509",
  "geometry": {
    "location": {
      "lat": 1.3523888,
      "lng": 103.9438567
    },
    "viewport": {
      "northeast": {
        "lat": 1.353918330291502,
        "lng": 103.9453111302915
      },
      "southwest": {
        "lat": 1.351220369708498,
        "lng": 103.9426131697085
      }
    }
  },
  "name": "Cathay Cineplex Century Square",
  "place_id": "ChIJAQBAjxE92jERK5Z5jpYutoM",
  "rating": 3.8,
  "reviews": [
    {
      "author_name": "oXRYSTALo Ong",
      "author_url": "https://www.google.com/maps/contrib/114556064085815871377/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSTtKcF9FYMbh-XNbDu8f7Whl3gi-ZY6T8pFPOm3v9Y98Ws7jL=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 3,
      "relative_time_description": "2 weeks ago",
      "text": "Cathay Cineplex Century Square: Accessibility and Security Issues Leave Us Frustrated (3/5 Stars)\n\nRating Breakdown:\n\n• Movie: 4/5 (Good movie, but with technical difficulties)\n\n• Projection: 3/5 (Technical difficulties caused pauses during the movie)\n\n• Accessibility: 2/5 (Excessive stairs and difficulties bringing bicycles)\n\n• Security: 2/5 (Security lapse with bicycles left with staff)\n\nOverall: 3/5 Stars\n\nDonkey and I went to catch 'Blood Brothers' there the other day, and while the movie itself was good, the experience was soured by some major accessibility and security issues.\n\nThe projection had some technical difficulties, pausing for a while before resuming. This was frustrating, but the real problem was the accessibility and security issues. We brought our Bromptons, as usual, but the sheer number of stairs made bringing them inside impossible. We were forced to leave them with staff at the ticketing counter, who assured us they'd be safe and waiting for us after the movie (they don't knock off early).\n\nBut when we went to collect our bikes after the film, guess what? No staff in sight! 😡\n\nThis accessibility problem (those stairs are brutal!) combined with the security lapse really put a damper on the evening. We're not sure what happened to the staff, but this situation definitely needs to be addressed. Cathay, you need to do better!\n\nAnyone else had similar issues at this Cineplex? 🤔",
      "time": 1746364103,
      "translated": false
    },
    {
      "author_name": "Elijah Tan",
      "author_url": "https://www.google.com/maps/contrib/109287346354369266778/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVWtHrxo86gP-DEbafUkFEz0xnnpKZRZxd-QtVchBqDlpxNdDZO=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Had the pleasure of watching a movie at the newly renovated cinema at The Cathay at Century Square, and it was an incredible experience!\n\nFrom the moment I stepped in, I was impressed by how clean and well-maintained the place was. The seats were super comfy, making it easy to sit through the entire film without any discomfort.\n\nThe upgraded sound and screen quality added to the perfect movie experience. Everything felt so immersive, and the ambiance was just right.\n\nHighly recommended for anyone looking for a premium cinema experience.",
      "time": 1732769913,
      "translated": false
    },
    {
      "author_name": "Doraemon",
      "author_url": "https://www.google.com/maps/contrib/112665277904119154671/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX2VSCcaT9axvOwx2nD8XD3PgZ8V5VFnv420aocMSfLa6GlcEmN=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 2,
      "relative_time_description": "2 weeks ago",
      "text": "Kitty and I went to catch \"Blood Brothers\" at Cathay Cineplex Century Square the other day at 10.30pm, and while the movie itself was good, the experience was soured by some major accessibility and security issues.\n\nThe projection had some technical difficulties pausing for a while before resuming. This was frustrating, but the real problem was the accessibility and security issues. We brought our Bromptons, as usual, but the sheer number of stairs made bringing them inside impossible. We were advised to leave them with staff at the ticketing counter, who assured us they'd be safe and waiting for us after the movie. The staff even mentioned that no bicycles are allowed in the movie theatre, which is not true.  We’ve been visiting movie theaters with our folding bikes for over 10 years, and we’ve always secured them in a safe and accessible location within the cinema without causing inconvenience for others. This has been the case at all Cathay Cineplexes we’ve visited. We were shocked to hear this remark, especially from the manager himself. He promised that he and his staff will be around to take care of the bikes.\n\nBut when we went to collect our bikes after the film, guess what? No staff in sight!\n\nThis accessibility problem, combined with the security lapse, really put a damper on the evening.  We were really sadden by the promises made. We're not sure what happened to the staff, but this situation definitely needs to be addressed.  Cathay, you need to do better.",
      "time": 1746405979,
      "translated": false
    },
    {
      "author_name": "Chen money",
      "author_url": "https://www.google.com/maps/contrib/115039175379435402990/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI0tiGz2qdZkll4YvIXR02Uylo-Sdr0mxCpEB96-mnYMFmBnw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Ridiculous promotion package. Pure scam. We bought the 100 dollar package (10 tickets bundle) to support the cinema, but ended up cannot use the voucher to watch any of the movie today. All the available movie today are not applicable. Also the popcorn they gave out for people who use the voucher is ridiculously small. It really has betrayed my trust and faith in the cinema. If you really can’t afford giving out the promotion bundle, then don’t do it. Very disappointed and feel being scammed. A waste of my trust in this place and my 100 dollar. What a shame",
      "time": 1742047605,
      "translated": false
    },
    {
      "author_name": "Serene Chew",
      "author_url": "https://www.google.com/maps/contrib/111996573983775530926/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLctoeJFvWAd7uGekA_SZ0bKZlBvTmjph9tHb28kxwlIMW1IA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I recently visited and was pleasantly surprised by the generous legroom in the seating area. The extra space made the movie-watching experience much more comfortable, allowing me to stretch my legs without feeling cramped. It’s a great feature, especially for longer films, as it enhances overall comfort and enjoyment. I appreciate the thoughtful seating arrangement and will definitely choose this cinema again for future movie nights!",
      "time": 1743224077,
      "translated": false
    }
  ],
  "types": [
    "movie_theater",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9490824488900204075",
  "user_ratings_total": 48,
  "vicinity": "2 Tampines Central 5, Level 5 Century Square, Singapore"
}