{
  "formatted_address": "24 Holland Grove Rd, #01-16/17 Parksuites, Singapore 278803",
  "geometry": {
    "location": {
      "lat": 1.3166391,
      "lng": 103.783116
    },
    "viewport": {
      "northeast": {
        "lat": 1.317936780291503,
        "lng": 103.7846391802915
      },
      "southwest": {
        "lat": 1.315238819708498,
        "lng": 103.7819412197085
      }
    }
  },
  "name": "Cedele Bakery Kitchen - Parksuites",
  "place_id": "ChIJ5yFSLXkb2jER5kas9LwhH9o",
  "rating": 3.1,
  "reviews": [
    {
      "author_name": "Theseus Chan",
      "author_url": "https://www.google.com/maps/contrib/118050550132657618556/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL4sbwuJVt9tTl5mglNgvZXQ62g_K2lHo6JNzs4pklA6NKjKQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Review for Cedele at Parksuites – Miso Mirin Salmon & Easter Special 3-Course Set\n\nCedele at Parksuites continues to impress with its well-balanced, wholesome dishes that deliver both on taste and presentation. I recently tried the Miso Mirin Salmon and the Easter Special 3-Course Set featuring the Pan-Seared Sea Bass with Mushroom Ragu, and both were fantastic choices.\n\nThe Miso Mirin Salmon was beautifully executed—crispy skin, perfectly cooked flesh, and a delicious umami glaze that paired well with the nutty sesame topping. The roasted sweet potatoes and mushrooms complemented the dish well, adding earthy, caramelized flavors to every bite.\n\nThe Pan-Seared Sea Bass with Mushroom Ragu from the Easter menu was another standout. The fish was tender with a crispy seared skin, sitting atop a rich, flavorful mushroom ragu. The scalloped potatoes added a lovely creamy contrast, while the fresh salad with cherry tomatoes provided a refreshing balance. The accompanying mustard-based sauce tied everything together wonderfully.\n\nBeyond the food, the service was warm and attentive, making the dining experience even more enjoyable. The staff were knowledgeable about the menu and made sure everything arrived promptly.\n\nWhether you’re here for a quick meal or a special seasonal offering, Cedele at Parksuites consistently delivers quality food with thoughtful flavors. Highly recommend!",
      "time": 1742555024,
      "translated": false
    },
    {
      "author_name": "I W",
      "author_url": "https://www.google.com/maps/contrib/107686746966044708528/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLR7qMD7CnzxdTPSlKI_8v7zMjNlXGM2jRE5RrfdOt4e5vRqw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "Food wise, I was agonising whether to rate it three of four stars.  The higher the price point, the higher my expectations.\n\nI have to land on three stars for the food.  I had the salmon (see photo) and felt the thin long slab was sliced in a manner that hid the fact that you end up with less salmon.  The mash potato was way too dry.  Someone forgot to add a bit of milk to it?\n\nThe pasta of the chicken pasta seemed slightly undercooked.  This can be forgiven, but the burnt parts of the chicken (see photo) can't be forgiven.  A very ordinary tasting dish.\n\nBeef burger was ordered by my daughter, and she liked it.  I asked her to let me try some.  Knowing that I was tasting for this review, she carefully cut out a slice that was representative of the whole burger.  The burger was nice but not great.\n\nFood 3 stars.  Value 2/5 stars.  My wife says she has 20% discount.  Still, I don't think it is worth it.\n\nCedele is known for it cakes, I ordered the tiramisu and was very happy with it.  The cake was moist and contained a generous amount of alcohol and didn't come across as being too sweet.\n\nCake: 5 stars.  Value:  4/5 stars.\n\nOverall 4 stars.  In future, I will come for the cake and coffee only.",
      "time": 1716075689,
      "translated": false
    },
    {
      "author_name": "L S",
      "author_url": "https://www.google.com/maps/contrib/115581016057612678739/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKaBzQLuGfK1oK94vYpBGzHSOJOT6V4_pHD7jj3sqp2LceIVQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 3,
      "relative_time_description": "5 months ago",
      "text": "Pleasant experience with friendly service staff.  Disappointed with the burger patty (dry and charred) and some parts of bacon burnt. The grilled chicken was a better choice.",
      "time": 1732527323,
      "translated": false
    },
    {
      "author_name": "Jing Jie Ng",
      "author_url": "https://www.google.com/maps/contrib/108318175307818512445/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWvicgmjgnkKAsagaLqVfdn9oHTkp1epUtWkFvRkp2Y495peESS=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "2 months ago",
      "text": "Decent place to have a slice of cake & coffee when in the vicinity.\nThe place is spacious and comfortable, great spacing between the tables.",
      "time": 1740215783,
      "translated": false
    },
    {
      "author_name": "Delia K",
      "author_url": "https://www.google.com/maps/contrib/109317334541884300196/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJfp3s-YB45xTEIAj6VyWRu1R-JB0vqOrvXnOLnJf3Z1TWpPg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "a year ago",
      "text": "lady at the counter was friendly and the atmosphere of the cafe was nice and quiet. however the food here was bad and not worth the price :( got grilled chicken and mashed potato ($23)- the chicken was tough, skin not crispy and potato was tasteless. mushrooms were the only saving point about the dish. the skin of the grilled sea bass pasta ($25) was also not crispy, the snap peas were really fibrous and the seafood wasn’t fresh. truffle fries was $12 for a small bowl and very oily. honestly very disappointed with the food quality for the price point. definitely a first and last visit.",
      "time": 1702708325,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15717318319988819686",
  "user_ratings_total": 31,
  "vicinity": "24 Holland Grove Road, #01-16/17 Parksuites"
}