{
  "formatted_address": "1 Upper Aljunied Ln, Singapore 360001",
  "geometry": {
    "location": {
      "lat": 1.3342328,
      "lng": 103.8786721
    },
    "viewport": {
      "northeast": {
        "lat": 1.335509030291502,
        "lng": 103.8800395802915
      },
      "southwest": {
        "lat": 1.332811069708498,
        "lng": 103.8773416197085
      }
    }
  },
  "name": "Chao Yuan Noodles - Aljunied",
  "place_id": "ChIJJdG2aIUX2jER1ZIu673G19w",
  "rating": 3.3,
  "reviews": [
    {
      "author_name": "Jubei Moses",
      "author_url": "https://www.google.com/maps/contrib/107565847211417040783/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUW0fF9MzaoHMOa9DRmhZwfapBHbAOP_wgoBPphkd3CR79oBm8=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "I went to buy at this stall, I told the staff I am taking away for Mee Tak Mak with a lot of vinegar, trusting the staff, instead when I open up, I get a shock, my Mee Tak Mak is full of chilli and no vinegar at all. How to eat? The staff in this stall do not treat the customer orders seriously. Very disappointing, for a first timer. Not trust worthy.",
      "time": 1735977939,
      "translated": false
    },
    {
      "author_name": "FIVE-A-DAY",
      "author_url": "https://www.google.com/maps/contrib/100426601413786193405/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXoKypjbhjllp9DBjqIWcfHobFBRDbsaQPUI98ODTwNApQOvrVA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "One of my favourite noodle stalls. I love that the noodles are not soggy but retaining the QQ texture, and that the sauce is flavourful and sufficient to coat all the noodles, the added chili is also not overwhelming and that is important for me as some stalls serve really spicy chili and that masked the other flavours present in the sauce. The best part is the pork liver slices, they are really tender and not bloody at all.\n\nLocated in the Joo Seng Food Place, which gets pretty crowded during lunch hours and not exactly the cleanest. Parking is easily available at the multi-storey car park nearby.\n\nDo note that takeaway charge is 40c though.",
      "time": 1710999826,
      "translated": false
    },
    {
      "author_name": "Botak",
      "author_url": "https://www.google.com/maps/contrib/100060791396189603978/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWfsNJL_9MaqRxsVqYx2XckgZM0kYCDmg-psewEikwOtSCoYDb8=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "9 months ago",
      "text": "Situated in a kopitiam, I felt the quality was alright. With 2 strips of 'abalone', the helping, the tastiness of their soup was acceptable to me  for S$5.50\n\nCarpark lots are all over the place since there are many blocks in the vicinity, you might have to park a little far away and walk over.",
      "time": 1723876706,
      "translated": false
    },
    {
      "author_name": "Nicole L",
      "author_url": "https://www.google.com/maps/contrib/112719877920103919368/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVxLketPBM6uanOGLSRdBcLoJ8tQNsnB2bjdu_hmXIgDqP6t9ku=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "9 months ago",
      "text": "One of my favorite minced meat noodle spots in Singapore, but the service has seriously deteriorated. Special mention to  Nguyen Thi Hoa for the terrible service!\n\nOn 16 August 2024, around 9pm, I visited for dinner. My partner and I politely asked if we needed to purchase another bowl to qualify for the \"free gift,\" as my loyalty card was almost full. We also mentioned that the 9th stamp was unclear. To our surprise, Nguyen Thi Hoa immediately started shouting \"NO NO NO\" without even listening to us. Despite explaining that the 9th stamp was faint but present, she continued shouting.\n\nFine, we decided to purchase another bowl to get the 9th stamp properly (image attached). When I reached the 10th stamp and asked to redeem the \"free gift,\" she snatched the card away. I still had no idea what the gift was and tried asking her, but she ignored me.\n\nWhen I ordered my noodles, she mumbled something under her breath, which I didn't catch. Then, she sarcastically raised her voice, asking, \"WANT CHILI AND VINEGAR???\"—a completely uncalled-for response. After my noodles were ready, I asked again about the \"free gift,\" but she just waved me away and took the next customer's order. It turns out the \"free gift\" was a bowl of noodles. The noodles I ordered was $5.80 by the way.\n\nI will definitely not revisit again if she is there.",
      "time": 1723817580,
      "translated": false
    },
    {
      "author_name": "Nigel Mok",
      "author_url": "https://www.google.com/maps/contrib/115348089713238491289/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXoEPqDSuSu2JNdiFS-dHDqsFSlUBi0EEXOPxzm57VO77LTHvkZ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "7 years ago",
      "text": "My SO told me that this place has good noodles so I let her bring me here to give it a shot.\n\nI tried the Slice abalone minced meat noodles and boy does it taste damn good. Favor is very tasty. Not too salty and not too spicy. Just the right amount of spice added. The noodles texture was not over cooked as well. They are quite generous in the minced meat as well as the sliced pork. And surprisingly the liver slices were not smelly or too strong tasting as well. Really enjoyed my dinner here. The Aunty and uncle here are friendly when you greet them hello as well. Definitely recommend trying if you are in the area.\n\nKeep up the good job! I will come here again to eat.",
      "time": 1521202469,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15913406327333753557",
  "user_ratings_total": 38,
  "vicinity": "1 Upper Aljunied Lane"
}