{
  "formatted_address": "161 Ang Mo Kio Ave 4, Singapore 560161",
  "geometry": {
    "location": {
      "lat": 1.3742428,
      "lng": 103.8398796
    },
    "viewport": {
      "northeast": {
        "lat": 1.375667130291502,
        "lng": 103.8411919802915
      },
      "southwest": {
        "lat": 1.372969169708498,
        "lng": 103.8384940197085
      }
    }
  },
  "name": "Character Montessori Singapore",
  "place_id": "ChIJ97RGWsMW2jERi0W-SBNDPPk",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "Digime",
      "author_url": "https://www.google.com/maps/contrib/117760136463850528854/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXSX3FTQgdO5eggeRh2iEMQWo3yx_IdEd1qpOPM41ndHY4DzhY=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Our child has been attending CM since last year. It has been a very positive experience for us as a family. The teachers are all very caring and attentive towards children’s needs. The curriculum is holistic and has a deep focus on character development. That is the reason why this school stood out for us amongst all the other Montessori preschools.\n\nWe celebrated our child’s birthday recently at school and noticed that one boy in his class has special needs, very possibly autism. We observed that this child, although was disruptive and suffered a meltdown because he did not get what he wanted, the teachers dealt with him very professionally. They were observed to be kind, patient, and spoke to him in a calm, and respectful manner. Therefore it immediately dawned on us that this school has something that other schools don’t… which is “heartware”. To my husband and I, no amount of hardware (swanky looking schools) can replace a school with a heart. We will gladly recommend our friends, and family to CM, because preschools who openly embrace inclusivity are a gem these days.",
      "time": 1740822492,
      "translated": false
    },
    {
      "author_name": "Hobart Lee",
      "author_url": "https://www.google.com/maps/contrib/116713669348744319040/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKQAfLPTLOnOz-ufMfFFbnbapts8CbtR5bmEa-INv0VR9Wgpg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "The Founder & Principal of Character Montessori has been very helpful in providing parenting tips, enabling us as parents to nurture our 3 kids in a way that is suitable for each of them. Her passion for developing children shines through in the entire curriculum. The teachers partner us in guiding our children through important milestones such as feeding themselves, toilet training, brushing teeth.\n\nWe strongly recommend Character Montessori to parents who wish to provide a nurturing early childhood experience for their children",
      "time": 1740239315,
      "translated": false
    },
    {
      "author_name": "ivy xu",
      "author_url": "https://www.google.com/maps/contrib/108746888138913117751/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXRFuKPv43oZlPAfCTcfu6nZr89d7rN-sYqefpDwO993s5tpew=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "I strongly advise other parents to avoid this preschool based on my unfortunate experience. After withdrawing my child from the school, I was assured that the refund process would take 8-10 weeks. However, it has now been over SIX months, and I am yet to receive the promised refund. Repeated follow-ups have yielded no results, and the lack of accountability and professionalism has been deeply frustrating. While I understand that issues can arise, the way this situation has been handled is unacceptable. I hope this serves as a cautionary note for parents considering this school.",
      "time": 1734878227,
      "translated": false
    },
    {
      "author_name": "Ophelia Soh",
      "author_url": "https://www.google.com/maps/contrib/104395908969447533727/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWki9oakc1ADVqORyHkBYTBCB2wJHxjuSUJEIg-sJGlNq2oamL5=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "Avoid this preschool at all cost. Never install CCTV as per regulation so unable to verify what they claimed. Breach of security by not performing proper verification on pickup. Delayed in communication on child progress . Giving alot of excuses when asking for withdrawal acknowledgement.",
      "time": 1739709665,
      "translated": false
    },
    {
      "author_name": "Si min Lee",
      "author_url": "https://www.google.com/maps/contrib/112051756334501889728/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK8xtAzs7i8SeeYdO-dqr6HTTB-v7I5NdaEO06ALYq7w_HiZA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Contrary to recent reviews triggered by the Xiaohongshu post on 20/2/25 and Facebook post of alleged 'pinching' 'abuse' and 'no CCTV installed' - of which these posts have all been taken down -, there is in fact CCTV in the childcare centre in question. To the online community, please do verify facts before posting reviews just off social media posts that have no basis or evidence. As a new mum myself these baseless allegations can be extremely detrimental and trigger unnecessary panic and anxiety. Let's wait for the centre to address these allegations proper before jumping to conclusions.",
      "time": 1740111314,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17959303164150564235",
  "user_ratings_total": 13,
  "vicinity": "161 Ang Mo Kio Avenue 4"
}