{
  "formatted_address": "333 Orchard Rd, #05-03 Hilton, Singapore 238867",
  "geometry": {
    "location": {
      "lat": 1.3018202,
      "lng": 103.8367251
    },
    "viewport": {
      "northeast": {
        "lat": 1.303116930291502,
        "lng": 103.8380461302915
      },
      "southwest": {
        "lat": 1.300418969708498,
        "lng": 103.8353481697085
      }
    }
  },
  "name": "Chatterbox",
  "place_id": "ChIJDfcsE5EZ2jERrC6v6Okmdhc",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Tan Jason",
      "author_url": "https://www.google.com/maps/contrib/113941923790308152529/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJnztQK3bzQ0aC-nq2m42UXaXpgeaT2i1ZmjbSdSZSsAczSzg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "This restaurant, nestled inside Hilton Hotel, offers a dining experience that’s both elegant and unforgettable. The ambiance is pure luxury—quiet, stylish, and perfect for a special night out.\n\nThe service? flawless—attentive without being intrusive, with staff anticipating our needs before we even had to ask.\n\nThe food? Absolutely impeccable. Each dish is made with high-end ingredients and packed with flavor. There’s a nostalgic touch to the menu, but it’s elevated in a way that sets it apart from other restaurants.\n\nIt is on the pricey side, but the quality, taste, and overall vibe make it totally worth it. A must-visit if you’re looking to treat yourself to something special.",
      "time": 1746970069,
      "translated": false
    },
    {
      "author_name": "James Teo Ching Wei",
      "author_url": "https://www.google.com/maps/contrib/116760575677334169530/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJV6pGUreULRAuL4PBxTakS-5P7fbZ3PMW0peerNtjWc-ugSA=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "I tried their Heritage Set Menu, opting for the Chicken Rice as my main course. The appetizer and dessert were fantastic, truly delightful! However, the chicken rice didn't quite meet my expectations. While the rice was cooked to perfection and was absolutely delicious, the chicken was a letdown - it tasted quite bland. On the bright side, the service was top-notch, friendly and attentive. Overall, a good experience.",
      "time": 1746671718,
      "translated": false
    },
    {
      "author_name": "Nguyên Nguyễn Ngọc Hà",
      "author_url": "https://www.google.com/maps/contrib/108575296668225029282/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVhaiNNftr5Q6QX5GfO2E2QRBkTqocFeDptYG9fagLAo2IRhw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "The chicken rice dish was delicious, with tender and juicy chicken that stood out as the highlight of the meal. The restaurant itself was beautifully designed and bustling with diners, creating a lively atmosphere. It's conveniently located in the Hilton hotel, right in the heart of the city. However, the service left much to be desired. Despite the upscale setting, it took a long time for staff to respond whenever we had a request, which detracted from the overall dining experience.",
      "time": 1744281086,
      "translated": false
    },
    {
      "author_name": "DR DAVY GOH",
      "author_url": "https://www.google.com/maps/contrib/100178836333366849641/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXgw59O9S7vDEVVAfvnlh8FjGqH7dJNCO1Ny29_mPQYDa7ZKqnxOg=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Located on the 5th floor of the building.\nBest to make a reservation before going. There will always be a constant crowd especially during meal time. Do note the dining time is 90 minutes.\nWide variety of local food, chicken rice and laksa.\n\nService was alright. Could improve.\nThere were 5 of us, initially we ordered 4 bowls of rice. The 4 bowls of rice were served together with 4 bowls of soup.\nThe staff should take some initiatives to serve an additional bowl of soup, since there were 5 of us.\nLater, we ordered additional 2 bowls of rice. This time, despite our additional orders of rice, the bowl of soup was not served at all.\nIt would be good if the staff was mindful of such arrangement.\n\nThe quality of food was good. Bones were remove from the whole chicken we ordered.\n\nThe price was bit high compared to what the locals could get.\n\nOverall experience was still good.",
      "time": 1744966048,
      "translated": false
    },
    {
      "author_name": "K Ed",
      "author_url": "https://www.google.com/maps/contrib/110384716740515406829/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKfcNNRk70bx4dWaAXx8ZibE28HntxGBWGy5r431Y86JTNqKA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Chatterbox Cafe at Silks in Crown Perth, Western Australia\n12 March to 23 March 2025\n\nVery disappointed.\n\n*Rojak (AUD$24)  when it was served had the portion size that would at best fit into a small bowl. The taste was ok. Contained about 4 pieces of cut dough sticks, about 6 x  5 cent pieces of apple, around 5 x 20 cent sized pieces of pineapple, 2 x 20 cent pieces lf bang kwang, about 6 x slivers of wax apple. Flavour wise it was good but not the best.\n\n* Lobster Laksa (AUD$52)  - the presentation was really not good & nowhere close to the picture promoting the dish.  The dish was served luke warm. The thick rice noodle was overcooked & a little gluggy. There was a bit of lobster in it for sure but just bits & pieces of it. Look at the picture, the one I got served is even missing the egg on it. The taste was ok but we can definitely find better Laksa in Perth.  The portion size is very small. The cost of the noodle is really not much & the amount of it was really very small when you consider this bowl costs $52.00\n\n* The chicken rice (AUD$34) was served with a bowl of soup. Whilst waiting for our food, we heard the next table complain to the waiter that their chicken rice was cold & the soup was cold too! 5 minutes later, we were served our chicken rice. The rice was not cold but it really was at best very mildly luke warm. The soup was also luke warm. The portion size of the chicken is fine but the rice was probably on the smaller side.\n\nJust to see if there was a difference in taste I ordered an \"extra bowl of rice\" (AUD$7) and gave specific instructions (in jest) for them to ensure they microved the rice for an extra minute to ensure it was served properly warmed through & hot.\n\nTo be fair, this warmed up rice when eaten with the chicken actually tasted much more flavourful.\n\nOverall compared to other chicken rice outlets in Perth as far as taste and quality is concerned this would be middle of the road for Perth, definitely not the best.\n\nI did ask our senior waitress wuth glasses if the Guest Chef from Singapore was inside and she said yes.\n\nMy conclusion is that if the guest Singapore Chef Liew Tien Heong really was in the kitchen, he should be immediately retired to save his reputation from falling further.\n\nSilks as a purported Chinese Restaurant of the high end nature needs a good review of their operations. How can any good  Chinese chef send out food, let alone rice, that is not hot.\n\nA real disgrace for the visiting chef from Singapore and a big stain on the reputation of Chatterbox Cafe in Singapore if this really is the kind of food being served there.\n\nToday was Day 1 of the Chatterbox Cafe promotion so hopefully they will improve things for the downline guests.",
      "time": 1741818947,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1690581496197230252",
  "user_ratings_total": 1351,
  "vicinity": "333 Orchard Road, #05-03 Hilton, Singapore"
}