{
  "formatted_address": "82 Queen's Rd, Singapore 266774",
  "geometry": {
    "location": {
      "lat": 1.3181765,
      "lng": 103.8067963
    },
    "viewport": {
      "northeast": {
        "lat": 1.319451130291502,
        "lng": 103.8082280802915
      },
      "southwest": {
        "lat": 1.316753169708498,
        "lng": 103.8055301197085
      }
    }
  },
  "name": "Cherrybrook Preschool Farrer",
  "place_id": "ChIJU_TcLQ4a2jERTi16g84SQJY",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Debbie Loo",
      "author_url": "https://www.google.com/maps/contrib/100649163050860812598/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUM3oFrCNTgqkJjOTjOVKfrbLcLVElIZBF2ujciOboLqOl-WD57=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Cherrybrook is more than a preschool, it’s a community and it feels like family! We are blessed to have sent our child there and during this time have seen him grow into a wonderful and fine little man! He loves the teachers here and has many fond memories of their care, dedication, and kindness.\n\nTwo years on, my child still asks to go back and visit the teachers, and when he does, he happily interacts with the younger ones to teach them… a testament to how nurturing this school has been for him! Even after graduation, we continue to maintain friendships with other families here. Truly a wonderful place to grow up in!",
      "time": 1739334427,
      "translated": false
    },
    {
      "author_name": "J G",
      "author_url": "https://www.google.com/maps/contrib/116758617393324534112/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJCQAuEBFbLQl5M8kdya4skNzsSXX8OF8_AF6as9wOTBzHcGQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "We started our journey with Cherrybrook Preschool Farrer in 2020 for our first child. He has since graduated, and we now have our 2nd and 3rd attending the school too. Our experience in the past 5 years has been nothing short of wonderful. The teachers, the community of parents there - all contribute to making the school feel like family. The environment is incredibly wholesome and nurturing, truly seeking to bring out the best in every child - both in character and in academics.\n\nCharacter wise, they follow a virtues education which is really meaningful - empowering each child to grow in virtues specific to his/her personality e.g. a strong-willed child might be guided in his self-control, or a reserved child might be encouraged to grow in assertiveness. My oldest could enter primary school as the best version of himself because of Cherrybrook setting a solid foundation for him in the preschool years.\n\nTheir cirriculum is also holistic. The montessori approach exposes the children to a broad range of knowledge - from math to geography; and the teachers often seek to follow the child's interests, as changing as they may be at different times! The teachers would check in to ask what our child is currently into, to engage them more deeply in the work. The english and chinese teachers there are also really solid - they speak well and are passionate about the language. Our kids all have a love for reading and stories thanks to them. I remember my firstborn once having an aversion to writing chinese characters - and the chinese teacher introduced novel ways of teaching him, e.g. using a small whiteboard instead of paper, so he could erase easily and try again. There are plenty of small gestures like this that the teachers take the initiative to do, to cater to each child and help him/her learn in the best ways possible.\n\nThey also follow a tutorial system where every family is assigned a Tutor. This tutor acts as a liaison between the school and the family - and so much more. Our tutor has journeyed with us so closely over the past few years - understanding each of our children, our family values and dynamics, addressing our needs and advocating for our kids. It's been such a blessing to us in growing us as parents and as a family!\n\nThank you, Cherrybrook, for being a wonderful school!",
      "time": 1745817390,
      "translated": false
    },
    {
      "author_name": "Mel L",
      "author_url": "https://www.google.com/maps/contrib/102853918654672492895/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLFHYaN5W98AYI7PnU8hqjBCJx9U34UQY9ymAEsHEQlXJJH4A=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Cherrybrook is an amazing preschool. We truly appreciate the school’s emphasis on character development through virtues, which enriches our child’s growth beyond academics. The personalized support provided by dedicated tutors to each set of parents ensures that every child's unique needs are thoughtfully addressed.\n\nThe teachers at Cherrybrook are exceptionally caring and devoted, creating a warm environment that feels more like a close-knit family than a typical school. Additionally, the community at Cherrybrook is fantastic, with friendly parents who foster a supportive network where we can all journey together.\n\nOur child has grown so much holistically during his time at Cherrybrook. It’s a wonderful school, and we have no regrets choosing it.",
      "time": 1724935734,
      "translated": false
    },
    {
      "author_name": "E Tan",
      "author_url": "https://www.google.com/maps/contrib/107547395806831746524/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIZ6nN9wJQVCyizfOywS7scxBfSZ1nUf_HqwTHLW1oPjR2cDw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "Cherrybrook is a wonderful preschool, and I only wish I had the opportunity to send my older children there (unfortunately, there was no space available then).\n\nThe Montessori system at Cherrybrook assigns each child a tutor who knows them well and coordinates all administrative and learning matters. This was invaluable for us, as we had one dedicated tutor to address any questions and provide updates on how our child was adapting to school.\n\nOne amazing development was how quickly our child bonded with her tutor, despite her initial separation anxiety. She looks forward to seeing her tutor each day, and they share a special connection.\n\nWe also love witnessing our daughter become a better version of herself every day. Even when faced with big emotions, she tries to calm down quickly. I attribute this to the school's nurturing environment and the influence of the calm, cheerful teachers who effectively teach the children to manage their emotions. Their “virtues” programme is always a great way to model for children positive values both in school and at home.\n\nCherrybrook also organizes many key parent functions to share important information. The last event we attended included a helpful talk on managing difficult moments with our preschooler, and an update on the Chinese curriculum.\n\nAs I told her tutor, I can work full-time and focus on my job because Cherrybrook is the best home away from home. I feel assured knowing she is in a safe space with loving and caring teachers, and I am learning to be a better parent in the process. I highly recommend Cherrybrook if you are looking for the best preschool for your child—it truly is a second home for them. ❤️",
      "time": 1720368222,
      "translated": false
    },
    {
      "author_name": "ignasius joanito",
      "author_url": "https://www.google.com/maps/contrib/104942901211539319433/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKBFaJhdSmzDBVG0fi--34Fzqi5lERB2fn96e1vcCy6loazuQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "Cherrybrook Preschool has been amazing for our family! There are a couple of things that really set it apart from other preschools we've looked at. First, they have these awesome school-assigned tutor who help parents keep track of their kids' development. They also give us updates on what the kids are learning each week, which makes it so much easier to continue their learning at home.\n\nAnother thing we love is how Cherrybrook focuses on personalized character building. It's really helped our kids become more patient and obedient, which has been wonderful to see.\n\nThe teachers are all super kind and attentive, making it a really warm and welcoming place. They also have a tutoring system that gives us fast updates and great tips on how to teach our kids at home.\n\nIf you're looking for a preschool that feels more like a family than just a place to drop your kids off, I highly recommend Cherrybrook. It's been a fantastic experience for us, and I think you'll love it too!",
      "time": 1721538601,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "school",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10826674182377057614",
  "user_ratings_total": 23,
  "vicinity": "82 Queen's Road"
}