{
  "formatted_address": "18 Sin Ming Ln, #01-02, Singapore 573960",
  "geometry": {
    "location": {
      "lat": 1.3579753,
      "lng": 103.8336258
    },
    "viewport": {
      "northeast": {
        "lat": 1.359440780291502,
        "lng": 103.8346923802915
      },
      "southwest": {
        "lat": 1.356742819708498,
        "lng": 103.8319944197085
      }
    }
  },
  "name": "Cherie Hearts Nurtureloft (Sin Ming)",
  "place_id": "ChIJK8booTIX2jER2C4Ou-kUsKQ",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Jane",
      "author_url": "https://www.google.com/maps/contrib/110001895864620348714/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKcYN2EpXBc_B89ib2yHLQKZt_OyoslsiNmGsvtRVF5WZyO4g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Thank you Cherie Heart for giving care and love to my girl especially teacher Nurul and Lin laoshi.\nTeachers and principal are very experienced and if you want someone who can take good care of your child this place is one of the gd centre. They have monthly excursions and monthly dress up day!\nMy girl learned something from every trip!\nWent to museum , horse riding, parks and more!\nShe becomes braver and enjoy the bonding with her best friends!",
      "time": 1732860130,
      "translated": false
    },
    {
      "author_name": "Cheng Earn Siow",
      "author_url": "https://www.google.com/maps/contrib/104700165408371276857/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXgR7HU_X5PcepE4lF5DvCw6e66PtylUE-Jl3SaiG3VBgMGSNw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "We can’t thank the wonderful teachers at Cherie Hearts enough for taking such great care of our little one! Like many parents, we were a bit nervous at first, especially with the common worry that kids often fall sick in childcare. But honestly, that wasn’t our experience at all.\n\nOur baby started at Cherie Hearts when he was just 4 months old, and now at 18 months, we’ve seen so much growth. He’s hit so many milestones, stayed healthy, and has been so happy along the way. The teachers have been amazing—kind, attentive, and always keeping us updated. It’s clear they love what they do, and it shows in how well they take care of the kids.\n\nA special shout-out to Teacher Doris for all the love and care you’ve given! We’ve seen how much our little one lights up around you, and we’re so grateful for everything you’ve done.\n\nA huge kudos to the entire team at Cherie Hearts for being such a significant part of our little one’s journey. We couldn’t have asked for better caregivers, and we highly recommend them to any parent looking for a safe and loving environment for their child!",
      "time": 1733410117,
      "translated": false
    },
    {
      "author_name": "Peach Ang",
      "author_url": "https://www.google.com/maps/contrib/110367331950231731940/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJytusD6N00V27o-6PPq3aK5QkC6ScTMddCpy4IS77e5zFWig=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We are so grateful for Teachers here and especially teacher mei's dedication and care towards my son. He has truly flourished under their guidance. Thank you for creating such a positive and engaging learning and makes learning so much fun!",
      "time": 1742713257,
      "translated": false
    },
    {
      "author_name": "Sheryl Lim",
      "author_url": "https://www.google.com/maps/contrib/107542318242830333605/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWhGwhFqiORapR9HgeZu6UEeH6Y83UJdkt-hZNpC4i2XTpzAXMG=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "My youngest started here at infant care and it was a dream. Our older 2 had attended ifc as well so we have some benchmark but Cherie Hearts exceeded our expectations. The teachers were so loving, updates were given almost daily (which is unheard of) and my son loved it there. We were initially going to move him to Kiddiwinkie @ MacRitchie where my older son was, but decided to withdrew our enrolment and keep him in Cherie Hearts to move on to PG. It was the best decision. While it was mainly the many issues at Kiddiwinkie that led us to pull out (despite the exorbitant fees), we were glad we stayed. Cherie Hearts has a huge space and the children are well taken care of. The principal is very responsive and the teachers are super dedicated and more importantly, they have a very cohesive team that works well. I can give information/instructions to the teacher checking in and I know that this information will be communicated to my son's teacher. They also have many events where parents are invited and you can see the joy in the children's faces. I'm so happy we found such a nice unassuming school for my youngest!",
      "time": 1736068261,
      "translated": false
    },
    {
      "author_name": "Kristy T.",
      "author_url": "https://www.google.com/maps/contrib/116091730824586971020/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJf1jZZdXCJa5p-HZjRYwAToui867ySJZydFjS6shWz8RXtg2E=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Extremely satisfied with the infant care services. We put our boy there from about 10m onwards and we are very happy with how well he has grown! We appreciate the super regular updates (most schools only give weekly but we get daily ones here), and the wonderful educational activities that he is entertained with (they do not just throw the kids into a playpen for “free play”). The teachers are also very sincere. Many thanks to Celine and your staff (especially teachers Shirley, Doris and Shikin)!",
      "time": 1733220893,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11867008012219461336",
  "user_ratings_total": 9,
  "vicinity": "18 Sin Ming Lane, #01-02"
}