{
  "formatted_address": "1257 Upper Serangoon Rd, Singapore 534793",
  "geometry": {
    "location": {
      "lat": 1.3735318,
      "lng": 103.897543
    },
    "viewport": {
      "northeast": {
        "lat": 1.374550330291502,
        "lng": 103.8990024802915
      },
      "southwest": {
        "lat": 1.371852369708498,
        "lng": 103.8963045197085
      }
    }
  },
  "name": "CHIJ Our Lady of the Nativity (OLN)",
  "place_id": "ChIJH7IUoDAW2jEReXDOPLnXAaw",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Person Half-awake",
      "author_url": "https://www.google.com/maps/contrib/112885934836350486019/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUacybtCCHb0QDBxHws24dgASe2_OH71Rcq0bBCCNS7MM9PItY=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "a year ago",
      "text": "As a student in this school, I feel like making some annoymous complaints. Firstly, the students are extremely loud, rude and uncooperative to their teachers. I always hear people shouting and loud chattering near by the main staircase after recess, do the teachers never teach them on how to line up in two's aswell? I find the extra noise quite frustrating and difficult to focus during lessons as I'm easily distracted by noise. Secondly, some students may need to learn some manners as I've witness some of my classmates completely disrespecting and making a fool out of the teachers. Thirdly, I take notice of my fellow schoolmates behavior after classes are over. I see the upper-primary girls whipping out their phones right after class ends taking a stroll around the school while talking loudly on school campus. Another thing I would like to address is public transports. I see a repeating pattern of students from different levels all chattering loudly together on the bus. Sometimes, I might catch sight of some students eating on the bus as well. If your students keep up this behavior, this may ruin your school's reputation and may worry some parents who plan to enroll their children here.\n\n-Written by one of your students, annoymously.",
      "time": 1705075796,
      "translated": false
    },
    {
      "author_name": "Kayla Noelle Koh Rou (Chijsjcs)",
      "author_url": "https://www.google.com/maps/contrib/111283547354906702407/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIMWKoYa7-n5_g9UxlG3yYlcwBTH4EcauKy0VfktkZbPHpn=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Graduated in 2023 !!! This school has a very warm and friendly vibe and I always look forward to coming to school everyday as I get to see all my friends and teachers . The teachers are all very caring and patient . It was bittersweet to leave the school during graduation and I was very reluctant to say farewell to my classmates and teachers .I definitely suggest sending your daughter to CHIJ OLN and the school will accept her with open arms🫶🏻",
      "time": 1713356091,
      "translated": false
    },
    {
      "author_name": "Jack Jack",
      "author_url": "https://www.google.com/maps/contrib/116774046309903500323/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKnGVhfTQk-SRCeKHUjH-iso6TXoMNmwpl0Hyo9fPlNk4zZMQ=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "2 years ago",
      "text": "I was a graduate from 2021. I am currently Secondary Two and I will share my experience.\n\nFor the teachers, most of them are nothing special and are there just to teach. Don’t know if I’m qualified to judge whether they are good teachers or not. All I know is that some of them might just not care about what you do in class, namely Chinese teachers. But if you are a parent anxious to know if the teachers will support the students, I’d say that it is enough to teach your child properly as long as the listen in class.\n\nSchool counselling and support for mental health/disability is nonexistent. Teachers do not think that the severity of our mental health is much to impact ourselves and everyone around us just because we are still single digits in age. Teachers would make students cater and care for autistic students even if they are not even aware of the term “mentally disabled yet”. The same goes for suicidal and mentally unwell students, they push those kids onto other students, expecting them to cater to them automatically. I have started seeing a trend in that school that student problems are always pushed onto other students and are not supported well by the teachers at all.\n\nThe school facilities are alright. Canteen food will spoil you, and I still miss the garlic bread from one of the nicest Aunties there. I heard good reviews of the camp from P3-P6. Since Covid is getting lighter, I do hope your kids enjoy it.\n\nOverall, it is not a horrible school, in fact I think that it is mediocre at best. But if your children are showing signs of lethargy and despair, I recommend you check on them yourself, do not leave it to the staff at OLN.",
      "time": 1676413258,
      "translated": false
    },
    {
      "author_name": "Kayla Wong Kay Ann (Chijsjcs)",
      "author_url": "https://www.google.com/maps/contrib/108894824075744330050/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJwJ_GhjYZ8XBbcWT5HEIqASss4IQ83BcnnTNKSJcl2P0sNeg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I am an alumni from CHIJ OLN and my experience there made the best memories. I recommend sending your daughter to OLN as she will learn how to be gracious,responsible,adaptable,compassionate,honest, appreciative and so much more",
      "time": 1711932028,
      "translated": false
    },
    {
      "author_name": "『 Ace 』",
      "author_url": "https://www.google.com/maps/contrib/101959894376040524864/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVkSj7WuP2cQ3k_J8yeTp3oX_MTFaz4s2u_Re_k9AGnpmHFnEMFDQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 years ago",
      "text": "This school is good if your child is a girl. The facilities are being added on as they are constructing a new class block along with other things. It also has a good affiliated school for secondary ((I might be biased but hey))",
      "time": 1546530751,
      "translated": false
    }
  ],
  "types": [
    "primary_school",
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12394424840089399417",
  "user_ratings_total": 51,
  "vicinity": "1257 Upper Serangoon Road, Singapore"
}