{
  "formatted_address": "501 Ang Mo Kio Street 13, Singapore 569405",
  "geometry": {
    "location": {
      "lat": 1.3740005,
      "lng": 103.8341542
    },
    "viewport": {
      "northeast": {
        "lat": 1.375205530291502,
        "lng": 103.8358172802915
      },
      "southwest": {
        "lat": 1.372507569708498,
        "lng": 103.8331193197085
      }
    }
  },
  "name": "CHIJ St Nicholas Girls' School",
  "place_id": "ChIJ5Z7hkzQX2jERxHMq33vWwsU",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Toon Tran",
      "author_url": "https://www.google.com/maps/contrib/102078641965155497930/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWZj_ozK67YD0vUUpBQSjRzrxoJndFacBNmoJa0ee-_aRn9sWCk=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "CHIJ St Nicholas Girls' School is one of Singapore’s most respected and sought-after schools, known for its strong academic performance, holistic education, and nurturing environment. The school upholds a tradition of excellence, balancing rigorous academics with character development and values-based education.\n\nThe dedicated teachers here go above and beyond to support each student's learning journey, fostering not only intellectual growth but also creativity and critical thinking. The curriculum is well-rounded, with a wide range of subjects, enrichment programs, and co-curricular activities (CCAs) that allow students to explore their passions, be it in the arts, sports, or sciences.\n\nThe school’s values-driven approach is deeply rooted in the CHIJ ethos, emphasizing kindness, integrity, and compassion. This supportive and inclusive environment helps students grow into confident and compassionate individuals ready to make a positive impact on the world.\n\nThe facilities at CHIJ St Nicholas are modern and well-maintained, providing students with ample resources and space for learning, physical activities, and creative pursuits. The school’s beautiful campus adds to the inspiring atmosphere, giving students a safe and welcoming place to learn and grow.\n\nOverall, CHIJ St Nicholas Girls' School is a wonderful choice for families looking for a school that excels in both academic and character development. It’s a place where young women are empowered to reach their full potential and contribute to society meaningfully. Highly recommended for anyone considering a quality education in Singapore!",
      "time": 1730865340,
      "translated": false
    },
    {
      "author_name": "leora sencen",
      "author_url": "https://www.google.com/maps/contrib/103078897811853837880/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUyeYrOXti6yA_XIzkFvKnfDSE89yTxemVJnvRuN04lGwFma3w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "it is an amazing school! i remeber once, during spelling, we heard crashes outside our classroom. we turned and looked at what was happening and to our surprise, it was this cute dragon! we kissed it and hugged it until our teacher forgot about spelling. thank you trhcer!!! i recommend going there cos all the adventures we have such as hatching a dinosur egg, buildjnga portrait of ourselves with dragon scales and more are such fun and thrilling! YAY",
      "time": 1730281363,
      "translated": false
    },
    {
      "author_name": "Kou chan",
      "author_url": "https://www.google.com/maps/contrib/100394147318990270808/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXxLo4gAzjsqMcxFlPet2Dv_WciQ9LI0D8ExOAgEpxHqNqvKXE=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "this school is so awesome!!! I remember on a Tuesday evening, I was wandering the halls around the third floor waiting for my friend when I suddenly caught a glimpse of a big scaly creature! I got curious and decided to follow it. It kept twisting and turning around the endless St. Nicks corridors, and a thunderous stomping could be heard as it made its way into the school bathroom. When I opened the door, a wall of pond stench hit me like a brick. It reeked of fish water and I could make out a soft gurgling of water. I knocked on the third stall three times (mind you, it was the third floor) and asked if Hanako-san was present. To my horror, the door unlocked itself and creaked open. There, I saw a translucent figure; dark green with a spiky silhouette, drinking water out of the toilet bowl. It lunged at me, and it was then I realised, that was the ghost of the old school crocodile! Luckily, the announcement for us to get out at 6:30 was playing. The crocodile vanished and I immediately ran away, swearing to never enter that toilet again.",
      "time": 1724660116,
      "translated": false
    },
    {
      "author_name": "ikanaide",
      "author_url": "https://www.google.com/maps/contrib/112143402210171818645/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWCnne4e_DcMWTEFN3O3F4k8398uAML6pLJkNyecSi_AqCeXU8V=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "an amazing and primary and secondary school! i still remember the days, when i was young and foolish, wandering around the halls together with my cohort… when suddenly, a gigantinormous skibidi toilet blocked our path! “i am hungry and i will eat you kids yum yum yum” skibidi toilet had loudly proclaimed. 40x7= 280 girls and i shivered under his crazed gaze, and just as we were about to be swallowed up, 校长婆婆 appeared! “孩子们，我会保护你！” 校长婆婆 bravely stood up for us, holding an enlarged whiteboard marker as her honourable weapon. “别怕！” we stared in awe and amazement as 校长婆婆 and her 27 crocodiles (who had crawled out of the pond to check out the commotion) beat up the skibidi toilet to pieces. it stood no chance against the mighty 校长婆婆. after that, 校长婆婆 adopted us all and we lived in happiness and harmony\n\nall hail 校长婆婆 🙏🙏🙏🙏",
      "time": 1719500768,
      "translated": false
    },
    {
      "author_name": "Daniel Ng",
      "author_url": "https://www.google.com/maps/contrib/110193778214960753915/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKavDn8BfdyT4OvB13B5j7CB9Y2URt5H3zybUYL1R81oEkFOQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "this is so cool i love this schl altho i remembered once i went to the toilet then i was taking my usual morning poopie then skibidi toilets started banging on my door!!! i was terrified as i alm cried, but thankfully the rly kind students helped me out.. -274 aura for me but +374 aura for them!! they earned their sigma titles altho i am still a beta... i love this schl tho!!",
      "time": 1723817131,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "school",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14250187998467093444",
  "user_ratings_total": 46,
  "vicinity": "501 Ang Mo Kio Street 13"
}