{
  "formatted_address": "16 Madras St, The Daulat by Hotel Calmo, Singapore 208413",
  "geometry": {
    "location": {
      "lat": 1.3047444,
      "lng": 103.8528078
    },
    "viewport": {
      "northeast": {
        "lat": 1.306131130291502,
        "lng": 103.8541139302915
      },
      "southwest": {
        "lat": 1.303433169708498,
        "lng": 103.8514159697085
      }
    }
  },
  "name": "Chilis Pizza",
  "place_id": "ChIJ8VAdLYEX2jERqIDP8JH9cPQ",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Ram",
      "author_url": "https://www.google.com/maps/contrib/113247703719564015453/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIW-Zz0ewODwQ0nussKr_OSge6KBKog0v-uYI0PX_FX2ygRFw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "After visiting the Indian Heritage Centre, we were craving for a good pizza. We found this place while googling good pizzas nearby.\n\nAt first, we were quite lost as to where the place was as we walked past it a few times, but we didn't notice it was still closed. After asking ard then we found out it was located next to a hotel called The Daulat by Hotel Calmo\n\nSo we waited for it to open, and I guess since it was still early, we were the first when it finally opened. Now, you have an option to choose an indoor or outdoor setting. My preference was the outdoor (even if it was by the road), the indoor was just a little too cramp for me\n\nWe proceeded to make an order for the classic of the Chili's Meaty, Garlic bread, and also a drink (in total, it was about $30)\n\nNow we didn't have to wait long before the garlic bread came first, and honestly, when it's like straight out from the oven, most garlic breads are good, and this was no exception. The outside had a bit of crust, but the inside was soft and moist, so it was a good start.\n\nWhen the pizza came after that, I was a bit surprise as I didn't know it was the thin crust kind. For me, I prefer it with a bit more dough to it. The meat on it was definitely generous enough, and it was enough for my partner and I (we ordered 1 large)\n\nOverall, it was a good pizza, and I believe the one that took our order and served was the owner too, definitely a friendly guy 👍",
      "time": 1730258498,
      "translated": false
    },
    {
      "author_name": "alexis cheong",
      "author_url": "https://www.google.com/maps/contrib/113274413252841495963/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVc5PL7l2OPDfQikhNOkRx3sZXHH7kEIWU3XhvtLTIQzDV4Qn4=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "We discovered this halal certified pizza place on accident but it turned out to be the best choice we could have made! Ordered the Chili’s Ocean which is a seafood style pizza and the Chili’s Lover, a mixed meat pizza! Both the dough and tomato paste is handmade which makes it incredibly tasty. The pizza bread was especially soft with the thin crust being perfectly crunchy. With the cheese being soft and stretchy, it was a great pair.\n\nThe garlic bread was soft and soaked in an amazing buttery garlic flavour which filled our mouths with each bite.\n\nThe owners were incredibly warm and the place was a very cosy get up, I’ll definitely come back here with friends and family :)",
      "time": 1721396422,
      "translated": false
    },
    {
      "author_name": "Umar Abdullah",
      "author_url": "https://www.google.com/maps/contrib/117945329029828422975/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLNOqS7T28Y56mHQHGFUEE-uK05WWNEnDKD21vF4SYJ8q2IcA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "Cleanliness & hygiene is well observed at the simple little but extremely cozy place to unwind the day with splendid refreshing drinks and superb pizzas made definitely out of passion and love that takes the mind away from Singapore and transcend to Italy itself.\n\nExcellent service by the thoughtful owners themselves.\n\nAbsolutely a perfect place to chill.  A hidden gem.\n\nAnd yes, it's HALAL!\n\n4.9/5",
      "time": 1717236624,
      "translated": false
    },
    {
      "author_name": "ardhian r (ardhianr)",
      "author_url": "https://www.google.com/maps/contrib/114396642621480256207/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWK1yOMil2oAgMDpOxN7LKVVtD8_WOhAqipXzyGRo8UPy2qwPo=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Food: The cheese pizza is very delicious, the ice cappuccino is very refreshing. Halal certification approved.\nAtmospher: Bright lights. Capacity 6 tables, around 15 people. The cool breeze from the fan and the night air is very cozy. Suitable for couples or families\nLocation: In front of the Daulat hotel by calmo. open to general customers.",
      "time": 1735910762,
      "translated": false
    },
    {
      "author_name": "Suf",
      "author_url": "https://www.google.com/maps/contrib/116921994453991739947/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWtxnx1WcdvhWYq8KYdz9fODcWqeIFaexCAHq-Y7UF5NikTvPPo=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 2,
      "relative_time_description": "8 months ago",
      "text": "Service was amazing. Atmosphere is kinda so-so since it’s a shared space with a hotel, but not to the fault of the business.\n\nAs for the food, we got the sambal chicken. Couldn’t really taste the sambal and the ingredients weren’t really sufficient (you can see only bits of meat), esp for the price. We wouldn’t go back.\n\nIt’s freshly made, so that’s good I guess.",
      "time": 1725783485,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "meal_delivery",
    "meal_takeaway",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17613856945898225832",
  "user_ratings_total": 111,
  "vicinity": "16 Madras Street, The Daulat by Hotel Calmo"
}