{
  "formatted_address": "3 Tampines Central 1 #05-01, #1 Tampines Plaza, Singapore 529540",
  "geometry": {
    "location": {
      "lat": 1.3529566,
      "lng": 103.9427218
    },
    "viewport": {
      "northeast": {
        "lat": 1.354426480291502,
        "lng": 103.9439471802915
      },
      "southwest": {
        "lat": 1.351728519708498,
        "lng": 103.9412492197085
      }
    }
  },
  "name": "ChildFirst @ Tampines",
  "place_id": "ChIJW7OqJhI92jERu6jHTjrbK0o",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "stevenNiT",
      "author_url": "https://www.google.com/maps/contrib/105733495415851186052/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUoPRpDmp3IOkHRp6x2KJ24PEPQZoeMTi4zsZhmGDp8Z37KA1M=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "The teachers are caring and patient to the kids. The school is quite academic focused and they provide apps for children to work on after school to reinforce what they learned during the day. They also have robotics courses for K1 and K2 and one of the team won overall championship in National Robotics Competition 2024",
      "time": 1736262604,
      "translated": false
    },
    {
      "author_name": "Verlyn Tan",
      "author_url": "https://www.google.com/maps/contrib/118366589751308446970/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIaCRFxs0O-qPNuGN-FscwZHroB7DL8InTlS6rj6Qrdr79ZoA=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "10 months ago",
      "text": "I first knew of Childfirst from a friend when I was finding a suitable preschool for my child. Did not regret my choice. The school environment is brightly lit, clean and conducive. The teachers are very warm and caring, and there’s a kitchen within the premise where daily meals are prepared for the children. I really like the curriculum too as there’s good balance between classroom-style and play-based learning. The only downside is that the fees have increased quite a bit.",
      "time": 1721007868,
      "translated": false
    },
    {
      "author_name": "F C",
      "author_url": "https://www.google.com/maps/contrib/115367285750884702753/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKY9AlbfbDUMvqlhI22yA-MdCjmiKfTwEEWW9-klrNyOfaTmA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "My child like this school very much. It is a well-managed school with complete hardware and software. The teachers who have taught here for many years are very caring and responsible. They understand the development status of children of different ages, can look at each child fairly and objectively, discover their strengths, and establish effective communication with parents. The principal is also very patient and understands children's psychology. She can make children trust her and go to school happier, and parents are also relieved. If problems are encountered in school, the principal and teachers will actively cooperate to solve them. The administrative teachers are also very enthusiastic and caring about the children. Having said that, I hope to give some positive references to parents who want to come to this school. I hope the school can continue to carry forward these advantages and get better and better!",
      "time": 1716793899,
      "translated": false
    },
    {
      "author_name": "Peiyan Chen",
      "author_url": "https://www.google.com/maps/contrib/113802519641532652304/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJTJLz9G-7i7fMlmT63X4dRG7mxyU-YBSBqJlM_zgbEdbCRAg=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "10 months ago",
      "text": "Did not do much research but only listed few schools in the vicinity. Childfirst Tampines was the first school tour that I went and I registered my son on the same day itself. I like that they have a conducive and bright environment and also a big and clean kitchen that prepare and cook the kids' daily meals which is not common in preschools as most of them are catered food. The school offer good curriculum and I could see and feel the teachers' genuine love and care for the students. Giving 4 stars as there is limited space for outdoor activities given its location and school fees have increased quite a bit over the years.",
      "time": 1720440415,
      "translated": false
    },
    {
      "author_name": "Wilson Tan",
      "author_url": "https://www.google.com/maps/contrib/101709470077765961141/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKG8kmTXCho1YCo9VCqLyWcCjURdjsEPZplQ-eE4Yv_0rx4XA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Childfirst is a place that we truly have the peace of mind. My daughter is happy at drop off and pick up. Love from the teachers, admin team and even the lovely cleaning staff.    My daughter was truly loved and care by the teachers.\n\nWe left when we moved 30mins drive away. But came back within 2 days because no other childcare comes close in letting us feel assured. The activities and excusions they arranged allow us to always feel connected. Everything is well communicated. Staff like Ms Joanne is always ready to help.  Really the best Childcare for us!!!\n\nThank you",
      "time": 1715342421,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5344606426281519291",
  "user_ratings_total": 21,
  "vicinity": "3 Tampines Central 1 #05-01, #1 Tampines Plaza"
}