{
  "formatted_address": "48 Pagoda St, Singapore 059207",
  "geometry": {
    "location": {
      "lat": 1.2834607,
      "lng": 103.844404
    },
    "viewport": {
      "northeast": {
        "lat": 1.285075530291502,
        "lng": 103.8452254802915
      },
      "southwest": {
        "lat": 1.282377569708498,
        "lng": 103.8425275197085
      }
    }
  },
  "name": "Chinatown Heritage Centre",
  "place_id": "ChIJ3eg6SXMZ2jERCxutt4adUyY",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "N. Gan",
      "author_url": "https://www.google.com/maps/contrib/111536004756755931697/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK56lp302KUVWw6kBONYP7nDrSiF3tCh6nRBL34etXyxxKjj8Nl=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Today was the perfect opportunity to visit the Chinatown Heritage Centre, especially since we missed the soft launch. We had no regrets booking our tickets online and making the visit. Although our reservation was for 3 PM, we arrived earlier, and the attendants kindly allowed us entry.\n\nIt was a quiet afternoon with fewer visitors, giving us the chance to explore at our own pace, read the exhibits, and take photos without obstruction. Our first impression was that the place is well-maintained and clean. It was truly an eye-opening experience to learn about Singapore’s history and the struggles of early immigrants who arrived in Nanyang, hoping to find prosperity.\n\nThis heritage centre is an insightful visit, especially for younger generations, as it provides valuable knowledge about our ancestors who settled here. The centre also offers videos that showcase historical events and experiences. However, visitors should be mindful when walking down the narrow and dimly lit staircase—we chose not to take the lift.\n\nOverall, it’s a highly recommended visit for anyone interested in Singapore’s rich heritage.",
      "time": 1742636726,
      "translated": false
    },
    {
      "author_name": "D C",
      "author_url": "https://www.google.com/maps/contrib/111265975067994461515/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIoj7AZQmbWnyzUsoGlhK52EVg76jYJX6dQ6YkVpmTaTafITg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "4 weeks ago",
      "text": "Pretty fun, well-thought and curated museum that gives you a glimpse of the genesis of Chinatown in Singapore, through the lense of migrant workers, how they lived and earned a living, and how it all set a foundation for the modern yet traditional lifestyle we all know today. Well kept and comfortably air-conditioned. Worth a visit for sure, but I felt the tickets were a bit on the pricey side.",
      "time": 1745226734,
      "translated": false
    },
    {
      "author_name": "Karen Lynne",
      "author_url": "https://www.google.com/maps/contrib/112816287354575390105/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU0FrhNwTMUQOnI6mxw-eurn-aw2HUEPLizgX9pYcTEj-1U2Ns8=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Must visit if you’re in Singapore & if you’re a history & architecture buff!\n\nThe museum is very well designed & maintained & detailed showcasing the colonial & early 21st century history of Singapore immigrants in Chinatown.\n\nHow hardworking & harsh life the people had! YET they endured & some even thrived with wits, really inspired & deeply touched as I am a 2nd generation US Chinese immigrant. My grandparents & parents experienced similar overseas life like the early immigrants of Singapore.\n\nEasily to spend an hour in there as it’s a large exhibition combining 2 townhouses of 3 floors!\n\nAfterwards, the kind staffs recommended the herbal tea shop next door, I ordered a cup of Tummy Care tea, sooo delicious & healthy!",
      "time": 1745400619,
      "translated": false
    },
    {
      "author_name": "Ryan Mullarkey",
      "author_url": "https://www.google.com/maps/contrib/112924460818834159115/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVYM8wsyOsQbWaoybec_YeEBn7C1-6NRvsLZNABZuHfPd2-7U7xYQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Nice facility.  My visit was during the soft opening and there were some technical difficulties checking in a party of 30 with a single pass.  Once that was overcome they realized there was a issue with maximum capacity so we had to wait a few minutes for others to move through.  Aside from these small logistical issues, it was an interesting exhibit and a nice escape from the heat and tourist shops.",
      "time": 1739350954,
      "translated": false
    },
    {
      "author_name": "C",
      "author_url": "https://www.google.com/maps/contrib/108121427451405924195/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUVEFBMqVdde84YgM7RmJUjTlK2YyphjppNJiT0NgrZFZyAG6RYYA=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "The Chinatown Heritage Centre is one of Singapore’s most immersive cultural attractions, housed in three carefully restored shophouses along historic Pagoda Street. It brings to life the rich and complex stories of early Chinese migrants who settled in the area during the 19th and 20th centuries. Through detailed reconstructions of cramped living quarters, tailor shops, kitchens, and street scenes, the centre paints a vivid portrait of the hardships, resilience, and hopes of those who helped shape Singapore’s early urban communities.\n\nBeyond the physical displays, the museum uses archival photos, oral histories, and multimedia elements to offer deeper insight into everyday life in Chinatown — from domestic routines to social struggles. It also serves as a valuable educational resource, preserving an important part of Singapore’s multicultural heritage at a time when rapid development continues to reshape the landscape.\n\nI found the exhibits beautifully presented and deeply moving — a powerful way to reconnect with the past. While admission is a bit pricey and there were very few visitors during my visit, that made the experience feel more intimate and reflective. A definite 5 out of 5 — richly informative, sensitively curated, and a must-visit for anyone wanting to understand Singapore’s roots.",
      "time": 1746636732,
      "translated": false
    }
  ],
  "types": [
    "tourist_attraction",
    "museum",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2761724198440999691",
  "user_ratings_total": 2995,
  "vicinity": "48 Pagoda Street"
}