{
  "formatted_address": "79 Anson Rd, #22-01, Singapore 079906",
  "geometry": {
    "location": {
      "lat": 1.2742752,
      "lng": 103.8456739
    },
    "viewport": {
      "northeast": {
        "lat": 1.275728980291502,
        "lng": 103.8468994302915
      },
      "southwest": {
        "lat": 1.273031019708498,
        "lng": 103.8442014697085
      }
    }
  },
  "name": "Chirogenesis",
  "place_id": "ChIJkfkuvpQZ2jERGUsB8vw-xKg",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Heidi Gempel",
      "author_url": "https://www.google.com/maps/contrib/108211742369751127027/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIoYJyTpXjNrnEpO5LPamOC99CGhmIw3WYckR15jKb823g28g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I am deeply grateful for Dr. Ben and the critical role he has played in my recovery from lower back pain. From the very first consultation, it was clear that he genuinely cares about my situation — not just in addressing my immediate pain (and I had a lot of pain), but in supporting my overall well-being.\n\nDr. Ben goes far beyond standard chiropractic care. He offers holistic advice on general health, tailored exercise routines, and practical rehab tips that have made a real difference in my recovery journey. Thanks to his thoughtful and personal approach, my recovery rate has been much faster than I expected.\n\nEach session with him leaves me with a profound sense of awe of my how I have been created body, soul and spirit and how it all works together. His technical excellence, clear communication, and genuine encouragement make it all possible.\nHe takes the time to explain the “why” behind each recommendation, and I felt assured and empowered to take ownership of my healing process.\n\nDr Ben is a gem 💎! It’s rare to find a healthcare professional so committed to both the science of healing and the desire to understand all of the patient.\nIf you are looking for someone who will not only treat your condition but also help you connect deeper with your body, soul and - yes, your spirit Dr. Ben is the health coach you need.\nHis healing hands and wise counsel greatly impacted my recovery.  I cannot recommend Dr. Ben highly enough.",
      "time": 1743760622,
      "translated": false
    },
    {
      "author_name": "Michael Lim",
      "author_url": "https://www.google.com/maps/contrib/118320561367369396851/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLD3B0VfKung7QmG_YtG8zxH47tCQsT-_dTWFbgXXJvYTca1w=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Dr Tan has helped me tremendously in managing my backaches using both chiropractic therapy and prescribed exercises. Further, he had recently introduced me to kinesiology, which I find it amazing at how my pain and muscle strength could be indirectly controlled by massaging or stimulating muscles that we may not intuitively think they are linked. For example, he treated my tennis elbow by scratching/pinching my upper back muscles.\n\nI would strongly recommend Dr Tan to anyone who needs help with pain management.",
      "time": 1745842498,
      "translated": false
    },
    {
      "author_name": "Isaac Wong",
      "author_url": "https://www.google.com/maps/contrib/101772010436611424880/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWV2EpvXVjpG_BDaBKjDhpONNF-7svA0B1GjzJ8dDCtXSmlIJI=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Dr. Ben knows exactly what the root cause was for my lower back pain. Highly recommend him as he demonstrates professionalism and genuinely cares for his patients.",
      "time": 1734763112,
      "translated": false
    },
    {
      "author_name": "Tan Shi Jie",
      "author_url": "https://www.google.com/maps/contrib/115089999375608031174/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVED4X02hQlVrZv0pxcGdiZmxzHa4D7zOoMKScOzyjtpB6vd9KXDQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "Dr. Ben is professional in his services, and a chiropractor that truly cares about your health, your well-being, and your next generation. Doesn’t just do a simple quick fix with “cracking” but he helps you to understand your body and explain root causes to you (which may be deeper/more than just physical causes). Something you never imagined that you thought it would be possible. But restoration and healing is possible for everyone! My best chiropractic experience so far. 👍",
      "time": 1719983827,
      "translated": false
    },
    {
      "author_name": "Ophelia C",
      "author_url": "https://www.google.com/maps/contrib/101804674467293974800/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXLD4yy-7aknj--53aZrvUg19aVoi4cBOik77rTAAuO3c_j5P8H=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "I met Dr Ben when I was suffering from serious sciatica pain which impeded my ability to perform daily basic activities such as walking, sleeping, and even standing. Dr Ben helped me relieve my sciatica pain and shared invaluable knowledge with me on how to bring down the inflammation levels in my body. He is more than a chiropractor; he strives to heal his patients from inside out. Definitely 💯 recommend him to those who are going through severe sciatica pain.",
      "time": 1728087228,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12160914149920033561",
  "user_ratings_total": 46,
  "vicinity": "79 Anson Road, #22-01"
}