{
  "formatted_address": "1 Jalan Anak Bukit, #B1-55A & #B1-60, Bukit Timah Plaza, Singapore 588996",
  "geometry": {
    "location": {
      "lat": 1.3386556,
      "lng": 103.7788962
    },
    "viewport": {
      "northeast": {
        "lat": 1.340087180291502,
        "lng": 103.7801200802915
      },
      "southwest": {
        "lat": 1.337389219708498,
        "lng": 103.7774221197085
      }
    }
  },
  "name": "Chirashizushi Shou",
  "place_id": "ChIJk2FgfZkR2jER1Gq5ivXgOfA",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Mei Yi Yeap",
      "author_url": "https://www.google.com/maps/contrib/105952848007991953931/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV7ARhIXbHRjIChsBgg2VNvzpq18_CezCjvDpQqswyxj7iIJLLMbQ=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "We have been back here at least 3 times sincr discovering this place about a month ago. Love the rice bowls with thick slices of really fresh fish. Had the grilled collar and it's so juicy, absolutely grilled to perfection. Priced reasonably I'd say the value u get is close to having fantastic japanese rice bowls in Japan. However I'd skip the ramen coz it's just so so. Staff is super friendly and it's no wonder they have 2 outlets within Bukit Timah plaza to meet the demand",
      "time": 1745216522,
      "translated": false
    },
    {
      "author_name": "mucheng lim",
      "author_url": "https://www.google.com/maps/contrib/106065295709466995436/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJh0_VHNUeJbktI4jmK8DytjVFDbCvZ-LZhxPtZhptRwjgC9Q=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "I was pleasantly surprised by the generous portion size—definitely great value for money. Every bite was delicious, with flavors that were well-balanced and satisfying. The standout, though, was the sashimi: incredibly fresh, with a melt-in-your-mouth texture that truly elevated the meal. Highly recommended for anyone craving quality Japanese cuisine.",
      "time": 1745752962,
      "translated": false
    },
    {
      "author_name": "edwin",
      "author_url": "https://www.google.com/maps/contrib/109891667258604967057/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUiq8yL1wWH1ADQv1-rNu49gz9GkKBjEWVAGFFQ-C2Ko_pw7oLp=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "This Japanese restaurant is very popular among the locals here, and it’s no surprise why. The Chirashi Don is priced at just around $20+, offering exceptional value for the quality you get. The fish cuts are extremely thick, fresh, and packed with flavor, making each bite incredibly satisfying. Given its popularity, there’s a chance you may need to wait or queue a little during peak hours, but it’s absolutely worth it for such a fantastic dining experience.",
      "time": 1736645397,
      "translated": false
    },
    {
      "author_name": "Dresden Posęt",
      "author_url": "https://www.google.com/maps/contrib/100555790826902422091/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXqFWPApKXxTJ82AV_OgINopUkjNqwNCM7LlDWWhXa2OXMyQTk=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Extremely underrated restaurant in a humble establishment. Located in Bukit Timah Plaza, this small establishment has a delectable selection of meals. As they have two separate outlets, which is hence why there is enough seating when I arrived there.\n\nThe meal arrived promptly shortly after I ordered. Salmon was fresh, with ice at the bottom to keep it cooling. Wasabi was splendid too, complimenting the salmon perfectly. Then, the beef shabu shabu soup based ramen (something like that for the name) was really perfect, coupled with the rich broth and the egg. You really do get a good meal with what you paid, so I wouldn't say it is expensive; rather, it is commensurate.\n\nOverall, a great restaurant for you and your family or friends to enjoy a meal. Really underrated restaurant.",
      "time": 1740397593,
      "translated": false
    },
    {
      "author_name": "YT",
      "author_url": "https://www.google.com/maps/contrib/116335289933602715039/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVSx0tz-qw4QskVbpYXe4V_L4o3aFYxa3ZZsugq73pGTwz8dHZA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I’ve been to this Japanese restaurant so many times—it’s literally one of my favourite spots! The salmon don is just unbeatable. The price is incredibly reasonable for the portion size, and the salmon is always super fresh. Every time I’ve been, I’ve had an amazing experience, and the quality is consistently excellent. The freshness of the salmon really stands out, and it’s definitely the highlight of the meal.\n\nMy friend also tried the ramen and other dishes, and it was all really good as well! The broth was rich for the ramen, with the noodles cooked perfectly.\n\nApart from the food, the staff are always so friendly and welcoming. They make the whole experience even better, and it’s always a pleasure to visit. It’s rare to find a place that combines great food, excellent value, and friendly service, but this restaurant does it all.\n\nThese are all the pictures from my visit to this restaurant multiple times. If you’re looking for great salmon don or a delicious bowl of ramen, this place is definitely worth checking out. The price, quality, and service make it a must-try, and I’m sure I’ll be back many more times!",
      "time": 1734421525,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17310113987974228692",
  "user_ratings_total": 538,
  "vicinity": "1 Jalan Anak Bukit, #B1-55A & #B1-60, Bukit Timah Plaza"
}