{
  "formatted_address": "1 Maritime Square, #03-54, Singapore 099253",
  "geometry": {
    "location": {
      "lat": 1.264709,
      "lng": 103.820159
    },
    "viewport": {
      "northeast": {
        "lat": 1.266001330291502,
        "lng": 103.8213858302915
      },
      "southwest": {
        "lat": 1.263303369708498,
        "lng": 103.8186878697085
      }
    }
  },
  "name": "Chiropractic Solutions Group HarbourFront Branch",
  "place_id": "ChIJVf_IIOMb2jERamA3qqz7LNc",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Star Star",
      "author_url": "https://www.google.com/maps/contrib/115314758973137610809/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocImaEo0VBhr7YOUmeouXsXAb1Ko8fvuXLD5wql0pmS67hR3EA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I had an excellent experience at Chiropractic Solutions Group HarbourFront Branch with Dr. Sean, who performed a chiropractic adjustment on my 3-year-old son. From the moment we arrived, Dr. Sean was incredibly professional, patient, and attentive. He took the time to explain everything in a calm and reassuring manner, which made both my son and I feel comfortable throughout the process. Dr. Sean’s gentle approach made the entire experience stress-free for my little one, and we left feeling confident and grateful for the care provided.\n\nThe support staff, particularly Esther, was also outstanding. She was welcoming, helpful, and made sure all our needs were met with a smile. The whole team at Chiropractic Solutions Group HarbourFront made the experience seamless, and I would highly recommend them to anyone seeking chiropractic care for children or adults. The level of care and professionalism truly stood out!",
      "time": 1733290786,
      "translated": false
    },
    {
      "author_name": "herny lim",
      "author_url": "https://www.google.com/maps/contrib/107029314196156029145/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUZ446J4D-aPR_XVNMIcXWjfBuPZ1iLS3xkVQOb3OC1LcmJxLsj=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Come here cause review is 5 ⭐️ and it did not disappoint. Special shoutout to Esther and Nat for being such a lovely and welcoming front desk. And of course, Dr. Sean is super knowledgeable and he literally explain all details on nerve spine body and mine connection 🫡 he even advices on what to do day on day to be able to improve my life and sleep quality.",
      "time": 1735553484,
      "translated": false
    },
    {
      "author_name": "KAIZE JIA",
      "author_url": "https://www.google.com/maps/contrib/116328468248209290755/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKNznHKTKXNXGhv6iANwMZRqJALQwAibLrBQRT8ZMJgqmP3Pw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "Highly recommend for those who are suffering from spinal problem.\nDr. Sean is the best chiropractic doctor I’ve ever met!!!!!! He is extremely knowledgeable and patient. He provides not only an efficient treatment, but also gives strong advice for keeping the right posture according to personal situation, such as sitting, walking, working, sleeping and so on. He really knows how to comfort my anxiety.\n\nGetting a better body requires effort from both of doctor and patient. This is some other clinics might ignore. For that, CSG not only fixes the pain, but also provides you a solution. Dr Sean  encourages us and teaches us some recovery exercise according to the treatment progress, to help form a good habit for long term so that the pain won’t come back.\n\nI have been suffering from low back pain because of my L5-S1 disc problem since I was in China 2020. It was healed in April but it was getting worse after I come to Singapore. Then I found Dr Sean here. Before the treatment, when I sit down, it only took half an hour for my sciatic nerve starting to feel pain. After 10 treatments by Dr Sean, I can sit for 3 hours with no any uncomfortable feeling. What a miracle! He pointed out that the main problem is due to the lean of my neck which leads to whole body and spine unbalance, not just because the lumbar disc. I believe that after several months’ treatments and exercise, I will get my life back to normal with a good habit and have a stronger body especially spine.\n\nMuch love and respect to Dr. Sean! Also to Casey, Amy, Jennet and nanna. They are all very sweet people.",
      "time": 1606913958,
      "translated": false
    },
    {
      "author_name": "Carrie C",
      "author_url": "https://www.google.com/maps/contrib/100041284279195448808/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV8U_oQf4-7HHExGnLNARDe3wJnIisinzS4C4Nhis4DP_gz2rrLfQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I've been receiving adjustments from CSG since May 2022, having had struggled with pain, limited range of movement in the left leg and lower back, and occasional numbness and tingling sensations in the limbs, and shoulder/neck aches since I could remember. Before seeking assistance from CSG, I had consulted with physiotherapists and an orthopedic specialist for a year long targeting the nagging pain on the left leg and occasional limited range of movement. Following a friend’s recommendation, I consulted with Dr. Pang and experienced immediate relief after the first adjustment!\n\nWhile there were occasional flare-ups in the first year, they were not as severe as before CSG. Through regular adjustments (beginning with 3 times a week) with Dr. Pang and Dr. Sean, plus daily stretches at home, I gained some strength and flexibility. While it is still advisable to consult with other good fitness/yoga PT for exercises. I now receive chiro adjustment once a week.\n\nFor anyone facing chronic body pains and seeking a better quality of life, you can consider chiro treatment before resigning to a life of discomfort and painkillers.\n\nAnd....Many thumbs up to the ladies who complete the whole wonderful experience —Nat, Amy, and Kath—for their consistently helpful and professional disposition. Thumbs up!",
      "time": 1742199640,
      "translated": false
    },
    {
      "author_name": "Luiz Pessanha",
      "author_url": "https://www.google.com/maps/contrib/115272865271073752565/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWfW8uHsW6Va2q_K3L6mJBY8xe4FpZtytlOIAqEB1XI6Iyl_cmS=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "I highly recommend this clinic! I exercise 5 times per week and sit all day long for work. That caused me lower back pain and this is why I decided to look for a chiropractor. The results have been fantastic! The treatment is very efficient to relieve pain in the short term and to provide a sustainable health improvement. Since the first consultation, Doctor Sean was very helpful on listening to my case, making recommendations and adjusting my body for instant relief. The whole staff is very friendly and professional. I love the positivity of all the team!",
      "time": 1593242879,
      "translated": false
    }
  ],
  "types": [
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15505044336138477674",
  "user_ratings_total": 121,
  "vicinity": "1 Maritime Square, #03-54"
}