{
  "formatted_address": "21 Choa Chu Kang Avenue 4 #04-01/02 and #05-06, Lot One Shopper’s Mall, Singapore 689812",
  "geometry": {
    "location": {
      "lat": 1.384977,
      "lng": 103.7452205
    },
    "viewport": {
      "northeast": {
        "lat": 1.386316430291502,
        "lng": 103.7465489302915
      },
      "southwest": {
        "lat": 1.383618469708498,
        "lng": 103.7438509697085
      }
    }
  },
  "name": "Choa Chu Kang Public Library",
  "place_id": "ChIJ5-Dtl-kR2jERllI9-1NpYVY",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Isabella Ali",
      "author_url": "https://www.google.com/maps/contrib/114957847207496683434/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXQJhE0g7gA8CeHMI5aC-wtHYwDAvB0Cp3hvMlxYVXR8XExuAK6=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "in the last week",
      "text": "I would like to share an incident that occurred during my recent visit to the library on 16 May 2025 1445hours.\n\nI was alone and had just sat down at Level 5 to read a library book when a librarian approached me. She asked if I was waiting for someone, and when I said no, she told me I had to go to Level 4 to read, as Level 5 was the children’s section. I was taken aback, as I was quietly reading in a public space and did not see any clear signage that adults were not allowed.\n\nI explained to her that Level 4 was quite crowded and that I simply wanted a peaceful spot to read. However, she continued to ask me to leave, which disrupted the very peace I was seeking. I noticed afterward that there were several secondary school students walking around Level 5, which made me question why I was asked to leave while they were allowed to remain.\n\nWhile I understand if there are policies in place regarding adult presence in children’s areas, I feel the approach and inconsistency in enforcement were disappointing. The interaction left me feeling uncomfortable and unfairly treated.\n\nI hope the library can clarify this policy and ensure that it is communicated clearly and respectfully to all patrons.",
      "time": 1747388458,
      "translated": false
    },
    {
      "author_name": "William Win",
      "author_url": "https://www.google.com/maps/contrib/113455741713196742765/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVMfEsAPuGmQ3UF8foiOfUdT3hM8R2IjCgYQbNClFBQe06dRUEk=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Recently visited this library after several years of absence and was thoroughly impressed! The library was clean, silent, and calm, providing a peaceful atmosphere perfect for studying and learning. The modern and well-renovated facilities made it a joy to explore. What struck me most was the number of knowledge-seeking individuals who filled the space, all engaged in quiet contemplation or submerged  in their books.The vast collection of books and resources was truly remarkable, adding that Reservation Lockers and Book Return have up-to-date touch- screen interfaces. Overall, I highly recommend  as a haven for anyone seeking knowledge, inspiration, or simply a quiet retreat from the hustle and bustle of daily life.",
      "time": 1716159633,
      "translated": false
    },
    {
      "author_name": "Xoom Too",
      "author_url": "https://www.google.com/maps/contrib/105863133358477079886/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVLRzhuxFKh1jOBQiJLb1bjferwZ-xPRZ7v7ReqgRp2P_uVyh9Y4Q=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "3 years ago",
      "text": "I think that the Choa Chu Kang Library is very spacious, especially when I walked in. Once you walk around the fiction shelves, you’ll notice that there’s this seating area of 6 chairs around this round table. That’s a good place to work on your computers, study, and read.\n\nOnce you see that, just walk towards the window and look left and right, you’ll notice there’s this long table connected to the wall, and multiple people can sit there. That’s a really nice place for reading, studying, and working on your computers. The view is also nice when you look out the window, depending on where you’re sitting though.\n\nThey have this specific Malay section of books, and there’s 3 small sections that are kind of curved in, and about 4-5 people could fit in there. Once you walk a bit farther, there’s this section with teen books, and you’ll have to go down a few steps, but it has a really nice section.\n\nOnce you’ve passed the teen section, you’ll see stairs going up. If you go up those stairs, you’ll see the children’s section. First you’ll see the family and parenting section; then to the right, you’ll see the children's books.\n\nOverall, I think the Choa Chu Kang Library is nice and spacious, and has a good selection of different books. Nice area for sitting. A good place to read, study, and work on your computers.",
      "time": 1643164195,
      "translated": false
    },
    {
      "author_name": "Kinnari Bhosale",
      "author_url": "https://www.google.com/maps/contrib/101817898871108461540/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWBIiuPMekDr74ctXh0fKg4O_LsVh5V1Sdt6Dqiw2UUk7bBi2Az=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Beautiful and peaceful place. It's really huge and offers different kinds of seating space to work & read in silence. The children's library on the last floor is a gem. An entire floor is dedicated to children offering a reading space, small play area and computer library. A must recommended especially to parents of little ones.",
      "time": 1737341982,
      "translated": false
    },
    {
      "author_name": "2mymisc",
      "author_url": "https://www.google.com/maps/contrib/107626469449475816625/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLl4hUGpAIyV0sW6T-GDFaeKcgGj1twUAxQZ7MAuhy7R9fbkQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Library was just newly renovated in 2021 and now features many indoor plants and even a hydroponics display. Navigation is a little confusing but ample selection for children and teens. Many nice seating areas too. Great place to bring children to have a books day out, but prepare a carrier or bag for the piles of books everyone wants to borrow 😆👍",
      "time": 1639969739,
      "translated": false
    }
  ],
  "types": [
    "library",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6224371969421038230",
  "user_ratings_total": 225,
  "vicinity": "21 Choa Chu Kang Avenue 4 #04-01/02 and #05-06, Lot One Shopper’s Mall"
}