{
  "formatted_address": "10 Telok Blangah Cres, #01-151, Singapore 090010",
  "geometry": {
    "location": {
      "lat": 1.2778441,
      "lng": 103.8197434
    },
    "viewport": {
      "northeast": {
        "lat": 1.279226230291502,
        "lng": 103.8211943302915
      },
      "southwest": {
        "lat": 1.276528269708498,
        "lng": 103.8184963697085
      }
    }
  },
  "name": "Chung & Ee Medical Clinic",
  "place_id": "ChIJNUdVdVQb2jERhJequCHl5Kg",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Harini Manimaran",
      "author_url": "https://www.google.com/maps/contrib/111678398541008201437/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW4C279EdANTZVmVLolofH_Egs2K2IEWB_oeBUrJmHuRMFTdm8Jcw=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "a week ago",
      "text": "Doctor is good, however the reception staff/assistants on the contrary, are very rude and do not give enough information and proper replies. It is a part of their job description to be polite to patients especially elders who might not be able to comprehend information well. Honestly if Dr Chung wants to improve his clinic, he has to educate his staff to be more professional and interact with patients with consideration or he should replace them.",
      "time": 1747108475,
      "translated": false
    },
    {
      "author_name": "B",
      "author_url": "https://www.google.com/maps/contrib/111410330030701782424/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWJxKV0KhIn6w2trt1aFB_gi1t4AckyYcpJkGcCKu5zV1IyE0tfyQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Recommendations by a friend of mine for my weeks of post flu persistent cough. Cough especially is a nightmare, I had not have a good night since and it’s taking its toll on my mental clarity. The nurses, which I read from earlier reviews got negative comments- I am new and first time to this clinic I would say at start they are more aloof, and the mannerism they speak may not be the norm societal expected gentle ‘mi see’ tone but I would like to be fair to say- they are still professional who gets their job done- registrating for me and taking my BP before seeing Dr. And a grandma w walking difficulties walked in for a vac jab and one of the nurse hurried to ask her to sit down and instead of going to the room, she brought the jab for her to be done at the general area. I think there is still compassion. I have no bad comments about them, in fact when I was out to collect meds- it was mutual courteous exchange of convo (keyword here is: mutual) and we even chatted saying that the wave of flu and cough and wish each other good health.\n\nDr Chung, not to be missed. He is patient and detailed in explaining the possible cause for my irritation and cough. Asked for my medical history, whether I was on any long term medications. I was thankful for the experience. I have taken my meds twice today and not heard a cough. I just hope this goes well through my first night w Dr Chung’s meds 🙏🏻🙏🏻🙏🏻",
      "time": 1740496285,
      "translated": false
    },
    {
      "author_name": "Jenny Wong :D",
      "author_url": "https://www.google.com/maps/contrib/110510912663927086457/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX2fupe7Nhf5oEk8ccq2GxUIPQE8Izl-3zBaNS0kjdD3qDSFVWsjQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Dr Chung was very patient and actively responding to my endless queries and concerns as it was my very first time visiting him. His receptionist Cheryl was also very courteous and friendly. I will definitely continue seeing them as a regular doctor from now on.",
      "time": 1743761153,
      "translated": false
    },
    {
      "author_name": "Rafeek Ahmed",
      "author_url": "https://www.google.com/maps/contrib/102707697358976798722/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLg0ljU-YnMGMHlYy32PVgG7tYmKYAry8TtqCv5Sos0SeBAzw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Just want to give a sincere thanks to Chung clinic.\n\nI have been visiting Dr Chung for close to 3 years. He has been monitoring my BP and my medication. Recently I had some chest discomfort but was releuctant to go for further tests. Dr Chung advised me to go for CT scan which I didn’t want to. I opted for a referral to heart centre for me for a follow. Before referral, he advised me to take an ECG at his clinic. The first reading was not good. He informed me that there is a high chance of a blockage. I was not able to accept this.\n\nI asked to take ECG for a second time. He kindly obliged and the results were the same. I followed his advise and the next day went for further tests and found out that I had a severe blockage and did angioplasty. Not to mention that my ECG at Mount Elizabeth was also normal. The cardiologist asked what is the issue as my ECG is normal. Then I showed the readings taken at Dr Chung. Then we went for further test.\n\nI am really grateful and thankful that my condition was diagnosed early thanks to Dr Chung.\n\nReally Thanks.",
      "time": 1734489130,
      "translated": false
    },
    {
      "author_name": "Raudhah R.",
      "author_url": "https://www.google.com/maps/contrib/105542519948341946220/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU1aDkme7rM_qW49bhykSLEBLX3ZEzkhk-e4qsioomvoFAV7IQ_=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Register was fast . Waiting time is approx 25 mins . Doctor Chung is a knowledgable doctor - his advice and solutions . However , its slightly on the higher price range . Clinic is super clean !! 💯 recommends Chung & Ee Medical Clinic .",
      "time": 1654919925,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12170104026056791940",
  "user_ratings_total": 73,
  "vicinity": "10 Telok Blangah Crescent, #01-151"
}