{
  "formatted_address": "30 Raffles Pl, #03-03 CIMB Plaza, Singapore 048622",
  "geometry": {
    "location": {
      "lat": 1.2841089,
      "lng": 103.852015
    },
    "viewport": {
      "northeast": {
        "lat": 1.285292530291502,
        "lng": 103.8529903302915
      },
      "southwest": {
        "lat": 1.282594569708498,
        "lng": 103.8502923697085
      }
    }
  },
  "name": "CIMB Bank - Raffles Place Branch",
  "place_id": "ChIJX5n9SQkZ2jERsf6WJHcOpsI",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Cindy Low",
      "author_url": "https://www.google.com/maps/contrib/114465778572271544634/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLv9mqI0ekiC4hJ8j5a7MTM4fZ_iUy7sR3HBLhC5Psj0M3dEw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Outstanding Service from Sonia – A True Asset to the Bank\n\nI would like to commend Sonia for her exceptional service and professionalism. From the moment I stepped into the branch, Sonia greeted me warmly and handled my banking needs with efficiency, clarity, and a personal touch. She took the time to explain every step patiently, ensured all my concerns were addressed, and made the entire experience seamless.\n\nFrom my chat with Sonia, she enjoyed her work greatly at CIMB Raffles Place thus she can exhume happiness in serving customers.\n\nIt’s rare to encounter someone so dedicated, knowledgeable, and genuinely customer-focused. Sonia’s attentiveness and courteous demeanor reflect very well on the bank’s commitment to excellence. I truly appreciate her support and highly recommend her service to anyone seeking a smooth reassuring process.",
      "time": 1746672664,
      "translated": false
    },
    {
      "author_name": "Mingwang Zhang",
      "author_url": "https://www.google.com/maps/contrib/103836050895013132978/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVqyH1JgtOCnYF14oAKFxB9920Mi9uH-7CvyDX7fHz1He_mLVc=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "I had an absolutely amazing experience at CIMB, thanks to Doris Leung and Emily Tan. I arrived at the branch after office hours, thinking I might have to come back another day. But to my surprise, Doris welcomed me warmly and stayed over two extra hours to help me sort out multiple banking matters. Her professionalism, patience, and dedication were truly eight-star service!\n\nEmily also stepped in to assist with form-filling and made the whole process smooth and efficient. They even offered me bottled water while I waited — such a thoughtful touch.\n\nI’m genuinely grateful for their help and impressed by the exceptional service. CIMB is lucky to have such outstanding staff. 墙裂推荐！\n\nOn behave of Maria",
      "time": 1746446102,
      "translated": false
    },
    {
      "author_name": "Yhasodha",
      "author_url": "https://www.google.com/maps/contrib/107608599753441184478/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ3DpLz2ulnqX3TjUmwAzqYmptADT0labS_KHfYHFxmKjNWAg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I had a wonderful experience at CIMB Singapore thanks to the exceptional service provided by Sonia. She were friendly, patient, and highly knowledgeable, making the entire process smooth and hassle-free. She took the time to explain everything clearly and ensured that my transaction was completed efficiently.\n\nI truly appreciate their professionalism and dedication to customer service. It’s rare to find such attentive and courteous staff these days. Kudos to Sonia and the team at CIMB Singapore for setting such a high standard!\n\nI’ll definitely continue banking here and highly recommend their services to others.",
      "time": 1740625289,
      "translated": false
    },
    {
      "author_name": "Yu Cindy",
      "author_url": "https://www.google.com/maps/contrib/113914836202707593721/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLDwQ6Z1hn1u5Wve7FGK25ZUAlc_z1zl6kZo1F_Wz6PaV08fA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I’d like to sincerely thank Sonia for her outstanding assistance with my Malaysia account opening. She was incredibly patient, knowledgeable, and made the whole process smooth and stress-free. Her professionalism and friendly demeanor truly made a difference. I'm grateful for her support and impressed by the high level of service she provided.",
      "time": 1744777108,
      "translated": false
    },
    {
      "author_name": "Wong Alice",
      "author_url": "https://www.google.com/maps/contrib/108820623604134039657/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKH78tl344O7-Zmdu8-CBen-OGHz0hyJimQ582Me2a1HYKS=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "I had a truly wonderful experience at CIMB for open a saving account provided by Sonia. Her professionalism, coupled with her genuine kindness, made me feel very well taken care of. Sonia took the time to explain everything clearly and made sure I was comfortable and confident with every step. It’s rare to encounter such thoughtful service",
      "time": 1745902079,
      "translated": false
    }
  ],
  "types": [
    "bank",
    "finance",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14025913994369760945",
  "user_ratings_total": 923,
  "vicinity": "30 Raffles Place, #03-03 CIMB Plaza"
}