{
  "formatted_address": "8 Marina View #21-00 Asia Square Tower 1, Singapore 018960",
  "geometry": {
    "location": {
      "lat": 1.279232,
      "lng": 103.8514473
    },
    "viewport": {
      "northeast": {
        "lat": 1.280404230291502,
        "lng": 103.8522211802915
      },
      "southwest": {
        "lat": 1.277706269708498,
        "lng": 103.8495232197085
      }
    }
  },
  "name": "Citibank International Personal Bank (IPB)",
  "place_id": "ChIJAQDA7xEZ2jER86M2MdzBAh4",
  "rating": 2.1,
  "reviews": [
    {
      "author_name": "Yeo Yiheng",
      "author_url": "https://www.google.com/maps/contrib/108898537422223701758/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjULeujXL3OoJx21uIM2J7LEkHEh8RmlYAu3y71eRHNBfeV07N1R=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "Pushy telemarketers, saying no once to their offering wasn’t enough. They still tried pressing for reasons why we are saying no. Horrible card security, always experiencing fraudulent charges not just myself, but my family members as well.\n\nAvoid this bank.",
      "time": 1738736441,
      "translated": false
    },
    {
      "author_name": "Pet City",
      "author_url": "https://www.google.com/maps/contrib/110377073178031024299/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJT-S6wseljXJfgoTigL_NWQvRURVMT46XolnHRaP_t6gkjBQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "Citibank SINGAPORE does not even deserve this one star, the staff is horrible, they do not respond in time when we make a request to transfer funds, they unnecesarily block our accounts and make it hard for us to transfer funds, to make an account active from inactive it takes 3 weeks of begging. When the account is finally active I realize that their internet banking does not allow us to transfer funds internationally, it seems the only way to transfer funds internationally is to request your RELATIONSHIP MANAGER to do so and if you get a horrible one then goodluck making the transfer because it may take several weeks for a simple bank transfer. I am transferring all my funds out of citibank and into uob they seem to have a better interface for people who have an international profile. Useless people, useless bank, hope you will change the way you work . . .",
      "time": 1738801773,
      "translated": false
    },
    {
      "author_name": "Ariel S (A)",
      "author_url": "https://www.google.com/maps/contrib/118332819141237657469/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJxWoH7skudgkxNgOpEZ-zeABWGaPY_uoPYrUzwV1bCO1kcnQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "The most unprofessional bank in Singapore, please try to avoid it if you can.\n\nAfter approaching by citi credit card sales (who is extremely friendly) on street several times, my husband decided to apply for a credit card from Citi bank. The whole process is a nightmare due to their unprofessionalism. For instance, they did not know how to properly verify applicant’s immigration status on ICA’s website and accused that my husband’s LTVP is invalid. This made us stressed and worried for the whole afternoon. In the end, it turned out that it was their mistake and I had to spend time calling them to teach them how to use ICA’s website properly.\n\nAlso, when they first sent us a rejection email, we were fine, just leave it. But afterwards they kept annoying us by calling my husband at trading hours (he is a quant trader so not having his phone with him when trading ) to request extra documents. We did cooperate after receiving their call during bathroom break and send every document as soon as possible. All the documents requested by them including bank statements, payslips and employment letter clearly indicated that my husband’s financial background is far beyond  their minimum requirements. After this whole process, they called this afternoon to reject him.\n\nA quick calculation, the total amount of time we wasted from dealing with their unprofessional employees has cost us  several thousand $$ based on our hourly pay.\n\nGood luck for Citi to keep your clients.",
      "time": 1731578377,
      "translated": false
    },
    {
      "author_name": "ZK M",
      "author_url": "https://www.google.com/maps/contrib/106420342153245250545/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUJ9NtfUeVw1tROFsFQD4E37lmxGHWWksEJZV-kAnu1fuBIUllxfQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "Highly recommend avoiding this bank. From experience with Citibank has been extremely disappointing. Recently, the customer service provided by Relationship Manager has been inadequate, with frequent mistakes and poor communication. Whether you have CitiGold or Citi Private Client banking, the service quality is consistently subpar. Additionally, there is no clear complaint procedure, and clients receive no compensation for inadequate service or service interruptions, which can be quite costly.",
      "time": 1730632530,
      "translated": false
    },
    {
      "author_name": "abhishek bansal",
      "author_url": "https://www.google.com/maps/contrib/102373073132356489766/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXjzbNt78_Wxpv1uUH8x02xeedO2F4WXlcKvaJ0JdVHeST3K5p3yw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "Do not go with this if you arent in SG\nThe app UX is horrible . it is super slow with low spread of products.\nTo add  to it, customer support is only on SG helpline and expect to be on hold for 30+ mins if you want to talk to customer support.\nComing to fees, the trading fees are insanely high when a lot of brokerages are moving to 0(or near 0) trading fees. they claim to have no fees beyond a certain balance but then the custody charges start to kick in\nI am looking to move off the product as soon as I can.",
      "time": 1733718814,
      "translated": false
    }
  ],
  "types": [
    "bank",
    "finance",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2162503922553889779",
  "user_ratings_total": 83,
  "vicinity": "8 Marina View #21-00 Asia Square Tower 1"
}