{
  "formatted_address": "450 Bukit Panjang Ring Rd, Block 450, Singapore 670450",
  "geometry": {
    "location": {
      "lat": 1.3844554,
      "lng": 103.7725817
    },
    "viewport": {
      "northeast": {
        "lat": 1.385756680291502,
        "lng": 103.7739105802915
      },
      "southwest": {
        "lat": 1.383058719708498,
        "lng": 103.7712126197085
      }
    }
  },
  "name": "Citikids Edventure Pte Ltd",
  "place_id": "ChIJiY94o58R2jERnlaryPwiTh4",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Li Yin Tan",
      "author_url": "https://www.google.com/maps/contrib/117767411887060292986/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLxhr7VoJmA8YZ1NCipDIY7ywcIJ-byLpNu_aoHHmzxq-B8r0Y=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "This Pg school is wonderful for all the right reasons!\n1. the PG teachers Nana, Hazel, Lee, Em, and Daze are pleasant, genuinely kind and regularly update us on our child's well-being without being asked\n\n2. Principal Nur is always prompt in her replies, respectful and friendly in her approach. She is always able to relate to our concerns and consistently meet the need of us parents. This was especially helpful at the initial phase of our daughter settling in as it took her 3 weeks to adapt.\n\n3. Dinner is prepared and given to our children before pick-up. This is a huge convenience for us as there is one less task to do after a busy day in the office and rushing home to settle our little one.\n\n4. I like the regular lovely school pdf reports, videos shared of their teaching materials that allows us to play for our daughter to watch back again. There are also lots of activities for the children and we get to bring home their artwork on a regular basis, every one to two weeks.\n\n5. I also like how they celebrate the various celebration days in the school like diwali with the hanna and food options which introduces the different cultures to young children. On Halloween day the entrance was well decorated too. Creative and good effort from the school.\n\nOverall the school system and curriculum is well organised and our daughter started making friends amongst her peers. Best of all they use fan and open air environment in the school, my child didn't fall sick during her time in school.",
      "time": 1702425384,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2183721338415044254",
  "user_ratings_total": 1,
  "vicinity": "450 Bukit Panjang Ring Road, Block 450, Singapore"
}