{
  "formatted_address": "268 Orchard Rd, #07-01/#08-01, Singapore 238856",
  "geometry": {
    "location": {
      "lat": 1.302693,
      "lng": 103.836805
    },
    "viewport": {
      "northeast": {
        "lat": 1.303897480291502,
        "lng": 103.8380746802915
      },
      "southwest": {
        "lat": 1.301199519708498,
        "lng": 103.8353767197085
      }
    }
  },
  "name": "Citi Wealth Hub",
  "place_id": "ChIJ8-UYtxoZ2jERh1QgUc2DCCo",
  "rating": 3.2,
  "reviews": [
    {
      "author_name": "JAY CHUA (蔡戔倡)",
      "author_url": "https://www.google.com/maps/contrib/103744688691222903141/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXEF3uEXYS7bQmZhDlwsuQi4uTvCP7LQqseOZ1JsgJyn16zHjPikQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "Poor Service from Citibank:\nCitibank provided poor service to my family. In 2023, we decided to cancel our Citibank card, but the bank kept calling us about loan interest and repeatedly asking us to continue their services.\n\nIssues with Card Expiration and Cancellation:\nOur Citibank card expired in September 2023 and could no longer be used. In October 2024, we called Citibank customer service at 6225 5225 to request the cancellation of the card. During the call, we updated them with our new address as we had moved to a new HDB. However, Citibank sent mail to the wrong address. We only discovered this error today, 8 December 2024, when we called customer service again.\n\nPressure to Reactivate the Card:\nIt appears their goal was to persuade us to activate the card to continue using it. After the credit card expired, we were unable to log in to the app, view statements, or make payments.\n\nUnfair Late Payment Charges:\nDespite being unable to access the app, we were charged an additional $100 for a late credit card payment. The inability to pay due to app inaccessibility added to our frustration.\n\nLack of Clear Communication:\nUnlike other banks that email statements with attached PDFs, Citibank sent emails without statements. This left us unaware of the amount due, resulting in additional charges without our knowledge.",
      "time": 1733748368,
      "translated": false
    },
    {
      "author_name": "Alison Bickham",
      "author_url": "https://www.google.com/maps/contrib/116124893594331013307/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVoUS0blDKwt2reUEdWYFHofVEDM73d7DvRxN8zcvYspQybokip=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Pleasant space and level 7 feels like you’re in Gardens by the Bay’s flower dome. Good for meetings and having a relaxing cup of tea. They also serve mocktails at level 8.",
      "time": 1657873710,
      "translated": false
    },
    {
      "author_name": "Helen Chang",
      "author_url": "https://www.google.com/maps/contrib/105129963195643522056/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUkq9xY3zjqZ-d-XMbixqkzKRfNHdISHJNgNvkHdYZIYfcAzaZtcw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Just let clients stand at the front desk while the staff processed tasks. We have to stand there the whole time while waiting for the staff. It’s not even a place for standing.\n\nSaw several other clients’ personal IDs just lay in front of us on the edge of the front desk without any protection of clients’ card or information. It’s quite an eye-opening experience actually.",
      "time": 1743187333,
      "translated": false
    },
    {
      "author_name": "Dimitri Byrnes",
      "author_url": "https://www.google.com/maps/contrib/105270240693881073594/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJgWe-KCO_o_cQg8_gVT33spNJb3LDbk6xWIPwsMPaUzhogqA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 2,
      "relative_time_description": "2 years ago",
      "text": "The place is nice if you plan to chill out but not talk to your banker and get best banking service.\n\nCoffee is not bad and the barista is more customer-centric than the core banking service.\n\nCitibank used to be top tier service. Now you’ll have to wait 30-45 minutes even if you booked an appointment with your RM. Not unless your purchasing funds then they will be on time.\n\nCitibank, what happened?\n\nLove the coffee and choc.  Though, am not banking with Lavazza.\n\nNo need to post nice pics about the place, other reviewers have already done a great job at it.",
      "time": 1671161448,
      "translated": false
    },
    {
      "author_name": "Charlyn Siaw Wee Ong",
      "author_url": "https://www.google.com/maps/contrib/108529800085997463666/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIHWH5swFsDv3f4MYkL4kGXiytYI_gU52JPSSw7MfmmKAFc1Q=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "Continue the Citi credit card at your own risk!\n\nIf I can give -5 star review I would go do so!!\nHorrible bank service and customer service! It’s act like a scammed banker to me!\n\nMy Citi credit card is expired and I do not wish to continue nee Citibank credit card with them, so I wanted to pay for my last statement! However, I have problem log in to the Citi app due to my Citi bank card expired and need to activated the new card to log in.\n\nI had called them a months ago for the last statement and the customer service ask me to activate the new card so that I can view my statement, I express to them I do not wish to continue with  Citi credit card anymore cause of their bad service and irritated by keep calling me ask me turn my statement to loans service with some interest on top of that which I told them I do wish to do so, but they can keep calling a few times although i already expressed I do not want it. The customer service say okay then they will send me the last statement thru mailing to my new address only in 3 to 7 days because they cannot send thru email which is very ridiculous, other bank can send a pdf statement but they cannot to do that! So fine, I waited a month they did not send me.\n\nAfter a month later, they send me email and sms regarding my latest statement without any statement in pdf attached and amount! Hello! I ask me pay for my statement without telling how much? how can I pay? Due to their very irritating phone call customer service that wasting my a lots of time I decide to write in to their email, their email customer service WORSE ask me to activated my new card again or otherwise calling their 6225 5225 customer service and repeating the same things situation again!\n\nThey ask me to activated the new card which I do not want to do so! Cause if I activated it I had to call their customer service to deactivate again!\nI do not want to activated cause this is like hassle for me when comes to deactivating the card! I had a bad experience do not successfully deactivated the card last year which is why I give up and waited for the card expiring! This is sound like a scammed service from their credit card service! So simple things just tell me how much I need to pay and statement send thru email or mailing to me but they cannot to do so, only can do and view on apps! But comes to deactivated the card service they make it like a scam cannot do thru apps need call to their customer service again to wasting my time and vet thru and transfer multiple the calls  to the right customer service which wasting my precious time to do it again! Super frustrated till I really had to express again and again I do not wish to do so and last they agreed to tell me the amount for my last statement with additional late payment charge! So I think they purposely to do so so that they can pile up the late statement or make me forget about it to earn the money from the late payment charge!\nAfter some argument they agreed to waive the charge, but in the meantime they ask me pay full amount and they refund me after that to my new card! Which is sound like they forced me to activated their card! So, to all please sign up Citi credit with your own risk!\n\nWrong story cut short, they agreed they will notify me the arrangement amount thru sms and 2 days later the customer service will call again to tell me the exact amount for the last statement! I shall see and waited what stun they will to do after 2 days!\n\nUpdated: this bank scammer declined my waived cause they still want me activated the card to reflect on the next statement instead, see photos! U guys can continue with them  at your risk!",
      "time": 1734569822,
      "translated": false
    }
  ],
  "types": [
    "bank",
    "finance",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3028815667259266183",
  "user_ratings_total": 32,
  "vicinity": "268 Orchard Road, #07-01/#08-01"
}