{
  "formatted_address": "3 Temasek Blvd, #01-418, Singapore 038983",
  "geometry": {
    "location": {
      "lat": 1.2946672,
      "lng": 103.8577925
    },
    "viewport": {
      "northeast": {
        "lat": 1.295988030291502,
        "lng": 103.8586921802915
      },
      "southwest": {
        "lat": 1.293290069708498,
        "lng": 103.8559942197085
      }
    }
  },
  "name": "Clarks",
  "place_id": "ChIJUZ8cpagZ2jERQJHDwLFNOvw",
  "rating": 3.9,
  "reviews": [
    {
      "author_name": "Rahul Chawra",
      "author_url": "https://www.google.com/maps/contrib/117518318552645778414/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUHgK9Mgu1_FFPovtKu57nfwVxZrKf5UP1TCWKpO4X7GUFTvy6R=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "6 years ago",
      "text": "If you care about good quality leather, perfect stitches and finishing touches, softness and good fits, Clark’s is the brand to go for. It’s not how an upmarket personalized and hand crafted shoe place would be. But it’s outstanding amongst the branded choices that’s available. They have a flagship Clark’s Originals store at Paragon as well. It’s the only one in Singapore and have some great shoes there as well. Got the boat shoes here after trying timberland and sperry. If you see and try out the boat shoe here, you wouldn’t buy the other two at all. It’s class apart. This begins a long relationship I’ll have with Clark’s for sure",
      "time": 1530967272,
      "translated": false
    },
    {
      "author_name": "Jason Lim",
      "author_url": "https://www.google.com/maps/contrib/105077761621672750125/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLhI9V-QxiLvqVs3Iqyzd2UkiIBAKuef0f-tAwBhTvR3mz4Dg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Wow my first time to clarks (a UK brand) here, after recommended by my friend as she mentioned she bought alot from this shop. I personally have a close to flat feet so most of my office footwear got wore out really fast (probably due to the way I walk and handle the shoe too). Been through many brands.. such as hush puppy, bata (worst), aldo and many other brands which i just can't recall off hand. Reason I dont stick to a specific brand was really I couldn't find one that last long enough..\n\nHere I am trying at clarks and I have to say I am really impressed with this young lad (staff name is hairul azhar). Not saying he is super knowledgeable but he has the right attitude, customer service and patience to go through with me the shoe related questions, tips on maintenance and cheapest package I can get (for example atome payment method).\n\nI am a shoe noob plus lazy but honestly after his advice, I am gonna properly take care of my new clarks leather shoe by regularly maintaining them at least once fortnightly. Plus the atome further deducts final price ny $10 and allows 3x instalment. Perfectly interesting and most importantly no credit card required. Just debit card and singpass to connect cause of instalment I think.\n\nIf you look at one of the pictures containing my old shoe you would realize how jia lat my old shoes were (not even more than half year.. wth right). I wouldn't praise clarks to the max now but I do like their service staff, environment and quality. Let's see 1 year from now if the same shoe I bought (rsp $170+) see if they can last my harsh foot conditions! 😁😄",
      "time": 1639378227,
      "translated": false
    },
    {
      "author_name": "JH Lin",
      "author_url": "https://www.google.com/maps/contrib/101965389331114794567/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXiij78z6N4LlnyS00BpVlJEvggBr3F8hDXzbiYVPJeNnU5NCF-=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "8 months ago",
      "text": "Bought 2 pairs of work shoes on the Shopee sale. They sent me 2 loafers - entirely different models in different sizes.",
      "time": 1725501981,
      "translated": false
    },
    {
      "author_name": "Vincent Song",
      "author_url": "https://www.google.com/maps/contrib/108236507897366912349/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK4tjZjGOWUQeYKS4J7lVMKjH-PNU-P6F0kA7y6GCXjrHp1Mw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "10 months ago",
      "text": "Don't bother wasting your time purchasing from their online store. Made my purchase and it's been a few days with no updates. Had to email to ask them status then they replied saying it's out of stock and to wait for a refund 7 to 10 working days. I wonder how long I have to wait further if I didn't bother to email them. Goodness!!",
      "time": 1720508074,
      "translated": false
    },
    {
      "author_name": "Ace S",
      "author_url": "https://www.google.com/maps/contrib/103835678236621461119/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJrsXcVyOO7nny9YLswD4fyRWXXgZHdEoBd_5p0Bc8GMQrVWg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "9 months ago",
      "text": "Bought a pair of sandals not so long ago at this store. Service was OK but the shoes were not. Very disappointed at the quality of the shoes. At the price point, I expect the shoes to last longer. I haven't even wore it 10 times and the strap gave way last week. I emailed the store via their website but didn't get any reply from them at all. Not even sure if they had received the email. Certainly won't be buying another pair soon.",
      "time": 1723369919,
      "translated": false
    }
  ],
  "types": [
    "shoe_store",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=18174924672045650240",
  "user_ratings_total": 38,
  "vicinity": "3 Temasek Boulevard, #01-418"
}