{
  "formatted_address": "224D Compassvale Walk, #12-603, Singapore 544224",
  "geometry": {
    "location": {
      "lat": 1.3887428,
      "lng": 103.8986055
    },
    "viewport": {
      "northeast": {
        "lat": 1.390131480291502,
        "lng": 103.8998353802915
      },
      "southwest": {
        "lat": 1.387433519708498,
        "lng": 103.8971374197085
      }
    }
  },
  "name": "Classical Guitar Lessons Singapore",
  "place_id": "ChIJySXKCrYX2jERR5gLMLmEGsw",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Zhipeng Hao",
      "author_url": "https://www.google.com/maps/contrib/115370788232649115090/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK49Xqmro2HWaWVM1ckcfESIop6ubSo26SyzPs3mRTI-JHY5Ns=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "It has been 18 months since I started learning classical guitar with Dedrick. The experience was really nice and I also progressed as we expected. If you would like to learn classical guitar, no matter face to face or online lessons, I could guarantee that you could get what you want from Dedrick.\n\nI will also continue my guitar learning with Dedrick, and the music will cheer us.",
      "time": 1742974550,
      "translated": false
    },
    {
      "author_name": "Sam Teo",
      "author_url": "https://www.google.com/maps/contrib/105651773487322843836/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVu73APJh8Bzsv_wJSRBEi5-ZRLGhF-aFfevDxa3TzyVxPKQ3XN=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Dedrick Koh is an excellent guitar instructor with a highly effective teaching system that helps students improve as quickly as their time commitment and diligence allows. He also has a wealth of knowledge on all musical styles and periods, and a way of imparting it such that the student acquires not just technical skill but also develops their musicality while respecting the conventions of each musical style. Both in-person and zoom classes are available and prices are very reasonable.\n\nHighly recommended for anyone who wishes to achieve their potential in the pursuit of the classical guitar.",
      "time": 1731808349,
      "translated": false
    },
    {
      "author_name": "Caroline Woon",
      "author_url": "https://www.google.com/maps/contrib/117392423640107392864/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI-uYtfBqIm3xi5_wrQwAImGF7QgDA7_hnPZTMdfjjUla_c=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "I began lessons with Dedrick just over a year ago with no experience with classical guitar. With his guidance, I have just passed Trinity Grade 4 with distinction and classical guitar has become such a big part of my life.\n\nDedrick is meticulous and patient in his teaching. He is very observant of fine details of technique and sound and I really appreciate his clear feedback on how to improve. I look forward to our lesson every week and always leave feeling encouraged to keep working on playing more musically.\n\nDedrick also makes sure to discuss the historical context and music theory of the pieces we play. He has a great ability to express musical concepts in a way that is relatable and inviting and makes me curious to know more. The pace of learning has also been just nice, challenging but not overwhelming.\n\nDedrick’s studio is well-equipped and a very pleasant learning environment. Though I prefer face-to-face lessons, I found he is able to conduct lessons over Zoom just as effectively and I’m glad to have the option when I can’t meet in person.\n\nI highly recommend Dedrick as a teacher, it is clear he has a lot of experience with all types of students and has carefully provided for all aspects of the learning experience.\n\nThanks Dedrick! This instrument has given me so much joy.",
      "time": 1728114304,
      "translated": false
    },
    {
      "author_name": "Lu Ruiling",
      "author_url": "https://www.google.com/maps/contrib/103485840940633360259/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJUozMo5VzUj3vKm2r25_u5orD7HDN1Hqpw9hmF0VoM7H-QNw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My son only started guitar lessons from Teacher Dedrick in March this year till now. He has improved alot since Teacher Dedrick took over, and he recently scored a Distinction for his Grade 3 exams. Teacher Dedrick is a teacher who sets high expectations from his students and always encourages them to do their very best. Thank you, Teacher Dedrick for your patience and encouragement.",
      "time": 1714910894,
      "translated": false
    },
    {
      "author_name": "Amy Soh",
      "author_url": "https://www.google.com/maps/contrib/111246599883154216068/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKRvFYfBwNo5g44JZKKiGobfKjX3IEPZfuIPKtXILHJUlOkGQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "I find Coach Deddrick has great passion for excellence in coaching his students to play the guitar outstandingly.\nKnowing how to play a song well goes beyond playing every single note correctly with both accurate tempo and timing. Coach Deddrick always goes the extra mile by introducing the writer, providing some background information about the time period in which the song was written, analysing the dynamics of the song and reviewing the themes behind the song in detail. These have helped me to understand the song’s writer intention in an in depth manner and how he or she wants the musician to feel while playing the song. Consequently, every song feels much more ‘alive’ to me, making my experience of learning and playing each song much more enjoyable.\nCoach Deddrick is patient, understanding and knowledgeable. He always makes time to explain the nuances of the song to his students. Furthermore, he develops and equips his students well by teaching the techniques and skills of playing the guitar. Skills, techniques and knowledge - Coach Deddrick has taught me a lot, and I can say for certain that I have truly enjoyed every single one of his lessons immensely.\nI really appreciate Coach Deddrick as a teacher and will highly recommend him to anyone who has an interest in learning the guitar.",
      "time": 1599931572,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "school",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14707213464041658439",
  "user_ratings_total": 50,
  "vicinity": "224D Compassvale Walk, #12-603"
}