{
  "formatted_address": "10 Sinaran Dr, #10-24, Singapore 307506",
  "geometry": {
    "location": {
      "lat": 1.3211072,
      "lng": 103.8443378
    },
    "viewport": {
      "northeast": {
        "lat": 1.322496880291502,
        "lng": 103.8457472802915
      },
      "southwest": {
        "lat": 1.319798919708498,
        "lng": 103.8430493197085
      }
    }
  },
  "name": "ClearSK Aesthetic Clinic (Novena)",
  "place_id": "ChIJv-s_XecZ2jERllr_-juJK_Q",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Luke Eeles",
      "author_url": "https://www.google.com/maps/contrib/113759255608551544103/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJv3zpEdY-BW11GeRn5wCoAeA0-nhoB8uRYAf3QLrYWnIMP5A=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "a week ago",
      "text": "When you’re spending thousands of dollars on a treatment (when there is so much competition) you would expect a minimum level of customer service. A simple hello, how are you, etc. goes a long way. But to be so transactional is so off putting. Even replies to queries on WhatsApp go unanswered. It’s like once you’ve paid for the package, a level of customer service goes out the window.",
      "time": 1746794516,
      "translated": false
    },
    {
      "author_name": "Wendy Ng",
      "author_url": "https://www.google.com/maps/contrib/105994343938244654226/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLSI2Xdb-INJBay19G0zY0JukJaZFDLGYpCVqzkR1WbhH6sjA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "I had a great experience at ClearSK Aesthetic Clinic at Novena. The staff and Victoria Lim were friendly, professional, and made me feel very comfortable from the moment I walked in. The clinic is clean, well-maintained, and the treatments were explained clearly. I saw noticeable improvements after just a few sessions, and I really appreciated the personalized care from Dr Shiau. Highly recommend this clinic for anyone looking for effective and trustworthy aesthetic services!",
      "time": 1746536302,
      "translated": false
    },
    {
      "author_name": "Joanne Lim",
      "author_url": "https://www.google.com/maps/contrib/115037373963388975017/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVplq-TBReB-xtbSqwFq6eDguILrdlpQEcoK5DgBwCNsYuq48R1Tg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Utterly  Disappointed with their service !\nOverturn is so high … Good skilled  Doctors  such as Dr Nicole and Dr Stella have since left  !\nDidn’t even have the courtesy to drop a message to inform … only when I reached the clinic then I saw the Dr in today is not Dr Stella !\nOnly when I asked  then I was told she has left !\nPut me in stranded positions not only today  .( that I can’t change the appointment since I m there )\nit was many repeated mistake leaving me no choice but to accommodate iwhichever dates they give me !!\n\nIt’s clearly displayed  that the management don’t value the customer’s feedback at all !\nNo wonder their overturn of staff is so high !\n\nI really hope the management value their good staff …. Sales consultants and the therapist !\n\nThis clinic has the most ridiculous feedback link each time after our appointment!\nQuestion entails on sales performance of the Dr .. whether during the process of treatment the Dr address on the latest treatment etc ! Dr should be concentrating on the treatment and not doing sales\n\nWhether the sales consultant explained the new products etc ….\nIt will be quite annoying if so … typically so hard sales!",
      "time": 1742970747,
      "translated": false
    },
    {
      "author_name": "Jessie Chang",
      "author_url": "https://www.google.com/maps/contrib/114965532205377118597/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWlJZCEOWbW6-nIizomyg9_XF2P1e5n2fZx8GHEHV3bygmsqOsT=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Sure! Here’s a 50-word Google review:\n\n“I had an amazing experience at ClearSK. The staff is professional, friendly, and made me feel at ease throughout my treatment. The results exceeded my expectations—natural and beautifully done. The clinic is clean, well-equipped, and the service is top-notch.",
      "time": 1740131641,
      "translated": false
    },
    {
      "author_name": "Annie Ho",
      "author_url": "https://www.google.com/maps/contrib/111846206442229715803/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLMmXgGS4aAAEsQoVlwW9H-BtLye2Zx8LtkFeRaO1G14GXzOQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Update as of 20 feb:\nUntil now NO response from ClearSK after more than 3 days of appointment booking request. Sent to 2 or 3 different WhatsApp number but zero response. No number or whatsoever to call to make appointment. CLEARSK to contact me IMMEDIATELY upon seeing this.\n\n------\nI share the same BAD experience as Evelyn (another customer who left a review) that when purchasing the packages, I was assured and assured that backend clearsk will extend the package so long we visit or buy new packages. And just a few days ago, i suddenly received a WhatsApp message that all my packages have expired and was given just a mere 1.5months to clear everything before the expiry date of 31 mar 25, or convert my balance to something else with 20% off. All along i was not informed about expiring packages and even when log in to clearsk website, there is absolute no trace of past purchases and any expiry dates. Clearsk now decides to drop this bomb on me (and not only me as my husband and friend who are also clearsk customer all received the same text message) and it is utterly unacceptable. Tried messaging them to make an appointment and yet no reply for 2 days. Utterly horrible service and bad management. I will NEVER sign anything with them anymore and no one should.",
      "time": 1740041333,
      "translated": false
    }
  ],
  "types": [
    "spa",
    "beauty_salon",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17594307259960089238",
  "user_ratings_total": 319,
  "vicinity": "10 Sinaran Drive, #10-24, Singapore"
}