{
  "formatted_address": "100 Orchard Rd, #02-52/56 Concorde Hotel & Shopping Mall, Singapore 238840",
  "geometry": {
    "location": {
      "lat": 1.3007391,
      "lng": 103.8423779
    },
    "viewport": {
      "northeast": {
        "lat": 1.302192130291502,
        "lng": 103.8436321802915
      },
      "southwest": {
        "lat": 1.299494169708498,
        "lng": 103.8409342197085
      }
    }
  },
  "name": "CLUB RUMOURS",
  "place_id": "ChIJPV7nlq8Z2jERR-ddJbWqFPs",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "Marie Nuelvi Pecho",
      "author_url": "https://www.google.com/maps/contrib/117764356734580041973/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXZ6Jzhbp6tUUGrg_qRljvt7eBvfwnppucATRkN8SHv46hlpmTQ=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "3 months ago",
      "text": "My friends and I went for a staycation at Sentosa during the Chinese New Year holiday. We got hungry, so before entering Rumours we asked if they had rice. Since they confirmed they did, we decided to go in for some rice and grilled food.\n\nUpon entering, we chose a high table, but there were only three chairs for our group of four. I asked the server if she could get us another chair, but she told me to ask other guests myself since they had taken the extra chairs. I let it slide and ended up requesting a chair from other diners!! We also asked for table lamps and she replied in a pissed tone that we have to wait! I don’t mind waiting but I guess she was not really that accommodating!\n\nOnce seated, the server informed us that we had only 10 minutes to place our order. We couldn't find rice on the online menu, so she offered to assist us. My friend jokingly said, \"Oh, Ms!! Rice please—four rice!\" because, of course, there were four of us, and we were starving. That was the main reason we had chosen this place!\n\nHowever, when the food arrived, she handed us only one cup of rice and said the kitchen had already closed. The rice was warm and looked freshly cooked, so we asked for more, but she refused, saying kitchen is closed and there was no more rice. She even brought out the chef to confirm that only one cup was available. We had ordered a lot of meat specifically to eat with rice, only to find out they couldn’t serve any more!\n\nIn the end, four of us had to share that one cup of rice. If we had known they wouldn't serve us enough rice, we wouldn't have dined there in the first place. We were already hungry, and by the time we realised what was happening, we were just plain “hangry”! The service could have been much better—clearer communication and a little effort to accommodate guests would have made a huge difference. Kati tried service recovery but not I guess it was already too late!",
      "time": 1738466857,
      "translated": false
    },
    {
      "author_name": "m arul",
      "author_url": "https://www.google.com/maps/contrib/111996190421678245458/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWl1nN3Ns_WO23EzgbqP4JyCqguC6PIV9OtfuLLGzRuyGsk8lLK=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Rumours is hands down one of the best clubs I have ever been to. The atmosphere is electric, the music is always on point, and the staff are friendly and welcoming. The drinks are reasonably priced and there are plenty of options to choose from. The dance floor is always packed and the DJ knows how to keep the crowd moving all night long. I have had so many memorable nights at Club Rumours and I can't wait to go back again soon. If you're looking for a fun night out, I highly recommend checking out Club Rumours. You won't be disappointed!",
      "time": 1726197866,
      "translated": false
    },
    {
      "author_name": "Manghala Roopini",
      "author_url": "https://www.google.com/maps/contrib/111903355134742212607/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWX9BA9IHTalH7mkIBco0R1_aGoVVJoJ8uILp8bDcM-hXcsDuJFTg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Rumours is one of the best clubs i have went ! Its the first club i go to and till now it never fails ! Very happening !! Afforable prices for the bottles/jugs.the owner and the staff are really friendly . The dj's too are happening they know how to make the crowd enjoy too ! Too many memorable nights at CLUB RUMOURS ! Cant wait to go back again soon!! I highly recommend everyone to go to CLUB RUMOURS ! Their promotions are reasonable too!! AS ALWAYS NEVER FAILS ,REASONABLE PRICE !! I LOVE RUMOURS",
      "time": 1726207251,
      "translated": false
    },
    {
      "author_name": "Mirul",
      "author_url": "https://www.google.com/maps/contrib/105312800147981918011/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXVPgMObWxJeejTPHvjf9uy-ss2UxPRGEtEUXsDRkvmDOoi2w59=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Awesome Experience! Music was good . Bouncers was on point to spot for reckless behaviours .  There were thugs being aggressive and bouncers sent them out . No room for violence in the club . Definitely feel safe to go there ! Much appreciated. Will definitely return .",
      "time": 1676948324,
      "translated": false
    },
    {
      "author_name": "paresh marathe",
      "author_url": "https://www.google.com/maps/contrib/110735779518424452699/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLSNBUcZNlpkbGGrbdckEfTZhVXPGga1TY5KanxMpPEZF63QA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "We were a group of 03 friends who entered this night club by paying cover charge of 70 S$ each totalling to 210S$ plus 5 S$ as extra fee for credit card charge.\nOn entry they promised us a complimentary drink of grey goise vodka\nBur when we entered they served us sminroff vodka to which we objected.\nTo this the whole staff and their bouncers got wild on us\nPlz avoid going to this club as they are just cheating Singaporean public\nWe should have read their reviews befire entering\nAll the reviews are bad\nA third grade club that too in heart of Singapore is just unbelievable.\nA country known for its high law enforcement standars should certainly look into such scandalous and cheap behaviour by such establishments",
      "time": 1703358742,
      "translated": false
    }
  ],
  "types": [
    "night_club",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=18092273298046838599",
  "user_ratings_total": 42,
  "vicinity": "100 Orchard Road, #02-52/56 Concorde Hotel & Shopping Mall"
}