{
  "formatted_address": "1J Cluny Rd, Singapore 259607",
  "geometry": {
    "location": {
      "lat": 1.3168818,
      "lng": 103.8183526
    },
    "viewport": {
      "northeast": {
        "lat": 1.318182530291502,
        "lng": 103.8196659302915
      },
      "southwest": {
        "lat": 1.315484569708498,
        "lng": 103.8169679697085
      }
    }
  },
  "name": "Cluny Food Court",
  "place_id": "ChIJWRRo0hwa2jERcWa2eYItLFQ",
  "rating": 3.8,
  "reviews": [
    {
      "author_name": "Xian You Lim",
      "author_url": "https://www.google.com/maps/contrib/103392631745003539210/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV_guFjFXC6-zyKdvfZ4adkWjjpSd7E_1yvPzkRZDk-TwNeVF-n=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "A \"high class\" food court that deserves more attention. There's Western, Chinese and Indonesian cuisines here, all managed by restaurant quality chains. Pricing is surprisingly competitively mostly. Serving sizes are mostly generous. Char Siew noodles were really savoury despite it's color, and the fried rice had a rich and flavorful taste. We had a sumptuous meal here!",
      "time": 1648879231,
      "translated": false
    },
    {
      "author_name": "Fun n Relax",
      "author_url": "https://www.google.com/maps/contrib/111024955489201951226/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXgyqUhz_sjfa_jF8dj0HyMNZCLB3gbcTO798G16QhTDSU0rNr9zA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "2 years ago",
      "text": "I was dying to fine a food court that is chill, not crowded, clean, in the green nature. And wonderfully Cluny Food Court hits all the points.\nWe only tried the Italian stall this time. Food was presented classically and served the purpose. Pizza Margarita was at the sweet end but pleasant.",
      "time": 1671748018,
      "translated": false
    },
    {
      "author_name": "Glenn Wong",
      "author_url": "https://www.google.com/maps/contrib/111266038196750069636/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU6x8NSicnP-dqBTPcP7OCzqE01vgXFOxPLdBjXN7IRhYBY1jWh=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "3 years ago",
      "text": "A nice new little food court in the midst of the botanic garden area. Very airy and spacious and not too crowded. Some shops only open in the evening though. The food is decent but very pricy. Good for a simple meal if you do not want to travel far after a round of walking or taking. Otherwise, there are better places in this area for meals.",
      "time": 1640067981,
      "translated": false
    },
    {
      "author_name": "Xin Hao",
      "author_url": "https://www.google.com/maps/contrib/101038177603319548234/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU6c44XsILjRE2Islw02Z6jqIpGV_4urvZ0lGOy57c-ErkANHqe=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Cluny Food Court is the first-ever food court by Les Amis Group, providing all-day casual dining right in the heart of Singapore Botanic Gardens. Overall it is an affordable, relaxing and well-ventilated dining destination within an urban oasis environment. They have a few tenants within the space - local delights such as Mee Rebus, Chicken Curry, Nasi Lemak. Italian fanfare (Pizza, Pasta). Ayam Penyet, Satay, Seafood, Hong Kong Congee, Barbecue, Wanton Noodles with crisp, juicy wood-fired roast meats. All these are concepts brought in by Les Amis. For those who want a budget-friendly hawker meal, this is a great destination, especially after your stroll along Botanic Gardens.\n\nThe nearest MRT station is Botanic Gardens. You would need to walk about 1km. For those who drive, there are ample parking spaces just opposite the food court (open air and not sheltered). I tried the Nasi Ayam Penyet for $6.50 - comes with a very hearty platter of crispy smashed fried chook with fragrant chicken rice, cucumbers and robust sambal. Also tried the signature Char Siew and Roast Pork platter (all grilled in house over hardwood fire!) with Wanton soup from Laifaba Express.\n\nLast but not least, the most amazing aspect and my favorite is the cashless payment ONLY concept. - via Visa, Nets, Mastercard, AMEX, and PayNow. Environment is also kept very clean with wash basins around and very friendly cleaners (thank you so much).",
      "time": 1636619771,
      "translated": false
    },
    {
      "author_name": "Benjamin Millar",
      "author_url": "https://www.google.com/maps/contrib/115021262746852080558/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW7WcnbfbFSd666W7UJwQRGqhaM3LxwdaXv6ovErXMJO2583QjJJw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "6 years ago",
      "text": "A hawker-like food center within the botanical gardens.  The prices are very reasonable but the selection a bit limited as there is only two food vendors and a drinks stall.  There is seating under a roof where you can shelter from the occasional downpour and have your lunch.  There are toilets close by and fans overhead to stir up a bit of a breeze in the Singapore heat.",
      "time": 1545160259,
      "translated": false
    }
  ],
  "types": [
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6065272836572210801",
  "user_ratings_total": 360,
  "vicinity": "1J Cluny Road"
}