{
  "formatted_address": "20 Mandai Lake Rd, #02-10 Bird Paradise, Singapore 729825",
  "geometry": {
    "location": {
      "lat": 1.4087805,
      "lng": 103.7801995
    },
    "viewport": {
      "northeast": {
        "lat": 1.410064680291502,
        "lng": 103.7814952802915
      },
      "southwest": {
        "lat": 1.407366719708498,
        "lng": 103.7787973197085
      }
    }
  },
  "name": "COLLIN'S® Mandai Wildlife West",
  "place_id": "ChIJb43jCZ4T2jERiFI1He2DQLI",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "John Leow",
      "author_url": "https://www.google.com/maps/contrib/116641880786684356476/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUG0EF3VhanKWz8hZWRk6EBRYwtugOJ_H7n3DzPGq10BSc7es3itQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Wonderful dining experience on a Monday evening after river wonders. Price is higher than Aston’s but food quality feels like two tiers up.\n\nI get the feels a lot of thought has gone into everything, the food presentation, meat texture, theme of cutlery, furniture, music and ambience.\n\nAs for service, the staff were kind enough to bring the baby seat for us and entertain our request to provide some hot water to heat up the baby food.\n\nI guess because this place is still quite new, so everything was pretty new. Except the aircon outlet above my head was dripping water and the pepper sauce got a little monotonous.\n\nOther than that, I am very satisfied with the dinner experience.",
      "time": 1739801475,
      "translated": false
    },
    {
      "author_name": "JoAnne PeaceMind",
      "author_url": "https://www.google.com/maps/contrib/112790632682151761914/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX-Z0sEclSXcBR4kNvzdaLZLZZsZ0_f8uFXrAVnQRqbbDqmESTXMQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Came to only eat salad while waiting for my aunt to do her “QingMing” visit.  This was the nearest restaurant I found. Ambience is nice and quiet, on Sunday morning.\n\nTips for the restaurant, to have kids meal for free when purchase 2 main course, like this more parents will dine in. Give drawings to kids, use cute cutlery.  It’s a waste that a Sunday when so many parents bringing kids to Bird park yet this restaurant isn’t doing as good as its neighbor beside.\n\nGiving out cute balloons to all kids can also bring positive attention to parents.\n\nHope this restaurant can stay long here. See my photos for more detailed information. If you looking for job, I have post it here too.\n\nDo give a thumbs up if my message benefits you.  I don’t earn anything here, it’s purely for my own and friends to read up. Cheers!",
      "time": 1743472373,
      "translated": false
    },
    {
      "author_name": "iROX Li",
      "author_url": "https://www.google.com/maps/contrib/110218405804737045036/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXwNQGNUC3wOoHY9pv_uD70He3G87AJ6EVUlPHcoih_LpsPdsO2=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "The food is not bad, but could be better. The pepper was a bit too soft. The Szechuan pepper for the spaghetti is a brilliant idea but the taste could be stronger. BTW, the beer promotion is great. $5.8 for a full pint, love it!",
      "time": 1742876349,
      "translated": false
    },
    {
      "author_name": "LP Pua",
      "author_url": "https://www.google.com/maps/contrib/113241051085659633004/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVJat0H-xuRcFQ5fZT0JkY6ObyUNLgL0WoknObSDkfn6wl6eZJnmQ=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "We dined at this restaurant on the 3rd day of CNY 2025, and it service was prompt, and we ordered through a QR code. The prices seemed higher than at other branches, but this was expected as it is located in a tourist attraction area. We had the CNY special—Grilled Chicken Chop with Wagyu Beef, and Chicken Chop with Roast Riblet. The beef was outstanding, the chicken chop was average, and the riblet consisted of just two ribs and needed the sauce to enhance the flavor. The mushroom soup that came with the set upgrade was also good. Overall, it was a lovely environment to dine in with relatively good food, albeit at slightly higher prices.",
      "time": 1738312439,
      "translated": false
    },
    {
      "author_name": "Richard Lau",
      "author_url": "https://www.google.com/maps/contrib/101673940051100677706/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWeVJ90s4rBMg6O2G99ew_ldsaGSHhfgcF6aliFTJ-GHXrjKHVrmg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Love their BBQ here! It has been a long time that I never come back, but it never fail me. BBQ beef steak, just amazing. The perfect tenderness that I ordered medium cook. Soft inside and crispy on the surface area. Little bit of crust, makes it smells so good. It comes with mushroom sauce, and black pepper sauce. Personally I like the mushroom sauce more, they really put a lot of mushroom slices in the sauce, match perfectly with the saltiness and the aroma of the beef. They serves beer here too. Perfect combination beer and beef!",
      "time": 1740142789,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12844411191681176200",
  "user_ratings_total": 335,
  "vicinity": "20 Mandai Lake Road, #02-10 Bird Paradise"
}