{
  "formatted_address": "111 Somerset Rd, #03-10 TripleOne Somerset, Singapore 238164",
  "geometry": {
    "location": {
      "lat": 1.3001685,
      "lng": 103.8372952
    },
    "viewport": {
      "northeast": {
        "lat": 1.301313180291502,
        "lng": 103.8384902302915
      },
      "southwest": {
        "lat": 1.298615219708498,
        "lng": 103.8357922697085
      }
    }
  },
  "name": "Common TCM Clinic, Somerset Orchard",
  "place_id": "ChIJPQLARsQZ2jERWnNpFQpjt4Q",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "emily ong",
      "author_url": "https://www.google.com/maps/contrib/115122158458853957202/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLoU2XgHERAZjg3BO2YlIZxZKKo7KzCozOsTpxTDkfhBHT2rw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "I am very impressed with  Physician Lim's skill and effectiveness. I had been suffering from a bad frozen shoulder for five months and saw several other TCM physicians without much improvement. After just three sessions with him, my condition recovered by almost 80%. Though the acupuncture treatment was painful at times, I could see instant improvement the next day after each session. He is highly focused on addressing the root pain directly and ensuring good recovery. I’m truly grateful for his patience, consultative approach, and effective treatment.",
      "time": 1745635463,
      "translated": false
    },
    {
      "author_name": "C.R",
      "author_url": "https://www.google.com/maps/contrib/105137296557796815162/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ8RcIv17LEK6pHaFMdHXmPHTbp0oZCru4MwO0YJPbWMaJK_0Y=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "This is my second visit and I have to say the dry needling by Physician Lim has been amazing. My chronic neck knots are almost gone and I wished I knew about this technique earlier as I have tried acupunctures, massages, you name it from other places and it did not solve my problem.\n\nHighly recommend anyone to check out this clinic for their neck and shoulder problems!",
      "time": 1744168889,
      "translated": false
    },
    {
      "author_name": "Blynn O",
      "author_url": "https://www.google.com/maps/contrib/113342884125912219564/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKcZOcCo7hevn7f5uKrj_YhuRQNlZOPiQ_9XujKFJJ8ay5R0w=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Love the treatment with Dr Victoria. My whole body feels so relieved after the acupuncture and cupping session.\n\nThe nurses are super helpful and the clinic smells so good too.\n\nHighly recommended.",
      "time": 1705051245,
      "translated": false
    },
    {
      "author_name": "Mei Ling Huang",
      "author_url": "https://www.google.com/maps/contrib/117137035681554796081/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJMjZjO7rH-udXvXfR2sVIWdJ3WkLjwRoPwWScZWDiqYOdSdA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "I've had an outstanding experience at Common TCM. The clinic is impeccably clean, which immediately sets a reassuring tone. The attention to cleanliness and detail is evident in every aspect of the environment, making it a comfortable and inviting place for treatments.\n\nOne of the highlights of my visits is working with Physician Victoria. Her expertise and gentle demeanor have a calming effect, especially when it comes to procedures like acupuncture and cupping, which can be nerve-wracking for some. Victoria’s professionalism and ability to create a relaxed atmosphere ensure that I always feel at ease during my treatments. She takes the time to explain each step and answer any questions, which greatly reduces any anxiety I might have had.\n\nOverall, Common TCM and Physician Victoria provide a top-notch, comfortable, and professional experience that I highly recommend to anyone seeking traditional Chinese medicine treatments.",
      "time": 1722075033,
      "translated": false
    },
    {
      "author_name": "desmonik",
      "author_url": "https://www.google.com/maps/contrib/102431678783115657231/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWSpLLSeTO3wMNtd-ySBXvJBVmSJK1su2EMpxqaFdlnEc9ujhc=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "With strong recommendations from friends who swear by Physician Victoria, I booked an appointment with Common TCM on 8th September.\n\nHaving a frozen shoulder and equally bad blood circulation, I was anticipating relief when I stepped into the beautifully decorated clinic.\n\nVictoria was spot on with my bad habit of consuming too much raw food (oysters and sashimi) and cold drinks (mainly cocktails and beer) just by reviewing my tongue!\n\nProceeding to one of private and clean treatment rooms for acupuncture and cupping, I felt tension building up and was wondering if I can manage the pain and discomfort from dragging of the cups.\n\nVictoria was reassuring and skilful in her approach, made the cupping process bearable and brought instant relief to my shoulder and neck region. Happy to feel progress in my ailment.\n\nEnding the whole treatment with a herbal foot soak, I am actually reluctant to leave the comfortable clinic for the carpark.\n\nLooking forward to the next TCM visit!",
      "time": 1694309751,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9563221228704592730",
  "user_ratings_total": 309,
  "vicinity": "111 Somerset Road, #03-10 TripleOne Somerset"
}