{
  "formatted_address": "449 Clementi Ave 3, #01-261, Singapore 120449",
  "geometry": {
    "location": {
      "lat": 1.3141385,
      "lng": 103.7648129
    },
    "viewport": {
      "northeast": {
        "lat": 1.315435380291502,
        "lng": 103.7661803802915
      },
      "southwest": {
        "lat": 1.312737419708498,
        "lng": 103.7634824197085
      }
    }
  },
  "name": "Concept First Physics and Math Learning Centre (Clementi)",
  "place_id": "ChIJDzPn6U4b2jERh7ceoO2Cg8A",
  "rating": 5,
  "reviews": [
    {
      "author_name": "ziyen chan",
      "author_url": "https://www.google.com/maps/contrib/111811239987418094181/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUo5U50hDqQW1MDrDtjbxGUNbMHn1f1IqOsFV1K66D052t8fDI3=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Despite joining the physics tuition rather late and a few months before O' levels, it has tremendously helped me improve my understanding of the physics concepts and as a result, pulled up my physics grades from borderline passes to an A1 during both prelims and O' levels. Mr Kong teaches in an engaging and effective manner, which allows learning physics to become less mundane and more of a joy. It has helped me develop an interest towards the subject. Overall, my experience at Concept First was a highly pleasant one and I would recommend it to all students! :))",
      "time": 1736863378,
      "translated": false
    },
    {
      "author_name": "chen fong keng",
      "author_url": "https://www.google.com/maps/contrib/100687519054678831456/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLaEDRt-hRxg_CxIzDox2pjkQEHLE27RaIIleXOmQIJZjRngg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "We are incredibly grateful to the team at CF for their unwavering support and dedication in helping our child achieve remarkable progress in Physics. From an F9 to an A1, Sandra’s transformation has been nothing short of amazing!\n\nThe teachers here are not only highly knowledgeable but also genuinely passionate about their students’ success. They tailor their teaching methods to individual needs and create a nurturing environment that inspires confidence and a love for learning. The admin team is also very efficient and approachable, ensuring a smooth experience for both parents and students.\n\nThank you, CF, for believing in Sandra and guiding her toward such a fantastic achievement. I highly recommend this center to any parent looking for a place that truly cares about their child’s growth and academic success.",
      "time": 1737000549,
      "translated": false
    },
    {
      "author_name": "marcus chan",
      "author_url": "https://www.google.com/maps/contrib/112795473683163848984/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU-QdKa6ypNjp9lkpi3tD2JodJU2Y1TvptXfl1QhA039_KbfHmA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Before joining Concept First, I found it difficult to apply my understanding of the chapters, and despite studying hard, I consistently scored F9 in my exams. After enrolling at Concept First, Mr. Calvin Kong changed my approach to studying. He taught me how to effectively break down exam questions by identifying key keywords, explaining what each one meant, and how to tailor my answers to meet the specific requirements of the question. With his expert guidance and support, my ability to answer questions more accurately and strategically improved. As a result, I was able to significantly boost my grades and achieved B3 in my O-levels.",
      "time": 1736862192,
      "translated": false
    },
    {
      "author_name": "Lim Siaw Ling",
      "author_url": "https://www.google.com/maps/contrib/108890015959348249394/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWLkbrJIKAQKbv08s8bfSNPTk1cVvVvA-pIcPc32P4qGM7uJzzF=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Before attending the lessons at concept first, I scored B3 for my end of year exam in secondary 3. But after attending concept first, my grades improved to an A1 in o level.\nI find the resources concept first very useful as it explained the details of each concept clearly helping me to understand each topic.\nAnd my teacher Mr Kong is very supportive as he attends to each and every student in need .",
      "time": 1737133427,
      "translated": false
    },
    {
      "author_name": "Meizhu Lin",
      "author_url": "https://www.google.com/maps/contrib/116004217337503787051/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLXoXqY4ItnAsJYFWe4uWXpRmV2MucqNEI9r7DN-NNVG0eC8g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "As a parent of two teens, I have experiences with many tuition centres, but Concept First truly stands out. It’s a centre that genuinely cares about helping every child excel. Apart from giving excellent resources such as concise notes, marked test papers and even a Physics lab to help in practical, what really made a difference is the passion of the teachers and admin team. Their dedication and support have motivated my kids to put in her best effort, and I’m so proud that my daughter achieved A1 and A2 for A.Math and Physics! Highly recommended!",
      "time": 1737553078,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "school",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13872075234336487303",
  "user_ratings_total": 514,
  "vicinity": "449 Clementi Avenue 3, #01-261"
}