{
  "formatted_address": "2 Temasek Blvd, Singapore 038982",
  "geometry": {
    "location": {
      "lat": 1.293589,
      "lng": 103.8589017
    },
    "viewport": {
      "northeast": {
        "lat": 1.294921280291502,
        "lng": 103.8603404802915
      },
      "southwest": {
        "lat": 1.292223319708498,
        "lng": 103.8576425197085
      }
    }
  },
  "name": "Conrad Singapore Marina Bay",
  "place_id": "ChIJD2ws16gZ2jERc-UCGfcV-eo",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Yu Zhe Ng",
      "author_url": "https://www.google.com/maps/contrib/112285337536643876454/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJDZW_Lg6SPaq1tI_rR3Gji6Hd90cygl3_ljavG64ChMFZg7g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "We cannot thank Conrad Singapore Marina Bay enough for making our wedding an unforgettable experience. From the moment we began planning, the team went above and beyond to ensure every detail was perfect. The venue was stunning, the food was nice, and the service by the staff was impeccable.\n\nSpecial thanks to Wedding Coordinator (Christopher) and Banquet Manager (Dave) who went out of their way to accommodate our requests and make sure that our wedding event went smoothly. Our guests were very impress by the venue and the warm hospitality by the service staff too.\n\nChristopher was also very helpful in solving our mini incident after our wedding. Kudos to him for that, he did not forget about us even after our wedding event is over.\n\nWe are very grateful for all your efforts. Highly recommend Conrad Singapore Marina Bay for any special occasion!",
      "time": 1747059682,
      "translated": false
    },
    {
      "author_name": "Shawn Loh",
      "author_url": "https://www.google.com/maps/contrib/104997998401291901325/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKabOIHizI6hMWhlO57OF5ZcrWq3jyCwj77J1ClWIhCtXsu=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "In April 2025, I checked into the Executive King at Conrad Singapore Marina Bay. Formerly known as the Conrad Centennial Singapore, the hotel officially adopted its new moniker on 15 April 2025. Conveniently situated close to the Marina Bay area, the 512-room property is part of the Millenia Singapore complex which also comprises The Ritz-Carlton, Millenia Singapore and shopping mall Millenia Walk.\n\nCONRAD SINGAPORE MARINA BAY\n\nUpon their first steps into the premises, guests are greeted by an aura of hushed elegance, from the dramatic grand spiral staircase and glossy marble surfaces to the twinkling ivories from the grand piano. The property is decorated with over 3,400 original art pieces and artefacts, with the most striking being the gold and illuminated conical-shaped chandelier installation (said to symbolise water) which points downward from the ceiling towards the intriguing blocky red artwork Turbulence by artist Rafael Barrios (said to symbolise fire). The lobby was designed with feng shui principles in mind, with other elements including the metallic gloss of the ceiling (metal), the bamboo trees (wood) and the pillars and earthy tones (earth).\n\nWhile the property is a business hotel with a strong corporate traveller profile, the hotel is also a favoured destination for international visitors, staycation couples and families alike, with occupancy being frequently high. The implication is that, on occasion, your wait for the elevators (and your journey in said elevator) might test your patience - on my journey down from the 31st floor Executive Lounge to the ground level for breakfast at Oscar's, the lift stopped seven times. The queue at Oscar’s can be snake-long as well, with the queue system (one needs to queue on the right to provide their room number before joining the entry queue on the left) not communicated to guests by way of staff, signaging etc.\n\nEXECUTIVE KING\n\nThe gloriously sunlit 40sqm Executive King features poster windows framing the (partially obstructed) Marina Bay view, with automated sheer curtains available should the room get too warm in the daytime...and for your modesty, since folks in the external bubble lifts of the Pan Pacific Singapore can peer directly into your business. A daybed stretches across the entire length of the room, with a movable side table to facilitate dreamy window-side conversations over coffee or wine. The circular table doubles up as both work desk and dining space, with power outlets and USB ports strategically located nearby. Nespresso coffee and TWG tea-making facilities are available, while the minibar is stocked with baby bottles of wine along with canned and bottled drinks, juices as well as snacks.\n\nThe spacious marble bathroom includes double vanities, an enclosed rainfall shower stall and a bathtub with bath salts as well as your own collectible Conrad rubber ducky provided for use, with bathroom amenities from European luxury brand Byredo. I liked the fact that there was an attached hair-dryer for use in front of the bathroom mirror, an increasingly uncommon feature of late.\n\nThe full review inclusive of dining experiences and photographs is available on Secret Life of Fatbacks, a luxury travel website.",
      "time": 1745056322,
      "translated": false
    },
    {
      "author_name": "Ganesh Shan",
      "author_url": "https://www.google.com/maps/contrib/111960169956855908019/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUtKAhkWMjBGwWET-Qh_y0t9RbV8dHTSQ9qDFd6_D647QChtaFKzQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "2 weeks ago",
      "text": "Conrad Centennial Singapore – Great Location, Best Suited for Business Travelers\n\nWe booked a couple of nights at Conrad Centennial Singapore through Amex Fine Hotels & Resorts. While it’s part of the Hilton group and meets their standards, the overall vibe of the hotel felt more business-oriented than leisure.\n\nIn the mornings, the breakfast area gets very crowded, mostly with business travelers. Although the staff are efficient and do a good job of quickly seating guests, the food—despite a large spread—was average in quality. It didn’t quite meet expectations, especially for a hotel of this tier.\n\nOn the positive side, the location is excellent—just minutes from Marina Bay. Thanks to an upgrade, we got a room on a high floor with an incredible view of Marina Bay right from our window. The rooms were well-maintained, and housekeeping was attentive. Amenities were well-stocked and service across the board was professional.\n\nOverall, this hotel is ideal for a short stay or business trip, but perhaps not the best fit for a relaxed family vacation due to the atmosphere and crowd.",
      "time": 1746306097,
      "translated": false
    },
    {
      "author_name": "Naome Mathieu",
      "author_url": "https://www.google.com/maps/contrib/116766190846903990783/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVkrgpMzONs84WZulVXi2qJYaDOdzaSm210o_I2iw6LJ7SR0jo=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "The lobby is absolutely stunning with beautiful decor. However, the rooms feel a bit dated—the furniture could use an update, and our fridge was difficult to open. On the plus side, the location is convenient to restaurants, shopping, and public transportation. Service was courteous and friendly!",
      "time": 1744103607,
      "translated": false
    },
    {
      "author_name": "Oli H",
      "author_url": "https://www.google.com/maps/contrib/110534856266764518098/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJQM12L2YGeNdOURYTf7lpQSmcRph-vkvd2pmPlyHb784O-sQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "The excellent staff and a good location make this a stand-out hotel. The rooms are modern and well maintained. The staff are both friendly and professional. It's a 5 minute walk to the local mall and restaurants. Couldn't fault them on anything.",
      "time": 1746613020,
      "translated": false
    }
  ],
  "types": [
    "spa",
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16931588425096815987",
  "user_ratings_total": 4651,
  "vicinity": "2 Temasek Boulevard"
}