{
  "formatted_address": "403 Havelock Rd, Singapore 169632",
  "geometry": {
    "location": {
      "lat": 1.2882885,
      "lng": 103.8366159
    },
    "viewport": {
      "northeast": {
        "lat": 1.289785480291502,
        "lng": 103.8381450302915
      },
      "southwest": {
        "lat": 1.287087519708498,
        "lng": 103.8354470697085
      }
    }
  },
  "name": "Copthorne King's Hotel Singapore",
  "place_id": "ChIJhT8kN3YZ2jERxhUO-wk7HA8",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Kris Chan",
      "author_url": "https://www.google.com/maps/contrib/104019661022906648682/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJGaGfSyF0Nw0dBUH_GS8kHcfhpDfJQ_mSqYofvW0memoypYQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "We had a great stay at this hotel! The room was spacious, clean and well-equipped with everything we needed. The bed was very comfortable and the housekeeping staff did an excellent job throughout our stay. The location was convenient, close to local attractions and public transport.\n\nThe front desk staff Billy were friendly and helpful. Check-in/check-out was smooth.\n\nOverall a great experience and we definitely stay here again.",
      "time": 1745494368,
      "translated": false
    },
    {
      "author_name": "Santhosh Kumar",
      "author_url": "https://www.google.com/maps/contrib/116637201409165809639/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIbxVPgXQ824q8zUOi5wHtmOx-0ccEL1QI6I9dP0ilJoC_kLQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "in the last week",
      "text": "We had a decent stay during our 7-day trip to Singapore. Hotel location was good. Staff were good but very punctual on time, not even an extra minute than stipulated for check in or check out. Breakfast options were limited in Indian cuisine. Overall clean and neat place with some above drawbacks.",
      "time": 1747246365,
      "translated": false
    },
    {
      "author_name": "Mimikuku Mimi",
      "author_url": "https://www.google.com/maps/contrib/117543274198268349174/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocISsZSSAh_A65rcY-xr6Ep8dEtmgn2cWD5A3BOkOQZTXnIkxQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Room at signature tower was smaller without balcony but was new and nice. Comfortable and quiet room. No bathtub for the new tower rooms. There is a 7-11 at the beside the hotel. Transport was a walking distance. Cleaners was always everyday to help clean up the room and top up the toiletries and coffee. They are friendly and courteous too. The buffet was delicious and staffs all were great. Bellman was friendly and helpful with a big smile. We met Emily the HR while at buffet and she show us great hospitality and recommendations of the buffet foods while we were deciding if we want a lunch or dinner buffet. We feel happy for the recommendation and appreciate much for her help. A great and nice hotel with great and nice people around. Highly recommend stay at this hotel.",
      "time": 1742423828,
      "translated": false
    },
    {
      "author_name": "Anthony Kinsella",
      "author_url": "https://www.google.com/maps/contrib/102105171219431898233/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXNlWAZlmCG9joA2apU06dIxHoe60PCeh_gi1yN_BQi-JTP4aWv=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Extremely Disappointed – Tablet Stolen and No Accountability\n\nI had a deeply upsetting experience at this hotel and feel compelled to share it. During my stay, my Android tablet went missing from my zipped bag in my room. The only person who entered my room was the housekeeping staff, and he was also the last person to see the tablet, according to the hotel’s own investigation.\n\nDespite repeated communication, the hotel has refused to acknowledge any responsibility or offer a satisfactory resolution. Upon checkout, security searched my room and bags thoroughly — no tablet was found. I last saw the device when I checked in, and I didn’t leave the room until the next morning, meaning the only person with access was their staff. It is painfully obvious what happened here, yet the hotel continues to deny and deflect.\n\nI am not one to write negative reviews or make baseless accusations, but this situation has been handled appallingly. I expected integrity, accountability, and a genuine effort to resolve the issue — instead, I’ve been met with silence and a dismissive attitude.\n\nAvoid this hotel at all costs if you value your personal belongings. Absolutely unacceptable.",
      "time": 1744280627,
      "translated": false
    },
    {
      "author_name": "Ton",
      "author_url": "https://www.google.com/maps/contrib/106998488186169136313/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVIA7Wn961kwlOA7_R42-mGIN7jWiQuRei21FcGBR_vyFzyb7aTug=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "I recently stayed at Copthorne Hotel to celebrate my birthday, and while there were some bumps along the way, I wanted to share my experience.\n\nFirstly, I had requested a large bed and a cake for my birthday, but upon arrival, the bed I received was not what I had asked for. I went to the front desk to address the issue, and while they did move me to a room with the correct bed, the new room did not have a balcony, as I had originally booked.\n\nSecondly, I found the bathroom to be a bit small, though the room itself was comfortable, even without the balcony.\n\nDespite these issues with the room assignment, I do appreciate the hotel’s effort in fulfilling my request for a birthday cake. It arrived a few hours later, just as promised, and was a thoughtful gesture.\n\nOverall, my experience at the hotel was still positive, and I appreciate the service. Thank you for making my stay special despite the hiccups.",
      "time": 1742694661,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1088810123969566150",
  "user_ratings_total": 3923,
  "vicinity": "403 Havelock Road"
}