{
  "formatted_address": "31A, Jalan Eko Botani 3/4, Taman Eko Botani, 79100 Iskandar Puteri, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.4381501,
      "lng": 103.6194031
    },
    "viewport": {
      "northeast": {
        "lat": 1.439534330291502,
        "lng": 103.6207765802915
      },
      "southwest": {
        "lat": 1.436836369708498,
        "lng": 103.6180786197085
      }
    }
  },
  "name": "Corgi's Talk Cafe",
  "place_id": "ChIJpfI7pxEL2jERy-1_6QDHplQ",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Anna Ellie",
      "author_url": "https://www.google.com/maps/contrib/101222681494986618069/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUP_s0RhtEGID6jodFXU8ACpDzjf0y2TK-RMpqWU3s_O7T_0VmN=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "Finally had the chance to visit the corgis at this cafe. Would suggest that you make a reservation first, especially if you are going during the weekends as it might get quite crowded and the place itself is not very big.\n\nThere are quite a number of corgis and one big husky at this cafe. They will all come running to you when you step inside and they are really cute. Only thing is that the corgis tend to drool a lot, so you might get their drool all over you 🥹 Do note that the cafe does not allow feeding, but the staff working there will usually get the corgis to interact with the customers and give them treats. Another thing to note is that the place itself isn’t very well ventilated, so upon stepping into the cafe, the strong smell might hit you if you are not used to it. There is also a time limit of one hour for each visit.\n\nOverall, I would say that if you like corgis you can come and visit these adorable corgis where they will high five with you 🤚🏼But I don’t think I will purposely come back again because of the smell and the limited space 😅",
      "time": 1743091558,
      "translated": false
    },
    {
      "author_name": "YT",
      "author_url": "https://www.google.com/maps/contrib/116335289933602715039/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVSx0tz-qw4QskVbpYXe4V_L4o3aFYxa3ZZsugq73pGTwz8dHZA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Visited this corgi café in the morning the other day, and it was such a memorable experience. It was just me and my friend there, and the entire visit felt very warm and welcoming.\n\nThe staff were incredibly friendly and attentive, doing their best to let us interact with the dogs, feed them, and even share some fun little treats and tricks with us. There was also a lady there, whom I presume was the owner, and she was so kind and engaging. She spent time talking to us, sharing stories about the different corgi breeds and where they came from, which was really interesting and added a nice personal touch.\n\nThe corgis themselves were absolutely adorable and very playful, making the experience even more enjoyable. We loved spending time with them, and the relaxed atmosphere made it feel so special.\n\nOverall, it was such a cozy and wholesome visit. If you’re a dog lover or just want a unique café experience, I highly recommend this place. We truly enjoyed our time here and would definitely come back! Thank you for taking photos for us! ☺️",
      "time": 1734427755,
      "translated": false
    },
    {
      "author_name": "Dickson Loo",
      "author_url": "https://www.google.com/maps/contrib/106982177516177743047/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJLoePcYto5khGa8a9-fqaZN77ok8KfqrBsWp6aPnyu7H02yw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "A Must-Visit for Dog Lovers!\n\nI had the BEST time at Corgis Talk in Johor Bahru! This place is an absolute paradise for anyone who loves adorable, playful dogs. The star attractions are, of course, the super cute and lively corgis—each one has such a unique and lovable personality! They’re friendly, well-behaved, and love interacting with visitors.\n\nThe environment is warm and lively, making it such a fun experience. The staff are welcoming and attentive,  ensuring everyone (both humans and dogs) has a great time. A special shoutout to the friendly lady boss—she’s so sweet and clearly passionate about her dogs, making the whole visit even more enjoyable.\n\nAnd let’s not forget the Alaskan Malamute—such a big, fluffy, and super cute addition to the pack! The mix of corgis and this gentle giant made the experience even more special.\n\n10/10 recommended! Will definitely visit again to play with them lovely corgis!",
      "time": 1745930128,
      "translated": false
    },
    {
      "author_name": "E’leen Liew",
      "author_url": "https://www.google.com/maps/contrib/112850695929228641904/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJx59ETkBb4XPebf417RwvZ8ePc2Rv2Nbyy9zoQokbyQwe2tA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Visiting Corgi's Talk Cafe was an exceptional experience. The staff displayed a perfect blend of professionalism and genuine care towards the dogs, creating a warm and inviting atmosphere.\n\nThey actively engaged with us during the various photo sessions, going above and beyond to ensure our kids felt comfortable giving simple instructions to the dogs. The staff struck a remarkable balance between being readily available for assistance and allowing us ample space to interact with these furry companions.\n\nThe friendly demeanor of both the human and furry staff members added an extra layer of joy to the entire visit. It was a delightful and fun-filled experience that left everyone in good spirits.\n\nTo top it off, the inclusion of a selection of tasty Western dishes as part of the package was a pleasant surprise. The culinary offerings perfectly complemented the overall experience, providing a satisfying conclusion to our visit.\n\nIn summary, Corgi's Talk Cafe offers not only a unique and enjoyable interaction with dogs but also a well-rounded experience enhanced by the attentiveness of the staff and the delightful culinary offerings. Highly recommended for dog lovers and families seeking a memorable and heartwarming outing.",
      "time": 1701479170,
      "translated": false
    },
    {
      "author_name": "Eve C",
      "author_url": "https://www.google.com/maps/contrib/109756518746414930822/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUQU3wOFRLMgNb3VcKY8wCYgWAjbktK7DbOQ0RgmSSo7MlZ8AJrJQ=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "Love the experience at this pet cafe. Advisable to call and book before going. They have specific time slot to enter Premises. The cafe (ground floor) offers food and drink. For ticketing price, refer to their IG. There are 8 corgis and 1 husky. The staff will go through basic rules before letting you into the compound. The corgis are lovely. The staff there took care of them well and very understanding and attentive to lead the dogs to you to pet by luring them with snacks. The staff will ensure even attention will be given to each guest. The staff are also quick to clean up the urine pad and poo so that the smell will be reduced to the minimum. Will love to visit again.",
      "time": 1705550277,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6099781552051318219",
  "user_ratings_total": 223,
  "vicinity": "31A, Jalan Eko Botani 3/4, Taman Eko Botani, Iskandar Puteri"
}