{
  "formatted_address": "200 Victoria Street, #B1-17/18, Bugis Junction, Singapore 188024",
  "geometry": {
    "location": {
      "lat": 1.2999362,
      "lng": 103.8560058
    },
    "viewport": {
      "northeast": {
        "lat": 1.301115630291502,
        "lng": 103.8571062802915
      },
      "southwest": {
        "lat": 1.298417669708498,
        "lng": 103.8544083197085
      }
    }
  },
  "name": "CS Fresh",
  "place_id": "ChIJHbKxhboZ2jEROFG6e1zb8Hc",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Yellow Bear",
      "author_url": "https://www.google.com/maps/contrib/104489311735261065689/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXJw6wU_ViJ96j0KUowLXVVtxYUueaV518tEdvuXXsBsEMiDzjh=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "A good place for locals and tourists (even for vegans and vegetarians) to get almost anything,. Merlion stuff is also available at this supermarket. Happy Shopping.",
      "time": 1738036753,
      "translated": false
    },
    {
      "author_name": "Hartono Harjono",
      "author_url": "https://www.google.com/maps/contrib/102944719141464210600/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU2wzv-R7xAL7WAhbKCcmiEWLKvBAiYt2jMX0nv1l0P-rVzGIU76A=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Situated in the heart of Bugis, Cold Storage in Bugis Junction Basement stands as a spacious supermarket, offering a wide array of items that cater to almost every daily need. The selection is vast, ensuring you can find everything you require conveniently under one roof.\n\nThe freshness of fruits and vegetables is a notable highlight, promising quality produce for shoppers. Keep an eye out for promotions on specific items, making your shopping experience not only comprehensive but cost-effective.\n\nFor those seeking a quick and efficient checkout process, self-checkout machines are readily available, streamlining your shopping journey. Cold Storage in Bugis Junction Basement is not just a supermarket; it's a go-to destination for a seamless and satisfying shopping experience.",
      "time": 1700058011,
      "translated": false
    },
    {
      "author_name": "Clarkey",
      "author_url": "https://www.google.com/maps/contrib/111544213728046100341/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVXL3guwQVGqy3dcMkx1SS0QtHIoy5pA1iVDxbIwiB2214uG_Q=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "CS Fresh is a modern grocery store that offers a wide range of fresh produce, packaged goods, and household items. Located in the heart of the bustling Bugis Junction, it's a convenient and accessible shopping destination for locals and tourists alike.\n\nOne of the standout features of CS Fresh is its commitment to providing high-quality, fresh produce. The store sources fresh fruits and vegetables from local farms and suppliers, ensuring that customers have access to the very best ingredients for their meals. The store also offers a variety of organic and locally-sourced items for those looking for more sustainable options.\n\nIn addition to fresh produce, CS Fresh has a comprehensive selection of packaged goods, including snacks, beverages, and household items. From international brands to local favorites, the store has something for everyone. The prices are reasonable and competitive with other supermarkets in the area, making it an affordable option for everyday shopping needs.\n\nOne of the unique aspects of CS Fresh is its emphasis on customer experience. The store is clean, well-lit, and easy to navigate, with clear signage and helpful staff available to assist shoppers. The store has a self-checkout system, which is convenient for those who prefer to shop on their own which is what we did.",
      "time": 1686669719,
      "translated": false
    },
    {
      "author_name": "Lyon .L",
      "author_url": "https://www.google.com/maps/contrib/116530427276878715771/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK8tqRr8xCkklSoEY6Yc9Rq9d5riLs57nYhVVXsSEuVlJf5EIg=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 3,
      "relative_time_description": "a year ago",
      "text": "Nothing much there actually other then your normal groceries and daily needs. I ordered the salad at the diy salad stand ingredients were alright wish they had stock up more sauces as I wanted Cesar and they don’t have it so I had to go with another dressing though the staff was very friendly they forgot to add some of the ingredients requested in the paper slip. Other then that all is alright",
      "time": 1690783168,
      "translated": false
    },
    {
      "author_name": "Allison C.",
      "author_url": "https://www.google.com/maps/contrib/118140958459736714363/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ825Ds2xThP2An6D2xgmqHlkuo5EhyQGbqFU-JGxaKV25jymgH=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "A cockroach fell on me when I was shopping in the supermarket and the staff honestly didn't seem to care. The subsequent follow ups didn't address the problem. There are hygiene issues here.",
      "time": 1744196701,
      "translated": false
    }
  ],
  "types": [
    "supermarket",
    "grocery_or_supermarket",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8642648875183264056",
  "user_ratings_total": 1223,
  "vicinity": "200 Victoria Street, #B1-17/18, Bugis Junction, Singapore"
}