{
  "formatted_address": "54, 55, 56 Bussorah St, Singapore 199471",
  "geometry": {
    "location": {
      "lat": 1.3017139,
      "lng": 103.8594191
    },
    "viewport": {
      "northeast": {
        "lat": 1.303105330291502,
        "lng": 103.8606584802915
      },
      "southwest": {
        "lat": 1.300407369708498,
        "lng": 103.8579605197085
      }
    }
  },
  "name": "CUBE - Boutique Capsule Hotel @ Kampong Glam",
  "place_id": "ChIJ52u_HbEZ2jER8f53EGixN3k",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Sophia C",
      "author_url": "https://www.google.com/maps/contrib/115392202543934333048/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX7mW91btW7JH0YWwmwGGM68R4aMzf5rT4SHAxFGMbKHqiPf60e=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "2 weeks ago",
      "text": "The capsules themselves are quite comfortable and clean, but there was not very good storage solutions for bags, the door to our dorm didn’t lock, and the bathrooms are only cleaned 2x/day so are quite messy (and there are not nearly enough bathrooms, they were almost always busy). Also it is very noisy from outside so bring earplugs for sure. Location was quite central but note that cars cannot access the street so you will have to walk from one block over. There is also no elevator so you need to bring your suitcase up a steep flight of stairs. Overall though I slept fine and it was OK for the price.",
      "time": 1746269008,
      "translated": false
    },
    {
      "author_name": "Dinni Ika Ningsih",
      "author_url": "https://www.google.com/maps/contrib/110314504053852073010/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWcoZw9vvFfdvfDh68kPY2aE8EZ4WF0-XVCqn32hmqG22quJg8BxA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "A very good capsule hotel for solo traveler. There's a lot of halal food nearby. Near to bus stop & MRT. Just a second to Bugis and another touristy area.\nThe room itself is quite clean and spacy for capsule hotel. You have a small space for your belonging next to your bed. The bathroom is okay (some of them are smelly, in the 2nd floor, in front of locker). The amenities arr good. I love their shampoo.\nThey also provide light breakfast such as bread, fruit and egg.\nI love staying in Cube.",
      "time": 1741878848,
      "translated": false
    },
    {
      "author_name": "Nora",
      "author_url": "https://www.google.com/maps/contrib/117313884813435264201/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXhXiFx35fuLeam3B_02AbgYOzt7fxRdUwRWLFYccxRPlQKKgtj=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "First time i spent night at capsule hotel and its not that scary. Bathroom is clean and staff is nice.\n\nBut the concern is you cannot sleep if someone doing something in the room, like digging suitcase or just walk because the panel is thin so you can hear everything. Not suitable for person who sleep at quiet place.",
      "time": 1744611482,
      "translated": false
    },
    {
      "author_name": "Riyanto Wibowo",
      "author_url": "https://www.google.com/maps/contrib/107556120780976942205/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU6GCeOwPW6lgBb0xxAJ2ZAu5ImEB-uZ9GCbF-jg9dtfUYJkuE6=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "If you're planning to travel with friends who might or might not come, this hotel is perfect for you. No need to confirm how many beds in the room, cause no matter how many friends come or even if you end up going alone, capsule hotel is the answer.\n\nThe Capsule Cube Kampong Glam is clean and smells good, plus it’s near Sultan Mosque, one of the famous spots in Singapore, so got plenty of food, drinks, and souvenir shops around. All the staff are friendly, and the breakfast and coffee are decent to fill you up before you start your day.\n\nAlmost nothing wrong with this hotel, except the aircon. It’s super cold because they use central AC from the building, so you can’t adjust the temperature. I arrived at night after rain, even though I showered with warm water and went straight to sleep, I woke up in the morning with a nosebleed cause the aircon was too cold. The lady next to my capsule also coughing, probably cause of the cold aircon too.",
      "time": 1743013906,
      "translated": false
    },
    {
      "author_name": "Khairur Azhan",
      "author_url": "https://www.google.com/maps/contrib/102777914819410859351/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUljOr5H3nqercDiMgkOTocbrHbcNFvVA21WnD2dY4UfWozveuD=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "5 months ago",
      "text": "Room: Kandahar 43\n\nThe check-in was smooth and the reception staff was polite.\n\nThe capsule bed was relatively spacious and very clean.\n\nUnfortunately, there's no elevator to the second floor.\n\nThere are 5 bathrooms available on my floor, they were clean and with good water pressure.\n\nSelf-service washer and dryer (chargeable) and a steam iron were available.\n\nThe free breakfast was a nice touch, although the lack of ventilation in the eating area was a bit disappointing (make your shirts smell).\n\nThe location is fantastic for me as it is right in front of the Sultan Mosque.",
      "time": 1733036627,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8734645062819380977",
  "user_ratings_total": 691,
  "vicinity": "54, 55, 56 Bussorah Street"
}