{
  "formatted_address": "37 Joo Chiat Pl, Singapore 427761",
  "geometry": {
    "location": {
      "lat": 1.3134658,
      "lng": 103.9005505
    },
    "viewport": {
      "northeast": {
        "lat": 1.314756530291502,
        "lng": 103.9019091302915
      },
      "southwest": {
        "lat": 1.312058569708498,
        "lng": 103.8992111697085
      }
    }
  },
  "name": "Cugini Trattoria Pizzeria",
  "place_id": "ChIJxQWjJQ0Z2jERewzSBwNie9c",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Amalthea Serena Garcia",
      "author_url": "https://www.google.com/maps/contrib/117783528201243867518/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU0QobnU9CD-kQJXD5qU2xd1RXOQIFvkKrlr9HdfYKRePOMta0=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "After two years apart, my friend and I finally reunited—and we couldn’t have picked a better spot than Cugini Trattoria Pizzeria in Singapore. This cozy, rustic Italian restaurant gave us the perfect ambiance for a relaxed catch-up over good food and even better conversation.\n\nWe shared the Squid Ink Tagliatelle with Baby Squid, which was not only beautiful to look at but also bursting with flavor. The pasta was fresh and perfectly al dente, and the baby squid added just the right texture and taste.\n\nWe also tried their Spicy Salami Pizza, and it hit all the right notes—spicy, cheesy, and wonderfully crisp. The fruit punch I ordered was refreshing and just what I needed to balance the savory dishes.\n\nWhat truly made the experience even more memorable was the friendly staffs, Belle and Tine, and Head Chef Nico who personally checked on us more than once to make sure we were enjoying the food. Their warmth and attentiveness made us feel genuinely welcome.\n\nCugini’s inviting atmosphere, flavorful dishes, and heartfelt hospitality made our long-awaited reunion extra special. Highly recommend this gem if you’re looking for an authentic Italian experience in Singapore!",
      "time": 1746502222,
      "translated": false
    },
    {
      "author_name": "A C",
      "author_url": "https://www.google.com/maps/contrib/111961936290511429828/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX2MxS2JHO8k3Gge1HY9NHYxE9miv3zOvPCsmuiY66r1xM5wKOuyA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "had an absolutely glorious time at cugini. the food was excellent — fresh, properly seasoned, and well portioned! we were served by Belle — she was exceedingly thoughtful, attentive, and knowledgeable. i had certain dietary restrictions and Belle needed no reminding to help me pick out items that would work. everyone we countered, the chef, Tina (Belle’s manager), and other wait staff were also delightful. thank you for a wonderful experience!",
      "time": 1733396448,
      "translated": false
    },
    {
      "author_name": "Mark Rainier Gochangco",
      "author_url": "https://www.google.com/maps/contrib/100736611640531219196/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL9MvaD4BcOUIhe3tTOGBd1xJZ7HVh_CopP_h_gsux7Oe9nhA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Cugini delivers a masterclass in pizza artistry with their irresistible offering. The pizza boasts a perfectly baked crust — golden, slightly charred, and airy, providing the ideal base for indulgence. Topped generously with high-quality meat, each slice bursts with a delightful mix of smokiness and spice. The melted cheese stretches enticingly, blending with the savory toppings to create a rich and satisfying flavor profile.\n\nThe attention to detail is apparent not only in the ingredients but also in the impeccable execution. This pizza exudes a warmth and authenticity that speaks to traditional craftsmanship, making it the ultimate comfort food.\n\nWhether for a quiet night in or a festive celebration, Cugini’s pizza is a must-try for any pizza lover seeking a memorable dining experience. It's more than a meal; it's an event.",
      "time": 1733538335,
      "translated": false
    },
    {
      "author_name": "PomChatChat",
      "author_url": "https://www.google.com/maps/contrib/113748219437525329854/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWeI9Ua1pR3eCdZT05a7q00TPxk3ORIts93faR2mmgupmGwaZ_VEA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 2,
      "relative_time_description": "4 months ago",
      "text": "It’s 1/1/2025 and everyone slept in. Decided to get lunch at Cugini at Joo Chiat.\n\nThe acoustics in the restaurant was a bit bad, and there was a table with a cranky toddler. Couldn’t hear what the waiter was mumbling but heard “Sparkling or Still?” We ordered a bottle of Still, but later realised they served Tap. Sigh… no biggie. First meal of the year, let’s be positive.\n\nWe decided to share dishes and so ordered the tagliatelle, a pizza and a steak for the three of us. Waitress asked if wanted to order breads coz “We don’t offer complimentary breads”. I politely declined.\n\nLike some of the other reviews mentioned, service and food preparation took longer than expected. I think the first dish, the pasta, arrived at about 25mins after placing our order. The other dishes came only after the one before it was completed. It got me thinking, good thing we were sharing food, otherwise we would be literally watching each other finished our dishes individually rather than dining together at the same time.\n\nTo be pair, the pasta was good. Al dente to near perfection. But the “Italian bacon” was very very gamey. The pizza was also very good.\n\nThe last dish, the steak, was really really bad. I wanted it medium rare, but it came rare (some parts almost blue). Personally, I don’t really mind an occasional rare steak. However, we were puzzled how something that rare was still that tough to chew. We were really disappointed.\n\nThe indoor dining hall was fairly warm as the open kitchen with the wood-fire/brick pizza was generating heat. The fact that the guests and staff kept leaving the manual sliding door open didn’t help; another table under the A/C kept playing with the remote because maybe the baby was feeling cold.\n\nOverall, we just didn’t manage to enjoy the whole experience. What a bad start to 2025.",
      "time": 1735730605,
      "translated": false
    },
    {
      "author_name": "Jack",
      "author_url": "https://www.google.com/maps/contrib/106288565584051666357/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWAz__X8LkfzCSM6CtMEV009262f_gpetU5m9GJjEGYH28gnOyv=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Wagyu beef carpaccio was pretty good, the eggs go very well with the melt in mouth wagyu beef. Perhaps too generous with rocket salad but better more than less I guess. Tagliatelle with lobster bisque was really good, fresh cut lobster pieces full of umami bisque. Wished the serving was more generous for this one. Regolare pizza was not too bad, very thin crust and fresh prawns. Finally the tiramisu was not too sweet but perhaps too creamy a bit more sponginess will be better.",
      "time": 1739541445,
      "translated": false
    }
  ],
  "types": [
    "meal_delivery",
    "meal_takeaway",
    "restaurant",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15527111905445547131",
  "user_ratings_total": 721,
  "vicinity": "37 Joo Chiat Place"
}