{
  "formatted_address": "203 Hougang St 21, Singapore 530203",
  "geometry": {
    "location": {
      "lat": 1.3575998,
      "lng": 103.8843939
    },
    "viewport": {
      "northeast": {
        "lat": 1.359001930291502,
        "lng": 103.8856603302915
      },
      "southwest": {
        "lat": 1.356303969708498,
        "lng": 103.8829623697085
      }
    }
  },
  "name": "Curry & Curry",
  "place_id": "ChIJ72vnR7EX2jER2OhAxYfJcgM",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Katherine Happiest",
      "author_url": "https://www.google.com/maps/contrib/103056298337699105255/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVowUoJk7vlM_Vjc5RkXGeAqWNry3v8taYaECV0foJwa8zfxmg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "The curry fish head was really nice\nSpice level, assam sour taste and all was well balanced. Very enjoyable\nThe fish head was tender and delicious\n\nI had an orh nee for dessert\nIt was pretty decent",
      "time": 1741659751,
      "translated": false
    },
    {
      "author_name": "Jeff",
      "author_url": "https://www.google.com/maps/contrib/101763540896756605183/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocInoXXW0RswXKg-uMYrNMOu8Jb84FErwZg6IxStvgUb-Km2Ag=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "Good food must wait. Literally. Had to wait quite a while for the curry fish head and it was good.",
      "time": 1746892526,
      "translated": false
    },
    {
      "author_name": "Hui Chong Kong",
      "author_url": "https://www.google.com/maps/contrib/102793090900266792913/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUKzVnM0y25dqhaxRQMHW_qmqUuC8nnuHX-31h5ca6UX6tA4HT0=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "Walk in for dinner on Sunday evening, 5 minutes to get a table arranged by a guy but it took another 5 to 10 minutes before we could place order with another aunty.\n\nDish serving is not efficient. Same dish was served to the next table after us. Later came to us and mentioned the vegetable is out of stock. Egg came first then we had to wait for 10 minutes before 2nd dish came. Curry fish head came last after another 15 minutes when it was served to many tables after us.\n\nWe were too hungry to have to start eating when the dish came. Here is the photo of the finished curry fish head. Delicious!\n\nHowever, we will not come here again in the weekend as it is total chaos. Weekdays after work I think still can consider.",
      "time": 1743940658,
      "translated": false
    },
    {
      "author_name": "jayden",
      "author_url": "https://www.google.com/maps/contrib/105743541374316989018/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLwULvJdQDmvny72TJa5YalPplbiH7oOpP8fRxWfUiYNkgQ6pmd=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "Worse curry fish head ever eaten! Disgusted by it. Imagine eating a curry that's not hot in temperature, and doesn't taste spicy or the usual curry kick. This curry taste like it's been cooked using instant curry packet taste....we came at around 7pm, restaurant was full which I thought it's food will be great but it's not! The service is super slow, ask for chilli padi 3 times from 3 different servers and all just said wait awhile, after we eaten halfway through the meal, I got so irritated that I went up to the counter and ownself ask for 3 portion of chilli padi and was again told to go back to table to wait, then finally the server came with just 1 portion!(How irritated is was).\nThe french bean portion is very small for the price, $10 for like a 25 strands of french bean??? I can even count how many strands there is. If it's nice it's okay, however it's taste very bland, as if just anyhow fried with some oil and garlic??\nThe sambal petai doesn't even taste sambal at all, yet again tasted like instant sambal. The bittergourd egg was another disaster, I and my friend even ate till egg shells in it. Only the rendang was still acceptable but to be honest the price doesn't justify the portion at all. We got so disgusted eating here and irritated by their service which I felt no need to even complain or feedback to the staff directly on the dishes and egg shells, I witness the staff also being rude to another table of old folks and being sarcastic to them while taking order.\nWe even had to go another table to take the utensils box, totally no service at all. Imagine after ordering the dishes, the french bean came without our rice and utensils. So hard to get any attention, only after the 2nd dish came then they finally gave us our rice. This place should be popular in their curry fish head however it was a total nightmare.\nThe barley and luo han guo also kind of tasteless, not sweet not herbal not anything, like water with a bit of taste....\nDo not know why still have many people eating here, just pure luck on them for having business with such attitude and standard in food.\nWon't ever come back again ever or recommend here at all.",
      "time": 1730038746,
      "translated": false
    },
    {
      "author_name": "Annabella Chang",
      "author_url": "https://www.google.com/maps/contrib/112358313222628882270/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVWoL9DKksuMP3FBIw80wcsMp754ayoi8_VoZ9dtS7t8Jy1Ieff=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "The curry fish is superb! It's more of a thick and sour side taste! All other foods are nice and the price is decent too, the shop is clean, good service! Btw, it's really nice to pair the curry with papadam!",
      "time": 1732080458,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=248482514425931992",
  "user_ratings_total": 328,
  "vicinity": "203 Hougang Street 21"
}