{
  "formatted_address": "10 Bayfront Ave, B1-71 The Shoppes, Marina Bay Sands, Singapore 018956",
  "geometry": {
    "location": {
      "lat": 1.2850908,
      "lng": 103.8598243
    },
    "viewport": {
      "northeast": {
        "lat": 1.286323830291502,
        "lng": 103.8614886802915
      },
      "southwest": {
        "lat": 1.283625869708498,
        "lng": 103.8587907197085
      }
    }
  },
  "name": "CUT by Wolfgang Puck",
  "place_id": "ChIJnWdQKQQZ2jERxH3g-HsHchE",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Xandra Goh (Xandra)",
      "author_url": "https://www.google.com/maps/contrib/116294576369293366228/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI6ZqneVVZEFuIZUAhnld3QqeQdqPEctLKWe6hqE4Bm4tJYmdA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "Had a wonderful dining experience at CUT by Wolfgang Puck in Singapore, and it was an exceptional experience from start to finish. We ordered the Tomahawk steak, and it was absolutely phenomenal—perfectly cooked, beautifully seasoned, and incredibly juicy. The quality of the meat really stood out!\n\nThe service was top-notch—attentive without being intrusive. The staff was knowledgeable about the menu. The ambience was elegant yet comfortable, making it ideal for a special occasion. We also tried a few sides and starters, all of which were executed with the same level of finesse.\n\nOverall, the place is highly recommended! I would definitely come back again!",
      "time": 1747232473,
      "translated": false
    },
    {
      "author_name": "William Tay",
      "author_url": "https://www.google.com/maps/contrib/111195888798237649533/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXTutW4bVIwyi5r10ZEIbrrV5WxbIrXJS7CqdiotJLAGhlsBZ_8kg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Good almost perfect except for the fries. The top layer was cool, then some in the middle was warm at best.\n\nSteak and crab cake was on point! We ordered two different styles and it was nice that they split it up for us on one plate so we can share.\n\nEnjoyed the experience! Will definitely be back.",
      "time": 1746273405,
      "translated": false
    },
    {
      "author_name": "Ming Shen Tham",
      "author_url": "https://www.google.com/maps/contrib/116082735539712168059/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLGrMZ5UuB0fyolyPuJlKXs_jnFqr1bJiIw06AcP6YaQ8GAbQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I had the pleasure of dining at CUT by Wolfgang Puck, thanks to a treat from my brother, and I must say—it was an absolutely incredible experience.\n\nFrom food to service, everything was top-notch. We started with the crab cake, which was appetizing and had the perfect amount of acidity to balance the flavors. Next up was the maple-glazed pork belly, which was tender, flavourful, and just melted in the mouth.\n\nThen came the star of the night—the steak. Perfectly cooked, it had just the right amount of fat, and the charred exterior added a slight bitterness that enhanced the overall taste. Every bite was a delight.\n\nTo top it all off, dessert was the perfect way to end the meal.\n\nThroughout dinner, the service was exceptional—the staff were friendly, approachable, and attentive, making the entire experience even better.\n\nWithout a doubt, this place deserves a 5/5, and I’d love to come back again!",
      "time": 1743305149,
      "translated": false
    },
    {
      "author_name": "Zatalyn Ho",
      "author_url": "https://www.google.com/maps/contrib/103567929913413907340/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU-O8a3Y08ile3q0pNg2XDSnGH006Sk_tKTiYXGOB1ne9uh5dA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Lovely experience at Cut by Wolfgang Puck!\n\nWe began with the tuna tartare starter, accompanied by an assortment of breads including focaccia and pretzel, complemented by a variety of sauces! The tartare was a masterclass in blending flavors and textures, with subtle dashes of wasabi aioli broadening the flavor profile while togarashi crisps and garlic added crunch to the smooth tuna chunks. major love!\n\nFor our main course, we ordered the porterhouse prime steak, which was juicy and tender served on an old-fashioned sizzling hot plate with whole cloves of garlic and sprigs of rosemary. The slightly charred exterior highlighted the smoky notes from being grilled over hot coals, making each bite flavourful.\n\nOur sides included the mac and cheese, which was one of the best we’ve ever had, with lots of cheese and a very creamy texture, and the sautéed mushrooms!\n\nThe meal was perfectly complemented by a bottle of Tenuta Poggio red wine, enhancing the overall dining experience. The impeccable service and warm ambiance further elevated our evening, special shoutout to Nickson for recommending the wine!",
      "time": 1742746111,
      "translated": false
    },
    {
      "author_name": "L L",
      "author_url": "https://www.google.com/maps/contrib/118067558713006576140/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLygGWyIlXnGRKw2_FjoORf05r9pHI3c40xbAxojJt8oxRRKA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Wonderful experience celebrating a birthday. Delicious steak and sides.\nOur server Kim in particular was very attentive and friendly and ensured our evening was amazing. Highly recommend !",
      "time": 1746943147,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1257075475027623364",
  "user_ratings_total": 1658,
  "vicinity": "10 Bayfront Avenue, B1-71 The Shoppes, Marina Bay Sands"
}