{
  "formatted_address": "2 Bukit Pasoh Rd, Singapore 089816",
  "geometry": {
    "location": {
      "lat": 1.2787135,
      "lng": 103.8410542
    },
    "viewport": {
      "northeast": {
        "lat": 1.280028580291502,
        "lng": 103.8423202802915
      },
      "southwest": {
        "lat": 1.277330619708498,
        "lng": 103.8396223197085
      }
    }
  },
  "name": "D.Bespoke",
  "place_id": "ChIJfWurl20Z2jERx6QkkzOlLhk",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Luke Tao Buranasitiporn",
      "author_url": "https://www.google.com/maps/contrib/107592169893436734388/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX1xZ3x8sZhGtjUzYgjgZICTlwCTJgdeEb0Wl1rZZc3uEikdhAg5Q=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "5 months ago",
      "text": "I know what this bar is trying to be: some sort of Japanese Speakeasy/private bar. But since I've been to many bars in Japan (and around the world), the service is well below par. I'm not talking about how they dress or the \"mannerisms\". But what they lack (by a long mile) is the hospitality and friendliness. The guy who was in charge of our table did not even produce one hint of a smile or happiness. One of our friends cannot drink alcohol so the server just took away his water without hesitation. And most bars I've been to in Japan cost less than this (most with a menu...yes, they don't have a menu) with better service and better drinks. And I'm also a whisky guy - most whisky is overpriced without any good recommendations, you're much better off going to real whisky bars around town for better value and experience. The cocktails we ordered were ok but cost much more than other great bars (as close as next door). To me, it's just a very poor representation of what a proper Japanese bar is. Going out and looking for a happy time, even at a Speakeasy, should not make you feel uncomfortable. We all were uncomfortable the whole time we were there, it felt like we were not welcomed at all.",
      "time": 1732554779,
      "translated": false
    },
    {
      "author_name": "MH Tham",
      "author_url": "https://www.google.com/maps/contrib/112376174358198242550/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXJ4tOLbvkkJYRe2LZw4PmTrCsbezMPVke50H01b6T0gSd095fp=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Enjoyed my experiences here thoroughly. Regrettably haven’t had the chance to visit more recently. Looking forward to the next gathering there.",
      "time": 1743401630,
      "translated": false
    },
    {
      "author_name": "Tan Yi Beng Trevin",
      "author_url": "https://www.google.com/maps/contrib/117795464267492285999/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIKGwca3TQkymvACSWzDvEu1RbhD_GwxN4CBy_z_wv8CCSrTQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "Disappointed with my visit. The service was poor and the staff were outright rude, which really set a bad tone (which proper staff/servers moves a customer's belongings without asking permission?) The drinks were just average—nothing special. The bar clearly tries to present itself as exclusive or upscale, but the pretentious attitude from the staff only made it feel unwelcoming and out of touch. Definitely not worth the hype.\n\nOperating managers completely did not understand the concept of mutual respect whilst attempting to create the exclusive and lavish vibe.",
      "time": 1747067576,
      "translated": false
    },
    {
      "author_name": "Daniel Choo",
      "author_url": "https://www.google.com/maps/contrib/114373233943148799915/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLtKQXTE1tOvZmg7Iwj9Y402lUaG2v4GuNendafrzOyxq8iKA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "The service and hospitality from staff were down right poor and rude. It made the experience less enjoyable and made the food /drinks less tasty. No warmth or smile from the lead staff, more arrogance. Some of my friends were allergic to alcohol were pushed away when these concerns were addressed.\n\nSince there is no menu, you can’t expect to know what to order, lead staff just looks at you and you are suppose to magically know what they offer, and makes you feel unwelcome if you don’t know about their concept.\n\nFor the amount you are paying for these bespoke cocktails, it should come with decent service, basic respect and proper mannerism in speaking. Would not recommend this cocktail bar.",
      "time": 1747066074,
      "translated": false
    },
    {
      "author_name": "Terry Chang",
      "author_url": "https://www.google.com/maps/contrib/100154967107949010833/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKpg5gWzljoGnmFO3fUjqV7XREUaUoHFwlYYCWeeX6Y8S0iBg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "The drinks are undeniably intriguing and crafted with care—they really showcase creativity and flair. However, they do lean on the pricier side, and unfortunately, there was no price transparency until payment, which made the experience feel less straightforward.\n\nWhile the bar markets itself as a Japanese speakeasy, with the majority of staff being Japanese, we did not feel the warmth or welcoming vibe that one might expect from such an establishment. The sense of indifference with some of staff is further enhanced by the hefty prices charged.\n\nAdditionally, our seating arrangement detracted from the ambiance. We were placed near what seemed to be their storage room, and the frequent sound of the door being slammed shut disrupted the overall enjoyment. It was particularly prevalent at the end of the evening, perhaps their way of asking us to leave near closing time?\n\nThough the drinks were impressive, the combination of unclear pricing, lack of warmth, and an unideal seating setup left room for improvement.\n\nGiven the vibrant cocktail bar scene in Singapore, we are unlikely to return.\n\nAs a side note - RPM is their sister bar, which we also felt fell short on Japanese hospitality despite the marketing.",
      "time": 1744428339,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1814569340807455943",
  "user_ratings_total": 347,
  "vicinity": "2 Bukit Pasoh Road"
}