{
  "formatted_address": "1 Pasir Ris Cl, #02-110 E!Hub@Downtown East 1, Singapore 519599",
  "geometry": {
    "location": {
      "lat": 1.3761192,
      "lng": 103.9554111
    },
    "viewport": {
      "northeast": {
        "lat": 1.377509730291502,
        "lng": 103.9566500802915
      },
      "southwest": {
        "lat": 1.374811769708498,
        "lng": 103.9539521197085
      }
    }
  },
  "name": "D'Bakmie & D'Cendol Downtown East",
  "place_id": "ChIJxXYY6_492jERDlgJWS0w2S0",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Evelyn B",
      "author_url": "https://www.google.com/maps/contrib/105637030339751423909/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKsvqLAhiVe_Njlg7Cpj_3QajP-dLRFlBjoR-FqeVTRXKarIg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "The best Indonesian chicken noodles I’ve had in Singapore! And I’ve tried quite a few since it’s one of my favorite food. D’Bakmie’s chicken noodles are the most authentic Indonesian chicken noodles I’ve had in Singapore, just like how it tasted in Indonesian street food stalls. The chili packed a punch, if you like spicy, choose the brighter orangey chili. Since the first time I tried D’Bakmie, I’ve been back for more and tried Bakmie Jakarta, Bakmie Yamin Manis, Bakmie Yamin Asin, and Bakmie Rica Makasar. They’re all great but my most favorite is Bakmie Yamin Manis. The Pangsit Goreng Indonesia is also delicious, authentic Indonesian fried wonton, eat it with the sauce provided. Funny thing though, the wonton used for the noodles add-on is the Singapore style one, so can only get it as ala carte. I also tried the crispy mushroom, it wasn’t amazing but I love that they used oyster mushrooms just like in Indonesia. The space isn’t very big, there’s only a few tables. Staffs are friendly and helpful. Highly recommended!",
      "time": 1727402596,
      "translated": false
    },
    {
      "author_name": "Lydia",
      "author_url": "https://www.google.com/maps/contrib/106281854876240602494/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVzmSJ4TMtybGQx7NwfVRKU3ggnywiw_aAnYTvYVwLjI62NuR9Vog=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "8 months ago",
      "text": "Noodle and the fried wonton is quite nice, recommended. The beefball was big but i dun really like the soup. The fried mushroom was not so tasty, not dry enough. Cendol was nice. The place was small so need to wait if during dinner time. The table was sleek, can order from the table :)",
      "time": 1725102738,
      "translated": false
    },
    {
      "author_name": "steven lim",
      "author_url": "https://www.google.com/maps/contrib/117434407303387249783/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW9TZft3JhO8u77GhPzyMHIKSF9oW2GvNEIOEbq3sL0e_ecFLnMkg=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 3,
      "relative_time_description": "a year ago",
      "text": "First time here and the experience was okay.  You can order via the screen at the table, buy if you want to pay with a credit card, it turns out you have to order and pay instead at the kiosks outside.\n\nFoodwise, it was okay.  The noodles were springy but needed some extra oomph. We added some chilli and kecap manis but that made the dish more sweet.  The fried wontons were nice, as was the deep fried chicken cutlet.\n\nThe bakso soup was nice, slightly spicy and herbal, and the balls were chewy.\n\nThe lemongrass and jasmine tea drinks were refreshing.",
      "time": 1715763499,
      "translated": false
    },
    {
      "author_name": "Dinith Minura",
      "author_url": "https://www.google.com/maps/contrib/107983997843281936451/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWE5dTeuC9BPmzDw1l30urm6wTl0q6V2XrkDq8RmvHRDTU7Lm42=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "They offer a captivating feature where customers can conveniently place their orders using a table-mounted kiosk. Each table is equipped with one, allowing you to make the most of your waiting time by browsing the web, shopping online, or enjoying a game. Additionally, they provide wireless chargers, so don't forget to charge your phone while savoring your meal. The staff is exceptionally friendly and accommodating.",
      "time": 1696861676,
      "translated": false
    },
    {
      "author_name": "JT YY",
      "author_url": "https://www.google.com/maps/contrib/108704706430819792288/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVETXGhxayGOdLH9RK3RhQ6LMAAMZqFy2y5E5JfygzeFHZdHbPrkQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Omg~ so nice! I love the texture of the noodles, the small little container of chilli yet potent enough, the fried wanton that has filling and not just fried wanton skin and the overall portion of the meal! The soup is strong in flavour, slightly to the the salty side. Bakso is good. My complete set cost about 10.50 with a drink (lime juice or lemon tea) (i prefer lemon tea), 2 wanton and 2 bakso. I thought quite reasonable! Please don't change ur taste or standard for this particular Jakarta chicken noodles~~~ I always love indo chicken noodles! The sulawesi noodles is just as good too, just that the chicken feels lesser but chilli spicier. No matter how, am coming back again and again! Note: Service may need to slightly speed up when there's more customers but I'll definitely wait for good food! Also, this particular section of shop has always been small so seatings very limited and slightly feels more cramped with people eating and queueing.",
      "time": 1667826925,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3303724772978415630",
  "user_ratings_total": 51,
  "vicinity": "1 Pasir Ris Close, #02-110 E!Hub@Downtown East 1"
}