{
  "formatted_address": "9 King Albert Park, #01-35 KAP Mall, Singapore 598332",
  "geometry": {
    "location": {
      "lat": 1.3369972,
      "lng": 103.7790909
    },
    "viewport": {
      "northeast": {
        "lat": 1.338331330291502,
        "lng": 103.7806890802915
      },
      "southwest": {
        "lat": 1.335633369708498,
        "lng": 103.7779911197085
      }
    }
  },
  "name": "dbom hair (KAP Mall) Aveda Salon (Bukit Timah)",
  "place_id": "ChIJcU27GWgR2jERxW6cMueuDsw",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Pauline Wee",
      "author_url": "https://www.google.com/maps/contrib/113442208195765868656/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUz_DLKjUGkLOhF6kJ93NDOEdoKp27yXqfzBfwzQJWmZ2qYcjPb=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "My husband visited Doom Hair Salon at Bukit Timah for the first time, and he had absolutely no regrets! The experience was fantastic from start to finish. The hair wash was especially relaxing, with a gentle yet skilful massage that made the visit even more enjoyable. The hairstylist (unfortunately, we didn’t get his name) did an amazing job with the haircut—precise, professional, and exactly what my husband wanted. The overall atmosphere was comfortable and welcoming. Highly recommend this salon for anyone looking for great service and a quality haircut!",
      "time": 1742452727,
      "translated": false
    },
    {
      "author_name": "XiNERGY LiN",
      "author_url": "https://www.google.com/maps/contrib/109799344462279679791/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUH767hYHMCJHQ72myC-dxReausXYyQR0qttjKF258Bj4Q_ZQceRQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "This is a 2 storey salon located near the main entrance of KAP. I was shown to the 2nd level where it is less crowded and you won't keep seeing people walking along the mall's corridor. I like the privacy there as no one really fancy others seeing their half done hair. The place is bright with simple decor, comfy chair and I enjoyed the subtle piano version of CNY music in the background. Was served snacks and a glass of water after the stylist checked with me on my desired hairstyle, he made some good recommendations too. The suggested style turned out very satisfactory.\n\nDecided to go for a cut, dye and treatment as CNY is near. After the stylist was done, his assistant took over and gave an aromatic massage while they prepare for the dye. Actually the place doesn't really have the strong chemical smell that you usually get from salons, either cos of the Aveda products they are using or the ventilation was that good. After the application of the dye, the assistant stylist asked if I needed some food. Yes... they allow ordering of food from the cafe next door! I really like the idea as I don't have to go hungry while waiting for the hair to be done and time is efficiently used. I tried the chicken chop from the Eagle Loft Cafe.... its good!\n\nThe treatment commenced once they begin to wash off the dye, they did scalp exfoliation along with cold mist. After that a layer of scalp mask was applied with some steaming and finally ended the entire treatment with sprayed on scalp tonic. Everything felt good, especially when they massage all the stuff on the scalp.\n\nNowadays going for hair cuts is not just about how skillful the stylist is, it has evolved to the entire experience in the salon. I like the cut that I was given, the meticulous service of the staff, along with the step by step explanation of the treatment, the nice music and the soothing smell of essential oils. Not only did I get a good hair cut and treatment, I enjoyed and felt pampered there.",
      "time": 1706944681,
      "translated": false
    },
    {
      "author_name": "Monica Baey Beiermann",
      "author_url": "https://www.google.com/maps/contrib/113470848012814986395/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXHXeVfE3pDc8eYmDV_5bnQVqHyo3I40WOeQK7uwkLOVwjpotEa=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Very satisfied with my haircut! My hair was very thick and unmanageable prior to my cut. Requested to get it thinned and layered, and was really happy with the final outcome :) I appreciate that my stylist asked for feedback once he did the initial cut, and tweaked it based on my request for a more ‘stacked’ layer look. Will be back here next time 😌",
      "time": 1738747021,
      "translated": false
    },
    {
      "author_name": "CN",
      "author_url": "https://www.google.com/maps/contrib/113370930183428228892/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL3Pswv2FlgcM_NpzN9qMAOI2DgKDrE_hbcQEnjtK-ntLFAsg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Cozy salon. Had a great long layered-cut with Fei!  Love the soft layering! Service includes shoulder/head massage & a relaxing hair wash! Definitely highly recommended! Reasonable pricing too with no hard sell of other services! Love it!!",
      "time": 1741331020,
      "translated": false
    },
    {
      "author_name": "Rizwana Sulaiman",
      "author_url": "https://www.google.com/maps/contrib/112830215501593617710/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKRD5NfpSkwJ7vZqQLQJi5aLc4T9h1aEUiMRfyYdBJcoSdhMA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Simply Perfect and the greatest choice🥰 I have been engaging DBom hair Salon for 3 years Plus and Definetly never regretting my Choice. Aaron always Did The best on my hair and Will Always Trust Him to treat my hair with his magic fingers.. Totally Slowly and Patiently not forgeting very Detailed in doing my hair.. I will Choose DBomz again and only salon that i can trust my hair on.. MyHair Was totally Damage and dry and now is Soo shining😍😍 Confident enough to let go my hair everywhere i go😁 This new location feels cozy too and always having a plate of treats super nice of them😇  Thank you Dbomz for always Doing your best 🥰",
      "time": 1708870502,
      "translated": false
    }
  ],
  "types": [
    "beauty_salon",
    "shopping_mall",
    "hair_care",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14703882141421039301",
  "user_ratings_total": 51,
  "vicinity": "9 King Albert Park, #01-35 KAP Mall"
}