{
  "formatted_address": "12 Marina Boulevard, Level 44, Tower 3 DBS Asia Central, Marina Bay Financial Centre, Singapore 018982",
  "geometry": {
    "location": {
      "lat": 1.2792145,
      "lng": 103.854603
    },
    "viewport": {
      "northeast": {
        "lat": 1.280532830291502,
        "lng": 103.8560659302915
      },
      "southwest": {
        "lat": 1.277834869708498,
        "lng": 103.8533679697085
      }
    }
  },
  "name": "DBS Corporate Banking",
  "place_id": "ChIJUe8yJBAZ2jERZTpgvqViRHQ",
  "rating": 2.3,
  "reviews": [
    {
      "author_name": "MIMI Banking 888",
      "author_url": "https://www.google.com/maps/contrib/101207302258330919311/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLJiwykxKIHOhboshaXXzyIuLj6dNjlyPoE8mMeevxFsWV7kQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "DBS ideal forms can vomit blood. Paperless is total not existence. Every little thing you didn’t tick you must refill all forms. Why can you just let the login in approval to approve. I filled up more than 8 forms and 5 more to go. It’s as bad as India visa form. I believe when you shake head left right and design the form . You get a headache for many days. I still don’t know what green ? Emails should remove green. I like to tell green washing . Cause I filled and scrapped many maintenance firm. The best part is every time you call you get a different answer for the same thing. 0 talents so far. No banker . Not like other banks. Bankers are helpful like Japanese banks.",
      "time": 1743329988,
      "translated": false
    },
    {
      "author_name": "Nikhil Kumar",
      "author_url": "https://www.google.com/maps/contrib/115828517497218700967/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocILdaVh7extfRNim7DLxk38ytINy_4buJyftG7qzA9F_8MeoZw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Absolutely the worst experience I ever had with a private bank.\n2.6 Rating on Google speaks for itself.\n\nDBS Corporate took more than 2.5 months to open my corporate account where as they promise to set-up business accounts within 7 working days. The executive assigned to me went missing in action immediately after I had shared all relevant documentation. No calls, No response to mails.\n\nFinally, the account was activated within 48 hours after I made a formal complain but sadly with incorrect company details.\n\nThis delay costed me loss of business and impact on my company reputation. Wasn't expecting this from a bank like DBS.\n\nFurther to the trauma, there has not been any follow-up on the complain submitted and I am yet to receive my corporate account welcome kit and debit cards after 3 months in process.\n\nOnly reason I choose to bank with DBS was I hold a personal saving account with them despite the numerous online disruptions!\n\nPeople who are wanting to open Corporate accounts with DBS, please ensure you get reference numbers after every interaction and else you'll end up calling the hotline number and spending hours just to explain the issue. Better go for a different bank.",
      "time": 1702273349,
      "translated": false
    },
    {
      "author_name": "deaf chef perfect pleasures",
      "author_url": "https://www.google.com/maps/contrib/109933032469850587587/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWApbRMn4s_X327Gb1ICCknB2uMXJwtITmwKsBxVeZN4W-pii2H=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Hi I just want to take time to write about my experience with DBS bank - some officers are great and some are not - so either it is about the individual personality or the training for staff is not consistent or rigorous enough.\n\nAnyway, seems like the bank is too big an organisation and overweight and not streamlined.\n\nDigibiot is a cruel JOKE against their customers with secure mail being malfunctional - and a terrible waste of my time talking to a non sensible, pre-populated, non-dynamic automaton - the whole system is ill-prepared and unable to respond dynamically to new or different situations. All the pre-filled answers caused me more trouble than expected.\n\nHaving said that, I did get my stuff sorted out in the end, thanks to the kind and polite humans I spoke to in the end. They were: Ms Rani, Ms Ira, Mr Chris (corporate helpline) and the super hands-on manager Ms Jeannie Ho at MBFC branch.\n\nHere's a tip: when calling the 1800 hotline, if the voice does not sound helpful, then do not engage with them any further, it will waste time explaining to people who are not helpful.\n\nIssues that some staff were unable or unwilling to help me with, were easily accomplished by the above named. Very happy to give Ms Rani, Ms Ira, Mr Chris and Ms Jeannie Ho 5 STAR reviews. Thank you to them, good luck with your kindness and have a nice day too.",
      "time": 1713423978,
      "translated": false
    },
    {
      "author_name": "K K",
      "author_url": "https://www.google.com/maps/contrib/101744134372523614532/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI_cb4LlVUvmRr57cdZZqeZGFDqcB_fWPmfFgyEbzOGhiCz3A=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Worst experience while trying to apply a corp card. They made it so hard, confused me and waited for months. Hardly follow up.",
      "time": 1704075049,
      "translated": false
    },
    {
      "author_name": "Jing Kang Ng",
      "author_url": "https://www.google.com/maps/contrib/113349185482709724108/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVlGigSoj9lFQLYpLqYZpCkXla7x-x1K59NTLAudx1o6mH2PsRGSQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "2 weeks ago",
      "text": "Worst bank in Singapore",
      "time": 1746449195,
      "translated": false
    }
  ],
  "types": [
    "bank",
    "finance",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8377929670819068517",
  "user_ratings_total": 9,
  "vicinity": "12 Marina Boulevard, Level 44, Tower 3 DBS Asia Central, Marina Bay Financial Centre"
}