{
  "formatted_address": "83 Punggol Central, #01-17A Waterway Point, Singapore 828761",
  "geometry": {
    "location": {
      "lat": 1.4066273,
      "lng": 103.9022552
    },
    "viewport": {
      "northeast": {
        "lat": 1.408455330291502,
        "lng": 103.9032596802915
      },
      "southwest": {
        "lat": 1.405757369708498,
        "lng": 103.9005617197085
      }
    }
  },
  "name": "Delifrance (Waterway Point)",
  "place_id": "ChIJx5SxBOIV2jER2QWSNN39kaE",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Amos",
      "author_url": "https://www.google.com/maps/contrib/103800206493798530961/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVap7pdMCz3GS3b8HRc4nJ4gzSGkUDih8UFtpMJyoi1g6OPksTq=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Had a wonderful experience at Délifrance Waterway Point. The food was fresh and satisfying, but what really stood out was the exceptional service from Chris. Instead of just calling out my order at the counter, he personally brought the food to my table with a warm smile—something you don’t often see at casual dining spots. That small gesture made a big difference and really elevated the whole visit. Kudos to Chris for going the extra mile and making customers feel genuinely valued. Will definitely be back!",
      "time": 1746492380,
      "translated": false
    },
    {
      "author_name": "Nurjannah Purba",
      "author_url": "https://www.google.com/maps/contrib/111905827652465650456/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIyp3OTK2TNPK6aIJQFYQmVTG63GuwtMAgw5KtiuznIG8dQww=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "My favourite place so far, the foods are delicious, and service just nice, but excellent today, because one of them very professional help me to take initiative make payment of mine sort of 90 cent from $50.90 of my bill. After I returned back the amount of 90 cent plus a bit more for his sincere help, he returned me back the balance of my money. It's such a good person with a good heart. I really appreciate. Thank you Chris @ Waterway Point Delifrance. I am your customer n always comeback for the good atmosphere 😊",
      "time": 1746278451,
      "translated": false
    },
    {
      "author_name": "Sneha Babu",
      "author_url": "https://www.google.com/maps/contrib/105522300513183650503/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJIhgifd3RXK-gqabEhucDQy1FizGaEHrG7PFl43AIaQXZ0jYe0=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Splendid service by the staff on 30 April 2025. Helped me decide on the item to buy (Tahiti Pizza - Veg and Hawaiian Style), and was accomodating to my request to heat up the pizza for a longer time. Space is small, hope they can expand into a bigger place!",
      "time": 1745999385,
      "translated": false
    },
    {
      "author_name": "yazami halim",
      "author_url": "https://www.google.com/maps/contrib/113284150546438754025/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUR0A3IsErsemYHHPgu5NzN1lS59PeDwr3xZCMdywT3vk7fcdJh=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "2 weeks ago",
      "text": "Disappointing Service at Delifrance Waterway Point\n\nI’ve always enjoyed visiting cafés around Singapore, but my recent experience at Delifrance Waterway Point was unfortunately one of the worst. The service was cold and unwelcoming from the moment we stepped in. The staff stood behind the counter, expressionless, offering no greeting or recommendations. There was no effort to promote any ongoing monthly specials  or bestsellers—something most cafés do to engage customers.\n\nWhat stood out even more was the poor attitude of the team. The male crew member or manager simply stared blankly at us, offering no assistance. But the real letdown came from the lady at the cashier. I politely asked if my cappuccino could be made with low-fat milk. Instead of answering my question, she dismissively replied, “Cappuccino comes with milk.” Clearly, I’m aware of that—as someone who frequents cafés, I was simply asking if low-fat milk was available. Either she wasn’t listening or was trying to act smart.\n\nTo make things worse, she opened the fridge and showed me the milk they use—without even clarifying if it’s regular or low-fat. If you don’t have it, just say so. Don’t make a show out of something so basic. This lack of product knowledge and customer understanding was disappointing.\n\nDelifrance should really look into training this outlet’s team in basic customer service. Compared to the warm and engaging staff at the Sengkang General Hospital outlet, the Waterway Point team falls far behind. The Sengkang team knows how to greet customers, recommend items, and make people feel welcome—something this team urgently needs to learn.\n\nHonestly, this experience makes me think twice about returning. No surprise the outlet was nearly empty, while your competitor just across the way was bustling with activity. It says a lot when a newer brand outshines a well-established name like Delifrance. Time to catch up.",
      "time": 1746332769,
      "translated": false
    },
    {
      "author_name": "Vittoria",
      "author_url": "https://www.google.com/maps/contrib/102722992549421780935/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUvLZpGEt3EKvsFMipCQlEzClz8BTOtIX53CIGdN33NUHvVg-RSVg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Bought their tarts home, beautiful and tasty. Personally prefer their dark chocolate tart. The sale lady and man are friendly.",
      "time": 1740242606,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "bakery",
    "store",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11642365638241027545",
  "user_ratings_total": 261,
  "vicinity": "83 Punggol Central, #01-17A Waterway Point"
}