{
  "formatted_address": "181 Orchard Road, Orchard Central, #B2 01-10/30, 43 B1, #15-29/K7/K8 &, Singapore 238896",
  "geometry": {
    "location": {
      "lat": 1.3008808,
      "lng": 103.8400248
    },
    "viewport": {
      "northeast": {
        "lat": 1.302243880291502,
        "lng": 103.8413781302915
      },
      "southwest": {
        "lat": 1.299545919708498,
        "lng": 103.8386801697085
      }
    }
  },
  "name": "DON DON DONKI Orchard Central",
  "place_id": "ChIJz9oB1pYZ2jERqaC3PCo3CpQ",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Olivier Guillard",
      "author_url": "https://www.google.com/maps/contrib/105829896502081093659/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUMCa3moxmQtqs4d0MBExw6HcX1gcr-upY6GwSMX9PGAFAd1V5Mxw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Amazing experience at Don Don Donki. We were a group of 6 and had dinner and drinks!\n\nExperience is really fun if you want to have a few drinks while eating from their to go section. Prices are fair and quality is really good.\n\nTry to go before 8 as the to go aisle gets quite empty after that so your options are limited.\n\nWould definitely recommend as a place to go either for Japanese groceries or as a quick and good meal and drinks at a fair price.",
      "time": 1743245052,
      "translated": false
    },
    {
      "author_name": "Flying Molen",
      "author_url": "https://www.google.com/maps/contrib/113209867782143825808/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXoorOWogloQs6l9Imv1chNpScyyLnvHdIM3tcBmqRYMJ6wtBg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Great place for shopping Japanese groceries, snacks, cup noodles, fruits, vegetables, frozen seafood and meats. There are also plenty of ready to eat foods such as bentos, sushi, shasimi, dumplings, fried and grilled foods. Highly recommended place to check out!\n\nSpotted a potential unsafe condition at the open kitchen area where extension cord was not properly secured and exposed to liquid 😬 Hopefully they will fix this potential unsafe condition soon (see the last picture) 🙏🏻",
      "time": 1746007615,
      "translated": false
    },
    {
      "author_name": "Morson Ico",
      "author_url": "https://www.google.com/maps/contrib/100968311625801067677/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWd4qnP9r3xmzcbzaHczdPjW04wijf8IpiCB7vkAhfmh3Jtjpg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Don Don Donki Orchard is a gem for late-night cravings, as it’s open 24 hours! Located conveniently below our hotel, it’s easily accessible anytime. They offer a wide variety of options, from cooked meals and frozen items to fresh produce and unique Japanese snacks. The selection is impressive, and the prices are reasonable. Perfect for a quick bite or stocking up on Japanese goodies!",
      "time": 1741941148,
      "translated": false
    },
    {
      "author_name": "see you latté",
      "author_url": "https://www.google.com/maps/contrib/109562020139406369328/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXhyh2U-LvtwGYzVl--QKv9XPogUtPstS39EWovQmB_8_qODdM2=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Don Don Donki has been the top go-to place whenever we're looking for a quick dose of Japan..be it daily necessities or any random stuff that flutter our hearts. It never fails to captivate hearts with interesting, creative yet practical products.\n\nOrchard Central Branch, operating 24/7 and stocked high with dizzying array of food, beauty and lifestyle stuff, makes it convenient for its customers. One standout item here (for us) is the yummylicious Wagyukushi😋😋😋 The freshly-grilled, mouth-watering Wakyukushi is so irresistible, a must-get for all beef lovers! Getting these delectable treats has become our ritual every time we're here. YES, our cravings finally satisfied!!!\n\nCuts of marbled Wagyu beef are sliced super thin, stacked, skewered, sliced into square columns then grilled on a flattop. The Wagyu is perfectly flavored - simply sprinkled with dashes of salt and pepper; the fragrant smell of fat and char aroma from a distance already whets appetites! The first bite of that piping hot savoury Wagyu is pure bliss to the senses! Every bite an explosion of flavors!!! Not overly greasy, tender and juicy🎯🎯🎯😋😋😋\n\nWagyukushi is not pre-made to be left in the food warmer, waiting for someone to buy them. Donki crew cooks to order so be prepared to wait about 10 minutes or so. This means food arrives fresher and hot.\n\nRegular skewers go for SGD4.90 per stick or SGD8.90 for a pair, skilfully seared to perfection teppanyaki-style live in front of you upon ordering. Look at how glorious they look sizzling on the grill!\n\nWe're lovin' every moment savouring the umami-rich Wagyukushi😋😋😋 To us, these Wagyu beef skewers are just too good to pass up; neither one visit nor a stick is ever enough!!!\n\nWhether you're looking for a quick snack or wanting to indulge in melt-in-your-mouth Wagyukushi without worrying about breaking the bank...this is your place! Note there's limited stock prepared in a day; available until sold out (by 7.30pm I think).",
      "time": 1740556144,
      "translated": false
    },
    {
      "author_name": "Drew Esa",
      "author_url": "https://www.google.com/maps/contrib/100231074350729929090/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXbY-LlQwgScLqZ3KVkLeyGbC_z9xkRCYEx3j_ij_6uc9Sc2PIL=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Those who have lived in Singapore for at least one year are used to the fact that the grocery stores close at 10pm! How come?! And if you work late and after work you go to the gym and then call your parents, how will you have time to go to the store to get groceries? For such busy people there is Don Din Donki, which is open 24 hours a day! I have this wonderful store near my home in the center of Singapore that has absolutely everything! Some clothes and underwear, children's toys and hygiene products, household chemicals and utensils, sweets and wine, meat, milk, fish, fruits, vegetables, drinks and even ready-made hot meals. Very convenient. Prices in Don Don Donki are a little higher than in the usual stores or online stores with delivery, but firstly, a lot of quality goods from Japan, because it is a Japanese store, and secondly the store is open 24 hours. I recommend this store👍",
      "time": 1740121644,
      "translated": false
    }
  ],
  "types": [
    "supermarket",
    "grocery_or_supermarket",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10667399321927262377",
  "user_ratings_total": 6495,
  "vicinity": "181 Orchard Road, Orchard Central, #B2 01-10/30, 43 B1, #15-29/K7/K8 &"
}