{
  "formatted_address": "1 Jalan Anak Bukit, #02-20, Singapore 588996",
  "geometry": {
    "location": {
      "lat": 1.3390447,
      "lng": 103.7789794
    },
    "viewport": {
      "northeast": {
        "lat": 1.340380380291502,
        "lng": 103.7803726302915
      },
      "southwest": {
        "lat": 1.337682419708498,
        "lng": 103.7776746697085
      }
    }
  },
  "name": "Dorothy's Baby & Child Clinic",
  "place_id": "ChIJv1j8_YgQ2jER5RXh1M-GEcg",
  "rating": 3.8,
  "reviews": [
    {
      "author_name": "Kelly Ho",
      "author_url": "https://www.google.com/maps/contrib/114470588106763065387/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJscqfgzARubXKinSE8xGVwMxOVcqG7QKzZMtuC9RmeIIWpHA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "We brought our girls (2 years, and 5 months old) to see Dr Dorothy this morning for their coughs.\n\nWe thought that our elder girl's cough was caused by our viruses because both my husband and I were down with viral infection. Dr Dorothy took time to understand our daily habits and discovered that our elder girl's cough was more of a reflux issue rather than a viral infection. We were impressed by her meticulousness. A normal GP would have just prescribed cough syrup and move on to the next patient.\n\nDr Dorothy is a no nonsense doctor; she does not mollycoddle. However, she listens. We shared our elder girl's topical steroid withdrawal journey with Dr Dorothy. Instead of rebuking us for not following our previous dermatologists' advice to use steroids to manage our elder girl's eczema (which is the experience faced by our mommy friends), Dr Dorothy was open-minded and empathetic. Dr Dorothy even recognised that steroids might not work all the time.\n\nWe would highly recommend Dr Dorothy to all parents with young children.",
      "time": 1702449328,
      "translated": false
    },
    {
      "author_name": "Gladys Toh",
      "author_url": "https://www.google.com/maps/contrib/100021779637745818877/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVgDz4a_jKeMS3WUwefawMtg4qcJcXaXVxlKu4eDZ8iXzg7br_omA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Came here on a friend's recommendation after our child has been sick for more than a week. Dr Dorothy was able to get to the root of the issue, listening intently and empathetically. She did not rush through her consultation with us which we really appreciated. Front desk was also helpful and kind. Would recommend!",
      "time": 1690518777,
      "translated": false
    },
    {
      "author_name": "Pui-Mun Wong",
      "author_url": "https://www.google.com/maps/contrib/109776861140915137498/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJlGUeJocOidMZ-BjhiJGrcwUTKZaZkrXe6yryp9Cc6Ej8hlg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Dr Dorothy has been our family pediatrician since our kids were born. She is patient and thorough, always generous with sharing her knowledge and taking the time to explain things or address concerns that we may have. Her receptionists are proactive, kind and professional as well, anticipating our needs and returning our calls whenever they can, even during peak flu seasons when most good clinics in Sg are overrun. They have always been a reassuring presence for us and we are truly grateful to have such a reliable clinic near by.",
      "time": 1679755114,
      "translated": false
    },
    {
      "author_name": "S T",
      "author_url": "https://www.google.com/maps/contrib/104821661001182224987/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU973U9pMpE-r5jnNGenKLG2uzZUVrfJuGcvDc89pe7U3WSFwTC=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "I thank God for Dr Dorothy who immediately and expertly treated my grandson who was running a fever of 39.8, rising to 41 at her clinic. She immediately sprung into action with her very equally competent receptionist to bring his fever down. When that was taken care of, she mapped out in detail the management of his fever with a chart (that was most useful) over the next few days, telling us when we need to go to A&E, while assuring us it will break by the second or third day and it did.\n\nThe next day my son-in-law was pleasantly surprised and comforted when she called him to check up on his son. She readily took my calls to update her of his progress and patiently went through every detail. When she found out that my daughter had just given birth, she also took my daughter’s call to convince her on the need to separate the sick child and the newborn until it is safe.\n\nI have never met a doctor in all my life who is so devoted to the care of her young patient and the family members. She was so thorough and provided all the medicine we might need (and we did) so that we did not have to go back for them. She even prepared a letter in case we need to go to the hospital A&E, and took a flu test to help narrow down the possible causes.\n\nI am so grateful to her for having saved my grandkids from this episode which could have gone really bad. And also for the very lovely receptionist who gave me an appointment earliest possible and help with the treatment of my grandson. To them, I am eternally grateful.",
      "time": 1632135611,
      "translated": false
    },
    {
      "author_name": "Kassie Tan",
      "author_url": "https://www.google.com/maps/contrib/107919972612574978150/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJZZElNtUjqOA2A45b6pfL4stKDrhZ571XoBAWemCuDQQBYXANO=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "Had a bad first experience 1 yr ago and decided to try again but it was even worse. Called the patient's name wrongly and we correct them to confirm its our turn, then doctor just said \"Whatever la, what are you here for?\"\nThen went on to judge on things beyond what we went to consult for, i.e. how to parent your kid 101. Called my 16 months old a princess just because we shared that we have encountered some roadblocks with toddler feeding, which is perfectly normal for this stage in case she doesnt know. But never mind we never wanted to waste time to explain anyway and doctor just wouldnt let go and asked if we pampered her too much cos we had a hard time conceiving (which wasnt the case again and she likes to judge). So according to this theory does it mean if it is easily conceived, then the child will be treated as \"non-princess\"? I dont know where does this come from anyway. And its not even related to my child's illness. Totally not recommended for parents not cos of the medical treatment given but just to avoid hearing tasteless and judgemental comments unrelated to the sickness, which sounded like shaming the child and parents for nothing.",
      "time": 1682408723,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14416452109377541605",
  "user_ratings_total": 29,
  "vicinity": "1 Jalan Anak Bukit, #02-20, Singapore"
}