{
  "formatted_address": "1 Orchard Blvd, #02-06, Singapore 248649",
  "geometry": {
    "location": {
      "lat": 1.3033039,
      "lng": 103.8239218
    },
    "viewport": {
      "northeast": {
        "lat": 1.304617780291502,
        "lng": 103.8253990302915
      },
      "southwest": {
        "lat": 1.301919819708498,
        "lng": 103.8227010697085
      }
    }
  },
  "name": "Dr. Warren Lee's Paediatrics",
  "place_id": "ChIJe3hxNBIZ2jER_S48tBbAseU",
  "rating": 2.5,
  "reviews": [
    {
      "author_name": "Antony Widjaja",
      "author_url": "https://www.google.com/maps/contrib/111080887442937640072/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX3zvtldzL7aCykiAUS2Lx3Cc1D2zOtGkrq0dA2CgkJriIo0Nhg=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "a week ago",
      "text": "My daughter has been seeing Dr. Warren Lee. He is quite experience but his fees are high: SGD 8 per minute. So if a patient spends 30 minutes with him, then the consultation fee will be SGD 320 plus GST. Dr. Lee is like a \"teacher\" who likes to teach and explain the process of the patient's symptoms and the process of his diagnosis. It is good and bad. Good because he take the time to try to make you understand his thought process. Bad because it is SGD 8 per minute. He is quite busy because there are very few doctors in this specialised space.",
      "time": 1746846652,
      "translated": false
    },
    {
      "author_name": "Efrey Fars",
      "author_url": "https://www.google.com/maps/contrib/118003996468220582937/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJfLAw2jj7a7MVrCqkiGlLx4FHRYGOJNoIx6LKMu10xYAhKjA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "I recently visited Dr. Warren Lee’s Paediatrics, Growth & Diabetes Centre at Camden Medical Centre in Singapore, seeking consultation for my younger child due to Dr. Lee’s reputed expertise in paediatric endocrinology. Unfortunately, the experience was profoundly disappointing.\n\nDuring the consultation, my spouse and I were accompanied by our two children. Our older child, being naturally curious, interacted with items in the room, such as the weighing scale and some stationery. Given that this is a paediatric clinic, we expected a child-friendly environment that accommodates typical child behavior. Instead, the assistant reacted with hostility, raising her voice and demanding that our older child leave the room without prior warning or attempts at gentle redirection. This unprofessional conduct created an unwelcoming atmosphere, lacking the patience and respect essential in paediatric care.\n\nAt one point, when we attempted to assist them in handling our child during the physical examination, the assistant curtly instructed us to “get out of the way.” Even more disheartening was that Dr. Lee completely sided with his assistant’s approach and informed us on the spot that he would not continue to provide services to us. This response struck us as irresponsible and lacking in professionalism.\n\nMoreover, the clinic’s per-minute billing at a high rate means that any delays due to children’s behavior are financially borne by the parents. Despite this, there was a noticeable absence of basic decency and patience from the staff right from the start we entered the treatment room.\n\nConsidering this experience, I would not recommend Dr. Warren Lee’s clinic to other parents due to the evident lack of professionalism and child-friendly engagement.",
      "time": 1735306891,
      "translated": false
    },
    {
      "author_name": "2020",
      "author_url": "https://www.google.com/maps/contrib/107487034919237436112/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUbpVvqVb0TBOnIZ6brZfyxCkvuaQzH4O3cFg_yl87Pc3yTVddR=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "no any improvement. waste time,waste money. most cost is lost child growing chance under non professional adivice. very regret. seems a white mice to test.",
      "time": 1738882238,
      "translated": false
    },
    {
      "author_name": "Godschild 70",
      "author_url": "https://www.google.com/maps/contrib/104800738296087354290/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKrgTKiIUEKUS5jc-FooMkcLQ6NzrKO0FZR8kW-7Q-pPhgZaA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "Inadequate doctor!\nBasically this doctor anyhow charged as I did on timer on my phone when the nurse called for my daughter. Also check my teenage girl’s body and private part without pre-inform us. My daughter got shocked and cried after leaving the clinic.  We spent around $500 plus in his clinic and never ever return! And got only a file that he typed. Basically he only kept typing and showing off to us his clinic many foreigners and Indonesian patronizing him.  Parents just becareful if you bring your girls there. Hope he changed after I reported him using my another account (attached photo - my original records was deleted by owner) count him lucky I didn’t complain to Smc or Moh to complain!!",
      "time": 1746906809,
      "translated": false
    },
    {
      "author_name": "DAISY UY",
      "author_url": "https://www.google.com/maps/contrib/115489386710363124940/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIAbSxNvU243JZ8mw4s7bcZkx3P0Bx0KZ6-35zNECJTSMs8FQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "We had an exceptional experience with Dr. Warren Lee. He is not only highly knowledgeable and thorough, but his genuine care for the welfare of our child really stood out. Dr. Lee takes the time to explain every aspect of the diagnosis and treatment plan, ensuring that we fully understand what’s happening and why. He is patient and never rushes through appointments, addressing all our concerns with empathy and expertise. It’s clear that he prioritizes his patients’ well-being above all else. We feel fortunate to have found such a dedicated and compassionate pediatrician.",
      "time": 1723887438,
      "translated": false
    }
  ],
  "types": [
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16551221309308940029",
  "user_ratings_total": 18,
  "vicinity": "1 Orchard Boulevard, #02-06, Singapore"
}