{
  "formatted_address": "6 Napier Rd, #09-09 Gleneagles Medical Centre, Singapore 258499",
  "geometry": {
    "location": {
      "lat": 1.3070598,
      "lng": 103.8201775
    },
    "viewport": {
      "northeast": {
        "lat": 1.308508830291502,
        "lng": 103.8214928802915
      },
      "southwest": {
        "lat": 1.305810869708498,
        "lng": 103.8187949197085
      }
    }
  },
  "name": "Dr BL Lim Centre For Psychological Wellness",
  "place_id": "ChIJuWj-GCAa2jERqhwDuqBr04g",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Nathan Tan",
      "author_url": "https://www.google.com/maps/contrib/116370131338029602487/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjULSDPsvkRSFcjVAWKd9Fw7fADcKUMqkIWyhMy4aACcezGxKfA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Dr Lim is an outstanding medical professional who treats psychiatric conditions of varying severity with an equal amount of compassion. I have seen him a few times and never once did i feel alienated. He talked me through my condition clearly and discussed my management plan with me, tailoring it to my schedule. Most importantly, he is down to earth and cheerful. Front counter staff were amazing too. If you need a good psychiatrist, do consider paying him a visit, his prices are very reasonable as well!",
      "time": 1742549110,
      "translated": false
    },
    {
      "author_name": "Marcus Lee",
      "author_url": "https://www.google.com/maps/contrib/117145478954027465760/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJAoxp9nNO1_eoFz8eO2up7lQR6JOrCMwK4x7GcBg2wijV8Bg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I really appreciate Dr Lim for being my rock during troubled times. He is always reassuring and insightful, after each session, I always take away some wisdom.\n\nWhen I first came to Dr Lim, I was at my lowest. One thing he said that stuck with me was to trust him and trust the process. It wasn’t easy, and he has since seen me go through many highs and lows.\n\nHe is consistently open and caring you can genuinely feel that he gives his fullest attention at every moment. He always makes sure to ask if I have any thoughts, questions, or feelings I'd like to express.\n\nWhen seeking a psychiatrist, it's essential to find someone you can trust and communicate openly with, so they can truly understand how best to help. Dr Lim ticks every box, and I'm sincerely grateful to have found him.",
      "time": 1742564205,
      "translated": false
    },
    {
      "author_name": "Mieke Song",
      "author_url": "https://www.google.com/maps/contrib/102434792253732195449/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUGjhkMssY4cHiZRS97Js4vAoPXVjP3FfZjXkX3QywoSiplijDo=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I've been going to this clinic for years and my life has vastly improved with their help. Dr Lim is friendly, empathetic, and honestly quite funny so it makes it really comfortable and easy to speak to him. He's really straightforward and offers more pragmatic insight which I find quite useful for my needs. Perhaps this approach is not suitable for everyone but I've found that Dr Lim has always listened to my issues without judgment and I feel that he really does his best to relate to me during appointments and I appreciate that a lot. His approach allows me to consider different perspectives.\n\nThe staff here are also friendly and kind. They've been very helpful whenever I've called in with a question or to book an appointment. I've also recommended their services to some of my friends because of my positive experience here!\n\nI've noticed that wait times can be longer during weekends or peak timings but I've not had much of an issue with this as the staff will usually inform me when I arrive so I can go lepak elsewhere until they call me in.",
      "time": 1741574341,
      "translated": false
    },
    {
      "author_name": "Kevin Pillay",
      "author_url": "https://www.google.com/maps/contrib/105859975752692859213/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLCdlCpy-YHVoJb-ELZXldMJw-PcACKm2Rl9VJ8YY9SUzcwNg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Dr Lim, his wife and his team at Dr BL Lim Centre For Psychological Wellness have provided exceptional service since I met them several years ago. They do their very best to attend to last minute requests and they always prioritise their clients and the service provided to them first, above everything else. Please do not hesitate to reach out to them should you require any help. You’ll be in the very best of hands!\n\nThank you Dr Lim and Team 😊",
      "time": 1744430153,
      "translated": false
    },
    {
      "author_name": "David Reid",
      "author_url": "https://www.google.com/maps/contrib/107940038636033025442/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWuOUAZRlFD9OqYQFfdIeNjkP7jkYrLMTS7rUCSd3-7jViOqIhCRQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "An incredible and informative professional. Was incredibly to help me adjust and see me regularly whilst out here on a year-long placement. Dr Lim was very fair with his assessments and reviews, taking the time to explain our discussions and what I was to expect with treatments and such. He listened to my issues and experiences and use them to make informed decisions. The receptionist staff were always friendly from when I entered to when I left the office. It has been a pleasure being treated by the staff and totally believe without the team, I'd have struggled 100 times more. Thank you!",
      "time": 1734005076,
      "translated": false
    }
  ],
  "types": [
    "book_store",
    "hospital",
    "doctor",
    "store",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9859342347303853226",
  "user_ratings_total": 103,
  "vicinity": "6 Napier Road, #09-09 Gleneagles Medical Centre"
}