{
  "formatted_address": "8 Sinaran Drive #06-13 Novena Specialist Center Sincere Medical, Specialist Center, Singapore 307470",
  "geometry": {
    "location": {
      "lat": 1.3200182,
      "lng": 103.8447218
    },
    "viewport": {
      "northeast": {
        "lat": 1.321488680291502,
        "lng": 103.8460602302915
      },
      "southwest": {
        "lat": 1.318790719708498,
        "lng": 103.8433622697085
      }
    }
  },
  "name": "Dr Lim Min Yu",
  "place_id": "ChIJ067AIyAa2jERfdzGoXyVgAk",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "K H",
      "author_url": "https://www.google.com/maps/contrib/107810340858049600968/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWx8hDAtU3Uzd7LtL4jDXxzGDkZDq86YzIyhIhDWc3rVk458a5n=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "I contemplated for a long time on whether to write this but have decided to do so in the event that potential patients refer to such reviews.\n\nI saw Dr Lim for an O&G related matter - non pregnancy. If you’re going to him for pregnancy or fertility issues he might remain a good option.\n\nBut anything other than that and I do not recommend.\n\nSituation 1: additional doctor\n1) on my first operation, I was not briefed beforehand that there would be another doctor in the room.\n2) was only made aware of this when I was wheeled into the OT\n3) this doctor was wearing her mask below her chin in a sterile environment and talking to Dr Lim who already had his mask up. Anyone who works in the medical industry knows this is NOT standard practice\n4) I was told that she would be assisting the procedure but not that she would actually touching me - which I believed she did because it felt like 2 different paired of hands on me. Note: this is an assumption and not factual\n\nSituation 2: lack of proper briefing & conflicting information\n1) I always had to be the one asking questions on what to expect and how to care for myself moving forward\n2) I was told I’d be given LA, then was not given anything.\n3) had a cyst that was too insignificant to remove, and was told not to worry / monitor every few months. But on the follow up before my second operation, i was asked if I wanted to scan again and it was suggested that I could remove it together. I turned down the additional ultrasound scan and said I would like another professional opinion about this. Having asked for more opinions after this, I now know that this was excessive and not necessary. I’m glad I didn’t move forward with this because it would have extended the operation. In hindsight this might have been either a miscommunication or differing in opinion - but this is how it appeared to me\n\nSituation 3: literally NO FOLLOW UP\n1) after my second operation, I was given painkillers despite being told I’d be given antibiotics\n2) there’s literally NO follow up since then. I don’t know if it’s an oversight of the doctor or the team, but this is awful?! How can you drop a patient just like this?\n3) given my bad experience thus far I’ve decided not to follow up cause goodness knows I’ll be putting myself through more anxiety\n\nSituation 4: bad communication\n1) on multiple occasions, I had to follow up to request for information / documents that I was told would be sent to me.\n\nsome examples:\n• operation was schedule on a date that I did not provide beforehand\n• had to prompt to reply to insurance company who had questions, in order for LOG to be issued\n• had to request for test results to be sent to me instead of it being automatically shared\n\nI have read such good reviews of Dr Lim and heard of him through connections and his days in the public sector. It’s disappointing to see this kind of treatment in a private setting.\n\n2) my insurance covers 100% for the cost, and after consultation at times I was recommended to pay upfront (something about how certain outpatient/ inpatient coverage - cannot speak for the exact way it was phrased).  The first time I paid, the second time I denied this and I believe there hasn’t been any issue with claims thus far.\n\nMy recommendation to patients: if your insurer covers the cost, do not pay upfront if not needed: DYOR and read the details.\n\n-\n\nThat said, the silver lining is that I do believe the operation might have been successful (to update in the future). There was once instance the staff was also very accommodating and kind, which I appreciate.\n\nBut my overall experience has been traumatising to say the least, and my stance remains the same.\n\nIn case the clinic tried to take my review down, I’ve attached a photo to show proof of communication with the clinic - and can further substantiate appointments if needed.\n\n-\n\nUpdate: I’ve been contacted after posting this review but will refrain from following up until I’ve sought more legal and medical advice. The clinic has kindly shared my medical reports and tests with me.",
      "time": 1744257918,
      "translated": false
    },
    {
      "author_name": "Vidya Sankaran",
      "author_url": "https://www.google.com/maps/contrib/109420574598857252663/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLUB0NAUYfPRMYuRtzrAQ1gVdOivcyivdT9knNJxB2qpMzZ_w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "We are extremely grateful to Dr. Lim and his team for diligent care through our pregnancy and birth of our healthy baby girl.\n\nDr. Lim is extremely calm and consultative in his approach, clearing all our doubts patiently and discussing the way forward over the several months we were with him. He has a systematic manner of ensuring healthy progression of pregnancy for both the mother and baby.\n\nAt 35 weeks, when I was diagnosed with pregnancy induced hypertension, he started immediate treatment through medication and monitoring, and delivered my baby 2 weeks later to optimise baby’s maturity at birth and my health.\n\nWe also found his team very helpful with logistics and medication through this time. Special shout out to Diyana who was very supportive at the clinic, and constantly available on WhatsApp through business hours for any assistance.\n\nA big thank you to Dr. Lim and his team for helping us manage the ups and downs of bringing our little girl to this world 🙂❤️",
      "time": 1739948242,
      "translated": false
    },
    {
      "author_name": "Lau Appie",
      "author_url": "https://www.google.com/maps/contrib/102739856412942966450/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXjvYo6OlsgMrlOGQReWJzdg8brB5-I5ZJXKLCJZz6nB3RjlCfj=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I am beyond grateful to Dr. Lim for bringing my son into this world through IVF. From the very beginning, Dr.Lim was compassionate, understanding, and incredibly knowledgeable, guiding us through every step of the journey. The IVF process can be challenging, but Dr. Lim and their team made it as smooth and reassuring as possible, always providing support and clear information. Thanks to their expertise and genuine care, my dream of becoming a mother has come true. I couldn’t have asked for a better gynecologist and am so grateful to Dr. Lim for making this miracle happen!",
      "time": 1730707614,
      "translated": false
    },
    {
      "author_name": "Joane Chong",
      "author_url": "https://www.google.com/maps/contrib/107149319569933873713/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVSWCMNjM8aMG4qRyrPWR9XvZ8l8S3A8SrjMZPOQkDTw5RbUquv=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "We highly recommend Dr Lim to any expecting mothers. He is very patient and is willing to answer to any doubts that you have. The whole pregnancy and delivery was smooth and comfortable. We knew that the baby & I were in good hands. Thank you Dr Lim for your help in delivering our precious little one.",
      "time": 1724383060,
      "translated": false
    },
    {
      "author_name": "Charuta Deo",
      "author_url": "https://www.google.com/maps/contrib/100650154967966352243/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV4xtEoooEl0ct-qq93T7hOwfGrRW0h-J7Tb-FUL4RsVW57uK5PBw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I would like to highly recommend Dr Lim Min Yu for your sweet baby journey!!\nHe delivered my baby and the whole process was smooth. He was very thorough in the process and took care of all the required tests and other aspects during my pregnancy journey. He made sure that I am very comfortable throughout and answered all our questions in depth, which gave us very clear idea of the process. Me and my husband trust Dr Lim and would recommend it to anyone who is going through their process of pregnancy or getting pregnant.\nRemember to enjoy the process!!!",
      "time": 1696300180,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=684711505882963069",
  "user_ratings_total": 25,
  "vicinity": "8 Sinaran Drive #06-13 Novena Specialist Center Sincere Medical, Specialist Center"
}