{
  "formatted_address": "10 Jln Serene, #02-02/03 Serene Centre, Singapore 258748",
  "geometry": {
    "location": {
      "lat": 1.3225807,
      "lng": 103.8136111
    },
    "viewport": {
      "northeast": {
        "lat": 1.323788730291502,
        "lng": 103.8149933802915
      },
      "southwest": {
        "lat": 1.321090769708498,
        "lng": 103.8122954197085
      }
    }
  },
  "name": "Dr Priya Sen Skin & Laser Centre",
  "place_id": "ChIJW0NCmwYa2jERQwUQjJCGJf0",
  "rating": 3.9,
  "reviews": [
    {
      "author_name": "Sushmita Mohanty",
      "author_url": "https://www.google.com/maps/contrib/107434603794553604135/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ3C4zNIN73S9N6GEVtWUhCJ82z2WAYehLk6u_zNB-uNWYn6w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "I visited Dr.Priya with acute pigmentation caused due to lichen planus pigmentation, she not only understood the problem but helped to get to the root cause.With a combination of oral medicines and topical application creams she helped me manage my condition and regain my confidence. Many thanks Dr.Priya for your patient listening and diagnosis. 🙏 its my good fortune to have met you at the right time , thank you",
      "time": 1746503834,
      "translated": false
    },
    {
      "author_name": "Rebecca Wiener",
      "author_url": "https://www.google.com/maps/contrib/106398159422788314025/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX1YJCmODw5YQhmwE7KVlBytWgB5DhCTOUxkebhrtxOHeT0kKGG=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Chose Dr. Priya several years ago for my Accutane treatment, and I couldn't be more grateful for her expertise. Thanks to her guidance, my acne is now under control, and my skin looks the best it ever has. New friends are often surprised when I show them photos of my skin before treatment—it's hard to believe how much it’s improved!\n\nMost recently, Dr. Priya helped me with a cyst that developed on my body. As always, she was professional and provided effective treatment that brought me relief quickly. The cyst has now healed fully and is no longer on my mind.\n\nI have also used her face moisturiser as well ever since my first visit. It works well for my skin!\n\nI highly recommend Dr. Priya to anyone struggling with skin issues. She’s someone you can trust to provide personalised, effective care.",
      "time": 1734335995,
      "translated": false
    },
    {
      "author_name": "Shivani Retnam",
      "author_url": "https://www.google.com/maps/contrib/104945635376216287487/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIMUsc_QHkgmMzKboh5sH0NBD9LB2aR2Cmt8-NMAaJJb_wnLQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Dr P has helped me with a number of skin issues, but most recently I have been so amazed by the tablets for hair loss that Dr P collaborated with Moom on. I have struggled with hair loss for some time and tried so many things. After I started taking these tablets, it’s the first time that my hair has actually stopped dropping. I don’t know how those pills worked their magic, but I am so very grateful!",
      "time": 1741139406,
      "translated": false
    },
    {
      "author_name": "Kaoru Fujiwara",
      "author_url": "https://www.google.com/maps/contrib/102765568658191273199/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWSd0wrVbn0_b7Fh8hIxeIgx4Xgfdy0g4VkxnHValAfDN0Z7Tyi=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "I've been a patient of Dr. Priya Sen for many years now, seeking her care whenever I have skin concerns. I am consistently impressed and grateful for the exceptional level of care I receive from her. Dr. Priya always takes the time to attentively listen to my worries and provides clear explanations of my diagnosis and treatment options, putting my mind at ease😊\n\nNot only is Dr. Priya incredibly knowledgeable and professional, but her genuine compassion sets her apart. It is evident that she deeply cares about the well-being of her patients. Thanks to her expertise, the treatments I have received have consistently delivered excellent results, for which I am truly thankful.\n\nFurthermore, the office staff are friendly and efficient, ensuring that scheduling appointments and any necessary follow-ups are a smooth process. For anyone in search of a doctor who combines expertise with empathy, I wholeheartedly recommend Dr. Priya Sen!",
      "time": 1725648478,
      "translated": false
    },
    {
      "author_name": "ruby gaba",
      "author_url": "https://www.google.com/maps/contrib/116256442110233008507/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIPkd0lOA5KTLtdjAJibk0sutkKGQqW6K2Sl9uPftjPSsIeoA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My experience with Dr Priya Sen has been extremely fruitful.\nI thank God that I found her.\nShe is one of the best doctors I have come across. She is one extremely experienced , knowledgeable, polite, sympathetic and understanding dermatologist.\nI had severe facial acne with blood and pus in it  ..it was really bad... but Dr Priya gave me a new refreshing skin with her high-quality products and treatment.\nShe helped me gain my confidence back, which I was losing before consulting her.\nShe followed all the protocols and measures before starting her treatment and understood the problem well and then prescribed the medicines and products required depending strictly upon the condition of my skin.\nAnd now my skin is shiny and smooth  with zero acne...I am smiling again.\n\nI have total faith in her treatment so much so that I took my teenager to her without an iota of doubt for his severe acne problem.\nAnd the results are amazing....hands down...as expected!!\nHis acne is gone, and the skin is beautiful and smooth again!\nI am happy to see him happy and confident again.\n\nI am really thankful to her for giving me and my son a new beginning .....she is simply amazing.\n\nI truly highly, highly recommend her to all those who are looking for a genuine, knowledgeable dermatologist with excellent treatment,  products, and the results!!",
      "time": 1708351144,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=18241133821117334851",
  "user_ratings_total": 138,
  "vicinity": "10 Jalan Serene, #02-02/03 Serene Centre"
}