{
  "formatted_address": "160 Robinson Rd, #03-13/14 SBF Medical Suites, Singapore 068914",
  "geometry": {
    "location": {
      "lat": 1.2782794,
      "lng": 103.847904
    },
    "viewport": {
      "northeast": {
        "lat": 1.279665930291502,
        "lng": 103.8492777802915
      },
      "southwest": {
        "lat": 1.276967969708498,
        "lng": 103.8465798197085
      }
    }
  },
  "name": "Dr Shane | The Aesthetic Practice (Singapore)",
  "place_id": "ChIJm0cq3RAZ2jERonEYvUC_3h0",
  "rating": 5,
  "reviews": [
    {
      "author_name": "shirlene oliveira",
      "author_url": "https://www.google.com/maps/contrib/108486967165420950418/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKPANu5T5VK_CzAEpwzHa9TJj-syhQLZ4h5vvILIYhB8JYnKw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I’m very happy and satisfied with the service at The Aesthetic Practice. Dr. Shane is extremely knowledgeable and shows the utmost care for his patients. I was mostly attended to by Stella, his assistant, who is equally knowledgeable and made me feel so welcome and comfortable throughout my treatment. Thank you so much for the wonderful experience! Highly recommend Dr. Shane and his team!",
      "time": 1733285971,
      "translated": false
    },
    {
      "author_name": "Alvin Alee Lee",
      "author_url": "https://www.google.com/maps/contrib/113101618995877196774/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVQxNzmUYmlD4BQXq0qSErn2A9OFdepyrNY1Hd7DdIo8aHBM1cOwA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Highly recommended for everyone!!!\nFrom the moment I entered the clinic, to the moment I leave, the whole experience was so flawless yet relaxed.\n\nDr Shane was amazing, I personally have a phobia of needles, low pain tolerance, experience fainting spells when triggered, but Dr Shane elevated the experience and made the whole procedure felt smooth and with minimum pain.\n\nDr Shane's aesthetic sense and taste of beauty, is awesome too.. everything was explained to me and I have a clear idea of what we were trying to achieve prior, even though I didn't express to Dr Shane what I would like to achieve, his thorough and detailed consultation managed to pinpoint what I had in mind.\n\nDr Shane is also really meticulous when it comes to his work, as someone who looks at faces for my work for 15yrs, including mine, Dr Shane was able to identify what should and possibly, I would want to correct and he took the time to perfect the application of the fillers rather then jamming a huge shot in a single location, taking his time to meticulous  inject and spread it across multiple injection site, creating a really natural and aesthetically pleasing lower jaw line and nice chin projection that is symmetrical.\n\nDr Shane is like a flawless synergy of Skill, Wisdom, Passion and Aesthetic Sense, which if any component is missing, it would not have been possible.\n\nSpecial thanks to Hazel & Maya too... they too, elevated the whole entire experience of my first filler procedure.",
      "time": 1712758895,
      "translated": false
    },
    {
      "author_name": "Garima",
      "author_url": "https://www.google.com/maps/contrib/100644327130747678098/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWbeWDHHzo9z-U21jlb9hHxPx81khHO-356Q8BtXoKRyGjWax0t=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Dr Shane is one of the best doctors in town, hands down! Not only is he super knowledgeable but takes so much time to explain everything. He and his team, Hazel, Stella and Maya, genuinely care about their patients and you can actually see great results. So glad to have found them!",
      "time": 1713941987,
      "translated": false
    },
    {
      "author_name": "Alexander Tan",
      "author_url": "https://www.google.com/maps/contrib/109612587475428698302/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXUre9ZtxFEWqztkC6RUJuUlq1v6PL7YaqFbuHwDLVjgT9GaLP1=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Dr Shane and team took great care of me for treatment of my skin lesions. He was candid, ethical and professional in assessment, education/counselling and recommendation of treatment options. He knows the evidence for what he recommends. In execution of treatment, he was meticulous in using the lasers and exceedingly mindful of pain management. He went the extra mile for me and I’m sure he will for you too.",
      "time": 1702293527,
      "translated": false
    },
    {
      "author_name": "RaChelle sy",
      "author_url": "https://www.google.com/maps/contrib/101946108062311189159/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocInA-jBGhfXeEejDBwQzx9Tj6hBsCMsyPlxu8Xju-vsnz61vVFX=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "I rarely give high reviews to clinic, especially for skin, I’ve been to plenty of skin specialist for my bad acne scarring and none of them is as personal, welcoming and sincere like Dr Shane. I did my procedure today, regardless of results, I do think Dr Shane clinic is worth going, he look at every little detail of his work on your skin. He take his time to explain and he put In extra effort to make sure the treatment is done as painless as possible.\n\nHis nurse is friendly, not pushy and most importantly, they are warm and treat scar patients with sensitivity. Many acne scars patients has low self esteem, with even the slightest bad attitude can be a major turn off. Today, I did not feel it at all and I felt fully respected and pampered as a patient.\n\nI will recommend his clinic to the people around me! Thank You Dr Shane, Stella and hazel, keep up the good work~  😁",
      "time": 1661954018,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2152367956700983714",
  "user_ratings_total": 35,
  "vicinity": "160 Robinson Road, #03-13/14 SBF Medical Suites"
}