{
  "formatted_address": "Mount Elizabeth, 38 Irrawaddy Rd, #05-43, 05-50 to 55 Specialist Centre, Singapore 329563",
  "geometry": {
    "location": {
      "lat": 1.322236,
      "lng": 103.8440388
    },
    "viewport": {
      "northeast": {
        "lat": 1.323570780291502,
        "lng": 103.8454155302915
      },
      "southwest": {
        "lat": 1.320872819708498,
        "lng": 103.8427175697085
      }
    }
  },
  "name": "Dr Tanujaa Rajasekaran",
  "place_id": "ChIJs4QRL2kZ2jERQq935pUEhMA",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Adrian Toh",
      "author_url": "https://www.google.com/maps/contrib/107301823577138022741/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXaAI-O2CDvmLMlehnUxOJDEO8eupK7m-BZkZ8SoByjczgzRGNH=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "I cannot express enough gratitude for the exceptional care I received from Dr. Tanujaa and her incredible nursing team at Parkway Cancer Centre Mount Elizabeth hospital. From the moment I stepped into the facility, I felt welcomed and understood.\n\nDr. Tanujaa is not only a brilliant oncologist but also a compassionate and caring individual. She took the time to explain my diagnosis and treatment options in a way that was easy to understand. Her expertise and knowledge were evident, and I felt completely confident in her care.\n\nThe nurses at the treatment center were equally outstanding. They were always attentive, friendly, and supportive. They went above and beyond to ensure my comfort and well-being. Their warmth and kindness made a significant difference in my treatment experience.\n\nI am truly grateful for the exceptional care I have received from Dr. Tanujaa and the nursing team at Parkway Cancer Centre. I would highly recommend them to anyone in need of cancer care.",
      "time": 1727852119,
      "translated": false
    },
    {
      "author_name": "RR K",
      "author_url": "https://www.google.com/maps/contrib/112775971485985801951/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIYm5XYDMB2e5hRtTJLhApF0ad4pOI7X2WZUm8KMKYQqtnbPA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Dr Tanujaa is incredibly knowledgeable and friendly. She always listen attentively and spend time to answer all my questions. The entire team at Parkway Cancer Centre MNH is friendly and efficient. Highly recommended.",
      "time": 1727861195,
      "translated": false
    },
    {
      "author_name": "M P",
      "author_url": "https://www.google.com/maps/contrib/102965838725040205178/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK5V9jQDaaBTL2A2oneQT5OQQ6AF_ofnBYO5xKstquBQDiefLc=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "8 months ago",
      "text": "I did not even start with the basic knowledge that surgery is used to remove the tumour, radiation is used to kill the surrounding cells (in case any malignant cells get left out in the vicinity) and chemotherapy is used to reduce risk of recurrence. However, once a person starts treatment, some technical sounding terminology is what doctors use for the description and treatment of breast cancer, and it's important that patients take the time to have the doctor explain it to them.\n\nBACKGROUND:\n\nMy wife was diagnosed with stage 2B breast cancer (breast tumour and one affected lymph node in the arm pit). The cancer was \"Oestrogen +ve, Progesterone +ve and HER2 -ve\". This is a less aggressive type of breast cancer.\n\nAfter her tumour removal surgery, the surgeon referred us to Dr Tanujaa for medical treatment.\n\nDR TANUJAA'S RECOMMENDED TREATMENT:\n\n1. After a brisk consultation, Dr Tanujaa prescribed 4 rounds of Chemotherapy with the drugs AC (Adriamycin and Cyclophosphamide) at 3 week intervals, followed by 12 rounds with Taxol at 1 week intervals.\n\n2. She also said, in the past there used to be 5 years of Hormonal therapy at my wife's age, but now it's been increased to 10 years, which is what my wife would be give once chemotherapy was complete.\n\n3. Finally, she said there is a gene expression test which is done on the tumour sample which she is required to discuss with her patients, but it has a very high false positive rate, so no point in doing it.\n\nSIDE EFFECTS:\n\nMy wife immediately had the difficult side effects that come with the drug Adriamycin (which oncologists refer to as the Red Devil). As expected, she lost all her hair, had non-stop nausea, loss of appetite, upset stomach, weakness and dizziness, blackening of nails, pains, mouth sores among others.\n\nWe had expected these side-effects since most people experience these, and took them as part of the treatment.\n\nSECOND OPINION:\n\nAs we settled into the treatment and overcame the initial shock, we shared our experience with friends who were cancer survivors (and in one case stage 4 bone cancer for 14 years). We were told we might be getting extra treatment, as chemotherapy in breast cancer (especially in our type of cancer in its early stages) may not even be necessary.\n\nI spoke to a friend of mine (a senior neurologist) who suggested another medical oncologist (who we switched to later).\n\nDR TANUJAA'S CONSULTATION (incompetence):\n\nWhat Dr. Tanujaa described as \"false positive rate\" of gene expression tests is the incorrect way of describing the results of such the tests.\n\n\"False Positive\" is a term used to describe chance of error in \"Positive or Negative\" type test results. In such tests, the result error may be that the result says positive (when in reality it is negative) or it says negative (when in reality it is negative).\n\nThe Gene Expression Test (we later did the Onctoype DX test) provides results as a \"probability\" (% likelihood that the cancer may recur) and a score between 0 and 100 (higher score means higher chance of cancer recurring). In such results, the actual number can in be slightly higher or lower (say 89% being 90% or even 86%). It is not a Yes or No answer.\n\nEXTRA TREATMENT (not sure why):\n\nMy wife's cancer did not warrant absolutely any chemotherapy. Her gene expression result was 4 on a scale of 100. For her type of cancer, hormonal therapy for 5 years (not 10) is sufficient, as chemotherapy doesn't produce any additional benefits at all.\n\nShe went through the trauma of the chemotherapy and is also carrying its long term side-effects.\n\nAll of which was just not needed. I don't know how Dr Tanujaa was so incompetent, and how she carelessly prescribed such excessive treatment.",
      "time": 1726894963,
      "translated": false
    },
    {
      "author_name": "Callum Ide",
      "author_url": "https://www.google.com/maps/contrib/103052842993917928593/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKHUXnDNd1g85IQ2NuXvxt-Dio9B_zNlEbzIh3ET6qP3sh0Qg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Dr Tanujaa is an amazing doctor, she is thorough and incredibly caring of her patients.",
      "time": 1733709026,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13872217794071211842",
  "user_ratings_total": 4,
  "vicinity": "Mount Elizabeth, 38 Irrawaddy Road, #05-43, 05-50 to 55 Specialist Centre"
}