{
  "formatted_address": "Mount Elizabeth, 38 Irrawaddy Rd, #08-43 Specialist Centre, Singapore 329563",
  "geometry": {
    "location": {
      "lat": 1.322236,
      "lng": 103.8440388
    },
    "viewport": {
      "northeast": {
        "lat": 1.323570780291502,
        "lng": 103.8454155302915
      },
      "southwest": {
        "lat": 1.320872819708498,
        "lng": 103.8427175697085
      }
    }
  },
  "name": "Dr Thng Yongxian - Hepatopancreatobiliary & General Surgery",
  "place_id": "ChIJLR3cCeBgfmoROIE3_Hjy86I",
  "rating": 5,
  "reviews": [
    {
      "author_name": "L K",
      "author_url": "https://www.google.com/maps/contrib/107279572908025134416/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXLzAZAmd_ubmee77L4z3sv1UUBtPBkfSmOnRnOHuGn9-XyS1U=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "I was recently admitted to the hospital, and Dr. Thng visited me in my ward at 10 pm. I believe a good doctor can make a stressful experience much easier. Dr. Thng was not only highly knowledgeable and thorough but also very friendly and had a wonderful sense of humor, which immediately helped me feel at ease during a difficult time. His clear explanations of my condition and treatment, combined with his comforting demeanor, truly made a difference. I am very grateful for his care and would wholeheartedly recommend him to anyone needing similar treatment.",
      "time": 1746597250,
      "translated": false
    },
    {
      "author_name": "Cl",
      "author_url": "https://www.google.com/maps/contrib/100516557666866002093/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJrVPdZvVLP3UBNWfNbnGKecLR_n2WYgtAYdvL9fceMZwSHOw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I found Dr Thng Yongxian on Google and hope this review will help others like how it did for me.\n\nI cannot express enough how grateful my family and I are for Dr. Thng.\n\nMy mom was admitted to SGH A&E and was given a 2-3 days lead time on the availability of a bed. It was a long, long wait at the hospital not knowing what our next steps were. Frantic, I googled searched and called the number on the website. I was so surprised that Dr Thng picked up! He listened and gave me advise, and helped me book a bed at Gleneagles for my mother to transfer right away.\n\nAfter the scans, Dr Thng advised us the following steps for a Gallbladder removal and an ERCP. Dr Thng showed nothing but the highest level of care, compassion, and professionalism.\n\nNot only did Dr Thng take the time to explain every detail of the surgery and answer all our questions, but his warmth and understanding truly put our minds at ease during what was a stressful time. My mother felt so comfortable and cared for, and that made all the difference.\n\nThe surgery itself went smoothly, and my mother has been recovering very well, thanks to Dr Thng’s expertise and thorough follow-up. It's clear that he genuinely cares about their patients' well-being, not just as medical cases but as people.\n\nWe are so grateful for everything Dr Thng has done for my mother. If you're looking for a doctor who goes above and beyond, I highly recommend Dr Thng Yong Xian. He is truly exceptional.",
      "time": 1742789168,
      "translated": false
    },
    {
      "author_name": "Douglas Lavigne",
      "author_url": "https://www.google.com/maps/contrib/100459644753544061794/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIvqFWQlhO09ruU3l-VtT5Qb2kxgHZXr_8PhRu7Wl0ojkZT0Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Dr. Thng provided exceptional care during my visit. What stood out was his patience and willingness to explain everything clearly, ensuring I fully understood my condition and treatment. The procedures were performed smoothly—a testament to his skill and expertise.\n\nA special shout-out to the friendly and helpful reception staff, who made the administrative process seamless and even lifted my mood with their warmth!\n\nFrom start to finish, this clinic exemplifies professionalism and genuine care. Highly recommend Dr. Thng to anyone seeking a knowledgeable, compassionate doctor backed by a wonderful team.",
      "time": 1743686457,
      "translated": false
    },
    {
      "author_name": "Jimmy L",
      "author_url": "https://www.google.com/maps/contrib/110240862185056018959/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKQ5tLUOeBs9HceHK5DaBd8nGkvTnKpYzP28omXfiNX5VWxmw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "From the moment I walked into the clinic, I felt welcomed and at ease. Dr. Thng is incredibly chill and approachable, which made discussing my health concerns much less stressful. He took the time to listen carefully, answer all my questions, and explain everything in a way that was easy to understand.\n\nHis kind and friendly demeanor truly made a difference, and I felt genuinely cared for. While the maximum rating on Google review is five stars, his exceptional service and attitude unquestionably merit a ten-star review.\n\nI strongly recommend Dr. Thng to anyone looking for a compassionate and relaxed healthcare provider.",
      "time": 1745547444,
      "translated": false
    },
    {
      "author_name": "Hui Ling Ng",
      "author_url": "https://www.google.com/maps/contrib/117014143028413536974/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWvfUVvlB2Y2ci8mnDRDYs1GryJ8NzFCdKlqw_tdGQ9sjD5Sv2A=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "After a recent health screening scare, Dr Thng was able to see me on short notice. He advocated and made time for me to get the necessary scans just 2 days later. He took time to listen to my concerns and symptoms. He was patient and knowledgeable in explaining the scans and insurance matters. I'm very grateful to have had him as my Dr, and will definitely recommend him to friends and family. Thank you for everything!\n\nShout-out to the team at Nexus Surgical too, a very friendly and patient-centric crew. Thank you and very glad to have met you!",
      "time": 1739467446,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11741995254926508344",
  "user_ratings_total": 106,
  "vicinity": "Mount Elizabeth, 38 Irrawaddy Road, #08-43 Specialist Centre"
}