{
  "formatted_address": "119 Tyrwhitt Rd, Singapore 207547",
  "geometry": {
    "location": {
      "lat": 1.3111042,
      "lng": 103.8596912
    },
    "viewport": {
      "northeast": {
        "lat": 1.312431680291502,
        "lng": 103.8610887302915
      },
      "southwest": {
        "lat": 1.309733719708498,
        "lng": 103.8583907697085
      }
    }
  },
  "name": "Druggists | Craft Beer Taproom Restaurant Singapore",
  "place_id": "ChIJ4ddQGckZ2jERbIMDgPz8eGU",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Ng Wan Keat",
      "author_url": "https://www.google.com/maps/contrib/106272403703415093753/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU-Ci09lKrvviP2ZD4F2Nph0SEDXfenlBq463GB7NSK0wTfjCE03w=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "3 weeks ago",
      "text": "Welcome to The Pourhouse, where every sip tells a story. Tucked into a lively corner of the city, this craft beer taproom is a laid-back haven for flavour seekers. The taps flow with an ever-changing lineup of brews — from crisp, citrusy IPAs and velvety stouts to funky sours and delicate saisons. Whether you’re chasing bold bitterness or smooth maltiness, there’s a pint waiting with your name on it.\n\nThe menu doesn’t stop at beer: natural wines, inventive cocktails, and small-batch sodas crafted with real ingredients make sure everyone finds their perfect pour.\n\nTo keep your taste buds dancing, the kitchen serves up craft pizzas, juicy burgers, loaded tacos, and an array of nibbles — all infused with bold, local flavors that pair perfectly with whatever’s in your glass.\n\nCome for a quick bite after work, stay for the vibe — cosy lighting, easygoing playlists, and a crowd that feels like old friends. Whether you're a craft connoisseur or just here for good times, there’s always something new on tap and someone new to meet.",
      "time": 1745806534,
      "translated": false
    },
    {
      "author_name": "Nikhil Pendse",
      "author_url": "https://www.google.com/maps/contrib/111936728583960233758/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXvuxXSE-3oyfHRrsUQ2iED4kjZTQBOxao8hhrpiFf8qtM8XPrByg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Druggists | A hidden gem in Singapore\n\nLocated at 119 Tyrwhitt Road, this place offers a unique and delightful experience for craft beer enthusiasts and food lovers alike.\nOne of the standout features of Druggists is their impressive selection of craft beers on tap. With 23 rotating craft beers, there's always something new and exciting to try. From the flavourful Jaipur IPA to the indulgent Naughty & Nice Stout, the variety is remarkable. The beertenders are knowledgeable and friendly, always ready to recommend a beer that suits your preferences.\nThe setting of Druggists is equally appealing. The bar is housed in a building that was once the headquarters of the Singapore Druggists Association, giving it a unique historical charm. The atmosphere is casual and welcoming, making it a great spot to hang out with friends. Whether you prefer indoor seating, alfresco dining, or lounging, Druggists has got you covered. The staff are friendly and efficient, adding to the overall enjoyable experience.\nIn addition to their fantastic beer selection, Druggists also offers a range of bar bites, casual food, natural wines, cocktails, and handcrafted sodas. It's a place where you can relax and enjoy good food and drinks in a laid-back setting.\nOverall, Druggists is a must-visit spot in Singapore for anyone looking to enjoy a great selection of craft beers in a unique and charming setting.",
      "time": 1742125264,
      "translated": false
    },
    {
      "author_name": "Richard E",
      "author_url": "https://www.google.com/maps/contrib/115295534526453989960/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLbg5QsKeVM_UXUyGgWKFL7Up0LCj7YczTg1PfD8k-QhaatVQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "This is a great venue if you like craft beer (see photo to see what was on offer when I visited). The beer is not cheap, but if you want cheap go to a Hawker Centre and buy a few mass produced cans.\nThe burger was very good too.",
      "time": 1738251218,
      "translated": false
    },
    {
      "author_name": "Mark Tan",
      "author_url": "https://www.google.com/maps/contrib/111684394902487136193/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXFA0EqR4soHUXfsm-6oB_urkaIYLTbG-1DaxO6afkDdpouL75XaQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "Druggists—what a bold name for a bar! Nestled in an old shophouse, it breathes new life into the space with its mix of vintage charm and punk-inspired vibes. The fusion of old and new gives the place so much character.\n\nI loved the laid-back atmosphere. It's casual to the point where water and cutlery are self-service, adding to the relaxed, no-frills vibe. Their selection of craft beers is solid, making it a great spot for beer enthusiasts to explore new flavors.\n\nThe food menu is quite innovative, with quirky options like otah pizza. While I give them credit for creativity, the taste didn’t quite hit the mark for me. That said, Druggists is still a fantastic place to hang out, relax, and enjoy some drinks with friends in a cool, unpretentious setting.",
      "time": 1729777853,
      "translated": false
    },
    {
      "author_name": "Marc Ha",
      "author_url": "https://www.google.com/maps/contrib/116047651430201692498/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV0urXfbX9Mm_R98rT9D0jdq-jB8f2UAvGY83rCv5e96M5Wjhxb=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "Love the laidback and unassuming vibe of this taproom. The bar food is decent with the standard options like burgers, pizzas, fries and other sides. Love that they have options for meat eaters and vegetarians. I had the fried tofu burger with 老干妈 sauce. There is indoor and al fresco seating here.",
      "time": 1731241283,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "bar",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7311872156445672300",
  "user_ratings_total": 945,
  "vicinity": "119 Tyrwhitt Road"
}