{
  "formatted_address": "21 Bukit Batok West Ave 2, Singapore 659204",
  "geometry": {
    "location": {
      "lat": 1.363167,
      "lng": 103.7445869
    },
    "viewport": {
      "northeast": {
        "lat": 1.364515130291502,
        "lng": 103.7458860802915
      },
      "southwest": {
        "lat": 1.361817169708498,
        "lng": 103.7431881197085
      }
    }
  },
  "name": "Dunearn Secondary School",
  "place_id": "ChIJYUp8RjMQ2jERVq_XaHBNaKg",
  "rating": 3.1,
  "reviews": [
    {
      "author_name": "lin kor wan mr lin",
      "author_url": "https://www.google.com/maps/contrib/101177314123640314107/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLqfgLuVLqcGlZ95AzOZjW4JVYeGRD7m7loKk1-wAD8abh2Lw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Ah, Dunearn Secondary — or as I fondly call it, Singapore’s premier training ground for future prison wardens and escape artists. Stepping into the school is like walking into a dystopian alternate reality where broken things aren’t repaired — they’re just part of the decor.\n\nThe atmosphere? Immaculate. Think: constant screaming echoing down the hallways (is it students? teachers? ghosts? Who knows!). It's like a free horror soundtrack on loop. If you enjoy the soothing sounds of random yelling and doors slamming for no reason, this place is basically a 5-star resort.\n\nFacilities? Beautifully neglected. Lockers that don’t lock, toilets that resemble public rest stops from 1980, and chairs that test your balance and survival skills daily. The school seems to pride itself on its “authentic warzone” aesthetic.\n\nStudent culture? A+ in public nuisance. Catch the cool kids vaping behind stairwells like it’s a competition, while others engage in loud, profanity-laced conversations at 7:30 AM. You’ll feel like you’re in a badly written teen drama — minus the plot, just vibes.\n\nTeachers? Oh, they’re not teachers — they’re benevolent overlords. Some rule with the iron fist of a dictator and the empathy of a brick wall. If you ask a question, make sure it’s worth the psychological warfare that follows.\n\nHonestly, Dunearn Secondary doesn’t feel like a school. It feels like a concentration camp with WiFi — barely. The only lesson you'll consistently learn here is \"how to mentally dissociate.\"\n\nIn conclusion: If you’re looking for a wholesome, educational experience filled with inspiration, growth, and support… go literally anywhere else. Dunearn is the place dreams go to die — loudly, in a cloud of vape smoke.",
      "time": 1744866020,
      "translated": false
    },
    {
      "author_name": "enzo phone",
      "author_url": "https://www.google.com/maps/contrib/114538731953551945535/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIOZibfaIEb2JMQkRwAg5d9Wv4jZUh5AmyuaQpCyq9p1syNyA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "Overall school management is horrible, discipline team is useless, Malay students incredibly rowdy, many commit illegal activities such as vaping etc, toilets are filthy, no soap in dispensers, most of the cleaners do their job but it is not enough, the education team is not the best, many teachers basically read of the textbook, some are even rude and accused people falsely many many times, not enough is being done to turn this school around from the worst school in the west to the best. Disappointing",
      "time": 1745476068,
      "translated": false
    },
    {
      "author_name": "Finian Lim",
      "author_url": "https://www.google.com/maps/contrib/108486880329149338397/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLUgdY7wyZV0ipkHT6ClE2KBAJbxapfbzXqIEtsKdF-Ulyy6A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I like how the school environment keeping it clean with great learning",
      "time": 1741957124,
      "translated": false
    },
    {
      "author_name": "SoyBean Aravind",
      "author_url": "https://www.google.com/maps/contrib/100427320236762468100/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXEux2EU3k2fZjPIi-vwna_320__tEfbkynnhNnWTjLEfZQjtQC=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "9 months ago",
      "text": "I am a student at this school and I am happy to be here. Everyone is so friendly and fun to talk with. It is a school I’ll visit in the future. Overall, it is a great school.",
      "time": 1724297161,
      "translated": false
    },
    {
      "author_name": "Adam Shahputra Bin Mohamad Shaifi",
      "author_url": "https://www.google.com/maps/contrib/111660826694634498333/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWsxu7yIZomuwDRQ61_xDD-73HFD6N-2YBdyt1_H0KIBIuPdIYC=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "The school is a wonderful school! I as a student love this school, not to decorated nor too boring.\n\nSchool Facilities:\nOne thing I'm impressed is that the school will do a \"Class Servey\" which will recommended students to write about 'How to improve the school with our pov?\"\nAfter the survey, classrooms are equipped with good smooth floor!\n\nI really do love how the library is super cold and fulll of good books about different subjects! Even offers World Wars too!\n\nThe cafeteria is a normal place, enough tables to fit entire classes. But one con this is that it gets crowded with students, not to mention the overall less halal foods for the Muslims. One good Muslim restaurant is the \"Malay Foods\"; tasty and delicious Baked Cream Rice and Caijun Chicken, is the best I've ever tasted!\n\nThe restrooms are perfect. Balance of different gender toilets and are clean. One thing I noticed is that the toilet paper is sometimes empty and soap dispensers too.\n\nActivities and CCA:\nJust to add on, the CCAs are quite fun and active for students!\nActivities like PE, ICAN, FCE, ALP, are all fun too!\n\nLocation:\nLocation of the school is very good! The nearest bus stop is not too far, and there are community restaurants / hawker centers! Nice!\n\nOverall impression to me is that the school is just good and nice.",
      "time": 1696996757,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12135034341140442966",
  "user_ratings_total": 50,
  "vicinity": "21 Bukit Batok West Avenue 2"
}