{
  "formatted_address": "11 Laguna Golf Green, Singapore 488047",
  "geometry": {
    "location": {
      "lat": 1.3231319,
      "lng": 103.9624751
    },
    "viewport": {
      "northeast": {
        "lat": 1.324527880291502,
        "lng": 103.9636842302915
      },
      "southwest": {
        "lat": 1.321829919708498,
        "lng": 103.9609862697085
      }
    }
  },
  "name": "Dusit Thani Laguna Singapore",
  "place_id": "ChIJbehm8Jwj2jERleuVMdTkNu8",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Skye Tan",
      "author_url": "https://www.google.com/maps/contrib/108662179138653546780/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVB85m9_oasJ5We18OxpxpPMbQ8AuoSuB8VHpehqHpLAraRM8ETRg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Six stars! My birthday stay at the Champion Suite was absolutely perfect!\n\nHuge congratulations to Dusit Thani Laguna Singapore for having such a stellar team. A special shout-out to Chester Low, the Assistant Front Office Manager, who provided an amazing experience from before we even arrived until after we left. The concierge and in-room dining teams also took excellent care of all our requests and needs.\n\nMy family and friends felt so welcomed and well looked after.\n\nThe suite was beautifully maintained and boasted a stunning view of the golf greens and the pool.\n\nBreakfast was also incredibly generous with both the portions and the variety of choices. We will definitely be back!\n\nSpecial mention to Chester Low as well as Tiffany Loh for the hospitality!\n\nThank you again, Dusit Thani and your wonderful team!",
      "time": 1745049532,
      "translated": false
    },
    {
      "author_name": "Roger Hawke",
      "author_url": "https://www.google.com/maps/contrib/117829932024746986520/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW5iv3ebR0yhmUE03NOLk_4UNQ7SEMK89einG4welz_TcZFxUK7=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "The Hotel was one of the best we have stayed in over the years.\nExceptional service, immaculately clean and excellent food. Whilst a little out of the way from the hubbub of the city it is peaceful. Free shuttle service to various points including Changi Airport/Jewel is a real bonus.\nThe staff are exemplary and a credit to the GM Todd.\nThere is no doubt we would stay there again 🙂",
      "time": 1745827479,
      "translated": false
    },
    {
      "author_name": "Tan Li Ting",
      "author_url": "https://www.google.com/maps/contrib/104947271214129334571/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLMBCmlRSW80FI0PJdP5TWmJqqGwWtdHy2F5xUV7fOaEUTdgw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Seeking a serene escape within Singapore, I recently indulged in a staycation at Dusit Thani Laguna Singapore, a resort that seamlessly blends luxury with nature.\n\nI stayed in the Deluxe Laguna Pool View room where the highlight was the floor-to-ceiling windows that opened up to a panoramic view of the sprawling golf course and the award-winning pool below. The sight of airplanes ascending in the distance added a dynamic backdrop to the tranquil scenery.\n\nThe resort boasts three distinct swimming pools: a lap pool for serious swimmers, a relaxation pool with submerged loungers, and a children’s pool. Spending the afternoon lounging by the poolside, with the gentle breeze and serene environment, truly felt like a retreat from the city’s hustle. For those feeling active, the 24-hour gym, tennis, paddle courts, and the Laguna 9-Hole Putting Course provided plenty of options.\n\nDining at Greenhouse was a highlight. The forest-themed restaurant, accentuated by abundant greenery and natural light, created an inviting atmosphere. The restaurant features multiple open kitchens, each specializing in different cuisines—Thai, Japanese, Indian, Mediterranean and Chinese. The Thai dishes stood out, while the fresh seafood, including succulent lobsters and snow crab legs, was an absolute treat. Breakfast was equally indulgent, with a hearty selection to start the day right.\n\nWhether you’re lounging by the pool, savoring international cuisines, or simply enjoying the scenic views from your room, the resort feels like a sanctuary worlds away from the city’s bustle.",
      "time": 1743733098,
      "translated": false
    },
    {
      "author_name": "EFFΛELFIΛIИΛISYΛH",
      "author_url": "https://www.google.com/maps/contrib/105829084793064933588/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWb5Ex9oRpB6rMGVGrfTerq5aMktv5fomoZsdpsMr4oC_aTCXU=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "\"I had a wonderful stay at Dusit Thani!\"\n\n\"The staff was incredibly friendly and attentive.\"\n\nThe rooms and facilities were spotless and well-maintained.\"\n\nThe bed was super comfortable, and I had a great night's sleep.\"\n\n\"The concierge went above and beyond to help us with reservations.\"\n\n\"I highly recommend this hotel to anyone visiting Singapore.\"\n\n\"I can't wait to come back!\"",
      "time": 1740039095,
      "translated": false
    },
    {
      "author_name": "Humaira Shakoor",
      "author_url": "https://www.google.com/maps/contrib/117153486303060950752/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWSJHbAj4QmwgSh6ez7UUFG53TJPMnJcYNEPjxDplu5EiopNCM=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "Amazing hotel, such beautiful architecture and interior design and the outside pool area is stunning! Very aesthetic ocean veranda and perfect for plane spotters ! The service was the vest though, the staff are so friendly and accommodating. They truly made our stay so pleasant ☺️",
      "time": 1745294009,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17237216223823260565",
  "user_ratings_total": 1328,
  "vicinity": "11 Laguna Golf Green"
}