{
  "formatted_address": "30 Tampines Street 34, Singapore 529231",
  "geometry": {
    "location": {
      "lat": 1.3568208,
      "lng": 103.9607517
    },
    "viewport": {
      "northeast": {
        "lat": 1.357664480291502,
        "lng": 103.9621543802915
      },
      "southwest": {
        "lat": 1.354966519708498,
        "lng": 103.9594564197085
      }
    }
  },
  "name": "East Spring Secondary School",
  "place_id": "ChIJaY1pfwI92jERK2wpVmpLsjc",
  "rating": 2.8,
  "reviews": [
    {
      "author_name": "Eggsuma",
      "author_url": "https://www.google.com/maps/contrib/114762990919177961650/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW5jGMNwDDVffD3uMeKMIPWgEVDKIn0kLsPGm_ED3JCjM8JleI=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "as a current sec one student of this school, the teachers are good, and i greatly recommend this school to people who are seeking improvement in some subjects, all you have to do is pay attention and abide by the school rules.\n\nThe school has multiple bad reviews here as a batch (pair?) of students were caught doing something dirty, however, due to this multiple of my schoolmates get shot dirty-looks as they board public transport even if they display a good attitude.\n\nWhen all is said and done, the school is great and as the saying goes “Never judge a book by its cover”, we covered a topic of the school’s bad reviews the other day and a classmate of mine had told me that people tend to look on the negative sides of the story rather than the positive ones, and trust me, at least eighty percent of the reviews are reporting on the same case",
      "time": 1745423206,
      "translated": false
    },
    {
      "author_name": "Ultra Doorstopper",
      "author_url": "https://www.google.com/maps/contrib/112350005351487330787/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUxV5JmkMZEtX2kGZd_X2qUgd56ThQc4uf_dPEay5fpTn74vmE=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Guys Im normal but thanks to your ratings, every time Im going home in public and they see my uniform they think Im some kind of lunatic. There are normal people in this school too who want to be respected you know? I didn't choose to be here, My AL was stuck between G2 and G3 and this school was the only one who let me in, there are lots of good people in my class, Don't you people have anything better to do than send reviews when some of yall haven't even been here? These reviews just make the students here feel bad about themselves and make other people look down on us and insult us",
      "time": 1740822595,
      "translated": false
    },
    {
      "author_name": "Andre Escarro",
      "author_url": "https://www.google.com/maps/contrib/103598359013203698982/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXPZe-qbljspzYoyrtZhK_RrhC0N1r6C2bFPAMgM1-9JU1WaJI=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "Horrible experience from 2019-2022 (not my real acc) not recommended to all newly p6 graduates. You guys deserve so much better than this, pick a better secondary school than this school. Teachers are great but they should really get out of there in my opinion.",
      "time": 1735313623,
      "translated": false
    },
    {
      "author_name": "Sofeaa Aaudeliaa",
      "author_url": "https://www.google.com/maps/contrib/107459819323169475245/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVob08X4gf79v29MHdBjvQ6T9m3TtAJCXYEgyJ6QJ6zuNMAKRU=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Esss is a very good school, with such understanding teachers amazing students and so much fun. Also at first I thought it was a bad school due to some rumours and stereotypes. But as I get to know the school more it isn't bad at all. Infact it's actually a good school.",
      "time": 1738229512,
      "translated": false
    },
    {
      "author_name": "ilove2play",
      "author_url": "https://www.google.com/maps/contrib/108018149738908169316/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUl6UCBNwvVyEMvS_wyFM8LMwmB6N8JACl9zB3s5spnyBSKRCJM=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "Went to this school, clerks were LEGIT RUDE  especially the difficult plump angry bossy bespectacled Malay lady with tudong. The Malay lady always picked on me when I did wrong or even times when I was polite and did no wrong, and once insinuated that I lacked manners (Which was not true at all as I was passive and well-liked by all staff and have never offended any staff before) when she’s the one who ignored me and my mom to chit chat and tend to others after giving us the consent form and even after we have done signing and filling up when my mom came to fetch me as I was ill at the same time my mom was rushing me as she had to go toilet since we have been standing and waiting for 4 minutes just for her acknowledgment after we were done, so I had to help my mom to end it quick and leave, I prompted her “Hi, excuse me” only to be ignored first while she cut short her conversation with the others before turning to tell me in a long whining tone “What is it? Done already? That’s all. Next time wait, don’t interrupt. Have some manners” in front of my mom. Hello! How about you be considerate, responsible and reasonable? My mom has an urgency and I was already ill and all you needed to do was to collect the form and dismiss us while chatting, or better you wait for our form first before you chit chat with someone else! And there was once I had to hand in another form from 9am to 5pm, but since I was busy in the morning, I went at 3pm, only to be scolded by her for being so late when I was within the time limit and not even late or last minute. So I don’t appreciate such treatment. There have been so many bad rowdy unkind students, how about lecturing them? When I kept quiet, also got lectured. Everything also cannot? As a sickly person I dreaded having to go to the general office to be treated like that before getting fetched home. Well done now, I’m hurt by this on top of all the bullying by my schoolmates because of me being a shy passive teachers’ pet unlike the average teenagers. I hope you get fired from this field, or get back the same treatment by someone. One of my biggest regret in life was to enrol in East Spring Secondary School just because my parents made me as it’s right next to my house and like I said I was passive and agreeable with no opinions myself. No wonder the current students are still bad as ever, I’m disappointed.",
      "time": 1739663108,
      "translated": false
    }
  ],
  "types": [
    "school",
    "secondary_school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4013353138024705067",
  "user_ratings_total": 90,
  "vicinity": "30 Tampines Street 34, Singapore"
}