{
  "formatted_address": "Sinaran Dr, #08-13 Medical Center, 10, Singapore 307506",
  "geometry": {
    "location": {
      "lat": 1.3206513,
      "lng": 103.8443689
    },
    "viewport": {
      "northeast": {
        "lat": 1.322326380291502,
        "lng": 103.8456144302915
      },
      "southwest": {
        "lat": 1.319628419708498,
        "lng": 103.8429164697085
      }
    }
  },
  "name": "East Coast Podiatry (Novena Clinic)",
  "place_id": "ChIJC8hamu8Z2jERs-ykqwFclLI",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Nicholas Sim",
      "author_url": "https://www.google.com/maps/contrib/102450430378133233357/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIBeFfnfv1ACI0j85FoqHbeZzHWrTqNGu1Psr6rOs-Pq2mdBLI=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "First time here, everything was explained in detailed to me by Dr Jordan. During treatment, Dr Jordan was constantly ensuring that i was not in too much pain. Staff at the reception was friendly and nice. Overall had a pleasant experience for my first time.",
      "time": 1745804718,
      "translated": false
    },
    {
      "author_name": "Althea Ong",
      "author_url": "https://www.google.com/maps/contrib/106464837081797427331/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJr1TJuhR7SbFrEqYdvyHyzxZJBLtrF7puDkBHEFTk-PcwYUw=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "I've been coming to this clinic for some time for heel pain. After the previous podiatrist left and I started seeing Mr Daniel, he really helped to work on my issue in a more holistic manner, targeting not just the symptom (heel pain) but other underlying/prominent issues relating to biomechanics. He is truly professional and sharp in his assessment of the reason for my heel pain, as well as in recommending appropriate exercises for me to do. He also recommended custom in-soles when he noticed that the standard ones I had were not providing my feet with enough support. It is evident that he genuinely cares about improving the condition of those who come by the clinic (hope he's not leaving!). Felicia and Jordan have also been nothing short of helpful in terms of guiding me in my rehab and therapy sessions. While my heels still hurt when I stand for longer periods of time, they are better than when I first started out at the clinic. Thank you 😊",
      "time": 1743134434,
      "translated": false
    },
    {
      "author_name": "Lisa Weng",
      "author_url": "https://www.google.com/maps/contrib/106767588373974634643/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUXOXH5j400D-GbvtI5dQXw4CgIJqILDpf9zUfTBhS_PQ6b8UDJ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Having pain on my right heel especially when wake up in the morning and started affecting my daily life and exercise. Google and found East Coast Podiatry with good feedback. Decided to made appointment. Mr Daniel, Felicia and Trisha were attended patiently to explain my problem, guide the exercise, provide treatment. They are very friendly, professional and kind. Always looking forward to meet them weekly. The receptionist are always friendly too. After 8 sessions, I felt stronger, my pain reduced significantly. Thanks a lot for all of them. Will definitely recommend to my family and friend.",
      "time": 1726718271,
      "translated": false
    },
    {
      "author_name": "Sonali Gohil",
      "author_url": "https://www.google.com/maps/contrib/117158669282728887677/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjURvCKvcwLVrU8HLtzGsrdnX2nGjDzjKpyQ5ZcT4E63zEpE24cP=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "I recently had a toenail removal surgery performed by Dr. Jordan, and I couldn’t be more pleased with the experience. From the start, Dr. Jordan took the time to explain the entire procedure clearly, which helped ease any anxiety I had. The surgery itself went smoothly and was handled with great care and professionalism.\n\nThe aftercare was excellent — Dr. Jordan ensured I knew exactly how to take care of the area and followed up to make sure everything was healing well. I also want to mention the reception staff — they were incredibly welcoming and made the whole visit feel comfortable from start to finish.\n\nHighly recommend Dr. Jordan for anyone needing podiatric care!",
      "time": 1746667939,
      "translated": false
    },
    {
      "author_name": "Dolly Lim",
      "author_url": "https://www.google.com/maps/contrib/112065539399055022021/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUo8gSYXscrDAri9hpjv8wVkAjGIWaApPBJXm0Tg4O2ikouJUA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Thanks Daniel Joseph, Jordan Williams and Felicia Teow for the exceptional care and support provided during my recovery from my foot injury. Their expertise, patience, and personalized approach made a significant difference in my healing process, and am grateful for the time they took to explain the treatment plan and guide me every step of the way.\n\nThanks to their combined efforts, I’m now able to return to my normal activities pain-free. Their professionalism and compassionate care  is much appreciated and would definitely recommend them!",
      "time": 1734524952,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12868011197548784819",
  "user_ratings_total": 424,
  "vicinity": "Sinaran Drive, #08-13 Medical Center, 10"
}