{
  "formatted_address": "60 Yishun Ave 4, #01-01 Safra, Singapore 769027",
  "geometry": {
    "location": {
      "lat": 1.4242354,
      "lng": 103.8409184
    },
    "viewport": {
      "northeast": {
        "lat": 1.425446980291502,
        "lng": 103.8420948802915
      },
      "southwest": {
        "lat": 1.422749019708498,
        "lng": 103.8393969197085
      }
    }
  },
  "name": "Eatzi Gourmet Steakhouse & Bistro",
  "place_id": "ChIJW75052sU2jERzJxHjMVroNc",
  "rating": 3.6,
  "reviews": [
    {
      "author_name": "2 wheelers",
      "author_url": "https://www.google.com/maps/contrib/116535342139400157438/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKEGDdAa1cjucjhCqhKz8za9i6dNamoMjUEpQPbL5PTZpYNzw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "I went to your safra outlet eatzi gourment steak house . I went there to break fast and was very hungry . Ordered the steak for “well done” it came all bloody and red,the steak was plain and so hard to eat . The veggies dont even seem cooked and the potatoes were hard and under cook.I have read all the reviews on google posted by other people and it seems that there is no change in the food quality after countless amount of complaints . I paid for something i barely ate I ask the cashier who was a trainee on what she could do and she offered me a slice of cake . This is outrageous for the amount i have paid .",
      "time": 1741741782,
      "translated": false
    },
    {
      "author_name": "Chian Alicia",
      "author_url": "https://www.google.com/maps/contrib/114545420816959179678/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWzl7jqSFl1MTy_jMQHVhqG3EfVr0VPjLMWWcP0OpMovM9EcxCSPw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "Terrible experience here at Eatzi.\nAsked the counter staff before entering the restaurant how long it will take for the food to come after ordering as I was short on time. Counter staff told me 15-20min which still gave me about 20 mins to eat, so I decided to dine here. After I ordered, I waited 35 min for the food to come. At the 35 min mark, I told the staff to just cancel my order as I would not have enough time to eat. Immediately after I told the staff to cancel my order, the food arrived. I had to gobble up the food within 10 minutes!!! And that is not even the worse of it.\nWhen I ordered the meal, the staff did not ask me about the doneness of the steak that I wanted. I assumed this was fine as I wanted to have it medium rare anyway, which is the usual standard for a steakhouse. The steak came with SO MANY RAW BITS!!! It was definitely worse than medium rare. I have attached a picture in this review. There was a spot on the beef that was obviously not cooked or pressed into the pan at all. The meat was also extremely bloody and undone.\nQuality of this restaurant has definitely went down a lot since the past…",
      "time": 1734635029,
      "translated": false
    },
    {
      "author_name": "Nomis Haes",
      "author_url": "https://www.google.com/maps/contrib/113053543901356430465/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVZFRWdDxMQsG5BepzVxdVP5ESqXnhe63aO_uPOf_3dUrwVj3umJQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 2,
      "relative_time_description": "5 months ago",
      "text": "Overpriced and poor quality food. 1. Soup tasted raw. 2. Mashed potato was cold , even with the sauce. 3. Chocolate milkshake served in a small juice glass and overpriced. Watery and more like chocolate milk. 4. Steak was tasteless as compared to other heartland western steakhouse with same category .\n\nWater is charged. With this poor quality of food, this place is not worth revisiting.",
      "time": 1733033085,
      "translated": false
    },
    {
      "author_name": "panda kee",
      "author_url": "https://www.google.com/maps/contrib/108799691152350118622/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKZqO8idsh5ODFAokipiKU0EFXy-Sj-HCZZ4SIe5axLW8kmQg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "in the last week",
      "text": "what is this serving of Mentaiko Scallop?\nbig to small? 1st serving sauce wasnt added, add already never torch, i did not pester them to torch it and just ate it LOL ridiculous … what is this standard … not needing to torch too where is the SOP 🤣 3rd pic for untorched mentaiko",
      "time": 1747299725,
      "translated": false
    },
    {
      "author_name": "Susan Tay",
      "author_url": "https://www.google.com/maps/contrib/117439194272049581423/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKRHmDryPMJ95rlSJONtMohbUMdBfXN6ZG70pp438AYIn4aKA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Under the same company of Jack’s Place, this branch is located within the compounds of Safra club. Went for lunch and ordered the Monday’s lunch set, either grilled fish or beef sirloin. It comes with a daily soup and garlic bread, and today is yam soup, along with a scoop of ice cream and either tea or coffee.  Everyday is different offer lunch set. Service is not fast since there are only 2-3 servers.   OK if you are not in a rush.   If you plan to go back often, you can sign up for membership which cost $22 for a year but you get some total discounts of about $69, which some of the vouchers to be consumed within 3 months. We offset one set lunch out of 3 since I got the membership",
      "time": 1740384547,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15537537210634443980",
  "user_ratings_total": 671,
  "vicinity": "60 Yishun Avenue 4, #01-01 Safra"
}