{
  "formatted_address": "Block 658 Punggol E, #01-06, Singapore 820658",
  "geometry": {
    "location": {
      "lat": 1.3997603,
      "lng": 103.9195424
    },
    "viewport": {
      "northeast": {
        "lat": 1.401183080291502,
        "lng": 103.9209141302915
      },
      "southwest": {
        "lat": 1.398485119708498,
        "lng": 103.9182161697085
      }
    }
  },
  "name": "EduFirst Learning Centre (Punggol East) - English Math Chinese Science Tuition Centre Singapore",
  "place_id": "ChIJberrO8U92jERyUJQ5aZm6p0",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Krishv R",
      "author_url": "https://www.google.com/maps/contrib/106208906208932053951/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW7MBCNAuw_6nSnISjZTAj46DK4j-8mnmrH_PA_RqRJNxeFCs4n=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I approached this centre last minute centre as i was not able to get a placement for my son in his in school premise student care service. From the start this centre has been very accomodative, understanding and organised in the way they operate and engage the parents. My son stayed here for brief period (few months). I will like to thank Teacher Mayie and the rest of the centre  teachers for their support after care and impeccable service. They are very prompt with communication, maintain clean premise and ensure close supervision of school work while ensuring it is balanced with other activities.Their  kindness, care and guidance has been assuring for our family 🙏🏼🥰. I am sure my son will miss the friends and the time spent at Edufirst even though it was brief. Unfortunately, we had to take him out in the interest of proximity and logistical convenience. Otherwise would have continued our journey here.",
      "time": 1740741717,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11379020275502826185",
  "user_ratings_total": 1,
  "vicinity": "Block 658 Punggol East, #01-06"
}