{
  "formatted_address": "83 Punggol Central, Singapore 828761",
  "geometry": {
    "location": {
      "lat": 1.406521,
      "lng": 103.9021562
    },
    "viewport": {
      "northeast": {
        "lat": 1.408426880291502,
        "lng": 103.9032103802915
      },
      "southwest": {
        "lat": 1.405728919708498,
        "lng": 103.9005124197085
      }
    }
  },
  "name": "EduKate Punggol Tutors English Mathematics and Science Small Group Tuition",
  "place_id": "ChIJc9Xf4PwV2jERkPkWtAPwzSg",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Lina Ho",
      "author_url": "https://www.google.com/maps/contrib/101074541257966192474/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWvNabg7Dzu8-h0Z7tq8YinFzmoSBkl9AhTEkmUqagTIS2R4Ek=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "Tutors are passionate. Knows their material and teaches clearly. Students love going for their lessons and learns, during tuition, their school work properly.\n\nA lot of effort is put into training their students in class. My daughter went from scoring 65 for P4 Maths to 92 after being taught by them. She is doing very well in her studies and has a good attitude towards learning. I know the tutors give her ideas that helped her to be optimistic.\n\nOn the complaint side, they teach again the same topics when it is near the examinations which might be a bit too much revision rather than doing new sums. I am sure they have their reasons, but after three years with them, my daughter feels like she knows her work well enough. Overall, my daughter has improved but I wished they can work on her last few marks to further improve her and score higher.",
      "time": 1569357335,
      "translated": false
    },
    {
      "author_name": "Yen Ming",
      "author_url": "https://www.google.com/maps/contrib/113901869046396785632/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX7I3fG6ecX0Ojgf4V9IuThLxx_y-3XRG48a3NjnF5AmB3GtMc=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "My Additional Mathematics tutor here taught me till I got an A1.\n\nThey make me feel that I can achieve the score that I wanted, as the lessons are excellently taught. They never miss a lesson. Never had any problems from them.\n\nDuring lessons, tutor teaches in detail and guides me when I do make a mistake or my concepts are wrong.\n\nAlso they advice me on how I can improve and give me strategies on studying for the examinations. Enjoyed my lessons there as they are patient and do care about my scores. Outside, I can message them anytime to help me when I do not understand my school work.\n\nA well balanced tuition centre that teach well, train to get A1, and very experienced.",
      "time": 1569960041,
      "translated": false
    },
    {
      "author_name": "Tina Oh",
      "author_url": "https://www.google.com/maps/contrib/100576802106421016056/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXOa5XBTsCOKwRwtczIEiupkSYBaiWBt2tCfffAscNsWh8IH9g=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "6 years ago",
      "text": "My daughter’s favourite Teachers. She cannot stop talking about the things she learnt in their classes, and then questions me to see if I know it too. Kids nowadays are getting just too smart for their own good.\n\nThe classes are small here. Only 3 students. I find it quite a good size because they can have friends but yet still get the attention needed.\n\nTeachers are quite good. They tell me what I can do to help my daughter, sometimes brutally honest with her mistakes, which is a good thing, and they are willing to extend themselves during exam periods to push her harder.\n\nRecommended tutors definitely.",
      "time": 1557960465,
      "translated": false
    },
    {
      "author_name": "Darren Yong",
      "author_url": "https://www.google.com/maps/contrib/108700845425521089616/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVKqV-kIx8EiJBLtWTLejj4_dijkcRnvoQz2X4Z4YEIU-WgV7o=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "6 years ago",
      "text": "Daughter improved. Tutors teach then guide my daughter through given work. When daughter needs help, they listen.\n\nVery calm, patient and reassuring tutors in control of the situation, my daughter gets praised when she is doing well, and readjusted when she makes a mistake without making a big fuss over it.\n\nThat helps a lot in building up her confidence. Good recommendation.",
      "time": 1558199920,
      "translated": false
    },
    {
      "author_name": "Sally Yip L",
      "author_url": "https://www.google.com/maps/contrib/101967951731983979058/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUA-EGx78vAtmH1wY5XMSVuPCtlDm9iEC4MVTcDk6k-YrtN0Ns=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "Good tutors for Secondary English and Mathematics. Very small group and high contact time in class.\n\nDaughter goes to Nan Chiau High, and is now an A1/A2 grade student from an E8 for Additional Mathematics after attending their tuition.\n\nThey teach ahead of school curriculum, and knows the school well enough from previous Nan Chiau students that attended their tuition.\n\nTheir way of teaching is closer to that of a sports trainer as their style of teaching is more of coaching than tutoring. Once they start teaching my daughter, they started correcting her weaknesses. They will teach from basics and use the text book before moving onto past year papers. This changes the way my daughter understands her schoolwork.\n\nMany of these small changes makes the big difference too. She used to make a lot of silly calculation mistakes that cost her dearly, but all these are starting to fade away.\n\nOnly bad thing I can think of is that the tutor can give batches of past year papers and expect students to do them at home before he runs through them the next lesson. Sometimes if my Daughter doesn’t bring it, and cannot complete it, she won’t get it marked. Of course, it is part of my daughter’s job to do it, but her own schoolwork can be aplenty and she cannot cope with the extra work given.\n\nHowever, during the exam period, the tutor will do a lot more lessons and spend time to train them to score in their exams.\n\nAlso a big bonus is that he will work with the students and answer questions anytime of the day by text messaging, which I think is the passionate level of teaching that I don’t find anywhere else.\n\nWell recommended if you want the best Secondary Maths tutor in Punggol.",
      "time": 1571080841,
      "translated": false
    }
  ],
  "types": [
    "secondary_school",
    "primary_school",
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2940270030439774608",
  "user_ratings_total": 24,
  "vicinity": "83 Punggol Central"
}