{
  "formatted_address": "664 Yishun Ave 4, Block 664, Singapore 760664",
  "geometry": {
    "location": {
      "lat": 1.4200199,
      "lng": 103.8409445
    },
    "viewport": {
      "northeast": {
        "lat": 1.421310680291502,
        "lng": 103.8422301302915
      },
      "southwest": {
        "lat": 1.418612719708498,
        "lng": 103.8395321697085
      }
    }
  },
  "name": "eduKate Yishun English Math and Science Tutor Tuition Centre",
  "place_id": "ChIJB-OY5g8Z2jER4q1rGcpCMvk",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Jessie Chong",
      "author_url": "https://www.google.com/maps/contrib/116901139673713881651/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU63ExchsRVeJEA1mUJplGy0KAQuo8cPvqtFNkVbMf5cGiTyhY=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "Daughter attends P5 English and Maths tuition with them.\n\nFriendly tutors are patient, kind and attentive. After they did a few lessons with my daughter, they decided that she needed some extra lessons and they took the extra step to ask her to stay longer and get all her work done properly. They monitor my daughter’s progress and works with her on her weaknesses. That level of caring about their students are amazing. Very much appreciated.\n\nThey are definitely on the upper end of the price range in Yishun, so it took me a bit of thinking before I committed, but the level of teaching and professionalism given reflects the price. You do get what you pay for here.\n\nDaughter is still improving after a few months with them, but the changes are positive and she feels better now when she is doing her homework.\n\nThere is not much to complain other than the slightly premium fees but the tutors pretty much do everything and don’t have any other hidden costs or surprises. They start on time, haven’t had a cancellation on me and if there are any changes, they’ll contact me to make sure everything is done properly. I will definitely recommend them to you.",
      "time": 1567216382,
      "translated": false
    },
    {
      "author_name": "Kayla Ho",
      "author_url": "https://www.google.com/maps/contrib/113261357100143019080/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWLiqLIU4dco46che_21mQqF5UPsZeZgG0yFflItcY-a7oJiRA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "Son just received 83/100 for his P5CA2 Mathematics. He is taking classes with eduKate for the last two years. He improved year on year on his Math.\n\nThe first year improvements were smaller than this year, maybe he was not too used to the classes because he joined somewhere in June.\n\nOf course by now, he is one of their old boys so he feels much more confident. My son will usually come back and tell me how much he learnt and how much fun he had going for classes.\n\nTutors are professional. Works with my son on his weaker topics. They go through the topics systematically, and provide a lot of extra knowledge to increase my son’s knowledge. They go through questions if he do not understand. Close to exams, they start training my son with past year exam papers.\n\nOverall, they are a good team of tutors that supports my son and they do care a lot. Recommended to start lessons with them early in P4-5.",
      "time": 1567616962,
      "translated": false
    },
    {
      "author_name": "Louisa Koh",
      "author_url": "https://www.google.com/maps/contrib/100055617109383631533/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJjM1vlyGX2k3wlr8UpFX3GD-rDdUCteEfkJYirAjowGeba5w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "Good tutors. No problems with them. I recommend them for Secondary English. My daughter goes to Dunman High School and does their IP programme English.\n\nShe has been with Teacher Yuet Ling for 3 years and she is in Year 4 now. When she started, she scored a C. Not she is scoring an A* grade in school. 36/40 and she says it’s not easy to get these high scores in school for her English modules.\n\nThe tuition centre has a very high standard and covers materials that makes a lot of difference to my Daughter. I have seen how much her ideas and knowledge has grown under their tutelage whilst getting a lot of content written into her compositions.\n\nThere are not much to complain, the tutors do not bother me much, just pay them on time and they always keep all their work professional. They are on time, do not change lessons and has make up tuition when there are holidays.\n\nThey only need to update me now and then to catch up. My daughter’s scores are up, so I don’t need to worry too much that way.",
      "time": 1567529446,
      "translated": false
    },
    {
      "author_name": "Micheal Chang",
      "author_url": "https://www.google.com/maps/contrib/109168353711548968195/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXSTKefUw77_-qLpEWvQ_YIZRtMb93S70kIPd9oQ2IsvuasKP0=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "6 years ago",
      "text": "Congratulations Teacher Yuet Ling for the new shop! I owe them a review for all the good things that has happened since my son attended their tuition in Tampines back in 2013. Top tutor for Primary and Secondary English. Not too shabby for Mathematics and Science too. Two thumbs for their dedication, highly professional teaching and a knack for understanding how to build a student's psyche to score. A deft touch in teaching and managing student's progress, give them a call because you won't get any better than this.",
      "time": 1553677812,
      "translated": false
    },
    {
      "author_name": "Liv Ng",
      "author_url": "https://www.google.com/maps/contrib/103505215819191419665/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXsR8LgllIZCwHmFdTFAfezHNnJsmL8VQjNHwjY4CBCgJ6cX9M=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "I started Mathematics tuition in June. I am in Sec 3 and needed some guidance as I cannot understand my topics and did not get a pass during the mid year exam.\n\nI have so far attended 3 months and my recent test I scored 67% so I am happy it is working. The tutor helped me quite a bit and I think I have a lot more to learn to do well in the final year examinations. There is not much to complain since I can see improvements, the tutor explains patiently, understands how I make mistakes and corrects me.\n\nWhen I go back to school, I can understand what is happening and also do the homework given to me. Before that, I was very confused.",
      "time": 1566865102,
      "translated": false
    }
  ],
  "types": [
    "secondary_school",
    "primary_school",
    "university",
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17956488100056903138",
  "user_ratings_total": 13,
  "vicinity": "664 Yishun Avenue 4, Block 664"
}