{
  "formatted_address": "3 Mount Elizabeth, #03-09, Singapore 228510",
  "geometry": {
    "location": {
      "lat": 1.3044718,
      "lng": 103.8352639
    },
    "viewport": {
      "northeast": {
        "lat": 1.305720830291502,
        "lng": 103.8366801302915
      },
      "southwest": {
        "lat": 1.303022869708498,
        "lng": 103.8339821697085
      }
    }
  },
  "name": "EH Heart Specialist Clinic – Cardiologist",
  "place_id": "ChIJEW8RUpIZ2jERNLMRNrJCtcw",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Naznin’s Culinary Studio FB",
      "author_url": "https://www.google.com/maps/contrib/100350287937286996372/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXDCUVyp-2VFNvKxVzAMK0_Ns0uCGOaXNQZKb8CyM70joe1XCnp=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Dr. Eric Hong is an excellent cardiologist doctor I have ever seen. He treated his patient with great sincerity and huge care. I have been met with him with my father while my father had an worst heath condition. My father couldn’t walk and he started to use wheel chair. But just after treated by Dr. Eric Hong he started to walk by himself. Dr. Eric hong done an angioplasty surgery and gave medication to my father.\n\nAs an attendant I was amazed by his behaviour,  because Dr. Eric Hong explained very well what happened to patient? Why it happened? What to do and why?\n\nDr. Eric Hong is already one of the top cardiologist at Singapore and I wish him more more success ahead.",
      "time": 1691505619,
      "translated": false
    },
    {
      "author_name": "Steve G",
      "author_url": "https://www.google.com/maps/contrib/112826319209867814117/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKLc99khfptElpzKHRrHBx7KIKg5WHXcVjHsICyxDtqy8mtfg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "I first attended the EH Heart Clinic around 2013 and for the last 11 odd years Dr Eric Hong has been looking after me, I was just lucky I was directed to this clinic, as before in Australia I had heart disease and the public system there just threw drugs at it, I arrived and he had me in surgery the same night. Dr Eric put several stents in and I was a new man. In my view point he saved me. Just recently he saved me again again! where he recognized I was having a stroke by getting me in to the hospital fast!  Twice is enough :-) THANKYOU Dr Eric, I'm now leaving you in peace. I would also like to thank the staff of the Clinic, Ms Christina and her team are efficient, pleasant and caring. You walk in the morning for Blood tests, ECG and scans and in the afternoon your having the consultation with the Doctor.  Thanks again and all the best to EH Heart Clinic Singapore.",
      "time": 1718682704,
      "translated": false
    },
    {
      "author_name": "Michelle Goon",
      "author_url": "https://www.google.com/maps/contrib/103011111410229063695/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXn93uqsAO0biDtswNLCBnXQq-kqOZx_W9F0nYWla5-BPJ_cS_R=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Both my parents are under the superb care of Dr. Hong, who is a very compassionate and thorough doctor. He takes great pains in ensuring that the best treatment is provided to my parents and also very patiently explains their condition, results and course of actions to them. It’s has been a blessing to have my parents under his meticulous care. Also, his team at the clinic are a great support ensuring that administratively everything ran as smoothly as possible for us during procedures and hospitalization. We cannot express enough how grateful and thankful we are! Thank you once again.",
      "time": 1643609231,
      "translated": false
    },
    {
      "author_name": "Solo Enk",
      "author_url": "https://www.google.com/maps/contrib/115659941986857574853/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIysO0sqF4YniKySYT5KbTnLi3v335vaVsPnERme4WyAZXvrQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "My father had a heart procedure about ten years ago by Dr. Hong to receive stents. We started corresponding with Dr. Hong since August, 2022.\n\nMy father lives in Mongolia and his health was unstable, so he couldn’t travel abroad easily. Then he had a heart attack in October, 2022. When he finally made it to Singapore in November, 2022, he was in terrible shape. My father needed to be in constant care, getting his blood pressure and glucose levels checked regularly, and taking medicine.\n\nAlso, it was my first-time ever doing medical translations and interpretations, so I was very, very nervous about this visit. But the whole staff was brilliant and welcoming from their door-steps.\n\nDr. Hong had a clear plan and directions for us when he had seen my father. He produced all of our correspondences, health results, and the old files of my father. Dr. Hong was ready for our visit complete with a plastic heart model and gave us a very comprehensible overview of my father’s health condition. He explained everything so clearly, it felt like our eyes opened.\n\nWhen all the diagnosis came through, Dr. Hong set things in motion, everything went according to plan, and for the duration of our stay we were completely taken care of by Dr. Hong and his skillful team. We witnessed my father’s health improving as soon as the third day of our visit. My father is now back in Mongolia, enjoying his time with family, immersing himself in his craft.\n\nWe highly recommend Dr. Eric Hong and his staff, Christina, Rebekah, Ivy Cheryl  …, Thank you very much from the bottom of my heart.\n\nHappy new year!\n\nSincerely,\nSolo",
      "time": 1723441673,
      "translated": false
    },
    {
      "author_name": "Reena Rahman",
      "author_url": "https://www.google.com/maps/contrib/107699805783231151930/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKyTZOvOXpLgTa_tErwPdl_YKPeCe_8sJp_QhPQEtGVDRlM3A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Dr Eric Hong is a dedicated, thoughtful, and compassionate doctor who truly cares for his patients. For the past ten years, Dr Hong has been caring for my mum and is still caring for her until today. A doctor who goes above and beyond his duty, he works hard to serve humanity. Ten years ago, his diagnosis on my mum saved her life. He is a meticulous doctor who could identify issues quickly and would suggest timely intervention to provide his patients with another chance to lead a quality life. Again, this year, with his professional judgement, my mum was saved for a second time. We are thankful to Dr Hong for being the source of comfort for our family. We have great confidence in his abilities and trust that whatever he does is for the best interest of his patients. We are also grateful for the excellent treatment and the caring staff of EH Heart Specialist Pte Ltd. The secret to my mum’s awesome recovery is a doctor who is simply extraordinary. He is truly a unique gift for his patients. We feel so blessed to have known Dr Hong and have him as my mum’s doctor.\n\n_______________________________________________________________\n( 4 years ago)\n\n6 years ago, I was frantically looking for a good doctor for my mum after realising that she had severe blockages in her arteries. I was initially referred to a cardiologist and after the consultation I was terrified with the outcome that I may have to face. That was when I decided to seek for a second opinion. I was glad that I found Dr Eric Hong. He was very professional in his explanation providing us with detailed analysis. He was practical in providing the different avenues that could be taken to save my mum’s life. I could vividly recall how my world came crashing down at the thought of losing my mum but thanks to Dr Eric Hong’s critical judgement. He was able to accurately pinpoint the problem and advise us on the immediate steps that were to be executed in order to save my mum. He is highly proficient in the different aspect of heart health. He is empathetic and sensitive to the feelings of his patients and their family members. It is evident that he practices with his heart and the well-being of his patients being his priority. I am truly blessed to have met Dr Eric Hong. It has been 6 years now and my mum is doing well under his care. I would also like to thank the staff of EH Heart Specialist Pte Ltd. They are dedicated and professional in handling the tests and caring for the patients. Knowing that my mum is in good hands gives me a peace of mind. Thank you, Dr Hong, for being a great doctor! I can never thank you enough for all that you have done.",
      "time": 1673956198,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14750769487700669236",
  "user_ratings_total": 31,
  "vicinity": "3 Mount Elizabeth, #03-09, Singapore"
}