{
  "formatted_address": "Blk 102 Towner Rd, #01-258, Singapore 322102",
  "geometry": {
    "location": {
      "lat": 1.3204569,
      "lng": 103.8619711
    },
    "viewport": {
      "northeast": {
        "lat": 1.321862780291502,
        "lng": 103.8632412802915
      },
      "southwest": {
        "lat": 1.319164819708498,
        "lng": 103.8605433197085
      }
    }
  },
  "name": "El Shaddai Arthritis & Rheumatism Specialist Medical Centre",
  "place_id": "ChIJoeApXtEZ2jERsXX2LBQO8To",
  "rating": 3.1,
  "reviews": [
    {
      "author_name": "Lilian L",
      "author_url": "https://www.google.com/maps/contrib/113028320897890116418/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL2hhrsVsF86lFF7eHS9vlIPkfIGyQtd3-BW7BDMKXpIVMa-g=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "I would give 0 star if i can.\nMy mum had painful knee and went to see this doctor introduced by her friend. Dr Yoon mentioned that my mum has stage 2 OA and to be given 3 jab in total over 3 weeks. He prescribed ultrasound and medicines and also blood test. It is extremely expensive and overcharged my mum, she only had 1 ultrasound scan on 1 knee and he charged my mum for 2 knees. It was suspicious to me cos' he didnt order a MRI which should be the 1st time to do to check the knee.\n\nMy mum went for 2nd jab and gotten the lab report, it indicated high white blood cells which indicated an infectious, however he didnt do anything and continue to give her jab. He even ordered 3 sessions of physiotherapy for my mum which is utterly useless for her case.\n\nMy mum knee became swollen, painful and eventually cant really walk. She went to see another specialist which was angry with Dr Yoon wrong analysis and treatment. He ordered MRI for my mum and to wait for 1 week to get the report. Unfortunately my mum couldnt wait as she was really in pain, she went to see GP and was ordered to go A&E immediately.\n\nLong story short, we gotten the MRI report and the dr in TTSH ordered operation within 24 hours. And he even told my mum not get anyhow get jab in future before my mum was discharged.\n\nI would not recommend this Dr Yoon to anyone.",
      "time": 1733496965,
      "translated": false
    },
    {
      "author_name": "Vikram Kumar",
      "author_url": "https://www.google.com/maps/contrib/108057408393807127128/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ9PWbPpu_xbvzD48XTDPxvxCtgXsfnbeE8sSYUdlpyXLvCcg=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "3 weeks ago",
      "text": "I give 5 star for consultation with doctor.\nSupport staff 1 star.  Be prepared to wait total of around 2 hours before & after consultation. Support staffs are very slow.",
      "time": 1745913513,
      "translated": false
    },
    {
      "author_name": "lp Leong",
      "author_url": "https://www.google.com/maps/contrib/101441064426089371065/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU_rQH_UiBolAQHWCFzErpmVXKa6ZqOC2eJsC5WTfogeE2YLShR=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Tips:\n1. Whatever recommendations given (pills, injections etc.), please ask the doctor if it is covered by your insurance as well as the benefit. Information will not be offered unless asked.\n\n2. Some pills are supplements.  They can be cheaper outside.  However, do your own homework on the supplements as cheaper may not be the same.\n\n3. This Dr absolutely likes giving you pills, supplements and injections, like it is a SOP (🤑).  Then order a series of blood tests too.  If he recommends any other physical treatment, go next door (🤑).  If, unsure, don't take the suggestions.  Get 2nd opinion. Main objective is to treat symptoms.\n\nNote on 12/12/23 visit:\n\nWas referred here by insurance agent. It’s very far from me and is not my preferred location. However, I was given limited choices, so I agreed. Luckily blood test can be conducted at another clinic, saving travel and waiting time if you go to a less crowded clinic near you. Ask for a form indicating the tests required.\n\nFirst 2-3 visits, I spent about 1 hour+ here total. Today, I spent a total of 3 hours!!! While waiting, I noticed all those who arrived before me left. I got up to ask. I asked again 2 more times. The final time, I asked another patient paying when did she arrived. 11.20 am. Paid by 12.30 pm. I arrived at 10 am, I’ve not seen the doctor at 12.30 pm. Isn’t it clear something is not right? At the counter, they still ask me to be patient and wait. What?!",
      "time": 1742546371,
      "translated": false
    },
    {
      "author_name": "Muhd Zahirul Ibrahim",
      "author_url": "https://www.google.com/maps/contrib/109700764612977556278/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXYreQOfhVGZNZcSJYkwjcj4WxdbgArUYwUN2FeFKYRBk7I2lcz=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "My mum and dad seeing doctor Yoon for many years. He is professional and caring with his patients. The staffs are very friendly and helpful. We like to thanks doctor Yoon and his staffs for their great service to their patients.",
      "time": 1728297056,
      "translated": false
    },
    {
      "author_name": "Florence Yoo",
      "author_url": "https://www.google.com/maps/contrib/117712794511528475462/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLZ2pXhRruTSaZCelrSDI3zjY6Fi6UNx8jbQDWY4k-qVcuf6A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Dr Yoon had been treating my sis for arthritis and lupus for 17yrs until she went home to the Lord. Throughout the period, he had beeen compassionate and caring, attending to her requests for help and consultation even on Sundays. Sometimes, he would also waive the consultation charges and gave discount on meds to help manage the high medical costs.\nHe is a doctor with skills who also serve with his heart. 👍",
      "time": 1727858980,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4247191403403572657",
  "user_ratings_total": 61,
  "vicinity": "Blk 102 Towner Road, #01-258"
}