{
  "formatted_address": "600 N Bridge Rd, #14 01 Parkview Square, Singapore 188778",
  "geometry": {
    "location": {
      "lat": 1.300164,
      "lng": 103.857731
    },
    "viewport": {
      "northeast": {
        "lat": 1.301386030291502,
        "lng": 103.8589389302915
      },
      "southwest": {
        "lat": 1.298688069708498,
        "lng": 103.8562409697085
      }
    }
  },
  "name": "Elite Spine Centres - Chiropractor Singapore",
  "place_id": "ChIJq6pq-ssZ2jEReNV13zxlqMc",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Mark Montesclaros",
      "author_url": "https://www.google.com/maps/contrib/116702393989094032785/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLBtoTkWw5qYexl260-THUq-1J8yD7RLakZobkH286wu9k1yw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I've had the absolute pleasure of being treated by Elite Spine Centres and their incredible team! From the moment I walked in, I was greeted with warmth and kindness by the nurses, who made me feel at Home.\n\nDr. Mike is a true master of their craft. Their expertise, patience, and genuine care for their patients' well-being is truly exceptional. They took the time to listen to my concerns, explained everything in a way that made sense to me, and developed a personalized treatment plan that has made a huge difference in my life.\n\nThe entire staff is friendly, professional, and dedicated to providing top-notch care. They make you feel seen, heard, and valued. The Clinic is clean, modern, and welcoming – a true reflection of the exceptional service you'll receive.\n\nI've already recommended Elite Spine Centres to friends and family, and I'll continue to do so. If you're looking for a chiropractor who truly cares about your health and well-being, look no further!\n\nFive stars isn't enough – I'd give them ten stars if I could!\"",
      "time": 1735017421,
      "translated": false
    },
    {
      "author_name": "Gayathre Mogan",
      "author_url": "https://www.google.com/maps/contrib/105638916274397108561/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIyYsSfpuWwtHyPIEs3sXxsJ26y5Kv0XrmPbfLp9KLo1rzlsA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I am incredibly grateful to Dr. Mike and his amazing team for the care and support they provided during my treatment for my lower back issue. From the very first session, the team’s warmth and attentiveness made every visit a positive experience. They consistently ensured that I was feeling comfortable and well taken care of.\n\nDr. Mike’s reassuring words and expert techniques gave me the confidence that I would recover with time. After 14 sessions, I am thrilled to share that my pain has improved significantly. I deeply appreciate the dedication and professionalism of Dr. Mike and his team, and I cannot thank them enough for helping me on this journey to recovery.",
      "time": 1735888117,
      "translated": false
    },
    {
      "author_name": "SP",
      "author_url": "https://www.google.com/maps/contrib/117196314713403023343/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKue-ZT00l1nOy5w7MSNx5nWTy-9wvgAHmueyl2dqTIBIYCeQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "I had some issues with my shoulder and was recommended to Dr. Mike at Elite Spines.\n\nDr. Mike explained clearly on the term \"biomechanics\" before relating it to my issues of concern and the plan of treatment.\n\nHome exercise was shared too, so that we do not rely wholly on the treatment especially when we are unable to go for appointments.\n\nMy shoulder pain has significantly reduced after less than 10 visits.\n\nAll thanks to Dr Mike and the team who are always very friendly, caring and professional in carrying out the treatment.",
      "time": 1747382998,
      "translated": false
    },
    {
      "author_name": "jingxian Yeo",
      "author_url": "https://www.google.com/maps/contrib/107539656847627528411/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ1SHtTpeqvQD43emnNVb5Bv_wF0vhItuha5udlc-G-PBy7EuFn=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Very happy with Dr Mike and team's effort to help with non invasive treatment. I was on the brink of heading for irreversible spine surgery, thankfully under Dr Mike's care, I am able to keep my symptoms in control and eventually work towards full recovery. Thankyou for your help and support through the last 3 months of my therapy.",
      "time": 1736475297,
      "translated": false
    },
    {
      "author_name": "Isa Mohamad Saini",
      "author_url": "https://www.google.com/maps/contrib/109774731661215041222/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUeOS69lclw5Bez7-m4B1vNW4F9XiB97JrIdKtEOhamvK6hOic=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I've been having back pain for 1 year. I've been to another chiropractor, but the pain still persists.\nAt Elite Spine, the treatments that were needed for my back pain were explained clearly by Dr. Montgomery and why the treatments were necessary.\nThe clinic assistant are all knowledgeable and friendly,  explaining what they are going to do before each treatment .\nExercises & stretches are taught too, which greatly helps with the recovery.\nMy back pain was alleviated after the 3rd visit\nHighly recommend Elite Spine to those that is having back & lumbar problems",
      "time": 1733546925,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14386860321756534136",
  "user_ratings_total": 371,
  "vicinity": "600 North Bridge Road, #14 01 Parkview Square"
}