{
  "formatted_address": "111 Somerset Rd Level 16,Unit Number 12A/13/14, Devonshire Wing, Lobby, B TripleOne Somerset, Singapore 238164",
  "geometry": {
    "location": {
      "lat": 1.3001685,
      "lng": 103.8372952
    },
    "viewport": {
      "northeast": {
        "lat": 1.301313180291502,
        "lng": 103.8384902302915
      },
      "southwest": {
        "lat": 1.298615219708498,
        "lng": 103.8357922697085
      }
    }
  },
  "name": "Embassy of the Republic of the Philippines in Singapore",
  "place_id": "ChIJsZi5QfUZ2jER__rtJsWSAG0",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "TINA BALTAZAR",
      "author_url": "https://www.google.com/maps/contrib/117519133608854498212/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKeQZpL39TAsa6C84pFZ896vwB8UuiQy1c3VPFcbw7q8d-erQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "I got scolded by the officer at the front door saying that I wasn’t following the dress code. I understand it and obliged but the manner of which they spoke to me and my family could be improved. No need to call us out loudly in the hallway :)\n\nThe photocopy machine was not easy to use, it would help if the instructions were clear and listed from afar. So one does not have to crowd around the machine. No wonder the staff frequently has to troubleshoot each time.\n\nThe staff in the OEC and Passport renewal were very nice and no complains here.\n\nAlso, may I suggest to make the website of the embassy clearer in steps / procedure. Do make sure the links work.\n\nIn as much as we enjoy hearing the news and achievements of the embassy, I believe the service to the Filipino worker is more valuable as we look for reliable and accurate information.",
      "time": 1738662232,
      "translated": false
    },
    {
      "author_name": "Manjit Kaur",
      "author_url": "https://www.google.com/maps/contrib/102054950610823571168/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJiIVAijBIZq8ezZSJ_TA9eo4UgUyJk25UcHeDd6mOqo2WuUA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "in the last week",
      "text": "I wish I didnt need to give any stars at all. Absolutely horrendous experience with the agency. Spoken with May from the embassy who was extremely unhelpful. We had no idea that our helper was let into the country on another employer's name and this is a glitch in their country and their systems. We only liaise with the philippines agency here and process our documents accordingly with the Singapore law. We were unable to process the online app for her return to Philippines on holiday but unable to do so, as it turns out she never had to do it under our employment. May told mum helper to go down to the embassy. Turns out nothing was actually resolved. I asked what was the purpose of her visit and she couldn't give me a clear answer. She just complain about what we did wrong. Correction: we didn't do anything wrong here. We had no idea of any of these things. Lots of inefficiencies and red tape in the country. Said she was protecting her workers. Well, they are charging fees for it. Said they won't take in any walk-in appointments.  If the apps and processes were inneficient, we eould never have to call them and deal with their staff onsite.\nTerrible embassy with no respect for anyone.",
      "time": 1747371280,
      "translated": false
    },
    {
      "author_name": "White out Account",
      "author_url": "https://www.google.com/maps/contrib/101980600332134415710/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIqKFZAGDvDPmv4czj2mVR6RFR8czfcUwWRZ0g3I9yyVnA7sw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I've been visiting this embassy for quite some time now, and I'm truly impressed by the steady improvements I've seen. While the space is modest, the service has consistently exceeded my expectations with its speed and efficiency, showing remarkable progress.",
      "time": 1744682217,
      "translated": false
    },
    {
      "author_name": "Kateryna Karpiuk",
      "author_url": "https://www.google.com/maps/contrib/116572666485301089772/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVMHk_aWn48-mEa3F-xabdf2m1uSahf7PD0RC6WVmAynOkgAF_LiA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "The most unpleasant and rude embassy I have ever been to. Be prepared to be stopped at the entrance by three men claiming to work for the embassy, yet without name tags or any proper introduction of their positions. I was there with my one-month-old child for his visa, and they stopped me because I was wearing shorts. There are no guidelines or recommendations anywhere from the embassy regarding a dress code.\nI don’t know who they are, but as consular staff, they are unprofessional and have zero knowledge of what is written on their own website. Overall, I had the impression that these people were just loitering around. Moreover, they were not dressed like embassy staff at all. Their behavior was disrespectful and humiliating for me as a woman.\nI will never return to the Philippines—they have zero understanding of how to provide decent service!",
      "time": 1740367761,
      "translated": false
    },
    {
      "author_name": "Jenalyn Villeta",
      "author_url": "https://www.google.com/maps/contrib/107390412131480742739/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKVCfB3-pLoNEZa1L7BYUNBfDb0bEtpMLc0VL0qFkxUnmlHMQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Visited the embassy today and it takes only 25 minutes to verify my contract and owwa. Grateful to the reception area for giving me the Q number for OWWA eventhough I don't have an appointment. Thank you kabayan",
      "time": 1742541252,
      "translated": false
    }
  ],
  "types": [
    "embassy",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7854439125593488127",
  "user_ratings_total": 1287,
  "vicinity": "111 Somerset Rd Level 16,Unit Number 12A/13/14, Devonshire Wing, Lobby, B TripleOne Somerset"
}