{
  "formatted_address": "1 Pasir Ris Cl, #04-101, E!Hub 519599",
  "geometry": {
    "location": {
      "lat": 1.3759197,
      "lng": 103.9556213
    },
    "viewport": {
      "northeast": {
        "lat": 1.377651530291502,
        "lng": 103.9570981302915
      },
      "southwest": {
        "lat": 1.374953569708498,
        "lng": 103.9544001697085
      }
    }
  },
  "name": "Eminami Halal Vietnam Downtown East",
  "place_id": "ChIJ_fVKw_I92jERQvR_8Xcc6U0",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "tung how run",
      "author_url": "https://www.google.com/maps/contrib/108019475651876754079/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJXj2WgVtvFpbIlXoncEH-ofuPE1jlkoMwzQfygT61B1x8qXeM=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "An absolute hidden gem.\nIt’s a little hard to find, tucked away on Level 4 next to an arcade shop, but definitely worth the effort.\n\nThe food quality is exceptional. Their salted coffee and egg coffee are truly unique — flavors you won’t find in other Vietnamese restaurants.\nThe beef-based soup and chicken pho also stand out, with a rich, thick broth that sets them apart from typical Vietnamese eateries. I was especially impressed by the use of fresh green bird’s eye chilies, different from the red ones commonly found at NTUC.\n\nBest of all, the restaurant is halal, so I can confidently invite a wider group of friends to enjoy it.\n\n*As you can see the egg coffee is kept warm under a hot water bath to keep the temperature constant and prolong enjoyment.*",
      "time": 1745735152,
      "translated": false
    },
    {
      "author_name": "Clarence Ow",
      "author_url": "https://www.google.com/maps/contrib/112234615480628100933/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX_dX_-LEj7UqCWF1JKZREPhyLFgPJjp7PYAIjqqOhzJhaYPuc=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "A rather new Halal Vietnamese shop located at the top floor of E-hub. I happens to came upon this shop due to a Valentine promo.\n\nThey not only served delicious and authentic Vietnamese food, they also open to new creations by taking reference from other cuisine and culture.\n\nThe smoked salmon Vietnamese roll is a rare dish and having smoked salmon in the roll makes it more unique and delicious.\n\nThe Vietnamese crepe is both crispy and fluffy. With the sauce, it taste wonders.\n\nMy mother, who have a traditional taste, loves both the roll and crepe.\n\nThe pho is generous with the beef. However, on that day, i realized there's no beef ball in my bowl while other bowl have it (oh no :",
      "time": 1744880902,
      "translated": false
    },
    {
      "author_name": "Sten (Piqued Wanderer)",
      "author_url": "https://www.google.com/maps/contrib/115011929186540431052/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWWbpFyJ2wLsASsvdpfZFU2nvqzXRkXyOzw-cYNB81OlxGaDNZM=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "Modern, clean and very inviting.\n\nThe venue seems to be well decorated, with lots of thoughts taken into considerations. We were definitely enjoying the the venue in terms of experience.\n\nLets dive in!\n\nFood:\nThere were rather plenty to choose from, not limited to the normal banh mi or pho that many knew. In terms of taste, we definitely enjoyed the food that was ordered.\n\nService:\nFood arrived rather timely. Not the slowest and not the fastest but we would equate to just nice. Staff were very welcoming too.\n\nAtmosphere:\nThe place is nicely decorated and painted with a green base, which adds on to the feel of it. We also noted that the view is great here, since it is on L4 of downtown east.\n\nSo yeah, if you are for Vietnamese food, this is a must to go. Oya, they have Salaam Cola too (replacement for Coke). Do check them out!\n\nJz to add, the images do show our empty plates, which clearly shows our level of enjoyment here.\n\nCheers!!",
      "time": 1747367590,
      "translated": false
    },
    {
      "author_name": "Wani Mohan",
      "author_url": "https://www.google.com/maps/contrib/113558214947302973104/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLQ0ihfXZPq7XUfR9YFnyk9J8-9lr1FLahPOaiGUHeHEyi3vQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Had  vegetarian dry noodles 🍜 Bun Thit Nuong Chay and vegetarian baguette 🥖 Banh Mi Chay.  Both vege and non-vege dishes available. I am speechless. It's top notch!! Tasty and totally impressed and amazed. It's like a hidden treasure at 4th level at Downtown east. Nice atmosphere. Nice music. Kids friendly. Highly recommended. A MUST check out place.",
      "time": 1742545655,
      "translated": false
    },
    {
      "author_name": "Food Kakis",
      "author_url": "https://www.google.com/maps/contrib/112276475321726019597/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIk-dbK6K4RRi1TwSck_eoyVT0dM40p6GHEAUmNGTl26KsODw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "They offer authentic vietnamese cuisine blending tradition with a modern twist. We tried their Fried Spring Roll Banh Mi 🥖which came with a choice of soda water as part of the Lunar New Year promotion. The Fried Spring Roll Banh Mi had a chewy bite texture, complemented with crispy exterior and fresh flavours.\n\nWe also tried a variety of other popular items on the menu such as their Beef Pho, Fresh Spring Rolls, Mini Crepes 🍳. The staff are also very friendly and service oriented here - you can look forward to a pleasant Vietnamese food experience!",
      "time": 1738508492,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5614049711972414530",
  "user_ratings_total": 81,
  "vicinity": "1 Pasir Ris Close, #04-101, E!Hub"
}