{
  "formatted_address": "126 Joo Seng Rd, #09-06, Singapore 368355",
  "geometry": {
    "location": {
      "lat": 1.3362412,
      "lng": 103.8821841
    },
    "viewport": {
      "northeast": {
        "lat": 1.337511680291502,
        "lng": 103.8836383802915
      },
      "southwest": {
        "lat": 1.334813719708498,
        "lng": 103.8809404197085
      }
    }
  },
  "name": "Empress Kitchen",
  "place_id": "ChIJ494LBVIX2jERgbZHFh_VR6c",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Brenda Chong",
      "author_url": "https://www.google.com/maps/contrib/112109176626364231491/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV2QhtZknPXfJz1Y3qhHQTr9xAXj0BMA4KdduPhLedRm4NnQ1VD=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "Overpriced\n\nExtremely expensive chai fan meal\nPortion was very little\n\nNot as healthy as advertised\n\nFried stuff every day, fried ready made fishball/chicken seaweed\n\nOnly one protein each day and it’s fried!! Fried chicken, fried fish\n\nNot suitable for kids\n\nVeggies are not green!\n\nNot worth the price!",
      "time": 1730204575,
      "translated": false
    },
    {
      "author_name": "Roku Gatsu",
      "author_url": "https://www.google.com/maps/contrib/108823946971568537739/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK-iSRtTytbGnkXNwPqyC7zH2BLvXalQp5eY17hEIiu6uQ-yA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Due to a recent heart wrenching family crisis, we were suddenly left high and dry for our daily homecooked meals. I had the option of brushing up my non-existent culinary skills, using food delivery platforms or buying food home every night. Empress Kitchen food tingkat turned out to be such a blessing and this is why:\n\n1. Let’s face it - A novice doing the cooking after a hard day at work is unlikely to inspire the taste buds of a family of picky eaters.\n\n2. Food delivery platforms - Not only do they apply a mark-up on the food, there are also delivery charges and minimum order.  Such platforms don’t work well for small food orders. On top of that, you have to decide what to eat every night which can be a very stressful thing to do when you are tired and hungry and the young one is not cooperating.\n\n3. Buying food home may be a cheaper alternative but you still have to allocate time to do the buying. It will easily take away 30-60min depending on travel and wait time. There’s also the stress of deciding what to buy, every single night.\n\n4. What I love about Empress:\n\n- I am able to opt for a 3 day per week option, with complete flexibility on which days.  This allows me to adjust it based on my work schedule as well as adjust it based on my fussy family’s food preferences.\n\n- There is a complimentary kid’s meal option (just one meal per week) that allows for even further flexibility. Just last week, we were able to happily enjoy Empress delicious porridge while my kid who dislikes porridge, was equally enjoying the very cute kid’s meal.\n\n- The daily food cost is reasonable and comparable to food delivery platforms.  However, Empress is much healthier (home cooked options), and there’s no stress of deciding what to order (the week’s menu is all laid out in advance).\n\n- The taste is restaurant standard and good quality ingredients are used. The kid who relishes processed food, vegetables and rice finished last week’s Hainanese pork chop n pork belly much to my surprise!\n\n- Tagline: Empress tingkat brings different cultures to your table at your convenience!  Unlike other tingkats which tend to focus on Chinese style cuisine, we have enjoyed Japanese, Korean, Indian, Hainanese, Macau, Indonesian, Thai culinary delights so far!  I have discovered why my fussy kid loves Empress!  I may have grown up with Chinese cuisine but kids these days are so exposed to a wide variety of choices that it has become ingrained in their daily lives!\n\nThank you Empress for making life easier and meals more enjoyable!",
      "time": 1714795302,
      "translated": false
    },
    {
      "author_name": "Beng Lim",
      "author_url": "https://www.google.com/maps/contrib/111506954572769436225/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL9nX4CkB_atWHNw0OTVWsYSLbz1IaHoyao4FslTwZZee0w3g=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "I subscribed to their 3 days trial based on their website price but was shocked to received a confirmation email stating a price which is double of what was shown !\n\nI contact them and was told that the website shows a generic template but the actual charge for the trial is different !\n\nTold them that this is misleading and cancelled my subscription!!\n\nSo potential customer be forewarned! To me this is dishonesty!",
      "time": 1741494675,
      "translated": false
    },
    {
      "author_name": "Sheryn Chan",
      "author_url": "https://www.google.com/maps/contrib/114129796940652909486/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUzAmz_TLHs7zFf8duYJrCxeK1th1PNsewd-_H9ND7HyKeYFCgm=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "This review is purely on Customer Service.  I've made enquiries but they do not reply to your messages at all on a pending follow-up action from their end.  This is disappointing as I'm ready to order the bento lunch/tingkat.  This has left a very bad impression.",
      "time": 1741227729,
      "translated": false
    },
    {
      "author_name": "Jennice Ong",
      "author_url": "https://www.google.com/maps/contrib/103409703333230464439/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUNhfNdgJ_G2TeBj0EzCcJCh2v-f56trt_DTo4emAMx-AoN89yS=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "Absolutely delightful tingkat service by Empress Porridge! The food quality and taste was very good, my kid and I love the boiled soup and the kids meal the most, can tell they were made with a lot of love and care. Also, I am very impressed with the excellent service by the whole team, order management was fuss free and pleasant experience. Highly recommended!",
      "time": 1717318820,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12053837257174922881",
  "user_ratings_total": 31,
  "vicinity": "126 Joo Seng Road, #09-06"
}