{
  "formatted_address": "8 Sentosa Gateway, Equarius Villas, Singapore 098269",
  "geometry": {
    "location": {
      "lat": 1.2594154,
      "lng": 103.8166621
    },
    "viewport": {
      "northeast": {
        "lat": 1.260280180291502,
        "lng": 103.8178689302915
      },
      "southwest": {
        "lat": 1.257582219708498,
        "lng": 103.8151709697085
      }
    }
  },
  "name": "Equarius Villas",
  "place_id": "ChIJnTehkP0b2jERlhQlqC00fKY",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Ekim Mike",
      "author_url": "https://www.google.com/maps/contrib/109570058113780516477/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL29lUJYQ9BuNh_wJF1rzNyfpOFueQ5913bEBxqVuLdTzefDdEN=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I recently had the pleasure of staying at Equarius Villa, and it was an exceptional experience from start to finish. The villa was beautifully designed, offering a perfect blend of luxury and comfort. The private setting provided a serene and relaxing atmosphere, making it an ideal escape from the hustle and bustle of daily life.\n\nThe butler service was outstanding—every staff member was attentive, friendly, and went above and beyond to ensure our stay was memorable. The amenities were top-notch, with a spacious and well-appointed room, a stunning private jacuzzi pool, that truly enhanced the experience.\n\nThe location was fantastic especially for honeymooners, offering both privacy and tranquility. Please expect a distance walk from the reception and other vicinities. However the villa offers private buggy to bring you to these places.\n\nI recommend Equarius Villa to anyone looking for a luxurious and peaceful retreat. Of course all these come with a big price tag 😉",
      "time": 1741077098,
      "translated": false
    },
    {
      "author_name": "samiah23",
      "author_url": "https://www.google.com/maps/contrib/109890691401726223385/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJaZ6ywntoR3tx6tBe8aGLeSOC2iUCF7qtd2CUtemEyTv5fwA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "I stayed 3 nights at Equarius Villas in the aquarium suites where I had a view of the wildlife in the aquarium in the townhouses that included butler service. Everything was fine until the butlers stole my jewelry!! I realized I had left them in my room upon checkout, but was already at the airport. I asked if it was possible if they could mail them home to me. I had arranged a mail courier service, as per the butler's request that I had to pay for, to arrange pick up of my jewelry. I tried to organize pick up with them, but they stopped taking my phone calls and stopped answering my emails. The butlers involved were Monica (Suklaing H.) and Jason (Liu Yidu). On top of that, I was never refunded my deposit!! Be careful of your belongings and check your credit card!!!",
      "time": 1746744080,
      "translated": false
    },
    {
      "author_name": "Ariel Wei",
      "author_url": "https://www.google.com/maps/contrib/113903605391918209145/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL-_PwkmK_WKfJ0syDzH5Su0nMWPjeGAJNSzlnfd0KN5tdfXA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Highly recommend this villa. Second time visiting it, as service is impeccable. Nice Room, prompt and good service. Especially out butler and person riding the buggy, so welcoming and friendly. Will definitely visit again!",
      "time": 1731241315,
      "translated": false
    },
    {
      "author_name": "Vike Esmeralda",
      "author_url": "https://www.google.com/maps/contrib/109486564284780888478/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVHoLljGCE6Lc64IrXujRmuEaMJcCjHBLtCmoMz8mxvwaOEMTuF=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "The price you pay is expensive but it's WORTH EVERY PENNY! Excellent service from the team (Front desk, Concierge, Housekeeping, Butler service, Maintenance team).\nLOVED the view and we feared for mosquitoes at night but we encountered NONE!\nThe beddings are comfortable and we definitely experienced the baby sleep.\nThanks to the cheerful team always readily available to assist!",
      "time": 1723344219,
      "translated": false
    },
    {
      "author_name": "Achel T",
      "author_url": "https://www.google.com/maps/contrib/103221294580508539488/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocItj74OqmVG_fiCGhbXB9PZuRy0ms-h4XNxwWiQ50VvFlvgfg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "We have an enjoyable celebration and stay in the villa. The room is lovely and luxurious. Feel so relax watching the fishes. The service staffs are welcoming and helpful, they show us around the villas and explain how to use the control. They go extra miles to decorate the room with balloons since is a birthday celebration. The club car drove us to the shopping mall and pick us up upon giving them a call. Excellent service standard! Really worth staying.",
      "time": 1716146296,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11996520878107333782",
  "user_ratings_total": 334,
  "vicinity": "8 Sentosa Gateway, Equarius Villas"
}