{
  "formatted_address": "18 Jln Masjid, #01-01, Singapore 418941",
  "geometry": {
    "location": {
      "lat": 1.3203746,
      "lng": 103.9124957
    },
    "viewport": {
      "northeast": {
        "lat": 1.321728030291502,
        "lng": 103.9137554302915
      },
      "southwest": {
        "lat": 1.319030069708498,
        "lng": 103.9110574697085
      }
    }
  },
  "name": "Espen Maths and Physics Tuition",
  "place_id": "ChIJH9ZdaiEZ2jEREveJ-mjaPbc",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Hsieh Chi Tung",
      "author_url": "https://www.google.com/maps/contrib/106153043936937304081/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUorNWlodcaCdKRw9omgSQtSK7auV1bQoAVl5fv1ia_0unZnXAK-Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I joined Mr Espen’s class at the begin of J2. Throughout J1, my physics grades were constantly B and no matter how hard I tried, I was unable to improve my grades. After joining the class I started getting straight A for physics and physics became my best subject. His lessons are engaging and the tips and concepts he shares helped me understand physics much better.",
      "time": 1714310120,
      "translated": false
    },
    {
      "author_name": "Darrius Lam",
      "author_url": "https://www.google.com/maps/contrib/106262634064345128717/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKgcCh1nBWVvSc_kTvLECd-y-wYqfsxirqUY0nONIFoA50l=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Mr. Espen is a friendly and effective tutor for A-Level Physics and Maths. His ability to simplify complex topics, personalize lessons, and foster a passion for learning sets him apart. With his dedication and expertise, you can rest assured that you are in capable hands, and will be guided towards success in your A level examinations. Highly recommended!",
      "time": 1709210272,
      "translated": false
    },
    {
      "author_name": "Aaron the Khan",
      "author_url": "https://www.google.com/maps/contrib/114728898334326590204/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUVe5m8mibqD1OAfQNaiK_Zskq3Nz1LYKHO_aSsciJZCbQtuN4gzg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I cannot overstate the impact Espen had on my academic journey. Before working with him, my grades in math and physics were dismal, hovering around the U mark. However, Espen's dedication, expertise, and personalized approach completely turned things around. Through patient explanations, tailored practice sessions, and invaluable insights, he not only helped me grasp challenging concepts but also instilled in me a newfound confidence in tackling complex problems.\n\nEspen's teaching methods are nothing short of exemplary. He possesses a rare talent for breaking down intricate topics into digestible chunks, making them accessible and understandable. His passion for math and physics is palpable, and it translates into engaging sessions that inspire curiosity and critical thinking. Moreover, Espen goes above and beyond by providing additional resources, offering support outside of scheduled sessions, and constantly adapting his approach to suit individual learning styles.\n\nThanks to Espen's unwavering support and guidance, I not only achieved A grades in math and physics A levels but also developed a deeper appreciation for these subjects. His impact extends far beyond the classroom, empowering students to excel academically and fostering a lifelong love for learning. I wholeheartedly recommend Espen to anyone seeking to enhance their understanding and performance in math and physics. He is, without a doubt, a phenomenal tutor whose dedication and expertise are unmatched.",
      "time": 1715833535,
      "translated": false
    },
    {
      "author_name": "22S54 URMIL SINHA",
      "author_url": "https://www.google.com/maps/contrib/116042580396172047043/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJtG5MfXyfMwmJqI3bUoswUOKCyY4fQAODTh2H1tXACwBh15w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I joined Mr Espen’s classes halfway through J1. I was initially struggling with physics and was unable to understand the concepts. However, with Mr Espen’s guidance, I was able to score consistent As throughout J2. His approachable and engaging teaching style complemented my understanding of the different concepts throughout JC. Thank you Mr Espen for your consistent patience and guidance. :)",
      "time": 1714298330,
      "translated": false
    },
    {
      "author_name": "Yok Ray Tan",
      "author_url": "https://www.google.com/maps/contrib/114160773844029819681/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIo58XMQ9BZaUdyLCoTMX5LYnFOFJDyJ0dc6sFVqNDKLwVZRQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I joined Mr Espen’s class halfway through J1. My physics grades were initially shaky but with his tutoring, my physics improved to consistent As from J1 promos till A levels. Mr Espen’s lessons are very engaging and his explanations are clear and easy to follow. Thank you Mr Espen for your guidance!!",
      "time": 1709387267,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13203949826934961938",
  "user_ratings_total": 22,
  "vicinity": "18 Jalan Masjid, #01-01"
}