{
  "formatted_address": "290 Orchard Rd, Lobby C, #09-30/31, Singapore 238859",
  "geometry": {
    "location": {
      "lat": 1.3044544,
      "lng": 103.8360724
    },
    "viewport": {
      "northeast": {
        "lat": 1.305712830291502,
        "lng": 103.8374736802915
      },
      "southwest": {
        "lat": 1.303014869708498,
        "lng": 103.8347757197085
      }
    }
  },
  "name": "Esther Chuwa BreastCare",
  "place_id": "ChIJj0VnOSAa2jER7aOj8Xi9h-Q",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Puay Leng Ng",
      "author_url": "https://www.google.com/maps/contrib/109815528215477100998/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW5h8Ta0sicJe20VgOIZr_OHsd6m30ZzOEEZZrk1cKmqI7b3bLc=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "After a traumatic experience of receiving a cancer relapse diagnosis from my original doctor, I went to dr Esther chuwa for second opinion, under a friend’s recommendation.\nI can’t say enough how thankful I am for the empathic and informative consultation with her - my mind was in a mess and the original doctor snapped at me when I asked questions - but because how patient dr Esther was with me, I obtained information to my situation, which helped me come to terms with the treatment needed lying ahead of me\nA very big shout- out to Nurse Jenny at the clinic - I was just a “one time “ patient at their clinic, but nurse Jenny took the initiative to organise and print out hard copies of my past scans n reports , put them in a folder , and told me to bring this folder to future doctors i visit. And because I was searching for a doctor who is on my company insurance panel (dr Esther isn’t), nurse Jenny took the initiative to ask me if I would like to visit another doctor who is in my insurance coverage n she went on to help me make an appointment too. Very thankful to both Esther n Jenny - the session was a key moment for me on my coping with the cancer relapse.",
      "time": 1743311365,
      "translated": false
    },
    {
      "author_name": "ZQ Ang",
      "author_url": "https://www.google.com/maps/contrib/103860644728661192120/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKRRhKkVSzMrzZ0FI0NCmwec6vv4Hb92_pSfmFQX-b0lNHn5g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I have been a patient of Dr. Esther Chuwa for over a decade, and I can confidently say that she is an exceptional physician. Dr. Chuwa will explain medical matters with clarity and in a calming presence that puts her patients at ease.\n\nNot only have I personally benefited from her expertise, but I have also accompanied friends to see her, and they, too, left feeling reassured and confident in her care. Dr. Chuwa’s dedication to her patients sometimes leads to longer waits as she doesn’t rushes her patients, ensuring that each person and their family receives the attention and care they deserve.\n\nIn a world where healthcare can be complex and daunting, Dr. Chuwa and her dedicated team, including her compassionate nurses, stand out as professionals who truly care. I highly recommend them to anyone seeking a skilled and caring healthcare provider.",
      "time": 1693035599,
      "translated": false
    },
    {
      "author_name": "LiYan",
      "author_url": "https://www.google.com/maps/contrib/109533489355564072489/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJUBfDrvJrOUus-HxToRu-04WLy1FmIO5xrpTqiWUIDCDeZ_60=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "Dr. Esther Chuwa  is a meticulous and responsible medical professional and I had a very positive experience going to her for the past 2 years. She picked up on an issue that previously went undetected in a routine health check-up done at a private hospital. I am grateful for that.\n\nShe is extremely patient during her consults, and is always clear in her explanations, making sure to always address my questions and concerns. Because of her detailed consults, there might be a bit of a wait at times (not unbearably so), but she awards the same level of care and concern to every patient, so I have no complaints. I trust her and would not hesitate to recommend her.",
      "time": 1609902073,
      "translated": false
    },
    {
      "author_name": "Sheralyn Aw",
      "author_url": "https://www.google.com/maps/contrib/101191276418039052617/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWWmHxtpr_pKYbrC4lieMLYrpLgH-aRw3j0Q10wm0L5YZ8XT_6LYw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "Good doctors will always have waiting time at their clinics. Having managed my expectations on that front, I am so happy to have chosen Dr Chuwa for my needs. She is so warm and caring, and I felt really at ease in her capable hands. Am recommending her to all my friends!",
      "time": 1597828994,
      "translated": false
    },
    {
      "author_name": "JY",
      "author_url": "https://www.google.com/maps/contrib/103907400628018681626/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWb_wIfeB8-EBwVm8VgdZiRPqt-sVyBTI4ZREenQaZL5PpJikMMgA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Dr Chuwa is meticulous, considerate and very professional doctor. She reviewed all the past records and explained to us detailedly. The way she spoke to my mom eased her stress. Also thanks to her team, especially to Jennie who arranged all the past records for us. We would like to express sincere thanks and best wishes to all of you.",
      "time": 1625453580,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16467338889651266541",
  "user_ratings_total": 17,
  "vicinity": "290 Orchard Road, Lobby C, #09-30/31"
}