{
  "formatted_address": "70 Punggol Central, #01-05 Punggol MRT Station Exit D, Singapore 828868",
  "geometry": {
    "location": {
      "lat": 1.4042365,
      "lng": 103.9017553
    },
    "viewport": {
      "northeast": {
        "lat": 1.405510930291502,
        "lng": 103.9029500802915
      },
      "southwest": {
        "lat": 1.402812969708498,
        "lng": 103.9002521197085
      }
    }
  },
  "name": "Etern Medical Clinic (Punggol MRT)",
  "place_id": "ChIJL0ieReMV2jERFEQYCN1VTnM",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Si Jia Lim",
      "author_url": "https://www.google.com/maps/contrib/106689547866872489935/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXgpjFLYk6OPtOfpxlBmb1SOuxC7-bDLng4bYOKip0_aOxcs5QE=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "2 months ago",
      "text": "I had an appointment for my second vaccine dose and arrived 5 minutes early. After informing the front desk, I was simply told to 'take a seat.' I assumed everything was in order, but after waiting for 40 minutes, I checked again—only to find out that my registration was never processed.\n\nThe first staff member who initially attended to me was more focused on chatting with a colleague than ensuring proper registration. This oversight caused an unnecessary delay and wasted my time. Thankfully, another staff member quickly assisted me once the mistake was realized, and I received my vaccine within 5 minutes.\n\nWhile I appreciate the efficiency of the second staff member, I’m disappointed by the lack of professionalism from the first. I hope the clinic improves its procedures to ensure patients with appointments don’t face such delays due to staff negligence.",
      "time": 1740488246,
      "translated": false
    },
    {
      "author_name": "Carol Lim",
      "author_url": "https://www.google.com/maps/contrib/112061362497690646485/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK2oEzjgkcSMi_SDkPAFWnA0zYHGinlccyrqJrynDUe3vlNtZs=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "I have had mixed experiences with this clinic. In times of urgency, we have sought their care, but after several visits, I find myself hesitant to return. Recently, I called the clinic to clarify a matter that I was frustrated with myself about.\n\nI took my six-year-old child to the clinic, hoping to get clearance from a possible HFMD case, unaware of a single ulcer at the back of his throat. The doctor I saw (I don’t recall his name) explained the possibility of HFMD before examining my child. At that moment, I was ready to leave rather than incur a significant fee unnecessarily. I believe it would have been helpful if the doctor had informed me upfront that as long as symptoms were present, clearance wouldn’t be possible. That way, I could have simply taken my son home to wait it out instead of proceeding with the consultation.\n\nAfter the consultation which went on without a choice since I did not speak up, the doctor asked if I needed any medication, and I declined. At the nurse's counter, I was asked again, but it was not explained that declining medication would result in a minimum charge of $10. Had I known, I could have chosen a medication costing $5 and avoided that extra fee. While the clinic is not obligated to explain this, a simple clarification would have been helpful. In the end, I paid an additional $10 on top of the consultation fee, which totaled $49.50.\n\nI take responsibility for my own decision, but I do feel the doctor could have advised me to wait and return only if symptoms persisted. Clearer communication from both the doctor and the staff would have made for a much better experience.\n\nI have spoken with one of the nurses when I called in few weeks back.",
      "time": 1743561239,
      "translated": false
    },
    {
      "author_name": "junne b",
      "author_url": "https://www.google.com/maps/contrib/115160013289045437675/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWJNCf9apMm1nL3_WqKlCvdFsIpfWsKdPyp8rvPIJJ_dmUq3DedyQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Enrolled into this clinic for my HealthierSG program. Appointment system was efficient and I didn’t have to wait long to do the tests. Follow up for the results was also a very good experience with Dr Tim Hart taking the time to thoroughly explain the program and results to me. Looking forward to continue receiving such amazing support in the long run too. 👍",
      "time": 1743552022,
      "translated": false
    },
    {
      "author_name": "nanazian hashim",
      "author_url": "https://www.google.com/maps/contrib/100611976007210790916/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK7SsMmjVSj-5OBxifcsCsdZaY-YarhUKQXaGkFlf_J-u8j0g=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "My first visit to the clinic. It was such a pleasant experience. Marthius patiently explained to me regarding the blood tests and all. And I decided to take up the Health Screening Package. He did an excellent job during the blood taking. No pain at all.\nDr Tim Hart is so nice, patient and has a sense of humour too! It is so comfortable talking to him during the visit. And all the staff there are friendly and polite too.\nNow I know why all the reviews are good here at this clinic.\nThank you again 😊",
      "time": 1739768867,
      "translated": false
    },
    {
      "author_name": "Cassandra Wong",
      "author_url": "https://www.google.com/maps/contrib/112500270056574229143/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKwPncLSXHWOpdZB4yWzsPfec0ionT8DkzEL8OqUifvhqgrkA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "All the staffs are very friendly and helpful. The doctor was very clear & concise in her explanation. Will give more than 5stars if I could! Keep it up!",
      "time": 1727843785,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8308672770357085204",
  "user_ratings_total": 704,
  "vicinity": "70 Punggol Central, #01-05 Punggol MRT Station Exit D"
}