{
  "formatted_address": "223 Mountbatten Rd, #01-18, Singapore 398008",
  "geometry": {
    "location": {
      "lat": 1.308316,
      "lng": 103.8790715
    },
    "viewport": {
      "northeast": {
        "lat": 1.309643680291502,
        "lng": 103.8804534302915
      },
      "southwest": {
        "lat": 1.306945719708498,
        "lng": 103.8777554697085
      }
    }
  },
  "name": "EtonHouse Pre-School Mountbatten 223",
  "place_id": "ChIJy84e_jcY2jER-XZZ2ZIypns",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Jancy Segaran",
      "author_url": "https://www.google.com/maps/contrib/100799373572188481979/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUKFZZYdmZqb9Z8yG2HsN_EXg_3q_1P0ql9TNiVEmD8phEZil4-=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "EtonHouse Mountbatten 223 will always have the most special place in my heart. My son will be graduating at the end of this year and as much as he will miss the school, I will most definitely miss it more! From the parent liaison team to the teachers, they’ve all become such a huge part of our days and I like to consider them my little extended family. For 4 years we’ve had teachers listen to our concerns and come up with solutions as a team. We’ve seen our son grow into a confident and articulate little boy, a beautiful sight to see. 🥹 The school has prepped my son emotionally and academically and this will definitely help him enter the local primary school system with no issues. I’ll always be grateful to the team at EtonHouse for creating a holistic environment filled with their love, joy and care.",
      "time": 1729585980,
      "translated": false
    },
    {
      "author_name": "Ujin Ng",
      "author_url": "https://www.google.com/maps/contrib/117938235380246774526/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKNWwUHjGn8luFSzSBGTYX8w1NtreaB2jMmbmvIRQmD1c-cuw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "I cannot recommend 223 Etonhouse highly enough! From the moment we enrolled our child, we have seen tremendous growth in his confidence, social skills, and love for learning. The caring teachers truly go above and beyond, fostering a nurturing environment where each child feels valued and supported.\n\nThe curriculum is thoughtfully designed, balancing play with educational activities that engage the children and spark their curiosity. Our child comes home excited to share what he learned each day, and it’s clear that the staff genuinely cares about each child’s development.\n\nAdditionally, 223 Etonhouse offers incredible value for money. The quality of education and care provided far exceeds our expectations. We feel fortunate to be part of such a wonderful community. Thank you to everyone at 223 Etonhouse for making this such a positive experience for our family!",
      "time": 1729590771,
      "translated": false
    },
    {
      "author_name": "Amrita Prasad",
      "author_url": "https://www.google.com/maps/contrib/100375806848884891358/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLYqYURdWvyCBOIpdRsqQyfvgUUhYtl-NHWrtshI8vN3p9L3w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Eton house 223 is a fantastic pre-school. They have a great Bi-lingual curriculum. The teachers are fantastic and go above and beyond for the children. The principal is very capable and experienced. We had a very good experience at this school and would recommend it without any hesitation.",
      "time": 1642511862,
      "translated": false
    },
    {
      "author_name": "louisachansim",
      "author_url": "https://www.google.com/maps/contrib/113860982830648263690/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJcraQJFpapCOX4fqPDMTeGWIO4V82KaxqNbxMKd7qU_kGDGQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 years ago",
      "text": "Both my gals attended Etonhouse 223 Mountbatten and we love this preschool. The teachers and staff are all friendly and caring and they make sure all the kids are happy and well taken care of. The programs are comprehensive and well rounded and my kids enjoy going to school everyday. I strongly recommend this preschool to any parent who wants to find a nurturing environment for their young kids. It is really one of the best around.",
      "time": 1479314696,
      "translated": false
    },
    {
      "author_name": "Jyoti Adsule",
      "author_url": "https://www.google.com/maps/contrib/118000728869252782959/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWMrtMgBl33528oPrdhq1falAmBYQD3QUmhOaaO5GxJ-2ijvUqT=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 years ago",
      "text": "Year 2010 when we moved to  Singapore, the most important and critical decision for us was about which school to choose as our daughter was not familiar with English language.  when our close family Friend suggested us to look for EtonHouse  school, we were not sure whether this is right school for our Daughter.\n\nWhen we met Miss. Jo, our all worries were gone. she was so friendly and caring.. Now our second child as well enjoying Eton house school since he was 2 years old and Everyday he wants to go the school as he don't want miss his friends and most importantly his Teachers.\n\nWe would like to suggest EtonHouse 223 as the best school for all parent to start their child’s journey in this challenging world.",
      "time": 1480344666,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8909864519092238073",
  "user_ratings_total": 23,
  "vicinity": "223 Mountbatten Road, #01-18"
}