{
  "formatted_address": "261 Waterloo St, #03-09, Singapore 180261",
  "geometry": {
    "location": {
      "lat": 1.2989163,
      "lng": 103.8519697
    },
    "viewport": {
      "northeast": {
        "lat": 1.300429230291502,
        "lng": 103.8533635802915
      },
      "southwest": {
        "lat": 1.297731269708498,
        "lng": 103.8506656197085
      }
    }
  },
  "name": "EV Dance",
  "place_id": "ChIJn3oHraQZ2jERKVlfyj230zg",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Eleanor Rui En",
      "author_url": "https://www.google.com/maps/contrib/105332664503269657183/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVIjkvu1NIF3KnB300fbn3M55HnW4x5DvrtL2CCb_T27DIeYDyW=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "After leaving the my honest thoughts here, I received a message from one of the staff and was offered a complimentary class, on top of the one I already paid for.\n\nThe studio was apologetic for the service and acknowledged that they would improve on their processes for last minute class cancellations, so future students would not have to make wasted trips :) The studio also extended the expiry of the complimentary class, so I had more time to come for a class despite my busy schedule.\n\nFew weeks later, I eventually attended a New Jack Swing class, by Jin Wen and thoroughly enjoyed myself! It was a small class, but the environment was inviting and welcoming. It was easy for someone who hasn't danced in awhile, to feel comfortable and to enjoy the class!\n\nThank you EV Dance!",
      "time": 1697639554,
      "translated": false
    },
    {
      "author_name": "Daniel Goh",
      "author_url": "https://www.google.com/maps/contrib/107018637654258023143/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKDYkER4QmyD8UNOsrj00lc88m2XQonXno1rWKgXdYqXV6tCg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "fun classes, friendly instructors and staff, do come!!",
      "time": 1704977486,
      "translated": false
    },
    {
      "author_name": "Namra Bano",
      "author_url": "https://www.google.com/maps/contrib/114610802507888661080/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW-NVUSGgQNlRoVY2MyUHaQv-OJcsZlgLDPCCfGm_-D9vU3XjGAdA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I got timber hip hop ABC with Astrid and it was amazing. She really broke down the basics into bite sized information and it was easy to follow along.",
      "time": 1704524812,
      "translated": false
    },
    {
      "author_name": "dancewithelly",
      "author_url": "https://www.google.com/maps/contrib/108584913664439262072/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVTMTlYGZvj1iSaZQ0P3a89F0EinqnyPsxo1zLRNxTYwmDLm0B2=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Here to share my honest feedback. To my fellow first timers out there - please read!\n\nI registered for a class last night and made full payment for it on the MINDBODY app. After work today, I travelled down, took 2 buses to locate the studio, only to find out that the class is cancelled as the trainer is overseas. When asked why it was not told to the students who had registered, the staff said they had updated their Instagram highlights just 4 hours ago, about the cancellation. When asked why they did not personally inform the students (either via text or a call, or an email) the studio replied saying that their usual process is to just update via Instagram. When asked if there’s a replacement class, the studio said that the next earliest class is at 930pm.. and that the 830pm class is also cancelled. At this point, the disappointment was just too much, there was no way I was gonna wait for 2 hours. When asked why the cancellation was not reflected on the MINDBODY app, they had no response to that.\n\nIt was very disappointing to hear that although the studio had all the details of its students - name, contact, and whether payment was made, there was no thought as to inform them about the cancellation so a wasted trip could have been avoided. And it’s even more upsetting to hear about the assumption that every student would check the Instagram for updates. What if we were stuck at work and had no access to our social media?\n\nMay I suggest to the studio that if a class were to be cancelled at the last minute (on the day itself) and could not find a replacement, that the studio should have the basic courtesy to inform students who have already registered and made payment. I think the bare minimum would be to drop a text since they have access to our contact numbers.\n\nI also wondered why I paid $16 via MINDBODY when the Instagram post stated 15 for an open class for first timers. The staff mentioned that there is a $1 platform service fee if we register via MINDBODY. This was also very upsetting as I was not informed of the extra dollar I had to pay if I registered online. There was also no clear specification on their Instagram post that $15 would be for walk-ins only, payment at the counter.. wordings used on social media would portray different meanings. It would have been great if this information was clear and told to students openly, so they can then make the decision to pay the $1 or not.\n\nso now, not only did I make a wasted trip, I also paid extra for a class I could not attend. Though it’s just a dollar, money is money ):\n\nInitially, I was very excited to attend the class and heard many good reviews about the studio. In my own journey as a dancer, I had not attended a hip hop class in ages and was really looking forward to it. Though I appreciate the staff who was patient in answering my questions, I implore the studio to develop their customer service recovery when such situations occur, and relook the admin processes when it comes to last minute cancellation of classes. Really hope that these matters can be looked into for the betterment of the studio.\n\nYours truly,\nSomeone who was really excited for New Jack Swing 💃🏻",
      "time": 1694090461,
      "translated": false
    },
    {
      "author_name": "Michelle Cheow",
      "author_url": "https://www.google.com/maps/contrib/111276523500687151287/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJVY8szH14w7b-dLgoaoNSYiokfxUhN3eYTyIODEzipUVDwKQTS=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "The instructors are very patient and classes are fun and easy to follow even for beginners. Love that they also have a wide selection of classes to choose from, from kids to adult classes. Two thumbs up 👍🏻👍🏻",
      "time": 1615688401,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4094817962226047273",
  "user_ratings_total": 71,
  "vicinity": "261 Waterloo Street, #03-09"
}