{
  "formatted_address": "290 Orchard Road, Paragon Tower 1, #16-09/10 Lobby F, Singapore 238859",
  "geometry": {
    "location": {
      "lat": 1.3039054,
      "lng": 103.8355763
    },
    "viewport": {
      "northeast": {
        "lat": 1.305301030291502,
        "lng": 103.8373395302915
      },
      "southwest": {
        "lat": 1.302603069708498,
        "lng": 103.8346415697085
      }
    }
  },
  "name": "Executive Health Screeners - Minmed Health Screeners",
  "place_id": "ChIJicxby5MZ2jERGObYfXEX6mY",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "Foo Piao Ting",
      "author_url": "https://www.google.com/maps/contrib/100295168455774254734/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKyXu8aSeweISGbr3O9c93JDfyhGOZnmw_EB5zQHo9l3F_HjQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "This was my first time at this clinic, and I was truly impressed. The staff was professional, friendly, and incredibly helpful. They made me feel welcome and well cared for. Thank you for your kindness and excellent service!\"\n\nSpecial thanks to Amanda from the treadmill section that look after me during the whole session.  (My first time doing)\n\nNot forgetting, Dr Clara Huang (I hope I get her name right).  A caring doctor who gave many good advice.",
      "time": 1742553887,
      "translated": false
    },
    {
      "author_name": "W Lu",
      "author_url": "https://www.google.com/maps/contrib/117080365730703755454/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI2F5fqOLn77wY6yclmPF39GvEar1c0CRFmN3bGU87l2S6NVw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Communication was a nightmare. I had a question relating to health screening the day before, there's no number to call in. All they directed and redirected me was the Whatsapp number that was redundant in terms of providing timely response to enquiries. Whats the point if no human can be around to attend the enquiry??\n\nThen during the post screening virtual review, I waited for a full half an hour before the call ended abruptly (wasted my time). And I raised the matter and provided context to the Whatsapp contact, only to be asked by the bot chat for more info (when I have *already* provided). It's a very frustrating kind of communication considering this is health screening related, shouldn't there be more human touch for better respect of the customers?\n\nAnd today the virtual post screening consultation took a grand total of less than 2 min, with the doctor seemingly rushed. I went thru the same report with my own GP and it was soo much more informative and detailed.\n\nAll in all, my experience with minmed at this latest round of health screening (pre and post) has been bad. I will rethink about whether I wanna go to them again in my subsequent screening. My own experience is they're very much corporatised such that the human touch is severely compromised. This was clearly not the case a few years back, and it's unfortunate it slid.",
      "time": 1743062776,
      "translated": false
    },
    {
      "author_name": "Hooj Hooj",
      "author_url": "https://www.google.com/maps/contrib/110968312552100824853/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU5T1zDbzcr2NtJguDB3fAHgFKBbntdOea27M7Q79eBkLSPk_k=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "I tried to reach Minmed to get back my vac receipt but there is no possible way to reach them. I have tried their online chat service , WhatsApp and  they both used robot to reply the same generic message with no real solution.. On top of that, no one actually will pick up their branch phone despite the numbers were published on their official website. I tried to call them more than 10 times but no one answer. So instead had to travel all the way to the branch again and ask for this document. The reception reminded me that actually they will only pick up calls in the afternoon but actually even afternoon no one picked up. She suggested me to use WhatsApp and I said I did but no reply then she recommended me to use email. Unbelievable.",
      "time": 1733973765,
      "translated": false
    },
    {
      "author_name": "Wee Teng Dawn Chan",
      "author_url": "https://www.google.com/maps/contrib/101372502699392984393/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXAjB3OHbcGiP-GH3DJ_BBkg6MBpZ_VcWkBsVIXyha09dhcblRd=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "This is the first time I went to Minmed Paragon. 1st time doing Mammogram.\n\nI was very impressed with the service by the Radiologist, Khine. She explained the process and asked me not to be afraid. I was very comfortable with her. The whole experience was smooth and no pain or discomfort. I will like to thank her for the gentle and reassurance conversation she shared, making me at ease and my 1st Mammogram have a good experience. Thank you Khine.\n\nI will like to recommend this Mimed Paragon clinic if doing Mammogram.  Counter staff is polite and professional. Thank you.",
      "time": 1743229438,
      "translated": false
    },
    {
      "author_name": "joy ng",
      "author_url": "https://www.google.com/maps/contrib/108224344630851049181/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXfH5nhbiSIG9_ajkY_yceCQJ3LUgkLjzxzaGduCcFobo5Z-qhc=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "4 weeks ago",
      "text": "By all means, do your health screening here.\n\nBut do not do any follow up doctor consultation here. You cannot reach the clinic by phone at all.\n\nI have an allergy to the medication that I obtained from the teleconsultation service (post health screening) and I needed medical advice to continue/to change therapy /to stop and I cannot find means to contact the clinic at all.\n\nEnded up using the app to consult via another round of teleconsultation, but the doctor wasn't useful. It's just assigning you to another GP on duty. There's no continuity in follow-up. Do yourself a favor - go to a proper clinic.",
      "time": 1745323704,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7415765512629052952",
  "user_ratings_total": 695,
  "vicinity": "290 Orchard Road, Paragon Tower 1, #16-09/10 Lobby F"
}