{
  "formatted_address": "425 Race Course Rd, MacBie Chocolate Cafe, Singapore 218671",
  "geometry": {
    "location": {
      "lat": 1.3158247,
      "lng": 103.8576004
    },
    "viewport": {
      "northeast": {
        "lat": 1.317140080291502,
        "lng": 103.8589846302915
      },
      "southwest": {
        "lat": 1.314442119708498,
        "lng": 103.8562866697085
      }
    }
  },
  "name": "Exquisite Art",
  "place_id": "ChIJ0XpsOQkZ2jERUpUY31Rxugw",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Cvetelina Dragieva",
      "author_url": "https://www.google.com/maps/contrib/117458063659504049173/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI8-FNNqQoKelaEY1ACp_-E41GLdFHTKSEWcl7YlPmATMRzpg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I had the pleasure of attending an art fair that truly embodied the essence of 'Exquisite Art'. The fair was a vibrant celebration of contemporary art, showcasing an impressive array of oil and acrylic paintings on canvas that spoke volumes of the artists' mastery.\n\nEach artwork displayed was a masterpiece in its own right, transcending from mere visual appeal to a profound emotional experience. The fair featured an eclectic mix of styles, ranging from the intricate details of still life and landscape to the bold strokes of abstract art and figurative genres. It was a testament to the diversity and dynamism of the art world.\n\nArtists and painters from various backgrounds brought their finest canvas paintings, turning the event into a bustling hub for art collectors and lovers alike. The fair was not just an exhibition; it was a marketplace alive with paintings for sale, perfect for those looking to add a touch of home painting elegance or seeking unique wall art in Singapore.\n\nThe sale art gallery sections were particularly intriguing, offering original paintings that promised to be a valuable addition to any art decor. For those who couldn't attend in person, the art for sale online and painting online purchase options were a boon, allowing art enthusiasts to order art online from the comfort of their homes.",
      "time": 1705796432,
      "translated": false
    },
    {
      "author_name": "Diana Kuleshova",
      "author_url": "https://www.google.com/maps/contrib/113349809167400145830/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWMw3GPDrbRL15cEBqY2Gb9uIOwwT0xE7Z77XT5aTQqhLoZxHLC=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Visiting a unique chocolate and coffee shop exhibition, I was captivated by the exquisite fusion of Still Life and Abstract Art. Each painting, masterfully executed in oil or acrylic on canvas, stood as a contemporary masterpiece, inviting viewers into a realm where taste and visual art intertwine. The collection showcased a brilliant range of emotions and narratives, appealing to art lovers and collectors alike. This exhibition not only offered original artwork for sale but also bridged the physical and digital realms through an online exhibition and virtual gallery. It was a celebration of creativity, showcasing emerging artists and offering a vibrant platform for art enthusiasts to explore and invest in art. A truly immersive experience for anyone passionate about the evolving art market.",
      "time": 1711114666,
      "translated": false
    },
    {
      "author_name": "Aarti Bartake Artist",
      "author_url": "https://www.google.com/maps/contrib/115389182683151417409/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV5lz1g6yN28iNC0lb_fMf5I2_zSEFiv7kCl_GnPA4HAu4RHOYQ9Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Dear Livette,\n\nJust wanted to drop in a quick note to express my gratitude for the features and promotions on various platforms through ‘Exquisite Art’ Gallery.\nI truly appreciate all your efforts and hope that these bring in more buyers: art lovers and collectors.\n\nBest regards,\nAarti",
      "time": 1715928812,
      "translated": false
    },
    {
      "author_name": "Andrew Micos",
      "author_url": "https://www.google.com/maps/contrib/100683546659361807037/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJc3BL6sBSs8RN-8dkrswE2FBBW7iWh9Qc_Vqh103wV_ZIBeA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "Livette & Exquisite Art are a highly recommended Art dealer with a view to assist in all matters to the choice of Art right thru to the delivery and assistance with Customs clearances. Im out to search for another classic work to display at home soon.",
      "time": 1583396470,
      "translated": false
    },
    {
      "author_name": "Mike Cecil",
      "author_url": "https://www.google.com/maps/contrib/110101130786627024614/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVNfi1HcPw_VmItqLcZtbQPW6YlnB_Gz2qCJXDxY8iJeQ-ZGGBl=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Tried buying a printer and have not received it nor can I get a reply to my email. I'm guessing it's a scam. Only good thing is that it wasn't a lot of money and I'll get it back from my bank.",
      "time": 1709757150,
      "translated": false
    }
  ],
  "types": [
    "art_gallery",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=917170083457439058",
  "user_ratings_total": 7,
  "vicinity": "425 Race Course Road, MacBie Chocolate Cafe"
}