{
  "formatted_address": "Blk 261 Waterloo St, Singapore 180261",
  "geometry": {
    "location": {
      "lat": 1.2988862,
      "lng": 103.851788
    },
    "viewport": {
      "northeast": {
        "lat": 1.300470130291502,
        "lng": 103.8532456302915
      },
      "southwest": {
        "lat": 1.297772169708498,
        "lng": 103.8505476697085
      }
    }
  },
  "name": "ExtraOrdinary Horizons (Deaf Singapore)",
  "place_id": "ChIJwRtlspEZ2jERsg5md82qvV4",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Edmund Tee",
      "author_url": "https://www.google.com/maps/contrib/113572001375111093717/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVzGUouUt-L25Dlg5VbA2EWHEEMRpcsnjsnhSxImyamg_q9IoGOMw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 years ago",
      "text": "I have attended  SGSL Level 1 by EOH. Have been very impressed by the dedication of the Trainers  and benefited from the teaching by Lily Goh. It gives me a much in-depth understanding of the deaf community in Singapore. Everyone deserves a chance to excel so are the deaf! Sign language is beautiful! Everyone should pickup basic sign language whenever possible! Come and experience the wonderful inter personal communication with the deaf! It is definitely a knowledge to learn for everyone!",
      "time": 1543949039,
      "translated": false
    },
    {
      "author_name": "Mimi Cheong",
      "author_url": "https://www.google.com/maps/contrib/117495416902239737845/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVndveoK4eBQzEXwrOJdzFF7kvglFYu0mDPJ5vf7rCAm5ID71_k=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 years ago",
      "text": "I attended and completed the Basic Singapore Sign Language (SgSL) course with ExtraOrdinary Horizons. The course was very well conducted. The curriculum was well planned and the lessons were conducted very systematically at a pace that was most conducive for optimum learning. The lessons were conducted in an informal and enjoyable manner. Ample opportunities were provided for interaction between teacher and students, as well as among the students themselves. All of us students were strongly encouraged to participate actively during each lesson and the teachers were very patient in ensuring that everyone understood what was being taught. The pace of each lesson was set to ensure that even the “slower” learners could follow, but the “faster” learners were not held back because we were given opportunities to pick up extra-curricular knowledge that related to communicating with the Deaf. The teachers also regularly bring to our attention events in which we could participate such that we could mingle with the Deaf and practise what we learn in class. We were introduced to resources that we could gain access to if we were interested in learning more about Sign Language and about communicating with the Deaf. The lessons at EOH were so interesting that it kept me wanting to go back for more. I am definitely going to proceed with the next level of learning! I would certainly recommend this SgSL course to all my friends who are interested in befriending the Deaf.",
      "time": 1543931277,
      "translated": false
    },
    {
      "author_name": "Eileen Chee",
      "author_url": "https://www.google.com/maps/contrib/118153492104766648690/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIwVPDKzD1fOXooXuh_PYVWnUNWnJ_kLxbmbgKg6VRcRvDOIA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 years ago",
      "text": "This is THE place to learn #SGSL. Committed, passionate and patient teachers who make the lessons enjoyable.  Organised and structured curriculum as well.",
      "time": 1544541052,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6826800409611734706",
  "user_ratings_total": 3,
  "vicinity": "Blk 261 Waterloo Street"
}