{
  "formatted_address": "105 Sims Ave, Singapore 387429",
  "geometry": {
    "location": {
      "lat": 1.314553,
      "lng": 103.8772366
    },
    "viewport": {
      "northeast": {
        "lat": 1.315822730291502,
        "lng": 103.8786110802915
      },
      "southwest": {
        "lat": 1.313124769708498,
        "lng": 103.8759131197085
      }
    }
  },
  "name": "EZBBQ",
  "place_id": "ChIJFedyODsY2jERw21ZbLgcMdk",
  "rating": 3.4,
  "reviews": [
    {
      "author_name": "Jay Leong",
      "author_url": "https://www.google.com/maps/contrib/106565940963938471151/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKc4ygluJhWo_qhCHnA8OX7aiTtuhxF-Q2JQMA-6jvy2jKLIA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I was looking for a BbQ company for my company event and I chanced upon EzqBBQ on the internet as I like their professional setup and decided to give it a try. The price was reasonable with serving of lamb, beef and squid, etc. Communication was easy via WhatsApp with Ann and she answered all my answers and revising my quotations patiently as I kept making changes even until the day before the event.\n\nThe BBQ team Rina, Simon and Ah Thang arrived on time that day and helped with the setup and BbQ nicely. I was surprised they actually used charcoal to BBQ. They also helped to top up the food, updating me the food status. I was very worried about the food portion initially and luckily the portion was just nice with a bit leftover.\n\nGuests commented that the food were nice especially the otah burger, Cajun chicken and roast beef. I will definitely book with them again!",
      "time": 1745053464,
      "translated": false
    },
    {
      "author_name": "Joanne Ng",
      "author_url": "https://www.google.com/maps/contrib/109188416999069892375/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIPeE9lKqrqg-p5vAgr8dOWG3WEJX4UHm3vr7181uxSnlRvOA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "We recently hired a live grill BBQ catering service, and it exceeded all our expectations! The meat, satay, and prawns were grilled to perfection – tender, juicy, and bursting with flavor. Each bite was absolutely delicious, and the satay had just the right balance of seasoning and tenderness. The prawns were fresh and perfectly char-grilled, making them a crowd favorite.\n\nThe setup was equally impressive. The team created a visually stunning arrangement that added a touch of elegance to the event, making it feel special and well-organized. Their professionalism and attention to detail really shone through, from the beautifully arranged food stations to the seamless service throughout the night.\n\nIf you're looking for top-quality BBQ catering with both amazing food and a beautiful presentation, I highly recommend this service. It made our event truly memorable! Thank you chef Berlinda!",
      "time": 1725808587,
      "translated": false
    },
    {
      "author_name": "CarlnJan Tay",
      "author_url": "https://www.google.com/maps/contrib/106503555305869455268/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWFhOgCIqulVqcQbRB_OSfs3rz4NR4nv3m6N5_ENvjgrjzp2oGloA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "We recently hired the bbq services of Ezy BBQ and I must say that the whole family enjoyed the experience of their chef, Pamela who cooked the food for us. The food was absolutely delicious and more than enough for us all. Will definitely hire them again in future!!!",
      "time": 1726803164,
      "translated": false
    },
    {
      "author_name": "JTCS90",
      "author_url": "https://www.google.com/maps/contrib/109919944880337854320/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKTSg7lPwS5N8SRQWEDmfuXM4WKdXQdRIW8btsDdWWccA73pA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "This is my second time using EZBBQ but this will be the last time I’m using them. I have made an order for bbq frozen and cooked food via their online webpage. All was good until the event day itself when they failed to turn up at the scheduled 5-6pm slot.\n\nI only received a text at 5.43pm informing me that they will be late. I regret not being stern to them and their customer service officer really just take me as a pushover. I am booking for a party of 20pax and ezbbq had me lose my trust becos I convey the same message to my group of invitees. The text convo shows everything except that the truck that came is their sub worker who refuse to comment anything when I was about the cooked food still being warm and how long time I need to consume the food.\n\nI had to order grab for my guests and the food that came was just left to be thrown because the guests already left to get other food. This is really disappointing how they handle this situation. I rather they be upfront and tell me a firm timing, so I could order more grab food in advance and give me a discount for being late.\n\nI also asked if I could cancelled the food after I have been fooled for the 3rd time. They didn’t reply.\n\nOverall even though the food was delivered and look relatively fresh and chilled. I wouldn’t dare to consume them if there was any problem arising and led to food poisoning. I doubt they will do anything about it as well. It has been 4 days after their customer service say they will investigate. But I have not received any updates.\n\nTo the others who are still keen to order with them. You may want to prepare of your own food or set extra 2hrs buffer time if they come late. I regret not looking into their Google reviews eariler and they happened to have similar problems with delivery issues. Especially during peak hour timing which they could have blocked out this timing when the delivery team schedule is full.",
      "time": 1730624355,
      "translated": false
    },
    {
      "author_name": "WY M",
      "author_url": "https://www.google.com/maps/contrib/111936739394179195380/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK-2SfecKrknVg5goMtqcHuEIl0vnZaAQzICWwoIhb0Aj4mIA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 3,
      "relative_time_description": "2 months ago",
      "text": "Honestly the food quality was pretty good. I found the satay and the chicken wings really tasty. The sambal sotong and stingray were average.\n\nAs the other reviews have stated regarding the unreliability of the delivery time, please order for the delivery at least 2-3 hours from your BBQ start time because the delivery person will definitely be close to an hour late. Also the meat comes frozen so you'll need some time for it to defrost.",
      "time": 1741969035,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15650321758506544579",
  "user_ratings_total": 78,
  "vicinity": "105 Sims Avenue"
}