{
  "formatted_address": "61 Changi South Ave 1, Singapore 486000",
  "geometry": {
    "location": {
      "lat": 1.3415804,
      "lng": 103.9648889
    },
    "viewport": {
      "northeast": {
        "lat": 1.343073830291502,
        "lng": 103.9660844302915
      },
      "southwest": {
        "lat": 1.340375869708498,
        "lng": 103.9633864697085
      }
    }
  },
  "name": "F17 Football Academy",
  "place_id": "ChIJlf54ihU92jERIQTNl-Fn4g4",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Dezhan Pi",
      "author_url": "https://www.google.com/maps/contrib/109542914329871959622/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVELvFhVPvZq_pEhBgZA0NjNIGp0iOjRpVP2Im9tfBMxo5cUdOdBA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "My son has been with F17 learning football for more than 4 years and I must say, it has been an amazing experience for both him and for me as a parent. The coaches are highly experienced and knowledgeable, and they have a great passion for the sport, which they transfer to the kids in a positive and engaging way.\n\nThe training sessions are well structured, and my son has been able to improve his skills greatly, while also having fun and making new friends. The academy also places a strong emphasis on teamwork, sportsmanship and respect, which are important values that will stay with the children for life.\n\nThe facilities are top-notch and provide a safe and supportive environment for the kids to develop their skills. The staff is friendly and always available to help with any concerns or questions.\n\nI highly recommend this academy to any parent looking for a quality football experience for their children. The positive impact it has had on my son's development and love for the sport is immeasurable. Thank you to the team at the academy for all that you do!",
      "time": 1676100644,
      "translated": false
    },
    {
      "author_name": "kamran siddiqui",
      "author_url": "https://www.google.com/maps/contrib/108649610530048247613/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIomyn3TSDXu8cOOHJQYxYCbVlf18zJMQ4AcBTs1MBcIc-9tQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "We enrolled our 4 year old son a year back in F-17 football academy. The intention was to introduce an outdoor sport for him and utilize is extra energy for something productive (he is too energetic and tires us down :) ) .\nHe is bit reserved and takes time to open-up, therefore, it took him sometime to adjust. We informed coaches about it, who were extremely considerate and caring towards him. His favorite is Coach Jaish who employs these unique games with football which kids enjoy a lot. I am regularly at the stadium with my son and pleased to see coaches talking with kids about life lessons like working as a group, being truthful and not lying, enjoyment is more important than winning/losing etc which my son remembers and repeats.\nAlong with physical activity in form of football, F17 provides an excellent atmosphere for kids to grow confident, make new friends, and enjoy companies of others outside their comfort one.\nThese are real life skills taught by F17 staff and we can't be more thankful for playing their part in helping us raising our 'playful son' ♥️♥️",
      "time": 1676285008,
      "translated": false
    },
    {
      "author_name": "Mark Khng",
      "author_url": "https://www.google.com/maps/contrib/112066773325430679973/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUezS68q4paXPQqZLm0MRp1n_0YXUKEB_Y5kXV8DWPZ-pEW-zww=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Our sons have been attending F17 sessions for a couple of years now and they've always enjoyed the training.\n\nThe coaches and staff are dedicated and even during the pandemic, managed to arrange for engaging lessons over video calls.\n\nHighly recommend anyone looking to get your children started on football to check our F17 academy.",
      "time": 1676251116,
      "translated": false
    },
    {
      "author_name": "Akanksha khanna",
      "author_url": "https://www.google.com/maps/contrib/112046242253642522263/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKYHHSt0BRaMLz62ErZWeTTHdRyIzhdFjLc5E8XZao-_1vyew=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "We recently enrolled our son in F17 football coaching program and it has been a fantastic experience for him so far. The coaches are knowledgeable and experienced, and they have been able to effectively communicate their passion for the sport to the kids. Our son has already learned so much about the game and has improved his skills dramatically in just a short amount of time.\n\nThe coaching sessions are well structured and provide a good balance between individual and team drills. The coaches are patient and encouraging, and they take the time to work with each player individually to help them reach their full potential. The training environment is positive and supportive, and our son loves going to each session and learning from the coaches.\n\nOverall, we are incredibly impressed with the football coaching program and would highly recommend it to any parent looking to improve their child's skills. Our son is having a great time and we can see the positive impact it is having on his development as a player. Thank you to the coaches for their hard work and dedication!",
      "time": 1676105188,
      "translated": false
    },
    {
      "author_name": "Princess Shah",
      "author_url": "https://www.google.com/maps/contrib/111518677742616336021/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK_I1bp4scrxIF3H6jjtLdN0IfaseyVzAdVN-ly5U2dX5OPHg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Knowledgeable coaches for e boys. Strangers turn to friends for boys as well as parents. Learn as we go and thats e best route in life. Kudos to F17!",
      "time": 1676181471,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1072533879879697441",
  "user_ratings_total": 29,
  "vicinity": "61 Changi South Avenue 1"
}