{
  "formatted_address": "29B Chai Chee Ave, #01-62 Ansar Garden, Singapore 462029",
  "geometry": {
    "location": {
      "lat": 1.3243079,
      "lng": 103.9237795
    },
    "viewport": {
      "northeast": {
        "lat": 1.325744680291502,
        "lng": 103.9249663802915
      },
      "southwest": {
        "lat": 1.323046719708498,
        "lng": 103.9222684197085
      }
    }
  },
  "name": "FairPrice Chai Chee Avenue",
  "place_id": "ChIJ8aSMC60i2jERLtNlU4lxnO8",
  "rating": 3.9,
  "reviews": [
    {
      "author_name": "Rasidah Abdul Rahman",
      "author_url": "https://www.google.com/maps/contrib/115391063767414793801/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJwIaBhMsE1lh2CZYkwHcUwcAQsT2Zs1cVm68oSXrz9F5A0bQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "It's Hari Raya festive,  it's nice to listen to the Hari Raya music to soak up the festive atmosphere. I have observed for several years that this branch turn on the Hari Raya music at a very low volume. It's either you turn up the volume of the Hari Raya music so that it is audible to your Muslim shoppers or you don't turn on the music at all. I noticed other fair price branches turn up the volume but not at this branch. While , Christmas and Lunar New Year you turn up the volume very high. Does the person in charge of the store in Chai Chee has issues with Muslim shoppers !!??",
      "time": 1743577859,
      "translated": false
    },
    {
      "author_name": "Peter Hee",
      "author_url": "https://www.google.com/maps/contrib/106880466878330377798/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIYAMdD1fWSvxclwPOGCWDhNGtQIfGnyYPPCXxYQvOBT51TiQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "My wife ordered a pork ribs / pork knuckle to add to our growing dishes of good for Christmas lunch.\nWhen my wife collected the food at 1158 hrs ( 25 Dec 2024) there was only the miniscule pork ribs.. Pork knuckle was nowhere to be found.\nThe store manager, a lady by the name of Xiao Ling, was quick to remedy the situation by asking us to collect the ribs first and she undertook to ensure we get our pork knuckles.\nWe left NTUC Fairprice Chai Chee just with the ribs based on her berbsl assurance. Of course I was sceptical\nAt 1335 hrs, Xiao Ling was at our door, hand delivering the pork knuckle ( still warm) to us.\nWe found out that she had gone to the NTUC at Bedok Mall, signed for the pork knuckle there and delivered it to us. All this while relying on leg muscles and public bus service.\nNow NTUC,  with such staff, do remember their G. E. M for irate customers, excellent customer service and with a smile on her face all the while.\nThis Xiao Ling deserved more than a \" good job\" done..",
      "time": 1735105565,
      "translated": false
    },
    {
      "author_name": "Chris Lo",
      "author_url": "https://www.google.com/maps/contrib/108805639630248684316/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJpGGW24mTcVPjzfDjxQwOdIGIKldA1n4H1CPZi5-ownOT2kQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "2 years ago",
      "text": "The Ntuc  lightbox lightnings out for weeks. Need to rectify asap. At blk 29b chai chee road. Thank you for prompt action.\n\nRenovation will commence in sep 2022for 1 month. To enhance a shopping experience with new ambience n new products n bigger store. Good for neighbourhood shopping. Good to have a 4D booth to cater the needs of community.\n\nWith reopening of restoration n renovation to give better image, convenient and ambience shopping experience with many discounted items. Offers n promotional items  will hence increased the sales  during the great opening  n offers\n\nMany residents are looking forward for new product range and diversity.\nPork and fish counter  and polar puff and cake will draw many customers from all walks of life.\n\nA great effort in giving back  to community with new refresh look.\nAll the best to NTUC. Caring for the community.! Hence keeping price low at all times.",
      "time": 1664091607,
      "translated": false
    },
    {
      "author_name": "George W (Oreo the Cat)",
      "author_url": "https://www.google.com/maps/contrib/113159097227833060752/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWDnk0FMtnxL8-GszGNHY0ZM8Xk5j3S7QDJH2Z2m8WUH-MZrU2R=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "More often than not, the Meiji Plain Crackers that I buy from NTUC Fairprice Chai Chee are in pieces. I think it must be caused by rough handling of the products in transit or in the store. See photos attached. Almost all the packages are like this. Your staff must be made aware to handle such products with extra care. The next time I see the crackers in pieces when I open it, will Fairprice offer to replace my purchase with a new box of crackers?",
      "time": 1664463700,
      "translated": false
    },
    {
      "author_name": "Lindy",
      "author_url": "https://www.google.com/maps/contrib/115017034813668394269/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocINf51Ndq0E2izj2SyUyznG0kEnH4Rxmi81uVTmyErYQTdrxA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "7 months ago",
      "text": "This FairPrice has rats. I’ve seen fat rats running around multiple times but management doesn’t seem bothered. Rats can carry many diseases including hantavirus, leptospirosis, lymphocytic choriomeningitis (LCMV), Tularemia and Salmonella and yet the management allows rats to run along side with our groceries. Can management please engage pest control to terminate the rat problem asap.",
      "time": 1729558445,
      "translated": false
    }
  ],
  "types": [
    "supermarket",
    "grocery_or_supermarket",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17265799906055279406",
  "user_ratings_total": 375,
  "vicinity": "29B Chai Chee Avenue, #01-62 Ansar Garden"
}