{
  "formatted_address": "11 Bidadari Park Drive, Mall, B1-32/33 The Woodleigh, Singapore 367803",
  "geometry": {
    "location": {
      "lat": 1.3384655,
      "lng": 103.8716089
    },
    "viewport": {
      "northeast": {
        "lat": 1.339577130291502,
        "lng": 103.8729485802915
      },
      "southwest": {
        "lat": 1.336879169708498,
        "lng": 103.8702506197085
      }
    }
  },
  "name": "FairPrice Finest The Woodleigh Mall",
  "place_id": "ChIJ14X4KGwX2jERE6qkZNS2JlY",
  "rating": 3.5,
  "reviews": [
    {
      "author_name": "Choon Kit Leong",
      "author_url": "https://www.google.com/maps/contrib/105403566482999279179/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXdifQMpddkPL0EoS6a_1Kk1XxkEaWQ5uSR8DjTsYblngfpnbI=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Love the experiences here. Been here many times but first time attempting to do a review.\n\nLove the huge varieties of each product. Not the same with other NTUC branches. Guess it’s the finest version.\n\nFor example, there is a huge variety of salmon from NZ, Norway and Scotland. For eggs, there is also eggs from various countries, sizes, prices to choose from,\n\nWe bought beef from the cooler shelf as well as at the meat counter as they offer different type of beef.\n\nThe wine and cheese selection is also wide and good enough for me.\n\nThis branch has a number of ways to check out. We particularly like the scan n go facility. Easy to use and can see the total bill as we walked along.\n\nThere is also a kitchen and a kopi place inside this branch. Many residents drink kopi or wines here and with meat purchased and cooked at the same time.\n\nIt’s a pity we aren’t allowed to take photos in side the supermarket.",
      "time": 1743953054,
      "translated": false
    },
    {
      "author_name": "Zuriel Mamba",
      "author_url": "https://www.google.com/maps/contrib/100097027827819745483/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXjjbnbgtrpHKDsQ_m9uOBbcQW6_NM5DrNtFVcH68Q8o1UewEnX=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 3,
      "relative_time_description": "6 months ago",
      "text": "Our first time dining here in the finest. We had a difficult time searching for seats, fortunately for us, a couple shared one of their tables with us. It was defo a kind gesture & we appreciated 🙏🏻\n\nThere were vast varieties of ingredients that we can choose  & cook for us. We got steak, prawns & fish for the meal. If I remembered correctly, there were 3, 4 cooking methods to choose from. We had the fish fillet grilled with salt... fish was fishy & we didn't enjoyed it. The beef fared better than the fish, very juciy. Our meals came with a portion of Japanese rice, miso soup & salad which resembled bento box. The prawns were decent, perhaps more bit more salt would taste better. The cooking charges are from $8, seafood has a minimum weight of 500g. Corkage is also $8.\n\nIt was a good experience, however to return, I would consider. The costs involved weren't the most ideal, with ingredients not in the optimum quality.",
      "time": 1731985102,
      "translated": false
    },
    {
      "author_name": "Sean Michael Yip",
      "author_url": "https://www.google.com/maps/contrib/104769747929676754847/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUrbd-BHJcfSibvnR-rxv0vaDxJK23DAsmmCtPyXN41md6bg7s=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 2,
      "relative_time_description": "4 months ago",
      "text": "For a supermarket that purports to be the \"Finest\", the selection and availability here is more akin to what you'd find at a small neighborhood mini mart.\n\nDon't be fooled by the occasional luxury item like lobster or a fancy cheese. The vast majority of the shelves are stocked full of low to mid-tier goods and nothing that would be classified as \"finest\" unless they mean the prices they charge compared to other local supermarkets.",
      "time": 1737273213,
      "translated": false
    },
    {
      "author_name": "K Tan",
      "author_url": "https://www.google.com/maps/contrib/105592887493237423833/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXyP7OR0umslMlymV9dCFaY-ZzThVRDhU54qcjXxI66aOxQs_ZNqQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Nice and clean FairPrice Finest at Woodleigh Mall.\nNicely decorated during Festive seasons.\nPretty much can satisfy your grocery needs at a great location above Woodleigh Mrt Station.\n\nAlso like e the affordable drinking corner/bar with corkage fee at the Grocer Bar inside Ntuc finest supermarket.",
      "time": 1736664258,
      "translated": false
    },
    {
      "author_name": "JK Ong",
      "author_url": "https://www.google.com/maps/contrib/111019396032378373784/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWahdG6UCJDeU05PbE1KjmVLFCq9fTQ0XKgpQm92EOZxQvMoCEDmQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Ecstatically pranced my way into the newly opened NTUC FairPrice Finest at The Woodleigh Mall, discovered a place that I don’t mind chilling and window shopping everyday. The place is not huge but it’s big enough such that the variety for key groceries are good. The highlight was the cafe, bar and grill-4-you restaurant within the supermarket. Do note there are limited seating area. The bar drinks are slightly on the higher side, but the experience drinking in a FairPrice is strange yet enjoyable. Yet to try the grilling service, you pick your own seafood and get them to cook for you at a fee. There are pop up stalls occasionally selling all sorts of food, and it’s tasting galore! Very nice place to shop! Thankful to finally have a proper supermarket for our daily grocery shopping in Bidadari :)",
      "time": 1685972730,
      "translated": false
    }
  ],
  "types": [
    "supermarket",
    "grocery_or_supermarket",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6207850159714642451",
  "user_ratings_total": 142,
  "vicinity": "11 Bidadari Park Drive, Mall, B1-32/33 The Woodleigh"
}