{
  "formatted_address": "65 Airport Blvd., B16-029, Basement Changi Airport, Changi Airport Terminal 2 Level, Singapore 819643",
  "geometry": {
    "location": {
      "lat": 1.3566264,
      "lng": 103.9863923
    },
    "viewport": {
      "northeast": {
        "lat": 1.357731380291502,
        "lng": 103.9882809302915
      },
      "southwest": {
        "lat": 1.355033419708498,
        "lng": 103.9855829697085
      }
    }
  },
  "name": "FairPrice Finest Terminal 3",
  "place_id": "ChIJhZRC3Y082jERG0KFHXoTMe8",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Joc Wong",
      "author_url": "https://www.google.com/maps/contrib/107097069422863637474/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKzQuQTFxo082bvnxMvG0b6h8hn9Qt3plPi3-rqGyBqsRsJ29Q=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "The supermarket at basement 2 was recently renovated. Finally there are self check-out kiosks available, though it's still crowded at times. I love the new section next to the kopitiam which has the flavours of Singapore because tourists may want to buy uniquely local produce instead of looking all over the store for them. Great idea.",
      "time": 1731219029,
      "translated": false
    },
    {
      "author_name": "Kamal Indika Nanayakkara",
      "author_url": "https://www.google.com/maps/contrib/109967720850402274429/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUk7ACzlu4dk9OIChzxEgvqGZEfL0wuVKzXmgdfcJTbMp6BWkIxDQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "FairPrice Finest at Terminal 3, Changi Airport is one of the most convenient and well-stocked supermarkets you’ll find in Singapore, especially within an airport setting. Whether you’re arriving, departing, or simply visiting the airport via MRT or bus, this outlet provides an excellent and affordable shopping experience.\n\nHow to get there:\nIf you’re arriving at Terminal 3 (Arrival Hall), simply follow the signs to the public area after immigration and customs clearance. FairPrice Finest is located at Basement 2 (B2) of Terminal 3. Use the escalator or lift near the Arrival Hall to go down.\n\nIf you’re departing from Terminal 3, you can visit FairPrice before checking in, as it’s in the public (landside) zone, not restricted to ticketed passengers.\n\nFor those arriving by MRT, take the East-West (Green) Line and alight at Changi Airport MRT Station (CG2). Walk through the link bridge to Terminal 3 and head down to B2.\nIf you’re coming by bus, alight at Terminal 3 Bus Stop (95109). Enter through the main doors, and follow the signs down to B2.\n\nThe store itself is clean, spacious, and extremely well-organized. It stocks a wide variety of groceries, including fresh fruits, vegetables, ready-to-eat meals, beverages, snacks, international foods, baby products, household goods, and toiletries. It also carries many local Singaporean products, perfect for tourists or residents.\n\nWhat’s really impressive is that the prices are the same as other FairPrice Finest outlets in the city—no airport markup! This is especially useful for travelers wanting to pick up essentials before or after a flight.\n\nThe staff are friendly, checkout is smooth, and the location is extremely accessible. It’s open daily and ideal for last-minute shopping, travel snacks, or even full grocery runs if you’re staying near Changi.\n\nHighly recommended for both travelers and locals—it’s a hidden gem in the heart of Terminal 3!",
      "time": 1746258641,
      "translated": false
    },
    {
      "author_name": "Dan Ho",
      "author_url": "https://www.google.com/maps/contrib/117612630125288267206/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUpQkixOWRnE6bA9_2palWa4GHWcZ3KbiIk-A3s9yZyQmF8SJ406Q=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "6 years ago",
      "text": "Medium sized supermarket with all your needs at reasonable prices. Popular with airport employees who will do their groceries before heading home. Decent collection of Budget travel related items like luggages and other accessories and Knick knacks. Good place to grab some cheap local souvenirs too.",
      "time": 1558061486,
      "translated": false
    },
    {
      "author_name": "Suzana Mohd saad",
      "author_url": "https://www.google.com/maps/contrib/113335510474707168464/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJhkISlEKYjo0iMIz38lYxUIDzV_iil9SJuOct3PCGTTpxD=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "Really disappointed with NTUC FP. Pls update your branch status in Google promptly. I came from T1, travel to T2 with my big luggage, hoping to get some important stuffs before heading home. When I reach T2 basement, the whole supermarket was closed for renovation. Pls be customers centric in your publication.",
      "time": 1730299199,
      "translated": false
    },
    {
      "author_name": "TAN JING YIH",
      "author_url": "https://www.google.com/maps/contrib/102298594761021704439/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXO8lpCrGQbYwvRvCXM1_5BMJ1TrNr2TxH2zK9T1lGIuSm6I1VV=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Today morning, Vietnam Dragon fruit size very big.",
      "time": 1746964425,
      "translated": false
    }
  ],
  "types": [
    "supermarket",
    "grocery_or_supermarket",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17235578664125809179",
  "user_ratings_total": 59,
  "vicinity": "65 Airport Blvd., B16-029, Basement Changi Airport, Changi Airport Terminal 2 Level"
}