{
  "formatted_address": "476 Upper Serangoon View, #02-18 Hougang Capeview, Singapore 530476",
  "geometry": {
    "location": {
      "lat": 1.3771313,
      "lng": 103.9035866
    },
    "viewport": {
      "northeast": {
        "lat": 1.378402530291502,
        "lng": 103.9048734302915
      },
      "southwest": {
        "lat": 1.375704569708498,
        "lng": 103.9021754697085
      }
    }
  },
  "name": "FairPrice Serangoon View",
  "place_id": "ChIJ4UlPpCQW2jERu2MjnxRPlTU",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "C P",
      "author_url": "https://www.google.com/maps/contrib/104348885255859135653/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWgqmID934xXVVCaaiBwaHmtxzurtdi0LXSg9i3wzFDj3P7RAUgFg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "2 years ago",
      "text": "Only supermarket available in the neighborhood. Fresh vegetables, fruits, breads, frozen items are there most of the time. Usually stocks won't last long time, especially chicken. Less collection of sea food. Lot's of parking available.",
      "time": 1656947491,
      "translated": false
    },
    {
      "author_name": "Kenny Lim",
      "author_url": "https://www.google.com/maps/contrib/107865876508803658380/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL7pFGppALRynq1HhiN90cYKTwgHWDa1OJ6cxWpuWLD3BVgIQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "Hi,\n\nI am going to feedback against one of your staff named Susan Ang. On 10/12/2024, my wife and I went to purchase some groceries. Using the Fairprice apps, we plan to use the coupon to make our purchase. However, we are not very sure so we approached one of your staff named Susan Ang . Initially, I asked her politely that I have chosen a few items but as for the vouchers we only selected one, and how should we proceed? Should I select all at one time or only one voucher per transaction? Reluctantly, she came over and answered loudly “ what voucher, you never show me any voucher?” We were puzzled by the rude behaviour, maybe she had a bad day.” Nevertheless, I asked her to delete the whole transaction so I can input my orders again at the self service station. Finally, we managed to figure out ourselves how to use the voucher from the apps WITHOUT THE HELP OF YOUR STAFF, I told her as a Fairprice staff, you should be more familiar about your own promotion than the customer. Unhappy that I said this to her, she yelled at me that “ you are also very rude!”  and we noticed that she started to place things loudly beside us. We were baffled so I decided to take down her name. At this time, I noticed that she removed her name tag and I insisted to take down her name. She asked me “ what do you want my name for?” I told her I am going to lodge a complaint against you. Unwillingly, she showed her name tag to me. Lastly, as we were carrying a lot of groceries we purchased, we decided to go home to store it before we can figure out how to settle this. We still thought of giving her a chance to repent but she did something unforgivable , shouting extremely loud from inside the store “ GO AHEAD AND COMPLAINT! I AM NOT AFRAID OF YOU! “ My wife and I was standing outside the store and we can even hear this clearly.  As a consumer, I don’t think we deserve this. As a resident staying opposite for 10 over years in Upper Serangoon Crescent, this is first time I encountered this. I have feedback the whole saga to the supervisor Mr Edwin. He promised me to conduct an investigation and acknowledged that staff shouldn’t talk like this to the customer and promised to talk to his manager about this and he will update me in 2 days. However, today is the fourth day, no updates no reply. This is how Fairprice trained their staff and the protocol for handling feedback.",
      "time": 1734171541,
      "translated": false
    },
    {
      "author_name": "Daman Choy",
      "author_url": "https://www.google.com/maps/contrib/100758464003840605129/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI76B5UGoLhUQAB31aUhowCJg5Awm2YLUCf9NDbk_aOdahqWw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 2,
      "relative_time_description": "3 years ago",
      "text": "Has the basic essentials but just didn't understand why there are no coffee powders such as Tesco, Boncafe, Suzuki, etc...which are found in other FPs. Too much stock on all the instant sachets. Cereal choices also not much as others. Hope there are improvements to standardised with others.\nThe FP at Pasir Ris West Mall recently went on an upgrade which is really a big improvement. Please follow suit. Hope my feedback matters...thanks.",
      "time": 1652003746,
      "translated": false
    },
    {
      "author_name": "Cozy Winkel",
      "author_url": "https://www.google.com/maps/contrib/101136715081780364216/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWAYa68agOUMJjybsiUP-nTcBBI5zZRC2tpDCUVIIC74Fr1AXs=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "Bought bean sprouts and was frustrated that  they are stale. Hope they will check all the stock on the shelves regularly. Indeed it’s not my first time to encounter this issue.",
      "time": 1678794823,
      "translated": false
    },
    {
      "author_name": "G K",
      "author_url": "https://www.google.com/maps/contrib/114582748081782476525/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIn0G5MvlaUGWtVoa6Q1w6g2_gVr6nf_Rb3ShWqIIbiIi3Jeg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "The staff named susan ang has very poor professionalism! uneducated.",
      "time": 1745075204,
      "translated": false
    }
  ],
  "types": [
    "supermarket",
    "grocery_or_supermarket",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3861079205527905211",
  "user_ratings_total": 506,
  "vicinity": "476 Upper Serangoon View, #02-18 Hougang Capeview"
}