{
  "formatted_address": "54 Sembawang Rd, #01-01 Hong Heng Mansion, Singapore 779085",
  "geometry": {
    "location": {
      "lat": 1.4027461,
      "lng": 103.8181274
    },
    "viewport": {
      "northeast": {
        "lat": 1.404129480291502,
        "lng": 103.8194944302915
      },
      "southwest": {
        "lat": 1.401431519708498,
        "lng": 103.8167964697085
      }
    }
  },
  "name": "Famous Palace",
  "place_id": "ChIJ7ViF4iUV2jERdFIuf1MTf0o",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Reah Sim",
      "author_url": "https://www.google.com/maps/contrib/103627245060332393528/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLdbFsZAQROlSthYcGF4CzY7TjKfpiCfMnEMwGJoJcrwJPrzg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 4,
      "relative_time_description": "8 months ago",
      "text": "Famous Palace offers a delightful dining experience with its well-prepared dishes and attentive service. The dim sum is particularly noteworthy, with a range of flavours and textures that impress. The ambiance is pleasant, making it a great spot for both casual meals and special occasions. Prices are reasonable for the quality. A solid choice for authentic Cantonese cuisine!",
      "time": 1725594205,
      "translated": false
    },
    {
      "author_name": "Ze Ying Lam",
      "author_url": "https://www.google.com/maps/contrib/102706852841155125219/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKzIY10x_1Mdw7XychkC3fdkI9fn-_zr1DEGftkgiucOEX0Jw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I went to the Seletar Country Club outlet.\n\nFood variety is good. Promotion items are of good value. Wine pairing dinners good value.\n\nExceptional service from the captain Tracy deserves special mention.\n\nRestaurant is very clean and spacious. Beautiful view of the golf course and sun set. Will come again!",
      "time": 1694349729,
      "translated": false
    },
    {
      "author_name": "EPT",
      "author_url": "https://www.google.com/maps/contrib/110923826368280804306/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKHGGm67McDwYY9LZMntwF5GO9tH4SFPNYNDW3eV2a1YaVzjQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "a year ago",
      "text": "Came here for the 3rd time after a year and there is still no improvement on the food and service. Dined on a Saturday but less than half the restaurant is occupied. Serving portion is small for all the dishes. The ice veg salad is the most ridiculously smallest dish. Not enough to even go round for 8pax. Curry fish head gravy is tasty but the is only half a fish head. The prawns are live and that is the only tasty dish for the night. Volcano chicken is nothing great, tasted like ordinary roasted chicken in most Chinese restaurants. The steamed Soon Hock fish is not so fresh. We had red bean pancake to share for dessert but is red bean paste is very sweet. Not recommended.",
      "time": 1703459357,
      "translated": false
    },
    {
      "author_name": "Zee Lam",
      "author_url": "https://www.google.com/maps/contrib/104035203753687125595/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKvupTFgorcKZu0Wn4PEd7brQ2iI9nT6Ibp1gVizgDDu2FVZQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I just dined at the Famous Palace Singapore Chinese Restaurant celebrating my dad’s 82th birthday, and it was an unforgettable experience that deserves a solid 5 stars! The ambiance was absolutely stunning, with full-height windows offering breathtaking views of the Seletar Country Club's lush golf course. Do arrive before the sun set.\n\nNow, let's talk about the food - the Peking duck $49 (50% discount) was a steal! It was perfectly crispy on the outside and tender on the inside, served with all the traditional accompaniments. But what really stood out was the birthday noodles with red quail eggs. This unique touch added a delightful burst of lime flavor and symbolized celebration.\n\nThe combination of the exquisite setting, impeccable service (esp Tracy Tan), her personal service truly made this dining experience exceptional. If you're looking for a memorable meal with a view, Famous Palace is a hidden gem worth checking out 💎 and must try for folks staying in the north, or perhaps for those who stay anywhere else is worth the drive to this “famous palace”.",
      "time": 1694352891,
      "translated": false
    },
    {
      "author_name": "C. En",
      "author_url": "https://www.google.com/maps/contrib/110601930033542355777/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXISSSq7Uy91Uf8Q6x_Hmrl_BjVjT1NvdDrJ5V6EMjdmg77exRX=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "8 months ago",
      "text": "Swung by to try this restaurant for the first time as we came across their monthly promotion.\n\nSad to say, the food was average at best. The supposed whole duck portion reflected a really small duck and was pretty much flavourless and no better than any roast store in a coffee shop. Honestly would not recommend spending $98++ on it.\n\nAs for their signature char kway teow, it was boring and lacking in any flavour though they were generous with the beansprouts. Apart from that, I can think of a few other zichar stalls in coffeeshops that can do better for a fraction of the price.\n\nDine here only if you have to, it isn't worth the travel otherwise.",
      "time": 1724601074,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5368030530185876084",
  "user_ratings_total": 85,
  "vicinity": "54 Sembawang Road, #01-01 Hong Heng Mansion"
}