{
  "formatted_address": "21 Bukit Batok Cres, Wcega Tower, Floor 658065",
  "geometry": {
    "location": {
      "lat": 1.3370671,
      "lng": 103.7595727
    },
    "viewport": {
      "northeast": {
        "lat": 1.338633330291502,
        "lng": 103.7607943802915
      },
      "southwest": {
        "lat": 1.335935369708498,
        "lng": 103.7580964197085
      }
    }
  },
  "name": "Famous JB 101 @ Bukit Batok (Main)",
  "place_id": "ChIJaXq0JG4Q2jERggfc-CzhJh0",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Pauline Wee",
      "author_url": "https://www.google.com/maps/contrib/113442208195765868656/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUz_DLKjUGkLOhF6kJ93NDOEdoKp27yXqfzBfwzQJWmZ2qYcjPb=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I recently visited JB101 with a group of four and had a delightful experience! First off, I called in to reserve a pet-friendly corner seat, and they were very accommodating. The cozy atmosphere made it a perfect spot to relax, and surprisingly, it wasn’t hot at all thanks to the air cooler and fans.\n\nThe ordering process was convenient; we could scan the QR code or ask the friendly staff for assistance. The menu was provided, and we decided to try several dishes. Everything we ordered was delicious! The highlight was definitely the signature fried pork—absolutely mouthwatering! The hot plate tofu was silky smooth and paired well with everything. While the rest of the dishes were acceptable, I found the curry fish a bit on the sweeter side rather than spicy, which was a minor letdown.\n\nParking was ample; we saw around 8-10 cars parked outside the roundabout, and we managed to find a spot there as well. Just a heads up, there's a basement car park, and you’ll need to take the lift up one level to reach the restaurant.\n\nOne unique touch was the complimentary ice cream they offer, which brought back nostalgic memories of the old-school stick kind!\n\nOverall, a great dining experience. I would definitely recommend JB101 for anyone looking for a cozy place to enjoy good food with pets!",
      "time": 1744943967,
      "translated": false
    },
    {
      "author_name": "Hayzel Tham",
      "author_url": "https://www.google.com/maps/contrib/110594358317089645469/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVFkl44VacTMBC_cXApIpVVEGVXg0OgMl7D2CHuhexRv6Q2ZakgLg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "The service was good because we gave feedback about the veggies too salty and the person offered to exchange for us.\n\nThe baby squid was crunchy and nice, white bee hoon and garlic pork ribs is nice too..\n\nGinger chicken was too salty like veggies.\n\nHor fun and hokkien mee was normal only.\n\nThere's free ice cream for dinner time. No GST and service charge!",
      "time": 1744887062,
      "translated": false
    },
    {
      "author_name": "Jerry Yang",
      "author_url": "https://www.google.com/maps/contrib/109672637295613879634/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLoEzk8CGePYK0lnr30j9vWbf1m7EXBr-1wRCFv5JsuM5AzRQ=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "a week ago",
      "text": "Using the time waiting to leave a review. Barely halfway into the dishes we ordered, with 4 yet to come.\n\nAnd we've been sitting here for the past 2+ hours...\n\nLooking at the other reviews, I presume the experience during non-peak periods is a positive one, but I would not recommend this place as a destination for celebrating say, Mother's Day, as we foolishly decided to.\n\nStaff left us waiting despite reservations made. Guy waiting behind us (also with reservations made) speculated that they probably accepted walk-ins in addition to reservations and ended up not being able to manage. Bored diners all around with no food on their tables.\n\nWe were told to wait an hour for the food to arrive, which we accepted. Unfortunately for us, this ballooned to 2 hours before the first dish arrived. In between, to spice things up and keep us entertained, staff would come to us to inform us that XX ingredient/YY dish was no longer available and if we would like to consider alternatives. What choice did we have?\n\nTo his credit, someone did pop by twice to apologise for the wait and ask us how the food was. It was OK. Hardly worth waiting 2 hours for though.\n\nWouldn't be back.",
      "time": 1746970592,
      "translated": false
    },
    {
      "author_name": "Linq",
      "author_url": "https://www.google.com/maps/contrib/117499114632308699444/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVZa0uiMf1_jSjbUc1q9sTIS8Z_SaLiB5wjos13wczikAKgtF-Y=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Food is great and flavourful. The JB hokkien noodles got a strong wok hei which I love a lot. The fried pork is amazing! Price is a bit pricey.",
      "time": 1743655427,
      "translated": false
    },
    {
      "author_name": "Lydia LOH",
      "author_url": "https://www.google.com/maps/contrib/104651432006502525812/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVCWa2Chug6OU8tFf4rImFO3Zq88ByFIzAkjEg4o1XhCWKy4iYy=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Food maintain good standard despite being the Mother’s Day weekends which is much more busy than usual. We have a good gathering dinner.",
      "time": 1746884582,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2100613859484895106",
  "user_ratings_total": 1414,
  "vicinity": "21 Bukit Batok Crescent, Wcega Tower, Floor"
}