{
  "formatted_address": "10 Tebing Ln, #01-05/06, Singapore 828836",
  "geometry": {
    "location": {
      "lat": 1.3931287,
      "lng": 103.9172599
    },
    "viewport": {
      "northeast": {
        "lat": 1.394425680291502,
        "lng": 103.9185314302915
      },
      "southwest": {
        "lat": 1.391727719708498,
        "lng": 103.9158334697085
      }
    }
  },
  "name": "Fat Po",
  "place_id": "ChIJAchazzI92jERz9jSEMtC-f8",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Joseph Tan",
      "author_url": "https://www.google.com/maps/contrib/113204146437648205487/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWw8CO9ytWVtMgZ2JaGSbBtK5AK0GPbhviUCVxoa2xEFGPssig7xA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Just visited Fat Po at Punggol's Tebing Lane and was impressed by the cozy bistro-style ambience with views of greenery through their large windows. The menu offers an exciting fusion of Asian and Western flavors that's surprisingly affordable, with most dishes between $8-20.\n\nTheir Japanese-inspired tamagoyaki was the highlight of my meal - perfectly fluffy with a delicate sweetness that kept me coming back for more. The baked oysters with cheese were indulgent and fresh, making for a delicious starter.\n\nUnfortunately, the satay skewers didn't justify their price point - a bit dry and lacking the rich marinade I was hoping for. The steak was decent but nothing memorable, just your standard bistro fare.\n\nWhat makes Fat Po special is their creative fusion dishes like their signature Hokkien Vongole and Moonlight Hor Fun with its distinct wok hei aroma. The restaurant gets busy on weekends, so I'd recommend visiting on weekdays for a more relaxed experience.\n\nWill definitely return to try their popular Mapo Tofu Fries and Bolo Burger that other diners seem to love!",
      "time": 1741508721,
      "translated": false
    },
    {
      "author_name": "S Foo",
      "author_url": "https://www.google.com/maps/contrib/103252058657576066792/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWwVkV_RFeM8VpVt8CuH40RFl7CrJdqTpyXNNTb12_9GOimCYhuTg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "5 months ago",
      "text": "Service was good as the wait staff was observant and anticipated the needs. We were a group of 2 seniors and 2 young adults. The lady wait staff served us with 2 glasses of warm water and 2 glasses of cold water without us indicating. No charge for water.\n\nOutdoor and indoor seating available.\n\nWe ordered :\n-Moonlit Horfun ($14.80++). This was a hit as it had good wok hei without being excessively oily. A must order.\n\n-Honey Chicken($14.80++) served with coleslaw and fries. Chicken was tender and moist.\n\n-Hokkien Vongole($18.80++) was a wet soupy version of fried hokkien mee where the flavour of clams was strongly evident. Overall this highly popular dish did not wow any of us. We also felt that the dish was over priced for the handful of clams and small portion of noodles.\n\n-Sambal Fish served with waterfall seaweed and warm vegetables ($14.80++). Super disappointed that fish used was dory as the meat lacked bite and was tasteless. The sambal was too salty. Liked the waterfall seaweed which was very thin strips of fried potatoes sprinkled with seaweed powder.",
      "time": 1734078750,
      "translated": false
    },
    {
      "author_name": "G",
      "author_url": "https://www.google.com/maps/contrib/113115281677147026399/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXlrqDTimAAnG_A6HnqDFs8JZ_flUaaxLPMUTx-TOOYZ_HEmPWRcg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "the persistent houseflies were the highlight for the 1st 30% of our time here.\nspent quite abit of time trying to swat away the houseflies / flies .\ndon't like the idea of any fly landing on any part of our food.\nthankfully the houseflies stopped bothering us, maybe they found more attractive pastures .\n\nthe chai poh egg and pork = tasted bland to me , but imo , was good for kid .\nnot too salty , not over-oily  , good-sized portion .\n\ncurry dish was not too spicy .\nimo , won't work for those who like spicy stuff .\n\nenoki bacon skewers = abit too salty .\nbut nice crispy .\n\nthe wait staff were very friendly , even though it was full-house .\n\nparking = we came early for dinner , so it was quite easy to get a parking lot .\nwhen we left , the carpark was full.",
      "time": 1739544081,
      "translated": false
    },
    {
      "author_name": "oXRYSTALo Ong",
      "author_url": "https://www.google.com/maps/contrib/114556064085815871377/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSTtKcF9FYMbh-XNbDu8f7Whl3gi-ZY6T8pFPOm3v9Y98Ws7jL=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "Alright, folks, listen up! Donkey and I joined our friends at Fat Po in Punggol for lunch to celebrate their collection of new motorbikes. We've been by Fat Po many times before, usually just for a quick beer after our cycling rides on hot days, but this was our first time actually having a proper meal there. We were pleasantly surprised.\n\nWhat We Loved:\n\n• The Atmosphere: Fat Po has a spacious and comfortable interior. It's large, airy, and not overly noisy, making it a great place for a casual gathering with friends. The atmosphere is relaxed and friendly, making it easy to have a good conversation. We felt right at home!\n\n• The Honey Chicken Chop: The Honey Chicken Chop was a true highlight. The chicken was tender and flavorful, and the noodles were delicious.\n\n• The Value: The prices at Fat Po were very reasonable, making it a great value for a casual, tasty meal. We were impressed by the value for the quality of the food.\n\n• The Service: The staff was efficient in delivering the food, and we appreciated the friendly service. Even though most of the ordering was done through a QR code, they were still helpful.\n\nWhat We Didn't Love:\n\n• The Classic Lok Lok Set: The Classic Lok Lok Set was acceptable, with a variety of flavors and textures. It wasn't our favorite, but it was fine.\n\nDonkey's Take: I loved the Honey Chicken Chop!\n\nMy Take: It was great to celebrate with our friends at Fat Po.\n\nRating:\n\n• Food: 4/5 (Good food for the price, especially the Honey Chicken Chop)\n\n• Service: 3.5/5 (Friendly and efficient but not attentive enough)\n\n• Atmosphere: 4/5 (Spacious, airy, and comfortable)\n\nOverall:  4/5\n\nOur Verdict: We had a great time celebrating with our friends, enjoying the good food, and relishing the comfortable atmosphere. We will be back for a casual meal in the future.",
      "time": 1730591687,
      "translated": false
    },
    {
      "author_name": "Doraemon",
      "author_url": "https://www.google.com/maps/contrib/112665277904119154671/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX2VSCcaT9axvOwx2nD8XD3PgZ8V5VFnv420aocMSfLa6GlcEmN=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "Kitty and I joined our friends at Fat Po in Punggol for lunch to celebrate their new motorbikes. We've been by Fat Po many times before, usually just for a quick beer after our cycling rides on hot days, but this was our first time actually having a proper meal there.  We were pleasantly surprised.\n\nFat Po has a spacious and comfortable interior.  It's large, airy, and not overly noisy, making it a great place for a casual gathering with friends.  The atmosphere is relaxed and friendly, making it easy to have a good conversation.  We felt right at home!\n\nWe ordered the Classic Lok Lok Set and two Honey Chicken Chop sets.  It turned out that Kitty had accidentally ordered three sets, but luckily, kitty and i were able to share the extra set\n\nThe Classic Lok Lok Set was acceptable, with a variety of flavors and textures. The Honey Chicken Chop was a true highlight. The chicken was tender and flavorful, and the noodles were delicious.  Both Kitty and I thought the food was above average for a casual restaurant.\n\nThe prices at Fat Po were very reasonable, making it a great value for a casual, tasty meal.  We were impressed by the value for the quality of the food.  The staff was efficient in delivering the food, and we appreciated the friendly service.  Even though most of the ordering was done through a QR code, they were still attentive and helpful.\n\nWe had a great time celebrating with our friends, enjoying the good food, and relishing the comfortable atmosphere. We will be back for a casual meal in the future.",
      "time": 1730562141,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=18444847188800624847",
  "user_ratings_total": 753,
  "vicinity": "10 Tebing Lane, #01-05/06"
}