{
  "formatted_address": "254 Jurong East St 24, #01-28, Singapore 600254",
  "geometry": {
    "location": {
      "lat": 1.3436991,
      "lng": 103.7376828
    },
    "viewport": {
      "northeast": {
        "lat": 1.345137380291502,
        "lng": 103.7390939802915
      },
      "southwest": {
        "lat": 1.342439419708498,
        "lng": 103.7363960197085
      }
    }
  },
  "name": "Fei Fei Roasted Noodle",
  "place_id": "ChIJZZZoqxkQ2jERUlm9TCW5lj4",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "CW",
      "author_url": "https://www.google.com/maps/contrib/113626212339632338435/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKpu2AGb0ReVeD4y9RvRE9s7gGVcAfgRtLaivlm4XYm03T6gw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "3 weeks ago",
      "text": "This is a very popular stall with long queues every day. Heard so much about their signature charsiew wanton noodle but yet to try it until today. There were only 5 people in the queue, so it's a good time to try out their wanton noodle.\nI like the authentic Hong-Kong style thin & springy wanton noodle, the texture is fantastic. But I find the sauce a bit diluted & not very tasty. The Charsiew is only char & tasty outside, but pure white inside. The meat is very fat & even had some porky taste. Overall, the wanton noodle is just average, but I would not queue for it.",
      "time": 1745819711,
      "translated": false
    },
    {
      "author_name": "Barry Pang",
      "author_url": "https://www.google.com/maps/contrib/107527804550590210414/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKxzTc00t6wNWUdLVKbNUgDA_e_yAr9-BLxYHG12Y-qbLD62A=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "A bit of a queue on a Monday morning, but  ordering was straight forward and clear. Noodles was the springy to the bite type, not my favoured traditional type, but the overall bowl of wtm was very good.  Char-siew was a good mix of lean-fat, thick cut and tender moist. Wantan were flavourful morsels of pork and shrimp. Even the oft-forgotten soup was above-average. $5 was worth it, queue notwithstanding.  It's a definite 'can-eat' at this stall, but watch the short operating hours.",
      "time": 1743990616,
      "translated": false
    },
    {
      "author_name": "Touristmouse",
      "author_url": "https://www.google.com/maps/contrib/110409011587721664076/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVQwdnnLVXAyDc72dXSDd23W5Gz3eSWS0b1idu6OY0BJjmLShxezg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I arrived at 8 am on a Saturday, ahead of their opening time, hoping to beat the queue. However, there were already 10 people waiting. Two people gave up along the way, and when the stall finally opened, I waited another 15 minutes before I could order, as most patrons placed multiple orders.\n\nI opted for their signature wanton mee ($5) but decided to add on char siew for $2 when I collected my order, as the meat portion initially looked quite small compared to everyone else who had topped up. If you're considering adding extra meat, I highly recommend the char siew. It's exceptionally good, with a great mix of lean and fat, and it's cut thick. Besides, good char siew is rarer to find in Singapore than Sio Bak and roasted duck.\n\nThe egg noodles were springy and perfectly cooked, with absolutely no alkaline 'kee' aftertaste. The lard bits were big, chunky, and crispy. Both the chilli sauce and pickled green chillis complemented the dish well.\n\nIn comparison, the wanton soup was basic. While the wantons themselves had a good skin-to-meat ratio, the soup was rather bland.\n\nNonetheless, for the char siew alone, I'm willing to come back to queue. However, next time I will probably come by on a weekday instead as I overheard from other patrons that the queue will be shorter.",
      "time": 1744423446,
      "translated": false
    },
    {
      "author_name": "Kenny Yap",
      "author_url": "https://www.google.com/maps/contrib/105256927610815725781/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXcPvs1ZpGoEXYjKq_FFRgFMieeHCw9D8043R8OsUqM_5Tcxisr=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "5 months ago",
      "text": "Decided to check this place out since it always has a long queue. I came here before opening hours and was second in line. It opens at 830am and I got my food around 840am. By the time I ordered, there was already a snaking queue formed.\n\nI had the charsiew noodles which comes w 2 wanton and I added duck thigh. Total came up to $12. Not sure how much is each but if you can tell from the signboard then you can refer to it.\n\nTaste wise I enjoyed the charsiew, it has a very nice caramelized taste and has a good fat to meat ratio balance. Seems like it’s not always the case from the photos so it depends on your luck? I did notice that I had my charsiew cut from the hanging rack whereas if you order normal charsiew noodles they take it from this precut bowl at the front of the store. Not sure how it works but maybe if you add extra meat you get a different treatment.\n\nAs for the duck I wasn’t too impressed. Despite being second in line, the duck already felt abit stale/not hot. The skin was also barely crispy. Quite a letdown considering I probably paid a lot for it.",
      "time": 1734574325,
      "translated": false
    },
    {
      "author_name": "Jason Lee",
      "author_url": "https://www.google.com/maps/contrib/117573508452714919187/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUXTuWFvmvXSM2eMLot6Qc1GLhDXvzCoW3RnDST5MtrhpQFJR9b=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Really wanted to give lesser stars due to the excruciating long wait in the hot coffee shop, but the char siew is really good for its price! Lady taking order is friendly too, but indeed there were many regulars queue cutting.\nMeat portion is super super generous, no need to top up for normal eaters. I added $2 +$2 for Char siew + roasted pork",
      "time": 1744775562,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4509995646710536530",
  "user_ratings_total": 290,
  "vicinity": "254 Jurong East Street 24, #01-28, Singapore"
}