{
  "formatted_address": "27 Woking Rd, Singapore 138705",
  "geometry": {
    "location": {
      "lat": 1.2979507,
      "lng": 103.7945705
    },
    "viewport": {
      "northeast": {
        "lat": 1.299348580291502,
        "lng": 103.7958694802915
      },
      "southwest": {
        "lat": 1.296650619708498,
        "lng": 103.7931715197085
      }
    }
  },
  "name": "Fernhill Psychology and Counselling",
  "place_id": "ChIJb4wJkUga2jERnOGKVBjmD28",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "Nicole Clarke Fitness",
      "author_url": "https://www.google.com/maps/contrib/113797098307428209249/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWUQwb0CabpMyWrBre-wPB6V9VaV87-XMjmKLL7y0x_eTUMSzMa=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Been going to Lilian for a while now and after having gone to many therapists before, finding her was a real godsend.\n\nLilian has helped me navigate all my struggles with immense patience, heart and brutal honesty.\n\nWith Lilian’s help, I’ve gained insight into myself and watched my life transform for the better session by session.\n\nI will say that you have to be ready to be guided by Lilian as she will walk you through the darkest places, but I have never left Fernhill feeling worse than when I came. I always feel renewed and organised to take on life.\n\nBest money I’ve ever spent and would definitely recommend you to walk your journey with Lilian when you’re ready, it’s been an absolute pleasure for me ☺️❤️",
      "time": 1713582364,
      "translated": false
    },
    {
      "author_name": "Robert Laggy",
      "author_url": "https://www.google.com/maps/contrib/112461899506213634092/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJZTF46FXRb_DTPCW4LeJ9KJyfJ4-5AaUDFx8bj207hU7C8yg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Brought my daughter to see Lilian. The first meeting was great, I personally found Lilian nice helpful and kind, and intelligently describing my child’s difficulties. However, the next few times, my child went alone and Lilian barely remembered her and her case details. She also ended the meeting abruptly, and when my daughter asked her more questions, she refused to answer her as the session was over, even telling her to remember to pay after the next few sessions. I found that the stark difference in the treatment of my daughter when I wasn’t around was quite disappointing. I felt disappointed that this happens as otherwise, Lilian is an extremely intelligent and proficient psychologist.",
      "time": 1699366365,
      "translated": false
    },
    {
      "author_name": "Suze P",
      "author_url": "https://www.google.com/maps/contrib/113005778506178857128/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI2icGoGAw8Y75vNIkno-xgmiJ2-hQPoR_tmOae3oxny4OXCw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "I came to Fernhill for some help when I was struggling a lot in my personal life. I saw Lilian, who initially seemed empathetic, however in my second session with her she was very dismissive of the problems I had brought up and needed advice on. I tried to explain my situation in more detail but she kept repeating that the issues I had explained \"weren't real\" and were a \"fantasy\" which immediately turned me off and frankly, was quite shocking behavior from a professional in this field. It felt like a slap in the face to pay for professional help and have my case be dismissed and denounced in such a way, and her insistent attitude when paying cemented my decision not to continue coming here.",
      "time": 1704478120,
      "translated": false
    },
    {
      "author_name": "emily n",
      "author_url": "https://www.google.com/maps/contrib/101533664735314889051/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUaSEYBg3DkXbJyffRhDt-ZxrcM2P1bmsBQajd5G2BCByP7q-E=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 years ago",
      "text": "I've emailed Fernhill awhile ago seeking help for a loved one and Jillian Bromley, the director of Fernhill Psychology and Counselling replied to my consultation request, agreeing to a call that they never followed up on.  The call never happened and I was left hanging and never got an answer back. Makes me feel like they don't really care. A lot of times, for one to step up and seek counseling help is a huge step for them. For Fernhill to ignore them and leave them in the cold like that is very unethical and unprofessional.",
      "time": 1601020467,
      "translated": false
    },
    {
      "author_name": "Stefanus Du Toit",
      "author_url": "https://www.google.com/maps/contrib/118060559471805208269/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUZxtil5j6DlwHNcQ1WpIrisQE6km3Z_O2FwcjNRFSxT-11eGVPxw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "The clinic is located in a beautiful lush environment that feels like an escape from the city. Dr Jane Tuomola is a very caring and considerate therapist who strikes the right balance between listening and providing positive and helpful advice.",
      "time": 1636454019,
      "translated": false
    }
  ],
  "types": [
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8002868055032652188",
  "user_ratings_total": 11,
  "vicinity": "27 Woking Road"
}