{
  "formatted_address": "Lot G-14&G, 15, Persiaran Medini 5, Sunway City, 79250 Iskandar Puteri, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.3967009,
      "lng": 103.6275852
    },
    "viewport": {
      "northeast": {
        "lat": 1.398119180291502,
        "lng": 103.6289096802915
      },
      "southwest": {
        "lat": 1.395421219708498,
        "lng": 103.6262117197085
      }
    }
  },
  "name": "Fin&feather@Sunway Big Box",
  "place_id": "ChIJ8bOopjgJ2jER1VymttTg5IM",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Lee Stephen",
      "author_url": "https://www.google.com/maps/contrib/102014324026015090440/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJzPVyOJfSKKd4Uhuaj8qlb_HJjY9Rh04Zqj645kMlGaYynSTE=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Brought my family here for dinner and we were all really impressed! The environment was clean, cozy, and family-friendly—great for a relaxing meal together. Staff were very polite and attentive, and the service felt sincere. The food was absolutely delicious—especially the fish and chips, which everyone at the table loved. Portions were generous and pricing was reasonable for the quality. We’ll definitely be coming back again soon. Highly recommend this place if you’re looking for a nice spot to enjoy good food with family!",
      "time": 1746099225,
      "translated": false
    },
    {
      "author_name": "Jetpinn O",
      "author_url": "https://www.google.com/maps/contrib/102400965297950619555/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVOT9ntWoXzNzW8uHA6TYw5_olKPjDdhwUpyOvnm4toviBtpKfXsA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Fin & Feathers is a rare gem in this area, and I keep coming back for good reason. While the menu isn’t extensive, there’s something for everyone. My go-to dish is the grilled salmon—I always request to swap the fries for salad, and I appreciate the generous portion of salad they served. The salad is one of the lightest and most refreshing I’ve had, with minimal oil and a citrusy dressing that makes it a great healthy option. The fish and chips are also well done—crispy yet not greasy. My child loves their homemade smoked salmon, which is juicy, not overly salty, and pairs perfectly with the pickled cucumber and onion. I hope they continue offering healthy dishes and consider adding a seasonal menu to keep things exciting for regular customers.",
      "time": 1742715214,
      "translated": false
    },
    {
      "author_name": "Jia Huei Tan",
      "author_url": "https://www.google.com/maps/contrib/101874349775523940780/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKBgFm64wl5qZHVyoEGb0TPKeOk_u_NAeCvqgolerzJxkQPaaA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Absolutely fantastic experience! From the moment we walked in, the staff were warm and attentive. The ambiance was cozy yet elegant, perfect for both casual dining and special occasions. Every dish we ordered was fresh, flavorful, and beautifully presented—especially the truffle pasta. The service was prompt without feeling rushed, and the team made sure we felt well taken care of throughout the evening. Highly recommend this gem—can’t wait to come back!",
      "time": 1746098413,
      "translated": false
    },
    {
      "author_name": "Dezmun Chew",
      "author_url": "https://www.google.com/maps/contrib/100452063146132933481/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLvm1MyAoDXBvf0ZWXn9LXY_UEq0iIgHdc-ZMyLCYU6F9kGwQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "i’ve been here a few times now, & it’s always great. the food is delicious, the vibe is cozy, and the staff is really kind and welcoming. you can tell they put a lot of care into both the food and the atmosphere. the best part? it’s totally worth the wait & money. everything’s made with attention to detail, and it always makes the experience better. definitely recommend it if you're looking for a tasty meal in a chill spot!",
      "time": 1742279398,
      "translated": false
    },
    {
      "author_name": "Quesilla Ho",
      "author_url": "https://www.google.com/maps/contrib/111970183065874791331/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWsHJZmv5K-LOLBOt4Eal8m0a5gPxHG_DoJp9Z9SYCJs___tBIf=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "We had dinner here two days in a row to tell how great the foods are in Fin&feather. Their grilled seabass was cooked to right texture, soft on the meat and crunchy on the skin. Their fries are great! We were too busy eating and didn't manage to take the rest of the foods. Fish and chips, smoked duck pasta are good too. Kudos to the floor staff who served us at the dinner but we think the cashier/lady owner can be slightly friendly, so that you will get more return customers like us.",
      "time": 1725423771,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9503968317860633813",
  "user_ratings_total": 141,
  "vicinity": "Lot G-14&G, 15, Persiaran Medini 5, Sunway City, Iskandar Puteri"
}