{
  "formatted_address": "722 Clementi West Street 2, Singapore 120722",
  "geometry": {
    "location": {
      "lat": 1.3027453,
      "lng": 103.7635239
    },
    "viewport": {
      "northeast": {
        "lat": 1.304036130291502,
        "lng": 103.7647461802915
      },
      "southwest": {
        "lat": 1.301338169708498,
        "lng": 103.7620482197085
      }
    }
  },
  "name": "Fishball shop",
  "place_id": "ChIJuWhLY2Yb2jERXsIB80KQwbw",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Sean Goh",
      "author_url": "https://www.google.com/maps/contrib/113608706305591448585/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKEaTeEStI-pfTIXqsvSF6l02FivQ-XBDO9hy5SPhzxdS9tTA=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "3 years ago",
      "text": "Chance upon this stall the last time i was here to try the porridge from the same coffeeshop. This stall selling fishball noodle seems to be very popular. Upon reaching the coffeeshop, there were at least 7 people in the queue already. The stall is operated by only an elderly man. Queue moved pretty fast, it took me about 15 mins before it was my turn to order. Fishball noodle price starts from SGD$3.50 onwards, i think there was an price increase from SGD$3.\n\nThe noodle was nicely cooked, texture of the noodle was springy. Sauce was well balance and tasted very lardy. it has that  古早味. The bowl of noodle came with ingredient like sliced fishcake, meatball and fishball which tasted like homemade. portion of the noodle was also very generous. You can also add on item but with additional charges.\n\nOverall, the fishball noodle here is definitely above average and would highly recommend.",
      "time": 1652947280,
      "translated": false
    },
    {
      "author_name": "Joel Tan",
      "author_url": "https://www.google.com/maps/contrib/114177808848921844314/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUdRfEIxQpqISO7YpQTxvwNrx8O8Ha57quFV2yyummKHE4knJ_L=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "a year ago",
      "text": "Overall not bad. Fishballs are really handmade, which is pleasant surprise in Singapore. Dry meepok noodles did not have enough acidity and oil/lard, but I guess you can always ask for more. Very budget friendly, $4.50 for a decent serving size but heh I don't eat much (serious).",
      "time": 1715238522,
      "translated": false
    },
    {
      "author_name": "Wilson Foo",
      "author_url": "https://www.google.com/maps/contrib/114263857328212431619/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIIh7G1X_JZDJZgIL6xxNoM8CIfjOdDDN6tMUxtTdpzGnximA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "Update 9 Aug 2024:\n\nBeen a while since I last ate here. Although the prices have not changed since the last increase to $4.00 a bowl, they swapped out one fish ball for a fish stick (see latest photo) and cut down on the number of slices of fish cake. The fish stick is so ordinary and obviously factory supplied. Rather have my fish ball.\n\nDecided to try this relatively new stall in Clementi West St 2. Ordered the $3.50 portion of mee kia dry with chilli sauce. The portion is decent for this price. It came with two fishballs and one meat ball and about 10 slices of fish cake.\n\nFirst of all the accompanying soup. It didn’t taste solely made with MSG and salt. Pork bones were boiled with water and it became more umami tasting as more fishballs are boiled. The noodles could have been more al dente. Glad I did not order the soup version because the noodles would have been even soggy towards the end. With this dry version, your main focus is on the chilli sauce which was good. Not a lot of heat but fragrant and very savoury. With enough vinegar, it goes well with the noodles. Owner was also very generous with the lard and oil so that helped elevate the overall taste of the noodles\n\nThe sliced fish cakes were a joy to eat. They were fried until a crispy skin on the outside was achieved and then sliced. So as you bite down, the crispy skin contrasted against the soft core of the fish cake. But the star has the be their fishballs. Bouncy, irregular shapes and tasting full of saltiness of sea fish, every bite was a pleasure, even without dipping into cut chilli/soya sauce. As for the meat ball, it was more of fish meat and pork cause it tasted as umami as the fish balls.\n\nVery well done as far as fishball noodles go. It’s been a while I found since such tasty fishball noodles. I must come back again soon for their mee pok.",
      "time": 1723184739,
      "translated": false
    },
    {
      "author_name": "CK C",
      "author_url": "https://www.google.com/maps/contrib/114345555265183607362/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ0m70NQj0bnpa391gSdR9Fgk6LU3yy-v_P_hMWOqmVM9s3nYJM=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Great fishballs, meatballs and fish cakes. Cash only.",
      "time": 1725970220,
      "translated": false
    },
    {
      "author_name": "Daniel Sin",
      "author_url": "https://www.google.com/maps/contrib/112598854240446452449/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXjYddoPyTukQbnkjgdSPb3EweF2OKgkxriQvGYsYqZ5VOqgVJO=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "4 years ago",
      "text": "Love the handmade fishball from this stall.. it is really hard to find fishball stall still selling the traditionally made fishball noodle at $3 per bowl. Ask for mee pok and their noodle is boiled without been too soft and still have the springy texture.",
      "time": 1619268547,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13601310966854828638",
  "user_ratings_total": 12,
  "vicinity": "722 Clementi West Street 2, Singapore"
}