{
  "formatted_address": "309 Hougang Ave 5, Block 309, Singapore 530309",
  "geometry": {
    "location": {
      "lat": 1.3662498,
      "lng": 103.8952777
    },
    "viewport": {
      "northeast": {
        "lat": 1.367693380291502,
        "lng": 103.8965826802915
      },
      "southwest": {
        "lat": 1.364995419708498,
        "lng": 103.8938847197085
      }
    }
  },
  "name": "Five Grill Kitchen Hougang",
  "place_id": "ChIJoYdLcAAX2jER_doJT9dNrOc",
  "rating": 2.9,
  "reviews": [
    {
      "author_name": "Alex",
      "author_url": "https://www.google.com/maps/contrib/106553846711000146615/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXUaSm0Nd5mQASNKaFANk2zYthW14DbTirglPuh9ti07y_xKnCp=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I recently had the pleasure of dining at Five Grill Kitchen, and I must say, it was a delightful experience! We ordered three plates of egg fried rice, one baked ham and sausage rice, and one whole spring chicken.\n\nTo start, the egg fried rice was served first, which was great since our table was conveniently located right beside the stall. The rice was well-fried and included ham, adding a fantastic flavor to the dish. It was a comforting and satisfying beginning to our meal.\n\nNext up was the baked ham and sausage rice, which completely exceeded my expectations! The dish was filled to the brim with gooey mozzarella cheese, and I was genuinely shocked at the generous portion size. At just $6.90, it was a steal! I found myself completely stuffed after finishing it, which is a testament to its value and deliciousness.\n\nFinally, we were served the whole spring chicken, which takes a bit longer to prepare. Let me tell you, it was worth the wait! The chicken was incredibly juicy, with no dry parts whatsoever. Each bite was bursting with flavor, and the crispy, well-fried skin added the perfect texture. It was simply divine!\n\nOverall, my experience at Five Grill Kitchen was fantastic. The food was delicious, the portions were generous, and the flavors were on point. I would highly recommend this place to anyone looking for a satisfying meal!",
      "time": 1731242666,
      "translated": false
    },
    {
      "author_name": "Besharps",
      "author_url": "https://www.google.com/maps/contrib/111020676081888304196/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWOKOFW20767ljTFGVZBDGgsF-Z2hPPYOBuA4v_uH1lhcTHopnh=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Ordered the Fried Rice Grill Chicken ($5.9). The service was good, I received my food fast 👍\n\nThe rice was well cooked 🍚 and egg was fried just nice, no over frying 🥚👍. The grill chicken was pretty delicious and covered in the sauce, tasted very nice. 🍖👍\n\nI would say it was a filling and scrumptious meal for quite an affordable price. If you are in the area, give it a try. I might try the other meals if I am in the area next time. 🙂👍",
      "time": 1736794674,
      "translated": false
    },
    {
      "author_name": "Wing Kit Soong",
      "author_url": "https://www.google.com/maps/contrib/112221803428110237293/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJUVBTBkHGwlrxNn4ED4z43lycvK2pWPlnjdRSMuPDb3SzZpg=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "4 months ago",
      "text": "Double fish is value for money but not the salmon. Sides are small, rice is not even a bowl size. Eat it if you have an appetite of a child.\n\nPoor communication on their end, almost get charged extra for ordering lemon butter flavor for db fish when I’ve been ordering the same order every other day. Fried rice is nice and consistent tho.",
      "time": 1735068241,
      "translated": false
    },
    {
      "author_name": "Richard Parry",
      "author_url": "https://www.google.com/maps/contrib/110028320477974923032/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXjU2qyuBnDQ3S90uNQZtkzVaIExoKedjKW1GmYiI8kLbiAuZ0T-w=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "This is just the standard western stall nothing special and nothing great. I ordered the signature burger with a side chips and coleslaw. Burger was just average and the chips were served cold and had been sitting for some time. Service was good and quite prompt. Betting things to eat at this coffee shop",
      "time": 1704207209,
      "translated": false
    },
    {
      "author_name": "Shalini Singh",
      "author_url": "https://www.google.com/maps/contrib/105540578271500346269/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIYJS_O59E-GRoPUBLFAEzqVK6NyNP0zcbBP9NTLjwDyblskw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Yesterday I have order a popcorn chicken along with the cheese. And the portion of the cheese is very little then once we told the person can you give the cheese as earlier others used to give the correct amount. There was a tall guy with blonde hair and he was very rude and we notice during the working hours he was drinking a beer and I think the 5 grill kitchen they should remove this type of staff. He is always very rude to the female customer and from now onwards I won't be buying any food from 5 grill kitchen... Very disappointed...",
      "time": 1740230332,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16693803505894939389",
  "user_ratings_total": 15,
  "vicinity": "309 Hougang Avenue 5, Block 309"
}