{
  "formatted_address": "BLK 323 Tah Ching Rd, #01-62, Singapore 610323",
  "geometry": {
    "location": {
      "lat": 1.3369347,
      "lng": 103.7239845
    },
    "viewport": {
      "northeast": {
        "lat": 1.338186030291502,
        "lng": 103.7252583302915
      },
      "southwest": {
        "lat": 1.335488069708498,
        "lng": 103.7225603697085
      }
    }
  },
  "name": "Five Star Tuition Centre Pte Ltd - Jurong",
  "place_id": "ChIJE1VYhAIP2jERvjMfRhXEKjA",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Song Play",
      "author_url": "https://www.google.com/maps/contrib/107413852001563893356/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWn7OQHxANaGdf1AGU-JBZJi5Yhk9smEuxqO-0AKoiCwPkhjk1T=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "The teacher is very kind, lively and energetic. She makes lots of informative, useful notes as well. The atmosphere in the class is good which makes students comfortable. My daughter mange to get AL1 for both Mathematics and Science.  The class room is clean and tidy, would recommend. 👍",
      "time": 1734360638,
      "translated": false
    },
    {
      "author_name": "Darren Chen",
      "author_url": "https://www.google.com/maps/contrib/104080497697813611558/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKku1no0Dip0rAKBnZ5uTNjG0vE5mGsaKc4sdVCvDWAMIodnog=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "5 Stars 🌟 tuition center covers PSLE syllabus thoroughly while also focusing on conceptual clarity. They strike a balance between helping both my kids to excel in exams and fostering a deep understanding of the subject matter. Supplementary materials, regular assessments, and past paper discussions ensure they are well-prepared for tests and competitive exams. 👍",
      "time": 1732146909,
      "translated": false
    },
    {
      "author_name": "Esha Kiran",
      "author_url": "https://www.google.com/maps/contrib/114530994368126302781/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJTh7izWDlAvYGJJslY0iQvBGJFvZQ5yCQzTScTvoNH0AfAYw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I am an ex-student currently studying at Catholic Junior College. I came to Five Star Tuition Centre for English and Science. The teachers are incredibly energetic and lively, making every class engaging and enjoyable. They go above and beyond to ensure we thoroughly understand the topics.\n\nThe In-house worksheets and detailed notes are thoughtfully crafted, helping us grasp complex concepts easily. What stands out is the personalized attention given to each student even though classes were for 1.5 hours, which greatly boosted my confidence and performance. Workshops were also specially and carefully planned out by Ms Mani, providing us with detailed materials while pushing us beyond our limits. She even went the extra mile by teaching us advanced concepts and new knowledge beyond the regular syllabus.\n\nThe centre's supportive and encouraging environment made learning a truly enriching experience. I am truly grateful for the dedication and hard work of the teachers, who made a significant difference in my academic journey.",
      "time": 1738333070,
      "translated": false
    },
    {
      "author_name": "haridha rameshkumar",
      "author_url": "https://www.google.com/maps/contrib/101229563693866417373/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUzpgEl30oTXJ9ZP6_NU-ETkBZPTk63JwOcX_Pf1VnwHKDqdQWO=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I am an ex student of Five Start tuition, studying at Catholic junior college. I studied English and English here. The teachers there are very engaging and taught us everything step by step. They also motivate and inspire us every lesson. This made me improve my grades drastically and I am forever grateful for that. Mdm Mani also provides us workshops during our holidays to teach us advanced concepts and improve our performance. So I highly recommend Five Star Tuition ⭐.",
      "time": 1738471156,
      "translated": false
    },
    {
      "author_name": "Siang Huat Lim",
      "author_url": "https://www.google.com/maps/contrib/103264310816773794955/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI8sTMmBHfcrf6oH2X6qeIEACjkoOv6uT3vN_H8-QTRVjNM2A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "We are so blessed with a team of dedicated and responsible tutors at Five Star Tuition to teach my P6 twins. The Centre provided very detailed notes and materials to ensure they are well prepared for PSLE. My girl’s math result has improved much after joining the math class, and that helped boost her confidence in the subject, which she used to hate. On top of that, extra workshops were arranged for the students during public holidays to further enhance the learning, at NO extra cost. We are very grateful for what the Centre has done for the kids. A highly recommended tuition centre that truly deserves a five-star rating!",
      "time": 1732794178,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3470802058492195774",
  "user_ratings_total": 75,
  "vicinity": "BLK 323 Tah Ching Road, #01-62"
}