{
  "formatted_address": "24 New Industrial Rd, INSPACE, Singapore 536210",
  "geometry": {
    "location": {
      "lat": 1.3442808,
      "lng": 103.886479
    },
    "viewport": {
      "northeast": {
        "lat": 1.345661880291502,
        "lng": 103.8877477802915
      },
      "southwest": {
        "lat": 1.342963919708498,
        "lng": 103.8850498197085
      }
    }
  },
  "name": "Floral Magic",
  "place_id": "ChIJS1xHirwZ2jERVHiWbYs891Y",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Natalie L",
      "author_url": "https://www.google.com/maps/contrib/117649663139203610996/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJWLr2nZbFbH9ymAhKGSfuwUSf8QlZ3mRYVeJIQgqhiKgjmzw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Floral Magic is my go-to florist and I trust the team there wholeheartedly with their creations. It goes without saying that I had to get my bouquet, boutonnières and wrist corsages from them for my wedding day, and the team nailed the brief (cascading bouquet, colour palette of pinks with the inclusion of calla lilies). When you ask me what I loved about my wedding day, the bouquet was definitely one of my key highlights. It was just so pretty and completely the whole look! I really appreciated how the entire bouquet was cascading seamlessly, even the calla lilies. I got a ton of compliments on the bouquet as well!",
      "time": 1737266336,
      "translated": false
    },
    {
      "author_name": "Marjorie Lee",
      "author_url": "https://www.google.com/maps/contrib/110796759014208681818/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWiaSm-b9jo1_q1qg479sYRFjP4LWCV3qiCaa0uEDNsdh-IBKUX=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Had Floral Magic do my wedding florals- a bouquet and deconstructed arch. I did not have the budget for more floral pieces but just these two items had gorgeous visual impact,  it didn't matter. Their designs exceeded my expectations and I was literally wow-ed when I first walked into the venue and saw the flowers. They also included dreamy dahlias at my request. Floral Magic really put together what I envisioned and more. Highly recommend!",
      "time": 1731497307,
      "translated": false
    },
    {
      "author_name": "applebee tea",
      "author_url": "https://www.google.com/maps/contrib/112195938378344306426/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocITAUhqDbMDHm339Qs5EYyVj3zo_gG1Wf9po_0y2qM_UXxF9w=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I've ordered flowers from Floral Magic  before and it never disappoints!\n\nThis time it was for my mom and the team listened to the request (fragrant and elegant). My mom loved the bouquet and the first thing she mentioned to me was that it was so fragrant! And a surprise to find a hidden hydrangea inside as well 😂 ( I ordered a medium size, to manage anyone's expectation.)\n\nOnline order is simple and straightforward. If you are overseas and want to surprise someone back home, I would highly recommend ordering flowers from floral magic.",
      "time": 1698631821,
      "translated": false
    },
    {
      "author_name": "Jingyi Peng",
      "author_url": "https://www.google.com/maps/contrib/100282731980990361616/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLwWImyQBRTXA7f95Ou9xJCfHuNuNBgvUMSuAFUdMk2is25Sg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Florals hold great significance for us in our wedding. We had a vision of what we wanted and shared it with Floral Magic along with reference photos and descriptors. Along the co-creation process, though there was no mock up, Linnette and team worked hard on the design, choice of foliage and flowers, and we trusted them to eventually bring our vision to life.\n\nBeyond all expectations, the installations turned out so lush and breathtakingly beautiful and truly transformed the wedding venue bringing the outdoors indoor. All our guests also heaped praises on the decor. We only wished we could have more time to take in all its beauty on the wedding day, and we had guests bring home as many flowers from the installations as they liked (or their hands could carry) which they greatly appreciated!\n\nThe bouquet was also outstanding, artsy, and unique and we loved it.\n\nThanks once again Floral Magic, we’ll be reminiscing about the awe-inspiring floral masterpieces for years to come! :)",
      "time": 1694438103,
      "translated": false
    },
    {
      "author_name": "Melissa Yeo",
      "author_url": "https://www.google.com/maps/contrib/100149730954953718376/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUHnbXP9qxMRWQqX_oHopIfBnGP9zssO2MGMzYzNh64lFX1oE3m=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Linnette and her team blew us away with our wedding florals! They understood what we were going for and they were really professional and accommodating. The execution was even more beautiful than we could have imagined. Thanks for bringing our dream wedding to life!",
      "time": 1690431320,
      "translated": false
    }
  ],
  "types": [
    "florist",
    "store",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6266543976046032980",
  "user_ratings_total": 36,
  "vicinity": "24 New Industrial Road, INSPACE"
}