{
  "formatted_address": "255 Balestier Rd, Singapore 329710",
  "geometry": {
    "location": {
      "lat": 1.321937,
      "lng": 103.8527077
    },
    "viewport": {
      "northeast": {
        "lat": 1.323338030291502,
        "lng": 103.8541096302915
      },
      "southwest": {
        "lat": 1.320640069708498,
        "lng": 103.8514116697085
      }
    }
  },
  "name": "Fragrance Hotel - Balestier",
  "place_id": "ChIJfdwFY9kZ2jERDDKGCvKXT_w",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Jamie lee Malinit",
      "author_url": "https://www.google.com/maps/contrib/102466803262240666166/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL8okujsuth47XxDHyAbnhS5s9V28UIbV67bCf8tJY2eAdM=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "A Great Stay Despite the Cozy Quarters!\nWe recently stayed at this hotel and were thoroughly impressed with the service and convenience it offered. From the moment we arrived, the reception staff were fantastic – welcoming, efficient, and always ready to assist with a smile.\nOne aspect that truly stood out was the impeccable housekeeping. Every day, we returned to a spotless and tidied room, which made our stay so much more comfortable and enjoyable. It's clear that the housekeeping team takes great pride in their work.\nThe location is also a major plus. Being just a two-minute walk from the bus station made getting around incredibly easy and convenient for exploring the area. This accessibility was a huge benefit for us.\nWhile the room itself was on the smaller side, it was undeniably clean and well-maintained. More importantly, we slept very well, which is always a top priority when traveling.\nA quirky but appreciated bonus was the orange juice vending machine just outside the hotel. It was a refreshing and convenient option for a quick drink. Additionally, the abundance of mini marts in the vicinity made it easy to grab snacks and essentials.\nDespite the compact room size, the excellent service, convenient location, and cleanliness made our stay a positive one. We highly recommend this hotel for travelers looking for a well-serviced and conveniently located base, especially if you prioritize cleanliness and easy access to public transport. We would definitely consider staying here again!",
      "time": 1744616689,
      "translated": false
    },
    {
      "author_name": "Chun Li (Lili)",
      "author_url": "https://www.google.com/maps/contrib/110565360810462307345/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWascr_t-ed9llu1dtKW-jT2FDGKJXDOX992pbmnQc1uEOsXoaaKA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "Really good value room in SH market, even tho the location is a bit far from center, but it’s like 20 mins by bus, which is very nice and convenient.\nRoom is clean and better than I expected!\nEnough room for 2 peeps walk around and have a small sofa to chill during the night.\n\nThe staffs are very friendly and welcoming. Provides good service and we all satisfied!\nShout out to Alan, Chris, Leon and Hidayah, this trip became nicer because of you! Appreciate to everything! We had a great stay here with you !",
      "time": 1747411882,
      "translated": false
    },
    {
      "author_name": "Eden Joyce Arenasa",
      "author_url": "https://www.google.com/maps/contrib/100866856267410671577/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX9DTtBZ-A4oeTEqaZiosfD6gKvLFOFjvK9iSP5S-nEWeByYdP3dA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "I had a great stay! The staff were incredibly accommodating—always friendly and ready to help with anything I needed; special mention to Alan, Neo, and Chole. Room service was prompt and the food consistently hit the spot. Overall, a smooth and pleasant experience that made me feel well taken care of.",
      "time": 1745756505,
      "translated": false
    },
    {
      "author_name": "Gulshan Gattani",
      "author_url": "https://www.google.com/maps/contrib/112608926041316826795/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJY_VLSkdXX9PjtcfX0AMbhXJdwDsrhsTiFe_z5Dje9AGGtZw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "The team here - Steven, Kei Wee, Aaron were very courteous and helpful in our entire stay. Of course the rooms are small but they are as advertised. Location of the hotel is quite central and well connected to majority of the bus routes. The room servicing is done very promptly and hygiene standards are high. We definitely plan to visit again. Well done team!",
      "time": 1734746682,
      "translated": false
    },
    {
      "author_name": "APRIL ROSE GARCIA",
      "author_url": "https://www.google.com/maps/contrib/107981114306759398934/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK_eD8VrgHofa0QlBKtB-cyVur9eqCrG4MJiVemBraY4TasYg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "The hotel is very near to bus stations. The staff are very accommodating as well especially Alan, Neo, Chloe. They're very smiling and friendly.\nWanna book again if given a chance to go back in Singapore.",
      "time": 1745756298,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=18180917286532428300",
  "user_ratings_total": 695,
  "vicinity": "255 Balestier Road"
}