{
  "formatted_address": "1 HarbourFront Walk, B2-K20 VivoCity, Singapore 098585",
  "geometry": {
    "location": {
      "lat": 1.2643589,
      "lng": 103.8223196
    },
    "viewport": {
      "northeast": {
        "lat": 1.265581730291502,
        "lng": 103.8230483
      },
      "southwest": {
        "lat": 1.262883769708498,
        "lng": 103.8201335
      }
    }
  },
  "name": "Frozen Heart Fried Gelato (VivoCity)",
  "place_id": "ChIJw1ktXAAZ2jERYDrBiZma3Js",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Caren Kang",
      "author_url": "https://www.google.com/maps/contrib/117754085997728549472/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLJH5jkO1adrvGZc5Rl8hN98bC7nxPOW12Gn-47lYwQXiS-dA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "The fried bread and ice cream combo is perfect. Tried vanilla, mango passion fruit and sea salt + peanut. All flavors hit the spot,   but vanilla gave the best results together with the fruit spread (yum!) and toppings. The honey pearls are a must! Will totally come again.",
      "time": 1739286165,
      "translated": false
    },
    {
      "author_name": "Victor Lim",
      "author_url": "https://www.google.com/maps/contrib/110942451698324538503/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVzVZb1eacZkOxUQggxMK0wjHXZfg5RwUAKntEOxfKfUnHRNImH=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "If you're seeking a delightful dessert adventure in Singapore, look no further than the newly opened Frozen Heart Fried Gelato outlet at VivoCity. As the world's exclusive fried ice cream chain, Frozen Heart expertly adheres to the traditional Italian ice cream production process while continuously innovating to elevate flavor and quality. ❤️❤️\n\nTheir Fried Gelato is a standout creation, offering a guilt-free indulgence that doesn’t skimp on taste. Made with only the finest ingredients, the gelato core features real fruit, delivering fresh, authentic flavors. The crispy exterior adds a satisfying crunch, beautifully complemented by ITQI-certified jams, chewy pearls, and crunchy crumbs. This harmonious blend of textures and flavors truly redefines dessert. Plus, with low-sugar, low-calorie recipes, you can enjoy these treats without the guilt. 😍😍\n\nAt Frozen Heart VivoCity, you can discover the magic of Fried Gelato—a perfect fusion of crispy and creamy that will tantalize your taste buds. Each bite is an explosion of flavor, whether you choose classic Vanilla or adventurous options like Golden Pillow Durian. The featured flavors are exquisite: indulge in the luxurious Musang King Durian, or enjoy the refreshing Apple Blueberry combination of blueberry, apple, and lemon. Other tempting choices include Sea Salt Peanut, Taiwan Top Fresh Strawberry, and the tropical delight of Taiwan Mango Yogurt Passion Fruit. Each dessert is crafted with precision and love, promising an unforgettable experience for dessert enthusiasts. 😍😍😍\n\nAnd the excitement doesn't end here! Stay tuned as Frozen Heart continues to introduce new, mouthwatering toppings that will keep your taste buds on their toes. Whether you lean towards fruity jams or chewy pearls, the team is constantly innovating to make your dessert experience truly memorable. 🤩🤩",
      "time": 1735726594,
      "translated": false
    },
    {
      "author_name": "Charles Goh",
      "author_url": "https://www.google.com/maps/contrib/100962611140580591006/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUphjxz-jjRgN7kiVhthQVtxalmuHPjCZXNe-qd73vhJDnTSldQTA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Really tasty combination of crisp yet fluffy fried bread and yummy Gelato! We had a bunch of different flavors which were all good. The durian ice cream was pretty good, but we also liked classic flavors like chocolate, vanilla and mint chocolate.\n\nFriendly and quick service too!",
      "time": 1735982731,
      "translated": false
    },
    {
      "author_name": "Nomninjas",
      "author_url": "https://www.google.com/maps/contrib/110396514254810116452/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU5CgLEGwOL2gCOZoroTZKNX3xvU7e_c17EArOmvAw9LrrcOXzS=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "check out @nomninjas on instagram, facebook, lemon8 for more!\ncredit when photos used.\n….\nFried ice cream used to be my favorite chinese dessert at Ban Heng but they don’t have it anymore 😤😭 so i was so happy that frozen heart offers it in Singapore from Taiwan! tried the one at Jewel but Vivocity is even better with more flavors and toppings! highly recommend the honey pearls so so sweet and chewy good!🥰💕 For gelato, the mint chocolate and oreo really goes damn well 😍💯 For the price, it’s really quite reasonable since ban heng was selling it at $10 (i clearly remember cos i really love it and that’s before covid) so yes give it a try guys!",
      "time": 1735397637,
      "translated": false
    },
    {
      "author_name": "Alessandra Nutter",
      "author_url": "https://www.google.com/maps/contrib/108956510832674651199/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWBUcbUYzOO4XvAcuhcaNJfnfgE4Mp357Xp5hzXs0paTrsXq-pC=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "My kids enjoy this a fair bit after we tried it a while ago. It is now a must go when we visit VIVOCITY.\n\nI didn’t care for trying it but I was glad I gave it a shot, the bread is particularly unassuming but it was really a pleasant surprise.\nWe ordered the Mint chocolate, strawberry and vanilla and enjoyed them all thoroughly.\n\nThe service from the Uncle was stellar and he was patient with the kids! Go visit if you haven’t!",
      "time": 1743602755,
      "translated": false
    }
  ],
  "types": [
    "meal_takeaway",
    "restaurant",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11231021554986990176",
  "user_ratings_total": 51,
  "vicinity": "1 HarbourFront Walk, B2-K20 VivoCity"
}