{
  "formatted_address": "181 Orchard Rd, #04-22 Orchard Central Singapore 238896",
  "geometry": {
    "location": {
      "lat": 1.3006242,
      "lng": 103.8398658
    },
    "viewport": {
      "northeast": {
        "lat": 1.302134130291502,
        "lng": 103.8412616302915
      },
      "southwest": {
        "lat": 1.299436169708498,
        "lng": 103.8385636697085
      }
    }
  },
  "name": "FYP (For You People) Cafe - Orchard Central",
  "place_id": "ChIJz7qsovsZ2jEReceD5SD9FYQ",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Ewe Keat Huan",
      "author_url": "https://www.google.com/maps/contrib/103626082513610890905/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVcpEkpp4b_KaWygB0NfRxr1geo73o12xphky_CrUovf85LgjzQLw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Overall Rating: 4.5/5\n\nIf you’re looking for a trendy spot in Orchard to hang out with friends, FYP Cafe is a must-visit. The ambiance blends the aesthetic charm of Whiskdom with the indulgent comfort of Big Big Fries, making it a cozy yet lively hangout spot.\n\nFood: 4.5/5\nThe smoked salmon spaghetti was the highlight — perfectly cooked pasta with a generous serving of smoked salmon, tossed in a creamy, savory sauce that wasn't too heavy. It struck a great balance of flavor and portion. Definitely looking forward to trying their bagels on the next visit — they look delicious!\n\nDrinks: 4.5/5\nTheir matcha latte is a standout — smooth, rich, and not overly sweet, just how matcha lovers like it. The strawberry fizzy drink was refreshing with just the right amount of sweetness and fizz, perfect for a hot day or a light complement to your meal.\n\nAmbience: 5/5\nThe interior is bright, clean, and Instagram-worthy with casual seating that invites you to linger. Whether you're there for a quick bite or a long chat, it feels welcoming and laid-back.\n\nService: 4/5\nFriendly and attentive staff who were happy to recommend dishes and serve quickly, even during busy hours. The only minor point was a short wait for food, but it was worth it.\n\nFinal Thoughts:\nFYP Cafe nails the vibe — good food, great drinks, and a perfect place to chill out. It’s ideal for casual meetups, solo coffee runs, or even catching up on work with your laptop.\nWill definitely be back to try their bagels next time!",
      "time": 1746404855,
      "translated": false
    },
    {
      "author_name": "Dru Lu",
      "author_url": "https://www.google.com/maps/contrib/115927493800245457440/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWmVFS1biEig1iBfP74zrNgvGpzc5UU6zKopz5pbeHtDmi4iUp6=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Really like the relaxing vibe here. Hiding away in the corner of orchard central. The camping gear style seating area I guess it’s what made it feel super relaxing. Tiramisu is good!",
      "time": 1745130625,
      "translated": false
    },
    {
      "author_name": "YT",
      "author_url": "https://www.google.com/maps/contrib/116335289933602715039/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVSx0tz-qw4QskVbpYXe4V_L4o3aFYxa3ZZsugq73pGTwz8dHZA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Visited this place and tried the salmon avocado bagel, and I was honestly so surprised by how good it was! I didn’t have high expectations initially, since it’s not a dedicated bagel house, but it completely exceeded my expectations. The bagel was really damn good—so flavorful and satisfying that I finished the whole thing without hesitation.\n\nI also tried the brownies and cookies, and they were just as impressive. Not overly sweet, with a perfectly balanced flavor, making them a great complement to the meal.\n\nThe café vibes were another highlight. It gives off a really unique camping-style atmosphere that feels super cozy and inviting. It’s the perfect spot if you’re looking for a comfortable place to work, study, or just relax while enjoying a good meal.\n\nOverall, I really, really recommend this place. The food, the vibes, and the overall experience were all top-notch. Definitely worth a visit!",
      "time": 1734428619,
      "translated": false
    },
    {
      "author_name": "Cindy",
      "author_url": "https://www.google.com/maps/contrib/105424454464372696894/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX73QVPP0WkQPZWROFSrXA2-k7u9nHI-NNkxZYtbk5w_qNfbLnS=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 3,
      "relative_time_description": "5 months ago",
      "text": "Queue for quite some time. The staff asked us to stand at the corner and wait first. We saw a few groups of customers already finished their meals but just sit there for very long and chit chat. I think the staffs also feel bad to ask them to leave so ended up we keep on waiting. Like the Tom yam pasta and the strawberry matcha latte. The Tater tots were not warm and crispy at all, it’s quite soggy too. Minus 2 stars for the waiting time and Tater tots.",
      "time": 1733655290,
      "translated": false
    },
    {
      "author_name": "Jane Ng",
      "author_url": "https://www.google.com/maps/contrib/106553762946403195662/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWYIiUZHk4KsYmH_oUDSnMFhRlwJW2E5o2iXeoMsxRv-ZOntvs=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "Had an early Christmas Dinner with Vivian and had a better chat. Glad to know her from an external course that our HR had organized. It's also \"get to know\" your colleague more kind, and make new friends from there. 😂\n\nOh well, we went @fyp.cafe and headed home after. We initially thought it would be lesser people but well, it's quite packed for a dinner.\n\nGet to try the @bigbigfries there too, heard them had a collaboration with the cafe @whiskdom! A plate of Big Big Fries ($12.90) is mandatory. We had the Truffle Mayonnaise and Nacho Cheese. As for the burger, we opt for the Seoul Spicy Chicken Burger, we felt that the burger top layer is rather hard, but other than that everything is alright. Tasty and not bad to try!",
      "time": 1735180784,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "bakery",
    "food",
    "store",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9517791705248810873",
  "user_ratings_total": 220,
  "vicinity": "181 Orchard Road, #04-22 Orchard Central"
}