{
  "formatted_address": "72 Loewen Rd, Dempsey Hill, Singapore 248848",
  "geometry": {
    "location": {
      "lat": 1.3015782,
      "lng": 103.8118368
    },
    "viewport": {
      "northeast": {
        "lat": 1.303018180291502,
        "lng": 103.8132166802915
      },
      "southwest": {
        "lat": 1.300320219708498,
        "lng": 103.8105187197085
      }
    }
  },
  "name": "GATE Junior - Dempsey Hill",
  "place_id": "ChIJ__8P5iQa2jER16n4yFzgVyI",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Em",
      "author_url": "https://www.google.com/maps/contrib/112274434084808015605/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKP5XgY0XEIX_gzOVKfJqfhzrDRQykOTi7Mf8L_NRBPTUx8Vw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "GATE Junior has really incredible teachers and offers an exciting curriculum. Our children are with their PG and K1 program, and we can see them thriving.\n\nThe teachers are knowledgeable, highly skilled and passionate. Academics aside, they are kind and genuinely care about each child's individual needs and growth. They have an exceptional ability to connect with our children, gaining their trust, nurturing a safe environment and holding space. Our children speak fondly of their teachers and would even mention their names when engaging in imaginary play at home.\n\nThe curriculum is thoughtfully designed to promote academic development by encouraging curiosity, critical thinking, creativity and collaboration. We appreciate how they incorporate arts and crafts, music and even outdoor experiences to aid in their learning and exploration. Our children would share the interesting topics they learnt in school, random fun facts even during weekends and can articulate about what they learnt.\n\nOur 2YO PG has developed incredible independence and confidence - she is able to count in English and Mandarin up to 2 digits, string sentences with clear enunciation, and identify numbers and alphabets. She enjoys the hands-on learning e.g. baking and crafts.\n\nOur K1 recently went for his first Holiday Camp at Dempsey and thoroughly enjoyed it. He shared that he learnt a lot, and liked how it was delivered - even his least favourite subject felt so enjoyable and he was very proud of the materials and art works he made. Would definitely recommend this to parents who may be considering alternative holiday programs.\n\nIf you're looking for a place where your child can socialise, learn, explore, and flourish, GATE junior is an underrated gem! Unsolicited but necessary review in hopes that this will help other parents.",
      "time": 1743758403,
      "translated": false
    },
    {
      "author_name": "michelle goh",
      "author_url": "https://www.google.com/maps/contrib/108684714333799894729/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJU1Foxz_0t_2cZXg25M-qngVPxJDW_9-dkgXIGRpr0Jqf4oQ=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "3 weeks ago",
      "text": "Been with the school for 7 years but increasingly disappointed with their level of service and how they handle safety matters. There is a lack of patience and empathy. My kid was also injured twice in 6 weeks during  separate incidents.",
      "time": 1745823002,
      "translated": false
    },
    {
      "author_name": "Loh Family",
      "author_url": "https://www.google.com/maps/contrib/111660251469223290335/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX4H5fHNwp32FH9MkzLypHT5S4KRpB2No6op6oXm1Ug9_WnisR2VQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "I switched my daughter to this school as she’s more advanced than what the other kindergartens were teaching. My initial worry was the small campus and if she would be bored in a smaller facility. Turns out that she loves the school and was very engaged everyday, sharing with me the number of stars she has accumulated to exchange for gifts. The program stimulates her intellectually. She has graduated and is still going back to Gate for afternoon classes.",
      "time": 1708315954,
      "translated": false
    },
    {
      "author_name": "Kate Schlager",
      "author_url": "https://www.google.com/maps/contrib/114608951230482416460/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKezc_qFGYcQkUT2YRN8AnfF7wv7R4sDoB0bSj0q3SCJKvNrA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "The best childcare in Singapore where your child won’t miss any chance to learn.\nAfter changing a few popular Franchises kindergartens,  we finally found the place that fitted  perfectly for our kid. He loved  to go to school so much and after each term we got back what they have learnt and it gave me a shock! It’s huge amount of information. Their materials are just so good. Our boy were only here for a half day program but it covered most of things, you don’t need to put your kid to any enrichment class. He has been always eager and so proud when talking about his School. Surprisingly not so many people / parents know about it. Certainly they keep the amount of kids small and the seats are limited to maintain  quality.\nLocation is just great, surrounded by all green gardens…\nI usually did a jog after dropping him off. Sadly Friday was his last day of kindergarten and He misses his teachers and friends..so much 😞\nWe will be back for the school camps and after school programs.\nHighly recommended to all parents.\n\nThanks GATE Junior for creating an environment of enthusiasm for learning, appreciation and motivation.\n\nMuch love",
      "time": 1669022177,
      "translated": false
    },
    {
      "author_name": "Du Wan Qi",
      "author_url": "https://www.google.com/maps/contrib/101859613724446254274/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXsfRv3cl2EYzwLZExZau0z8MiZ2e3XWHJj8e6Z-49wsikZD650=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Gate Junior is the wonderful preschool and I recommend parents who really seek for a learning environment for their children.",
      "time": 1731986628,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2474693209376729559",
  "user_ratings_total": 15,
  "vicinity": "72 Loewen Road, Dempsey Hill"
}