{
  "formatted_address": "Block 208C Clementi Ave 6, Singapore 123208",
  "geometry": {
    "location": {
      "lat": 1.3219466,
      "lng": 103.7622214
    },
    "viewport": {
      "northeast": {
        "lat": 1.323296830291502,
        "lng": 103.7635035302915
      },
      "southwest": {
        "lat": 1.320598869708498,
        "lng": 103.7608055697085
      }
    }
  },
  "name": "GBL Eating House (formerly known as Tiang Seng)",
  "place_id": "ChIJYRhL51Qb2jERb0C_w76-vm0",
  "rating": 3.9,
  "reviews": [
    {
      "author_name": "Yong Hui, Ronny Tan",
      "author_url": "https://www.google.com/maps/contrib/112103854866816776797/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIW-EUd0OO-lV8C0jo1OAnng5oZQVGOxCS6CHSN4Lgss1sgkA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "- Smaller in size than some other coffeeshops. No chicken rice or  wanton noodles stall.\n\n+ Located in quiet hidden corner of the estate. Less hot and expensive compared to the other nearby coffeeshop at 209B Clementi Ave 6.\n\n+ Ample sheltered MSCP parking next door.",
      "time": 1737081953,
      "translated": false
    },
    {
      "author_name": "Jon L",
      "author_url": "https://www.google.com/maps/contrib/110851791703403572986/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLoKca4b8WMictkMPaZ-chrMO3haBwNbOSjggBKJOW6RWIp6w=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "25 Jan 2023: South Indian stall changed their chef and the curry now kinda salty and pratas not as buttery\n\n21 Dec 2023: sad that North Indian has left. But now in its place is a South Indian food. I tried their pratas, and it was great! Very big pieces, and very fragrant, I think can only put that down to good amount of ghee! Makes it so buttery soft inside but crispy outside. And nice curry! I had the yellow dal curry.\n\n10 December 2023: there’s a new malay food stall but apparently they have been famously good for quite some time. This new stall here called Haryati’s kitchen served up really good nasi lemak with a nice hint of lemongrass, good in that it is not overpowering, just strong enough to delight! I added a couple more side dishes to their $4 nasi lemak set… couldn’t stop even though my brain is going I am overeating. And nice sweet chili with heat!\n\n21 Mar 2023: so today I tried the roti prata from indian stall. It is slightly different from those we have come to love. So I asked how they do prata because I don’t see any hot plate in the stall. I learned that they use the tandoor, so the prata here is not fried but kinda baked, like pizza. There’s definitely more fats in the prata so it is richer and of softer texture. With the pan fried ones, we get really crispy ones where the prata uncle needs to clap the pratas at the end to break up the crispness and lift up the pratas, while the ones here are scooped up from inside the tandoor and the surface of the prata is crispy while the inside is soft like bread. The curry sauce is also very rich and fragrant, almost like French onion soup as there’s rather rich onion taste but with chickeny flavor.\n\n17 Mar 2023: new Indian stall finally opened. I had the chicken biryani… wow… it is very good. Love that fragrant rice, very nice balanced spice mix of cardamom, star anise, clove, nutmeg, their food didnt just look the part, with just what seems like the right pleasing color and rice grains nicely separated. This is restaurant quality. I am very happy to have such good food I can have often. 👍👍👍👍👍\n\n4 Mar 2023: fish soup uncle also sells char bee hoon in the morning, a nice surprise as I thought I can only have my usual bread toast and coffee. Very nice flavor to the bee hoon! Saw a new stall’s poster all up, authentic Indian restaurant. I look forward to their opening.\n\n3 Mar 2023: another new stall, a fish soup. Nice to have fish soup back here again! Tried the saba and the fish two ways. Nice!\n\n18 Feb 2023:\nThere’s a new stall, a fried rice specialty stall. I borrowed one thumb to give this good three thumbs up! Several styles to choose from, I had the Singapore style and the Hong Kong XO style. Latter very spicy but shiok! Singapore style is like the ding tai fong egg fried rice\n\n(Malay stall has closed down)\n4 Aug 2022: malay stall has new dinner item, Mee Bak so with chicken or beef meatballs. I requested for mixed balls 😄 very nice clear soup, flavorful and light, not heavy. The freshly made red and green chili condiments made the soup even more zesty and delicious! Nice meatballs too, rather tender\n\n(Western has closed down)\n21 Jun 2022: New stall opens today, very happy when there’s more food options here!\nHad their chicken cutlet that came with fries, coleslaw, bbq beans and a huuuuuuge piece of chicken! I know I use this word too many times, but it is what it is, very satisfying! By two very friendly youthful chefs. Just wanna say also the bbq beans seems totally “homemade”, not straight from the can type. Very delicious 😋\n\nVery nice coffeeshop, very clean and well ventilated, bright and breezy, to enjoy a nice meal!\nI have tried the tze char here, had their fried rice and various noodle dishes like hor fun, Sang mee, hokkien mee, Mee goreng. Very satisfying portion and good taste. Love their har Cheong gai, very puffy crispy light batter with nice amount of prawn paste taste! Love also their charcoal fish soup in steamboat, very tasty soup and generous amount of fish and veggies. Also worth trying are their fish head curry, and fish head claypot…",
      "time": 1706145781,
      "translated": false
    },
    {
      "author_name": "loli sit",
      "author_url": "https://www.google.com/maps/contrib/100117317859474879893/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJpqB4c-FS1e2wgKuQ3QD40E0GV-FymkrtgzJxWI60uTAml7g=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Been patrolling them every 2-3 days once lol since they are reopen like 1 year ago? our fav-tzechar stall: seafood frice rice, hong kong fried noodle, moonlight river, fried tanghoon, sambal potato leaves, curry fried pork etc♥️ (love their sambal for dipping!!) now even nicer with new chef we felt so lucky!! Bakchormee stall-bakchormee and dry meesua♥️, Chicken rice stall-roasted meat, roasted and white chicken (love their chilli and peanut soup!) Toast and kopi c also not bad. Lastime tried their mookata and yeemee also quite good. Mixed rice stall also our daily fav esp during WFH, but sometimes esp night time not many dishes and choices:( Overall good, quite clean and nice environment. It is a gem! Happy to share this place with other Clementi ppl!",
      "time": 1646655931,
      "translated": false
    },
    {
      "author_name": "Ivy Poon",
      "author_url": "https://www.google.com/maps/contrib/111185101717216248399/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIIeiAMqvOZ-903RUsyQm34ecgYQGZSNjICnkVI4fnesBz2pQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Very secret eating place for pple living here. The service and prices are very reasonable. My family always come here for the 虾米四季豆and Assam fish. The taste of the string beans is the best rendition of this dish. Assam fish is not very spicy even kids or elderly can eat, very appetising and tender.",
      "time": 1707023730,
      "translated": false
    },
    {
      "author_name": "Patrick Choh",
      "author_url": "https://www.google.com/maps/contrib/116292394727494283801/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIsOfzPLxC0ds7KjmU7ppf6uSWGYWdLEuw09RDe1IYb1a9B5Q=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Rolling jp food, one man show, great tasting n great presentation, hv a rolling good time here 👍🐟🐟🐠",
      "time": 1742103504,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7907967722246324335",
  "user_ratings_total": 55,
  "vicinity": "Block 208C Clementi Avenue 6"
}