{
  "formatted_address": "79 Anson Rd, Level 20, Singapore 079906",
  "geometry": {
    "location": {
      "lat": 1.2742752,
      "lng": 103.8456739
    },
    "viewport": {
      "northeast": {
        "lat": 1.275728980291502,
        "lng": 103.8468994302915
      },
      "southwest": {
        "lat": 1.273031019708498,
        "lng": 103.8442014697085
      }
    }
  },
  "name": "General Assembly",
  "place_id": "ChIJJQO8m20Z2jERyupuwJZM3Tk",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Kenneth Koh",
      "author_url": "https://www.google.com/maps/contrib/103824868906491486995/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXQWWTGREEgXjCayLbg7juYMG-GksmG1pURLKT5aWbYPjAfMCMliA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I enrolled with General Assembly (GA) Software Immersive in the hopes of further enhancing my surface level knowledge of programming, and I got far more than I thought, all thanks to the patient instructors (shout out to Desmond, who is a brilliant instructor) and staff who try their best to be inclusive for everyone, regardless of their skill level.\n\nThe facilities are well designed and maintained for a conducive environment.\n\nThe difficulty is indeed steep with the timeframe of only 4 months to learn Javascript, Python, SQL that expands into their contemporary advanced libraries like React or Django, however if you paid money for a course with GA, you should be prepared to sacrifice a bit of time and freedom because it ain't easy.\n\nYour mileage will certainly vary given the job market and tech recession (writing this at end 2024, full disclaimer: I am still not a software engineer despite of my efforts), and judging from other reviews instructors' competence on teaching and guiding do make or break the experience.\n\nI still took away a very positive experience and knowledge from GA, that I greatly appreciate learning and applying it wherever I can.",
      "time": 1732017499,
      "translated": false
    },
    {
      "author_name": "Lian Kai Wu",
      "author_url": "https://www.google.com/maps/contrib/104165866200566430623/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLDeq-OxnDOnoJD8f3ZZvChvKNZwmmI6OUjsRUvj89gXHYUCg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I was the class of 43 of Software Engineering Immersive.\n\nThis course is indeed extremely fast-paced, but it has equipped me with the skills needed to solve my own programming problems. Naturally, a 12 week course will not prepare you to code the next Google, but the important skill is the problem-solving.\n\nMy instructor, Desmond, was extremely patient with the class and very willing to go above and beyond to help every student in the class. There were times when I had to consult with him well into the night, yet he never tells me that he needs to cut our consultation short. Instead making sure that I had grasped the concept.\n\nIf you are ready and willing to put in the effort for a mid-career switch, I highly recommend General Assembly.",
      "time": 1732017225,
      "translated": false
    },
    {
      "author_name": "Josiah Phua",
      "author_url": "https://www.google.com/maps/contrib/100954793005438435636/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ1TKoH1V8S7QNjwEiVTOcidrkKlYjaEOZ1O1af52Tl4_zv3Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I highly recommend General Assembly for anyone looking to learn in just 3 months. It’s fast-paced and challenging, but incredibly rewarding. The instructors are excellent, and having a dedicated teaching assistant paired with the instructor ensures you get the support you need.\n\nThis place isn’t for those looking for an easy ride—it's designed to prepare you for the ever-evolving tech industry. While it teaches you the fundamentals and how to keep learning, it’s important to know that software engineering is a journey. Even after 3 years in the field, I’m still discovering new things, and the foundation this course provided has been invaluable.\n\nOne of the best parts of the experience was meeting like-minded individuals who push you to excel and provide constructive feedback. It’s an environment that encourages growth and collaboration. I still catch up with friends I made during the course, and we often discuss how the skills we learned have applied to our jobs.\n\nIf you’re ready to challenge yourself and grow, General Assembly is a fantastic choice!",
      "time": 1731994382,
      "translated": false
    },
    {
      "author_name": "Isabelle",
      "author_url": "https://www.google.com/maps/contrib/110549647582248319388/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJhYyer9SuqQ5pQCSABDTpr7fQu_Ny6pS-f2z96XQkzHx8VIw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I had a great experience at General Assembly. Simon is an excellent instructor—knowledgeable, patient, and great at explaining complex concepts in a way that’s easy to understand. He provides valuable, actionable feedback that really helps you grow. The curriculum is well-structured, and  I’ve gained practical skills that will be useful in my career. Overall, it was a challenging but rewarding experience, and I would recommend it to anyone looking to learn software engineering.",
      "time": 1732031512,
      "translated": false
    },
    {
      "author_name": "Gabrielle N",
      "author_url": "https://www.google.com/maps/contrib/108482926075556444980/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJf62RFySu4TQju4Eyn2i82_fTnaeq0RU6_nrYUkHJZofXi5SZj=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I was in the 49th batch of GA’s Software Engineering Immersive course, and I have to say it was an  exceptional learning experience. My instructor’s passion for teaching radiates through every session, making even the most complex concepts understandable. His teaching style and commitment to student success create an environment where questions are welcomed and understanding runs deep.\n\nFor those who thrive on challenges, this course delivers in spades. Yes, it’s fast-paced and rigorous, but that’s exactly what makes it brilliant. Those late-night coding sessions now became battle stories I can tell—trading sleep for an impressive portfolio seems like a deal my future self would thank me for (and writing this review months after my course ended, I am in fact very grateful it happened!). While my coffee consumption reached new heights, the satisfaction of completing challenging projects made it all worthwhile.\n\nIf you’re looking for a course that will get you introduced into software engineering by doing projects and building your portfolio, this is it. Just remember to stock up on caffeine—you may be needing it!",
      "time": 1736887494,
      "translated": false
    }
  ],
  "types": [
    "university",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4169573040372247242",
  "user_ratings_total": 91,
  "vicinity": "79 Anson Road, Level 20"
}