{
  "formatted_address": "4 Marina Blvd, #01-31 The Sail at Marina Bay, Singapore 018986",
  "geometry": {
    "location": {
      "lat": 1.2812533,
      "lng": 103.8528303
    },
    "viewport": {
      "northeast": {
        "lat": 1.282620480291502,
        "lng": 103.8539891302915
      },
      "southwest": {
        "lat": 1.279922519708498,
        "lng": 103.8512911697085
      }
    }
  },
  "name": "Gigi Gastrobar & Bistro",
  "place_id": "ChIJTaMYx0AZ2jERt-C_eWBwz60",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Charmaine Lee",
      "author_url": "https://www.google.com/maps/contrib/115181292951450757753/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJbaRXmOGp652RzLTwzxSWYEoXthpgkVjLMB1daER0vZAp0zw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I had a wonderful dining experience. The Italian meal was absolutely delicious—authentic flavors and beautifully presented dishes that exceeded my expectations. The ambiance was cozy and perfect for a relaxed, enjoyable time. I genuinely had a great time dining here. One thing I really appreciated was how easy it was to access the place from different train stations—super convenient if you're coming by train. Highly recommend this spot for anyone looking to enjoy quality Italian food and a warm, welcoming atmosphere!",
      "time": 1744256487,
      "translated": false
    },
    {
      "author_name": "Mabel Loh",
      "author_url": "https://www.google.com/maps/contrib/107248668293925288713/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLIkLP9qouFfSX1lAQh2lBWV-krgRXE5U6jP2G0kfM_SZl2cw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Wonderful dining experience at Gigi's - one of my favourite authentic Italian spots. They make consistently delicious meals (even for takeaway!). Love the homely ambience, warm lighting and comfy seats.\n\nI've dined here and also hosted events, and the venue is perfect for all occasions. The owners Gigi and Sheryl are really kind and the minimum spend is highly reasonable.\n\nThe team is warm, really attentive and always makes us feel at home. Coupled with the delicious food, I can't wait to return to try more dishes! A hidden gem that's highly recommended!",
      "time": 1737881527,
      "translated": false
    },
    {
      "author_name": "ronnie chan",
      "author_url": "https://www.google.com/maps/contrib/106831360238977482868/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJD0BCCnIdNJkAYxlzrkbgZp_ZFTPc1PzIMr9xYI5bAtwiBdA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "We have a wonderful dinner here. The staffs are friendly and attentive. And the Italian cuisines here are excellent. I particularly love the salad with smoked duck + pear and also the pasta dish Pasta Alle Sarde. We ended our meal with really good Pistachio Panna Cotta and Tiramisu. Come and try it when you’re craving for nice Italian food.",
      "time": 1741670235,
      "translated": false
    },
    {
      "author_name": "Sheen Cher",
      "author_url": "https://www.google.com/maps/contrib/108631126783137464960/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIyh9uAa7c2751KkOlZakUJPXlegCfAn7pMyeO9VWU_DKE3JQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Fantastic experience at Gigi Gastrobar & Bistro! Loved the authentic Italian flavors. We enjoyed a variety of starters, soups, indulgent mains like ravioli, black cod, pork collar, ribeye, and lobster pizza, and ended with delicious desserts like tiramisu, panna cotta, and gelato. Great food, warm service, and a lovely ambiance—can’t wait to return!😋",
      "time": 1741447418,
      "translated": false
    },
    {
      "author_name": "Monica Mok",
      "author_url": "https://www.google.com/maps/contrib/116823865186454167985/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKb6v59o1Pss6WqZnw4fHRY1neFEn6CRgqgVOSbHYbX_T6iaA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "We had our Christmas catch up at Gigi’s this year instead of our home.\nIt was the first visit for our friends to Gigi Gastrobar & Bistro.\n\nThe festive menu was simply delicious with each dish executed to perfection.\n\nThe food truly reflects the foundation of the Italian Cuisine -  Fresh Quality ingredients.\n\nFrom appetiser, main to sweets,\nThe flavour comes through for every single dish.\nIt was mind blowing, delightful and the portion size was generous.\n\nThe Cold Tomato Gazpazo Soup with Soft & Creamy Whole Burrata for example\nwas one of my favourite.  The interplay of the bright acidity and roasted depth within the tomatoes is counterbalanced by the mild creamy burrata is silky and luscious with every spoonful. It was so fresh and inviting that I could drink this soup over and over again.\n\nBeef Tenderloin with Porcini Sauce, the lean yet succulent meat with fine buttery texture paired beautifully with the rich, nutty and slightly meaty porcini sauce. The mash potatoes with the truffle oil that comes with the tenderloin\nwas smooth, silky and seasoned to perfection.\n\nThe Cioppino Sicilian Style Fish Stew and Mixed Seafood with Black Cod Fillet reflects the effort and attentiveness by the owner and his team to extract the natural essence of the fish and shellfish.\nThe stew perfectly captures the taste of the sea.\n\nEnough Said. Seeing is believing.\nSharing some of the  photos from our food choices in the Christmas menu.\n\n31st Dec will be the last chance to savour Gigi's delightful Festive Menu.\nIf you are looking for a place to have your New Year’s Eve meal. Gigi is the venue of choice.\n\nBuon Appetito !",
      "time": 1735478159,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "bar",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12524352648402428087",
  "user_ratings_total": 96,
  "vicinity": "4 Marina Boulevard, #01-31 The Sail at Marina Bay"
}