{
  "formatted_address": "46 E Coast Rd, #03-03 Eastgate, Singapore 428766",
  "geometry": {
    "location": {
      "lat": 1.304372,
      "lng": 103.9033896
    },
    "viewport": {
      "northeast": {
        "lat": 1.305670830291502,
        "lng": 103.9046395802915
      },
      "southwest": {
        "lat": 1.302972869708498,
        "lng": 103.9019416197085
      }
    }
  },
  "name": "Global Tots Preschool - Eastgate",
  "place_id": "ChIJfV6TcHIY2jERbAv1NFjDBG4",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "sachith jayawarna",
      "author_url": "https://www.google.com/maps/contrib/112546514090265235873/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjULIgawGIuhH94bArGYSDwd3-WGoPr8KCu6QXZIpX4QYyILXXaR=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "I am a heavy dependent of google reviews.\n\nWhen I decided to put my child here, there was a very detailed one bad review. I directly questioned them is it true and what have they done to mitigate those issues.\n\nOver the time I learn that, even people who look after my child at school is also humans who can make mistakes. One day my wife was literally upset that they forgot to change pampers. We questioned them. My child is not a fan of drinking his water. Some days the water bottle seemed un touched.\n\nWhen you are with your first child, you are too worried about every tiny little detail.\n\nLynda and Tracy are very welcoming. The first class my child attended the teacher was Laoshi. I could remember she was very kind and always takes good care of the kids.\n\nOkay here are the good things.\n* convenient location\n* all indoor (even the playground /gym)\n* the food must be good 🤣 I smell nice food many days.\n\nThings to improve\n* communication is the key, so if he pooped, eat well or didn’t eat. Had a shower or not, is very important for parent who just received their child at the evening. So that they can try to do something about it.",
      "time": 1745458978,
      "translated": false
    },
    {
      "author_name": "Ivana Gacic",
      "author_url": "https://www.google.com/maps/contrib/100080603780935937869/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU6vG5xCO5qt3hBvBDtFonCsqwqd7b8KhEvpkWQagPBaPI2Duae=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "We are beyond happy that we chose this preschool for our child! When he first started, he didn’t speak any English, but thanks to the patient and dedicated teachers, he adapted quickly. Now only 6 short months later, he can communicate, form sentences, and even write! He even started to write some Mandarin characters on his own, although none of us has ever been in contact with that language before.\nThe staff is warm, supportive, and truly committed to working with each child individually. A huge thank you to the entire team for their effort and love – you have truly made a huge difference in our child's life. And a special thank you for teacher Li Su Ru who is taking extra steps in developing individual approach with him and teaching him English at his own pace.\nYou have exceeded our expectations!",
      "time": 1741139673,
      "translated": false
    },
    {
      "author_name": "Ashwin ramakrishna",
      "author_url": "https://www.google.com/maps/contrib/105911058900962463548/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWjjG9bH3WjbcK3H38bLljysnlhcCa3pSlhhWa0mikf0j36Nc_l=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Our daughter has been in Global tots since she was 3 months. We are very happy with her development and the amazingly friendly staff.\nThe teachers have been proactive in keeping us updated with her likes, dislikes, developmental milestones and keep a close eye on her progress together. Since she started taking solids, the teachers also helped in the food transition which makes it easier on us parents.",
      "time": 1735887896,
      "translated": false
    },
    {
      "author_name": "Ben boi",
      "author_url": "https://www.google.com/maps/contrib/106513557632127168345/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKItmA4LQAzTED_1dnmem7HodvdEQ99q57MUPDVHVyoHv5Tgw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Our baby girl has been with the school for more than 7 months. Thanks to the nurturing and caring staff, we have seen remarkable developments in our little one from improved motor skills to early language development.\n\nA big shoutout to Tracy and Lynda and the infant care teachers for being so positive and dedicated in leading the team in taking good care of our little one.\n\nThe school also provides regular update about our baby including feeding, napping and diaper changes. There's even a regular meet-the-parent session to have a more in-depth discussion on our baby's progress.\n\nContinue your excellent efforts in fostering this wonderful nurturing environment for our little ones. Highly recommended for working parents seeking quality care for their infants.",
      "time": 1735823465,
      "translated": false
    },
    {
      "author_name": "Heta Sampat",
      "author_url": "https://www.google.com/maps/contrib/116054137541409787847/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWCnAtsFiI7aL7qqtBxmd94gkaQ0rntgfFktHoznhqqKIiVASZ8=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "We're really happy with Globaltots at Eastgate. The teachers are warm and loving towards the baby and very responsive and accommodating to our requests. They take the time to understand the baby's cues & needs and we have seen her learn so much in their care. She goes to school smiling everyday and comes back smiling and that in itself is a testament to their center.",
      "time": 1735888464,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7927676027691928428",
  "user_ratings_total": 35,
  "vicinity": "46 East Coast Road, #03-03 Eastgate"
}