{
  "formatted_address": "321 Upper Paya Lebar Rd, Singapore 534944",
  "geometry": {
    "location": {
      "lat": 1.3449763,
      "lng": 103.8816747
    },
    "viewport": {
      "northeast": {
        "lat": 1.346277180291502,
        "lng": 103.8830465802915
      },
      "southwest": {
        "lat": 1.343579219708498,
        "lng": 103.8803486197085
      }
    }
  },
  "name": "Golden Gate Seafood Delight",
  "place_id": "ChIJz30W2JcX2jERMq5FqD2KUI0",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "Junhyuk",
      "author_url": "https://www.google.com/maps/contrib/100003085273306106033/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJfH4bt2JoervXJ_v31exLFL5iriM-SIwYggNijoORGYPXN6g=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "I recently had the opportunity to dine at this restaurant that left me both perplexed and hungry - and not in the way I had hoped. This establishment provided an unreasonably high-priced menu with minimal portions that left me feeling hungry.\n\nThe Lemon Fried Chicken and wok-fried beef with spring onion experience was a complete disaster. The scarcity of meat, dryness, and lack of freshness left me feeling utterly unsatisfied. I wouldn’t recommend this lemon fried chicken dish to anyone seeking a delicious and enjoyable meal. It was a regrettable choice. What's worse, this is recommended by waiter!!! You guess why!\n\nI left the restaurant with an unstaffed stomach, both figuratively and literally.",
      "time": 1692790201,
      "translated": false
    },
    {
      "author_name": "Joshua Sham",
      "author_url": "https://www.google.com/maps/contrib/104124993954856714465/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIayE1D2QDDQj5iv5JspRgxYYHXws3JpSyrqFG0855Lnyr9qA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "The only reason I gave the \"Atmosphere\" 4 out of 5 stars, is cos of the road works going on adjacent to the eating place.\n\nBut other than that, I couldn't wait to get a review out while I'm still chewing on my wanton. It's that good. The sauce (not overpowering), the soup (well balanced), the decent portion (enough for a 90-odd kilo foodie like me, I think) and the fresh ingredients to complete the tasty delight.\n\nYes. As you would have imagined, I had the Wanton Noodles ($4.50). It set the tone for the rest of my day and boy am I pleased.\n\nThe lady who attended to me was also relatively kind and offered to send the food to me considering the morning crowd had just eased off. I did have to decline the recommended additional noodles tho. Haha. Glad I did. This portion was just nice.\n\nNow then... the coffee. Had my usual Kopi C but trying it here for the first time. Am not sorry. Its not too sweet and the ratio of milk to coffee is just perfecto! You will need to understand that the price of $1.50 is fairly reasonable considering the location but if you want to get more value for money, have it to go - the packet portions are always substantially more 😁.\n\nAm so tempted to get another bowl of noodles but to go. Hmmmm.... I. Just. Might.",
      "time": 1691981402,
      "translated": false
    },
    {
      "author_name": "Jee Nee Lim",
      "author_url": "https://www.google.com/maps/contrib/101109994280504072291/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUZO9wipUdrcJR2Rz-H5oayMSEma-VzGJ-pzjnnTCvve3AnKvoH=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "I ordered the wanton noodles (dry with chilli). Love the entire dish - it’s like the KL style wanton noodles. The noodles are cooked just right - springy and nicely chewy. There’s a hint of sesame oil to the sauce. Char sore slices were fairly chunky (not thin slices) and quite nice too. Love the sprinkling of fired lard in the noodles. The wanton was filled generously with meat. Soup was very tasty and I love the generous dose to pepper in the soup. For me, this is one of the very very good wanton noodles stall. It’s not so well known perhaps because it’s in the coffee shop and parking can be difficult. But it’s great value and the service by the stall owners is great. The coffee shop is also clean and airy.",
      "time": 1731402947,
      "translated": false
    },
    {
      "author_name": "Mystic Glow",
      "author_url": "https://www.google.com/maps/contrib/101833960629781135340/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIVn5x8iCbXCXNJZyJNx2WSSean63MoPqHR2fTri7cGCSlT5A=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Food quality used to be much better, but has since gone southward post-covid. Now is at best average to fill the stomach out of convenience, nothing much to attract people to come specially for any dishes offered here. In our little red dot well known as a food paradise, food quality being average is simply not enough.\n\nService crew here are very helpful & friendly, perhaps because i live nearby here & they know me from the frequent visits. The rating of 2* for service is not due to the service quality of the crew here, but pulled down by the lack of transparency of prices on their menu. They keep a private tab of dish prices they have raised, without updating on the public menu.\n\nI used to buy their pineapple fried rice. Around a year ago, it was still $6. When it was raised to $6.50, the menu still showed $6. I can understand inflation, but at least paste a sticker over the original price to reflect the increased price.\n\nRecently I ordered pineapple fried rice again. While one of the staffs was collecting $6.50 from me, the lady boss rushed forward to inform her to charge $7 instead. When I queried the lady boss why the sudden price hike again, she replied the price of chicken floss has increased!?! As you can expect, the amount of chicken floss sprinkled onto the rice is a pitiful amount. Does that mean if I opt to not have any chicken floss added, she can give me a discount back to $6?\n\nI find the reason the lady boss gave for the price hike is truly unacceptable, as well as her prior reaction to her staff to collect $7 from me instead. It is not so much about the additional 50 cents, it’s the principle behind I find unacceptable, & again the lack of price transparency on the menu.",
      "time": 1715153936,
      "translated": false
    },
    {
      "author_name": "Simon Seah",
      "author_url": "https://www.google.com/maps/contrib/100509278283063972736/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIZ1pst80AYOAkArjCp9KyK6CCmDPcFVOcMB7t_0xTjs6ZVRg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "8 months ago",
      "text": "This place has become outright dishonest in terms of pricing. Beware the prices reflected in the menu is not what they will charge you. And when challenged, they will claim prices has risen and the actual price is higher now. This is not because they don't have time to update their menu as it has been a year or more that I've noticed this practice. I gave them some leeway and didn't ask much initially but a few months, it is clear that their intention is to mislead the customer. I can only say that they are unscrupulous.\n2 star bec the food is still tasty but be prepared to pay 10-15% above the menu listed price, not because of Service Charge and GST but bec the prices listed are lower than actual.",
      "time": 1726202273,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10182790754905468466",
  "user_ratings_total": 124,
  "vicinity": "321 Upper Paya Lebar Road, Singapore"
}