{
  "formatted_address": "1 Kaki Bukit Road 1, Enterprise One #05-11, Singapore 415934",
  "geometry": {
    "location": {
      "lat": 1.3330619,
      "lng": 103.9020514
    },
    "viewport": {
      "northeast": {
        "lat": 1.334877680291502,
        "lng": 103.9039630802915
      },
      "southwest": {
        "lat": 1.332179719708498,
        "lng": 103.9012651197085
      }
    }
  },
  "name": "Golden Pillow 933 Pte Ltd",
  "place_id": "ChIJCRIQh_AX2jER6CouRNl_sRU",
  "rating": 3.1,
  "reviews": [
    {
      "author_name": "Yu Heng",
      "author_url": "https://www.google.com/maps/contrib/111843490369131512030/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWxlhR0C1fl8yO1sFh6hzug2fSiqfa2A0TaEv_r9D1CV7zt7fRQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "in the last week",
      "text": "I was very disappointed with the poor queue and order management during my Mother’s Day pickup experience. I arrived at the designated collection time of 5:45–6:00 PM, only to wait over an hour with no food ready. If the food isn’t prepared on time, why offer customers the option to choose a specific collection slot?\n\nThe situation at the collection point was chaotic, with more than 10 people also waiting past their allocated pickup times (see attached photo). On top of that, there was no clear system in place—orders weren’t prepared in sequence, and we had to figure out on our own that receipts needed to be taken from a blue basket and handed to the staff before they even started preparing the food.\n\nAdditionally, an elderly staff member, though clearly struggling, insisted on handling many items at once and declined assistance, which posed a safety risk. She tripped and fell, with one of the order (Golden Pillow Box) landing on the ground...\n\nWhile the food may be good, the experience was frustrating and poorly managed. I strongly urge you to review and improve your queue system and order fulfillment process—especially during peak periods—to ensure customers are not left waiting unnecessarily.",
      "time": 1747202470,
      "translated": false
    },
    {
      "author_name": "Gladys Heng",
      "author_url": "https://www.google.com/maps/contrib/110748968197845165470/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJL-r-XP4oyWRonHOWXJt05msx7G3IRw1-dYy9FIxuhGt6kVg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Had always love their curry bun! Is so good for parties and on days that you are too lazy to prepare meals! They have a variety of other party food too! Their western Platter has all the fave that kids love. Nice! Their bun is so soft and fluffy too! What's more they are halal!",
      "time": 1735516032,
      "translated": false
    },
    {
      "author_name": "Joel Chan",
      "author_url": "https://www.google.com/maps/contrib/103105254605172157011/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUiiz0fHFkuDJydWP_TrToTneccNvwHZgVn-OwQLlnfWSRHawM=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Ordered the chicken curry bucket for CNY gathering. Had to skim out the layer of oil above the curry in an attempt for the curry to be healthier.\n\nRelatives really loved the curry - it was more creamy and savoury than spicy. The chicken pieces were all very tender, and had a hearty portion to it. The potato slices were cooked to perfection, and had a good chew to it.\n\nDefinitely recommend to dip the bread in the curry, so that it can soak up all the savoury goodness.",
      "time": 1739110465,
      "translated": false
    },
    {
      "author_name": "sucy oktari",
      "author_url": "https://www.google.com/maps/contrib/105495312435948917038/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUIc9sX6f6at21fwsL8ObZHsPqR1zofeA_ml-oCQu2ffnsTvOBj=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Great choice for Halal food gathering! Our family favourite is the Signature Chicken Curry Bun. The bun is big, soft and perfect combo dip in chicken curry. I ordered their fried chicken, fried mee siam and western platter too. Overall we really enjoy the food and satisfied. Would love to order again for the next gathering. Highly recommend!",
      "time": 1735834441,
      "translated": false
    },
    {
      "author_name": "Michelle Lim",
      "author_url": "https://www.google.com/maps/contrib/110706099145631006148/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJCYXn_xGQWaazhYWxnL3A7htErpfEJvZREPKRB8GE-vtmj9MEu=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Love the delicious combination of savory creamy chicken curry and soft, fluffy bun of the Golden Pillow Curry Chicken Bun, as well their signature dry mee siam is also a must-try too, with its perfect blend of flavors and textures that will leave me craving for more. And if you’re a fan of fried chicken, you can’t miss out on their Signature GP Fried Chicken - in love with its crispy exterior & juicy meat. With a variety of fried delights, their Asian platter is must have for any casual meal. A wide range of tasty option such as my favourite fried spring roll, seaweed chicken & more. Beside that, they’ve a generous serving for 4 pax & certainly enough for 5 ~ 6 people",
      "time": 1737705810,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1563171116802779880",
  "user_ratings_total": 375,
  "vicinity": "1 Kaki Bukit Road 1, Enterprise One #05-11"
}