{
  "formatted_address": "376 Thomson Rd, Cube 8, Singapore 298130",
  "geometry": {
    "location": {
      "lat": 1.3282776,
      "lng": 103.8414166
    },
    "viewport": {
      "northeast": {
        "lat": 1.329587530291502,
        "lng": 103.8427371802915
      },
      "southwest": {
        "lat": 1.326889569708498,
        "lng": 103.8400392197085
      }
    }
  },
  "name": "Goodlato - Specialty Low Calorie Gelato Online Shop",
  "place_id": "ChIJO_uZvlMZ2jEReVi-d0zNe_s",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "TTT",
      "author_url": "https://www.google.com/maps/contrib/100686562262088270083/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJqq4k14uqs5-mYCgu4tyEgetN8MZyMd8Dl1ngy21pnKMh7dw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "a year ago",
      "text": "Saw a bit if hype previously about this ice cream, went down to try and was super disappointed. Price aside, the ice cream isn't smooth, there is this tiny pieces of ice inside the ice cream, which not supposed to have for Gelato ice cream. Maybe that's why it's call \"Ice\" cream. One of the sweetest ice cream I tried, I saw review people saying it's not sweet but I tasted otherwise. Not sure if the ice cream was placed in fridge for too long or the person making the ice cream didn't do a proper job.\n\nIt took them quite long to serve the ice cream, not sure if it's because the ice cream had been in the fridge for too long and it harden up or what. I've posted the photos for ice cream expert to comment if the ice cream have been in the fridge for too long.\n\nAmbience was cool and chill. I like the fact that there isn't any other customer except me on a weekend.\n\nNow to the price, $6.60 for a very small cup of ice cream. Definitely not worth it. Overall experience there is bad. Tried once and that's it. Goodlato, more like badlato. One of the worse handmade ice cream I ever tried. :(",
      "time": 1699846918,
      "translated": false
    },
    {
      "author_name": "Sean Wang",
      "author_url": "https://www.google.com/maps/contrib/116915370535212550345/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIvFBQTjHvLsoc39PKYKFJPuGq7UI9luOjHhwTym_R3FwbFDQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "This is hands down the best low calorie ice cream I have tasted so far in the market. It's an amazing initiative by the owner. 5 stars for the product, it honestly taste creamy and good. 3.5 stars for the seating and ambience, and also operating hours. From what I understand they close when they're sold out. (it's a small shop so I understand they're just starting out so I will not fault them for this). Hopefully they can continue on and refine their operations. I'll wait for them to open more outlets because I think they'll do well.",
      "time": 1679622851,
      "translated": false
    },
    {
      "author_name": "Mariah Boon",
      "author_url": "https://www.google.com/maps/contrib/117698452477061791968/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWz8ZH8bVkmwYu5rpvqR3oNEpBr3L91_DDhWWzgqWx-RDB2qQgVnQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Husband brought me here today as he kept raving about the delicious low-calorie gelato. The gelatos taste really good with the right balance of sweetness. Surprised with how low the calorie per serving is because it tastes just as good or even better than other gelatos I've tried in the market. The owner is friendly and hardworking. Quite impressive. Will definitely come back for more and order the pints. It's perfect for us ice cream lovers who are also health conscious. 🥰",
      "time": 1684054362,
      "translated": false
    },
    {
      "author_name": "Sherin Koh",
      "author_url": "https://www.google.com/maps/contrib/111399934228944382442/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXRpayKq2mhbm6OsABnUWVQcIBqU8e0z3iKv-Pl1iJgc0rX_mYjjg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "Recently came across this brand during my hunt for low calorie desserts. I tried most of the their flavours and would like to say that their hazelnut, pistachio, cookie crumble and midnight chocolate are amazing! Tastes like regular gelato that you get from the store. I bought through shopee and through their website, the process is simple and the ice cream came on time. Really hope they put hazelnut and pistachio as their regular line so I can buy it more regularly.",
      "time": 1719406992,
      "translated": false
    },
    {
      "author_name": "Shaun Leong",
      "author_url": "https://www.google.com/maps/contrib/100052783053865939454/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXzsQ-zX09Ml1Gvgl-IIGfY9CWMEwPnGPI2XJdK5lpk8PniHjQa=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Happened to pass by chinatown and saw in google map that there is this shop that sells low calorie, low sugar and high protein icecream.\n\nOrdered their Ube ($4.70) - 68kcal per scoop & Pistachio ($5.70) - 85kcal per scoop. Both flavours were not too sweet and have a rich profile on it’s own. It is a good indulgence to have in such a humid weather and yet you do not feel guilty about consuming too much calories & sugar. If I were to choose one, I would say the Ube takes the 👑\n\nHighly recommend others to try out if you are nearby here. The lady manning the shop is friendly and recommend you the flavours if you unsure what to choose from. 😊",
      "time": 1683005569,
      "translated": false
    }
  ],
  "types": [
    "meal_takeaway",
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=18121303253965494393",
  "user_ratings_total": 94,
  "vicinity": "376 Thomson Road, Cube 8"
}