{
  "formatted_address": "60 Siloso Bch Walk, Singapore 098997",
  "geometry": {
    "location": {
      "lat": 1.2516525,
      "lng": 103.8171855
    },
    "viewport": {
      "northeast": {
        "lat": 1.252739230291502,
        "lng": 103.82027025
      },
      "southwest": {
        "lat": 1.250041269708498,
        "lng": 103.81615725
      }
    }
  },
  "name": "Good Old Days",
  "place_id": "ChIJAQAAsAAc2jERbbHzLY1ImcM",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "William Lin",
      "author_url": "https://www.google.com/maps/contrib/100537437524494981031/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIUaq8ltCYsMuv88ftRZ21aIDFNwPHGbQ9WfIAwcQDv8tEP8A=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Pleasantly surprised by the price, location, air conditioning and quality food. There is lots of options from Asian dishes to Western options too. We ordered the Mac and Cheese, Singapore Laksa, Good Old Days Noodles and Singapore Beef Ho Fan. You can get a drink and Ice Cream for an extra $4.50 if you want the Combo. Lots of seating and air conditioned area",
      "time": 1744634838,
      "translated": false
    },
    {
      "author_name": "Roy Chua",
      "author_url": "https://www.google.com/maps/contrib/113384682403219579483/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ0y5OBzv-SWBWgp7cSOU7dyn6_tY38iPhH5RP0LgA7JHpLTg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Good Food with affordable price at Sentosa area.\n\nPleasantly served by the staff on voucher usage for added discounts. Food prepared quickly and taste good.\n\nWas happy to receive free gift for spending above $20.\n\nThanks.",
      "time": 1742377605,
      "translated": false
    },
    {
      "author_name": "Halcyon CPE 1",
      "author_url": "https://www.google.com/maps/contrib/111567912246828088820/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVNF5VUgodk4fdCzhox3m3DQlA669MPKAmNTmZ6hU02b-f7S_kiHQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Took the wrong bus and ended up in Sentosa. Decided to sketch inside this food court as it has good view over the Central Beach Bazaar. The local food selection looks good actually, ranging from chicken rice to all sorts of noodles and also Western dishes.\nThe place was spacious with lots of tables. I chose a view that faces CBB and bought a cup of coffee to accompany me.\nTook me a while to figure out the coffee machine as it is self-service and the instructions are not clear. When the machine says to choose your capsule, I thought it was flavour but it turned out to be Long black, Latte or Cuppucino. I took the first choice and it was good. I do notice most of the customers finishing all their food. Western meals like the salmon fillet seemed quite popular.\nThe tables were kept very clean with efficient cleaning. The air-con was very cold as I sat there for almost 2 hours. A plus point for hot Sentosa.\nVery convenient location as it's across from the Sentosa express train station. Only downside is that the toilets are also at the station abt a 3-minute walk across. I couldn't visit as I didn't want to leave my sketching materials on the table.\nTo buy food, order at the single row of stalls, pay at the cashier on the way out. Very simple.\nI could only rate 4 for food as I didn't try any and 4 for service as it's self-served.",
      "time": 1740275134,
      "translated": false
    },
    {
      "author_name": "Alif Ikmal",
      "author_url": "https://www.google.com/maps/contrib/117311983299468892041/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVZvkE-zBMrIpozBGMNF89dFKb9JMRrqCmXpaPXjTU5S7rDWdrUNw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I had a wonderful dining experience at Good Old Days in Sentosa Island. The service was top-notch, especially from Ganesan, who was attentive, friendly, and ensured that we felt welcome throughout our meal. It’s rare to find such exceptional service, and he truly made our visit memorable.\n\nThe food portions were quite generous, making it great value for money, and the dishes were delicious, with a nice variety to choose from. Whether you’re looking for local favourites or hearty meals, this place has something for everyone.\n\nOverall, a great spot to unwind and enjoy good food with excellent service. Highly recommended!",
      "time": 1734235355,
      "translated": false
    },
    {
      "author_name": "Lia Razali",
      "author_url": "https://www.google.com/maps/contrib/101247572010185282124/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLhbS6hlBGnfO8dpMGwsULIREVjnT4ceA48jM5T7KfJK1ci_Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Love the food & ambience here. They have a wide variety of dishes here, one of my favourite will be Mince Beef noodles or the Good Old Days noodle. The Staffs Ganesan, Mike, Sabrina, Pavin & Monica are very welcoming, dining in here makes me feel relaxed and with the view of the beach that is a plus point. We always come here for lunch nowadays because of the great service and food. Keep it up, thank u for always welcoming us.",
      "time": 1733471457,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14094376280031211885",
  "user_ratings_total": 2843,
  "vicinity": "60 Siloso Beach Walk"
}