{
  "formatted_address": "355 Tanglin Rd, Singapore 247960",
  "geometry": {
    "location": {
      "lat": 1.2944389,
      "lng": 103.8162841
    },
    "viewport": {
      "northeast": {
        "lat": 1.295806780291502,
        "lng": 103.8175299302915
      },
      "southwest": {
        "lat": 1.293108819708498,
        "lng": 103.8148319697085
      }
    }
  },
  "name": "Grace House @ Tanglin",
  "place_id": "ChIJ3ycXUSka2jERlK3ZKTPiEw4",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "June Tan",
      "author_url": "https://www.google.com/maps/contrib/113885872509007675802/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUS0f-ferEGi7Rkhge-qwL6gtfvPyxpMTWcZAhoZ_wpXJEZnDOO=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Five stars aren't enough! Our twins, Joshua and Faith, have thrived since they enrolled into Grace House PG when they were 18 months old. They are now in N1 and still always enjoy and love attending school.\n\nThe principal and teachers are dedicated and passionate, fostering a love of learning in a fun and engaging way. Grace House is more than just a childcare; it's a nurturing environment where faith is seamlessly integrated into daily life.  Our twins have not only thrived academically but also spiritually.\n\nWe really appreciate the school’s dedication to instilling Christian values while providing a high-quality education curriculum. The balance of faith-based learning and age-appropriate activities is perfect.\n\nCommunication with the staff is excellent, and we always feel informed and involved. It’s also always very heartwarming to see the weekly activities update of our children and them being excited about their day to day activities in school.\n\nWe wholeheartedly recommend Grace House to any parent looking for a childcare/preschool in the area.",
      "time": 1737381769,
      "translated": false
    },
    {
      "author_name": "Della Claudia",
      "author_url": "https://www.google.com/maps/contrib/117925259335317929949/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJPxEipa3goUVToqNghgDpSeFtVwhynba-a_ZuwH99KBGeNqA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "We are beyond grateful to have found Grace House for my child! The love, care, and dedication shown by the teachers and staff are truly exceptional.\n\nFrom the moment we stepped in, we felt welcomed and supported. The teachers take a genuine interest in each child's development, and it's evident in the way they nurture and encourage them.\n\nGrace House has become an extension of our family, providing a safe, engaging, and inclusive environment for our child to grow and thrive.\n\nWe're constantly amazed by the creative activities, interactive learning experiences, and meaningful interactions our child enjoys daily.\n\nThank you, Grace House for being an outstanding partner in our child's educational journey! We feel blessed to be part of this wonderful community.",
      "time": 1736914102,
      "translated": false
    },
    {
      "author_name": "Phuong Bui",
      "author_url": "https://www.google.com/maps/contrib/113473570819980985352/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWZrmt4Z-GWRZ4IcDfE0mJFQ5gSOwiMyRvoc8rONu8g3teXE2GdPA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "My daughter has been attending Grace House since PG. It's a lovely lovely environment where the teachers genuinely care about students and put a lot of effort in raising the kids with the right values. My daughter loves going to school and loves her teacher, which says a lot :). Thank you!",
      "time": 1736998148,
      "translated": false
    },
    {
      "author_name": "Yuko Watanabe S",
      "author_url": "https://www.google.com/maps/contrib/113149498093575966478/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKcRaY0wWm2swFOAKU-V074CMVh3Xke1OHjGsvyZgkw0c-ddw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Grace House has provided a study environment for our daughter for the past 2.5 years since PG period.\n\nWhen considering a school, we as parents lists out some top priorities. Our top 3 priorities are the languages that the school offered, the teachers including assistant teachers and supporting staff, and the school environment. We are fortunate to be able to find and be accepted at Grace House @ Tanglin given the vast options that are available.\n\nDuring the past 2.5 years, we can witness how our daughter loves learning and enjoy going to school. Through this joy, we see her growth in different aspects especially in learning multiple languages as we are international couples. Although we would love our child to have a bigger play space, we find that the play space is sufficient given her age when she attended the school.",
      "time": 1728449134,
      "translated": false
    },
    {
      "author_name": "2011charmz",
      "author_url": "https://www.google.com/maps/contrib/100751117220049993401/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ7QgDsSp7kWEsuFslmOAKGS9jOD3I1K6CziNTCd5LlDdpTeA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "We enrolled our daughter in 2023 for N1. Her teachers are incredibly nurturing, creating a warm and engaging environment that fosters both learning and social development. The curriculum is well balanced and structured.\nWeekly updates will be provided on your child’s activities and progress in school. Almost everyday she will happily share with us on her learnings in school which is an affirmation on the positive environment of the school. We would highly recommend Grace House if you are looking for a good preschool in this area.",
      "time": 1727426691,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "school",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1014403050461834644",
  "user_ratings_total": 12,
  "vicinity": "355 Tanglin Road"
}