{
  "formatted_address": "50 E Coast Rd, Roxy Square, Singapore 428769",
  "geometry": {
    "location": {
      "lat": 1.303171,
      "lng": 103.9047767
    },
    "viewport": {
      "northeast": {
        "lat": 1.30619235,
        "lng": 103.9058752
      },
      "southwest": {
        "lat": 1.30163815,
        "lng": 103.9028896
      }
    }
  },
  "name": "Grand Mercure Singapore Roxy",
  "place_id": "ChIJhe37fXIY2jERBpZdIxltdm0",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Howard Crump",
      "author_url": "https://www.google.com/maps/contrib/112150348612963403640/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK7fcdOo8LuWPjXlWG5g-XjYap0_5eA0cE8JDbDTmCKmYWL-A=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "4 weeks ago",
      "text": "The staff are friendly and helpful, and the rooms are comfortable. Additionally, it IS well located opposite an MRT station and wonderful Hawker Centre and shops.\n\nThe breakfast manager and her staff who were super helpful us and were credit to themselves and your hotel.\n\nUnfortunately, the Executive lounge experience is sadly lacking. It well placed on the 17th floor and has great views and comfortable seating but that's all. There is no morning or afternoon tea served. No staff attending it and the evening drinks and canapes are served down in the pool bar.\n\nThe only offering in the lounge is a fridge with some cans of soft drink and a coffee machine!!  it's not an executive lounge it's just a self-service drink station, that's empty of guests. you would be serving the guests better by giving us complementary soft drinks, tea and coffee at the Breeze Bar by the pool.\n\nThis seems to be a trend in ACCOR properties since COVID. Its time reinstate the Executive Loung experience we are paying for when staying in an Executive room.",
      "time": 1745295194,
      "translated": false
    },
    {
      "author_name": "niluh sekarini",
      "author_url": "https://www.google.com/maps/contrib/105237513201928116027/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUp-xxNNOR2SI2VqOkd2algBg7kffplO_X0CdXR4XfxGVsa2fU=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "We visit singapore with twins toddler and Mercure help us a lot. We get free extrabed and high floor room. Our childrens was so happy because its near beach. The room also clean and so spacious. The coordinator room also helpfull. The hotel also serve a clean water in everybroom. The pool also clean and warm, its so nice having stay here for 4 nights.",
      "time": 1747389831,
      "translated": false
    },
    {
      "author_name": "Brian Dobbyn",
      "author_url": "https://www.google.com/maps/contrib/101489657220508014289/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU-yRKXJPkGDu44WFPYtp1RG2Sm7gjt6OidpMqc6RhhzOpt95k=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "As an Accor member I do often select member hotels and this time was no exception and I am so glad we choose to stay at the Grand Mercure Roxy at first I thought it to be out of town, however with the MRT directly out the front we could have done chosen any better views over  Marine Parade Parkland, beach and beyond the Singapore Straight with ships as far as the eyes could see it was excellent.\n\nWell appointed room an Exec level room on 17 and 16 floors upon our return being a creature I habit I was disappointed they did not give me room #1741 from our first visit again ☹\nFilter water is available on each level although the tap water is drinkable.\n\nOur rooms were very comfortable, however, on the second stay we were in an adjoining type of room #1639 again, not what I would ever select as the neighbours were very loud.\n\nLovely welcome gifts and cake for celebrations. Thank you, team, Bathroom with shower over bath which is fine the night light certainly a benefit for late night trips.   I like the bench and shelf unit under the television as it affords more space for suitcases, always an issue when travelling as couple with two cases as there is ever only one stand in a room.\n\nThe pool area was nice, could do with some umbrellas over some lounges and a few more lounges at pool level would not go astray. I add there are heaps up on a deck just adjacent to the pool.\nBreez bar service was excellent from Haris and later Stephanie on our later return visit.\nLevel daily evening benefit was served in the Breez bar and not on the 17th floor lounge the food was limited compared to some hotels with an Exec offer.\n\nWould I stay here again in a heartbeat!\nGood value nice hotel in an excellent location, MRT, walks along the fabulous East Coast Parkland every day after breakfast, there is also some great bars and food offers within the parkland.  Katong behind the hotel is another beautiful neighbourhood to explore.\n\nA big shout out to Maria at reception for her wonderful assistance during our stay and yes Maria the gown did shrink as advised by housekeeping 😊",
      "time": 1743643665,
      "translated": false
    },
    {
      "author_name": "Robert Scarborough",
      "author_url": "https://www.google.com/maps/contrib/104946821932978073970/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ_N6UlB6zhHyeKfTu-svIZYc-UUa3wRlczJpNdj_1Oqj6h=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Singapore Grand Mercure Rocky is an excellent value for money hotel. Its location is in a more residential area. There is a fantastic Hawkers Market across the road. Where you will find excellent value for money food.  Also a small shopping mall which is adequate.\nThe hotel staff are very good offering any assistance needed. The Chinese restaurant Jia Wei is excellent. Breakfast in the larger Feast Asia Restaurant is extremely good. A large variety of local and western choices.\n\nI would like to highlight one staff member. George from house keeping. He clean my room most of my 7 nights stay.  He was brilliant he lined up anything left on a desk in military order. Clothes left lying around were neatly folded. I was so blown away that first time. He is a true representation of the staff and a pure professional.",
      "time": 1742816465,
      "translated": false
    },
    {
      "author_name": "Madison Captain",
      "author_url": "https://www.google.com/maps/contrib/107807090851030337035/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocICm6pQkUEXdZBanHFe-K5oJEXB0puiJ-DzEYQwZqoiMkByMg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "3 weeks ago",
      "text": "Executive rooms are not worth the upgrade. (Or if you regularly get the benefit for free with Accor, you will be disappointed with this lounge).\nAlthough the hotel does have a lounge, it is never manned and is only good for getting soft drinks (only options are Coke, Diet Coke and sprite) and using the coffee machine. There is not even any fresh milk for a cup of tea - just the frothed milk on the machine. Their free flow drinks are not served in the lounge, nor is any breakfast alternative. They should not bother even having one in my opinion.\nThe evening drinks are served at the public bar by the pool. There is some food, although the selection is the poorest I’ve ever seen. There were some dumplings, empanadas and deep fried chicken bites (none of which were still hot), some cheeses which were empty after 30mins and took them 30mins to bring out a fresh plate, and a basic chocolate sheet cake. The drink selection was basic but acceptable.\n\nRoom service at the hotel has very little options and is quite expensive.\n\nThe rooms themselves are clean and nicely presented but the beds and pillows are very hard and uncomfortable. There is No milk in the rooms for cups of tea. Their mini fridges never actually get cold (felt about 15 degrees C). The black out curtains work pretty well which is good though.\n\nThe hotel is in a decent location and Customer service is pretty good which saves this hotel from its poor amenities.",
      "time": 1745808979,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7887611752120948230",
  "user_ratings_total": 4875,
  "vicinity": "50 East Coast Road, Roxy Square"
}