{
  "formatted_address": "600 N Bridge Rd, Level 3, #03-01/10 Parkview Square, Singapore 188778",
  "geometry": {
    "location": {
      "lat": 1.300164,
      "lng": 103.8577305
    },
    "viewport": {
      "northeast": {
        "lat": 1.301320230291502,
        "lng": 103.8590033302915
      },
      "southwest": {
        "lat": 1.298622269708498,
        "lng": 103.8563053697085
      }
    }
  },
  "name": "GROUNDSEESAW SINGAPORE - Monet Inside",
  "place_id": "ChIJyQKn24EZ2jERneGUGYAHe0k",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Gregory Athanasius",
      "author_url": "https://www.google.com/maps/contrib/101240389824842882822/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWQ1S71i5tG3M2LeuMrmDao8IOBC-y287tYxI59HVgc9eYcoOPg6w=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Immerse yourself in the world of Claude Monet at the \"Monet Inside\" exhibition, located on the third floor of Parkview Square.\nThis captivating experience begins with an introductory room showcasing panels about Monet's life.  The main attraction is a 45-minute multimedia presentation, where stunning visuals and narration bring his art to life, exploring his fascination with light, color, and nature.  A dedicated photo spot allows you to capture memories against a backdrop of his iconic works.\n\n\"Monet Inside\" offers a unique and immersive experience for art lovers. While the cost is moderately high, it's a worthwhile journey into Monet's genius.  The exhibition is best suited for adults and older children; younger children may find it challenging to remain engaged.\n\nExperience \"Monet Inside\" in Singapore until April 2025.",
      "time": 1739369023,
      "translated": false
    },
    {
      "author_name": "You K",
      "author_url": "https://www.google.com/maps/contrib/114290941081043664370/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWOvFFANDKdpfSZpij0Mbl67N9FduLaIjCapt4cMF3T6fXcjtIkyw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "After enjoying the Monet digital show, I was excited to experience the Van Gogh edition at the same venue—an elegant and somewhat unexpected space near Bugis MRT, right across from Raffles Hospital.\nThe theater itself was a pleasant surprise—mid-sized, stylish, and perfect for an immersive art experience.\n\nWith Monet, I had the luxury of a nearly empty weekday session, where I could sit right at the front and absorb the stunning visuals in peace.\nVan Gogh, however, was a different story—packed and considerably noisier. But knowing what to expect this time, I was able to enjoy it even more.\nThe concept became clear: an audiovisual journey through an artist’s world, blending breathtaking projections with their life story. The English subtitles were a thoughtful touch, especially for those of us who aren’t native speakers.\n\nThe way the visuals covered the entire theater was truly mesmerizing—each painting coming to life in a way that made you feel part of the artwork.\nThis is what makes these digital exhibitions so special: the ability to step inside the artist’s universe.\n\nBeing a VIP ticket holder, I received a lovely fragrance spray as a gift—not once, but twice! (Monet and Van Gogh came with the same VIP present, so now I have four bottles. Not complaining, but a bit of variety would have been nice!)\nThere was also a tiny sticker pack, but oddly, none featured Van Gogh’s iconic Sunflowers. A curious omission.\n\nOverall, it was a fantastic experience at a reasonable price, and I would gladly return for future editions.\nThat said, there was one major downside…\n\nDuring the Van Gogh show, the number of children in attendance was overwhelming.\nAt times, it felt less like an art exhibition and more like a playground. The “photo-friendly” session, in particular, descended into absolute chaos—kids running wild, screaming, and treating the space like an indoor obstacle course.\nWhile I understand that everyone enjoys art differently, it would have been great if someone, anyone, had stepped in to restore some sense of order.\n\nSo, would I recommend it? Absolutely. Would I also recommend bringing noise-canceling headphones and the patience of a saint if attending a weekend or peak-hour session? Definitely.",
      "time": 1738150660,
      "translated": false
    },
    {
      "author_name": "Deborah Teo",
      "author_url": "https://www.google.com/maps/contrib/106051970062566037400/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJqkN6-a4vJL8FEZdsAZpxdjthJU1b58Ygkg6BctRKXfSVxyd2c=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "It is a digital immersion video about Monet’s life and how the events from his life would eventually affect the creation and evolution of his drawings. I was pleasantly surprised to find out that there is a Monet’s digital exhibition in SG after just returning from South Korea and being exposed to their digital art media contents in their museums. I had to come visit this and even grabbed a friend who does not know a single thing about Monet/Art to go with me. Beautiful and pleasant experience! We arrived right on time at 6pm which is the last time slot and managed to get seated near the centre to view the whole exhibition. Wish that there was more rooms/contents for viewing",
      "time": 1732252085,
      "translated": false
    },
    {
      "author_name": "K K",
      "author_url": "https://www.google.com/maps/contrib/104914297861576464336/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV1T2u23MutkqRYDyL4IbLnC7j3wa3sD7Sf_olJaicDle_NN4fj=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "Very good immersion way of learning art and nice experience to be.\n\nYou can choose 3 different artists in the same place but different times.",
      "time": 1747031816,
      "translated": false
    },
    {
      "author_name": "LEACH LiChingHeng",
      "author_url": "https://www.google.com/maps/contrib/114421226696856832569/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW0TWCnPDybQETsjq-iejKbjhGocNAFb8BWVn8V-QYEDfyHayysnA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 2,
      "relative_time_description": "6 months ago",
      "text": "Waste of time if you have been to Teamlab or Gustav Klimt or even the Gardens by the bay Monet exhibition.  There was nothing interactive about the exhibition.  Essentially a fancy video show. After the video you get to view a few Monet prints. Then you arrive at the shop where you are left scratching your head wondering where the rest of the show is. Very disappointed since I took my entire family there. My son said he was more impressed with the Art Deco building and the art there than the show.",
      "time": 1730509369,
      "translated": false
    }
  ],
  "types": [
    "art_gallery",
    "tourist_attraction",
    "museum",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5294834033670545821",
  "user_ratings_total": 152,
  "vicinity": "600 North Bridge Road, Level 3, #03-01/10 Parkview Square"
}