{
  "formatted_address": "60 Tessensohn Road CSC@Tessensohn, Level 2, Singapore 217664",
  "geometry": {
    "location": {
      "lat": 1.3155064,
      "lng": 103.8559722
    },
    "viewport": {
      "northeast": {
        "lat": 1.316811680291502,
        "lng": 103.8572942302915
      },
      "southwest": {
        "lat": 1.314113719708498,
        "lng": 103.8545962697085
      }
    }
  },
  "name": "Ground Up Climbing Gym",
  "place_id": "ChIJK_9DYcUZ2jERVhqH20Vrf7I",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Daniel Martínez Guerrero",
      "author_url": "https://www.google.com/maps/contrib/117518282101099921100/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVDMgzyjNCnrxFdciFCStMGM0KwWgzObwrbym6xVXPL9RXBovCKsw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "We celebrated our daughter's birthday here, and the team was incredibly organized and helpful, especially with 15 kids to manage. The kids had a blast! All safety instructions were clearly explained at the start of the session. My daughter loved it so much that we've started climbing on weekends!",
      "time": 1740895583,
      "translated": false
    },
    {
      "author_name": "Malcolm Low",
      "author_url": "https://www.google.com/maps/contrib/109450738583052175469/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVimulkUHN0wVXt9QxtnMxeoj8xhS1XU9UIgxHxFGTRWkRKOu0=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "To be honest with you, before going. I thought it was going to be boring as it was part of my school's learning journey. Boy, was I wrong. I decided to challenge myself with V3. I tried 4 of their paths. Kept failing repeatedly. The coaches are very patient and was willing to help me with my strategy of hand and foot placement. There are quite a few coaches and sadly I do not remember all of their names. One of them was called instructor Roy I think. Overall, def reccomend",
      "time": 1747309757,
      "translated": false
    },
    {
      "author_name": "Kelvin&Xin",
      "author_url": "https://www.google.com/maps/contrib/101436951543204577948/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLt-ND3u92SvfuciBmp8MROxLmsD73qN9DCu7RbBO0HdCpiRg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "One of the worst service experiences we have had, and mostly because of their staff called Ika.\n\nFirst, a refund has not been given to us even though the class we signed up for in early March did not run on 22 March as scheduled. Even the notice that the class was cancelled came after we asked for weeks. Subsequently, after repeated reminders for the refund met with dead silence, we had to call and send an ultimatum that we were reporting the issue to relevant authorities, then Ika called.\n\nIt was a most unpleasant call with Ika. Overall, she was extremely rude and very unclear and evasive in her replies. First, she said they could only refund next month in May. Then, after i clarified that our class was meant to take place in Mar, she changed to say we will receive our refund this week. Throughout the conversation, she was not serious about resolving the issue - she was chatting with someone in the background, sniggering and giggling on multiple occasions at my responses, and even mocked at me for getting the gender of her CEO wrong - all these bad treatment while I was trying to get clarity over the issue. Finally, I asked to speak to her CEO over her service attitude, but she brushed me off and said her CEO was very busy and would not have time to give me a callback.\n\nAfter these many encounters of consistently bad service from GU, we are truly concerned. Such bad service and poor financial ethics should not be condoned, and will only tarnish the repute of the rock climbing community.",
      "time": 1743773531,
      "translated": false
    },
    {
      "author_name": "Joyce KAU",
      "author_url": "https://www.google.com/maps/contrib/101409232117989928992/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWGF0a9-hebuV2GUbEDbrIPfLcC-vtjS5m1QRrNDe1MWt8pKwHJ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "My team of teachers and students just completed our climb. Clean environment, professional staff, easy and simple way to make booking. Price is reasonable! Parent was keen to sign their child up for regular classes!\nMindSpace CSM",
      "time": 1733715654,
      "translated": false
    },
    {
      "author_name": "trevor tan",
      "author_url": "https://www.google.com/maps/contrib/111563323540362979034/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUzPwbXRLl-yqVWov1WlOv9IKJQ8NgvfC6u6AgDc2FHH6ahawsV=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Thank you to the instructors for their patience and dedication. Brought a group of 20 pax of non-climbers to try out rock climbing. The instructors put their utmost professionalism and took care of every participants well being. Will recommend anyone that is new to want to try out this sports to start out here.",
      "time": 1697888997,
      "translated": false
    }
  ],
  "types": [
    "gym",
    "point_of_interest",
    "health",
    "school",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12862117008573405782",
  "user_ratings_total": 228,
  "vicinity": "60 Tessensohn Road CSC@Tessensohn, Level 2"
}