{
  "formatted_address": "1 Goldhill Plaza, #02-27, Singapore 308899",
  "geometry": {
    "location": {
      "lat": 1.3180244,
      "lng": 103.8427954
    },
    "viewport": {
      "northeast": {
        "lat": 1.319305680291502,
        "lng": 103.8440597802915
      },
      "southwest": {
        "lat": 1.316607719708498,
        "lng": 103.8413618197085
      }
    }
  },
  "name": "Habitat Learning Centre",
  "place_id": "ChIJn7DUFdAZ2jER1btUeBQ7Hnk",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Yap Harnyi",
      "author_url": "https://www.google.com/maps/contrib/114315903945065854752/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKS4TUqL4PGFSAvlZh3gjy4VggcmhZllIaletV645IPou4KSA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Our experience with Habitat Learning Centre has been nothing short of remarkable. My daughter, Vanessa Ow, attended their tuition courses in A-math, E-math, Physics, and Chemistry. Since enrolling, her grades have shown a tremendous improvement. Vanessa achieved A1 in A-math and A2 in E-math, Physics, and Chemistry, which is a testament to the centre's exceptional teaching standards.\n\nVanessa teachers at Habitat Learning Centre are truly dedicated and have a unique ability to inspire their students. Their commitment and passion for teaching have had a profound impact on Vanessa's academic journey. We are incredibly grateful to the entire team for their hard work and dedication.\n\nThank you, Habitat Learning Centre, for your unwavering support and for making a significant difference in Vanessa's education. We highly recommend their services to any parent seeking quality tuition for their children.",
      "time": 1736588108,
      "translated": false
    },
    {
      "author_name": "Chuleeporn Boonmasiri",
      "author_url": "https://www.google.com/maps/contrib/117582820140226425248/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLokWXhEM_WzLd-LtmRRDbGjErMrWaX9-nuT2c4I1Qhq2yGYg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Both my sons attended Habitat Learning Centre when we observed that they needed help with Physics, Chemistry and Math. We were pleasantly surprised that their O-Level grades improved greatly under the tutelage of teacher Leon Choo, so much so that they were able to continue on their learning journey, taking up courses of their respective choices. Thank you.",
      "time": 1736681252,
      "translated": false
    },
    {
      "author_name": "Fanxun",
      "author_url": "https://www.google.com/maps/contrib/104493773606568714577/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWmun0kWiz3WnYJTqg7bC5CFOlhWAda5Ppu5S21UXvX1YnebB6MEA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Teacher Leons chemistry lessons are always fun and informative! When i Joined after promos in J1 he was super helpful and helped me with my topics that I struggled previously but now I am super confident and my results went from S to A in A levels for H2 chemistry!",
      "time": 1742116065,
      "translated": false
    },
    {
      "author_name": "yz",
      "author_url": "https://www.google.com/maps/contrib/117987976868493658537/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKPNP75XbLJOxgZeAxBgDq_NIXPJHPvusIunx1GrXXONVPkWA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I was a student at this tuition centre and thank god for their help, or else I would've stagnated and continued failing subjects. When secondary 3 ended, I realised I was averaging a F9 in Amaths and a C5 in both Emaths and Chemistry. That was when I was referred to this centre by my parents. My older sister had been taught under them during her schooling years and the progress made was remarkable. Hence, we unanimously decided to join their tuition lessons for both Maths and Chemistry. And I must say, the improvement had an immediate effect, and it was VERY NOTICEABLE. I scored A1s for all three subjects in my WA1 (the first examination of the year) in sec 4, which I was very taken back by. I was then able to maintain it until my Olevels, scoring single digit with distinctions for all the subjects guided by Habitat. Overall, I would rate my experience at Habitat a 10/10. The teachers and principal are all very understanding and are able to tailor a study plan for their students to achieve desired results. Class sizes were relatively small during my time there and it was definitely a plus point. 10/10 would definitely recommend! 🔥🔥🔥",
      "time": 1736599854,
      "translated": false
    },
    {
      "author_name": "Melvin Tay",
      "author_url": "https://www.google.com/maps/contrib/108575057349170046902/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI-zEgCjCVa-X2gVJbiEZA9MGvhM6ufL493gVbRbXRbg-jn5g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I am grateful to Habitat Learning Centre with how they have supported Asher with Mathematics Syllabus A . He struggled to pass his Mathematics since Secondary 3 and  decided to enrol him at Habitat Learning Centre in Secondary 4. His grades started to improve and he eventually obtained a Grade 2 at the NA Level exams.",
      "time": 1737002743,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8727478086994803669",
  "user_ratings_total": 49,
  "vicinity": "1 Goldhill Plaza, #02-27"
}