{
  "formatted_address": "018972, Bayfront Ave, 2号, The Shoppes at Marina Bay Sands, #B2-01",
  "geometry": {
    "location": {
      "lat": 1.2819736,
      "lng": 103.8575251
    },
    "viewport": {
      "northeast": {
        "lat": 1.28552475,
        "lng": 103.8618143
      },
      "southwest": {
        "lat": 1.280434550000001,
        "lng": 103.8559595
      }
    }
  },
  "name": "Haidilao Hot Pot @Marina Bay Sands",
  "place_id": "ChIJ3cm-acAZ2jERPcUR3m7jzvw",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Penny Ching",
      "author_url": "https://www.google.com/maps/contrib/114017699998988407106/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWOogspPGEIoxcEMVhdzExcCIfE7IoLylahTAChd39fJ2_s6eGz=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We had dinner at the MBS outlet and honestly, the experience was amazing from the moment we walked in. The 门迎组 team—especially 念念, 王珂, and 嘉慧—were super warm and welcoming. They were incredibly attentive, always ready to help and kept checking in on us just the right amount, which made the short wait for our table feel like nothing.\n\nWhat really touched us was how thoughtful they were. My husband casually mentioned it was my birthday, and somehow they picked up on it and went out of their way to set up the table beautifully. We were already having a great time even before the food arrived!\n\nAmazing services, as always! Will definitely visit the outlet again. Thank you team HDL at MBS!! 🫶🏻",
      "time": 1744897484,
      "translated": false
    },
    {
      "author_name": "J L",
      "author_url": "https://www.google.com/maps/contrib/113343459094765886710/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIQ65HlrTIBe3rf8NvI4DA1NgWduzF69CWdACaExF1P-3aMyA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Was attended to by your staff, Liu Xiang Yang. He was patient, friendly and efficient.\n\nIt was my birthday month. When we got home, my wife realized we received a hand written card by Rose, with well wishes to my pregnant wife.\n\nInteraction with the rest of the staff at this outlet was pleasant as well. They all put in their upmost effort to ensure customers have the best dining experience.\n\nPhenomenal service from the mbs outlet team. Thank you for the pleasant dining experience. Well done!",
      "time": 1745070690,
      "translated": false
    },
    {
      "author_name": "Sebastian Richard",
      "author_url": "https://www.google.com/maps/contrib/107352363332958754336/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIK_YajwCT9zLM1pe3vXNROqpdnhiibPPANSuQC08Z8Kg0Umw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "One of the best HDL that I’ve been to! I’m a big fan and eat it almost every month! And this outlet service is superb!\n\nThe staff here interacts with you by playing games and giving you prizes! Their menu has more variety and premium choices like caviar!\n\nWhen you go to the toilet they will give you a seat cover plastic. That really impressed me! They had the face changing performance too! Fruit platter was given after our meal too!\n\nKudos to the staff here! And definitely will be one of my outlet choices in Singapore! Must visit!",
      "time": 1742123091,
      "translated": false
    },
    {
      "author_name": "Louise Strang",
      "author_url": "https://www.google.com/maps/contrib/110017657704841500675/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJuBTT4Xuml2X0FH4JVJUL7tggLV6rnAMB-A9yEJUKQCA167A=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "We were a bit nervous about trying something new but every single one of the staff were amazing and so welcoming. The young man server at the start was particularly helpful and patient when he realized we needed help. Took us through everything but gave us plenty of time and encouragement to make our own choices. Also recommended we become members and use the chain again which got us a little goody bag. Such a lovely and relaxing experience. We will definitely come again.\n\nRobot waiter was a fun surprise and there's lots of little complimentary extras that just make it all feel special",
      "time": 1740909730,
      "translated": false
    },
    {
      "author_name": "Aipeng Kua",
      "author_url": "https://www.google.com/maps/contrib/114609064241833819753/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLiiyUK1N8zH-8n3Bk35MqaAbGGNpaiciOiKKgPGNyiyl4UbQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Our table served by a lovely Angel - Kris. She was just so understanding, helpful, adorable and sweet. I am not really feeling well recently which only not able to drink cold drink. She help me to adjusted my winter melon to warm type which makes felt so touch. She also immediately provide me with small fan when I requested as I felt a bit warm after a long walk. It's so lucky to have a kind Angel with me who made my day. Thank you, Kris. Love u deep deep 😘♥️",
      "time": 1740134357,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=18216747608071849277",
  "user_ratings_total": 3008,
  "vicinity": "2 Bayfront Avenue, #B2-01 The Shoppes at Marina Bay Sands"
}