{
  "formatted_address": "1 Maju Avenue, myVillage @ Serangoon Garden, #02-07/8/9, Singapore 556679",
  "geometry": {
    "location": {
      "lat": 1.364948,
      "lng": 103.8652996
    },
    "viewport": {
      "northeast": {
        "lat": 1.366227930291502,
        "lng": 103.8667595802915
      },
      "southwest": {
        "lat": 1.363529969708498,
        "lng": 103.8640616197085
      }
    }
  },
  "name": "Hajime Tonkatsu & Ramen (myVillage @ Serangoon Garden)",
  "place_id": "ChIJSywCtf8W2jERFOBMoHstIuE",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Rene Lee",
      "author_url": "https://www.google.com/maps/contrib/108481221892893207863/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWeQjpiSRtxwBZvh7l7XE4hum62a1u-EWRYHvF3dQsjSU5YRsF-=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Their oyako don is nice and quite authentic!! It has a light but nice taste with delicious sauce and eggs. One of the more authentic oyako dons I've tasted in Singapore and it's worth it. Will come here next time for the Toji and Tonkatsu!!\n\nUpdate:\nTried their Toji Pork Loin set. I think the sauce is really nice and is a little different from other places as it has that bit of sweetness which I like.",
      "time": 1742552366,
      "translated": false
    },
    {
      "author_name": "Samson Ng",
      "author_url": "https://www.google.com/maps/contrib/111896812755264351912/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLpRHiacrpblEp4SwV4tqDJREBS6KLwqZLpWXuNoR65_f0L=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "had a delightful dining experience at Hajime Tonkatsu. The food was not only delicious but also generously portioned, making it great value for the price. Each dish was well prepared and up to the expected standard, showcasing authentic flavors and attention to detail. It’s definitely a spot worth visiting.",
      "time": 1735026698,
      "translated": false
    },
    {
      "author_name": "Sera // IG: diningwithsera",
      "author_url": "https://www.google.com/maps/contrib/118301436723641326928/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX9NCc6stGTNIHPixhaC27p8dOFlcSoDAsI6AA2DU2i2sTIPw0=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Imagine having quality, value-for-money Jap cuisine by SG’s 1st Tonkatsu chef !! Their pork loin is air flown from Japan, sauces are homemade and they have the warmest hospitality.\n\nWe tried their premium pork loin set, which consists of tender & juicy air-flown Kagoshima Sangen pork, coated in delicate, crisp & non-greasy breadcrumbs. It's paired w crunchy shredded cabbage that’s washed in ice-cold water (best w light Wafu dressing), Niigata rice, Tonjiru soup (MSG-free savoury pork bone broth w veggies & yuzu - we loved this), & ground roasted sesame (add to their Tonkatsu sauce). Their dedication to quality is evident, & for the price?? So damn worth. Also did i mention refillable cabbage and rice? Perfect for big backs.\n\nWe also enjoyed their Nagoya miso fillet which was also beautifully tender, fried w red wine & tonkotsu broth, paired w miso sauce handpicked from Nagoya.\n\nWe ordered their ebi fry ramen to try, which entails QQ Nama noodles in a secret Sakura Ebi paste infused w their Tonkotsu base broth, & finished w a dash of chilli oil. This came w freshly-breaded & fried ebi which was pretty decent in flavour & texture.\n\nHad a few sides, including:\nagedashi tofu, which is made with delicate batter infused w yuzu & fried in soybean oil. Refreshingly crisp w/o being too oily.\nTheir torikawa (grilled chicken skin) is crunchy with a juicy interior, and absolutely umami-packed.\n\nThey also provide complimentary water and tea !!\nOverall, if you’re looking for exceptional tonkatsus with unbeatable value, this is a must-try :)",
      "time": 1739994903,
      "translated": false
    },
    {
      "author_name": "Ken Peh",
      "author_url": "https://www.google.com/maps/contrib/113975004215945002265/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXSJxn-MN1vy970v-MMcT8F_p28Ghtkh0hnblugxH0puU79a2To=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "When I read the reviews and website that the chef is from Tampopo, it is a MUST TRY already. For Singapore people and even Japanese expatriates, I believe Tampopo is a well known brand name to you. Even the Japanese in Singapore, they agree that Tampopo is very authentic and as near as what they have in Japan. Hence when I read that chef Tan San was previously helming there, it definitely is going to be good. And yes it has the same taste 👍\n\nVery cosy dining place at Hajime. The rice and white cabbage are refillable. Ice green tea is also complimentary. Tonkatsu sauce is one of the best I've tried in Singapore. Most of the sauces from other restaurants are either too bland or too strong, taking over the fragrance of the Tonkatsu. But in Hajime, the sauce taste is 100% just nice to the point. Business is very good. By 12pm the seating is 100%. The serving staff is very courteous, walking around to offer refills for customers. SUPER HIGHLY RECOMMENDED. If you are a fan of Tonkatsu, you can't miss this place. 👍",
      "time": 1742018766,
      "translated": false
    },
    {
      "author_name": "Cheryl Tan",
      "author_url": "https://www.google.com/maps/contrib/117271033601210753645/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVpreYEHpcIO4uCR3MDMXgF2YFnuE3cox_JARDRRmD75P6a9Xg_xA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "It’s always great having dinner at Hajime. The tonkatsu here is top quality and always consistently good. In particular, they don’t compromise on hygiene. In the photo, it shows the menus cleaned and propped up to dry. That’s how it should be. Kudos to the team of well managed staff!",
      "time": 1742732858,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16222578816735567892",
  "user_ratings_total": 729,
  "vicinity": "1 Maju Avenue, myVillage @ Serangoon Garden, #02-07/8/9"
}