{
  "formatted_address": "40A Orchard Road MacDonald House #03-00, Singapore 238838",
  "geometry": {
    "location": {
      "lat": 1.2991586,
      "lng": 103.846019
    },
    "viewport": {
      "northeast": {
        "lat": 1.300435630291502,
        "lng": 103.8473443302915
      },
      "southwest": {
        "lat": 1.297737669708498,
        "lng": 103.8446463697085
      }
    }
  },
  "name": "Han Hai Language Studio - Learn Chinese in Singapore - Orchard Studio",
  "place_id": "ChIJb9zk6JAZ2jERz1dglY-uFLA",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Wayne Hann Ng",
      "author_url": "https://www.google.com/maps/contrib/105454360384673124617/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJldOc66wGYBnoWtX8aygrY_mULuhXO_d03ct7cJ2XeuaZC0A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "During my exchange in Singapore, I had an amazing experience learning Mandarin with HanHai Language Studio. I’d like to thank my teacher, Timothy 王老师, for the incredible lessons each week. He teaches with great patience and is always approachable, creating a very supportive learning environment. What I appreciated most is how he brings each lesson to life by explaining the cultural and historical roots behind Chinese characters.\n\nHe often shares useful phrases and idioms beyond the textbook, which have helped me in day-to-day interactions and given me a deeper perspective on Chinese culture and values. You’re not just learning how to speak Chinese, but you’re also learning how to think in Chinese. Every lesson felt meaningful and enjoyable, and I always left feeling inspired to learn more.\n\nHighly recommend HanHai to anyone keen to learn Mandarin in a way that’s both practical and culturally rich!",
      "time": 1744470439,
      "translated": false
    },
    {
      "author_name": "Garri Adrian Nablo",
      "author_url": "https://www.google.com/maps/contrib/117545845433791580252/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXZNC-NN2V2c3ulG2DoUhQMSCLUSVylQ9HN6WWnvSNLn8yLtFyr=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I've only started their program 4 months ago but I can already see a lot of improvement in my vocabulary and pronunciation. I very much enjoy my classes with Rosa Yang 老师 and look forward to them every weekend. She teaches me real world scenarios and gives me tips on how to speak like a native speaker.  She also gives context as to the historical reason behind certain characters (汉字).\n\nI highly recommend Han Hai Language Studio.",
      "time": 1732353728,
      "translated": false
    },
    {
      "author_name": "Agnese Monti",
      "author_url": "https://www.google.com/maps/contrib/108865818388785631715/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIRrz0X9q7vKWvgX09Blp0tSMvwBC0I92Bjc8NuRrZIIo6CXg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "My daughter has been a student of Han Hai Language studio for the past two years and her mandarin skills have improved so much! She has attended both 1:1 tutorship and their camps. All their teachers are very skilled and kind. They know how to teach to kids to make learning interesting and fun! And they have always been very flexible in case of changes in her schedules and make up classes. Also the environment is very nice and welcoming!\nTheir holiday camps are great as part of the learning is in class and part done by trips to museums or art exhibitions, which my daughter found both interesting and fun.\nI highly recommend Han Hai Language studio!",
      "time": 1725166210,
      "translated": false
    },
    {
      "author_name": "Dee D.",
      "author_url": "https://www.google.com/maps/contrib/115640169353269870369/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUTzeW5OdAhQEzcqc7c47i7rO75up8mW1rAr8L9iv-85t2TVJ4K=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I'd like to thank Ms Grace Guo Yimu for her great expertise and wit in teaching Chinese. I had so much fun learning. I started with no Chinese and now can utter numerous phrases and form simple sentences after just five sessions. I highly suggest Han Hai Language Studio, particularly Teacher Grace. 💗",
      "time": 1732022821,
      "translated": false
    },
    {
      "author_name": "Taylor Meyer",
      "author_url": "https://www.google.com/maps/contrib/101880523167836280771/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLWGztQgrUVMjUGU8PXTMiFkHobkcvyO0vSrlUgbOfwibKEww=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I am having a great experience with Han Hai Language Studio; I have worked with Grace, Rosa, and Bettina, and I have been impressed by each of their professionalism, knowledge, and teaching capabilities.\n\nHan Hai and I have used various methods involving both in person and online learning which has broadened my understanding of Chinese language.  We have addressed listening, speaking, reading, and writing from multiple angles.\n\nMost importantly, the team is thoroughly friendly, kind, flexible, and patient.  They have genuinely made learning Chinese fun, and I would recommend them to anyone.",
      "time": 1711426713,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12687957981919205327",
  "user_ratings_total": 81,
  "vicinity": "40A Orchard Road MacDonald House #03-00"
}