{
  "formatted_address": "211 New Bridge Rd, #04-01 Lucky Chinatown, Singapore 059432",
  "geometry": {
    "location": {
      "lat": 1.2837033,
      "lng": 103.843326
    },
    "viewport": {
      "northeast": {
        "lat": 1.285133780291502,
        "lng": 103.8446277302915
      },
      "southwest": {
        "lat": 1.282435819708498,
        "lng": 103.8419297697085
      }
    }
  },
  "name": "HaveFun Karaoke (Lucky Chinatown)",
  "place_id": "ChIJIYK2Ov4Z2jER1UtAKWMNW4o",
  "rating": 3.8,
  "reviews": [
    {
      "author_name": "Quing_刘妈妈",
      "author_url": "https://www.google.com/maps/contrib/113415962335886718172/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVS2hEqYL88GyxsO7cgqfLj8FV-o8ecnfYBoMlc1Q8x41jkxD5_=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "3 months ago",
      "text": "HaveFun Karaoke@Chinatown, located on the 4th floor of an old building mall, offers a fun karaoke experience. We went on a weekday night after dinner in the nearby area and ordered a jug of water. Overall, the experience was great. The VIP room looked awesome and added to the experience. We’ll definitely come back again for more singing fun!\n\n2 🌟 - Below Average: Needs improvement in multiple areas, not meeting expectations.\n3 🌟 - Standard, Average: Meets basic expectations, nothing exceptional but acceptable.\n4 🌟 - Standard, Above Average: Exceeds expectations slightly, better than the norm.\n5 🌟 - Special & Unique: Outstanding experience, highly memorable and exceptional.",
      "time": 1739512151,
      "translated": false
    },
    {
      "author_name": "CARROT PEK",
      "author_url": "https://www.google.com/maps/contrib/117264347329628725540/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX0VzW1WXweWjTuxA2Z4wee5ioF2ulWmfv5p8IIQV6cqqCb6S4=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "The location of the shop is strategic and convenient. Right behind of the Chinatown complex hawker centre, nearby to CK store.\nThe service was fast and occasionally you will receive the \"Hong Kong\" style service, as I guess  perhaps the staff have been dealing with alot of stubborn uncle auntie 😉 This branch is always crowded after lunch for coffee, it's clean and bright. ☕️✨",
      "time": 1730815063,
      "translated": false
    },
    {
      "author_name": "Han Lee",
      "author_url": "https://www.google.com/maps/contrib/115116918025714974988/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIF7VJ77EimhXZ4KlhbPKaUBGNX8T0o6SXo9x_rYzif4pVapg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "We went on a Sunday afternoon and it was really quiet. It’s 48++ for the smallest room of 6 pax for a 3 hrs package. Quite worth. Sound system is good and the selection of songs very updated as well. In fact, it’s amazing how most of their English songs are from the original soundtracks! Service was attentive and friendly!\n\nTheir drinks are not the Cheapest though and selection not the biggest.\n\nRooms are nice and big though! :)",
      "time": 1719151958,
      "translated": false
    },
    {
      "author_name": "Lam Weng Keen",
      "author_url": "https://www.google.com/maps/contrib/113336526009167613800/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLXh8wiAbTm3fQ_bY-IEAzVfXuRJGfhjH4lqfWnVz0Cg594Sg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Me and my friends were here and therr was a yellow-dye hair stuff. We wanted to book a room for 2hrs but he overheard us saying smth abt 6pm so he put our room frm 2pm till 6pm and charge us $45 without any explaination. When we came here a few days ago,all plain water and free flow ice creams were included. But this time they charge EVERYTHING and when we go and ask another stuff, He did bot tell us that the ice cream and water is charged and the yellow-dye hair guy just rush in our room very fierce and ask us to pay the extra fees for the ice cream and hot water which is $14.60😅How can some ice cream and plain water cost SO MUCH??",
      "time": 1742551339,
      "translated": false
    },
    {
      "author_name": "xiaorun",
      "author_url": "https://www.google.com/maps/contrib/106898154091252050424/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUIYT9kK9FAk_knSyfvC1zabpjLb8pilFfGqZhaaFG9guuJrQd4=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "Very disappointing experience at HaveFun Family Karaoke (Chinatown).\n\nWe were told by staff member Johnson that a room would be available by 5:04 PM. However, when we returned, the room was not ready, and Johnson offered no explanation as to why the promised room was unavailable.\n\nWhen we politely asked for clarification, he responded with a very impatient and almost threatening tone, repeatedly saying, “Do you want to wait or not?” — making us feel as if we should just leave if we didn’t want to wait.\n\nAt no point did he apologise or explain the situation properly. Instead, he simply instructed us to continue waiting, showing a complete lack of professionalism and courtesy.\n\nThis is supposed to be a service-oriented industry, and it is simply unbelievable that someone with such an attitude is allowed to represent the business.\n\nAfter this incident, I also noticed many other customers had reported similar experiences with the same staff member. It is very concerning that such behaviour is still tolerated.\n\nI hope the management will take this seriously, investigate properly, and take appropriate action to maintain the service standards that customers rightfully expect.",
      "time": 1745675334,
      "translated": false
    }
  ],
  "types": [
    "night_club",
    "bar",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9969576919659727829",
  "user_ratings_total": 125,
  "vicinity": "211 New Bridge Road, #04-01 Lucky Chinatown"
}