{
  "formatted_address": "109 Bukit Purmei Rd, #01-145, Singapore 090109",
  "geometry": {
    "location": {
      "lat": 1.2739482,
      "lng": 103.8252941
    },
    "viewport": {
      "northeast": {
        "lat": 1.275200430291502,
        "lng": 103.8266351802915
      },
      "southwest": {
        "lat": 1.272502469708498,
        "lng": 103.8239372197085
      }
    }
  },
  "name": "Health Partnership Medical Centre",
  "place_id": "ChIJvTWlEmEZ2jERSDFiv30DTCo",
  "rating": 3,
  "reviews": [
    {
      "author_name": "Pei Yi Tang",
      "author_url": "https://www.google.com/maps/contrib/102548438977164854104/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLz0JSXHPqKIMAvoFiwaFmqSsDAZuOtm8O9ZIMhYk1UpPxRay4=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Dr. Cheong has been a very thorough doc to go thru your medical records during my first visit to the clinic to understand your medical history.\nHe managed to cure my nasty bout of flu whenever I had one. Indeed the fee is higher - the pricing is listed at the reception but agree with the others that it beat you having to doc-hop and did not get your cough cured.\nJust a tip to call before visiting - the doc might be on leave.",
      "time": 1739250277,
      "translated": false
    },
    {
      "author_name": "Nicole Yue",
      "author_url": "https://www.google.com/maps/contrib/112975377297399553892/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKOYPScYLmun4h3SXmt7QGAL-EILdJhPjseRC54tVP-MXJjGw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Felt the need to leave a review here as the negative reviews doesn’t do justice.\n\nIs funny how people went to see doctor for a ‘cut / small scratch’ & complained overpriced. I’m pretty sure the receptionist will prompt you about the consultation fee before registration.\n\nI’ve been coughing really badly for over 4 months due to bronchitis. Went to different GP around my neighbourhood but the treatment just don’t work for me.\n\nDrove all the way to this clinic after friend’s recommendation, I must say Dr Cheong is the best doctor I ever met among all the GPs I went to. He is very detailed & even go all lengths to assessed your health records to see what other doctors prescribed you to make sure he prescribed the ‘right’ meds which WORKS for you.\n\nWith his meds & jab, my bad cough instantly felt better (on the same day I visited him) no more sleepless night & recovered within a week?!!!! This really amazed me as NONE of the doctor can cure me this fast especially when I got bronchitis?!\n\nThough his pricing is steep, but I can assure that it is worth it rather than making multiple trips to affordable GPs but longer suffering.\nOne of the cons here is the meds shelf life is very short. other than that is all good!\n\nI highly recommend everyone to try this clinic If you’re first time here.\n\nI’ll definitely come back again, thank you Dr Cheong, you’re amazing!",
      "time": 1734761404,
      "translated": false
    },
    {
      "author_name": "Sharine Lee",
      "author_url": "https://www.google.com/maps/contrib/110363137902624013566/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKrhzW4N8m0fyTDmm8CuoHQYo-gauKOAp81TdXcrhwqrHJfDg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I'm grateful to Doc Cheong for his expertise..my whole family has been seeing him for more than a decade,he help diagnosed my dad cancer many years back and my best friend thyroid cancer as well..His fees may be high but he is very thorough and serious in his job and persistent to get his diagnosis right!!",
      "time": 1736994739,
      "translated": false
    },
    {
      "author_name": "Mubi Uzumaki",
      "author_url": "https://www.google.com/maps/contrib/111681785726562007905/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXmcxcycxWtUbCEPJLNsqG_v8gOVJuXACLrL7kIsKCoufPwWryd9A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Excellent service, excellent doctor with really really outstanding medicines. I really feel so confident that I will be perfectly fine with juz one round of medications. Simply great💯💯💯. Strongly recommend the doctor from this clinic to all. 💯💯💯",
      "time": 1735668617,
      "translated": false
    },
    {
      "author_name": "Saku Devi",
      "author_url": "https://www.google.com/maps/contrib/101030065480389185298/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJRzugBwrGmnOiFN9TNqDYwsLINGs2GsX9uiwuQL8c7ARKZ0ls=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "8 months ago",
      "text": "While I agree that Dr. Cheong is expensive, I must acknowledge that his medication and injection quality are top-notch. The treatment I received was effective and resolved my symptoms quickly.\n\nHowever, I found his bedside manner to be disappointing. He comes across as fatphobic, unempathic, and quite rude. Rather than offering support or understanding, he tends to attribute every health issue to weight, with a clear bias that overweight individuals are lazy, sitting at home, eating, and not making any efforts toward healthier habits. This kind of attitude is extremely off-putting and makes it difficult to feel comfortable or understood as a patient.\n\nIn summary, while his treatments are effective, his prejudiced and dismissive attitude leaves much to be desired in terms of patient care.",
      "time": 1726388919,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3047814886439661896",
  "user_ratings_total": 25,
  "vicinity": "109 Bukit Purmei Road, #01-145, Singapore"
}