{
  "formatted_address": "11 Jalan Tan Tock Seng, Level 2, TTSH Medical Centre, Tan Tock Seng Hospital, Singapore 308433",
  "geometry": {
    "location": {
      "lat": 1.3214119,
      "lng": 103.8461259
    },
    "viewport": {
      "northeast": {
        "lat": 1.322924830291502,
        "lng": 103.8475596802915
      },
      "southwest": {
        "lat": 1.320226869708498,
        "lng": 103.8448617197085
      }
    }
  },
  "name": "Health Enrichment Centre",
  "place_id": "ChIJ41abCd4Z2jERbUqc7pV7Moo",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Chin Hwee Ong",
      "author_url": "https://www.google.com/maps/contrib/113669192245771099140/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ96TMU2R1AhXoXVaYbp6bKylh8_dEgc1__3X3G82Q4UBq7dQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Highly recommended place for annual check up. I come here annually.\nFriendly n experienced nurses. Doctor is detailed with the checking and only recommend necessary tests and follow up based on patient’s medical history and current symptoms.",
      "time": 1746589593,
      "translated": false
    },
    {
      "author_name": "Tracy Wang",
      "author_url": "https://www.google.com/maps/contrib/108672976274036682540/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK2VwLuzzqV2STzr9tyE-cWXx8i_nOPu7AYvlSJaHB3L_9S7Q=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Dr Ang is superb. I always go to her yearly for my health check up. She is patient and detailed in her explanation.",
      "time": 1745807066,
      "translated": false
    },
    {
      "author_name": "Renee Liu",
      "author_url": "https://www.google.com/maps/contrib/106917043711097834165/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVldTd6gpAOn-n4-7jbKEeomAqndCa3ffxTIjwWPD-ldtow11I=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "Update of July 2024 visit- I came here again for my annual check up and I would recommend more as they have your historical profile. Different doctor (Dr Liam) this year but same level of professionalism. Please always remember to take care of yourself, a strong body is the foundation to bring you anywhere you want to go.\n\nBelow was my original post of July 2023.\nFirst time here to do my annual health check up and I am extremely impressed by the professional services provided here, this is the best health check up center I have experienced in Singapore, way much better than those private owned clinics and I will definitely come back for the future check up. Let me tell you why it worths all the credit that other check up centers might not have.\n\n1. No oversell or over-check at all. Unlike other check up center that you have to choose your screening package first before coming, the process here is different, you only need call in to make an appointment with doctor first and then you will only need make choice after talking to the doctor base on the preliminary examination and consultation with doctor.\nDr Loi Tsuan Hao is so good, he will recommend the test that is necessary based on your age, life style and medical history, he actually told me a lot of the other tests are not really needed and there is no need to over do the test.\nI prefer his approach compare to we as non medical professionals to choose a screening combination package purely base on price or base on what we heard from other people were doing.\nThe other very valuable thing Dr Loi doing to all the patient was he can use very simple language to explain the health concept. He started with the statistics of overall population and then land on the individual life style and potential issues and put up his recommendations. He can communicate very clearly and well in both English and Mandarin , so as the other nurses. And yes, all the nurses are also very professional, helpful and kind.\n\n2. Clear and efficient workflow and attention to detail. Since it is part of TTSH, so you can finish all the checkup in one building. Waiting time is quite reasonable, there are always nurses attend to you and guide you to the next step when you finish the previous process.\nThere are two other things i want to highlight about their attention to detail.\nFirst, the gel they use to do ultrasound and the hands of doctors and nurses are all WARM when they are doing the check up, you will definitely appreciate these details.\nSecond, the first time I went there I just finished my period one day before, in other check up center, they will still collect the urine and stool sample anyway, but here they insisted that they can wait the second time when I come to collect reports to collect the samples to avoid any noises to the results. For the result of urine and stool, they will email me later.\nPeople, please take care of your body , although schedule a health check up can not assure your health , it is a great way to help you know yourself in some meaningful measures and make proper adjustments when necessary, a healthy body can bring you to achieve other bigger goal in life !!!",
      "time": 1723532354,
      "translated": false
    },
    {
      "author_name": "Zhonghao Ng",
      "author_url": "https://www.google.com/maps/contrib/105099824035035636620/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIXg2JEYoSMIdJMo4CXFnT3eMMoKu_2ftH1MOrFESgMmihnnw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Excellent medical check-up experience with friendly nurses and doctor",
      "time": 1747189314,
      "translated": false
    },
    {
      "author_name": "Norhaslinda Binte Ramly",
      "author_url": "https://www.google.com/maps/contrib/116787738143465393830/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWAoec5AVKBVd2B5vZL219ivRQ09yLRh80vZ95dfL6eWP1-3JF8=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Been doing my yearly annual health screening past few years. Good service, friendly staff and nurses and the doctor is always friendly and takes the time to listen and explain further. Environment is quite and relaxing too.",
      "time": 1665631119,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9958157609953151597",
  "user_ratings_total": 22,
  "vicinity": "11 Jalan Tan Tock Seng, Level 2, TTSH Medical Centre, Tan Tock Seng Hospital"
}