{
  "formatted_address": "11 Tanjong Katong Rd Kinex, #B1-17, Singapore 437157",
  "geometry": {
    "location": {
      "lat": 1.3143724,
      "lng": 103.8944394
    },
    "viewport": {
      "northeast": {
        "lat": 1.315714230291502,
        "lng": 103.8958917302915
      },
      "southwest": {
        "lat": 1.313016269708498,
        "lng": 103.8931937697085
      }
    }
  },
  "name": "Healing Hands Chiropractic - Paya Lebar Chiropractor Singapore",
  "place_id": "ChIJ5QF5yQ4Z2jERlkVymaEyhGI",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Thian Huixin",
      "author_url": "https://www.google.com/maps/contrib/113849716433035711571/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL-GRHbf9LzQJBWu8K3jPSQi-AExv462l9IouYyAAN3tqO2rQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I’ve been seeing Dr. Jack for chiropractic care for >2 years, and I couldn’t be more impressed with the results. From the moment I walked in, the office had a warm, welcoming atmosphere, and Dr. Jack & team made me feel comfortable and listened to. He takes the time to thoroughly assess my concerns and explains each treatment in detail. I’ve seen a significant improvement in my back pain and posture and I always leave feeling better than when I came in. Dr. Jack is knowledgeable, professional, and genuinely cares about his patients’ well-being. I highly recommend him to anyone looking for quality chiropractic care!",
      "time": 1734537706,
      "translated": false
    },
    {
      "author_name": "S W",
      "author_url": "https://www.google.com/maps/contrib/117029490332765470840/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJZPBnhKPgG_l08shmOKn9VZlCZTSyHBpTHuOxZ5qzEx-XJ0w=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "I’ve been a long-time client of Healing Hands and was initially very impressed with the care I received, especially from Dr. Jack, who helped resolve my long-standing neck issues. I’ve been following him since the pre-COVID days and genuinely appreciated his professionalism and effectiveness.\n\nHowever, I’ve been disappointed by how things have changed over the years. The fee has jumped significantly -from ~$135/per session to ~$155 previously to now ~$215. This steep price increase feels excessive and quite unreasonable, especially considering it wasn’t accompanied by any noticeable improvements in service or facilities. It gives the impression that the clinic is capitalizing on clients with corporate insurance, which is disappointing to see.\n\nWith Dr. Jack no longer at the clinic, I’ve decided not to return. There are many other chiropractic options out there that offer excellent care without the inflated pricing. It’s a shame to see a place I used to recommend so highly lose its authenticity and value over time.\n\nUpdate since I cannot reply directly to the owner's response(Visited on 5 April):\nJust dropping a quick reality check here. I visited AFTER your price hike and saw zero “value-added modalities” as claimed. The session was exactly the same as before - no enhancements, no new elements. Let’s not dress up a price increase as an upgrade when nothing’s changed.\n\nAlso, the new receptionist was… something else. I said I was using Amex (as I always have), and she kept repeating “Amex? Amex?” like it was a foreign word. When I asked about the sudden spike in pricing, her response was just “errrrr… errrr…” followed by more awkward silence. If pricing changes were truly made after “thoughtful consideration,” maybe your front desk should be able to articulate something.\n\nWe’re not uneducated, we notice when things don’t add up. Don’t try to sell smoke and mirrors. Sad to see a place I used to trust turn into just another clinic capitalizing on insurance and charging more for the same. Highly not recommended!",
      "time": 1745384412,
      "translated": false
    },
    {
      "author_name": "Tay Yanzi",
      "author_url": "https://www.google.com/maps/contrib/105342032338945127490/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKUsFFCloe3Ay4sw-9RjGdu5rHFAW6DRVNe9MQWOHN2D6cxEQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Dr Jenessa has been very accurate in her assessment of my spine and muscles issues every session and skilful in her adjustment. There is a 90% improvement from where I started - misaligned lower back. The staffs are friendly, polite and sincere.",
      "time": 1747135167,
      "translated": false
    },
    {
      "author_name": "Ckay Chong",
      "author_url": "https://www.google.com/maps/contrib/104283184641375749560/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWU0djrV-ZDYiCReB1DLLe5odgjqEnJ5Ei6Wmhvu2Y0dtGu_WvC=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I was searching for a chiropractic clinic that fit my schedule and came across Healing Hands. That’s where I was introduced to Dr. Jack. His detailed explanation of my diagnosis gave me confidence, and I decided to stick with him throughout my chiropractic journey. Thanks to his expertise, my upper backache has improved tremendously. Happy body, happy soul! Wishing him all the best!",
      "time": 1741416595,
      "translated": false
    },
    {
      "author_name": "Silvester Leong",
      "author_url": "https://www.google.com/maps/contrib/109901111001673468848/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI0DOv7aL-gnUDP2GN9_6DqQ31tPbO9BK0ygOSCzu7HXbNbDQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Dr. Jenessa has helped alleviate my chronic neck pain. Her expertise extends beyond just treating the initial issue, as she also takes the time to address other areas of discomfort in my back. Her adjustments have greatly improved my overall well-being, and I appreciate the attention and care she provides during each treatment session. The entire team is also courteous, helpful, and accommodating during each of the sessions and with scheduling of the appointments.",
      "time": 1739522667,
      "translated": false
    }
  ],
  "types": [
    "physiotherapist",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7098854582288270742",
  "user_ratings_total": 433,
  "vicinity": "11 Tanjong Katong Rd Kinex, #B1-17"
}