{
  "formatted_address": "118 Rivervale Drive, Rivervale Plaza, #02-17, Singapore 540118",
  "geometry": {
    "location": {
      "lat": 1.3855939,
      "lng": 103.9019834
    },
    "viewport": {
      "northeast": {
        "lat": 1.386875380291502,
        "lng": 103.9034175302915
      },
      "southwest": {
        "lat": 1.384177419708498,
        "lng": 103.9007195697085
      }
    }
  },
  "name": "Healthway Medical (Rivervale)",
  "place_id": "ChIJDaggbhcW2jERJQNIFgsOvOg",
  "rating": 2.8,
  "reviews": [
    {
      "author_name": "Chin Kok Leong",
      "author_url": "https://www.google.com/maps/contrib/106241934997453928549/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ6dy4ZB7oVdBdU9j5M9Q_ALFZyff4amHuu8jhkc4k5rp4pUw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Dr Tang is an excellent doctor for my whole family. We have been seeing her and be her first patient whenever we need to visit the clinic. Treatment is always detail and thoroughly examined. This explain the longer time per patient.\n\nThe clinic staff are also helpful and friendly. Some retired staff too since we have been long with the clinic led by Dr Tang.\n\nThank you for the service, Dr Tang and team to this community and being patient with us.",
      "time": 1742353610,
      "translated": false
    },
    {
      "author_name": "Ashley",
      "author_url": "https://www.google.com/maps/contrib/101763395937153668109/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLGJKkoe8HsMYjXSWKYNQ6d8qICJ-kavo581X_AatjSww8eMA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "As a first time patient at this clinic, the receptionist was incredibly welcoming and professional from the moment I walked in. The lady staff serving me was very helpful with my inquiries which made the check-in process smooth and hassle-free. The rest of the staff were also friendly and attentive, creating a comfortable and pleasant environment. They greeted me with a warm smile, was very helpful with my inquiries, and made the check-in process smooth and hassle-free.\nI really appreciate the excellent service and will definitely be returning!",
      "time": 1744650454,
      "translated": false
    },
    {
      "author_name": "Wirdawati insyirah",
      "author_url": "https://www.google.com/maps/contrib/101479444978674972174/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJmND3kLKo4EdoRjqjPZfPhjgDaidJ9HDK00xYKgQdpHwoaxA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I had a great experience at Healthway Medical Rivervale Plaza. The receptionist was very friendly, approachable, and professional. She handled all the patients with patience and care, making the check-in process smooth and efficient. It’s always nice to be greeted with a smile and treated with respect, especially when you’re not feeling your best. Keep up the excellent work!",
      "time": 1744771265,
      "translated": false
    },
    {
      "author_name": "Satish Boi",
      "author_url": "https://www.google.com/maps/contrib/107909171562670424136/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVtVqnsSmRiwuP2uaY1IQ_n93PYzV6QZlxfFQR-IKWKYvirRWY=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "The front desk staff at this clinic are exceptionally professional and welcoming. They handle appointments efficiently, answer all questions patiently, and always greet patients with a warm attitude. It really sets a positive tone for the entire visit. Excellent service!”",
      "time": 1744649355,
      "translated": false
    },
    {
      "author_name": "Chelsey MN",
      "author_url": "https://www.google.com/maps/contrib/116351244809472780045/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIEDS0zqiWTzAVhoNWxDG4Frz8r9cyTJzWZfrRA1bN34mhHSw=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "Process was smooth and the numbers went by quickly. We were served by Doctor Desmond Yang who was a knowledgeable, down to earth and funny doctor. Even though I went in with a lot of pain and discomfort, he could make my mum and I laugh. I really appreciated that. When collecting the medication from the counter staff, my mum asked for the name of the Doctor and said she would want to look for him from now onwards because he was only a temporary doctor here. She was obviously joking and said that with a laugh because of how comfortable our experience was. I think it is a great compliment for a doctor to have because his patients are thankful. However, the indian counter staff behind the lady that was serving us made rude eyes at my mum and made snarky remarks which was rather uncalled for. She did this behind my mum’s back, not knowing that I noticed it from my angle. What was so wrong with what my mum said? She was complimenting the doctor yet she got weird stares from a lady that was not even serving us. Really uncalled for. I could not tell her off as I was not well but it honestly broke my heart to see someone treating my mum this way. Really unprofessional. Please refrain from doing so or be more aware of your surroundings. The lady looked young and my mum is 54 so please have a heart. That said, thank you to the Doctor and the lady that gave us the medication.",
      "time": 1744598363,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16770294553202131749",
  "user_ratings_total": 142,
  "vicinity": "118 Rivervale Drive, Rivervale Plaza, #02-17"
}