{
  "formatted_address": "Sunshine Place, Choa Chu Kang Ave 3, #02-03 475, Singapore 680475",
  "geometry": {
    "location": {
      "lat": 1.3781449,
      "lng": 103.7389102
    },
    "viewport": {
      "northeast": {
        "lat": 1.379360280291502,
        "lng": 103.7401692802915
      },
      "southwest": {
        "lat": 1.376662319708498,
        "lng": 103.7374713197085
      }
    }
  },
  "name": "Healthway Medical (Sunshine Place)",
  "place_id": "ChIJJURpbNsR2jER4dCYTh7fKrk",
  "rating": 3.8,
  "reviews": [
    {
      "author_name": "Ching Yee Leng",
      "author_url": "https://www.google.com/maps/contrib/101914402892033735848/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIAHaUN5Huv9S6GaakcCjvEDg3vhqiWisPMfUgOKl8RYMpIww=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "very bad experience. I went there with 39.7°，fever about 39.7° to 40.2°about 2 days never improve，follow Google review then decided to visit this clinic.The frontline not helpful and no response when i ask for help，when I told her can help me fill the form because i fill giddy and whole body shaking, She like never look at me and also no answer me, i tot she cannot hear my voice then i call her 2 times then She just answer with inpatient face ask me to wait.\nThe most important is evening shift no one can do Flu test, even doctor also cannot do,not sure my sickness then give me influenza medic after i ask doctor it is i get influenza. Ok！overall 140sgd nit worth with the service but the medic did work on me.",
      "time": 1747137130,
      "translated": false
    },
    {
      "author_name": "Hari Krishna",
      "author_url": "https://www.google.com/maps/contrib/112009077719427459070/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJi0SkLFtnfUpPN00gSW3EEM4ngUcyjb2lcWKyNSa7oxIYugg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I had a pleasant experience when I visited this clinic. I was greeted with a smile by the front desk staffs in the name of Kayathri, Alice and Wiyah. They were very polite and humble. Also they explain to me on payment procedures and how to take medicines as required. Doctor Wee and Ooi yong advice me accordingly on how I can recover from my sickness and wish me speedy recovery which made my day even better. Overall this clinic is my go to clinic when I'm feeling unwell. Thank you for the management that runs this clinic, You guys are doing a good job! :)",
      "time": 1733907274,
      "translated": false
    },
    {
      "author_name": "JUN YEH LOW",
      "author_url": "https://www.google.com/maps/contrib/102072633841848330791/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ56GXc8c866O7vxPNMEP0MD4_UB5j0KLc6rIbzDi1WcJNxrw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "I visited Healthway Medical on 8 Jan 2025 (edited) around 7:30 PM, but the receptionist refused to give me a queue number despite there being only six patients ahead of me and the clinic's closing time being 8:45 PM. I explained that I was feeling very unwell, but she still refused to assist me. The lack of compassion and service was extremely disappointing!",
      "time": 1736845564,
      "translated": false
    },
    {
      "author_name": "ira shafazirah",
      "author_url": "https://www.google.com/maps/contrib/109263262352272395122/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX8pT4hbX4orxRkdpjulSFKvLhdhZY3OK483XmzPoM5FATbB9O42Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Great customer service and polite staffs that help me during my visit. Thank you Alice, Wiyah and kaya for the excellent service and well explained of medications. Not forgetting Dr. Hu very understanding and helpful.",
      "time": 1734920098,
      "translated": false
    },
    {
      "author_name": "Gerald Chong",
      "author_url": "https://www.google.com/maps/contrib/114425911518758458388/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJxh1LbANYLqwA9mPBVP54WkpKt9bU_Qswa-rcCXOUHOULFKw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "I am writing to express my extreme disappointment and frustration with the level of service I recently experienced at your clinic. My recent visit has left me utterly dismayed at the lack of compassion and basic care provided by your staff.\n\nAfter waiting in a lengthy queue to see a doctor, I was shocked to be informed that your clinic does not provide masks for patients. This seems both inflexible and miserly, wearing masks outdoors is not mandatory at the moment and most people will not be wearing masks before heading out of homes.\n\nIt is disappointing to note that while your clinic expects patients to wait extensively to receive medical attention, you do not seem to acknowledge the importance of offering the most basic protective equipment, and expecting the sick patient to purchase their own masks before heading to see a doctor.\n\nHospitals and medical facilities worldwide understand the significance of providing masks to patients who might be contagious or vulnerable, so why does Healthway Medical not prioritize this?\n\nThe decision to not provide masks raises questions about the clinic's commitment to the wellbeing of its patients. Is it a matter of cost? If so, I find it hard to comprehend that a medical establishment cannot allocate a small portion of its resources to ensure the safety and comfort of its visitors.\n\nI implore you to reconsider your stance on this matter. Providing masks to patients is not merely a convenience; it is a sign of the clinic's dedication to public health and safety. It would demonstrate that you genuinely care about the welfare of your patients, even beyond the medical services you provide.\n\nLike seriously.",
      "time": 1692675900,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13342722167299166433",
  "user_ratings_total": 153,
  "vicinity": "Sunshine Place, Choa Chu Kang Avenue 3, #02-03 475"
}