{
  "formatted_address": "10 Sinaran Dr, #09 - 36, Singapore 307506",
  "geometry": {
    "location": {
      "lat": 1.320281,
      "lng": 103.844022
    },
    "viewport": {
      "northeast": {
        "lat": 1.321454530291502,
        "lng": 103.8448960302915
      },
      "southwest": {
        "lat": 1.318756569708498,
        "lng": 103.8421980697085
      }
    }
  },
  "name": "Healthway Medical (Novena Medical Centre)",
  "place_id": "ChIJhYFOg-cZ2jER8r3xSiexzyc",
  "rating": 3,
  "reviews": [
    {
      "author_name": "CL",
      "author_url": "https://www.google.com/maps/contrib/101663035125576353358/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWNY1iRwsuJRFzdCz8kaVWP-vXMgqz3rHTyl3wxFCImTOyXYjCu=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Female dr on afternoon duty was not empathetic and meticulous. Just felt that she was rushing through the consult and didn't even inform what medications she intends to prescribe for me. Had to tell her my medication request and needed to clarify if she will issue MC. She even told me to wait outside for clinic assistant who will tell me more, dude is that what to expect from a Dr? I paid $40 for her to tell me to wait outside for more instructions from the clinic assistant. Was out in less than 3 minutes. As a patient, I don't feel heard and assured on my symptoms/ concerns about my medical condition.\n\nThe Dr prescribed me with Xepagan 5 Elixir which she stated for cough suppresant, Ive went to google and none of the website online states that it is for cough but itch, nausea and hay fever. Seriously, did the Dr just prescribe a WRONG MEDICATION???\n\nHave previously seen Dr John before who was way better and professional as a Dr. He was patient to hear me out and was clear about my diagnosis and prescribed medications, suggest to avoid if Dr John is not on duty.",
      "time": 1744813833,
      "translated": false
    },
    {
      "author_name": "Harriet Dias",
      "author_url": "https://www.google.com/maps/contrib/102667408461637782768/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLQG1jmFWYZ7re6weQ_t82mmTW0XsvChEB1TWL4UjC6EuIvww=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "I went in to do a urine analysis for my life insurance. (FWD insurance)  They kept me waiting for a long time and then told me that they are not sure whether they can accept the letter as they will have to check with the corporate office. In fact I had called up & checked with them earlier & they said you can just walk in for the test.  Why waste my time when I have to go to work? Why tell me to come in if they don’t know?\nHow can the service staff be so ignorant? They are on the list of the insurance company for people to come & do their tests. I had also taken a letter of authority from the insurance company. They definitely need training as Singapore is known for it’s customer service.\nInstead of wasting my time, they could have told me this from the start itself.\nI have always encountered such prompt service in other clinics & I am extremely disappointed with the attitude & service of the staff. There was no remorse for wasting my time & when I said I will be going to another clinic, they said ok as if they were waiting to get rid of me & continue chatting.\nPlease avoid going to this place for any tests related yo insurance.  They are better clinics out there with exceptional staff as well as service.",
      "time": 1734662785,
      "translated": false
    },
    {
      "author_name": "Nancy Lobo",
      "author_url": "https://www.google.com/maps/contrib/109592428680709869454/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI7Dl6Lo5HcPEy3a4rRDyJDrP3iGVglB5R_xC723ry8nYyPPQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "Terrible experience with the lady doctor on duty on 27Dec. After telling her I’m suffering from vertigo for 3 weeks. She refused to listen and just prescribed the similar medicine I had already been taking. Totally miserable and inexperienced. Just referred me to a specialist to get more referral commission perhaps.waiting for my ear to get infected and probably fall while I’m suffering from vertigo. Totally impractical and strange person.\nBetter avoid if Dr John is not there anymore.",
      "time": 1735285620,
      "translated": false
    },
    {
      "author_name": "Harith Azaif",
      "author_url": "https://www.google.com/maps/contrib/101859753660650042950/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLPUjGtCS1QWlhtAzmlM0S43s-NIygiixLKZHC-vfbh098Vpg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "rude staff . my wife got rejected from register for medical checkup at 1150 and your guy said come back at 2pm . thats not even close to your break lunch and close at 12 open back at 2pm!!! 2hours i need to wait . waste so much time 👎🏼",
      "time": 1742796838,
      "translated": false
    },
    {
      "author_name": "Chun Y. Chua",
      "author_url": "https://www.google.com/maps/contrib/107734404694595139427/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUL2YjtiKR73iY8uWpuqVwqyP4_9nTOyk-9RiROs6vOMUsHHmlc3Q=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "I saw Dr John Cheng who was very smart, clear, kind, up-to-date with info and caring. I did a walk in and the nurses were very helpful and quick, even there were many patients, they were smooth and efficient and polite. I highly recommend and this place will be my preferred doctor & clinic now on.",
      "time": 1644921264,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2868706269977492978",
  "user_ratings_total": 69,
  "vicinity": "10 Sinaran Drive, #09 - 36"
}