{
  "formatted_address": "164 Bukit Batok Street 11, #01-152, Singapore 650164",
  "geometry": {
    "location": {
      "lat": 1.3477688,
      "lng": 103.7428396
    },
    "viewport": {
      "northeast": {
        "lat": 1.349192630291502,
        "lng": 103.7441852802915
      },
      "southwest": {
        "lat": 1.346494669708498,
        "lng": 103.7414873197085
      }
    }
  },
  "name": "HeartlandHealth Bukit Batok",
  "place_id": "ChIJN3LgxVsR2jERyHBzYhk2VIQ",
  "rating": 3.2,
  "reviews": [
    {
      "author_name": "Chen Anni (Rvhs)",
      "author_url": "https://www.google.com/maps/contrib/110110820994746456234/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKSg0MJrZGY4c9V2ql6FnjURKCkACmzoKGhHLALKe0yNFakUQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Tbh this place isn’t so bad like the review says anymore feel like the clinic read the reviews and made changes accordingly. There was one nurse at the counter doing three jobs(registration, giving the medication and taking the height and weight of the patients) and the 效率was pretty good considering that fact. Doctor seemed experienced :D staff was relatively friendly ig",
      "time": 1735481137,
      "translated": false
    },
    {
      "author_name": "Joey Lim",
      "author_url": "https://www.google.com/maps/contrib/114103166012661334709/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWSuLyQ69JFnBU2F0DAEIIKErt5VTSlNo__2PODUifP9G0EYWaw7Q=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 2,
      "relative_time_description": "11 months ago",
      "text": "Never been to any clinic worst than this. Unfriendly, impatient doctor and workers.\n\nFirst and last time here. Rude receptionist, there wasn't even a queue but they cannot do their job politely. Never ask if we have any insurance coverage also, then say \"You never say earlier\", so can i say \"You didn't ask\" ?\n\nThen go into the doctor's room. The patient before me went in for less than 60 seconds, yes you did not read it wrongly, less than 60 seconds, what consultation is this? Then i understood when i stepped in. The doctor keep rushing things and show his impatience towards me. Its not even lunch time ok! You have one job.\n\nThen comes the collection of medicine. Well the medicine provided was definitely what was needed, then I went for breakfast so I can take my med, then i realise, the lozenges provided we all melted! How did y'all even store your medicines? Lozenges for sore throat should be hard like a candy, but melted and chewy? Terrible clinic.",
      "time": 1718093080,
      "translated": false
    },
    {
      "author_name": "Cindy Ng",
      "author_url": "https://www.google.com/maps/contrib/102794140126844022676/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIhm7t1QTPA3bJO5dYSG3a7Tn09KhnlNNXsQ4jQwC4nY7X4bIo=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Me and my family had been visiting this clinic for more than a year now since we moved to this area. Every visit was pleasant, receptionists and nurses are always kind and respectful. This morning we visit again as my child required a doctor memo to certify fit for school. Dr Lee is very detailed and explained my questions clearly. One of the nurse even gave my boy a candy. I am not sure why they have low ratings as it's always a pleasant visit for me and my fam. I hope the service quality provided to us will be maintained. Thank you to all the nice staffs :)",
      "time": 1698202836,
      "translated": false
    },
    {
      "author_name": "ENYU",
      "author_url": "https://www.google.com/maps/contrib/117300132182022604388/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ9JQz84TMRDbmZPwJtX0ZbGQ7qMlwZ2Bwxy5e_04pnxvLECQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Went over to the clinic earlier and was really pleased with how fuss free and quick the processes were. Many thanks to the two counter staffs (Chinese male & Indian lady) for their patience with me during pre-visit measurements and while I sort out my company e-card usage 🥰\n\n(Also, am really impressed with how fluent the lady is, in mandarin, as she communicates with another elderly patient on the medicine consumption 🙈)",
      "time": 1691925013,
      "translated": false
    },
    {
      "author_name": "Ow Yong YW",
      "author_url": "https://www.google.com/maps/contrib/118035745602152977132/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI9UdEFh-h4pya7g0neLYF7cjNPY3PC2jSOeTiPog9SRtRTcA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "10 months ago",
      "text": "bukit batok clinic. very rude counter staff. plump guy attending rhe registration. partial golden hair. been here seeing doc with my kid for many many yrs > 6 yrs. at the registration , i show him my kid csc card. then he ask for the birthcert. i told him my records are inside. just key will know. he insist to see birthcert, in the end i just show him singpass details who will bring birthcert??  who?  then i ask him why need now cos my records are all in. key in will know. does not need to verify. then he say in rude tone. i working here fir 2 yrs. eveytime i ask.  but. i nev see him before in this clinic. tell me. see in front urself.  the malay gal was the best. medicine is bottle type. she put the lozenges right at the bottom. then place all bottled with cap not upright but resting side way on top of the lozenges.\nthe past service were all very gd. why become like this. totally dun know wat is called customer service\nbecos if this. i went to see the reviews. omg was i shock. so many negatives reviews abt the staff here recently.\nand u does not seems to do anything abt the service.",
      "time": 1719884312,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9535305793703997640",
  "user_ratings_total": 32,
  "vicinity": "164 Bukit Batok Street 11, #01-152"
}