{
  "formatted_address": "1 Irving Pl, #01-27/28, Singapore 369546",
  "geometry": {
    "location": {
      "lat": 1.3361782,
      "lng": 103.8864248
    },
    "viewport": {
      "northeast": {
        "lat": 1.337571130291502,
        "lng": 103.8875171302915
      },
      "southwest": {
        "lat": 1.334873169708498,
        "lng": 103.8848191697085
      }
    }
  },
  "name": "HEJIO",
  "place_id": "ChIJIybiDVYX2jEReGj0hB-uOdk",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Joeysfooddiary",
      "author_url": "https://www.google.com/maps/contrib/115139228972046029972/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWlP5F2m52hQVW-xmHq0yQPncGJgSlhBsu8BTymavauo4OioU-p=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "We checked out this Restaurant/Bar located at Tai Seng which serves mouthwatering local dishes with a twist and craft beers ~\n\nWe tried the following:\n》Meltique Beef Cubes | The grilled beef cubes had a great marbling on them and were juicy, every mouthful was delectable. The mustard and salt on the side balanced out its meatiness. This would certainly go well with the craft beers that they offer, definitely a must-try.\n\n》Soy Sauce Chicken Rice Bowl | The chicken thigh was tender and packed with flavour (it was marinated in their in-house soy sauce plus various spices). The oozy onsen egg and green peas added another layer of umaminess to the dish which was so delightful.\n\n》Spicy Karaage Bao | The contrast of textures between the crispy fried chicken pieces and the delicate bao (bun) was lovely. It was drizzled with a special spicy mayo sauce which gave that extra kick, so satisfied with them.\n\n》Menbosha (Shrimp Toast) | Perfectly fried bun (mantou) with its crispy golden brown exterior and moreish shrimp filling. It came with a chilli dip on the side which complimented the menbosha, got addicted to it after the first bite - I could probably eat 6 of these in one seating (sorry not sorry hee).\n\n》Baby Peach @rockyridgebrewing | I really enjoyed how smooth this IPA was with its fruity (peach) taste + aroma. It wasn't too bitter and had a soft/creamy mouthfeel.\n\nThey offer local breakfast during the day (coffee, toast and sandwiches) and local dishes plus a great selection of beverages at night.",
      "time": 1680687463,
      "translated": false
    },
    {
      "author_name": "Martin Chan",
      "author_url": "https://www.google.com/maps/contrib/109128816127264362444/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV5kheV8MgA5Zgkr56T-r_mU6Dp56tXLjmpizFg_f9lbnNUE_0=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "This is a little gem of a place hidden in Tai Seng industrial area. Discovered it while waiting for my iPhone battery replacement upstairs in the same building. Friendly staff. Spoke to one of the 3 partners. It’s actually a craft beer place serving the workers in the area. Tried the Kong Bak Bao, served on a bed of fries. Meat was tender, sandwiched together with some mesclun greens. Not a usual combination but it worked for me. The bao had a hint of sweetness, not airy but soft, and held together well, not like the regular supermarket kind that split at the fold. Fries were tasty, not too salty, crispy outside but soft on the inside. Lovely! Kopi (local coffee) was also very good. Was treated to complimentary Mingo ice cream after my meal. I look forward to returning again to try the beef cubes with some beer.\nUpdate: I recently went back. Delicious beef cubes! Tasty and tender. Must try also. Craft beer was unique and good. I had what was described as a peach IPA. Would definitely come back again when in the area and needing a place to chill.",
      "time": 1679132644,
      "translated": false
    },
    {
      "author_name": "CP",
      "author_url": "https://www.google.com/maps/contrib/113861923464679544218/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX12jQdPullVvmdJ_F9lzja7BzbsejtQ6gORrDzIGMNfBvWRpEM=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "2 years ago",
      "text": "Chanced upon this place while looking for a nearby place on Google Map to eat and chill. While I had been exploring and visiting eating places in Upper Paya Lebar Road/MacPherson area, somehow this is the first time I come to this stretch of shops (if you live not too far and have not explored this area for eating joints thinking that this is just an industrial place, it is quite fun to just walk this area as many new food joints sprung up in the last couple of years). What I find good here is the Kong Ba Bao and Fried Yam Cake. The Kong Ba Bao is very satisfying with thick and juicy piece of braised pork pork belly. The Fried Yam Cake is probably the best I have eaten. It is unlike the usual ones that feel somewhat springy due to added flour and starch. This one feels like eating pure mashed yam and there is a strong umami flavour of dried shrimp. It is so good.",
      "time": 1683724244,
      "translated": false
    },
    {
      "author_name": "ronnie chan",
      "author_url": "https://www.google.com/maps/contrib/106831360238977482868/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJD0BCCnIdNJkAYxlzrkbgZp_ZFTPc1PzIMr9xYI5bAtwiBdA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "A great place to chill and dine! Their fried yam served with their Ah ma traditional chilli is definitely must try. Enjoyed their ultimate comfort food and super friendly staffs here.",
      "time": 1674144765,
      "translated": false
    },
    {
      "author_name": "Chris Chris",
      "author_url": "https://www.google.com/maps/contrib/117892105302570194393/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWIoJKUH_D_MeWad-YSx4W_2ul01JVATv80gHrNvOjlQvniC0sU=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "2 years ago",
      "text": "A great place for lunch with quite alot of bite size dishes to offer. I had the Grilled chicken bun and it was delicious. I also ordered the signature fried carrot cake and it turned out well.",
      "time": 1678276626,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15652733430300698744",
  "user_ratings_total": 36,
  "vicinity": "1 Irving Place, #01-27/28"
}