{
  "formatted_address": "LG2-23, RESIDENSI TELUK PUTERI, JALAN TANJUNG, Puteri Harbour, 79000 Iskandar Puteri, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.411738,
      "lng": 103.656844
    },
    "viewport": {
      "northeast": {
        "lat": 1.413048580291502,
        "lng": 103.65780995
      },
      "southwest": {
        "lat": 1.410350619708498,
        "lng": 103.65394615
      }
    }
  },
  "name": "Heritage Whisky",
  "place_id": "ChIJL466glYN2jER4pE1YVGMVR4",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Rube A",
      "author_url": "https://www.google.com/maps/contrib/112269147345678232182/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW3ZJoKCQsueXIdKKI33xVurdE2r7T0XqAYHekrlgufm0EoLjJoRw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Loved their customer service and how attentive they were. Prem even got the staffs to come in earlier as we wanted to come over at 3pm(their opening time).\n\nThe first image captures a generous platter that brings together a harmonious mix of land and sea delights. The succulent grilled lamb and chicken appear perfectly charred, offering a robust smoky flavor that contrasts beautifully with the freshness of the accompanying salad. The seafood elements—juicy prawns and cuttlefish—are likely to add a briny sweetness, balancing the rich meats. The fries and sauce on the side complete the dish, providing both texture and a flavorful dip to elevate each bite.\n\nThe second image highlights a fresh Japanese oyster, which is evidently a standout feature of the meal. This oyster is a masterpiece on its own, nestled in its shell. The touch of whiskey adds an unexpected layer of depth, infusing the oyster with a subtle warmth and complexity that complements its natural brininess. The whiskey enhances the oyster’s sweetness while adding a sophisticated kick, making it an indulgence that seafood lovers would truly appreciate. This combination of fresh ingredients and innovative flavoring techniques reflects a high level of culinary expertise and attention to detail.",
      "time": 1724592373,
      "translated": false
    },
    {
      "author_name": "Prabha Gangadaram",
      "author_url": "https://www.google.com/maps/contrib/107462442318542607464/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKLU7-kycfZMo_QEBs_plh10_y1RbvlktTNbLEVWYTEPjvBVA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Good service & with good choices of whisky including independent choices. Tasty food menu\nN i hope can expand further the food menu.",
      "time": 1742657480,
      "translated": false
    },
    {
      "author_name": "Jun Han",
      "author_url": "https://www.google.com/maps/contrib/102432652806403809273/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWBgBdKqLPvWocVMLjouN4UeAWWyNPsQukibek0XEKNEb_fAC6O=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "2 years ago",
      "text": "Staffs are super friendly.\n\nThe steak is indeed very thick, but this has probably made the Center of it not well cooked.\n\nOrange juice was told ‘Fresh’ but I really doubt so. It tasted exactly like the one I’m buying regularly (not from concentrate, no added sugar)",
      "time": 1681048962,
      "translated": false
    },
    {
      "author_name": "Sivapragash Periannan",
      "author_url": "https://www.google.com/maps/contrib/109521570208882125143/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWJk9ELG9DHdBzOKFF1UndgIqgobDien6GTtioM14XPlAICRRo=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "10 months ago",
      "text": "Location and atmosphere here is a win. Sit at the open and enjoy the sea breeze blowing across the straights of Johor. You may also glance the boats or little ferries cruising in and out of the canal close to this property.\nA vast Whiskey collections here are worth a try.",
      "time": 1721403337,
      "translated": false
    },
    {
      "author_name": "Kimberley Howarth",
      "author_url": "https://www.google.com/maps/contrib/114957590885643931784/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKqIRXau89p_qX4D_iPhWPke2K9bpcZNopPSg5xJgvjCHJQZg=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 3,
      "relative_time_description": "10 months ago",
      "text": "This place seems to have a lot of potential. It is very attractive, at a beautiful location over the water, but there were many shortcomings unfortunately. Firstly, I tried to call them multiple times during their advertised opening hours for enquiries. Not a single time did anyone pick up. The call was either forwarded or no answer. They have a very impressive list of whiskies from all over the world... or claim to. But they were \"out of stock\" for at least 10 different types of whiskies that we tried to order that night. The wait staff also don't seem to know anything about the drinks and kept having to ask us to wait while they went back and forth, in and out asking the bartender everything. It was just so frustrating. And the staff kept recommending us the really, really expensive options as alternatives - you gotta be kidding me. The food was pretty ok and arrived in decent time. But also we were the only table the entire night, not sure how they may fare if they were busier. Some of the staff seemed to struggle with English too. The reason I am still giving 3 stars is because the location is so good, and it is a very lovely place to relax in the evenings by the water. So will I come back again? Probably yes. But I sincerely hope improvements can be made.",
      "time": 1720150777,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2185807475309384162",
  "user_ratings_total": 104,
  "vicinity": "LG2-23, RESIDENSI TELUK PUTERI, JALAN TANJUNG, Puteri Harbour, Iskandar Puteri"
}