{
  "formatted_address": "2 Bayfront Ave, B1-32-33-34 & B2-30-31 The Shoppes at, Marina Bay Sands, Singapore 018972",
  "geometry": {
    "location": {
      "lat": 1.2836602,
      "lng": 103.8592707
    },
    "viewport": {
      "northeast": {
        "lat": 1.285198080291502,
        "lng": 103.8610494302915
      },
      "southwest": {
        "lat": 1.282500119708498,
        "lng": 103.8583514697085
      }
    }
  },
  "name": "Hermès Singapore Marina Bay Sands",
  "place_id": "ChIJx4wPggYZ2jERRKDjElrZZXk",
  "rating": 4,
  "reviews": [
    {
      "author_name": "DR SG",
      "author_url": "https://www.google.com/maps/contrib/116544865914211833721/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIqMKT09sEzoH43NSvb9GCT8knzKlwz6oDjrDBqiihi8leqQGQx=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I recently visited the Hermes store at Marina Bay Sands and had an exceptional shopping experience. The store’s ambiance was luxurious and welcoming, offering a true sense of elegance.\n\nA special mention goes to the salesperson, May, who provided outstanding service. She was incredibly professional, attentive, and knowledgeable about the products. May patiently guided me through the selection process, providing valuable insights and making thoughtful recommendations that perfectly suited my preferences.\n\nHer warm and friendly demeanor made the entire shopping experience delightful. May went above and beyond to ensure I felt valued and comfortable throughout my visit. It’s rare to find such dedication to customer service, and she truly represents the high standards of Hermes.\n\nIf you’re visiting Hermes at MBS, I highly recommend seeking out May for a seamless and memorable shopping experience. I look forward to returning in the future!",
      "time": 1736730533,
      "translated": false
    },
    {
      "author_name": "Michelle Koh",
      "author_url": "https://www.google.com/maps/contrib/113005302051880474302/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUu4fMkVpK2nPW8hVIArrh17IreBV7Tdk1FLqZTwY4gW69jbpZZ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "So glad to meet Catherine because I didn't thought that I would be able to bring any bag home when entering. Much to my surprise, I bought the bag I long wanted and Catherine goes the extra mile to help me in selecting the scarf and tie it. Will look for Catherine in future, very pleasant purchase.",
      "time": 1742996609,
      "translated": false
    },
    {
      "author_name": "Fritz A",
      "author_url": "https://www.google.com/maps/contrib/101999164023573273663/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWid5JrdPK2ov-q5-vqgdGHT5B0O4Q449XHUOuPVj-RM4v3YSOa=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "Izzati truly embodies what it means to deliver a world-class luxury experience. During my visit to the Hermès MBS store, she demonstrated exceptional patience and attentiveness, making me feel genuinely welcomed and understood from the moment I stepped in.\n\nWhat impressed me most was her thoughtful and caring approach—not only did she offer valuable recommendations tailored to my own preferences, but she also provided insightful suggestions for my wife’s wardrobe when I asked for her opinion. Despite my wife not being present, Izzati considered her style and needs with impressive intuition and professionalism.\n\nHer deep product knowledge, calm demeanor, and genuine care created an experience that felt personal, elevated, and memorable. Izzati is a shining example of service excellence and a true asset to Hermès.",
      "time": 1745306260,
      "translated": false
    },
    {
      "author_name": "Will Ang",
      "author_url": "https://www.google.com/maps/contrib/102866593346230832747/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUlNgOBTFrR0drUO5Ny2Q2ayVpdhPJ7wLw_tN_2KX4RUda0lVKMZQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Izza is an exemplary staff who is extremely professional, pro-active alongside a personalised approach with deep product knowledge. She also creates outstanding customer experiences by sharing across the breath and depth of Hermes products.\n\nHighly recommended SA to work with anytime.",
      "time": 1737295096,
      "translated": false
    },
    {
      "author_name": "Joelle Hui Lee",
      "author_url": "https://www.google.com/maps/contrib/114406016206318228945/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUB_PyTRg0i5Fptxn_Q8bNBNbjrb4ALghA6qfMv6E3sYLK_7Cdk=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I just wanted to take a moment to express my appreciation for the exceptional service I received here. I was looking for a scarf as a gift and Siti was incredibly patient in explaining and demonstrating different design and colors. She has very warm smile and sincere making me feel truly welcome.\n\nIt’s rare to come across such genuine hospitality, and this experience has made me want to return to the same outlet again. In the end I went out with 2 items :D\n\nAs a Singaporean, it also makes me proud to see Hermes MBS representing the country’s reputation for world-class service.\n\nThank you once again for the wonderful experience! I look forward to my next visit.",
      "time": 1742985801,
      "translated": false
    }
  ],
  "types": [
    "clothing_store",
    "store",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8747636832124248132",
  "user_ratings_total": 212,
  "vicinity": "2 Bayfront Avenue, B1-32-33-34 & B2-30-31 The Shoppes at, Marina Bay Sands"
}