{
  "formatted_address": "140 Upper Bukit Timah Rd, #02-03 Beauty World Plaza, Singapore 588176",
  "geometry": {
    "location": {
      "lat": 1.3417925,
      "lng": 103.7762193
    },
    "viewport": {
      "northeast": {
        "lat": 1.343186180291502,
        "lng": 103.7773718802915
      },
      "southwest": {
        "lat": 1.340488219708498,
        "lng": 103.7746739197085
      }
    }
  },
  "name": "Hess Academy - Bukit Timah",
  "place_id": "ChIJcYFbWVMR2jER5HgklN2bFGs",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Az HD",
      "author_url": "https://www.google.com/maps/contrib/113241362752752826770/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIY7Ypaf4jLOroGqLOm7nZMRd48JOVJTqFCzs8cJvfhDtSGYg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "My son recently attended the English Composition Workshop at HESS, and I’m very impressed with the experience. The workshop was well-organized and structured, focusing on equipping students with the skills and strategies needed to improve their writing.\n\nThe instructor, Lin Tze is knowledgeable and engaging, making the lessons interactive and enjoyable. She provided clear guidance on how to structure essays, use descriptive language, and develop creative ideas. My son found the feedback session particularly helpful, as they highlighted his strengths while giving practical advice on areas to improve. The English Composition Workshop was an invaluable experience for my son, and we’re looking forward to enrolling in more programs in the future.",
      "time": 1733985136,
      "translated": false
    },
    {
      "author_name": "Yena Ho",
      "author_url": "https://www.google.com/maps/contrib/103209290176947402180/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJVGHwL-37bntDJplcW_gUv7-eMXYV0bCFG8S6JCfNj6t4JuMk=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Special thanks to Teacher Alison for her patience and effective teaching method. My daughter joined Hess Academy during Sec 4. Under Teacher Alison’s guidance, her grades improved from grade C to scoring A for O-level.  Also like to thank Sean for his kind assistance and prompt responses.",
      "time": 1737197969,
      "translated": false
    },
    {
      "author_name": "Yan Shiu",
      "author_url": "https://www.google.com/maps/contrib/110449854198947588334/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJbVy_MKUItofmTXo6puZ1gKEr-HKYJWPU-YfTerF3ktZpmCA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "My son JR has joined the O level English tuition with Hess Academy during term 4 of his final year, and has improved from (prelim) B4 to (O level) A1 under Teacher Alison. His O level result could meet the COP of his dream school now. Special thanks to Teacher Alison for being patient and clear in delivery.",
      "time": 1736860183,
      "translated": false
    },
    {
      "author_name": "Jin Rong Tan",
      "author_url": "https://www.google.com/maps/contrib/107321639191405285663/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKUj0jnBGAwThnGM8V1FEwZmT8frF6E0ydgilSxX_c9lFr7Eg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Unlike other students, I only joined Hess academy during the final lap prior to O levels in September, which meant my time spent at Hess academy was not as lengthy compared to others.\n\nNevertheless, when I attended Teacher Alison's English lessons, I was able to quickly grasp the writing technique for narrative, recount, expository and hybrid essays. Additionally, the answering methods for English comprehension question types such as Literal, Inferential, Referential were very effective in helping me deliver near perfect answers in English paper 2 (although they were abit hard to understand, but I managed that issue by staying back after class to ask Tcr Alison and clarify my doubts with her).\n\nHaving gotten B4 (64%) for my English, I initially found it slightly difficult to catch up in class, but everything turned out fine. Through Hess academy, I managed to improve my English Language by 3 grades from B4 in prelims to A1 in O levels :D.\n\nspecial thanks to my family, teacher alison and hess academy.",
      "time": 1736863198,
      "translated": false
    },
    {
      "author_name": "Vanessa De Silva",
      "author_url": "https://www.google.com/maps/contrib/110804723562687568749/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJbRMGHN9ToIw6WaIF08lDFX8rPZp3-pEFcf2r9oYnD3miqmQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "My PSLE son did an online English course and it was truly an amazing and worthwhile experience. Having had previous experience with online sessions, I must say I didn’t expect much but when my son, Lucas, was placed in Teacher Naga’s class for the trial session, he was impressed and so was I. From then onwards, everything went as smoothly as could be expected. Teacher Naga was able to capture the respect and attention of his class. The course work is also impressive and well researched and complied. We are truly grateful to Teacher Naga and Sean who helped with all admin matters. Thank you for the AL2 in English that Lucas secured, it is a far cry from the previous AL3-4.",
      "time": 1732174067,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7715963437567998180",
  "user_ratings_total": 25,
  "vicinity": "140 Upper Bukit Timah Road, #02-03 Beauty World Plaza"
}