{
  "formatted_address": "1 Tessensohn Rd, #01-10, Singapore 217701",
  "geometry": {
    "location": {
      "lat": 1.3165909,
      "lng": 103.8577221
    },
    "viewport": {
      "northeast": {
        "lat": 1.317986680291502,
        "lng": 103.8590280302915
      },
      "southwest": {
        "lat": 1.315288719708498,
        "lng": 103.8563300697085
      }
    }
  },
  "name": "Hey Slow Joe",
  "place_id": "ChIJNd1pC6gZ2jERnzBTLHwSzUM",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Yi Ling",
      "author_url": "https://www.google.com/maps/contrib/115707001285123682601/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUlkcK6FpBb-Q_EER2W7ON8uPix2iL97NAPchaAE0TxCULNloBN=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Looking for good barista coffee after lunch, I stumbled upon Slow Joe, a chill hipster cafe with a relaxed vibe and interesting, simple branding.\n\n💧 Water is chargeable by the bottle.\n\nSeating is limited, but the barista was friendly and recommended their signature Bandung Latte and Cuppa Joe.\n\nI opted for the Cuppa Joe, which was a unique layered latte. The first sip was a creamy, whipped cream cheese-like foam with cocoa powder, followed by the espresso, and underneath was a milky, slightly sweet base.\n\nMixing it all together created a smooth latte with a rich espresso finish. While $9 felt a tad pricey, the interesting drinking experience made it feel like good value.\n\nService by staff was good, though the space is small, accommodating only a few small groups indoors. Overall, a good barista cafe coffee experience worth checking out if you're in the area.",
      "time": 1745136146,
      "translated": false
    },
    {
      "author_name": "Zi Xuan Lee",
      "author_url": "https://www.google.com/maps/contrib/108657541934577016131/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIsOc8wsTufIZTCmZ06jm-CMXaHbpA-2DJSbXdS1jF60994PQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "This cozy and aesthetic coffee stop is perfect for a quick yet mindful matcha fix. Its small dine-in area invites you to slow down and savour the moment, just as its name suggests.\n\nOne of the things that sets Hey Slow Joe apart is their commitment to quality. They use ceremonial-grade matcha from Japan, ensuring that every sip is smooth, earthy, and packed with authentic flavour. What’s more, their drinks feature a single giant ice cube, a small but thoughtful touch that keeps the drink chilled without diluting its taste.\n\nI was especially intrigued by their Iced Matcha Yakult ($9.80) - a combination I had never come across before. Swapping out milk for probiotic Yakult turned out to be a genius move. The Yakult’s natural sweetness and tangy profile blended seamlessly with the bitter and umami-rich matcha, creating a drink that was both creamy and refreshingly light. It’s a unique twist on the usual matcha latte, and one that I would definitely return for.\n\nTo go with my drink, I tried their Matcha Mochi Tart ($9.50), which is handmade exclusively at their space. The tart crust was firm and buttery, holding together a luscious matcha custard that was smooth, silky, and earthy. The stretchy mochi layer added an unexpected but delightful chewiness, making each bite a textural delight. The matcha flavour shone through beautifully without being overpowering, striking the perfect balance between richness and sweetness.\n\nHey Slow Joe may be a small space, but its menu leaves a big impression. I’m already looking forward to my next visit to try their Matcha Rose Latte, Strawberry Matcha Latte, and Dirty Matcha Latte.",
      "time": 1740758390,
      "translated": false
    },
    {
      "author_name": "Melody Tan",
      "author_url": "https://www.google.com/maps/contrib/101603007008878945594/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKB6JcQPByvBWtJNOd9Riqug4QQzu-Ppe7u0fjcbFdO4au6HoU=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "The flat white was awesome!! Super fragrant :) encountered some payment issue but the staff (girl in braid) (didn't her name) was very patient with me as well, I appreciate it!! Will come back again!",
      "time": 1746431287,
      "translated": false
    },
    {
      "author_name": "Nur Syafiqah",
      "author_url": "https://www.google.com/maps/contrib/115074672643489823615/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWmMJDwj_Z7gNGaWSe4HVk_S-Xz905CFI-_-tdqmOWWypVgGJqs8g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "one of the best specialty coffee & pastries in town! 💯 great atmosphere and vibes and trust me they have the most knowledgeable baristas ever.\nplease try their single origin beans they be hitting all the tasting notes no cap 🙂‍↔️🙂‍↔️",
      "time": 1735401006,
      "translated": false
    },
    {
      "author_name": "Skye Cai",
      "author_url": "https://www.google.com/maps/contrib/103575601236373049278/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWSjDcHZGcZoHJjoIs673qwJVkKO70N2D2zt9jORKf2UTSuRocJ=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Definitely one of the best iced matcha dirty.\nThe matcha is from really matcha powder and well mixed with oat milk.\nNot bitter, yet intense and goes very well with their coffee shots.\nCoffee is good quality, little acidic and doesn’t cover the aroma of the matcha.\nThey blended into each others flavours well.",
      "time": 1739503477,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4885581495295750303",
  "user_ratings_total": 191,
  "vicinity": "1 Tessensohn Road, #01-10"
}