{
  "formatted_address": "17 Joo Seng Rd, Singapore 360017",
  "geometry": {
    "location": {
      "lat": 1.3362485,
      "lng": 103.8809156
    },
    "viewport": {
      "northeast": {
        "lat": 1.337719130291502,
        "lng": 103.8823239302915
      },
      "southwest": {
        "lat": 1.335021169708498,
        "lng": 103.8796259697085
      }
    }
  },
  "name": "Hi-5 House of Learning",
  "place_id": "ChIJn5KOrZcX2jERBjpjSuK8Fbc",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Sunita Pun",
      "author_url": "https://www.google.com/maps/contrib/115480483452090646061/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLJAB3tk6sKtT76rH8YMGrRDim1yn-x17kyE2NZQ02gI9HtqQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "My daughter went to Hi-5 for 3 years. The teachers and staff were very caring and kind, so she enjoyed going to school everyday. Her teacher at K1 and K2 Tr Prema made sure that her students were learning and not falling behind. By the time she left Hi-5, she had made an amazing improvement in her writing and reading and was confident and ready for Primary 1.",
      "time": 1735119590,
      "translated": false
    },
    {
      "author_name": "Nurul Atikah",
      "author_url": "https://www.google.com/maps/contrib/101420973734397535868/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXBi2kJHn6fdrXt1MEkF_MaWHiGGconDl45F6L4RUEdSm5Rx08=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "2 years ago, when I decided to enroll my son to this school I was quite worried due to his eczema condition as he requires to apply lotion regularly. But the teachers here really put in so much effort to ensure my son is well taken care off. Not only that, they will update me regularly on my son progress. From here I know I've made the right decision to enroll him to this school.\n\nFast forward to this year, enrolled my youngest to their infant care. Because I trusted the care that they have given to my eldest, I choose to enroll my youngest with them. I was pretty worried to be honest but I'm glad everything turned out well. Not only that his development was so much faster than his older brother. He was exposed with so much activities in school.\n\nA big thankyou all the teachers and the principal for taking good care of them.",
      "time": 1733714626,
      "translated": false
    },
    {
      "author_name": "Cory Baldoz",
      "author_url": "https://www.google.com/maps/contrib/117460263819244137136/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWilMTp-UTzRn52YA-UPsG2e3mfkMnihdKs4TWISgRRH_l2dkGf=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Hi-5 in Joo Seng has been my daughter's second home when she was in K1 & K2. She was full day at school since me & my husband are both working. She really learned a lot from being independent & exploring her strengths & weaknesses at very young age. Her teachers especially Teacher Prema really make sure that all her students are learning & enjoying at school. From a very shy girl, my daughter was able to communicate & learn to be outspoken & improve her hidden talents. All the things she learned from Kindergarten was very helpful when she became P1. She learned how to spell, read, count, & speak chinese. She also learned about values & friendship. My daughter always miss  her Hi-5 classmates, awesome teachers, & also the yummy food during snack & lunch time. I would highly recommend Hi-5 for school & after school care.",
      "time": 1733204288,
      "translated": false
    },
    {
      "author_name": "Pawan Sarthak",
      "author_url": "https://www.google.com/maps/contrib/102488865341140399790/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLXRskJzutYmN8ks4mNZpDhLxCE6FWeOJF7Ey0--uTYRBBuHA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Hi5 learning has helped in so many way in my son development years . Specially years of 5 and 6 years. My son Pawan was very angry boy. Attention seeker and  Hyper active. However when I send him to Hi5 . Gradually I have seen so much progress in his over all behavior. He started to calm down .  My neighbor and friends all noticed and told me after “he was went to Hi5  Pawan has changed a lot. I am so glad I decided to to send him at right age . I wish I had sent him even earlier despite knowing the fees is lil high for our family. But  it was totally worth it. Now he is  8 years old . And he is  in USA doing really good in his study. He is fun loving  outgoing child who has compassion for animals, children and poor people .I believe  such behavior leads him  to become a responsible adult who can contribute in so many ways to make this world a beautiful place to live in.\nThank you Teacher Prema specially and thank you Hi5 .",
      "time": 1733258253,
      "translated": false
    },
    {
      "author_name": "Ong Lihsia",
      "author_url": "https://www.google.com/maps/contrib/115927394918543476863/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJvfyQWpzSqKq-dcnj5szULid80ppzU-ZkFIHzeVLSBFsWhqQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Good learning place, friendly teacher's and staff. My daughter like the school and make many friends and many happy memories there she graduated 2023.",
      "time": 1733557642,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13192658363548383750",
  "user_ratings_total": 10,
  "vicinity": "17 Joo Seng Road"
}