{
  "formatted_address": "4 Hillview Rise, Singapore 667979",
  "geometry": {
    "location": {
      "lat": 1.363354,
      "lng": 103.7643204
    },
    "viewport": {
      "northeast": {
        "lat": 1.364764280291502,
        "lng": 103.7660416802915
      },
      "southwest": {
        "lat": 1.362066319708498,
        "lng": 103.7633437197085
      }
    }
  },
  "name": "HillV2",
  "place_id": "ChIJ3Zrkj1IQ2jER7alm3mrpVPQ",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Xin Hao",
      "author_url": "https://www.google.com/maps/contrib/101038177603319548234/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU6c44XsILjRE2Islw02Z6jqIpGV_4urvZ0lGOy57c-ErkANHqe=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "A very decent destination for F&B, amenities, grocery or to bring your dogs out to walkabout. I will not really call it a mall per se, but more of a community area located within the lush greenery of Hillview. It’s about 7mins walk from Hillview MRT so it’s pretty convenient but when it rains i will expect footfall to be even lesser. Carpark is really poorly designed in my opinion - spaces are not maximized and the lots are just simply not sufficient. Turning radiuses are also very tight at certain corners. That said, I do enjoy the breeze and serenity around the area. There’s also a couple of really good Italian and Korean options within this establishment.  A 24/7 Anytime Fitness is also located here to cater to the residents in the area.",
      "time": 1715427104,
      "translated": false
    },
    {
      "author_name": "Megan Lee",
      "author_url": "https://www.google.com/maps/contrib/102300404088824157436/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUFsNInWau7PF6gminP7jdojoCf4QoN_vJoukaOEu46G-pHiLaf=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "2 weeks ago",
      "text": "This is a good place to gather with friends to chitchat after eating as there are benches around . However, there isn't an atm in this mall which is very inconvenient.\n\nThe nearest atm only at Hillview CC. There should be more ATM (POSB&OCBC) within this mall to provide convenience for patrons and staffs who works there.",
      "time": 1746409913,
      "translated": false
    },
    {
      "author_name": "Nur Iman Rostam",
      "author_url": "https://www.google.com/maps/contrib/110287485091231667131/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKk595S-r1_udolNvwjHBrRXawa0-51AXFXSDcmorPXWIc8HA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "HillV2 Free Shuttle Bus is an amazing social corporate responsibility (CSR) from the Far East Organization that was launched in 2015 when HillV2 was established to create a bus link between the residential areas of Hillview, Bukit Batok East and Bukit Gombak (into Pavilion Estate, along Bukit Batok Road).\n\nBy 2024, along with the support of local Grassroots Organizations, the HillV2 Free Shuttle Bus has become a prominent service that runs parallel with present public bus operators enhancing the connectivity in the communities served; linking residents with the realm of quiet shopping alleys of HillV2, mass movements to nearest MRT stations on North-South and Downtown Lines as well as opening up accessibilities to address the importance of getting from point to point with ease and comfort.\n\nStarting with 18 stops on a rotation loop service, HillV2 has been able to increase to 22 to allow capabilities and capacities of buses, private or public, to serve the basic need of commuting which makes a big part of the transportation network to get goods and people across streets that can be hard to navigate on big mass buses.\n\nThere are banners located at the served Bus stops of HillV2 Free Shuttle Service. You can download their bus schedule by scanning their QR code or surfing their website. One can also download Citymapper Singapore and click on 'Shuttle button to gain access to real time arrival and departure.",
      "time": 1740578968,
      "translated": false
    },
    {
      "author_name": "Gregory Athanasius",
      "author_url": "https://www.google.com/maps/contrib/101240389824842882822/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWQ1S71i5tG3M2LeuMrmDao8IOBC-y287tYxI59HVgc9eYcoOPg6w=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Discover the charm of HillV2, a community mall that offers a unique blend of dining and service amenities set against a backdrop of lush greenery. 🌿 Nestled in Hillview Rise, near Upper Bukit Timah and just a stone's throw from Hillview MRT station, HillV2 is not just a shopping destination but a lifestyle experience.\n\nIndulge in a culinary journey with a diverse range of F&B outlets. From the authentic flavors of IO Italian Osteria to the aromatic spices of Tandoori Culture, and the exquisite selection at Wine Connection Bistro, there's something to satisfy every palate.\n\nHillV2 stands out as a tranquil oasis in the bustling city of Singapore, perfect for those who appreciate the finer things in life. Whether you're looking to dine, shop, or simply unwind, HillV2 is the place to be.",
      "time": 1715332709,
      "translated": false
    },
    {
      "author_name": "Cassidy Chew",
      "author_url": "https://www.google.com/maps/contrib/114136979141574665107/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLqWNXLHAM2z4zz_P0IHDdO8auY0HFdACu9o9HqMFH1Ygn_gA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "5 years ago",
      "text": "Find it lacking in the crowd pulling effect like other malls. Maybe due to the size.  The management is doing something right by having live performance which my wife thought was good. The Christmas decoration was good too.\nKeep up the good work but more could be done to pull in the crowd.",
      "time": 1578985416,
      "translated": false
    }
  ],
  "types": [
    "shopping_mall",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17605953488505186797",
  "user_ratings_total": 2502,
  "vicinity": "4 Hillview Rise"
}