{
  "formatted_address": "221B Boon Lay Pl, #01-135, Singapore 642221",
  "geometry": {
    "location": {
      "lat": 1.3457259,
      "lng": 103.7130635
    },
    "viewport": {
      "northeast": {
        "lat": 1.347198480291502,
        "lng": 103.7145736302915
      },
      "southwest": {
        "lat": 1.344500519708498,
        "lng": 103.7118756697085
      }
    }
  },
  "name": "Ho Huat Fried Hokkien Prawn Mee 和发福建炒虾面",
  "place_id": "ChIJx1v13ukP2jERMcET_e5u7vo",
  "rating": 3.5,
  "reviews": [
    {
      "author_name": "L Wong",
      "author_url": "https://www.google.com/maps/contrib/105052490586738746635/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKXJfUUMyDbrJ0H06lQRFMil9mWt6JEg3pmfQvb6m8-wHvRUg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "Hokkien mee is very tasty.  For dine in, noodles is a bit too wet with noodles a little springy (if you like those).\nI waited for a while for it to soak well before eating, so all is good.  Their chilli is pretty spicy and it enhances the seafood taste of the hokkien mee.  I enjoy it and will definitely be back.😄\nWe ordered additional 2 packets for take away.  They were very good cause the noodles were well soak with the gravy byvthe time we reached home. Usually for other stalls, the noodles normally will turn soggy after sometime, surprisingly, their packed food taste as good.  In addition, this stall actually has packet chillies when you ordered for take away. Unlike others, chillies will be put along side with noodles.  It always create problem for me when i ordered for non-spicy and yet, spicy noodles was what given to me - causing unhappiness to my family members who do not take chillies. Thus, always check your order before you leave the stall!\nOne set back for this hawker centre is that they need to step up with their hygiene. Tables are clean enough - just lots and lots of houseflies. Don't know why.  Rather irritating. So for atmosphere I grade it 1 star.\nI recommend - tabao / take away!! 🤩",
      "time": 1734860670,
      "translated": false
    },
    {
      "author_name": "Kenneth Tan",
      "author_url": "https://www.google.com/maps/contrib/110528624870751528904/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUzbN5fSAPThyqYckxVRDmuzJtzr32fz0z5K0bVkHa0tGBV8y_hgg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "Read many reviews on how this stall usually has long queues and that the Hokkien Mee is worth the queue for, I finally got the chance to try it thanks to a friend who was around the area and bought for me to try it.\n\nServing portion was great, and even though it’s packed, the hokkien Mee still packed the wetness and fragrance that usually comes more with dining in.\n\nStall is also generous in giving chilli packs & lime.\n\nWould definitely pop by if I’m around Boon Lay next time. Can’t wait to try the dish while dining in to see if it’s even better than what I’ve already tasted 😋",
      "time": 1723593966,
      "translated": false
    },
    {
      "author_name": "L A",
      "author_url": "https://www.google.com/maps/contrib/104018492199551768434/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI_w9jaM2VIxmYR_U7SrCg0ff1Vxx5zJqbFFu3Z2FMta3Gvag=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Have been eating this Hokkien Mee Stall since young. This Hokkien Mee has always been the same look. Taste drop abit but still good.",
      "time": 1739680043,
      "translated": false
    },
    {
      "author_name": "Paul Chan",
      "author_url": "https://www.google.com/maps/contrib/104085603801790709162/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKf-7PuxQ5FrExgluDNulVxO8jiEfakhcevgxiIL_TVzsRMAA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Really nice \"wet\" style hokkien mee. Nice smooth consistency and wok-hei. Not over over powering. The chili goes well with the noodles. Be prepared for a wait as there can be quite a line for it. Best of all ... they leave a jar of crispy fried lard bits for you to add to your noodles as you wish! Yum!",
      "time": 1691318215,
      "translated": false
    },
    {
      "author_name": "Carebear Stare",
      "author_url": "https://www.google.com/maps/contrib/101952472626454203186/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIoSBlg3tvuUUKc0V56XtVV963tvaGBz8IKQ0vfVQClKvapWw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "3 months ago",
      "text": "Good hokkien mee if I don't want to travel far. Recently I ate it but it taste a bit more diluted somehow compared to past few months ago. Seafood is decent and fresh.\n\nHowever I would say the service can be improved. Pork lard is not given by default and you need to specify when ordering. Aunties pretty rude when I realised that and went back to ask for pork lard nicely. I don't think they need to be that rude when they have no sign saying that pork lard is upon request.\n\nThe most annoying thing is their lousy system of ordering where no numbering given. Pay first and then the aunties will just shout the order out and see who which customer comes to collect. I have to remember myself which person came before me to roughly know when is my turn. This system needs to be improved.",
      "time": 1739790741,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=18081511526666322225",
  "user_ratings_total": 99,
  "vicinity": "221B Boon Lay Place, #01-135, Singapore"
}