{
  "formatted_address": "9003 Tampines Street 93, #01-144, 528837, Singapore 528837",
  "geometry": {
    "location": {
      "lat": 1.3399754,
      "lng": 103.9411075
    },
    "viewport": {
      "northeast": {
        "lat": 1.341412380291502,
        "lng": 103.9424250802915
      },
      "southwest": {
        "lat": 1.338714419708498,
        "lng": 103.9397271197085
      }
    }
  },
  "name": "Hock Beng Carpenter Co",
  "place_id": "ChIJ1UM8LTk92jER8skPqJ55Hw4",
  "rating": 3,
  "reviews": [
    {
      "author_name": "Christopher Lim",
      "author_url": "https://www.google.com/maps/contrib/113234078865590273221/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKC3qibPZ6bMbbtqC_AbeVL27QsaSmIF2iP0-LCP34A__EeKMk=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "I contracted him to do a TV console plus a sideboard and two cupboards. I had the worst experience ever. I saw him in mid May and after going through the design, taking measurements, choosing the laminates, settling the price, we paid a deposit w/o bargaining.\nIt wasn’t that Mr T was rude. Rather, he had an indifferent attitude. When I sent him pics of the TV console that I wanted him to follow and produce, he created his own version instead. An after checking for an update and confirmation as to why he didn’t follow my instructions,\nhe mentioned that some of the design and features couldn’t be done. It wasn’t that we’re asking for anything fancy or sophisticated. Above all, he simply just took his time. Finally, after pressing him in early July, he committed to a date in mid July. And the worst was yet to come…\n\nOn the installation day, he came in with his tools and didn’t even protect my newly polished marble flooring resulting in scratches in many area. And in the midst of installing my TV console, he made a mess, blowing saw dust everywhere, treating my home as if it was his factory. His workmanship too, leaves much to be desired. He had to make so many adjustments to his pre-prepared pieces of the TV console because of his ill advised positioning of my wall sockets.All my equipment and internet wirings too was left exposed because he didn’t follow my plan. In the end, I had to threaten him to come back and make some adjustments. But the damage was already done.\n\nPersonally, I would never recommend this company if one is thinking of design and carpentry works.",
      "time": 1658356168,
      "translated": false
    },
    {
      "author_name": "EK Yap",
      "author_url": "https://www.google.com/maps/contrib/109686371324290841116/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLeglDBoICxU9eXD4WXDOC0RKwJd9VaajQFNaK5dIPmRK5Izw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "My property agent referred them to replace my 25 years old kitchen cabinets doors. It gives the cabinet a fresh new look at a reasonable price.",
      "time": 1747651646,
      "translated": false
    }
  ],
  "types": [
    "store",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1017665763140422130",
  "user_ratings_total": 2,
  "vicinity": "9003 Tampines Street 93, #01-144, 528837"
}