{
  "formatted_address": "8 & 10, Jalan Eko Botanic 3/2, Taman Eko Botanic, 79100 Iskandar Puteri, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.4408222,
      "lng": 103.618009
    },
    "viewport": {
      "northeast": {
        "lat": 1.442224280291502,
        "lng": 103.6193953802915
      },
      "southwest": {
        "lat": 1.439526319708498,
        "lng": 103.6166974197085
      }
    }
  },
  "name": "Hock Kee Kopitiam 福气安康 (Eco Botanic)",
  "place_id": "ChIJVZWHjt8L2jERdf53FLR-eT8",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Gator",
      "author_url": "https://www.google.com/maps/contrib/114331842318070680564/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUf5N0YPQocYYralVhzxgKqHfnlJgSiXhs54DUya0oFIumc-54QVA=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "This new Malaysian-themed cafe offers a pleasant experience with its cozy, Instagram-worthy decor and reasonably priced menu. While the food is above average, it doesn’t quite hit the heights of some more established Malaysian eateries—but it’s a solid option for a casual meal.\n\nThe Good:\n✔ Food (Above Average) – Dishes like nasi lemak and curry laksa were flavorful and satisfying, though not mind-blowing.\n✔ Beverages (Highlight!) – The coffee and tea stood out—rich, aromatic, and well-brewed. A must-try!\n✔ Egg Tarts (Their Specialty) – They’re decent, with a flaky crust and creamy filling, but not the best I’ve had.\n✔ Ambiance & Pricing – The cafe is nicely decorated (great for photos!) and the prices are fair for the portion sizes.\n\nThe Not-So-Good:\n✘  Kaya Toast (Just Okay) – A bit underwhelming; the kaya lacked that fragrant punch, and the bread could be crispier.\n✘ Service (Could Be Better) – A tad slow and inattentive. Staff seemed friendly but weren’t very proactive.\n\nVerdict:A cute spot for Malaysian comfort food and excellent drinks, but don’t go in with sky-high expectations. Perfect if you want a relaxed vibe with decent eats, but not yet a standout for authentic flavors. Would I return? Maybe—for the coffee and ambiance!",
      "time": 1744567954,
      "translated": false
    },
    {
      "author_name": "Charlie Chan",
      "author_url": "https://www.google.com/maps/contrib/100762410886582185841/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKXnsWKbeALPIvf6TaVYphslNj6Fbeq0p9pvgXTxCmPzHojAg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "The fried tofu is smooth and soft, never expected the tofu is so awesome! Definitely will come back for the Tofu again. Ordered the curry laksa as well, the broth is thick and delicious, just the chicken is cut into small pieces like shredded chicken.",
      "time": 1742657356,
      "translated": false
    },
    {
      "author_name": "Chen LP",
      "author_url": "https://www.google.com/maps/contrib/116548195106496157845/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLU492nuOifzqG5CDkYkTsrgpao8e4SiSBLtpwJ0XF1XBsgZA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Intrigued by the crowd, I decided to try this restaurant after breakfast. The environment was clean and comfortable, and seating was ample despite the restaurant being full.\n\nAs I was still full, I ordered a hot regular sized Kopi O (RM3.50), a Kaya Butter Toast (RM3.90), and a Sea Salt Egg Tart (RM6.60). Additional 6% service charge and 6% SST will be charged.\n\nThe Kopi O was a notable standout, exhibiting a lighter color than typical kopitiam offerings but boasting a remarkably rich and aromatic coffee flavor. The serving size was rather small, an upsized portion is advisable.\n\nThe 'Sea Salt Egg Tart,' distinguished by a sea salt cake topping, offered an appealing aroma and appeared to utilize high-quality ingredients. Nevertheless, I found the balance between the egg custard and cake to be disproportionate, and the overall taste did not align with my personal preferences.\n\nThe overall dining experience was pleasant, and I would be inclined to revisit the restaurant to explore other selections from their menu.",
      "time": 1742903882,
      "translated": false
    },
    {
      "author_name": "Clarinda Poh",
      "author_url": "https://www.google.com/maps/contrib/113031724132118403868/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJB7dDkXXCvE3Ld8YU2wXzwgOZdV7aeZ6SrThZsW_y4SnS_cQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Mee siam and laksa was good! Egg tart was nice too! Iced coffee was average, but service was fast and atmosphere was cosy. Overall good experience!",
      "time": 1746862551,
      "translated": false
    },
    {
      "author_name": "Belle Lee",
      "author_url": "https://www.google.com/maps/contrib/108966339713344957182/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJHir5ZGDEaG_1V8zSCv6tshodPBI_NDdA41wqeRSTwjC8gUg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Perfect ten! I dare say intelligence lives here. We are  very troublesome family with many allergies and dietary requirements and many places we go to all we request is for the meat part to be taken out and we don’t even ask for a discount or anything but most places would not be able to do that and some places would accommodate but the entire meal would be dry sauce less or significantly lesser in portion. This place was amazing. My child is ovo lacto so the lady manager made a nice kids meal removing the nuggets hotdogs and topped up with aglio olio sauce and loads of veggies which looked absolutely gorgeous. Very kind of them. And my spouse is allergic to eggs and the chefs was agreeable to fry the fried rice without eggs. This place have top notch service with brains and delicious food, it’s no wonder there’s long queues daily!",
      "time": 1746101968,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4573826208474070645",
  "user_ratings_total": 280,
  "vicinity": "8 & 10, Jalan Eko Botanic 3/2, Taman Eko Botanic, Iskandar Puteri"
}