{
  "formatted_address": "2, Persiaran Medini Utara 3, 79250 Iskandar Puteri, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.4208669,
      "lng": 103.6361233
    },
    "viewport": {
      "northeast": {
        "lat": 1.422315280291502,
        "lng": 103.6374586802915
      },
      "southwest": {
        "lat": 1.419617319708498,
        "lng": 103.6347607197085
      }
    }
  },
  "name": "Holi 1medini Suite",
  "place_id": "ChIJseejpwoM2jERQFjKpV32XgQ",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "syed aje",
      "author_url": "https://www.google.com/maps/contrib/110719075274031012600/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWbVN68YSXYFi3rXJ2kDuWcJlbGjWGOYIOoZsRmylaEieTO5OGr=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "2 years ago",
      "text": "Can see it's getting wear n tear. Parking ramp is very tight on certain section. Quiet building, probably many are on homestay? Swimming pool is spacious. Wading pool is a bit small. Guards are very helpful, I guess they're used to homestay people",
      "time": 1655800695,
      "translated": false
    },
    {
      "author_name": "Snekithy",
      "author_url": "https://www.google.com/maps/contrib/114306650505653812255/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVaFPbYYGhITR3c5qZZatoTuLB-QNA5qo0V2ItTmhB43NhC4Quw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "We booked in June 2022, simply this people ruined our day in Legoland. Its our mistake we dnt notice the deposit $60 which was mentioned somewhere in a corner of the booking.com. They kept messaging us for the deposit middle of our rides at Legoland which is 3hrs before the check-in time. As its our mistake not seen properly abt the deposit we made the transfer. Again they started to call n msg for orher docs, we said we can provide during the check-in, thy said we should checkin before 5.30pm, if we go the apartment after 5.30pm there wont be anyone to help us if there any issues at the property (wow). The vacation mood gone and we were disappointed but as we paid for the house and paid the deposit, we canceled and went to the apartment.\nNothing… its a trash house. The blue sofa bed god! Did thy bring it from the trash area and keeping it?. Nothing according to the images thy have posted in the sites.\nImmediately we moved out and booked another hotel. My kids dnt liked it at all, smelly, dusty and the whole things at the property is old. If anything get spoilt definitely thy wont return the deposit we paid. I seriously dnt kw to laugh or angry. We are not Jokers to fall in to ur traps.\nThey returned the deposit after 3 days after several calls and messages.",
      "time": 1655356477,
      "translated": false
    },
    {
      "author_name": "Supaporn Samui",
      "author_url": "https://www.google.com/maps/contrib/113753808138603376597/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUDqYrsPcNi2waHstnIDBd3d2T7MVT58704liNAlPb2mRBzznctjg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "7 years ago",
      "text": "Very nice place to stay in the area, great view from our room, big swimming pool and nice garden. A bit far from everything but we were there for Legoland so that was worth it. You have grocery stores and restaurants at a walking distance. Easier we you go there by car since it is not easy to get the taxi and it is expensive as well.",
      "time": 1507262019,
      "translated": false
    },
    {
      "author_name": "KZ Li",
      "author_url": "https://www.google.com/maps/contrib/116618844392195546824/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUyiJuc-SuYAHDMgd367krRhByr9Gg3MHTfxrw9xmw0iK52Z0K8=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "6 years ago",
      "text": "We stayed for a week here, the property is new, and well maintained.\nThe unit was comfortable, windy, equipped with sufficient bath & toilets, right next to the sky garden, and with a view towards the Straits of Johor (the border of Singapore).\nIt was a pleasant stay even though the place is located away from the necessities, we could still get our grocery 5mins down from Jaya grocer, a local delicacies food court at Anjung, other Chinese, Korean, Japanese and Italian cuisines restaurant 15mins drive away from the property.\nThe park, playground, pool, and gym was an enjoyable facilities within the property.",
      "time": 1548154629,
      "translated": false
    },
    {
      "author_name": "catherine toh",
      "author_url": "https://www.google.com/maps/contrib/112036840709113328210/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLdmpGQba-mE42Ljk7kcQ7snQXzzify0-UnCIxngzN7CJMNaQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "5 years ago",
      "text": "View at level 22. House looks clean but... sofa has bugs which caused itching. Strange insects found in bedroom (refer to pictures attached). Faulty lights bulbs at pantry and living room area. SMS the agent to ask about the wifi connection but didn't reply until on day of check out. Carpark exit is terribly narrow. Brown colour towels provided and look more like floor mats. Not within walking distance to famous landscapes or malls.",
      "time": 1565354699,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=314959906036406336",
  "user_ratings_total": 110,
  "vicinity": "2, Persiaran Medini Utara 3, Iskandar Puteri"
}