{
  "formatted_address": "30 Victoria St, Singapore 187996",
  "geometry": {
    "location": {
      "lat": 1.2951559,
      "lng": 103.8525695
    },
    "viewport": {
      "northeast": {
        "lat": 1.296620680291502,
        "lng": 103.8540019802915
      },
      "southwest": {
        "lat": 1.293922719708498,
        "lng": 103.8513040197085
      }
    }
  },
  "name": "Honbo",
  "place_id": "ChIJ88AEpy4Z2jERqYaqiObTqTQ",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Bert Grobben",
      "author_url": "https://www.google.com/maps/contrib/112544204326995021121/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWljzw2myyXj8E2G1k8RycemvJPQUoGKsTUndTAML8VzS-CM3Kxuw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "It was promised to be the best smash burger in Singapore, and I think it delivers on that. Really nice crispy patties! And that is about the extent of what’s best and what I’d recommend the place for.\n\nI’m not sure how long ago Honbo opened - it feels like it was yesterday as the staff somehow feels a bit out of place and ‘lost’. The service oriented routine needs some greasing the engine. As for the vibe, I guess it’s going after the American Diner groove but it misses its panache and roughness around the edges. Not sure what it wants to stand for.\n\nAs for the broader menu, great burger options, and even a scallop burger. But man, placing 3 scallops in a bun isn’t exactly the epitope of a creative burger. As a scallop dish, great! As a burger, please accept the challenge to make it into a creative party. Challenging, I know! But would you pick it up and make it happen? I’d for one would love to come back and see if that is as delicious and conceptually closer to a burger, as amazing as the beef patties are.",
      "time": 1740532498,
      "translated": false
    },
    {
      "author_name": "William Tay",
      "author_url": "https://www.google.com/maps/contrib/111195888798237649533/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXTutW4bVIwyi5r10ZEIbrrV5WxbIrXJS7CqdiotJLAGhlsBZ_8kg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "My first experience after hearing so much about the HK outlet. The double cheese burger was tasty and well balanced. The juice was dripping but the bun remained dry which is a plus point. I liked the  coleslaw that had a little kick to it. The smash burger tastes rather normal compared to the double cheese. The cheese fries was disappointing as some of the fries were double fried or left over so some were like biscuits. I feel that chunkier fries would have more surface for the cheese. Good that the cheese sauce doesn’t taste artificial.",
      "time": 1744541227,
      "translated": false
    },
    {
      "author_name": "Anton 999",
      "author_url": "https://www.google.com/maps/contrib/113685000306523260417/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUO7Vi_qsCJKkEr_dA4uh1HNr25jwu83Qp9zWQDejYp74pjd1Pr=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "I’ve tried this place a couple of times and have sort of mixed feelings about it. The burgers on their own aren’t bad, but they’re also not great. Way too much liquid and quite messy. However, when I look at the food offering as a whole, I feel it falls a little below reasonable expectations. The fries, the sauces, the ketchup with high-fructose corn syrup, its not a meal where one finishes and feels good. It’s also surprisingly pricey for what it is. Though they offer a reasonable looking lunch menu, the all-in cost ends up being fairly high. If you want to spend that on lunch, there are better options. I like a good burger but I doubt I’ll be back.",
      "time": 1742624471,
      "translated": false
    },
    {
      "author_name": "Jeremy Teng",
      "author_url": "https://www.google.com/maps/contrib/100877805630930813915/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXe1PAbxd-4_1ESomFJRfvU70GGzNgk-vH5XCDlDCKGqfm3ptT-xg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "2 months ago",
      "text": "Craving for burger so we paid this place a visit. Had the honbo which I like the crispy bits but I thought it was alright, nothing too fancy and sad for a burger place you don't serve milkshake and make fun of it.\n\nThere's always a feel for milkshake and burger that's why there are burger joints that do better than your shop such as 5guys and 25degrees or even blacktap.",
      "time": 1740895817,
      "translated": false
    },
    {
      "author_name": "Jo Anne",
      "author_url": "https://www.google.com/maps/contrib/103335570930596017626/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL-d-Y3L4mTaxg2Y-mfj5jRfiTU8iXfUTdHjsvY_sviNNBO5g=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Got a Honbo original and 1.5 which has 3 patties, 2 sides and 2 drinks. Love the smash patties for its charred flavor, soft buns and good amount of sauce. Fries & Tater Tots are well fried but Tater tots could use some seasoning such as onions powder?\n\nPaid $60.",
      "time": 1737885375,
      "translated": false
    }
  ],
  "types": [
    "meal_takeaway",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3794797148125169321",
  "user_ratings_total": 418,
  "vicinity": "30 Victoria Street"
}