{
  "formatted_address": "3 South Buona Vista Rd, #01-01/02/03/04/#B1-05/06/11/54 Viva Vista Mall, Singapore 118136",
  "geometry": {
    "location": {
      "lat": 1.279714,
      "lng": 103.7860135
    },
    "viewport": {
      "northeast": {
        "lat": 1.281140830291502,
        "lng": 103.7874766802915
      },
      "southwest": {
        "lat": 1.278442869708498,
        "lng": 103.7847787197085
      }
    }
  },
  "name": "HooHa Cafe",
  "place_id": "ChIJ08b9RKUb2jER4HbtO6l_RIg",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "jireh mani",
      "author_url": "https://www.google.com/maps/contrib/106810063946021751049/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWdhirm7I6rfAta_Y2JeaQFXmSEns83YmWl25Wv5fLaEfOZIRRE=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "A little out of the way, but an absolute gem. This is not the place for a quick bite and go. There’s a karaoke system, there’s a small stash of chips, banging lights, have a great time and live a little.\n\nFood was actually good, ordered the steak as everyone else did - ooof, delish. Fish and chips were light and battered. Whoever is cooking, thank you for your hard work.\n\nIf you do go, have fun, that’s the point of it.",
      "time": 1741886569,
      "translated": false
    },
    {
      "author_name": "Aries tan",
      "author_url": "https://www.google.com/maps/contrib/105026701943072998078/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX88EaLW59bal6NRW-QK7l624fxFnFC282FgVkR-7C1n5uLr5A7yA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Coming here for dinner was a decision my family and I quickly regretted, you might want to reconsider. The food took over an hour to arrive, and when it did, both the pizza and mushroom soup were some of the worst we've ever had. The place is cramped and loud which I personally don’t mind but what really made the experience unpleasant were the regulars, presumably friends of the owner, who were rude and inconsiderate.\n\nWe were seated right in front of one of the entrance doors. I didn’t mind people coming and going, but one uncle who joined his friends walked in and out twice before asking my boyfriend to scoot in further which we did. What annoyed me was when he questioned why we didn’t just sit in front, even though the rest of our family had gone to the restroom at the time.\n\nI politely pointed out that there was another exit he could use, and that’s when one of the aunties loudly said, “What did she say? Why should we go by the other exit?” Then, as she was heading to the restroom, she made a point to say loudly, “I want to go by that door.”even after her friends suggested the other exit, which was just a few feet away.\n\nI wasn't trying to complain, I merely suggested the other door so they wouldn’t have to keep asking us to move. Unfortunately, the attitude and lack of courtesy from the regulars ruined what was already a disappointing dining experience.",
      "time": 1744554999,
      "translated": false
    },
    {
      "author_name": "Janise Tan",
      "author_url": "https://www.google.com/maps/contrib/117046475253265790887/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIo-b-a0weWr6-to9h_WtmXlGPT40kkMFBOyDdWihih33DBpw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "We ordered Fish and chips ,sotong balls and rosemary chicken. It was super yummy. Fish was fresh and chicken was super tender",
      "time": 1734780201,
      "translated": false
    },
    {
      "author_name": "samlivestoeat",
      "author_url": "https://www.google.com/maps/contrib/118100640360831225044/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUDJ1ZtFHlJJEGSrK0IY9nnfUdpO14zmN_5BNYIjW2-g-RFfdHg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Food is good. I like the charred and smoky flavour of the Baby Back Ribs. I also like that good quality Pollock fillet is used for the Fish & Chips instead of the typical dory.\n\nAmbience is quite cool with disco vibes and customers can sing with live band (pianist/guitarist) on Tuesdays and Fridays. The area is slightly cramped though; each table is quite near each other.\n\n📣Check out my IG @samlivestoeat for more foodie reviews! 🥰",
      "time": 1687845796,
      "translated": false
    },
    {
      "author_name": "frank freitag",
      "author_url": "https://www.google.com/maps/contrib/114833457242435102549/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ0USU8GLIova9Rr0zUR4AiHazgB4N4UoKEUx3JM07I9KM5ag=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Restaurant Review:\n\nI had dinner at a restaurant last night and unfortunately, the experience was quite disappointing. The service was mediocre and there were several issues throughout the meal.\n\nFirstly, many dishes on the menu were not available, limiting our choices. To make matters worse, the ketchup we were served was almost a year expired, which is unacceptable for a restaurant.\n\nThe portion sizes were also disappointing. The mashed potato side dish was incredibly small, and the salad consisted of only a few measly leaves. However, I must admit that the steak itself was cooked well and tasted good.\n\nOne of the most disappointing aspects of the evening was when the owner paid for a round of beer for three of us, despite there being four in our group. To add insult to injury, the serving size of the beer was the smallest I have ever seen.\n\nOverall, the experience at this restaurant was far from satisfactory. The combination of limited menu options, expired condiments, small portions, and inadequate service left a lot to be desired. I hope that the restaurant can address these issues to improve the dining experience for future customers.",
      "time": 1711856636,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "cafe",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9819113452406142688",
  "user_ratings_total": 58,
  "vicinity": "3 South Buona Vista Road, #01-01/02/03/04/#B1-05/06/11/54 Viva Vista Mall"
}