{
  "formatted_address": "200 Jln Sultan, #04-24, Singapore 199018",
  "geometry": {
    "location": {
      "lat": 1.3038279,
      "lng": 103.8615204
    },
    "viewport": {
      "northeast": {
        "lat": 1.305064480291502,
        "lng": 103.8626812802915
      },
      "southwest": {
        "lat": 1.302366519708498,
        "lng": 103.8599833197085
      }
    }
  },
  "name": "Hope Singapore @ The Axis",
  "place_id": "ChIJYU-Z6ZYZ2jERrMwlRUTgbQM",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "cse1217",
      "author_url": "https://www.google.com/maps/contrib/116495992746370870847/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUFRepuJzYQl5j3W4M6iTiDv9CBmIW4G9Erbb3L1nv39ZQhvAHg=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Hope Singapore @ The Axis is a great church which I visited during Christmas.\n\nThey have a lovely worship team which lead songs that touch my heart.\n\nThe skit that the drama theme put up featured on the theme of forgiveness. I can see they have put in a lot of effort in the props, videos, sound effects and acting.\n\nThey also have activities for the children while the adults are having the service.\n\nFor adults who wish to bring along the kids to adult service, you can sit behind the glass window panels and still see what's happening in the main service hall.\n\nThe seats are comfortable. The Aircon is on the cold side. Do bring along a jacket if you are afraid of the cold.",
      "time": 1677669103,
      "translated": false
    },
    {
      "author_name": "Wenhong Ni",
      "author_url": "https://www.google.com/maps/contrib/115441554526091670463/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKo8tezz69FVt2RsvT539lcq9gJtvkSEaAVajUqFuJjbr-3TQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "4 years ago",
      "text": "It is a nice place for worship and knowing God and also knowing brothers and sisters in Christ. Hope Church Singapore was established in 1991, it origin can be traced back to Hope of Bangkok Church, founded by Dr Kriengsak Chareonwongsak (also known as Dr Joseph C. Wongsak) in 1981.",
      "time": 1607056442,
      "translated": false
    },
    {
      "author_name": "Gloria Yee",
      "author_url": "https://www.google.com/maps/contrib/110874184055457156850/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXbR1drkYfVoXxJ2UNtIIxD5acytdoxJqmaeuIRCD4kvJk-w2e5=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "I've been joining a LG late last year after an acquaintance linked me up to a LG leader. However, the LG leader refused to add me into the LG chat group after I've joined them for months. I feel left out. When I asked him to add me into the chat group so that he can keep me update with the rest on any info, instead of him messaging me separately, he gave an excuse saying that he need to discuss with the rest of the members first to seek their approval, after that he didn't mention this anymore. The leader also practice favoritism, just because I'm still new in the LG, I was not invited to join them during the CNY gathering. I don't see a strong bond in the LG. I find such behavior is absolutely unacceptable especially when you are in Christ, everyone should love and care for one another and treat each other like family. Unfortunately, I don't see this in the LG especially the leader. He doesn't practice what he preach. Till now, I hardly know anyone in the LG at a deeper level and connection. The relationship is rather superficial. Extremely disappointing experience for me. :(",
      "time": 1713799155,
      "translated": false
    },
    {
      "author_name": "Jayden Tham Zhan Ming",
      "author_url": "https://www.google.com/maps/contrib/101719028986034584656/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXjUR7nurncjvTAvge_kFWfgrmMbk8SASI3BMvUILiHmIMxPnTk=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "## The Wednesday Night Warriors: A Lifegroup that Feels Like Home\n\nLife can be messy. Sometimes you need a space where you can shed the facade and connect with others who understand. That's exactly what I found in my lifegroup, the Wednesday Night Warriors.\n\nWe're a motley crew, brought together by a shared desire to grow in our faith. There's Sarah, the wise one with a story for every occasion, and Michael, the tech whiz who always seems to know how to fix things (both physical and emotional). Then there's Emily, the artist who sees beauty in the unexpected, and David, the quiet observer with a surprisingly insightful perspective.\n\nOur Wednesday nights are a delicious mix of laughter, introspection, and a whole lot of support. We delve into scripture, not just reading words on a page, but dissecting their meaning and applying them to our daily lives. We share our struggles, big and small, knowing we'll be met with understanding and non-judgment.\n\nBut it's not all deep conversations. Sometimes, we just need a good laugh. We play board games that turn into hilarious competitions, and our potlucks are legendary for their eclectic mix of dishes and even more eclectic stories behind them.\n\nThe Wednesday Night Warriors have become more than just a lifegroup. They're my chosen family, a safety net that catches me when I fall and a cheering squad that celebrates my victories, big or small. We hold each other accountable, push each other to be better versions of ourselves, and most importantly, remind each other that we're not alone in this crazy journey of life.\n\nIf you're looking for a place where you can be yourself, flaws and all, and connect with others on a deeper level, then consider joining a lifegroup. You might just find your own Wednesday Night Warriors, a group that feels less like a gathering and more like home.",
      "time": 1711327629,
      "translated": false
    },
    {
      "author_name": "bumbu masakan",
      "author_url": "https://www.google.com/maps/contrib/114429462668428572270/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJJoqPQzxPzuQKbndGS-b136hdn3pFpVOlD7xxoiXJ8s4qcRQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "6 years ago",
      "text": "Nice church, wnjoy the worship...",
      "time": 1542294171,
      "translated": false
    }
  ],
  "types": [
    "church",
    "place_of_worship",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=247100138397748396",
  "user_ratings_total": 211,
  "vicinity": "200 Jalan Sultan, #04-24"
}