{
  "formatted_address": "18 Marina Gardens Dr, #01-21 Bayfront Plaza (Next to Bayfront MRT Station, Singapore 018953",
  "geometry": {
    "location": {
      "lat": 1.2812552,
      "lng": 103.861362
    },
    "viewport": {
      "northeast": {
        "lat": 1.28269905,
        "lng": 103.86220465
      },
      "southwest": {
        "lat": 1.27692365,
        "lng": 103.85883405
      }
    }
  },
  "name": "Hopscotch (Gardens by the Bay)",
  "place_id": "ChIJQ6cPiSMZ2jERYP9lJruuJFA",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Hania Heyd",
      "author_url": "https://www.google.com/maps/contrib/107419657527438497268/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWn9YPdY-QSqvO1m0v6bgYqkl8bcvggIOgUjJHic7OkigNDao8=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Absolutely one of the most unforgettable dining experiences I’ve ever had. Every single dish had its own unique flavour. truly unlike anything I’ve tasted before. It’s rare to find a place where every meal feels like a new story, crafted with so much thought and creativity. And the drinks? Each one came with its own ceremony, an experience in itself, not just in presentation, but in flavor. Every sip was a surprise, nothing repetitive or expected.\n\nThe staff made it all even better. Vanesse, who served us, was incredibly sweet and genuinely warm, her energy made the experience even more memorable. And Jane, our bartender, was a total powerhouse! She was fast, attentive, and flawless under pressure. You could tell she really loves what she does, and it shows in every drink she creates.\n\nThis place is more than just a restaurant, it’s an experience. I would go back in a heartbeat.",
      "time": 1745065303,
      "translated": false
    },
    {
      "author_name": "JAO JAO",
      "author_url": "https://www.google.com/maps/contrib/101237592496501407589/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU0bDo6a96Agz8t3cqwmNQ4xltWVNvloCe9EbBh56H9GBYU_Wfz=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Had a lovely lunch at Hopscotch @ Gardens by the Bay! Their value lunch sets are super worth it – they come with a drink, mushroom soup, bread, and a main. The mushroom soup was creamy and flavorful, and the bread was warm and crusty – perfect starters.\n\nTried the Black Garlic Wild Mushroom Pasta and Risotto – both were delicious and satisfying. The pasta had a rich flavor, and the risotto was perfectly cooked.\n\nThe place is spacious and chill, great for a relaxing meal surrounded by greenery. Definitely highly recommended, especially for lunch!",
      "time": 1743921751,
      "translated": false
    },
    {
      "author_name": "Lynn & Dion",
      "author_url": "https://www.google.com/maps/contrib/111423379426986380304/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVnfJDIXnoH1HZlOSD7wTZ6mCgcMqGF6tlGMdGWNPBHtq0SB48G=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Hopscotch is a hidden gem inside Gardens by the Bay, with great Western food and a beautiful view of the lake. We went for weekend lunch and were impressed by their set menu — it came with an amuse-bouche, soup, appetiser, main, and a drink. Everything felt thoughtful and well done. We loved the Duck Confit, the truffle linguine, and the mildly spicy Gochujang Shakshuka. The beef bourguignon was rich and tender too. Appetisers like the crab cake and pork belly were also really good! Would definitely come back to try more.",
      "time": 1745113238,
      "translated": false
    },
    {
      "author_name": "Sri Hermia",
      "author_url": "https://www.google.com/maps/contrib/103034325186800924748/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK1AwSHqa-Flmmaq_k3UC26GhdRYdMlujVTrPytDFkslzYE3kU=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "The food at Hopscotch really surprised me—in the best way. The Saffron Lobster Pasta was rich and aromatic, with the saffron coming through beautifully without overpowering the delicate lobster. The Fish and Chips were crisp and satisfying,  The Wild Mushrooms. Earthy and buttery 😋\n\nThe staff were warm and attentive throughout our visit. They took time to explain the dishes and offered recommendations, which I appreciated.\n\nThe unique garden atmosphere, it's the kind of place I'd happily return to.",
      "time": 1745387279,
      "translated": false
    },
    {
      "author_name": "Chua xiong cheng",
      "author_url": "https://www.google.com/maps/contrib/108323617994428046175/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWTUWYy_RdfEzpYHEiKH0eDuqXN90RMSx_Hko-8QCRzMTllHVyj=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Hopscotch delivered an unforgettable experience! I had the black garlic ribeye steak with bone marrow butter — absolutely rich and flavorful.\n\nThe Wish Upon a Lantern cocktail was a showstopper; they lit a flame on a paper-like material that burned in style, making drinking fun and theatrical.\n\nAlso tried the Ice on Wheel cocktail, which was equally creative. The cozy, stylish interior added to the vibe. A must-visit spot for great food, drinks, and atmosphere!",
      "time": 1746124590,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "bar",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5774932741022154592",
  "user_ratings_total": 779,
  "vicinity": "18 Marina Gardens Drive, #01-21 Bayfront Plaza (Next to Bayfront MRT Station"
}