{
  "formatted_address": "768 Upper Serangoon Rd, Singapore 534636",
  "geometry": {
    "location": {
      "lat": 1.3542504,
      "lng": 103.8789223
    },
    "viewport": {
      "northeast": {
        "lat": 1.355642080291502,
        "lng": 103.8803527302915
      },
      "southwest": {
        "lat": 1.352944119708498,
        "lng": 103.8776547697085
      }
    }
  },
  "name": "Hotel 81 Kovan",
  "place_id": "ChIJrQAuWKUX2jERshr3uRB1oe0",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "Karen Teo",
      "author_url": "https://www.google.com/maps/contrib/111619087753051229764/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXSZV1NGPrdzK4UhfnSCPbH2qK_h7pLbBJnWuyK0K4M8PVyP4pF=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "2 weeks ago",
      "text": "returned to stay at hotel 81 kovan because satisfied with cleanliness of room, front desk staff good service attitude and location at reasonable price of about $90 per night for twin bed room with window. thank you hotel 81 kovan",
      "time": 1746003546,
      "translated": false
    },
    {
      "author_name": "Kevin Bhasi",
      "author_url": "https://www.google.com/maps/contrib/116257761314875090270/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU-kg2esPIPO0SxtNGXusp_OsdKUs-tNKRwP35vHbOMtdiFwdQz=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Don't expect too much as this is a budget hotel. Contrary to some of the other reviews I've seen here on Google Maps, I've had an acceptable experience for the $104/night price I paid. The only issue I had was that the first room I was assigned had a broken bathroom door handle (so the door couldn't be opened), but the receptionists are helpful and assigned me a different room, for which the TV couldn't turn off due to a bad IR code on the headend system receiver remote, but they advised me to just reach behind and cut power to the TV. They use hotel model Sharp TVs that have physical controls either on the left or right side near the bottom, so I could turn the TV off that way, but to be fair, I was only really using the TV to watch Channel 5 during primetime hours as I was mostly on my work laptop or was out to help with our home renovations (which was the reason I booked a stay here). They provide complimentary bottled water, as well as coffee and tea mixes, though I was able to also get cup noodles from the nearby 7-11. I can't say much about the bathroom as I didn't take a shower there. The bed wasn't visibly dirty, and any dirt I saw were just dust I could brush off.",
      "time": 1727866876,
      "translated": false
    },
    {
      "author_name": "Diana Cheah",
      "author_url": "https://www.google.com/maps/contrib/114766390628787506169/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVFjeyic3Rk_FcvdbzrXemF2kXX3EsgG8sgKp1gKA0n2COUFliK=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "a year ago",
      "text": "We had a pleasant stay at Hotel 81 Kovan. It's quite convenient here. The front desk staffs are quite helpful. There is one particular front desk staff who is very friendly & he left a very deep impression on us. His service is excellent. Unfortunately, I do not have his name but I will get his name on my next visit.\n\nI noticed there was one Vietnamese male chamber maid, who is tall & thin, was making the room opposite mine a few times after the guests had check-out. It seems that he did not change the bedsheet at all, instead he straightened it with his bare hands. And he did not change the garbage bag, instead he reused it by pouring the rubbish away. He talked loudly on the phone while performing his duty room after room, & I could still hear his voice loud & clear. He did not even sweep the floor. His working attitude was terrible.\n\nI hope the management can understand how do we feel as guests to pay to stay in such an unhygienic room. Please kindly look into the matter so as to improve the quality & service for the guests.\n\nThank you.",
      "time": 1707869082,
      "translated": false
    },
    {
      "author_name": "Hervé Caux",
      "author_url": "https://www.google.com/maps/contrib/102470733302868989719/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW609KJh8CKPXqjDhAQxhZtbD-CBTcNaSPHEl8aZ7i2b_MotWIi=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "9 months ago",
      "text": "1 word: Disgusting! Awful experience! Booked it for my sister and her 2 kids. Staff was very unfriendly right from the start then the room looked ok before I realised it was infested with cockroaches! Small, medium, big ones! Crawling all over the room! Even a dead one left on top of the soap dispenser. Why? We asked the staff to clean but it didn't help. More came back later in the evening. So gross. My sister left with the kids in the middle of the night. Most disgusting place ever. Avoid at all cost.",
      "time": 1721922654,
      "translated": false
    },
    {
      "author_name": "Larry Caldwell (瑞可為)",
      "author_url": "https://www.google.com/maps/contrib/106137636292822354031/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUr3KhqV2Qx4nkYJgiWY4eKsfardzcaovBxOe4TlhmiQbCz59g_=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "11 months ago",
      "text": "While having a very competitive price, avoid this hotel and look elsewhere.   The rooms are tiny, mouldy, bathrooms are dirty (complete with a complement of cockroaches) and the smallest rooms are windowless and literally smells like a stale teenagers gym closet.\nWe've stayed at other hotel 81s, however this particular 81 needs a complete physical and managerial workover.\nStrongly recommend looking elsewhere and avoid this Hotel 81 - Singapore has a competitive hotel market where much much better can be had at a similar price",
      "time": 1717076578,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17123095972939242162",
  "user_ratings_total": 640,
  "vicinity": "768 Upper Serangoon Road"
}