{
  "formatted_address": "3 Dickson Rd, Singapore 209530",
  "geometry": {
    "location": {
      "lat": 1.3049377,
      "lng": 103.854273
    },
    "viewport": {
      "northeast": {
        "lat": 1.306341430291502,
        "lng": 103.8556961302915
      },
      "southwest": {
        "lat": 1.303643469708498,
        "lng": 103.8529981697085
      }
    }
  },
  "name": "Hotel 81 Dickson",
  "place_id": "ChIJW7D4sLkZ2jERVbhISOQ1SEQ",
  "rating": 3.8,
  "reviews": [
    {
      "author_name": "Denise",
      "author_url": "https://www.google.com/maps/contrib/111933706499943484909/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWH4KNi0OLKGSRWW-eg9dFK3wb_RA5pCi_Gyt80H4N6uxbifTg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "3 months ago",
      "text": "The hotel rooms have a very strong bad odor, especially the bathroom. Most rooms do not have a window. The room is very small. The location is great next to the MRT. There were constant loud noises in the hallway until about midnight every night. I would not recommend the hotel overall.",
      "time": 1739114211,
      "translated": false
    },
    {
      "author_name": "Kron",
      "author_url": "https://www.google.com/maps/contrib/104284954333013344750/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUVTw1yryOfJEBphVlucLH85LBvRjNoKsLklNWY1-XGS0VbjzI1=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "pretty strategic spot with such a cheap price.\nthe place is strategic since it's near 2 downtown line MRT station and bugis town is within walking distance\nshame the janitor clean our room without our consent",
      "time": 1746790362,
      "translated": false
    },
    {
      "author_name": "Neeraj Singh",
      "author_url": "https://www.google.com/maps/contrib/115259911553454674561/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXw7kjOOS-2tT1DdVBRz75Mbi6MRCj3NU5IkD_wkrfZFwI4NULVNg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 3,
      "relative_time_description": "3 months ago",
      "text": "If you're looking for a cheap and affordable stay in Singapore, this hotel is a decent option. The rooms are basic but clean, and the washrooms are well-maintained, though it's worth noting that jet sprays are not available with toilet seats.\n\nOne thing to keep in mind is that there's no room service, so you'll need to refill your water bottles from the dispenser provided. However, the hotel makes up for it with its prime location—it's very close to Little India Metro Station, making it easy to get around the city.\n\nAdditionally, luggage storage is available, which is convenient for early arrivals or late departures. The hotel is more suitable for singles and couples rather than large families, as it has a budget-friendly, OYO-style setup.\n\nOverall, it's a good choice for budget travelers who prioritize location and affordability over luxury.",
      "time": 1738555510,
      "translated": false
    },
    {
      "author_name": "Ichsan Risnadi",
      "author_url": "https://www.google.com/maps/contrib/112456413903852191405/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVhQUOPGsMf-auSCcfgMsOY_1n0ICVXR6qo072f3p8Nk9dwD08=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "Don’t be fooled by the 5/5 reviews. Stayed there for 4 days / 3 nights. Booked 2 different rooms. The first room was not cleaned on our last night, said there was no cleaning service today. I asked why and the male staff got mad about the question and very dismissive he just hangs up the phone, like we as a customer meant nothing. On the other room, there was an electrical fault with the AC WE HAD TO CALL THE RECEPTIONIST JUST TO TURN DOWN THE TEMPERATURES.\n\nOn our second night the room was cleaned, but the sheets and bed cover was exactly the same one from yesterday, only the floor was cleaned. Floor was visibly dirty you can see the dust. Bathroom smells really bad. Staff was very rude even for a two star hotel. We had 2 dirty mugs from our first night that was dirty and we put it on the floor, they didn’t even bothered to pick it up or change to a new one. And the fact that you only get 1 water bottle every night makes it even worse.\n\nNever again in my life I will come back to this hotel. I wouldn’t even recommend it to anyone for the fact that you can get WAY better services with that much amount of money than here.",
      "time": 1737894226,
      "translated": false
    },
    {
      "author_name": "Sumit Jain",
      "author_url": "https://www.google.com/maps/contrib/107242755301750378060/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLIeo96ikdNnFln06zov_v1AZnnvD9a_5MUwm7Z68VGKI0cqA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "Recently I stayed here and I have never seen such a bad hotel with worst staff and facilities. You will get very good hotel nearby area in same price.\n1. Your luggage you have to carry till your room.. Even a 1 star hotel will have someone to help for luggage\n2. They will give one 1 small water bottle that too like you are beggar infront of them\n3. No ramp to enter with stroller or luggage\n4. Rude staff\n5. Very small lodge kind of room\n6. Too many insects, ants in the room\n7. AC was leaking inside the room only",
      "time": 1737657512,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4920241847483807829",
  "user_ratings_total": 2884,
  "vicinity": "3 Dickson Road"
}