{
  "formatted_address": "25 Lorong 16 Geylang, Singapore 398867",
  "geometry": {
    "location": {
      "lat": 1.3118867,
      "lng": 103.8801907
    },
    "viewport": {
      "northeast": {
        "lat": 1.313188980291502,
        "lng": 103.8813753802915
      },
      "southwest": {
        "lat": 1.310491019708498,
        "lng": 103.8786774197085
      }
    }
  },
  "name": "Hotel 81 Palace",
  "place_id": "ChIJRxETRTMZ2jERMjyc5epBSzI",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "Xiao Yu",
      "author_url": "https://www.google.com/maps/contrib/107010386444596482390/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ3aEZP2Vu76chenXmhJT7SYzeJpfQLn8T_2q7EhH3WzKKU187I=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "I was a regular here and everything is well until yesterday. I always use my Singpass ID for verification but I was turn away by a big bulid lady at the counter, telling me the Singpass ID is not accepted and it cannot prove my identification aggressively. It is such a joke because the government issued this Singpass digital ID and not like a forged a fake document but I was treated like a criminal doing some nasty crime. Somemore I was present in person there to proof my identity. I ask her politely if I can show her other forms of documentations bearing my full name, photo and NRIC number but she just look away, give a sigh and say NO!.\nThe funniest joke is she is also the same person last month who accept my digital ID and access to the room and now telling me rules changed a 2-3 days ago when my booking is last Monday.\nTalking about hotel policy, it should be make transparent and not change last minute as and you wished. If like what she says Singpass ID is not recognised, then she should bot have accepted this mode all along or perhaps can tell our government to abandoned the Singpass digital identification app such to her it can be tempted with and cannot prove a person identity.\nAnd the staff should know the agoda and in house policy of no last minute cancellation and the lady still got the cheek and ask me to cancel my booking and insisted I could if not, do not disrupt the counter! There are no one and no queue there.\nI am very disappointed and disgusted by such service attitude. I need assistance and help but her attitude turn people off",
      "time": 1744522141,
      "translated": false
    },
    {
      "author_name": "Fabian",
      "author_url": "https://www.google.com/maps/contrib/105050493329866631297/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWGmNW4whh8zBs9lgdMrQPN5-AD4m_QoavZOcsj5DHWW7XFeERM=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "This is my second Hotel 81 experience. Both are similar.\n\nThe room is clean. I love the design. Its simple, elegant, and bright. The colour contrast was nice too.\n\nThe bathroom is good. Strong water, hot enough, simple design.\n\nThe room is a bit small. It's a budget hotel. It's acceptable for sure.\n\nThe people were nice and friendly. Professional enough in my opinion.\n\nI would stay in Hotel 81 for sure since it is my second stay at a different location. I think their quality is standardise among themselves.",
      "time": 1738022886,
      "translated": false
    },
    {
      "author_name": "Phyo Ko Ko Aung",
      "author_url": "https://www.google.com/maps/contrib/103961874033318155489/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV5pZK6Dh3RhFj-JivI2JhaU2kwKfHEiQi_vRZX6Wb4li_MJTKv=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 weeks ago",
      "text": "Dear management team,\n\nI would like to inform and give feedback about your staffs who named Darren (Male). Previous time, I stayed at your hotel and it was nice. This time, I have meeting with my clients for a few minutes in my room but ur stats’s who name Darren (male) was very rude and not allowed my clients to my room. I travelled a lot around the world and never happened before like this. I understand for safety reasons and regulations, anyhow, ur staffs can request to my clients’ ID or passport something. However, he didn’t work professionally and properly. He refused unreasonable and rude. This should not be like this.\n\nYour client",
      "time": 1746541241,
      "translated": false
    },
    {
      "author_name": "ZHANG HAO DONG",
      "author_url": "https://www.google.com/maps/contrib/110584688628315376856/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWoT4XyGXqt-DEoZ69xqjxnOhd7BnD9xp2nyyC3SCTTMfnFMR5i=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Decided to do a short term 2-hour rental to see how a newly renovated Hotel 81 is.\n\nOK, I have been to worse motels where the air conditioning is terrible, but this one is generally passable.\n\nMany people don’t realise that for a budget hotel in a red light district, there ought to be inconveniences and discomforts (e.g. prostitution, police checks) but otherwise for the $30, it’s OK for a bed and room to rest.",
      "time": 1745039213,
      "translated": false
    },
    {
      "author_name": "Abdulhadi Salem",
      "author_url": "https://www.google.com/maps/contrib/102995629354484448365/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLFne8QowGy3ZJZdlWKAu45GJD2VHpTBDLuwtm2ZlTQsj-diw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Outstanding Stay with Exceptional Service!\n\nI had an absolutely wonderful stay at [Hotel Name]! From the moment I arrived, the staff went above and beyond to ensure my comfort and satisfaction. I want to extend a special thank you to Ella, who truly made my experience unforgettable.\n\nElla was incredibly kind, attentive, and always ready to help with a warm smile. Whether it was assisting with recommendations or ensuring everything in my room was perfect, her dedication to providing exceptional service stood out.\n\nThe hotel itself was clean, comfortable, and well-maintained, with a great value. Also to mention that there were a 3 near bus stations near the hotel so I didn’t struggle with transportation and that made my stay enjoyable. But it’s the people, like Ella, who make all the difference.\n\nI’m truly grateful for such a pleasant experience and highly recommend this hotel to anyone looking for a welcoming, comfortable and budget place to stay. I’ll definitely be returning in the future!\n\nAlso a special thanks to Kelei\n\nThank you again, Ella, and the entire team for making my stay so memorable!",
      "time": 1732746601,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3624062802280070194",
  "user_ratings_total": 730,
  "vicinity": "25 Lorong 16 Geylang"
}