{
  "formatted_address": "181 New Bridge Rd, #01-03 Hotel 81, Singapore 059418",
  "geometry": {
    "location": {
      "lat": 1.2846513,
      "lng": 103.8441015
    },
    "viewport": {
      "northeast": {
        "lat": 1.286064780291502,
        "lng": 103.8454887802915
      },
      "southwest": {
        "lat": 1.283366819708498,
        "lng": 103.8427908197085
      }
    }
  },
  "name": "Hotel 81 Chinatown",
  "place_id": "ChIJXazBp3QZ2jERUuWWbCypJTM",
  "rating": 3.6,
  "reviews": [
    {
      "author_name": "oXRYSTALo Ong",
      "author_url": "https://www.google.com/maps/contrib/114556064085815871377/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSTtKcF9FYMbh-XNbDu8f7Whl3gi-ZY6T8pFPOm3v9Y98Ws7jL=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "5 months ago",
      "text": "Hotel 81 Chinatown: A Quirky and Budget-Friendly Chinatown Stay\n\nHotel 81 Chinatown offered a unique and budget-friendly experience for Donkey and me after a night out with friends. We found ourselves in a bit of a predicament when Donkey had a few too many drinks, and it was already past 2 am. We decided to check into Hotel 81 Chinatown for a quick rest.\n\nThe hotel had a unique charm – the price was reasonable, considering it's in Chinatown. We were up for a bit of an adventure when the staff mentioned that the lift was out of order. We took the spiral staircase up to the third floor, which was a fun little journey back to the early days of Singapore.  The room itself was small, and the bathroom was also quite compact.  The furniture and decorations were a bit dated, but the room was clean and comfortable, and we appreciated the quirky atmosphere.\n\nThe soundproofing wasn't great – we could hear the other guests in the hallway and even in the rooms next to ours – but overall, we still found the experience to be acceptable for a quick overnight stay in Singapore. It's a decent option if you prefer to stay near the town, and the price makes it a good value for money.",
      "time": 1732990257,
      "translated": false
    },
    {
      "author_name": "Ricky Priyanto",
      "author_url": "https://www.google.com/maps/contrib/107207664303213595714/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLkWmWZEWh3PfQs30dXMRF6Xcythjv8FoRwN63MgkkLmAB-sg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "A good place to select for vacation as it’s at central of Chinatown where near to MRT station. Good places, tidy and clean room, have bathtub for family room.",
      "time": 1745130286,
      "translated": false
    },
    {
      "author_name": "Ian Valles",
      "author_url": "https://www.google.com/maps/contrib/111233890701772900712/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUhPo1Ypd45calPzn97x02IDNO37z-4NXS7A9NWRuvrOJ97_d5r=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "First things first, they have tiny rooms but if you don't plan on staying long in the hotel and be out for most of the day anyway like us that's not gonna be an issue. And I do mean tiny. Two adults with luggage can barely move about. The bathroom is really small as well but it serves well. They don't have a bidet unfortunately.\n\nGreat location, very central for public transport and smack dab in chinatown where there's lots to see and do. However there isn't a great Grab dropoff point if you plan on taking one here because it's in the middle of 2 busy roads. But you can probably ask the driver to drop you off at Mosque street (the sort of back street next to it) which is the usual pickup point for them anyway.\n\nGreat staff and service. Reception was very friendly and approachable and the room cleaners do an excellent job. For some reason though they kept leaving us complementary water bottles every time we asked for the room to be made even though we haven't touched the previous bottles yet. So in the end, after having our room made every day for 4 days we've had a collection of 6 bottles of water in our hotel room, which is just kind of funny in my opinion.",
      "time": 1728796001,
      "translated": false
    },
    {
      "author_name": "Edilberto Dela Cruz",
      "author_url": "https://www.google.com/maps/contrib/107615848093365821639/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLtVkDYE0Gh-Ppdh0rzsXp-oieqPJ4_VA8e7vXo_n-Zu8U8Ow=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "We had a good experience in this hotel. The location is great, accessible to all modes of transportations, near malls, restaurants and souvenir shops. The service is awesome. The hotel receptionists are helpful and thoughtful. They woke me up at midnight to give me a bday cake. This is one of my unforgettable bday experiences. Thank you hotel 81 and staff. You are great!! See you next time. 🥰👍🙏",
      "time": 1730600445,
      "translated": false
    },
    {
      "author_name": "Nilam Meyti",
      "author_url": "https://www.google.com/maps/contrib/108298847118140520830/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXM8a7D0tStetfxqJQ5SBiOBYbaPykSJbPtGJqRaAeRN1OPnPJy=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "Perfect location to go everywhere by MRT and bus stop. But i have bad experience ever here, the room actually expected like information that they put on the data, but they have poor and old furniture. I found a lot of tiny animal on their broken wood door and wood desk. They put shower in front of the bathroom door, omg. I decided not to shower that day bcs i cant imagine how can i take a shower while you see thats a lot tiny animal in front of you. BUT their staff was friendly and kind. They let me do the check in around 12.30 pm.",
      "time": 1731174575,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3685537878338102610",
  "user_ratings_total": 706,
  "vicinity": "181 New Bridge Road, #01-03 Hotel 81"
}