{
  "formatted_address": "203 Hougang St 21, Singapore 530203",
  "geometry": {
    "location": {
      "lat": 1.3584639,
      "lng": 103.884454
    },
    "viewport": {
      "northeast": {
        "lat": 1.359570180291502,
        "lng": 103.8859564302915
      },
      "southwest": {
        "lat": 1.356872219708498,
        "lng": 103.8832584697085
      }
    }
  },
  "name": "Hougang 203 Coffee Shop",
  "place_id": "ChIJyYJNOLEX2jERK8K5G4pNmNI",
  "rating": 3.4,
  "reviews": [
    {
      "author_name": "Stephen",
      "author_url": "https://www.google.com/maps/contrib/111946872935778081912/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJxQJ9trXwEbWG62WXFzgjaHj0mPZ3HtqSYu8BhfPOrOsqCFQ=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "5 months ago",
      "text": "Limited sitting area. I only love the ban mian. Very rare to find ban mian that has wok hey taste.",
      "time": 1732671168,
      "translated": false
    },
    {
      "author_name": "Lin Xin",
      "author_url": "https://www.google.com/maps/contrib/116288094260917609020/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL43UC5sIMGC-aoc0KwOukieMQ9RKebRMry-YVrIIwPC5gBjQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "This is specific to the 有口福economical rice stall. There was a thin Chinese worker wearing a hat who served me. Upon choosing 4 dishes, I was told that only cash payment was allowed. I explained I didn't have cash with me. Before I could explore option like going back to car to take, get from a family member nearby, use cdc, paynow etc., he just turned back and threw my pack of food in the bin. This is very unfortunate because the food could have been given to staff and the poor. Besides, the attitude was appalling. 😞",
      "time": 1736568660,
      "translated": false
    },
    {
      "author_name": "Ad",
      "author_url": "https://www.google.com/maps/contrib/116163139628664513503/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJXTEeebV0vR6XmxXysCcD03MdsAVyXWssFY1gpVk5Q3HBo6w=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "The Chinese economic rice stall charges very high. For rice with oyster sauce chicken, cabbage and Kailan, I was charged $5 when I would normally be able to get it for $3.80 or at most $4. The pieces of chicken were boney with very little meat.\n\nChargrill charges quite high too. At $7.50, the portion of meat was quite small. We were also given very few pieces of onion rings. The entire meal was considered light for $7.50.",
      "time": 1690041369,
      "translated": false
    },
    {
      "author_name": "Vernon Tan",
      "author_url": "https://www.google.com/maps/contrib/114104505868490430328/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKFkt2kU_5GyoWzPjxGpIg756TI3A7Mv-FFYCIBHyctx7Z0T7jW=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Worst coffee shop in the area. Char siew tasted like steamed meat. Mixed vegetables fish and the meat is stale and cost $8.",
      "time": 1703241109,
      "translated": false
    },
    {
      "author_name": "Queenie",
      "author_url": "https://www.google.com/maps/contrib/114972734618591316719/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKrU6RTopwuD_qsUb7DAmIqqUOIAHPofp_Kb4IFS-_4-UKNXUQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "Review: Disappointing Experience Due to Rude Staff Attitude\n\nI had a very unpleasant experience at this coffee shop, which was completely ruined by a staff member named Jia Hui, a short-haired lady from Myanmar. My family and I were seated in the al fresco area with our puppy in a bag. We were initially served by a staff member in an orange shirt, who didn’t mention any pet restrictions, so we assumed it was fine to sit there. However, Jia Hui approached us aggressively, shouting in Mandarin, \"You cannot bring a beast inside!\" Her tone was rude and unprofessional, and she looked visibly angry.\n\nWe tried to explain politely that we were just waiting for our takeaway and would be leaving in a few minutes, but she insisted that we couldn’t sit there, even for such a short period. Her behavior was rude and lacked basic courtesy. When my father went inside to pick up the food, Jia Hui came back less than two minutes later, shouting again, \"I told you not to sit here with the beast!\" and threatened to call her supervisor if we didn’t leave. At this point, we were both upset and frustrated by her unhelpful and hostile attitude.\n\nI was then forced to stand outside under the hot sun (33°C), which is especially concerning since I have anemia. My father was understandably worried about my health and approached the 'supervisor' (I'm unsure if she was really the supervisor). The supervisor didn’t seem to understand the issue, defending Jia Hui by claiming she wasn’t fluent in Mandarin. This was hard to believe, as Jia Hui had been speaking fluent Mandarin earlier. When we asked if she didn’t know basic phrases like “thank you” or “sorry,” the supervisor continued to defend her behavior, insisting that we should have known about the pet regulations, despite the fact that the first staff member didn’t mention them.\n\nWe were further frustrated when the supervisor kept deflecting the blame to language barriers rather than acknowledging the staff member's rudeness. Eventually, when we were leaving, the supervisor apologized, but added sarcastically, \"Next time, speak English to the staff.\"\n\nThe moral of the story is simple: If the staff had treated us with respect and kindness, we would have left without any issue. We were just trying to takeaway food, but the staff's rude behavior completely ruined the experience. As consumers, the least we expect is basic courtesy, and sadly, we didn’t get that here.",
      "time": 1734240434,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15174964199990870571",
  "user_ratings_total": 36,
  "vicinity": "203 Hougang Street 21, Singapore"
}