{
  "formatted_address": "344 Netheravon Rd, Singapore 508512",
  "geometry": {
    "location": {
      "lat": 1.3920421,
      "lng": 103.980639
    },
    "viewport": {
      "northeast": {
        "lat": 1.393350130291502,
        "lng": 103.9819671302915
      },
      "southwest": {
        "lat": 1.390652169708498,
        "lng": 103.9792691697085
      }
    }
  },
  "name": "House of Melissa Boutique Farmstay",
  "place_id": "ChIJ31duUDA92jERU-77Hq74Zmo",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Jennifer Clark",
      "author_url": "https://www.google.com/maps/contrib/111510453839194723863/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLo1yfBHUOP4GeZ5V_1dLM77Q9PfvG7pRoFCl73NR7B_qCpvw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Stepping into the house of Melissa, a beautifully restored 1930s residence, feels like a journey back in time. The antique furnishings and vintage decor create an ambience of timeless charm, well the soothing melodies playing upon arrival immediately set the tone of the tranquil retreat. The view from our bedroom, overlooking the serene ubin straits , was exactly what we needed to unwind , and  escape the hustle of everyday life. Spending leisurely afternoons on the patio, engrossed in the diverse selection of books provided, we couldn’t help but imagine Melissa herself enjoying the same view  decades ago.\nOur stay left us thoroughly relaxed and rejuvenated, and we eagerly anticipate our return to the enchanted Haven.\nWith love from the well rested couple from the UK.",
      "time": 1743503432,
      "translated": false
    },
    {
      "author_name": "Ada Cheong",
      "author_url": "https://www.google.com/maps/contrib/117824330355244452528/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXojRE-Abz4CMhLw2cU0awWC-OejjrGkZDDjoGw3LRou4bh8XE=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Our stay at House of Melissa was so enjoyable that we forgot to take photos inside - definitely a place we’ll come back to!\n\nThe surroundings were stunning, the sea breeze was cooling, and the farm and its birds were a joy to be around. It felt like we were on holiday in the European countryside, and it was easy to forget that this is on the fringe of our island.\n\nClarence and his team have also done up the interior so well, it really was a luxury stay. The furniture and lighting were well curated and cozy, and there were so many beautiful bits. From the gorgeous taps to the hilarious rock collection, there was so much care and beauty in every corner.\n\nIt was like being a guest in a really beautiful house. Thank you so much for letting us visit!",
      "time": 1739097859,
      "translated": false
    },
    {
      "author_name": "Rachel Rhodes",
      "author_url": "https://www.google.com/maps/contrib/113442397777661677692/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIKPl6AY_su7Zom7i-UQgtsW8Q_BS8W4uSKqV9KC6bp48MgpmA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "A delightful peaceful haven in this beautiful corner of Singapore. The attention to detail and quality of the House of Melissa was amazing. Perfect place to visit with friends, a couple or as we did as a family. Our children loved checking on the ducks and hens each day, feeding them and searching for eggs! It really felt like a proper farm stay and we loved identifying all the different plants growing in the garden.\n\nWe loved using the pizza oven and cooking Al fresco, then eating overlooking the sailing boats and sea across to Pulau Ubin. It really is a magical destination and even after only a few hours you feel like you have been away for a lot longer and feel recharged. We definitely recommend a stay in this charming house surrounded by nature and look forward to staying again! Thank you to the whole team for a perfect stay!",
      "time": 1745849196,
      "translated": false
    },
    {
      "author_name": "Farhani H.",
      "author_url": "https://www.google.com/maps/contrib/115704182775039555010/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXOAlugb4irRNMbAde4BrR2jgDUmGJ_lUBP-tEZJnklBHZdPDlY=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Great place to have a farm stay. Place is serene. Accommodations are comfortable. Hosts were super accommodating and had very good tips to share. For our stay, we rented the pizza wood fired oven and hosts gave us tips at check-in on how to use it. Definitely worth the experience!",
      "time": 1745814511,
      "translated": false
    },
    {
      "author_name": "Siew Eng Yeo",
      "author_url": "https://www.google.com/maps/contrib/110604649524631299928/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIkQ2inlul8paXjBTzY51E4ukVlYKKzlNKbyqjE1vsX8BIURQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "First time staying in House of Melissa. I am blown away by the colonial house that is beautifully designed and furnished! The house overlooks the sea. We got an unobstructed view of the sea from living room and the 2 bedrooms. There were some chicken and ducks in the premises which the kids enjoyed feeding them. Everything in the house is neatly organized and clean. We have enjoyed our stay very much!",
      "time": 1742818195,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7667088842372673107",
  "user_ratings_total": 36,
  "vicinity": "344 Netheravon Road, Singapore"
}