{
  "formatted_address": "9 King Albert Park, #02-34, Singapore 598332",
  "geometry": {
    "location": {
      "lat": 1.336796,
      "lng": 103.7791565
    },
    "viewport": {
      "northeast": {
        "lat": 1.338310030291502,
        "lng": 103.7807483302915
      },
      "southwest": {
        "lat": 1.335612069708498,
        "lng": 103.7780503697085
      }
    }
  },
  "name": "Howl’s the Meat",
  "place_id": "ChIJexwqfN4R2jERmBrEH49G-eQ",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Alvin Chan",
      "author_url": "https://www.google.com/maps/contrib/108295660106474642771/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVkYT8a5PO6o4lRU7RaqqCKIj-bb9BqUTQFlqv3O5NGMvgrIGwX=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Best find in the west ! Stumbled across them by accident in KAP.\n\nWas just curious to what they were selling and Zenith walked out to greet me.  That's the start of the 5 star service and friendliness.\n\nFirst time, I've had wagyu beef tasting! He started by asking what sort of beef I preferred and explained to him my experience. Immediately, he suggested the cut and type of Wagyu that would be suitable for my palette.\n\nZenith is super knowledgeable and together with Kelly, you can feel their passion in what they are doing and they know their products very well.  Being a chef themselves, they knew how to cut, season and explain the taste profiles of their beef.\n\nThis is a gem of a find, highly recommended to come talk to them to get the best Wagyu beef to fit your taste profiles.\n\nNote, just finished all their beef that I bought and cooked/grilled at home.  I'm still feeling the umami-ness from it all in my mouth.\n\nSo good!",
      "time": 1745673750,
      "translated": false
    },
    {
      "author_name": "Daiyi Yang",
      "author_url": "https://www.google.com/maps/contrib/115243143756329399075/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKefFymQpi8_h9EClLW7A0nwNF6u8Fby4KyLko0gcfvQ3Sl7f4=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "We had a fantastic experience at Howl’s The Meat butcher shop at King Albert Park. The selection of premium Japanese beef was impressive.\n\nZenith was incredibly patient and knowledgeable, taking the time to explain the unique characteristics of each type of Wagyu, the different cuts, and their origins. It was a truly educational and enjoyable experience.\n\nWe bought Furano A5 Ribeye, Kuromame Nagi A4 Ribeye, Furano A5 Half Short Ribs, and Awaji Virgin A5 Ribeye. The quality of the beef speaks for itself—beautiful marbling, rich flavors, and a melt-in-your-mouth texture. If you’re looking for top-grade Japanese beef and expert guidance, How’s The Meat is definitely the place to go.",
      "time": 1741439211,
      "translated": false
    },
    {
      "author_name": "Bryan Tan",
      "author_url": "https://www.google.com/maps/contrib/102185844612101364190/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWiO2vBYbXCqOKpN7Zn_2UiO1tKC7V_ztgbjMab9nI6cIpEsSe6hA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Friendly and knowledgeable owners. Learnt more about Japanese Wagyu, orgins and appreciation of the meat.",
      "time": 1742008452,
      "translated": false
    },
    {
      "author_name": "Michael Mah",
      "author_url": "https://www.google.com/maps/contrib/112383336087601903196/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJfJpDeweWOzdTggWo8gyGyZ-B2EpG6D9UcLf6gU11svKDDkQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I’ve been a fan of Howl's The Meat for a while now, and I couldn't recommend it more! I tried their Christmas bundle and was so impressed that I came back for more for Chinese New Year. The quality of the meats is always amazing, and the flavors never disappoint. I also tried the Furano A5 Flank Steak Yakiniku, and it was absolutely worth every cent. The marbling and tenderness were out of this world – I couldn’t get enough of it! But the best thing I’ve had so far was the Daiei Kurosushi Striploin A5 Wagyu Beef. It literally melts in your mouth; the tenderness and flavor are unparalleled. The owner, Zenith, who’s a good friend of mine, is always super helpful. If you're looking for top-quality meat, this is the place to go!",
      "time": 1739362088,
      "translated": false
    },
    {
      "author_name": "BB DL [ ]",
      "author_url": "https://www.google.com/maps/contrib/115138046814768489982/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVRO5AhY0_tTkES89kUvrdMYXwnd066L_EFsHpTHV_WoJjupmuc=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Howl's The Meat is a hidden gem for meat lovers, owned by the knowledgeable Zenith. His expertise shines as he explains the various cuts, ensuring you make an informed choice. I was particularly impressed when he offered samples of different Wagyu beef cuts, allowing me to savour the rich flavours before deciding on my purchase.\n\nThe quality of the meat is exceptional—each bite is a delightful experience, with a sweet aroma and a perfect balance of softness on the outside and richness on the inside. I truly savoured every single bite.\n\nAdditionally, Zenith goes above and beyond by packing the meat securely and providing a cooler bag with ice to keep everything chilled during transport. I am so glad I discovered this shop and look forward to returning for more delicious offerings. If you're searching for top-notch meat and excellent service, Howl's The Meat is worth a visit!",
      "time": 1730889095,
      "translated": false
    }
  ],
  "types": [
    "shopping_mall",
    "restaurant",
    "food",
    "store",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16499296290375735960",
  "user_ratings_total": 18,
  "vicinity": "9 King Albert Park, #02-34"
}