{
  "formatted_address": "101 Thomson Rd, Singapore 307591",
  "geometry": {
    "location": {
      "lat": 1.317304,
      "lng": 103.8432704
    },
    "viewport": {
      "northeast": {
        "lat": 1.318763930291502,
        "lng": 103.8448404302915
      },
      "southwest": {
        "lat": 1.316065969708498,
        "lng": 103.8421424697085
      }
    }
  },
  "name": "Hua Language Centre (United Square)",
  "place_id": "ChIJswRqCegZ2jERxCnrU4UqIAQ",
  "rating": 3.9,
  "reviews": [
    {
      "author_name": "W Lee",
      "author_url": "https://www.google.com/maps/contrib/106966917528166316205/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKW2AKgj3FXLOes8V981Luf1ytHaTJdBDHVYzALU3qnsGcTcw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Highly Recommend HUA Language Centre@ United Square\n\nI’d like to share my experience with HUA Language Centre. I currently have two children enrolled—one in K2 and the other in Primary 2. As they will be in SAP schools, preparing them well for Higher Chinese is important to us, and HUA has been instrumental in laying that foundation.\n\nI believe the early years are critical for building a strong language base, and HUA strikes a great balance between core skills and knowledge. From Hanyu Pinyin to stroke work, HUA has equipped my children with the tools they need to progress—while keeping lessons engaging and fun.  Many children don’t find Chinese as approachable as English, often due to less exposure at home and in school. But HUA has developed creative and engaging methods to help preschoolers understand the why behind the language. Instead of just memorising words for spelling tests, my kids are learning the meaning, origin, and proper strokes of Chinese characters through flashcards, pictorial links, and storytelling. This makes a real difference.\n\nYou can only memorise so much—but when a child understands how a Chinese character came to be, it stays with them. My P2 son is particularly strong in school, and I credit his genuine interest in the language to the positive influence of both his school and HUA teachers.\n\nInterest can be cultivated early. Resistance can be reduced when learning feels meaningful and enjoyable. HUA has been a wonderful fit for our family—working hand in hand with parents to balance academic goals with sparking curiosity.\n\nI’m happy to pen this review because credit should be given where it’s due. Thank you, HUA!",
      "time": 1742871949,
      "translated": false
    },
    {
      "author_name": "Lee Brenda",
      "author_url": "https://www.google.com/maps/contrib/105213477525045504967/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJpqfI1UMTUO1CVEvA6drt_0yd1nc2MWRbZTpK77JrFIALEiw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "My child has been with Hua Language since the age of 3, and our experience has been nothing short of exceptional. The teachers are incredibly kind, patient, and engaging, creating an environment where my child truly looks forward to every single class.\n\nRecently, Hua Language introduced a new 2-hour elite program, which my child joined. Attending a school with a high standard in Chinese, this program has been instrumental in guiding her in the right direction. Thanks to the teacher’s outstanding teaching style, she has been able to apply what she’s learned effectively and performed well in her weighted assessment.\n\nI truly commend Hua Language for creating such a well-designed and thoughtful program. It not only encourages students to aim for higher standards but also makes their learning journey enjoyable, effective, and enriching. I am confident this program will continue to support and inspire many students.",
      "time": 1741784021,
      "translated": false
    },
    {
      "author_name": "mengfei xu",
      "author_url": "https://www.google.com/maps/contrib/110742100641700812366/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKwP9M_GG9vUhwwHV_3MtxYKD-P7_dwcqOKIkQ7fFqBC-b5jA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "My kid has been attending Hua language centre for almost a year. Her grade has improved significantly. She now enjoys learning Chinese and looks forward to every lesson. Teachers are patient and dedicated. Highly recommend this place!",
      "time": 1739025898,
      "translated": false
    },
    {
      "author_name": "Daphne Ng",
      "author_url": "https://www.google.com/maps/contrib/113397350348262535766/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJJsNG1MPznjkefhn1vLDzph3OjHQAcf4D0Wlwov5ZFsCgcSA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "I would highly recommend Hua Language Centre for Chinese tuition! My daughter is currently in P2 and her experience has been very pleasant so far. Her teacher Yuan Lao Shi is patient, passionate and dedicated in helping students achieve their language goals.\n\nMy daughter shared that the lessons are engaging, interactive and fun. I am very pleased to see improvement in her reading, writing and speaking skills in just a short span of 3 months.\n\nCommunication with the centre is also prompt. Thank you for your outstanding work!",
      "time": 1726916374,
      "translated": false
    },
    {
      "author_name": "cynthia teo",
      "author_url": "https://www.google.com/maps/contrib/109195050565053701962/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLj_UBG_-F2v2Z8wvrUPibzJDBUF4-OTuy_40cz7G6igD7FKw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My child has been attending Hua Language Centre (United Square) for the past 8 years. The teachers are dedicated, patient and understanding. The way Mandarin is taught has helped my child develop a deeper interest in the language and made my child feel confident about learning a difficult language. I felt they prepared my child well for the PSLE exam. The Centre is also well-run and the administrative staff are friendly and supportive. All this helps build confidence in continuing my child's Chinese language education with Hua Language Centre.",
      "time": 1706500861,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=297284327533390276",
  "user_ratings_total": 22,
  "vicinity": "101 Thomson Road"
}