{
  "formatted_address": "36 Sin Ming Ave, Postal 575710",
  "geometry": {
    "location": {
      "lat": 1.3589055,
      "lng": 103.837049
    },
    "viewport": {
      "northeast": {
        "lat": 1.360238730291502,
        "lng": 103.8385466802915
      },
      "southwest": {
        "lat": 1.357540769708498,
        "lng": 103.8358487197085
      }
    }
  },
  "name": "Hup Seng Duck Rice",
  "place_id": "ChIJZ8NpgCQX2jEROo8lGhnbQQE",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Jacob Mikey",
      "author_url": "https://www.google.com/maps/contrib/109252454388118177841/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKvZAc83Q9ClRq16WX7T-MVDYfuazY1KRQ7czbMrVAtePKQAw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "This stall was recommended by nearby workshop crew. Order 1 pax portion the quantity and eat thickness is there and definitely more than Yew kee duck rice portion. The duck meat taste awesome in my opinion better than yew kee. Only draw back is the taste of the soup is spicy and too much pepper. Have “planted flag” in my Google map account as I will definitely come back here again!",
      "time": 1743820539,
      "translated": false
    },
    {
      "author_name": "Ong Zhi Yuan",
      "author_url": "https://www.google.com/maps/contrib/104417804420531473764/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXIKT6Cu9TEMxrk2g1XVOPPdJDxx3WhsAXEK-kpKj4513VdnYs=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Hup Seng is a hidden gem for duck lovers, tucked away on Sin Ming Road.\n\nFood - The duck rice was fantastic. The duck was incredibly tender, perfectly marinated in their rich braised sauce, and served in generous portions. The salted vegetable duck soup, priced at just $6.50, came with a massive duck drumstick and delivered a perfectly balanced mix of salted vegetables, pepper, and duck flavours. Even the white rice was elevated with a drizzle of flavorful duck sauce.\n\nPlace - Located deep within Sin Ming Road, the somewhat remote location might deter some visitors, but it’s worth the trip. The coffee shop where Hup Seng is located is airy, well-ventilated, and has plenty of seating.\n\nOverall - This place exceeded expectations, and my only regret is not trying it sooner. Amazing food and a great setup make it a must-visit. 11/10, will definitely return.",
      "time": 1735105480,
      "translated": false
    },
    {
      "author_name": "Bryan Lon",
      "author_url": "https://www.google.com/maps/contrib/101869506055887544256/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVflaUA9z10UVx4HDAIcZQzu1xZLQ3FkM2YhXv6ajB34FQn2h-1fQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I had a great experience dining here. The braised duck and pork belly are delicious and tasty. Together with their sauces and herbal soup, they make a great combination. It's perfect if you like your braised duck rice with a little bit of sourness to it. You can also add some of their chilli sauce for some spicy tanginess. Their rice is a little hard but I usually pour some of my soup over the rice to soften it and it makes the rice more delicious.\n\nTheir price is also very reasonable, considering today's economy. The braised duck rice with pork belly only costs $6. It's super worth the value and I will definitely visit again.",
      "time": 1739781371,
      "translated": false
    },
    {
      "author_name": "Tee Yongnan",
      "author_url": "https://www.google.com/maps/contrib/103655670304784447170/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXtjwzfq6RpNiFNx9FGFrW44vTzxO7I1VMfZEOiBQMBx5QUHEVEoQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I orderd the drumstick version with added meat @ $8.\n\nEASILY the best braised duck rice I’ve had in Singapore. You can tell they take their time with the braising because the duck is tender and SOAKED with flavor. Not dry, not stringy—just PERFECTLY cooked. The meat has absorbed all that rich, umami-packed sauce, and when paired with the fluffy rice? PURE HEAVEN.\n\nOne thing I really love is how flavourful the sauce is. Some places serve super diluted, watery gravy that doesn’t add much to the dish, but here, the sauce is rich and clings to every bite. They also give a good amount of it—none of that stingy \"one small spoon of sauce\" nonsense. I literally wiped my plate clean.\n\nAnd THE CHILLI??? OMG. One of the best I’ve had. It’s got that strong tanginess and the perfect level of heat that makes the duck taste even better. If you don’t eat this with chilli, you’re MISSING OUT.\n\nBe prepared to queue, but TRUST ME, it’s worth it.",
      "time": 1740277666,
      "translated": false
    },
    {
      "author_name": "Stanley Pang",
      "author_url": "https://www.google.com/maps/contrib/101763161466007280569/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXwa9QO4dUEVOlbhB32K38ffFZ6AP9BgAaDvObOM1I973E4Xd4=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "2 weeks ago",
      "text": "Affordable hearty portions. Braising style and chilli is similar to Heng Ji @ Tekka. Definitely one of the better ones around. Even the salted veg duck soup is good for 2pax sharing, with generous ingredients within, though I find the soup a little too peppery.",
      "time": 1746006219,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=90594368383455034",
  "user_ratings_total": 873,
  "vicinity": "36 Sin Ming Avenue, Postal"
}