{
  "formatted_address": "401 Hougang Ave 10, #01-1158, Singapore 530401",
  "geometry": {
    "location": {
      "lat": 1.3748304,
      "lng": 103.8972337
    },
    "viewport": {
      "northeast": {
        "lat": 1.376082280291502,
        "lng": 103.8985181302915
      },
      "southwest": {
        "lat": 1.373384319708498,
        "lng": 103.8958201697085
      }
    }
  },
  "name": "Hup Kee Braised Duck",
  "place_id": "ChIJ3xzgUAAX2jERBIWSV9KKddw",
  "rating": 3.3,
  "reviews": [
    {
      "author_name": "Doraemon",
      "author_url": "https://www.google.com/maps/contrib/112665277904119154671/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX2VSCcaT9axvOwx2nD8XD3PgZ8V5VFnv420aocMSfLa6GlcEmN=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "We were on our conditioning jog for Saturday's big run from Punggol all the way to this KPT coffee shop, and decided to fuel up with some delicious braised duck at Hup Kee.  Kitty, being the adventurous one, went for a Western dish from another stall, but I couldn't resist the lure of the duck noodle.\n\nThe lady at the counter was super friendly and even suggested some extra ingredients to add to my order.  I went for braised meat and braised pork meat, and let me tell you, it was a delicious decision! The duck noodle itself was only $4.80, and with the extra meat, the total was $6.50, which I thought was very reasonable for the quality and quantity.  The duck noodle was piping hot, the chili blend was perfect, and the noodles were cooked just right.  It was definitely better than the duck noodle I tried at Punggol Plaza!\n\nKitty enjoyed her Western food, but she couldn't resist sneaking a few bites of my duck noodle.  She agreed it was amazing!\n\nThe only downside was that they didn't accept PayNow or PayLah, which was a bit of a bummer in this day and age.  But hey, sometimes you have to embrace the old-school ways!\n\nOverall, Hup Kee Braised Duck is a must-try for anyone in the area.  The food is fantastic, the service is friendly, and the prices are reasonable.  We'll definitely be back for more.",
      "time": 1730176286,
      "translated": false
    },
    {
      "author_name": "oXRYSTALo Ong",
      "author_url": "https://www.google.com/maps/contrib/114556064085815871377/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSTtKcF9FYMbh-XNbDu8f7Whl3gi-ZY6T8pFPOm3v9Y98Ws7jL=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Alright, folks, listen up! Donkey and I were on our conditioning jog for Saturday's big run. We jogged from Punggol all the way to this KPT coffee shop, and decided to fuel up with some delicious braised duck at Hup Kee. I went for a Western dish from another stall, but I couldn't resist the lure of the duck noodle.\n\nWhat We Loved:\n\n• The Duck Noodle: The duck noodle itself was only $4.80, and with the extra meat, the total was $6.50, which I thought was very reasonable for the quality and quantity. The duck noodle was piping hot, the chili blend was perfect, and the noodles were cooked just right. It was definitely better than the duck noodle we tried at Punggol Plaza!\n\n• The Service: The lady at the counter was super friendly and even suggested some extra ingredients to add to Donkey's order. Donkey went for braised meat and braised pork meat, and let me tell you, it was a delicious decision!\n\nDonkey's Take: The braised duck was so tender and flavorful! It was the perfect post-jog fuel.\n\nMy Take: I loved the duck noodle! It was so good, I couldn't even resist stealing a few bites from Donkey's plate!\n\nRating:\n\n• Food: 5/5 (Delicious and high-quality)\n\n• Service: 5/5 (Friendly and helpful)\n\n• Value: 5/5 (Reasonably priced)\n\nOverall:  5/5\n\nOur Verdict:  The only downside was that they didn't accept PayNow or PayLah, which was a bit of a bummer in this day and age. But hey, sometimes you have to embrace the old-school ways! Overall, Hup Kee Braised Duck is a must-try for anyone in the area. The food is fantastic, the service is friendly, and the prices are reasonable. We'll definitely be back for more.",
      "time": 1730130363,
      "translated": false
    },
    {
      "author_name": "Nk T",
      "author_url": "https://www.google.com/maps/contrib/115924570933935225255/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKdi7e-h00uxj9zDjybGI2WI5Zv9Qg3qvCjtQDmaSYAYBVcqQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "Portion is tiny",
      "time": 1733194753,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15885755896636278020",
  "user_ratings_total": 3,
  "vicinity": "401 Hougang Avenue 10, #01-1158, Singapore"
}