{
  "formatted_address": "673 Bukit Timah Rd, Singapore 269735",
  "geometry": {
    "location": {
      "lat": 1.3258508,
      "lng": 103.8057207
    },
    "viewport": {
      "northeast": {
        "lat": 1.327385430291502,
        "lng": 103.8070036302915
      },
      "southwest": {
        "lat": 1.324687469708498,
        "lng": 103.8043056697085
      }
    }
  },
  "name": "Hwa Chong Institution Boarding School",
  "place_id": "ChIJjZtr7goa2jERadfzauNDxEg",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Chithra Maria Alexander",
      "author_url": "https://www.google.com/maps/contrib/105929790163799257115/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVL23tLyQoUhDAswuAh1UaEBoyA7ABpclXnQwUL6CvAMX-YfBSA-g=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Visited Hwa Chong Boarding School in 2014 as part of a student exchange program from Rajagiri Public School, and it was one of the best boarding experiences I’ve had. Even back then, the facilities were top-notch—vending machines all around, a well-equipped gym, convenience stores, and a huge mess hall with healthy food options. The rooms were spacious with ample storage, and each floor had its own laundry, common area with a TV, and a kitchenette.\n\nOne of the most unique aspects was that students were responsible for cleaning the mess halls, which fostered a strong sense of responsibility and community. The only cultural shock for us was realizing that our window view was of taller apartment buildings with transparent walls—it felt awkward at first, but we eventually made friends with our neighbors! The 10 PM bell for in-time added to the structured yet comfortable environment. Overall, an incredible experience in a well-maintained and convenient boarding school!",
      "time": 1738228228,
      "translated": false
    },
    {
      "author_name": "CHEN ZHEXUAN HCI",
      "author_url": "https://www.google.com/maps/contrib/113121861147912976455/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWthCccNz2yFTTY-K35e8j-M2QhgMRJIJroQEob_aUHQZY1CuA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "The boarding school rooms are spacious and during assembly, the presenter said that you could choose one roommate you know. Moreover, he said that there was a period of time to play games. I do not know if this is true but why would he lie?",
      "time": 1737777940,
      "translated": false
    },
    {
      "author_name": "Arnold",
      "author_url": "https://www.google.com/maps/contrib/100339439759776972610/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLwNES7QfTHCRbD-NR_rxJ6N2a00iRcGPROHojflZg2bET_Mw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "I am writing to express my profound dissatisfaction with the recent state of the boarding school, particularly concerning how the Integrated Boarding Program (IBP) and exchange programs have negatively impacted the overall experience for permanent boarders.\n\nLaundry Services\nThe laundry service, which was previously functional even during IBP periods, has now become a major source of frustration. Despite a promising start to the year with the new provider, the moment IBP began, the service became overwhelmed. To make matters worse, one instance of rude behavior from a boarder at the counter led the staff to resign, causing the service to stop entirely. This temporary stoppage—while perhaps not permanent—is already enough to severely inconvenience regular boarders, who rely heavily on the service.\n\nFunding and Resource Allocation\nThe boarding school’s approach to subsidizing IBP fees to encourage participation has resulted in a financial strain, further exacerbating dissatisfaction among long-term boarders. It is clear that the funds are being misdirected, prioritizing these programs without taking into account the needs and opinions of permanent boarders. This mismanagement raises serious questions about the boarding school’s priorities and the fairness of its policies.\n\nFood Queues and Scheduling Disruptions\nQueues for meals have become unbearably long due to the influx of IBP and exchange program students. During periods without these programs, such as the end-of-year examination season, queues are almost nonexistent. However, with these programs in place, queues frequently stretch to 10 minutes or more, especially during peak hours like breakfast when everyone is rushing. This has led to numerous complaints from scholars, particularly those from nearby schools who are already pressed for time.\n\nProperty Damage\nInstances of property damage, while less frequent, are still disruptive. For example, IBP students often overcrowd the lifts in the boys’ block after self-study periods, causing frequent breakdowns. This repeated issue could easily be avoided with better enforcement of rules, yet nothing has been done to address it effectively.\n\nRoommate Pairing and Privacy Breach\nThe recent practice of pairing permanent boarders with IBP students is deeply concerning. Sharing a room with total strangers who stay for only a few weeks feels like a clear breach of privacy. Last year, there was an incident where an IBP roommate brought friends into the room, some of whom sat on my bed and wore slippers inside—a highly unhygienic and unacceptable intrusion. This policy undermines the comfort and security that permanent boarders should expect.\n\nRude Behavior\nIBP and exchange program students, particularly younger ones, have also displayed rude behavior towards permanent boarders on several occasions. While these incidents may seem minor, the lack of intervention or support from the boarding school only adds to the growing dissatisfaction.\n\nConclusion\nWhile the boarding school has its strengths, such as the supportive community of friends and seniors and the availability of decent facilities, these positives are increasingly overshadowed by the issues caused by IBP and exchange programs. The challenges—ranging from disrupted services and strained resources to privacy concerns—have significantly impacted the experience for permanent boarders.\nIt is important that the boarding school reevaluates its approach to balancing the needs of long-term boarders with the demands of these programs. With more thoughtful resource management, clear communication, and better policy enforcement, the boarding school could regain its status as a comfortable and supportive place for everyone.",
      "time": 1737291916,
      "translated": false
    },
    {
      "author_name": "Thien Tran",
      "author_url": "https://www.google.com/maps/contrib/107005714415923355503/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXBuwGlW9FHhZKOoyUckDf0kl2Flp7rpprPspN_Y3QLuP0YdPr5=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "8 years ago",
      "text": "One of the best hostels in Singapore. The room is big and clean. Wifi signal is strong and can be found everywhere within the territory. The staff is very friendly and caring.",
      "time": 1490511520,
      "translated": false
    },
    {
      "author_name": "Indah Sukma",
      "author_url": "https://www.google.com/maps/contrib/108755841112007581470/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUE8g8xSfSmJzCEq5y2-GEZyRBnHdX2tqcqw29tSibKwXZ4hTPE=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "Large and well fascilitated. I stayed in the guest room for a week and feel comfortable. The room was so tidy and clean.",
      "time": 1597792269,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5243390510197102441",
  "user_ratings_total": 47,
  "vicinity": "673 Bukit Timah Road"
}