{
  "formatted_address": "Thomson Road 05-51, D 820 Mount Alvernia Medical Centre, Singapore 574623",
  "geometry": {
    "location": {
      "lat": 1.3416368,
      "lng": 103.8372638
    },
    "viewport": {
      "northeast": {
        "lat": 1.342935380291502,
        "lng": 103.8386234802915
      },
      "southwest": {
        "lat": 1.340237419708498,
        "lng": 103.8359255197085
      }
    }
  },
  "name": "Infinity Hand, Wrist & Reconstructive Surgery Centre",
  "place_id": "ChIJu81JkLQX2jER8G8Z2WybLow",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Hazelle Ke",
      "author_url": "https://www.google.com/maps/contrib/100467981830948122018/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIP65h3GXmJ-aoboQQTLOdqNUNKV0tQTujlmHVbhzwbWiSJVA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I had carpal tunnel syndrome and I went to seek Dr Lynn Tan for second opinion because the previous doctor i went to insisted on surgery on first visit and didnt explain the report. She's a great doctor and surgeon - no frills, very straightforward and patient with me as I'm very concerned about surgery but she will explain to me time and again on the reasons, effects etc. Surgery went well so thank you Dr Tan!\n\nSpecial mention to the reception staff, Sherry is super helpful and prompt in responding to my queries, thanks for the help as always! :)",
      "time": 1703655379,
      "translated": false
    },
    {
      "author_name": "mag yeo",
      "author_url": "https://www.google.com/maps/contrib/105147177897083696755/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI7TPKV5nuYgzpukYdjxBQws74wZ2xxDETInA9iNrPmw_odbw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Dr Lynn Tan and her staff are all really professional and polite.\n\nDr Lynn Tan will patiently answer my mum's many questions, and listens to mum's long stories of why her hand condition deteriorated / improved, and providing affirmation when she is doing the right thing when there's improvements :).\n\nReception staff Sherry is super friendly too, always trying to accommodate our timing so that we can sync with other doctor's appointment on the same day.\n\nGreat team! Thanks much",
      "time": 1679828192,
      "translated": false
    },
    {
      "author_name": "Lucas Low",
      "author_url": "https://www.google.com/maps/contrib/104239034320016605950/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW6N5o6OMTuIGK0suoF0Hf3CZx2gIy4u6Be9KBmBknSKZ68FkET=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "After feeling disappointed (and tired) over visiting the second specialist doctor, I walked into this clinic to seek a third (technically) opinion for my wrist injury with an even more skeptical mind. The third one is a charm indeed!\n\nDr. Tan Puay Ling is phenomenal. Upon the first visit I noticed she’s different. Not only did she patiently listen to my condition from scratch, she took the time to explain to me my conditions as though I was seeing a first doctor (I made it clear to her that she was the third wrist specialist doctor that I was seeing) and I must say, she was truly different from the rest. Unlike the other doctors who immediately recommended surgery, she suggested a conventional approach to treat my injury. This approach not only surprised me but also reflected her genuine concern for my well-being.\n\nShe carefully listened to my concerns, patiently asked questions, and thoroughly examined my wrist. Her calm and compassionate demeanor instantly put me at ease, and I felt comfortable discussing my condition with her.\n\nWhat impressed me the most about Dr. Tan was her ability to provide me with a wealth of insights for my own consideration. She took the time to explain what happened and how I should go with the conventional (non-surgical) treatment approach first, set my expectations about the timeline it would take (she said I had to wear the splint to immobilise my arm for at least 3 months! stretchable to 6 months) and reminded me constantly that I need to comply and only I can help myself.\n\nShe explained that while surgery was an option, it should only be considered as a last resort for my condition (that she believes does not warrant an immediate surgery). Over time I realised that if she was really in it for my recovery rather than just recommending me to go for surgery (which is what my first and second doctor recommended) because she only charged me the bare minimum consultation fee for the 2-3 weeks routine follow-up appointment and I'm fully aware that the she could easily make much with that one-hour window with other appointments so I considered her a virtuous doctor!\n\nOverall, my experience with Dr. Tan was truly refreshing. She demonstrated a genuine concern for my well-being and provided me with a range of insights to make an informed decision. Her emphasis on a conventional approach over surgery, coupled with her lack of a money-minded attitude, made me feel like she truly had my best interest at heart. I highly recommend her to anyone seeking an honest and compassionate medical professional.\n\nThank you, Dr. Tan! :)",
      "time": 1690019580,
      "translated": false
    },
    {
      "author_name": "Family Care Physiotherapy",
      "author_url": "https://www.google.com/maps/contrib/115138634705779057064/reviews",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKSZ4zxt_bYv3XpvowDrH3aRKVUZBaNKNj5ZpJdZ4Aerkjk4Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "",
      "time": 1683170075,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10101181906039697392",
  "user_ratings_total": 4,
  "vicinity": "Thomson Road 05-51, D 820 Mount Alvernia Medical Centre"
}