{
  "formatted_address": "60 Albert Street OG Complex, #15-11/12, Singapore 189969",
  "geometry": {
    "location": {
      "lat": 1.3024158,
      "lng": 103.8539626
    },
    "viewport": {
      "northeast": {
        "lat": 1.303885530291502,
        "lng": 103.8551534802915
      },
      "southwest": {
        "lat": 1.301187569708498,
        "lng": 103.8524555197085
      }
    }
  },
  "name": "Inspiration Design International School",
  "place_id": "ChIJyeUR8W0Z2jERwQDJnNw-Sww",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Ronnie Goh",
      "author_url": "https://www.google.com/maps/contrib/108533463984806543473/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKvtQfzMC9kW1JxxY6AbWwyEkm5nKQ5ULY2Y6GfCmAIOrll=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "As the Managing Director of Swiss Interior, I cannot recommend IDIS highly enough for their outstanding diploma and short courses. We recently sent 30 of our designers to attend their programs, and the results have been remarkable.\n\nThe courses are tailored to identify and enhance each designer’s strengths while addressing their weaknesses. This personalized approach has not only improved their technical design skills but also elevated their ability to understand and meet client needs more effectively.\n\nThank you IDIS!",
      "time": 1735123861,
      "translated": false
    },
    {
      "author_name": "CHRIS SUM",
      "author_url": "https://www.google.com/maps/contrib/115556547171959835822/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKREkQyWaqAzaVQBxW3i-PayfyFWx2IdcWhIXAkm781dZeaZQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "I am a renovation contractor. Speaking with designers have always been a difficult task in the course of my work. One of my objective for 2021 is to enrol myself into a interior design course to learn the designer mindset, language and working method. During this one year, i have learnt things that are beyond my own imagination and expectation. Now i can speak with designers better, understand their mindset and most importantly, able to differentiate a good design vs a bad design. I belief we can all bring design to a higher level as a interior designer or a hands on contractor",
      "time": 1639567227,
      "translated": false
    },
    {
      "author_name": "Cui Min Chan",
      "author_url": "https://www.google.com/maps/contrib/115034850509787514621/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ47IY5VEj_xc5eH9jKGJOd8GIarC-kF7MVNKV0drPKB8nnGQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "Enrolling in Inspiration Interior Design School was one of the best decisions I've made for my career. From the moment I stepped into the school, I knew I was in the right place. The ambiance exudes creativity, and the faculty and staff are passionate about nurturing the next generation of interior designers.\n\nThe curriculum is comprehensive and well-rounded, covering everything from design principles to technical skills and industry trends. What sets Inspiration apart is its emphasis on hands-on learning. We were constantly working on real-world projects, collaborating with classmates and industry professionals to bring our ideas to life.\n\nThe faculty members are experts in their field and are always available to provide guidance and support. They challenge us to think outside the box, push our creative boundaries, and develop our unique design aesthetic. Their insights and feedback have been invaluable in shaping my growth as a designer.\n\nOne aspect I particularly appreciate about Inspiration is its focus on sustainability and ethical design practices. We're encouraged to consider the environmental and social impact of our designs, ensuring that we create spaces that are not only beautiful but also responsible.\n\nOverall, my experience at Inspiration Interior Design School has been incredibly rewarding. I've grown both personally and professionally, and I feel confident in my ability to pursue my passion and make a positive impact in the world of interior design.",
      "time": 1717732122,
      "translated": false
    },
    {
      "author_name": "zhen ming chong",
      "author_url": "https://www.google.com/maps/contrib/114810025545045002488/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL8K4eE9V2zsmR-U-mD0UFyvyToYhk_qr874st8e9bEBihzCg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "In 2023, I stumbled upon IDIS Interior Design School, which ignited my curiosity. As I delved into the school's curriculum, I discovered that the teachers possess extensive experience in both architecture and interior design. Not only are they knowledgeable, but they are also remarkably professional and patient in their guidance. They often lead by example in class, sharing invaluable experiences that have deeply underscored the importance of practical application.\n\nAfter completing the second semester, I wholeheartedly decided to pursue an advanced diploma. My goal is to further elevate my professional expertise and skills in this field.",
      "time": 1717075937,
      "translated": false
    },
    {
      "author_name": "Doreen Ling",
      "author_url": "https://www.google.com/maps/contrib/112539334815488517085/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIUNNNofP76f535T1eYWLNBzNUqK6eFVO1WYc2okkzhL2GAkA=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "5 years ago",
      "text": "Took a leap of faith and attended the sketch up part-time course (oct 2019). Instructor is Jayden, he is direct and casual, with a good knowledge of the industry . Lesson is clear and very relevant to my job. Certain sequence need live demo (which U-tube lesson may not provide) . No regrets as I achieved what I wanted to learn. As my classmate Lynna mentioned , I also from zero knowledge of this software to able to produce the drawings attached. Already started applying to my work . Thks Jayden , job well done !!",
      "time": 1571451533,
      "translated": false
    }
  ],
  "types": [
    "university",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=885870868952580289",
  "user_ratings_total": 57,
  "vicinity": "60 Albert Street OG Complex, #15-11/12"
}