{
  "formatted_address": "170 Upper Bukit Timah Rd, #B2-13 Shopping Centre, Singapore 588179",
  "geometry": {
    "location": {
      "lat": 1.3431305,
      "lng": 103.7759651
    },
    "viewport": {
      "northeast": {
        "lat": 1.344769230291502,
        "lng": 103.7773230802915
      },
      "southwest": {
        "lat": 1.342071269708498,
        "lng": 103.7746251197085
      }
    }
  },
  "name": "Irwin's Study - GP Tuition Centre Singapore",
  "place_id": "ChIJH1bFjAY92jERk34GSZd447Y",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Kai Zhe Tan",
      "author_url": "https://www.google.com/maps/contrib/117502976560263507515/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJRLruqJUJ94K913Och4iXsLpuD6F_dKT25qszISVz237Fqig=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Mr Irwin is an extremely engaging, resourceful and friendly teacher who is able to help me glean insights from reading materials that can be applied to answering many questions. His lesson materials are prepared in a very systematic topical manner and he spends sufficient time covering each topic for us to understand its concepts properly. He also trains us to prepare potential arguments in interchangeable blocks so that they can be used to substantiate various claims, allowing us to set a strong foundation even before sitting for the exam. After joining him back in term 3 of jc1, I have consistently seen progress in my grades, culminating in obtaining an A for GP A levels. Even though the A level paper essay question that I attempted was not one that I had studied for, Mr Irwin’s teachings allowed me to apply the examples that I knew which roughly fell under the broad topic and still have arguments ready to use.",
      "time": 1740493874,
      "translated": false
    },
    {
      "author_name": "TML",
      "author_url": "https://www.google.com/maps/contrib/101218351073306536387/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUsdkG_N9tjD0doGysAllnyOVPMWLfZ73_DB7ahmaST_G9ViyQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I would say that the lessons are engaging even though i take the online lessons because Irwin call us to answer questions or to read out our answers to ensure everyone is involved in the lesson and we can learn from each other and get a diversity of opinions. Irwin is very intentional in his teaching in a way that he deliberately highlights techniques and vocabularies when going through content so that we not just learn about content but the skills also. The notes and materials provided are also quite insightful and succinct which is effective for us to learn and remember. I also appreciate how we do not have to prepare much for his lessons which does not add to our workload while still allowing us to follow the pace of the lesson easily.",
      "time": 1734938339,
      "translated": false
    },
    {
      "author_name": "joey",
      "author_url": "https://www.google.com/maps/contrib/113475893244393152481/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIREq0F5veBSYgwbph41sW5vPCZBI8FSwpeoRLQNIY1iyN5mvEj=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Mr Irwin is a very dedicated teacher.\nEven though he carries out his lesson on a mass scale (~30 students in 1 lesson), he is able to remember all of our names and makes sure everyone has a chance to voice out their opinions and answer the question posed. :)\n\nThe lesson is also well paced, with a staggered arrangement of P1 and P2 alternating between the lessons. This allows us to strike a balance and delve into each components properly.",
      "time": 1740461835,
      "translated": false
    },
    {
      "author_name": "Amanda Ang",
      "author_url": "https://www.google.com/maps/contrib/103426508057610250741/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUKZvKAfOHiiqsvK7OQPWksGhpupy-mKvnyocssN4gxWQaJPB4=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Mr Irwin has a really clear teaching style where he will go through how to used the skills taught in his lessons immediately to the general paper. He also is very friendly and knowledgable who always is willing to answer and help me clear any doubts that i may have. His lesson is very interactive where he will get students to answer and share their thoughts on a certain answer or topic which allows everyone to learn from each other and keeps me awake during the lesson due to the varied interesting responses from the other students too. Thank you Mr Irwin for helping me push my thinking beyond the limited view. You are great :D",
      "time": 1737542735,
      "translated": false
    },
    {
      "author_name": "Teo Raphael",
      "author_url": "https://www.google.com/maps/contrib/111786462154146701218/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWgvBXjJy-GjqpD6NqKKTZ9N4uliYnqUmWNWxItBz5x9lfDW50=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Mr Irwin is a patient teacher that often times uses his own free time to assist students beyond regular lesson times and answers all queries in the class no matter how long it takes. He is willing to accept and give feedback on work done by students and try to suggest areas of improvements. His methods to try and prepare for both Paper 1 and 2 I found to be quite effective",
      "time": 1737359235,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13178509525776760467",
  "user_ratings_total": 102,
  "vicinity": "170 Upper Bukit Timah Road, #B2-13 Shopping Centre"
}