{
  "formatted_address": "56 Loyang Way, #04-04 Loyang Enterprise Building, Singapore 508775",
  "geometry": {
    "location": {
      "lat": 1.3810205,
      "lng": 103.9768753
    },
    "viewport": {
      "northeast": {
        "lat": 1.382288130291502,
        "lng": 103.9784538802915
      },
      "southwest": {
        "lat": 1.379590169708498,
        "lng": 103.9757559197085
      }
    }
  },
  "name": "Jackson Powertrain Pte Ltd",
  "place_id": "ChIJRUGYIzg82jERjhaCqUcHNqM",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Syaiful Samarri (Tomi)",
      "author_url": "https://www.google.com/maps/contrib/108065763172601107395/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU0oJRAyh2Gu1N7-6yIdVlLUDBGLyu-3Ghxzhk_ebW9Zs3li-s=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I had been struggling with a transmission issue for a while and was pretty sure it was related to the clutch. I came across this workshop through an ad on Facebook and decided to give them a shot — and I’m really glad I did.\n\nFrom the moment I arrived, I was assisted by Adel, the salesperson. He was super approachable, easy to talk to, and clearly knew his stuff. What really stood out to me was that even though I was working with a tight budget, Adel wasn’t pushy at all. He only recommended what was truly necessary, which I really appreciated.\n\nThanks to Adel and the rest of the team for doing a great job fixing my car. It’s running smoothly again, and I’ll definitely be back if I ever need anything else.\n\nHighly recommend!",
      "time": 1744309510,
      "translated": false
    },
    {
      "author_name": "Nurul F S",
      "author_url": "https://www.google.com/maps/contrib/101844406206487939356/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJFZ5m43-Em_Qzq6NyGu5y0dhG2M1wOo2HyvUIFKQnF6IVz-Tg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I've been with this workshop for over a year now, and I couldn't be more impressed with their service. They always go above and beyond, providing thorough inspections for my Mini Cooper and recommending any necessary repairs. I especially appreciated how they did a detailed inspection on a car I was considering purchasing and highlighted potential issues before I made the deal with the dealer. The customer service is top-notch, and I trust them completely with my car. A big shoutout to Adel and Mugen for always providing excellent service! Highly recommend this place!",
      "time": 1742563336,
      "translated": false
    },
    {
      "author_name": "Muhammad Izzat",
      "author_url": "https://www.google.com/maps/contrib/106773905342963774572/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUTot4KMKuB6eigiFzXhAkrkscVHZ6dQjHqIrGUpN9aOs_Q7LM=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Glad to have brought my Vezel Hybrid to this workshop. Adel kindly explained the diagnosis and did the checks first to avoid excessive repair works that were not needed. Turnaround time was quick and price is reasonable. Thanks to Adel and his team for their hard work!",
      "time": 1745401031,
      "translated": false
    },
    {
      "author_name": "Justin YJ",
      "author_url": "https://www.google.com/maps/contrib/113081315169129079042/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWHj6lJSMcygKdTvQxvQ9R0G1IG18vs3b1Ln3LRYY_XGiMYQglB=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "A couple of months ago, my transmission started randomly slipping into neutral when reversing, especially on inclines. Eventually, it happened even on flat surfaces, and I also faced issues like the 1st gear slipping on acceleration and reduced power. Sometimes it got bad enough to put the transmission in limp mode, though it never left me stranded.\n\nMost workshops recommended swapping out the entire transmission, but I wasn't convinced it would fix the problem. Plus, the cost of a used or refurbished ZF8 is high, and there’s no guarantee of avoiding new problems. After talking to @white_knight_e92, I was directed to Jackson Powertrain, a ZF Authorized Service Center.\n\nFrom the first contact to picking up my car, the experience was great. Adel and his team were professional, honest, and assured me the car was in good hands. Their expertise was clear in how they diagnosed my gearbox issues and formulated a service plan. I was continuously updated with photos and videos and given the choice to approve changes. I ended up overhauling my transmission, replacing the radiator and transmission oil cooler, and getting an oil change. Though costly, I was happy to pay for their immaculate workmanship.\n\nDriving the car home, I was grinning. All the issues were gone, and the car felt healthier than when I first got it.\n\nHuge shoutout to Jackson Powertrain, Adel, and his team!",
      "time": 1723876481,
      "translated": false
    },
    {
      "author_name": "Atvest Tan",
      "author_url": "https://www.google.com/maps/contrib/104627792486816964251/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUDwT9rTLUU1hwhqVC__dCeSxWRo4G9sK4KzuKTlpHBX94rzV7hjA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "My Toyota Alphard has transmission problem ,the chain belt snapped. First workshop went want to replace a new one ,very costly.Found Jackson Powertrain and spoke to Abel and was impressed with his honesty, only need an overhaul and they did a great job and fast too with 12 months warranty. Well Done Jackson Powertrain. Highly recommended for transmission problem",
      "time": 1734661797,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "car_repair",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11760595481292576398",
  "user_ratings_total": 61,
  "vicinity": "56 Loyang Way, #04-04 Loyang Enterprise Building"
}