{
  "formatted_address": "56 Jln Benaan Kapal, Stall 4, Singapore 399644",
  "geometry": {
    "location": {
      "lat": 1.3012399,
      "lng": 103.8792458
    },
    "viewport": {
      "northeast": {
        "lat": 1.302618680291502,
        "lng": 103.8805721302915
      },
      "southwest": {
        "lat": 1.299920719708498,
        "lng": 103.8778741697085
      }
    }
  },
  "name": "Jalan Benaan Kapal Food Centre",
  "place_id": "ChIJuz38agAZ2jERn1RM1OrAcUo",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "FH",
      "author_url": "https://www.google.com/maps/contrib/105984351456008071975/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVoM8zEL3q5gnu_wlmxE4OB07DgENOZHN4-9Y71BYCiOHBedkdKYQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Relatively unknown food centre. Tried the Kway chap and it is good. The portion size is decent for $5. There's a drink stall that is operated one man show by an elderly uncle hence it is quite slow. Only $0.90 for kopi when visited in Apr 2025.\n\nPerhaps the low rental makes the price cheaper than the rest of Singapore.",
      "time": 1744001690,
      "translated": false
    },
    {
      "author_name": "D Chen",
      "author_url": "https://www.google.com/maps/contrib/117861722625449137991/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL7P20EyZei4-UjNGQYe0hQ7V-AVRh-xqX4YaWgH5gTOc6xdg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "This place reminds me of Singapore in the 80s - early 90s vibes which can no longer be seen. Only around 10 stalls here. One of the last remaining old school charcoal roti, Kaya, egg style (most left stall). Strongly recommend the egg and kopi.",
      "time": 1744163134,
      "translated": false
    },
    {
      "author_name": "Me T",
      "author_url": "https://www.google.com/maps/contrib/108574826620835359575/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUODAIVeOXc6h5hcYhKU6XuQoOE4lCU3OkQXvSXadsp3IDFiavLtA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "4 months ago",
      "text": "100% old school however the taste and prices of the food here are average if not below average sadly\n\nKway cap\nLooks super good and even has 3 bowl from makansutra but it's really disappointing with nothing worth mentioning at all, sadly I'd say you can skip this\n\nChicken Rice\nPretty much like your sec school chicken rice standard. Chicken was decent in tenderness. However flavours of everything else was not great.\n\nDrink stall closer to exit\nLiterally only has canned drinks for $1.40",
      "time": 1737115109,
      "translated": false
    },
    {
      "author_name": "HealthcAIre Kim",
      "author_url": "https://www.google.com/maps/contrib/101154220359165719571/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXOiK0fgCq2g7gcyw7y6tTP9LstK3__9pXQlVpEJlRxIZXqqpvchg=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Jalan Benaan Kapal Food Centre: Possibly the oldest, old school and smallest food market in Singapore. It feels like a zip back in time with everything reminiscent of the 70’s. A darling of the neighbourhood, Kang Siang Drinks Stall still has the old uncle who believes in timelessness. He toasts his kaya toast over charcoals and as it’s a solo operation – time stands still here. The queue forms endlessly and he takes his time to prep drinks and food, oblivious of clock ticking. Other cheap and cheerful options – Barokah Muslin Food dishes out chicken rice to the crowds by the second I’m a pescatarian but I broke the rule to try their dark soya sauce leg which puts some of the restaurant offerings to shame. Another old school favourite is kway Chap (the stall name is just named that straight to the point). I don’t think the food centre will stand the test of time for long, so drop by before it becomes dust. #eatstylishtravelstylish",
      "time": 1744456910,
      "translated": false
    },
    {
      "author_name": "James Ang",
      "author_url": "https://www.google.com/maps/contrib/100655878992435360282/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV0KIdMJqkam2b6MP-_sPjhdUntURnk5bDyIuh45eCnrcpYDtkd=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "If you drive, you better make a trip here if not you'll be letting down every Singaporean that doesn't have a car and dream of having warm, wholesome meals at such an affordable price its as if we went back to our childhood in 1995 kind of feeling.\n\nThis entire place is just old-school with lots of love from every stall owner. From the kopi uncle to the kway chap to Malay Stall Ahmad and auntie to the Chinese stall auntie, eating here is a loving affair like so much warmth from them.\n\nFirstly, the kway chap. Per pax its less than $5. Where to find?! Kway is silky soft, broth is well made and flavourful (you can see the colour its really cook for damm long type) and do you know its uncle that washes everything and the wife who does the cooking attributes it to him for the clean, fragrant taste. Taopok, fish cake all damm legit. When we were there, there was a regular and he was a bodybuilder with his GF and auntie says the two eats 4 pax share every week. If bodybuilder approve it must be good. You know it.\n\nNext is the Malay stall. Have you ever had PILLOWY SOFT nasi lemak rice? How on Earth even? Not only the rice has a decadent coconut taste, its so smooth and soft. Mad skillz. Mee Soto's soup was amazing and that broth alone made my day. Love it. I think about the food and uncle and auntie's friendliness I want to cry.\n\nLast is auntie's Chinese stall. She has chicken feet and marinated egg that's damm amazing but what I loved the most was actually her vegetables. I would tabao even more next time just to repeat for the next meal.\n\nI love Jalan Benaan Kapal and I hope Singapore can show them some love.",
      "time": 1735988884,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5364280745991623839",
  "user_ratings_total": 24,
  "vicinity": "56 Jalan Benaan Kapal, Stall 4, Singapore"
}