{
  "formatted_address": "Jln Jelutong, Singapore",
  "geometry": {
    "location": {
      "lat": 1.4013775,
      "lng": 103.9679081
    },
    "viewport": {
      "northeast": {
        "lat": 1.402706030291502,
        "lng": 103.9692669802915
      },
      "southwest": {
        "lat": 1.400008069708498,
        "lng": 103.9665690197085
      }
    }
  },
  "name": "Jelutong Campsite",
  "place_id": "ChIJl9dPc4I-2jERGlrKNK-4f74",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Allie L",
      "author_url": "https://www.google.com/maps/contrib/117776010937114066431/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWr49SmaLHYahIBgtaO7NYhjWncONhpl39wmegVijEs2kNTO_fY=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "9 months ago",
      "text": "Campsite that's the nearest to Jetty & eateries. Been camping multiple times. For non-locals that want to try camping here, unfortunately you will need a camping permit which only local or permanent resident could apply.\n\nSome areas of the ground is too hard to pitch tents. Not for folks if dislike insect bites as there aren't just mosquitoes. Toilets doesn't have shower facilities. Basic wash-up okay. Main concern will be sandflies, ants & unknown bugs. Pretty chill place though. Remember to bring mosquito coil though cos it's very helpful.",
      "time": 1723629602,
      "translated": false
    },
    {
      "author_name": "r",
      "author_url": "https://www.google.com/maps/contrib/116410155662518031045/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWUO5bDwYVrNsN7jT2TwJhwUF-OltpbW1jNlUsFvniD6Ek9ctJ9=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "Most convenient and safest campsite in Pulau Ubin.\n\nMe and my friends camped at this campsite for 2D1N and it was a pleasant stay due to its strategic location facing the sea hence 24/7 there is a cooling and windy sea breeze blowing at us all the time. The walk to the campsite was rather easy to navigate as you turn left from the jetty and walk straight ahead passing by all the shops before turning left after the sheltered gathering place and walking all the way down\n\nThe campsite ground was sandy hard but it was not unstable and soft like mud. It provided good stability for our tents.\n\nThe firepits were not that bad and there were a bunch of twigs and wood leftover from previous campers to help you set up a small fire. It also serves as a cooking area for you to cook over open fire.\n\nAnother thing is that this campsite is rather safe as there is a affectionate and friendly Mongrel (presumably owned by one of the Ubin residents) occasionally visiting the site to accompany campers and barking at monkeys and other people passing by the campsite\n\nIt is totally safe to leave your tents unattended during the day however you can take extra precautions by locking your tent zippers by tying knots or using a pad lock\n\nSome downsides of the campsite\n\n- Monkeys would come and steal your food if you leave it unattended\n- This place is pitch dark at night with no streetlights\n- The toilets are a 200m walk away and toilet water comes out brown (not safe for washing cutlery and drinking)\n\nTo enjoy your stay at this campsite here are some tips before camping here:\n\n- Bring about minimum 4 litres of water per person per day of camping. This is enough to supply yourself with enough water to drink for the day and extra water to wash your pots and cutlery.\n\n- Bring about 2-3 torchlights per person with ample battery life and about 700-1000 lumens. This should be enough to last for 2-3 nights.\n\n- Cook your dinner around 5pm as the sun will set around 6 and the sky will get darker and no street lamps are available\n\n- Bring your own food to cook (optional) as there are no shops on the island selling fresh produce\n\n- Clean up your rubbish scattered around the campsite after you finish camping as no one would like any dirty and polluted campsites in nature\n\n- Firewood and charcoal is not provided at the campsite, you'll have to bring your own to set up your own fire at the firepits\n\n- There is no shower at the campsite. Bring body wipes to wipe yourself instead of showering\n\n- Book a camping permit for your party 2 weeks in advance of your camp date",
      "time": 1717518440,
      "translated": false
    },
    {
      "author_name": "Bemeer Ang",
      "author_url": "https://www.google.com/maps/contrib/105935291235441119938/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUrKqVo_oVtllKu2LC0XvKsw6L23SJ_NLNX5nBojo05wQFEzDAf=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "3 years ago",
      "text": "A good place to camp. Walking distance from Ubin jetty and village center.  So it’s easy to buy drinks, food or snack. The chendol seems quite popular!! But we came prepared - spaghetti for brunch, bbq for dinner and burger for breakfast. The camp fire pit was very popular in the nite. We also made some friends and shared food.\n\nThe only setback is the toilet. There were many campers during this May 1st / Raya holidays. Weather was hot and there is no bathing facilities. Hope that NPark could do more to improve this.\n\nGood to check out Butterfly Hill which is nearby. Fishing is popular too. Lastly, rmb to apply for camping permit for each tent. Print out or keep a soft copy as 👮‍♀️ 👮‍♂️ will conduct checks.",
      "time": 1651555406,
      "translated": false
    },
    {
      "author_name": "Ryan P",
      "author_url": "https://www.google.com/maps/contrib/100304503323175149427/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVZ-Vkcla3NMnfTrZgmT0kGqgIdOnJXODnCTsELNS1jvxaXWVDkTw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "2 years ago",
      "text": "It’s an interesting place for Singaporeans to have open fire camping experience. The camp site c and d has some trees and vehicles do drive into it. The camp site a and b might be better in terms of more open grounds.\n\nBut overall good experience. Bring your own drinking water or way to filter and boil or tablets to clean the water from the toilet. Those water is from the quarry and meant for washing and not drinking.",
      "time": 1670515297,
      "translated": false
    },
    {
      "author_name": "Bruce",
      "author_url": "https://www.google.com/maps/contrib/101638328516862956355/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUzPfMGDDbDzSHVKat96HLEgSPMQ2SI-ubI7qto2ihEAGbvi1wxAw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "2 years ago",
      "text": "The camping site is near to toilet however take note there is any flushing system , if need go to main jetty toilet . The place near to the beach is a better spot for camping .",
      "time": 1684630937,
      "translated": false
    }
  ],
  "types": [
    "campground",
    "lodging",
    "park",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13726893251893025306",
  "user_ratings_total": 72,
  "vicinity": "Jalan Jelutong"
}