{
  "formatted_address": "277 Orchard Rd, Singapore 238858",
  "geometry": {
    "location": {
      "lat": 1.3007935,
      "lng": 103.8390901
    },
    "viewport": {
      "northeast": {
        "lat": 1.301914130291502,
        "lng": 103.8403879302915
      },
      "southwest": {
        "lat": 1.299216169708498,
        "lng": 103.8376899697085
      }
    }
  },
  "name": "JEN Singapore Orchardgateway by Shangri-La",
  "place_id": "ChIJE49v1JAZ2jERWDP05HHNONo",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "U (Mrs U)",
      "author_url": "https://www.google.com/maps/contrib/108607719991829534578/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJy0jKZnpeSmVCQfDvT2-1I32JfqySx8kGAkmNGYDgepYt3kw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "3 weeks ago",
      "text": "Location, location! You will be in the centre of Orchard Road when staying here. The view over Orchard Road is amazing when you get a room facing the iconic road. The room is quiet and the bed is comfortable. My husband and I were upgraded to a room with paranoma views and the use of lounge club - a present from the kids. We were at the hotel at about noon (3 hours before check in time) and were told that they will send us a message on WhatsApp when the room is ready. We waited till after 2pm, still no message from the hotel staff. Finally, we went back to the reception and checked in at about 2:30pm. A little disappointed with a promise not delivered.\nYin Yin, the guest relation officer saved the day. She’s so friendly and warm. She took us to the room, helped us with our luggage and welcomed us with a ‘Happy Anniversary’ message - an artwork she created on the mirror!  Very thoughtful and creative!\nThe swimming pool is great, a bit like an infinity pool. But the seating is limited, making the deck area look crowded. Why have big cushion seating in the middle when you can fit more deck chairs for the guests to enjoy the pool area.\nThe breakfast is mediocre, quantity over quality. None of the staff seems happy serving or waiting. No one asked if you would like a cup of tea or coffee. The ‘canteen’ feel of the breakfast venue makes us feel uncomfortable.\nThe club lounge is ordinary. Many guests have their dinner there, not just snacks and drinks. We have seen guests pig out, filling their plates with fried food and sweets. The standard of this club lounge is very different from the one I experienced at another hotel in Singapore.",
      "time": 1745411789,
      "translated": false
    },
    {
      "author_name": "VIJAIYASUNDRAM MUNIANDY",
      "author_url": "https://www.google.com/maps/contrib/103595816821310293096/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXrK1nE-aE4gX2ObKuaNnna-mDx5p6JMdbyM9ZFfGJx20DE2fgaKQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "I stayed at Hotel Jen Orchard Gateway over the weekend and had a wonderful experience. The room was very nice, exceptionally clean, and spacious. I appreciated their eco-friendly approach—room amenities avoided single-use plastic, with alternatives like filtered tap water and sustainable bathroom products. The pillows were especially comfortable, and I had a great rest and slept very well during my stay. Highly recommended for a comfortable and environmentally conscious hotel experience.",
      "time": 1746411027,
      "translated": false
    },
    {
      "author_name": "Altaf Kazi",
      "author_url": "https://www.google.com/maps/contrib/116072533440332217354/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK2UpMAq-pLGucbEEMqTA6Tt5qsdf0cn62ACiw1WH_u8v3F7Q=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Hotel is located perfectly for a family with kids. Right above a OrchardGateway mall and Somerset MRT.\n\nThis means you have access to good food and transport. There are food courts in and around the mall which is super helpful.\n\nHotel wise, it works, spacious clean rooms with all the amenities you’d expect. The pool on the 19th floor is soo good - great to experience during the day and night.\n\nDefinitely worth considering especially if the kids love to swim!",
      "time": 1744942068,
      "translated": false
    },
    {
      "author_name": "Olivia LZ",
      "author_url": "https://www.google.com/maps/contrib/111575454013833516207/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXkH_4agipezYqJiPUZIVQMY0Tyw2YRj02_8eGvF6tSIkaf-gwT=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "2 weeks ago",
      "text": "Had a wonderful evening at the rooftop bar of this hotel! The atmosphere was cozy and stylish, with a stunning view of the city. The cocktails were well-crafted and delicious. Staff were friendly and attentive, and the music added a nice touch without being too loud. A perfect spot to unwind after a long day. Highly recommended!",
      "time": 1746202069,
      "translated": false
    },
    {
      "author_name": "Mr. Jak Sadler",
      "author_url": "https://www.google.com/maps/contrib/110447641893388747118/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW7gomvG3Lw7C4Nlbmpon94MW071d-IxcmdJFcr1510P0E_M_Rc=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "Located on top of a MRT Station, You can pretty much reach the whole of Singapore Quickly.\n\nCheck-In: Quick and Simple.\nReception in located on Level 10.\nAlso have 2 cool delivery bots called Jeno and Jeni\n\nMy Room was 1570:\nRoom included: A safe, Fridge, Kettle, Hairdryer\nRobes, Slippers, View of the City, Shampoo, Conditioner,\nShower Gel and a Filtered water tap. But no opening window.\n\nBreakfast: Was amazing so much to choose from.\n\nPool and Tiki Bar:\nThe Pool and bar is located on level 19.\nComplimentary Pool towels available.\nLovely infinity pool which looks over the city and gives you a great view of Marina Bay Sands Hotel and you can just about see the trees in Gardens by the Bay.\n\nI would defiantly recommend this hotel to anyone visiting and would say here again when I revisit Singapore!\n\nStaff: From Check-In, Chefs, Waiters and Maids everyone was very friendly, polite and spoke very good English",
      "time": 1745348555,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15724543988020294488",
  "user_ratings_total": 4295,
  "vicinity": "277 Orchard Road"
}