{
  "formatted_address": "253 Jurong East St 24, Singapore 600253",
  "geometry": {
    "location": {
      "lat": 1.3437054,
      "lng": 103.7367469
    },
    "viewport": {
      "northeast": {
        "lat": 1.345031380291502,
        "lng": 103.7381639302915
      },
      "southwest": {
        "lat": 1.342333419708498,
        "lng": 103.7354659697085
      }
    }
  },
  "name": "JGH Design & Contract Pte Ltd",
  "place_id": "ChIJf817AxkQ2jERgaj0UkoJP64",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Jeremy Yong",
      "author_url": "https://www.google.com/maps/contrib/101491291316609383945/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKBqbtGX7iYFVgqrH6dYrIG9Da3KuJ4-WwkGkIu3eJQlRoVlg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Being first time owners, and seeing a lot of horror stories online, we didn't know what to expect. JGH was recommended by a friend of my parents, and we decided to go with this contractor after having seen his workmanship done in the family friend's flat.\n\nJGH might not be the cheapest contractor around and for the budget conscious, you may not want to go with them, but their quality of work is exceptional, not to mention attention to details, timeline and the little things like not writing instructions on your walls even though the walls weren't painted yet.\n\nMr Tay was our main contractor but to be honest, he is more than just a contractor. We had a design that we came out with, but Mr Tay not only let us know about the potential issues that might arise, he even drafted out alternative designs for us to consider. Suffice to say, we took some of his designs and having stayed in our flat for the past month or so, we totally appreciate his input.\n\nGo for this contractor if:\n- you don't mind paying a little more for good quality workmanship, great project management (Mr Tay oversees everything and updates us promptly) and peace of mind\n- you don't mind contractors giving you suggestions on work improvements (some pple prefer contractors to just do and not give input)\n- not in a big rush. We took abt 6 weeks for everything to be done, including flooring and carpentry, which was average. The team is small but highly skilled and they have been working together for the past decade or more.\n- you don't demand nitty gritty itemized costings of everything on your quotation.\n\nBasically, if you have a good relationship with your contractor, I feel that it is more giving than taking,  and we are really glad to have Mr Tay and his team to do up our flat. Great experience!\n\nps: JGH only deals with HDB renovations, so private estates/condos are not within their purview.",
      "time": 1689906051,
      "translated": false
    }
  ],
  "types": [
    "general_contractor",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12555764500956227713",
  "user_ratings_total": 1,
  "vicinity": "253 Jurong East Street 24, Singapore"
}