{
  "formatted_address": "660a Edgedale Plains, Singapore 821660",
  "geometry": {
    "location": {
      "lat": 1.4025747,
      "lng": 103.9164826
    },
    "viewport": {
      "northeast": {
        "lat": 1.403973680291502,
        "lng": 103.9177988302915
      },
      "southwest": {
        "lat": 1.401275719708498,
        "lng": 103.9151008697085
      }
    }
  },
  "name": "Jia Xiang Wei Braised Chicken Rice",
  "place_id": "ChIJZUseIQA_2jERfNliXrJSKSc",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Chua Bernard",
      "author_url": "https://www.google.com/maps/contrib/116763827953354833238/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLHICHxcOaBgD_ghZKmaaApsE4D2EOpbaq8r_TXnunyPyJzKg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "in the last week",
      "text": "Have been patronizing them for their Braised Chicken with Rice on the side, since they started operating in this location.\n\nWhat i like about their Braised Chicken stew because of an distinctive flavour, probably due to added secret spices or just ratio of soy sauce & other ingredients. Deboned chunky chicken pieces are usually succulent and simmered in the umami-packed broth. Its overall a comforting dish.\n\nAlthough overall flavour would varies depending on who is attending or cooking at the store during the time or date of your patronization, difference have been kept to a reasonable acceptance level so far.\n\nHowever, cannot deny that the same dish tasted slightly more flavourful and aromatic when they first started operating here. Quantity of broth has also been reduced and no longer filled to the rim of the claypot. Chicken pieces are still generous though.\n\nAs the coffee shop that the stall is operating, is rather crampy, stuffy and warm during the day, i would usually go after 7:30pm for dinner only, but still sweat while eating, if not seated under the big fan.",
      "time": 1747541928,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2821877567565519228",
  "user_ratings_total": 1,
  "vicinity": "660a Edgedale Plains, Singapore"
}