{
  "formatted_address": "3 Temasek Boulevard #01-618 to 620, Mall, East Atrium Suntec City, Singapore 038983",
  "geometry": {
    "location": {
      "lat": 1.295069,
      "lng": 103.8599416
    },
    "viewport": {
      "northeast": {
        "lat": 1.296302930291502,
        "lng": 103.8610703802915
      },
      "southwest": {
        "lat": 1.293604969708498,
        "lng": 103.8583724197085
      }
    }
  },
  "name": "Josiah Montessori (Suntec)",
  "place_id": "ChIJbRCHAa8Z2jER3iqwjV-ayQk",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "TAY YU LING",
      "author_url": "https://www.google.com/maps/contrib/112273540921251583468/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKIo9zYAgjb3dhoTLIGkZua2E8nUveSZawfiWJJwiGKhHfn4w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Friendly and nice receptionists and admin staffs . Wonderful educators that I have entrusted my daughter with ! Lots of activities involvements , outdoor activities, amazing curriculum! Definitely worth to enrol your child with Suntec branch . Great, passionate, kind senior teachers Ms Cao chen and Ms Natashya and all staffs, who  have passionate towards their career !",
      "time": 1733132891,
      "translated": false
    },
    {
      "author_name": "Letitia Flora",
      "author_url": "https://www.google.com/maps/contrib/107777751095712341456/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXkmlP7b0B_Qxty-5rs5-oPRalkoec85wPPh7we_hk2X_Vpwdkb=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "5-Star Review for Josiah Suntec\n\nWe couldn’t be happier with our experience at Josiah Suntec! From the moment we enrolled, the staff has shown genuine care and dedication to every child’s growth and well-being. The teachers are warm, nurturing, and incredibly skilled at creating a fun and engaging learning environment.\n\nThe curriculum is well-rounded, focusing not just on academics but also on social and emotional development. Our child has blossomed in confidence, creativity, and curiosity since starting here. The activities are thoughtfully designed to be both educational and enjoyable, with plenty of opportunities for hands-on learning.\n\nCommunication with parents is outstanding, with regular updates, photos, and newsletters that keep us informed about our child’s progress and daily adventures. The facilities are clean, safe, and equipped with age-appropriate materials that encourage exploration.\n\nWe’ve also loved the sense of community at Josiah Suntec. Festive celebrations bring everyone together, making it feel like an extended family.\n\nWe highly recommend Josiah Suntec to any parent looking for a loving and enriching preschool experience. It’s truly a place where children thrive and develop a lifelong love for learning!",
      "time": 1733135218,
      "translated": false
    },
    {
      "author_name": "Ken Sim",
      "author_url": "https://www.google.com/maps/contrib/103184790932884564395/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI_oCmiQFHdYsGISYjlgG9LC_QNawO2o3k5-9cOtSua5-9IPw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Josiah Suntec is a very impressive outlet. Their staffs are all very attentive and alert to each and every child’s character. They are able to capture the children’s attention and made learning fun, making them looking forward to go to school every morning. Our child went for foreign exchange for a period of time, and the teachers made sure they finish all the syllabus in advance so there won’t be any issue of being unable to catch up upon returning. The principal is very thoughtful with the planning of their curriculum, from learnings to playtime. The operational staffs are very alert and knows what’s happening in the centre as well. The growth here is very significant among the peers from elsewhere. Nothing to complain about! Well done Josiah! 👏🏻",
      "time": 1731654520,
      "translated": false
    },
    {
      "author_name": "Wenyu Zhu",
      "author_url": "https://www.google.com/maps/contrib/115787928297033572223/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVDyUYfEelzwKNa1Vaa1HE4ofuw5fftpChZP6jfpix4N8gZ26w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "We were drawn to Josiah because of its well-rounded approach to education, which focuses on both academic and emotional development. The warm and nurturing environment created by the teachers made us feel confident that my child would feel supported and cared for. Josiah not only provides a strong foundation for academic success but also fosters creativity, confidence, and kindness in children. Thank you!",
      "time": 1732936550,
      "translated": false
    },
    {
      "author_name": "caterin huang",
      "author_url": "https://www.google.com/maps/contrib/103992480085092760451/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocILVM-sY6qhO0bgRFJp1vVXmE-63qDtw6nujwEt95uQqJW9hw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Enrolling our baby in Josiah Suntec Infant Care has been one of the best decisions we’ve ever made for her. She has grown so much and learned an incredible amount during her time here. From mastering age-appropriate self-help skills to communicating with baby sign language, her development has been remarkable. Her love for music has also been beautifully nurtured in this environment.\n\nA special thanks to Ms. Xiuling and her team for their exceptional care and dedication. They consistently go above and beyond to ensure every child is well taken care of.\n\nAs we now prepare to graduate, we know we’ll deeply miss this wonderful preschool. Ms. Fion and all the teachers have become such an integral part of her early years. Thank you for making this journey so meaningful for us!",
      "time": 1732168685,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=705264551849896670",
  "user_ratings_total": 39,
  "vicinity": "3 Temasek Boulevard #01-618 to 620, Mall, East Atrium Suntec City"
}