{
  "formatted_address": "339 Thomson Rd, Singapore 307677",
  "geometry": {
    "location": {
      "lat": 1.325389,
      "lng": 103.841475
    },
    "viewport": {
      "northeast": {
        "lat": 1.326834230291502,
        "lng": 103.8429547802915
      },
      "southwest": {
        "lat": 1.324136269708498,
        "lng": 103.8402568197085
      }
    }
  },
  "name": "Judy Wong Clinic for Women",
  "place_id": "ChIJkw_4yeEZ2jERhmoIZXDHZRQ",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Trixie Hwang",
      "author_url": "https://www.google.com/maps/contrib/112407090877079068869/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX4z44a4aPfO63NdXRqOuL_4DApBdGEvfTM1WtpY_Fevkg-igM=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "We cannot express enough gratitude to Dr Judy and her amazing team of clinic assistants. From the very first visit, I felt genuinely cared for and at ease. Dr Judy is meticulous in her explanations, knowledgeable, and always taking the time to walk us through all the possible options with clarity and patience. She never rushed us, and always gave us the space we needed to make informed decisions that were right for us.\n\nBeyond her professionalism, what truly touched me was her gentle warmth and the calm, steady presence she brought into every appointment. She listened with genuine care, and always spoke with such patience and empathy. Her kindness was so reassuring that it felt like she was walking this pregnancy journey with me.\n\nThe clinic assistants, especially Angelyne & Felicia were equally wonderful — warm, welcoming, and always ready with a smile. Their friendliness made each visit feel less clinical and more like a comforting, supportive experience. Before each appointment,  Angelyne would give a reminder call, always speaking with such kindness and care. She would thoughtfully remind me on what to bring and what to prepare, which adds such a personal and reassuring touch to my pregnancy journey.\n\nThank you Dr Judy and the team for your exceptional care.",
      "time": 1745478839,
      "translated": false
    },
    {
      "author_name": "Alicia Lim",
      "author_url": "https://www.google.com/maps/contrib/117071380688085957944/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL-olYI4hVEHpfaGd8IUYogg5lq8zm2M1wMliQz1LifOEspEA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We first contacted Judy Wong in Aug/Sep 2024 and first to pick up was Angeline.\n\nI called other clinics up but the reception was nothing but less welcoming and rushed. Angeline made us feel at ease and answered all the queries that we had.\n\nAngeline was the first point of contact that made us choose Dr Wong’s clinic knowing that we will not be rushed like a factory output.\n\nAlong the way, we met Felicia who was also nothing short of amazing, helpful and friendly. Both Angeline and Felicia are first face of Dr Wong’s clinic and made the experience hospitable and warm.\n\nDr Judy Wong is meticulous and careful during all our consultations. She uses research journals to prove her point and shares pros & cons of each decision/method. At times, we would have much preferred that she give us a firm recommendation rather than just sharing pros and cons. Overall, it was a smooth delivery thanks to Dr Wong!\n\nOverall, the experience has been an enjoyable one and we are glad that we chose this clinic for our pregnancy journey.\n\nThank you to Dr Wong, Angeline and Felicia!",
      "time": 1743942773,
      "translated": false
    },
    {
      "author_name": "Michelle Lim",
      "author_url": "https://www.google.com/maps/contrib/102921220608575563017/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLfQYWhTtQKfXe8nGy9rZWycOuDcwu5Vp11yhSgTHsU8TYIkw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "I had the most wonderful pregnancy journey with Dr Judy Wong. She is super motherly and gentle and my husband agrees! All the clinic staff were also very kind during all our appointments and were always responsive to any questions. I’m grateful for Dr Judy for the safe delivery of my baby and if I should have a second child, I will not hesitate to return. Thank you Dr Judy and team! 🥰",
      "time": 1745838237,
      "translated": false
    },
    {
      "author_name": "wenya",
      "author_url": "https://www.google.com/maps/contrib/113182321078614935839/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLmNBoTNNLaMOVtWN8E7IT5kgvbdSh9G9AhtVGSrsO1VZYykw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "I must say this is the best clinic I have ever been to! I found Dr Judy’s clinic just by search on google, and I saw very good comments two years ago. All the google reviews led me to my first phone call to make an appointment Aug 2023. I thought I have left a google review after I deliver my second baby under Dr Judy’s care last April, turns out I totally forgot…. And I must catch up this one as I would strongly recommend Dr Judy to anyone who read this post. From the reception area, you will meet friendly nice caring gentle and pretty nurses, then you will spend a little bit time sitting at the cozy corner waiting for Dr Judy to call you. And I find it very calming the moment step in the clinic, even occasionally with slight longer waiting time, I am not bothered too much. Dr Judy has the magic of letting me feel confident about my pregnancy status, no matter when I show sign of bleeding at 3 months pregnancy, or 30+ weeks with baby head-up, and the final big day of delivery! I still remember the moments she guided me with clear firm instructions on what to do at every single step, and everything went perfectly smooth! Our family feels beyond grateful  to get to know Dr Judy and her team at Thomson!",
      "time": 1745648677,
      "translated": false
    },
    {
      "author_name": "Ef Si",
      "author_url": "https://www.google.com/maps/contrib/114058229333573288258/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWpS-BVJVEqL8g2puSe25kJFhpMgAmgfHJcj4nAZxQ6Agoa7X4HlA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Consulted for a gynae case, it was a short consult, but I could say that she's a reasonable and meticulous doctor.\nHer staff was responsive and was prompt with scheduling.",
      "time": 1746614487,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1469800138951649926",
  "user_ratings_total": 51,
  "vicinity": "339 Thomson Road"
}