{
  "formatted_address": "The Shoppes at Marina Bay Sands, 2 Bayfront Ave, B1- 01B, Singapore 018972",
  "geometry": {
    "location": {
      "lat": 1.2820379,
      "lng": 103.8575819
    },
    "viewport": {
      "northeast": {
        "lat": 1.28552475,
        "lng": 103.86176315
      },
      "southwest": {
        "lat": 1.280434550000001,
        "lng": 103.85611295
      }
    }
  },
  "name": "JUMBO Signatures",
  "place_id": "ChIJ3z7wXGAZ2jERvEErIRegmjk",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Lai WeiHsuan (Tina)",
      "author_url": "https://www.google.com/maps/contrib/100111397147292835452/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIpADLvo7hc4YX9qsLIFinYd9vaj1hfGlGbDiq1EQWX6bE2f4Sp=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Thanks for all staffs for great services and recommendations! It was truly an amazing experience visiting Jumbo during our trip in Singapore and celebrating Mother’s Day. We had a reservation for 6 seated in a VIP room. It is our first time visiting, and we are not familiar with the menu. Staffs are super friendly and patient with us. Made couple recommendations for the a la carte menu. Staffs are very attentive, constantly offering water and switching plates. We enjoy all the food and services during the visit. Thank you for having us!",
      "time": 1747026492,
      "translated": false
    },
    {
      "author_name": "Zackery Goh",
      "author_url": "https://www.google.com/maps/contrib/109405400403426765330/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUGQsp237p9vNHb-uS9FyMoz0Z-zK6zy1GCgCTEXQuCxwKVbMg-=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I recently dined at Jumbo Signature Marina Bay Sands, and it was an unforgettable experience! From the moment we arrived, the ambiance was stunning—elegant decor with a breathtaking view of the Marina Bay skyline.\n\nThe service was impeccable; our server was attentive and knowledgeable, recommending the perfect dishes to try. We started with the famous chili crab, which was absolutely divine—sweet, spicy, and bursting with flavor. The presentation was equally impressive, making it almost too beautiful to eat!\n\nFor our main course, we enjoyed the steamed fish and the black pepper crab, both cooked to perfection. Each bite was a delight, showcasing the restaurant's commitment to quality and authenticity.\n\nTo top off the meal, we indulged in their signature desserts, which were the perfect sweet ending to a fantastic dining experience.\n\nOverall, Jumbo Signature Marina Bay Sands offers a perfect combination of exquisite cuisine, top-notch service, and a stunning setting. I highly recommend it for anyone looking to indulge in a memorable meal. I can't wait to return!",
      "time": 1745044637,
      "translated": false
    },
    {
      "author_name": "Jasper Ko",
      "author_url": "https://www.google.com/maps/contrib/103759535777472037220/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXZ3m1gLwLQlTQv-XraOsHnCjrsGcgTBgrtw4mufIZrC-i6htFj=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "My family and I had a very good experience at Jumbo Signatures last night. We were given a VIP room and the service was top notch. The food was surprisingly delicious 10/10 compare to other Jumbo outlets i have been to. Even though the price is on the steeper side and limited choices, overall it was very worth it! Definitely recommended to anyone who wants to have a perfect dining experience. Thank you to all waiters and waitresses 🫶🫶🫶",
      "time": 1742616060,
      "translated": false
    },
    {
      "author_name": "Kevin M",
      "author_url": "https://www.google.com/maps/contrib/106594784695526480551/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVEMWp4x6WAuzTWVID3cqazsajwQOb3rblyLhFQsWCGAO9BAI4bkQ=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Delicious meal from start to finish, with excellent service along the way. We did the tasting menu that had everything plated per person...and items like the lobster and crab were already removed from the shell and easy to eat. Everything was great and got a good mix of food in the menu. Service was very attentive. Everything was very nice...would love to eat here again.",
      "time": 1745383842,
      "translated": false
    },
    {
      "author_name": "Rose Imperial",
      "author_url": "https://www.google.com/maps/contrib/112100563761085322035/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU6mck9ws1pFEfg1dW5SSZ1bo_T0sSwtb2esaJDXZNMSaWbJ4E=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Can’t let Jumbo signature pass during my lay over.. it didn’t disappoint.. specially we we’re placed in the VIP area. Ambience and atmosphere was great! Food was amazing, so i took the opportunity to bring some for my friends back in Dubai.. the chili crab is a must! But the scallop wrap is my favorite♥️And Romanes was spectacular!He’s our personal welcoming committee that is why the service was smooth and easy. Many thanks! Hope to see you again😊",
      "time": 1737347653,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4150806027776508348",
  "user_ratings_total": 882,
  "vicinity": "The Shoppes at Marina Bay Sands, 2 Bayfront Avenue, B1- 01B"
}