{
  "formatted_address": "Lot FF-02, Big Box, Pusat Komersial Sunway, Persiaran Medini 5, Bandar Sunway, 79250 Iskandar Puteri, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.3973258,
      "lng": 103.6266681
    },
    "viewport": {
      "northeast": {
        "lat": 1.398676030291502,
        "lng": 103.6281173802915
      },
      "southwest": {
        "lat": 1.395978069708498,
        "lng": 103.6254194197085
      }
    }
  },
  "name": "Jungle Gym @ Sunway Big Box, Johor",
  "place_id": "ChIJ3R6a_HkJ2jERJ9xr0N_5x3s",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Shane Wang",
      "author_url": "https://www.google.com/maps/contrib/109731227066204220826/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXWkFLGv0-6X6eRzdtI6AaskQCExo5X6b16WD76WFW0EVsO26Eh=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "This new indoor playground at Sunway Big Box is a fantastic addition for families like ours. We often spend time here, and now there are even more options for kids to have fun and expend their energy. The playground features some adventurous activities, such as sliding down slopes while sitting on tubes, which is a delightful rarity.\n\nHowever, there is room for improvement in the admission process, as it can be a bit slow. It would be helpful if the staff could distribute registration forms in advance or put up signs to encourage families to fill them out beforehand. This change could significantly reduce wait times and create a more enjoyable experience.\n\nThe cafe offers decent food, making it easy to refuel after playtime. Overall, I recommend this playground for a fun day out with the kids!",
      "time": 1745065895,
      "translated": false
    },
    {
      "author_name": "Caleb Lai",
      "author_url": "https://www.google.com/maps/contrib/111733963649704338081/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSXtLShdXXzAPOTWt3tHLHAUlMukwwPRGhTm4peDyK0X2VBVoo=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Very good experience here. Staff were very helpful and friendly. Observed that staff sanitising and cleaning the place frequently which was very good. The activities and slides were excellent too. I liked how there was also a place for younger kids to play so they could enjoy themselves as well. Will definitely return.",
      "time": 1747130137,
      "translated": false
    },
    {
      "author_name": "Sean A",
      "author_url": "https://www.google.com/maps/contrib/114622891414855798683/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVMT-30pqGjDg7jWgnEnUpehKj8nBm7dZRc-dT6StrYCPUvX38=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Please BEWARE! Staff will try to stop you on re-entering if you have exited the play area. Note that they expect you to eat and s#!+ in their premises and once you exit there is no re-entry. Had to made noise about exiting for a short toilet break before they allowed re-entry. This is unacceptable and the price list never indicated single entry.\n\nOther playareas offer unlimited day entry at cheaper prices. So please be cautious and ensure your rights as customer is protected as the team clearly is trying to make money. Do not get your tag cut if you intend to re-enter. Overall barring the experience with the staff the playground is okay. The go kart is not worth it, recommend you take the combo rather than buying the go kart separately.\n\nFYI: I have visited Jungle Gym in another state and it is unlimited entry for the day.",
      "time": 1745066262,
      "translated": false
    },
    {
      "author_name": "ain.hidayah",
      "author_url": "https://www.google.com/maps/contrib/110049026370952663741/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW58Sy-aQ9bL62MeCH8TTTGnfgvt80T0eQAp8_u_VteQyu2wSF5=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "The jungle gym playground was an absolute favorite for my kids! It’s a well-designed space filled with climbing structures, slides, rope bridges, and tunnels. All set in a fun, jungle-themed environment. The colors are bright and inviting, and everything feels safe and sturdy.\n\nThere’s plenty of variety to suit different age groups and energy levels, with areas for both younger toddlers and more adventurous older kids. Soft rubber flooring adds an extra layer of safety, and there are shaded benches for parents to relax while watching their children play.\n\nOverall, it’s a fantastic place for kids to be active, explore, and burn off energy.\n\nRating: 4.8/5",
      "time": 1746507397,
      "translated": false
    },
    {
      "author_name": "Le Zi Yan Le",
      "author_url": "https://www.google.com/maps/contrib/108047361940292556233/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLNvrCyOh0ym8wIpkuuNnhYHove1LYCJmlOtJZbKV1CsrQAuw=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "2 weeks ago",
      "text": "I would give this place 4 stars because everything is great—except for the entrance fee, which I find a little high.\n\nI love the new setup of the indoor playground. It’s both challenging for kids and friendly for babies and toddlers. There are so many different areas to explore, including a ball pool, trampolines, big slides, a speed slide, a tube slide, and more. I really appreciate how the playground encourages kids to solve problems and find their own way through—while still being very safe and well thought out for all ages.\n\nOne highlight for me is the indoor Meta Kart—so fun! And the café is perfect for parents. I just sipped my coffee and relaxed while watching my baby have a great time.\n\nI also want to compliment one of the staff members—a Chinese lady with short hair, who I believe is manager. She was constantly monitoring the kids and showed so much patience and care. When children tried to leave the play area to look for their parents, she gently explained (in a fun way!) that they couldn't go out because a dinosaur might catch them—very creative and funny! 🤣 Her way of ensuring safety was impressive, especially with such a big crowd.\n\nI asked her why the adult wristbands couldn’t be exchanged between parents, and she explained it clearly. It’s for safety reasons—only the parent who signed the form can bring the child out, and the wristbands have numbers to match the adult and child. That makes total sense and shows how seriously they take safety.\n\nYes, there was a long queue, but the manager and staff did their best to manage the crowd. It’s understandable since they need to go over the T&Cs with parents and ensure everyone is aware of the safety rules.\n\nOne thing I hope for is that parents take more responsibility. A kid even hit my baby, and although the staff stepped in right away, the child didn’t listen. It’s not the staff’s fault—parents really need to watch their own kids.\n\nOverall, I still highly recommend this place if it’s within your budget. It's cheaper on weekdays and slightly more expensive on weekends, but definitely worth the visit.\n\nGreat place to spend quality time with kids. All the children were clearly having a blast. Keep up the good work!",
      "time": 1746159598,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8919372326700309543",
  "user_ratings_total": 54,
  "vicinity": "Lot FF-02, Big Box, Pusat Komersial Sunway, Persiaran Medini 5, Bandar Sunway, Iskandar Puteri"
}