{
  "formatted_address": "5 Stadium Walk, #01-45, Singapore 397693",
  "geometry": {
    "location": {
      "lat": 1.3021918,
      "lng": 103.876502
    },
    "viewport": {
      "northeast": {
        "lat": 1.303398430291502,
        "lng": 103.8779187802915
      },
      "southwest": {
        "lat": 1.300700469708498,
        "lng": 103.8752208197085
      }
    }
  },
  "name": "K.STAR @ Leisure Park Kallang",
  "place_id": "ChIJIXTdFUcZ2jERqsZOOmreWOs",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "FCAJimmy Tan",
      "author_url": "https://www.google.com/maps/contrib/116221157889101759337/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVZVgmqJtWMD2m6fcm6lzHEAqARqB16hFzSoTkLy74Tln80HPk=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "The songs have a lot, sound also good. Room\nIs big and the theme is fun. Like it and they have promotion now at $9.90 only. Can come with friends and lots of space in room",
      "time": 1739080870,
      "translated": false
    },
    {
      "author_name": "Ernest Quah",
      "author_url": "https://www.google.com/maps/contrib/103264019537998002096/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKL73lwVygbrb_Ln5AQDdE8OUwFvhZ4jJmR39hbgzFC6oRVbA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Came here on a wkend with some friends. The room's decorations were pretty cute and there was a great selection of songs. Service was decent as the staff was rather helpful with our questions too.",
      "time": 1739120291,
      "translated": false
    },
    {
      "author_name": "Mi Lo",
      "author_url": "https://www.google.com/maps/contrib/102693411764875830742/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJu6sBpF1CoLurnZ0OYvpQGBuGpqhMGS_MK2iIxrl3Yv-zn7Q=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "SAVE YOUR MONEY AND SANITY.\nGO TEO HENG. (I am not paid to say this. I just love teo heng.)\n\n*Scammed into paying extra*\n\nThis karaoke place is an absolute joke, and I can't stress enough how terrible the experience was. My two friends and I decided to check out this newly opened spot, and it was a complete disaster from start to finish.\n\nHalfway through our session, a staff member barges in, demanding we pay a corkage fee for our drinks. He says they don’t allow outside drinks, which we had no idea about because no one mentioned this policy when we made the booking. My friend had called ahead, and no one bothered to tell her. Then this rude guy starts interrogating us, asking if the person who took the booking was a man or woman. When my friend said “a woman,” he just keep quiet. Totally unprofessional.\n\nI went outside to discuss the issue with them, and they show me a sign saying “no outside drinks”—but here’s the kicker: they have over 10 signs on their front desk. Not a single one was pointed out to me when I checked in. Not once was I verbally told about this policy. Not once was I asked to sign anything acknowledging this rule. And to top it off, the staff member admitted that they should train their employees to actually inform customers about this, but still insisted we pay up.\n\nThe guy was beyond rude and completely demeaning the entire time. This is a legit convo I had with him:\nHim: \"what other karaoke allows outside drinks?\"\nMe: \"Teo Heng\"\nHim: \"Okay but they dont sell drinks\"\nMe: \"Yes they do.\"\nHim: \"Okay but it's only soft drinks\"\nMe: \"I mean you asked me so I said Teo Heng\"\nHim; \"Okay CAN WE NOT talk about other places?\"\nMe: \"Um but you're the one who brought it\nup??\"\n\nAt one point, he even said, “If you don’t pay, I’ll get in trouble with management.” So I asked him how management would know, considering there were only two employees on-site. He smugly tells me there’s CCTV everywhere. What a joke.\n\nIn the end, I was forced to pay for one soju just to avoid further frustration, but not before this guy made the entire process as unpleasant as possible. Not to mention there's SERVICE CHARGE AND GST. For what service exactly???\n\n*Karaoke system and Themed Rooms*\n\nBut wait, it gets worse—the karaoke system is trash. The song selection is severely limited, especially when it comes to Korean songs. And every time a new song starts, the lights turn on, and the backing vocals cut out. I even asked the staff at the start if there was any way to keep the lights off and maintain the backing vocals, and the response I got was, “I don’t know what you want me to do.” Unbelievable.\n\nAlso no option to pick from YouTube like in Teo Heng.\nAlso, the themed rooms are fun but the white pillows are blackish so.\n\nOverall:\nThis place is an absolute disaster in every sense. Awful service, terrible systems, and a staff that couldn’t care less about customer experience. I will never come back here, and I’d advise anyone reading this to stay far away. Don’t waste your time or money.",
      "time": 1737790161,
      "translated": false
    },
    {
      "author_name": "sandra wee",
      "author_url": "https://www.google.com/maps/contrib/115905330366421316129/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVXfFdLhBwMv5uUvQao16dWThmxkYMOPttVjaXJMxi3SrlqFPMp=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I had a great experience at K Star! Ivan was incredibly friendly and welcoming from the moment I walked in. He made the whole visit feel comfortable and enjoyable. You can really tell they care about their customers. Highly recommend for anyone looking for a place with great service and good vibes",
      "time": 1744366311,
      "translated": false
    },
    {
      "author_name": "president joon",
      "author_url": "https://www.google.com/maps/contrib/115766789192342718064/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIUKfLQ3QBuXvW-4kxHU5EMkfJdSN071pLHEZHUiskCafYWrg=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "3 months ago",
      "text": "When I arrived, the staff weren't paying attention. One person was on the phone, another was cleaning. I stood waiting for about 4 minutes before someone even looked at me. They didn't smile or seem interested in helping.\n\nThe room and place was very nice, standard for a karaoke, but they didn't explain how to use the equipment. I had to figure things out myself. The karaoke system was similar to others, so it wasn't too hard.\n\nWe set the lights to a romantic mode, dark with moving colored lights. But after every song, the lights would go back to normal. Super annoying!\n\nUsually the device for choosing songs is near to a seat so that the person controlling the songs can sit down while doing their job. However, for the room we got we had to keep walking to it. So we scanned the qr code instead to use our phones to control and add songs but the website was super laggy. Different songs had different volumes so we had a tough time adjusting the volume, pitch, skipping and finding songs. Not sure why a lot of the songs we wanted were not being able to be found but that’s okay.\n\nWe were also charged a service charge, although it’s normal for a karaoke, we felt it was unfair given the poor service we received.\n\nI would definitely recommend going to other karaoke places with similar rates. Those places have better service, actually explain things, and make you feel welcome. Although we paid a promo price, we should still be getting the same service as any other full paying customer.\n\n2 stars for the aesthetics and environment! The place was clean and the decor was very nice. The room was very cute too with comfortable sofas. Audio was fine.",
      "time": 1737775371,
      "translated": false
    }
  ],
  "types": [
    "shopping_mall",
    "bar",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16958548944689743530",
  "user_ratings_total": 70,
  "vicinity": "5 Stadium Walk, #01-45"
}