{
  "formatted_address": "12 Jiak Chuan Rd, Singapore 089265",
  "geometry": {
    "location": {
      "lat": 1.2797961,
      "lng": 103.8419111
    },
    "viewport": {
      "northeast": {
        "lat": 1.281178930291502,
        "lng": 103.8432385302915
      },
      "southwest": {
        "lat": 1.278480969708498,
        "lng": 103.8405405697085
      }
    }
  },
  "name": "Kafe Utu",
  "place_id": "ChIJh1wCZnkZ2jERXbJCdT_iKGo",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Mimo Eats",
      "author_url": "https://www.google.com/maps/contrib/109251384615992579089/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVNypueS7VgPX-HRTFknsiuYZrOY8H6dnSgkeD8Pxcny6m-vmA7pg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Cafe Utu: A Warm and Flavorful Escape to Africa\n\nCafe Utu is a beautiful and inviting spot that instantly transports you to Africa with its rich décor, music, and warm atmosphere. We loved the friendly service, thoughtfully designed setting, and the overall vibe of the place—it’s clear that a lot of care went into crafting an experience that feels both immersive and welcoming.\n\nThe food was flavorful, showcasing spices and ingredients distinct from Asian cuisine, yet with familiar touches in items like chapati and coconut rice. We particularly enjoyed the cauliflower starter, which was perfectly cooked and enhanced by crunchy sunflower seeds and a tangy Dijon-based sauce—a great way to kick off the meal.\n\nThe fried chicken and fried plantains were decent, though more standard in flavor and less adventurous than we expected. For mains, the charred aubergine lamb stew stood out with its tender lamb and the silky texture of slow-cooked eggplant. The calamari, on the other hand, was more forgettable, served in a tomato-based sauce that lacked distinction.\n\nThe recommended chicken in peanut sauce was a pleasant surprise—its earthy richness added a different twist to a dish that could have easily leaned too close to familiar Southeast Asian flavors.\n\nWe ended with the chocolate dome dessert, which featured spiced custard, dark chocolate, and a milk chocolate sauce. While the use of pepper in the custard was unique and bold, the overall dessert didn’t quite hit the mark for us.\n\nOverall, Cafe Utu is a wonderfully atmospheric spot with great service and decent, thoughtfully prepared food. While some dishes could use more refinement or boldness, the experience as a whole is definitely worth a visit—especially for those looking to try something beyond the usual dining scene in Singapore.",
      "time": 1744545848,
      "translated": false
    },
    {
      "author_name": "Frances Darwin",
      "author_url": "https://www.google.com/maps/contrib/113312498883840653534/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUUsmsR1iRF4UmRp1UcyosT7s2raaPVgw-snUHLXPnvacmLy2Eijw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "Hands down the best and most beautiful hot chocolate I’ve had IN THE ENTIRE WORLD. We went for brunch and absolutely loved it. I got a vegetarian plate: My scrambled eggs were perfection, and it was so fun to try a new cuisine that I hadn’t tried yet (rare in this increasingly globalized world). We also fell in love with the design and the decor and spent a good chunk of time taking selfies on all three floors.",
      "time": 1747226200,
      "translated": false
    },
    {
      "author_name": "Jennifer teh",
      "author_url": "https://www.google.com/maps/contrib/112609317626320056683/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWCFq4gch-wL6WS8JEDJ8abQE0qYVsTUS4HXj3hLFbbAfL60DqrDQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "Kate Utu is more than just a restaurant; it's an experience. Stepping inside, you're immediately struck by the beautiful atmosphere. The space is clean, inviting, and exudes a warmth that welcomes you in.  The staff, super friendly and attentive, add to the overall charm, making you feel like a valued guest.\n\nBut the true star of the show is the food.  Each dish, from appetizers to desserts, is a delightful surprise, showcasing the vibrant flavors and culinary traditions of Africa.\n\nWe were particularly smitten with the Yassa fish, a flavorful and aromatic dish that perfectly captured the essence of  africa cuisine.  The smoke pork belly was another standout, its smoky flavor and tender texture a testament to the chef's skill.  And the Liberian peanut chicken stew was a comforting and satisfying dish, its rich peanut sauce a delicious medley of spices and flavors.\n\nThe drinks were equally impressive.  The Cacao kali was a refreshing and decadent treat, while the honey java (coffee) was a perfect blend of sweetness and caffeine.  And for dessert, the Kilifi cake and Malindi halwa were a sweet ending to a memorable meal.Overall, our lunch at Kate Utu was a delightful experience. The food was exceptional, the atmosphere was beautiful, and the staff was friendly and attentive.  We highly recommend Kate Utu to anyone looking for a taste of authentic African cuisine in a welcoming and beautiful setting.\n\nRating: 5 out of 5 stars",
      "time": 1745341632,
      "translated": false
    },
    {
      "author_name": "Siaw Wei Cheong",
      "author_url": "https://www.google.com/maps/contrib/114191719339596703074/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIwxByMe2Oa1QE6g5unspl2957Q--0PBGeQTiVIj1gP09Em_g=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Was here for brunch last time with a gf. We left, being impressed with the food and thinking about next visit.\n\nFast forward to few years later, my gfs decided to celebrate my birthday at Kafe Utu. Food was again nothing short of yumminess. We had a duck curry (daily special) that we requested them to put on the menu permanently. Chicken curry was also bursting with flavors.\n\nWe definitely enjoyed the appetisers - cauliflower florets as well as the fried plantain. The spices just gave everything a magical touch. They could be familiar like those in chinese, malay or even indian cuisines. But elevated version that brings everything to another dimension.\n\nWe also had two lovely desserts as my birthday ‘cake’. Cocktails were really good too. I loved my Green Mamba with coriander and jalepeno.\n\nShoutout to the attentive and friendly staff that kept the birthday girl’s umbrella. They responded to me on ig when they were closed on Mondays. Safe to say that i got my umbrella back!\n\nAnd for sure, we will be back again for more food, ambience and service! Kudos to the team!",
      "time": 1740895658,
      "translated": false
    },
    {
      "author_name": "Shirley Lim",
      "author_url": "https://www.google.com/maps/contrib/110430313389823015589/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWpNv-yhyqbBhnvJ2ptfCv2IncXGfi_wwrWxcntcqGqYpdCE2CPTw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "The food is so delicious here. Love the curry chicken, had a good flavour profile to it. The highlight was the homemade sauce they gave with the croquettes which was also super tasty and creamy. The sauce had habanero and has such a good kick to it. Wish they sold that.",
      "time": 1744562128,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "cafe",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7649612729266909789",
  "user_ratings_total": 1520,
  "vicinity": "12 Jiak Chuan Road"
}