{
  "formatted_address": "110 Sengkang E Wy, #01-04 Sengkang General Hospital, Singapore 544886",
  "geometry": {
    "location": {
      "lat": 1.3953792,
      "lng": 103.8929373
    },
    "viewport": {
      "northeast": {
        "lat": 1.396635680291502,
        "lng": 103.8941326302915
      },
      "southwest": {
        "lat": 1.393937719708498,
        "lng": 103.8914346697085
      }
    }
  },
  "name": "Kaffe & Toast Sengkang East Way",
  "place_id": "ChIJ3XRGcQAX2jERo-zuUaPX2Pg",
  "rating": 3.1,
  "reviews": [
    {
      "author_name": "Jasmine Lim",
      "author_url": "https://www.google.com/maps/contrib/101082826968825520056/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLEHKTrHeQeT5pnLcdljCedCgGWp5Kn_WM9wRxhRcr1Kbp1e4Sb=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "Super bad experience. Waiting time dam long. Bread finish already drink haven't ready . Order set b and Milo dinosaur ask for straw they said don't have. Aske to use spoon to stir. Than drink until dam messy.people Da bao can provide straw . Dine in no straw. Lousy service. Bed attitude.",
      "time": 1745978780,
      "translated": false
    },
    {
      "author_name": "Ashim Ahmad",
      "author_url": "https://www.google.com/maps/contrib/105588295153388150934/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUCoQ6wKGB_SO4IumgWXvtM93yqoAEO54XPr8Qf_wcfb1t18d1U=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "13/12/2024. Last order was meant to be 8pm. But at about 8.10pm, while we were just into our soft-boiled egg & toast serving, the male cafe assistant/cleaner was making so much noise by deliberately draggging the tables and chairs as he started to sweep/mop the floor and clean up the place. This is clearly intended to chase the sitting customers away so that they can clean up the cafe without delay prior to closing. This is disrespectful and outright rude. When this was highlighted to the female cashier, she and another male staff insisted that the cafe closed at 8pm despite being reminded about the sign indicating last order at 8pm. The cafe management needs to be aware of this and take appropriate remedial measures in the interest of the business... or simply update the cafe opening hours signboard!",
      "time": 1734099296,
      "translated": false
    },
    {
      "author_name": "Winnie",
      "author_url": "https://www.google.com/maps/contrib/115783837558713239033/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK7fyjCX8EqvUwgdhaVxBN8OaIv59ZV_1TQLeZBw_vcufDmdg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "I'd like to think that staff working in a hospital setting should be more empathetic. When I'm both a patient and a customer, little did I expect to be treated to the most insulting experience I ever had.\n\nThe cashier made me feel uncomfortable right from the start. When she placed the bread on my tray, I naturally assumed it was for me and proceeded to take the tray and leave, upon which she said in the most condescending tone, \"Did I say the bread was for you? When did you ever hear me say that?\" I was shocked by her rude remark, but merely laid out the facts to her. Not only did she not apologise, but she actually had the nerve to insult me in the most brazen manner, \"I was gesturing to another person to inform him that we would send the bread to him. We only send food to customers who are wheelchair-bound. Are you even on a wheelchair?\"\n\nThat was the most insensitive remark I have ever heard. It smacked of condescension, self-righteous assumptions and the blatant lack of empathy. First of all, why would she assume that only those in wheelchairs are mobility-impaired? Has she not heard of hidden mobility issues? I am currently undergoing treatment for terminal breast cancer and I have been suffering from lower back pain for the past two years. I can choose to remain in a wheelchair if I want to. But I prefer to be independent and use a back brace to support my spine when I am walking around outside. I don't expect to be given privileges, but I definitely don't deserve to be treated with such an utter lack of compassion.\n\nAfter being insulted continuously, I decided I had enough and confronted her about her disrespectful attitude. I was flabbergasted when she didn't think it was a problem and even tried to pick a fight with me. She only offered an apology begrudgingly after two of her colleagues apologised on her behalf.\n\nI did not manage to get the name of this cashier, but she is a middle-aged woman who is quite tall.\n\nI have written to Kaffe and Toast twice, but did not get any reply from them. Does that mean they actually condone their staff's attitude and behaviour? This goes beyond bad customer service; treating a customer (and a cancer patient at that) with such insensitive disdain is absolutely deplorable and unacceptable.\n\nI will be boycotting Kaffe and Toast until they take accountability for what their staff did.",
      "time": 1744352486,
      "translated": false
    },
    {
      "author_name": "syif hans",
      "author_url": "https://www.google.com/maps/contrib/117728205887719545784/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWHbRE9lzn5XkAFCKKuW8iNy7eUljG5b7Myv8e38IlWB1z_rFb53g=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "9 months ago",
      "text": "Bee Leng who served us and another phillipine lady (refer to picture) refuse to change the kaya butter toast that was terribly done. It is really disappointing to pay for $6 and we receive this kind of service at Kaffe & Toast. Worst service. Rude & Selfish. Told us that if we buy the Butter Toast only will get Butter More but if we buy butter kaya this is what we will get. If this is what we get, this is my first & last here. Really horrible experience.",
      "time": 1722062433,
      "translated": false
    },
    {
      "author_name": "Chong KV",
      "author_url": "https://www.google.com/maps/contrib/114047288472149349381/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX_UreVzsNHUHEgi-6O_n3CbgB0FvQtJ3qP9kh1p017-TNYpkxEiw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 2,
      "relative_time_description": "a year ago",
      "text": "Price very reasonable compare to the food count in hospital. Laksa very nice, must try.\nUpdate 2024: price above the food court but left with not many choices in the hospital, I ordered the meatball soup but there meat ball are still \"freezing\" together although they are both cooked, something that can be improved",
      "time": 1710628126,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17931319012829883555",
  "user_ratings_total": 160,
  "vicinity": "110 Sengkang East Way, #01-04 Sengkang General Hospital, Singapore"
}