{
  "formatted_address": "1, Block 4 Hospital Dr, #01-100 SGH, Singapore 169608",
  "geometry": {
    "location": {
      "lat": 1.2794153,
      "lng": 103.8350121
    },
    "viewport": {
      "northeast": {
        "lat": 1.280670230291502,
        "lng": 103.8364557302915
      },
      "southwest": {
        "lat": 1.277972269708498,
        "lng": 103.8337577697085
      }
    }
  },
  "name": "Kaffe & Toast 1 Hosp Dr",
  "place_id": "ChIJAwAAIHAZ2jERkCwJ24CoyJI",
  "rating": 2.2,
  "reviews": [
    {
      "author_name": "七重天",
      "author_url": "https://www.google.com/maps/contrib/110248892365576467175/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUAm23y2XGTjfHG2VzRY_JMhKXTXqUuEUU6i_RR6hTGlxco8MGS=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "Ordered ice coffee and dry brisket noodle. Paid $10.10. Waited for about 10min, looking at them chit chatting and laughing but no food was prepared , other customers behind gotten all their food. When ask, worker said i only ordered ice coffee. I ask her to check her transaction if the ice coffee is worth $10.10, she rudely reply saying she’s not the one taking order. So i question the counter  lady who took my order, she replied with “oh we over looked”. I told her i wanted to cancel my order, but she refused to do it, whilst telling the colleague to prepare. I took a photo of them. She aggressively question me why i took their photo. Please sent your worker for disciplinary training. Don’t bring other country f&b standard to be normalised here in Singapore. Seems like this outlet doesn’t take everyone’s review seriously.",
      "time": 1736511642,
      "translated": false
    },
    {
      "author_name": "Ben Tan",
      "author_url": "https://www.google.com/maps/contrib/108719498087648557812/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK2DzF6B4HFPpDRo_8rR2VXOYZyXkVyeJt1HihVGrvZAD_dhQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "The mee robus noodles are so hard!\nSignature noodles taste bad too.\n\nConclusion this cafe only edible food is bread. Noodle cannot make it.",
      "time": 1747027530,
      "translated": false
    },
    {
      "author_name": "Tan Likhoon",
      "author_url": "https://www.google.com/maps/contrib/108159758744924097396/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ0W73DBmeQ8KlWcJ6OsvvfTAN1ceTA7X6odP24gTaW6UtZ0Q=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "8 months ago",
      "text": "Given wanton mee with chilli when I already ordered no chilli. The lady told me that they follow the order in system.\nWell, thats not what I have ordered and its not my problem that the wrong order reflected in your system.\n\nI saw the way she prepared. She did not ask if I would like to have tomato sauce instead. She just throw all the condiments in without asking.\n\nI ordered dry. Look at the photo, is it dry or semi soup base?\n\nUsed to be one of the better makan place in SGH. However, the quality of the foods getting worse. Expensive despite after discount.\n\nVery upset with the service and foods quality.",
      "time": 1726646110,
      "translated": false
    },
    {
      "author_name": "Valerie Kong",
      "author_url": "https://www.google.com/maps/contrib/116309370229352982519/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUiTy8cBjKk_xrQLfJIQgVeC1KR4G-ZRMsBE1nB9i1mnhHGSwo=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Ate here on a Thursday evening at about 8pm after my father finished his appointment at SGH. We ordered mee siams for myself and my mother, while my father ordered a grilled chicken noodle because his stomach and IBS cannot tolerate chilli. The menu had no clear indication that there would be chilli included and the cashier had not informed us that there would be chilli either. When the food was ready, my father dug in and realised there was chilli, so he requested the woman staff in a hijab to change the noodle. She blatantly refused and said that \"all the items on the menu got chilli. It's normal.\" And the cashier simply rebutted with a \"you never tell me you don't want chilli.\" As customers who have never eaten here before, are you expecting us to know that the items on the menu would automatically have chilli? This is my first time encountering a shop like that that doesn't ask the customer, \"do you want chilli?\"\n\nI understand that us customers could have clarified as well, but every other shop like Eat! or food courts would ask this very simple question and take the initiative.\n\nThe service was terrible. All they had to do was apologise and they couldn't even do this. Would never eat here again. SGH should get a new cafe/restaurant to replace this one. This cafe with poor reviews does not reflect back well on the hospital either.",
      "time": 1696509991,
      "translated": false
    },
    {
      "author_name": "Exe Cell",
      "author_url": "https://www.google.com/maps/contrib/103398833745149368830/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUn2x-k54XAQ6Lx1DuP7vy6QuH33QG2lQ_zzL7leIawIwqwVeQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "a year ago",
      "text": "Tl:dr beef brisket nice\n\nOverall experience is food is nice to ok. Look at the brisket, the tendon and the noodle. All look and taste good!\n\nBut service quite bad. Not just self service, but also cleaning is slow. Server quite brute. But overall food is nice and also worth the cost too! So ok la~ 3*",
      "time": 1713683517,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10576888996263701648",
  "user_ratings_total": 93,
  "vicinity": "1, Block 4 Hospital Drive, #01-100 SGH, Singapore"
}