{
  "formatted_address": "150 Orchard Rd, #04-23/24 Orchard Plaza, Singapore 238841",
  "geometry": {
    "location": {
      "lat": 1.3009768,
      "lng": 103.8410562
    },
    "viewport": {
      "northeast": {
        "lat": 1.302545730291502,
        "lng": 103.8425673802915
      },
      "southwest": {
        "lat": 1.299847769708498,
        "lng": 103.8398694197085
      }
    }
  },
  "name": "KAI Yakitori",
  "place_id": "ChIJSbV4K5cZ2jERYMR4fuARk2c",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Yu Quan Yeo",
      "author_url": "https://www.google.com/maps/contrib/109504835113397432635/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUO10ZDooZdAENb0gxSGrkdt5Q8EvBNJv-1ypA3bo4sXgl908oEgw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "KAI Yakitori delivers an exceptional dining experience that centres around expertly crafted yakitori. The skewers, cooked over premium Binchōtan charcoal, bring out the best in a variety of ingredients. From pork and chicken to unique items like ginkgo nuts and chicken cartilage, each bite showcases meticulous preparation and authentic flavours.\n\nA standout dish during my visit was their seasonal Shirako (milt), served in a sweet and savoury sauce. The delicate texture of the shirako paired beautifully with the sauce’s complexity, creating an unforgettable experience.\n\nWhile the yakitori was excellent, a dish that took my by surprise was their Oyakodon. This bowl of tender chicken chunks, rich savoury sauce, gooey eggs, umami-packed seaweed, and an additional raw yolk was a symphony of textures and flavours. Every bite was indulgent, and it’s easily one of the best  Oyakodon I’ve ever tasted in Singapore. The Sweet Potatoes were fantastic as well, natural caramelisation from the heat of the charcoal and presented elegantly on sticks, such a sweet delight.\n\nAlthough the prices are on the higher side, the quality of ingredients, mastery in preparation, and overall dining experience justify the cost.",
      "time": 1736953616,
      "translated": false
    },
    {
      "author_name": "Jonathan Chou",
      "author_url": "https://www.google.com/maps/contrib/111410888330115052454/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVoZrBAumiPS7-e8H22dI91DMOyuvOeYmE3IVVWJrW1NE-2tGp3=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "For the prices you pay, the servings you get are not that much.\n\nHowever, the taste was impeccable.\n\nThe service staff were very knowledgeable about the food items.\n\nI wish there could be a sort of \"dinner tasting menu\" for their chicken skewers.\n\nI had to order a chicken ramen to fill myself up. I'd say I have slightly above average appetite.\n\nThis is not your casual yakitori diner. Be prepared to spend above $50, without alcohol.",
      "time": 1743595336,
      "translated": false
    },
    {
      "author_name": "Eros Ng",
      "author_url": "https://www.google.com/maps/contrib/106345554384012940686/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXxL5P2uGBbi04EdqkiRQlTpSgUDVCroIZj7ELuxTqOv6CXU8Kj=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "The chicken skin crispy and fragrance best I eaten. All the yakitori is done to perfection. Juicy fragrance and crispy. This my top yakitori list",
      "time": 1729781260,
      "translated": false
    },
    {
      "author_name": "Gursheel Dhillon",
      "author_url": "https://www.google.com/maps/contrib/118125638377219514645/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUt8oJx1EJGlqc4jfxGOS-Sp2R-tQXK_4xZBJHPFW-V5qW5wG4h=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "A little hidden gem in Orchard plaza. It was highly recommended by a friend & we lucked out and managed to get a reservation. The food was absolutely delicious. A lot more chicken focused which we honestly didn't mind but what absolutely impressed me the most was the vegetables that tasted incredible after being chargrilled! It's mandatory to pair your meal with a bottle of sake but you honestly wouldn't have it any other way either. The team were extremely sweet and even though it was our first time, both Chef and service team were friendly. Definitely a must-visit if you're a Yakitori fan.",
      "time": 1665893566,
      "translated": false
    },
    {
      "author_name": "Michelle Luo",
      "author_url": "https://www.google.com/maps/contrib/115438079917894070789/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIs-73i7gfGoJAs_iKInTypFR61vSwIDRaFhiKUgzzOrRvatw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Really high quality yakitori. Have been trying several yakitori places to compare with what we tried in Japan - this place offers authentic yakitori with the best ramen I’ve ever tasted (calibrated to suit my picky Singaporean taste buds). Highly recommend the tori negi (chicken thigh with leek) as the chicken is soft, juicy and the leek brings out the binchotan charcoal aroma. Chicken oyster blade was really interesting & surprisingly yummy- crispy skin with succulent chicken. Tsukune surprised us as it was juicy, flavourful & kept us wanting more. Despite being on the slightly pricier side, we feel the effort and dedication put into each piece of yakitori and especially the ramen. Can’t wait to come back again, after Ting’s wonderful service and recommendation of other dishes/ skewers.",
      "time": 1704203418,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7463328663375234144",
  "user_ratings_total": 67,
  "vicinity": "150 Orchard Road, #04-23/24 Orchard Plaza, Singapore"
}