{
  "formatted_address": "10 Airport Boulevard CHANGI AIRPORT T4, Level 2M Departure Transit, Singapore 819665",
  "geometry": {
    "location": {
      "lat": 1.3388999,
      "lng": 103.983927
    },
    "viewport": {
      "northeast": {
        "lat": 1.340413780291502,
        "lng": 103.9848767302915
      },
      "southwest": {
        "lat": 1.337715819708498,
        "lng": 103.9821787697085
      }
    }
  },
  "name": "Kaki Makan Cafe",
  "place_id": "ChIJT3g1X8c82jERaEEqrj6M6zg",
  "rating": 3.8,
  "reviews": [
    {
      "author_name": "Ashton Ng",
      "author_url": "https://www.google.com/maps/contrib/103547144826573515642/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLOi4gQsNw9rub8oZ9ir5YjAA2z1wXm_q5_Kv341R9MBYMgtA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "The drink stall has a serious manpower issue. Departure at T4 a couple of times these few months and the drink stall is always ONE MAN OPERATION.\n5/6AM ONE MAN OPERATION.\n3PM ONE MAN OPERATION.\n\nDo something about it, for your staff and people who patronise the food court.",
      "time": 1745912492,
      "translated": false
    },
    {
      "author_name": "Podcast Roi",
      "author_url": "https://www.google.com/maps/contrib/114143965399672736289/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVsEa-ywuOzB05fvZR7jfc2VcDcPNQFfararr1MXgoBulu4JLU=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Friendly and cute staff here. Affordable menu price setting, i spent 10SGD for a basic meal",
      "time": 1745904326,
      "translated": false
    },
    {
      "author_name": "Zi Xuan Lee",
      "author_url": "https://www.google.com/maps/contrib/108657541934577016131/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIsOc8wsTufIZTCmZ06jm-CMXaHbpA-2DJSbXdS1jF60994PQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "8 months ago",
      "text": "Enjoy the nostalgic taste of the past before you depart from Singapore!\n\nPeanut Butter Steamed Bread ($2.80 for 2 pcs)\nI love steamed bread so of course I opted for this! The peanut butter encased within was warm and flowy, bringing out its nutty flavour. The steamed bread slices were thick but they were soft and fluffy with the moisture retained even though it was not served in a steamer! I dipped the edges into the coffee and it soaked up the coffee like a sponge.\n\nSet A-Kaya Butter Toast ($5.90 with regular drink, $6.50 with large drink)\nThis was really worth it considering that it’s airport food (usually more pricey) plus it was cheaper than Yakun’s Set A! While Kaki Makan Cafe uses white bread instead of wholemeal bread, you get 6 square pieces of toast which is such a steal for the price!  The thick slab of melty butter oozes out as you take a bite. I love how crispy the toast was! And of course, you have to dip it in the runny soft boiled eggs like a true blue Singaporean!\n\nThey also have Lo Mai Gai ($3.90), Fan Choy ($3.90), Chicken Siew Mai (3 for $3.90), Chicken Char Siew Bun ($1.50) and Chicken Bun ($2.50) if you just want a light bite before your flight.\n\nFor a more filling meal, there’s also Crispy Fried Lemongrass Chicken Nasi Lemak, Rendang Chicken Nasi Lemak and Sambal Chicken Nasi Lemak at $8.90 ala carte or $11.90 with 2 pieces of fried vegetable spring rolls and your choice of barley, kopi or teh.\n\nKaki Makan aims to recreate the experience of a local coffee shop into a fresh and modern dining concept for the Muslim Community. Enjoy authentic local delights such as Minced Chicken Noodle, Laksa and their signature Crispy Lemongrass Chicken Nasi Lemak with an aromatic cup of freshly brewed Nanyang-style Kopi.\n\nPatrons can also have a quick snack of Steamed Bread/Toast with Butter and Homemade Kaya or steamed dim sum for the truly local experience. You can satisfy your cravings for local treats any time with this open 24/7!",
      "time": 1725088293,
      "translated": false
    },
    {
      "author_name": "ri fieschi",
      "author_url": "https://www.google.com/maps/contrib/100284284473919214210/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjViLCEM9kRw_XdOOLqP3xEWpS6i8KVeSTRXo7evkHOI3Dh9FaHEdA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "it was my first time trying the crispy lemongrass fried chicken nasi lemak and all i can say it was just nice, the portion everything was okay, the chicken could be bigger (preferably breast meat).\n\nthe price was quite expensive knowing its located in an airport so i cant say much to that.\n\ni would eat this when im really craving craving for it other wise i wont eat it for daily basis here. still satisfied with the portion and the taste. the rice is nice and fragrance they use basmati rice if im not wrong.\n\nother than that, thank you so much :)",
      "time": 1732240977,
      "translated": false
    },
    {
      "author_name": "Alan Lee",
      "author_url": "https://www.google.com/maps/contrib/105405097394101327178/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIiBdXUrtUjHb0PRrktfOUV1kMOp868pc3GY7HoQ5qVfbNB1_k=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "I was at T4 departure hall and I ordered 4 soft boiled eggs and a cup of coffee at the International Food Hall.\n\nThere was just 2 customers at that point in time including me. Instead of serving to both our orders, the staff was heavily engaged in conversations of their own private matters.\n\nWe were made to stand there to wait for our orders! I voiced out my concern and opinion on how the staff would have been more productive if they have served us our orders first instead of just standing rooted chit chatting away.\n\nHowever, to my great surprise and astonishment, the staff scolded me “you are crazy!” As the world’s number airport, this form of attitude is absolutely unacceptable!\n\nMy intention was simple: I ordered and paid for my food, please just give me my food.\n\nam not bothered or concerned what this staff does in the company but please NOT at my expense!",
      "time": 1709771390,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4101526086488834408",
  "user_ratings_total": 153,
  "vicinity": "10 Airport Boulevard CHANGI AIRPORT T4, Level 2M Departure Transit"
}