{
  "formatted_address": "5 Stadium Walk #02-22 Leisure Park Kallang, 5 Stadium Walk, #02-22, Singapore 397693",
  "geometry": {
    "location": {
      "lat": 1.3021918,
      "lng": 103.876502
    },
    "viewport": {
      "northeast": {
        "lat": 1.303461830291502,
        "lng": 103.8781085802915
      },
      "southwest": {
        "lat": 1.300763869708498,
        "lng": 103.8754106197085
      }
    }
  },
  "name": "Kallang Bowl",
  "place_id": "ChIJgQUi_k4Y2jER3vzP9vXZBQE",
  "rating": 3.5,
  "reviews": [
    {
      "author_name": "Nata",
      "author_url": "https://www.google.com/maps/contrib/109596200105012628101/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX_aG5iLcO0CyUheJ6FboBFROHp6Cp1hgeUS5bww7ZuKWzCBwx0=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "This place is absolutely breathtaking - it's exceeded my expectations in every way! The stadium is a genius concept, offering a vibrant hub of activity that's sure to thrill and delight. Whether you're a sports enthusiast, an art aficionado, a dance devotee, a music lover, or a martial arts master, you'll find your passion here. With an incredible array of hobbies and interests on offer, you'll be spoiled for choice - so come and indulge in the ultimate experience that will leave you inspired, energized, and eager for more!",
      "time": 1738760692,
      "translated": false
    },
    {
      "author_name": "Ku Juin Herng",
      "author_url": "https://www.google.com/maps/contrib/102911808037232006123/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX1xc8XH9J6OoPmBnamNBlXlYD1qzyWaRZyiRRtuI61WzLaiejApg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "One of the worst customer service experience I had at a bowling alley.\n\nWe encountered a mechanical issue with our lane. The bowling ball became lodged in the gutter midway down the lane during my friend's turn. He attempted to dislodge it with another ball, which also became stuck. Shortly after, the lane screen displayed a message indicating a technical problem and that a technician had been notified. However, no staff member arrived to assist us.\n\nI approached the counter to request assistance. A female employee with shoulder-length hair, wearing a black sweater, was present and occupied with her phone. It took several attempts to gain her attention. When I explained the situation, she angrily accused us of causing the malfunction. I explained that I was not the person bowling when the issue occurred. She insisted that the person responsible come to the counter. Upon my return to my group, the employee used the public address system to demand that the person who \"jammed the machine\" report to the counter to provide an explanation. My friend complied, and she proceeded to reprimand him, stating that he would be liable for any damages if the machine was irreparable. She also demanded his name and contact details.\n\nThe issue was eventually resolved when the lane was reset, and the stuck balls were cleared. However, the employee further addressed us via the PA system, warning us to report any problems to her directly and to refrain from attempting to resolve them ourselves.\n\nI believe this situation was handled poorly. We felt publicly humiliated by the employee's use of the PA system to address us, particularly her accusatory tone. Her demeanour was unprofessional and unnecessarily confrontational. A more appropriate response would have been to acknowledge the issue, reassure us that a staff member would assist us shortly, and address us in a calm and respectful manner. This was not the only instance of poor customer service we experienced with this employee. Earlier, when a friend inquired about the location of the restroom, she responded curtly and rolled her eyes.\n\nI wrote in to feedback but have yet to receive a response.",
      "time": 1746959446,
      "translated": false
    },
    {
      "author_name": "--",
      "author_url": "https://www.google.com/maps/contrib/100303118927286983558/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXlE3LfpUGHZG9tB6BuYvDEIdntMuhJQWsMv2SSvEX6LIhmRTCM=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "bald headed guy is a horrible manager. simple questions just have to be answered sarcastically because he needs that levelled authority. please i advise you against coming here",
      "time": 1743265318,
      "translated": false
    },
    {
      "author_name": "Novie 89",
      "author_url": "https://www.google.com/maps/contrib/115638071833201485827/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVVmhvvW_Ht1zICXBiAy-6aanlTeospWBW3Ehu4MKxbqSacVT59=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Having a great time each time visit here , ticket are reasonable and no waiting unless there is event .",
      "time": 1738508123,
      "translated": false
    },
    {
      "author_name": "teresa ong",
      "author_url": "https://www.google.com/maps/contrib/117604246637117140115/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJI-Xl_AXqozCe5TEXsdtGxpN71uyqnuVjw7TeUofD69YfZOQ=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "a week ago",
      "text": "The kids had fun, hence the Stars.\nStandard of hygiene is bad. They do not sanitise the shoes after each wear. I asked the girl if they sanitise the shoes, and she said no, only at the end of the day, which is fine, if they remove the shoes and only leave the clean ones, but when the customer returns the shoes, the same shoes are left there because she was busy playing with her phone to do anything. When asked for help, she simply said, just look at the chart yourself and get your own shoes. Was in complete shock with that response. Then the boy came and served. The boy was at the counter and walking over to help. The girl was completely useless.\n\nIf I ever have to take my kids bowling again, even if it’s convenient, I’d rather travel elsewhere.",
      "time": 1746867004,
      "translated": false
    }
  ],
  "types": [
    "bowling_alley",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=73704619352521950",
  "user_ratings_total": 873,
  "vicinity": "5 Stadium Walk #02-22 Leisure Park Kallang, 5 Stadium Walk, #02-22"
}