{
  "formatted_address": "Block 159 Ang Mo Kio Ave 5, Singapore 560159",
  "geometry": {
    "location": {
      "lat": 1.3743283,
      "lng": 103.8402746
    },
    "viewport": {
      "northeast": {
        "lat": 1.375701080291502,
        "lng": 103.8416204302915
      },
      "southwest": {
        "lat": 1.373003119708498,
        "lng": 103.8389224697085
      }
    }
  },
  "name": "Kebun Baru Birdsinging Club",
  "place_id": "ChIJp_EOScIW2jEROzizxCwnfQk",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Bandu Gunaratne",
      "author_url": "https://www.google.com/maps/contrib/103755840820162090559/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVdI5uRQ-0yFmW25MbXhFWfBAUX2cZ_vOPM7JjEnaPTWKB9CIc-=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "Mostly elders are the members of Kebun Baru Birdsinging Club. They have their caged birds who are chirping / singing which is a different kind of experience for the visitor. This is a passion of this community. Visitors are not allowed to touch the cages, feed the birds or rather get very close to the birds! You can take pictures with no problem.",
      "time": 1731295588,
      "translated": false
    },
    {
      "author_name": "Jason Ong",
      "author_url": "https://www.google.com/maps/contrib/101337983538091125134/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUuvdAAobkF4tTYtslbz6_7cavwHPNMhKp4lEMSQbkhyNtSQc0=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "2 years ago",
      "text": "A fascinating experience to see so many birds and cages all at once. There are different sections for different types of birds. My favourite is the section where they hang the cages up on long poles in the open air area. They look like beautiful lanterns from afar!\nGreat place for bird lovers to come together, share stories and experiences, and enjoy the bird songs.",
      "time": 1654400801,
      "translated": false
    },
    {
      "author_name": "Bon Appetite",
      "author_url": "https://www.google.com/maps/contrib/107713838668689007937/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWr4Q4EUbd8t2XBniJ1-UrgkYegdnXHbITJ0F5h6GoXt2mMp-gt=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "The Birdsinging Club is a unique place with the serendipitous bird sounds welcoming you. I spotted 417 poles but being Monday saw about 50 or so poles with bird cages hoisted. This is a place not many locals also know about. I am not commenting on the merits or demerits of caged birds being hoisted on poles as this is someone’s livelihood.",
      "time": 1670313693,
      "translated": false
    },
    {
      "author_name": "Fa Dwan",
      "author_url": "https://www.google.com/maps/contrib/113152517431126757526/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV7332jFHSspIL5aR47jALN6ouw3y1Nr14jKbPdp67VV3GQTBPa=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "Amazing place.  Come little spice shop in Singapore and find this wonderful birds singing place.  Either hanging high up or lower hearing singing.  Wonderful here.  One can spend the whole morning drinking coffee and hearing bird sing.",
      "time": 1571969585,
      "translated": false
    },
    {
      "author_name": "Alex Koi",
      "author_url": "https://www.google.com/maps/contrib/108540681155228529153/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUnr679eOKh4VgGDqiXFcaVD47m_TevMUhanb25d1ue1NzMa-U=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "KEBUN BARU BIRDSINGING CLUB – SINGAPORE\nThe club is solely donation-based and run by volunteers. A quick survey shows that most of my Singapore relatives have never heard of this place.\nKebun Baru Bird Singing Club, the only one in Singapore, is a voice-training camp for the winged. Nestled in the neighborhood of Ang Mo Kio, it is a stone’s throw from the bustling city center and a far cry from the conspicuous consumerism that has become metonymic of Singapore. The Club officially opened in 2008 but bird lovers have been congregating here for many decades.\nIt began as an informal bird singing corner, when a few bird owners came together, pooled their resources and built makeshift structures to hang their birds from. While there are a few other bird corners in Singapore, usually in and around public housing estates, the Kebun Baru Bird Singing Club is by far the biggest space dedicated to bird singing and the only one recognized by Singapore’s Registrar of Societies thus far.\nMost bird keepers may recalled the 1950s as the heyday for birdkeeping in Singapore, although the practice existed in the region for centuries. Subsequent urban redevelopment has displaced many bird singing corners, which are now, sadly, rare sights in Singapore’s hyper-modern cityscape.\nAfter driving past some regular HBD apartments, you come across a playground and then a field. This long patch of grass is filled with hundreds of poles with ropes attached. Sort of like a flag pole. Perched on the top are yellow, purple, blue and green colored birdcages.Kebun Baru is about the size of two soccer fields, and it has the most bird species (5 in total, with each allocated a set area, since you asked), and a membership of over 3,000 humans.Songbirds aren’t the most gigantic creatures – unlike some dogs that can stretch to be as tall as a human. Even the largest songbird can’t be much bigger than your closed fist. So how much can one of these little creatures really cost?A whopping $108,000, that’s what.\nYes see it right, that is the price of a HDB bedroom or maybe two! From online and offline gossip I realized that the majority of songbirds at Kebun Baru also fetch a 3 to 4 digit price.\nThese birds have been specially bred and trained by breeders to be powerful singers, and many are imported from overseas, hence the hefty price tags.\nBut of course, if you are keen on getting a bird, but less keen on giving up the new 5G phone you’ve been eyeing, you can get these beauties for as little as $90 at a bird shop. These birds are not specially bred, but then again, genetics are random, so who knows. You might just get a jackpot champion songbird for cheap!\nAnd that’s one of the most special things about Kebun Baru Birdsinging Club. Even with all their progress over the years, not a single cent has been charged in membership fees. All of their funding comes from donations, and folks like Robin keep the place running on a voluntary basis.\nAddress: Ang Mo Kio Avenue, 5, 560156. I suggest taking a taxi here as it’s a bit of a walk to the closest MRT stations of Ang Mo Kio or Yio Chu Kang.",
      "time": 1584253084,
      "translated": false
    }
  ],
  "types": [
    "tourist_attraction",
    "park",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=683745791662307387",
  "user_ratings_total": 154,
  "vicinity": "Block 159 Ang Mo Kio Avenue 5"
}