{
  "formatted_address": "60 Faber Terrace, Faber Hills, Singapore 129040",
  "geometry": {
    "location": {
      "lat": 1.3215824,
      "lng": 103.7572027
    },
    "viewport": {
      "northeast": {
        "lat": 1.322934730291502,
        "lng": 103.7587201302915
      },
      "southwest": {
        "lat": 1.320236769708498,
        "lng": 103.7560221697085
      }
    }
  },
  "name": "Kensington Preschool",
  "place_id": "ChIJ12Jl-zMb2jERvaz_-XnfC7U",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Divya Ginna",
      "author_url": "https://www.google.com/maps/contrib/100843979508852675579/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXtNGryXqCBTnhKz_Vt9ABa2p7vspeY1L2L0FCgbOhL2gGD_z5K=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "My son started at OCHM since June 2024 and I’m really happy with his progress in development. He seems to be really enjoying himself and when I ask if he likes his teachers he always says yes! :)\n\nI also like that the school organises many events for the children and also for parents to participate in together with them if they would like to.\n\nTheir curriculum also seems well thought out and I find that my son does more independent and imaginary play at home too.\n\nThank you to the caring and observant teachers for taking such good care of him. Would definitely recommend parents to check out OCHM!",
      "time": 1728452000,
      "translated": false
    },
    {
      "author_name": "Alyssa He",
      "author_url": "https://www.google.com/maps/contrib/101288569969790455851/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIZKHHvd_2fZVc6iftDW5DFx8kiMM5Bi8r6y0tBEeS3XGfV-A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "We've had a good experience sending our child to the preschool in the past few months, observing -\n- Caring and responsible teachers who show a genuine heart for the children, are warm and approachable, and are able to handle different personalities well. This was very important to us, as the teachers attitudes and behaviours have direct impact on a child's engagement and responsiveness to their teaching. The teachers also went out of their way to help my child feel comfortable when she was unwell. We are comforted that she is receiving good care.\n- Regular updates via app with photos of activities, syllabus, and informal chats during daily pickup / drop off. This keeps us informed of how our child is progressing and adapting.\n- Structured learning program coupled with montessori pedagogy encouraging independence, which sets the children up well in their growth and development.\n- Peaceful and private premise located in a standalone house providing safe, calm, and conducive environment.\n- Celebration of special occasions (eg mooncake festival, children's day, etc) as well as special activities (eg soccer days, outing days, excursions) to enrich the overall learning experience.",
      "time": 1728866538,
      "translated": false
    },
    {
      "author_name": "Nithya Murthy",
      "author_url": "https://www.google.com/maps/contrib/100756945363221551279/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLBGmARRx_HQvm2J4CTDzkqSPUWosaePsXXitn5RGYaG-tgOg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Our Children's House Montessori is a great school which follows the Montessori curriculum. My child is having a wonderful time here. The environment is clean and welcoming and it encourages exploration. She enjoys sharing her experiences with us and she has become more vocal after joining the school. The teachers are very patient and caring and my child talks about some of the teachers very fondly. Another good thing about the school is the curriculum. The hands on learning is something my daughter enjoys and I am gradually seeing some of the independence that you hear about in the Montessori system.  I am so glad we chose this school for her. Do look up this school if you want your child to be independent and engaged in his/her learning while still having fun.",
      "time": 1660311053,
      "translated": false
    },
    {
      "author_name": "Angel Yen-Chia Lee",
      "author_url": "https://www.google.com/maps/contrib/108511235537055916876/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVn-mW32Fs4gTEnRPizd0nhT3Vp2n7WeJIZ-iowMwYwklujSucB=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "It’s a great Montessori kindergarten! We can feel that all of the teachers shared lots of their love to the kids, my daughter really enjoyed the time here!",
      "time": 1697614008,
      "translated": false
    },
    {
      "author_name": "Yilun Lee (Mark)",
      "author_url": "https://www.google.com/maps/contrib/117034033105065022738/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXjy37cNm1JT_bQgiTvaPDpkFb5wpDOpFV39-HTFZSYiylkbdj0=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Our family is grateful that we chose OCHM as my daughter's first preschool, when we moved to Singapore. She was nervous and afraid when she first stepped into OCHM, but when we picked her up, she smiled and told us how much fun she had. She learned so much from her teachers, and they helped her adapt to a new country with a variety of cultures and languages. We are truly appreciate the love and kindness from teachers. Also, the lovely classmates and environment make everything enjoyable and inspiring.",
      "time": 1697679589,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13045766460587093181",
  "user_ratings_total": 20,
  "vicinity": "60 Faber Terrace, Faber Hills"
}