{
  "formatted_address": "151 Chin Swee Rd, Level 13, Singapore 169876",
  "geometry": {
    "location": {
      "lat": 1.2873301,
      "lng": 103.8406561
    },
    "viewport": {
      "northeast": {
        "lat": 1.288652080291502,
        "lng": 103.8419249802915
      },
      "southwest": {
        "lat": 1.285954119708498,
        "lng": 103.8392270197085
      }
    }
  },
  "name": "Kenso Leasing Pte Ltd",
  "place_id": "ChIJ13nXs3UZ2jERwdma9lD7rVk",
  "rating": 1.3,
  "reviews": [
    {
      "author_name": "Mirah Halim",
      "author_url": "https://www.google.com/maps/contrib/105918434262844758186/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJO32eoZkjvJqJp7LHBzv_o8i2XnQEHo8bRk3sWYTUwSOYmew=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "Bad service. Don't even care what happen to u as long they can get the money.",
      "time": 1739173354,
      "translated": false
    },
    {
      "author_name": "Vivian Yeo",
      "author_url": "https://www.google.com/maps/contrib/102492585290902204833/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXHeZaDQmOKsrdxfDRgJKmyDSq71ty_HtlthkC2D4uxBfIX4QQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "12 months ago",
      "text": "Inhumane treatment from staff of this leasing company. My brother took a car loan from this leasing company and I called to enquire on the procedures and asked for waiver of interest. The credit control, Jin Chunyan said that she met many of such cases and will not consider any. She simply said very crudely \"all person died and asked for sympathy grounds consideration, how will we make a business\". She didnt even said any kind words of sympathy or condolences yet was so forceful for a decision to have the car surrender to them and sent a list of charges like car storage and advertisement cost etc. I had pleaded to convey my appeal to her management yet she rejected and to end the call she just said the charges will be whatsapp to you. I replied \"you didnt even bother to say thanks or sorry or bye. anyway, thank you.\"",
      "time": 1716264004,
      "translated": false
    },
    {
      "author_name": "Cheryl Lim",
      "author_url": "https://www.google.com/maps/contrib/112682186381401556014/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIshpVQofuSxfB9Mbfyv-ZfwG51avJGZmv-LIdHOg7iVZWWlw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "I borrow car loan from them but i cannot pay. But the staff tell me it is okay just go DRS. Then i told them if i go DRS, will they go after my guarantor? You know what the manager told me? He say \"Its ok, ask your guarantor go apply DRS also, like that, our company will not be able to do anything to you already.\"\nAnd i follow their instructions and really power, they really suck thumb and cannot do anything.\nBUT MOST IMPORTANTLY, the manager say, \"MAKE SURE YOU DON'T SAY ANYTHING about your plan to apply DRS when you apply car loan with us, if not we will not approve. Just wait until loan approveD and got the car already, then go and apply DRS.\"\nWow, really a BIG THANK YOU for the advice Kenso!\nI highly recommend to get car loan from Kenso, if cannot pay back, just go apply DRS. Huat ah!",
      "time": 1672135851,
      "translated": false
    },
    {
      "author_name": "Adeline Gan",
      "author_url": "https://www.google.com/maps/contrib/112768334311925477297/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVp9Kqpcx8IPSRDaCz6aQNGBvuSNkENW-SadU8hGE5ajuO_WIv_8Q=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "Kenso is one of the worst car leasing company I have ever met.  Firstly their interest is way much higher and during covid period when self employed business was affect they don't have have leniency to work things around the instalment plan. Secondly when I inform I was under drs scheme but can afford to pay for the car instalment and the payment date for the car has not even reached but they just tow the car on a Sunday and we couldn't call anyone to talk to and they did not inform at all. After selling the car still keep asking to pay the remaining amount which I feel one of the ridiculous idea when already inform car instalment will be paid.  If I could give 0 stars I would give",
      "time": 1659347890,
      "translated": false
    },
    {
      "author_name": "Wan Nooraini",
      "author_url": "https://www.google.com/maps/contrib/103079219209370758955/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX7Iu5UwqZgc0AkI_l8FrlTNh9mi9_wVS5JBKi9PzRxaRg_qiN6=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 years ago",
      "text": "If there is an option to put 0 stars, I would have done so. Not even worth 1 star. Bought my Honda Stream years ago. Have never defaulted on any payments although occassional late payments are made (due to my payday not fixed), but usually before the next due date. They always threatened with repo and claimed that they won't know when the repo will take effect as its all \"system generated\".\nLate payment will incur u a late fee of $100 and on top of that a late interest rate of $0.43 per day. Plus a repo letter that cost $20.\nMore like an Ah Long who runs the company.",
      "time": 1610335458,
      "translated": false
    }
  ],
  "types": [
    "bank",
    "finance",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6462097365499828673",
  "user_ratings_total": 23,
  "vicinity": "151 Chin Swee Road, Level 13, Singapore"
}