{
  "formatted_address": "4002 Ang Mo Kio Industrial Park 1, #01-16, Singapore 569623",
  "geometry": {
    "location": {
      "lat": 1.3618286,
      "lng": 103.8566358
    },
    "viewport": {
      "northeast": {
        "lat": 1.363209730291502,
        "lng": 103.8581246802915
      },
      "southwest": {
        "lat": 1.360511769708498,
        "lng": 103.8554267197085
      }
    }
  },
  "name": "Kia Meng Trading - Re-upholstery Specialists Since 1986",
  "place_id": "ChIJI8EE1AIX2jER352CxDmcW2w",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Wendy Lee-Ang",
      "author_url": "https://www.google.com/maps/contrib/111867950119960381037/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLDQ06Uwcc9NZ7I7MWq9hkpbCjzsb0Gj3CXaj0U4NZSc51XFQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Kia Meng did an outstanding job reupholstering our sofa! He offered a wide range of high-quality fabrics, gave expert advice, and was patient and attentive throughout the process. His craftsmanship is meticulous—he truly works with his heart! The quotation was fair, and the final result was beyond expectations. Our sofa looks brand new!\nHighly recommended for anyone seeking professional, detail-oriented, and heartfelt upholstery service. Will definitely return for future projects. Thank you, Kia Meng!",
      "time": 1743485617,
      "translated": false
    },
    {
      "author_name": "Seok Ng",
      "author_url": "https://www.google.com/maps/contrib/102962233514479388660/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK_lBKC-xD1UA3DPG4MU70l-RRJiT8GG8DbVYDYinFBSR5xfQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "I have a set of Rosewood sofa and chairs that has been with us for 30 plus years. Recently, I was looking for an upholstery company to modernize the look. I went on the Internet and found Jia Meng Trading. The owner of Kia Meng is a young entrepreneur, JJ. I found JJ professional and very knowledgeable in this trade. He was featured on Media Corp about giving old furniture a new life. This is what I was looking for. Many people throw away Rosewood furniture because they are tired of the look as this type of furniture is very durable, and it lasts for years longer than the original fashion trend that existed when it was first built.\nI strongly suggest Rosewood furniture owners seriously consider giving their furniture a new look by making modern cushions to go with the original woodwork. It can create a one chair with two looks concept depending on your décor.\nJJ helped me to design cushion sets for my Rosewood furniture and it instantly modernized the sofa. I am very happy with his work and highly recommend Rosewood furniture owners seek his help to change the look of your sofas and chairs rather than throw away the woodwork to the landfill!",
      "time": 1723306669,
      "translated": false
    },
    {
      "author_name": "Cindy Loo",
      "author_url": "https://www.google.com/maps/contrib/108947011393885381469/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLDo3_aFra9W0YjJBSte_4TGkkSy1cniGZCJAwUlcF4Y9-dWA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "We sent our sofa for reupholstery at Kia Meng Trading. Within 2 weeks, it was returned with a brand new look. We were truly impressed by their prompt service and excellent workmanship. Thanks to JJ and his team.",
      "time": 1734539234,
      "translated": false
    },
    {
      "author_name": "Ng May",
      "author_url": "https://www.google.com/maps/contrib/100152545989140779785/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKusepb0rxYGlfSf8AyA21X4OawiNchbKez3hLDzUBrKMqcow=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "very satisfied experience with Kia Meng. jj has made the whole process and experience pleasant. custom made a full leather cover for my 2.5 seater sofa. did not expect it turned out so beautiful. the turnaround time was faster than I expected. less than 2 weeks. workmanship is really good and color of the leather just right for my house. great service and if I need a second sofa or chair new look will definitely go back to Kia Meng. 5 star!",
      "time": 1665582879,
      "translated": false
    },
    {
      "author_name": "Natasha Peacock",
      "author_url": "https://www.google.com/maps/contrib/105598704463544314019/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWbARcGygjFqXq3WJWQLkDZ-Cq81IzD88aQyUi5UuBNx9CRJlg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I’ve worked w JJ at Kia Meng Trading twice. First time two years ago when he helped fix my outdoor furniture- he went out of his way to even buy new machinery to deliver on what he had committed to as the job was quite complicated in the end requiring metal work. This time I had two 50-s chairs reupholstered- one in fabric and the other in leather. Similar experience with the service- KJ is fast, transparent, really helpful and I’m again very happy with the result.",
      "time": 1689690509,
      "translated": false
    }
  ],
  "types": [
    "furniture_store",
    "home_goods_store",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7808006150900850143",
  "user_ratings_total": 70,
  "vicinity": "4002 Ang Mo Kio Industrial Park 1, #01-16"
}