{
  "formatted_address": "820 Thomson Road Medical Centre A #02-02 Mount Alvernia Hospital, Singapore 574623",
  "geometry": {
    "location": {
      "lat": 1.3419083,
      "lng": 103.8379548
    },
    "viewport": {
      "northeast": {
        "lat": 1.343229930291502,
        "lng": 103.8393064302915
      },
      "southwest": {
        "lat": 1.340531969708498,
        "lng": 103.8366084697085
      }
    }
  },
  "name": "Kids Clinic @ Mt Alvernia by SMG",
  "place_id": "ChIJ0yUHzEYX2jERsD1u-8HKfdU",
  "rating": 3.1,
  "reviews": [
    {
      "author_name": "Lisei Wang",
      "author_url": "https://www.google.com/maps/contrib/111070945592334872359/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI3nyCM37txZqDy_dul6kSr4weBi4LweHQ0BrdaV4x2TEBYGWjh=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Dr.Simon found our daughter's condition on the first day of her birth, and thanks to that, she could get treated and recovered well.\nI feel very glad that he was assigned to our baby.",
      "time": 1730082166,
      "translated": false
    },
    {
      "author_name": "Nigra White",
      "author_url": "https://www.google.com/maps/contrib/115728136835904105683/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJZYxZbMeVcX8x817uOcTXRrFC3GDMPiyIZqR9Ka584u5ol9w=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "7 months ago",
      "text": "If anyone is considering Dr Simon Ng, stop.\nIf he is assigned to be your baby's PD, sound out to your gynae or delivery hospital for a swap.\n\nWe cannot, in good conscience, not write this review. This is a major milestone especially for us new parents and things are already stressful/tiring enough.\nThis is our heartfelt advice: change to another PD at all costs. We cannot comment about his nurses' attitude, but even that is acceptable since they aren't that important. We are paying primarily for the PD's knowledge and professionalism.\n\nDr Simon Ng will most probably be assigned to most parents as their child's PD since we are guessing many knew about his attitude and based on word of mouth, chose not to use him. Obviously the bad apples will be automatically assigned. This is where you have to be cautious.\n\nThroughout his ward visits, he does not care about his patient and treats it as though it's just another day at work. He will just go with his script and if you have any questions, he will just give a single sentence response in a nonchalant manner since it isn't in his script. Based on his age, seems likely he has been doing this and bumming around for at least a few years now.\n\nI wanted to blast him then and there on the answers he gave us and how his attitude was like, but since he was already assigned to us, we had no choice but to go with it.\n\nTake Dr Simon Ng as your child's PD at your own risk.",
      "time": 1727154655,
      "translated": false
    },
    {
      "author_name": "Bella SLT",
      "author_url": "https://www.google.com/maps/contrib/100782924442018719886/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKtFEEFxvclCOkE7bTOpSBz1iHjxBFMNu-vK5k_46STnL_oQw=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "10 months ago",
      "text": "My child was admitted in March due to mycoplasma, under Dr Simon’s care. He was caring throughout the entire duration of hospitalization hence we went back to him in June again when my child was feeling unwell.\n\nExplained to him that my child was having green mucus and cough which was unusual, Dr Simon diagnosed her as Sinus and prescribed another course of antibiotics with some medicines for allergy. My child’s condition did not get better unfortunately and seemingly slightly worsened, so we went back to him, again, and I shared my thought with him that there might be possibility it is mycoplasma again as there are researches mentioning the patient may get infected again. He was doubtful and pretty sure it is still allergy and Sinus, despite we told him none of parents have any medical history, there’s no furry flurry soft toys and plushies at home, we changed bedsheet every week and pillow case every alternate day and wash them with 95 degree of water.\n\nThe last draw that got me was when Dr Simon said this to me “if you think it’s mycoplasma, we can start another course of Klacid again”. How would and how can a doctor say such thing to a layman? Mycoplasma can only be detected by blood test but we did not order any?\n\nFast forward to today, when we visited another PD (after my child has been sick with fever and flu symptoms that were previously diagnosed by Dr Simon as Sinus), blood tests were order and TRUE ENOUGH, it is mycoplasma, AGAIN!\n\nWhile I am thankful to Dr Simon for his quick diagnosis in March, I can’t help to feel extremely disappointed with what he said to me.\n\nLeaving 2 stars in my review for my appreciation for Dr Simon’s professionalism back in March, otherwise I’d have just leave 1 star.",
      "time": 1719930212,
      "translated": false
    },
    {
      "author_name": "Jade Cabrera",
      "author_url": "https://www.google.com/maps/contrib/101743003170560530077/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJgy5s-fQ9lvhSMocujFDLKqdxnsyje_K_Mt9HgsqOGC01Si7zr=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "He has been my daughter's dr since my daughter was born in Mt Alvernia. He is our number 1 go to whenever my daughter has fever, regular check-ups. 🤍",
      "time": 1739319216,
      "translated": false
    },
    {
      "author_name": "Aaron Sng",
      "author_url": "https://www.google.com/maps/contrib/106713592240815393318/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXL_lBfOFUmUUNluhoJoRzlRdaKJCJPkFle2-rgJdGn60y8xkM=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "My child was assigned Dr Simon Ng when his condition was deemed serious enough to be warded by Mount Alvernia’s urgent care clinic. Dr Ng initially said the hospitalisation would likely be 3-5days, then it became likely 6days and then eventually he said it was unlikely he could be discharged on the 6th day. Dr ng did not communicate his treatment plan clearly from the beginning and he spoke minimally each time he visited the ward. We were just supposed to blindly trust that dr ng was doing the right thing while my son did not get better. Eventually with no clear indication of how or when my son can recover, we decided to forcibly discharge him and transfer him to KKH. The treatment there was so much better. Their scans showed that my son’s condition worsened while under dr ng’s care. The worst part is not only did he not successfully treat my child, he charged us $200+ for each time he visited the ward and spoke for a few minutes. If you want a dr who communicates and properly treats your child do NOT come to this dr.",
      "time": 1709271187,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15383674836663287216",
  "user_ratings_total": 37,
  "vicinity": "820 Thomson Road Medical Centre A #02-02 Mount Alvernia Hospital"
}