{
  "formatted_address": "226a Upper Thomson Rd, Singapore 574358",
  "geometry": {
    "location": {
      "lat": 1.35302,
      "lng": 103.8352509
    },
    "viewport": {
      "northeast": {
        "lat": 1.354309780291502,
        "lng": 103.8365438302915
      },
      "southwest": {
        "lat": 1.351611819708498,
        "lng": 103.8338458697085
      }
    }
  },
  "name": "Kids Taekwondo",
  "place_id": "ChIJc-RDRToX2jER9Is_bAgCNVk",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Tavia Quak",
      "author_url": "https://www.google.com/maps/contrib/118181045716363097047/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIb3FSa2ti-w6VoHqaY6_ZC0OQ6nx5LTAtdxrbsYbBWGJPOcg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My 8yo son has been with Kids Taekwondo for 3 years now and he thoroughly enjoys himself during every lesson. Not only does he love his mates, Master Lee is also a very patient  personal Taekwondo instructor. He teaches disciple to his students in a friendly way and everyone enjoys interacting with him.\n\nLocation wise, the centre is smack in the middle of great food joints. It is also pretty convenient for parents to park around the area. Parents can go for coffee nearby or have a meal while waiting for the kids. Highly recommended.\n\nMaster Lee also organises activities such as Korea Day where students and families are invited over for homemade Korean treats and a movie screening during school holidays.\n\nClass fees are reasonable/affordable and grading sessions are professional and well prepped. Students are handed cute point vouchers after each class to accumulate in exchange for Taekwondo gears.\n\nHighly recommended!!!",
      "time": 1714109086,
      "translated": false
    },
    {
      "author_name": "Cecil Oh",
      "author_url": "https://www.google.com/maps/contrib/117295209598952307334/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWU5W889Ub9GOJLFOp-trTFyYaRnznfJ0EwznEnn0-zyXLvuQA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I highly recommend the kids' Taekwondo class by Master Lee. My child has been attending for several years now and we couldn't be happier with the experience. Master Lee is patient, knowledgeable, and truly care about the progress and well-being of each child. He create a positive and supportive environment that encourages children to learn and grow at their own pace. The classes are well-structured, combining fun activities with valuable lessons in discipline, respect, and self-confidence. My child has not only improved their physical fitness and coordination but also gained valuable life skills that will benefit them in all aspects of life.",
      "time": 1703990453,
      "translated": false
    },
    {
      "author_name": "Tan CHONG HWEE",
      "author_url": "https://www.google.com/maps/contrib/105150687680222092041/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJZB1mN_9uoMqh17SiSuIuqnAgqwvIgelhZjr1tJ-ZVB9Z_og=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I can't speak highly enough about Kids Taekwondo School. My children have been attending classes for several years, and the positive impact is evident both on and off the mat.\n\nThe instructors - Master Lee is exceptional. He combine expertise in Taekwondo with a genuine passion for teaching kids. The classes are well-structured, striking a perfect balance between learning and fun. My child looks forward to each session, and I've witnessed significant improvements in their focus, discipline, and physical fitness.\n\nWhat sets Kids Taekwondo School apart is the personalized attention each child receives. The instructor know every student by name and tailor their guidance to individual needs, fostering a supportive environment that boosts confidence.\n\nThe facilities are excellent, providing a safe and clean space for kids to learn and practice. The communication with parents is transparent, keeping us informed about our child's progress.\n\nOverall, Kids Taekwondo School is a fantastic choice for parents looking to introduce their children to martial arts. It's more than a school; it's a place where kids gain valuable life skills while having a blast. I highly recommend Kids Taekwondo School for its positive impact on children's physical and personal development.",
      "time": 1702525936,
      "translated": false
    },
    {
      "author_name": "Pore_XX",
      "author_url": "https://www.google.com/maps/contrib/105876226542535686937/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW8rYyK7snIIZKFnfq74OLkRWILAqwzc8djHI8YOedUwsQV0TEbdg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Kid Taekwondo is such a positive force in my kid’s life.  Master Lee is very good with the kids, the gym is clean, the workouts are fun, and they are learning self defense.  I would highly recommend kid taekwondo to anyone!!",
      "time": 1702691521,
      "translated": false
    },
    {
      "author_name": "Elizabeth Tay",
      "author_url": "https://www.google.com/maps/contrib/101499612617043893705/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKTtwasOebh9uC_VSXqOQokEBeVpT9dzUL4L81WxXJy8AdClA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Master Lee is passionate and inspiring. His genuine care and dedicated attention to the child's needs have brought out the best in both my sons (one with Cerebral Palsy and autism. another with ADHD and dyspraxia). His ability to connect and relate to the special needs children is remarkable and amazing. Taekwondo under Master Lee has truly embodies both the mind, body and spirit. A true gem of a taekwondo master.",
      "time": 1702537915,
      "translated": false
    }
  ],
  "types": [
    "school",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6428046278340348916",
  "user_ratings_total": 12,
  "vicinity": "226a Upper Thomson Road"
}