{
  "formatted_address": "681 Punggol Dr., #03-11 Oasis Terraces, Singapore 820681",
  "geometry": {
    "location": {
      "lat": 1.4031154,
      "lng": 103.9132209
    },
    "viewport": {
      "northeast": {
        "lat": 1.404077130291502,
        "lng": 103.9144625802915
      },
      "southwest": {
        "lat": 1.401379169708498,
        "lng": 103.9117646197085
      }
    }
  },
  "name": "Kids Clinic @ Punggol by SMG",
  "place_id": "ChIJgSrmysU92jERXuCVnAq1RE4",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Eyrah Zafirah",
      "author_url": "https://www.google.com/maps/contrib/117102905683451353700/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVr9-apfp7sFat4BDFfecMHWbr1pkM4lRthle0NCLW3oO6uq-t0=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "My son had a high fever for 4 days, wheezing with no appetite. Fever didn't subside even after taking him to the clinic nearby my house thus we decided to bring my boy to dr dave clinic instead for alternative medical care after hearing so many good reviews.\n\nWe reached the clinic at abt 10am and there were many in queue. Crowded with sick babies around us. We waited abt 2 hours, while waiting we needed some help as my son’s fever was still high. Informed the nurses to assists son as his body is getting hotter. With quick response, one of the nurses help us by providing meds to my son to lower down his fever. At 12 ish we were seen by dr Dave and he was diagnosed with Bronchitis and HFMD yet again😭\n\nDid nebuliser in the clinic and nebuliser needed to be done at home for another 5 days. Good to learned at day 4, there are no more wheezing and his fever has subsided.\n\nAfter a recurrent fever and wheezing episode, we are grateful that we have found a reliable clinic/doctor at punggol area. We consulted Dr Dave for his professional advice and seeking directions towards our son’s recurring medical problem. His explanations and treatment plan were very clear which not many doctor will go the extra mile with such clarity to the patients. His staff were friendly and made us feel welcomed.\n\nThe price is at a higher range nonetheless my kids health is my top priority and i wouldn’t mind paying with such good service at kids clinic.  I highly recommend kids with respiratory issue to see Dr Dave.",
      "time": 1738146343,
      "translated": false
    },
    {
      "author_name": "Jerome and Angie Lai Yew",
      "author_url": "https://www.google.com/maps/contrib/103901870463452265661/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKf8vx2_CQSipIx6ygzFlsCv8dlWdIZDuMMPhUD2Z_hIWh_fQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Chanced upon this clinic and have stuck to it ever since. Dr Dave and his team of nurses are incredible. Prompt replies in appointment setting or concerns that you email in, it's all answered. On all the times I've brought my little one here, his diagnosis has always been accurate resulting in prompt treatment especially the time my little one had RSV. So grateful to know there is such a good PD around and a team of nurses that support him well❤️ Will be having baby 2 soon and definitely the only PD I'll going to would be Dr Dave. Thank you!",
      "time": 1738843885,
      "translated": false
    },
    {
      "author_name": "vovonivi leo",
      "author_url": "https://www.google.com/maps/contrib/114125799191284638238/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKNRql-e13G1IJ2f6DYp5PJs33Mv3IPMW5a6a_iBwcbCHnJ6g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Relatively short waiting time. Very efficient receptionist team. Dr Dave is very experienced, his diagnosis is always accurate, the medication is always effective. A relieve to know my kid is in good hands.",
      "time": 1744283100,
      "translated": false
    },
    {
      "author_name": "Jason",
      "author_url": "https://www.google.com/maps/contrib/111009043958717188139/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIEI7LQxs5eqX0zevpYGGNSJMxr16wWbCCT--Up0_PyHMNxNw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Dr. Dave and his team are simply the best! The clinic is our go-to place whenever my baby is unwell. We’ve visited multiple pediatric clinics before, but none compare to the level of care, professionalism, and expertise here. Dr. Dave is patient, thorough, and always takes the time to explain everything in detail, ensuring we feel reassured. The staff are equally amazing—friendly, efficient, and great with kids. Highly recommend this clinic to any parent looking for top-notch pediatric care!",
      "time": 1739499713,
      "translated": false
    },
    {
      "author_name": "Cyn Boon",
      "author_url": "https://www.google.com/maps/contrib/100900264947154614028/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUHoBVMvknZRA4r8KDkNGsUMItZ_npDT0_sDZ3i-C0oz7tlNF7e=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Dr. Dave is one of the best and most trusted pediatricians for my three kids! We’ve been seeing him for six years, and his diagnoses are always quick and accurate. While the wait time can sometimes be a bit long, it’s absolutely worth it—my kids recover much faster under his care compared to other doctors.",
      "time": 1739939174,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5639831690556072030",
  "user_ratings_total": 631,
  "vicinity": "681 Punggol Drive, #03-11 Oasis Terraces"
}