{
  "formatted_address": "Blk 17 Eunos Cres, #01-2865, Singapore 400017",
  "geometry": {
    "location": {
      "lat": 1.3233814,
      "lng": 103.9042942
    },
    "viewport": {
      "northeast": {
        "lat": 1.324616680291502,
        "lng": 103.9056570302915
      },
      "southwest": {
        "lat": 1.321918719708498,
        "lng": 103.9029590697085
      }
    }
  },
  "name": "Kidz Meadow Childcare @ Eunos",
  "place_id": "ChIJsYnh3LAZ2jERX0N0qxrBMLY",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "emmy ang",
      "author_url": "https://www.google.com/maps/contrib/113499711316102153566/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLq_z1UArCJlLPxi0HtynvYt3JaTq3x6FWEQy-0pEIUyl13_w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "My son has been attending this preschool since he was in Playgroup (PG). Initially, I was skeptical about the choice I made. Before enrolling him, I visited several preschools and came across some unsettling stories, which made me nervous. However, since Kidz Meadow at Eunos is located right below where I live, the convenience was a major factor. I realized I had to let go a little and not hold on too tightly, as doing so might lead to regrets later.\n\nI’m glad I made this decision because the teachers at Kidz Meadow have been nothing but kind, friendly, and patient. I’m truly amazed by their dedication! Now that my son has started learning K1-level materials, I look forward to hearing about what he learns at school and the experiences he shares at home.\n\nOverall, I would recommend this preschool to parents who value a nurturing environment and don’t have extremely high expectations. It's been a positive experience for us so far!",
      "time": 1733539001,
      "translated": false
    },
    {
      "author_name": "Nafizah Bte",
      "author_url": "https://www.google.com/maps/contrib/104979742820761477748/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKJqzScKtzaKgX2TD0pK3hLjCxLQMgBlbijrsl3hekhn5cxxg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My daughter has been going here about 6 months. The teachers are amazing, informative and loving. They always communicate and are transparent about everything. I was nervous at first but I am comfortable with their care now. As a mom, it can be hard to trust just anyone with your child and I couldn't ask for better caretakers for my child. They love her and treat her as their own. As far as our experiences - is just fantastic! Thank you Kidz Meadow!",
      "time": 1694590974,
      "translated": false
    },
    {
      "author_name": "Vince Ang",
      "author_url": "https://www.google.com/maps/contrib/100138350625932274351/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUbahuTK2YdfGX80WIy2Gw7h8eyXWUqw8ZLpaR-1A5HmQjw5w_W=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Since attended Kidz Meadow, my child has gain valuable knowledge & interaction skills taught from the centre.\nThe teachers are very passionate and took great care of my son welfare!!\nSteps were taken so he can integrate into Primary school next year.\nGreat job Kidz Meadow!!\nThanks to all the teachers and management at the Kidz Meadow - Eunos.",
      "time": 1700194443,
      "translated": false
    },
    {
      "author_name": "Fatimah Begum",
      "author_url": "https://www.google.com/maps/contrib/107233566709323541040/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJL6lxO_lMuM8_-2g1tXA4l5xscwQfwGoAWV-1RJu7J-_5lFg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I enrolled my daughter here at K1. I was very nervous for her when she started off at Kidz Meadow after we had a disappointing experience for N2 in another brand's pre-school.  But I must say, Kidz Meadow Eunos got rid of all my worries and has surpassed my expectations! The teachers and the staff are amazing. Always so friendly, courteous and professional. I can tell my daughter's teachers (Ms Jing and Cikgu Syikin) truly love her and take amazing care of her. When I say they are amazing she can literally stay wif them all day long, give big hugs and come back full of praises for them every single day! I think that speaks volumes of the care provided!!! The school has a very loving and nurturing environment for the kids to learn and grow.  Thank you for all you guys do!",
      "time": 1699230885,
      "translated": false
    },
    {
      "author_name": "Lubna Almutahar",
      "author_url": "https://www.google.com/maps/contrib/118110436461761384293/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWlOFJUPcjyf7XBi3AjALzfSPZ8MlRHFZRlKh6uniMIMJAFxOQy=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Warm, friendly, dedicated, helpful staffs and teachers. School is always clean, pleasant and cheerful looking. My son adores all of his teachers and peers. We are always excited whenever the centre organized any kind of activities, they are all educational and packed with fun for the kids to experience. Enrolling my other son to this centre soon!",
      "time": 1694490312,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13128205234074829663",
  "user_ratings_total": 16,
  "vicinity": "Blk 17 Eunos Crescent, #01-2865"
}