{
  "formatted_address": "3A Kensington Park Rd, Singapore 557255",
  "geometry": {
    "location": {
      "lat": 1.3646899,
      "lng": 103.8659889
    },
    "viewport": {
      "northeast": {
        "lat": 1.366029130291502,
        "lng": 103.8674200802915
      },
      "southwest": {
        "lat": 1.363331169708498,
        "lng": 103.8647221197085
      }
    }
  },
  "name": "Kidz Literacy Cove",
  "place_id": "ChIJH_dDMFUW2jER71T4M8964I4",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Rachel Cheong",
      "author_url": "https://www.google.com/maps/contrib/116381823126113479257/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK7nzwvpaNJ6mNsKTiwyoOL0qUIM8PVM2PWbfe3S-F5wTH2fw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "Both my kids attended KLC since preschool years and have grown to love their weekly sessions which are conducted in smallish groups. The teachers are personable and do try to pace learning to each child’s ability, allowing the child to progress with confidence. We are thankful to have found a suitable environment for our kids.",
      "time": 1722065749,
      "translated": false
    },
    {
      "author_name": "Kayla Tan",
      "author_url": "https://www.google.com/maps/contrib/111626773673853441646/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKxpF2yLHcndlBFA4v7LdVQV2LJ7qPtlERuk-HUDTcim9aV3Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "My 8yo has been with Kidz Literacy Cove since preschool days and he enjoys the classes greatly. The teachers are highly committed and provide prompt feedbacks on his progress. My 5yo just started her learning journey with KLC few weeks back and has been looking forward to class every week. Thank you for making phonics and literacy learning an enjoyable process for them!",
      "time": 1731315326,
      "translated": false
    },
    {
      "author_name": "Diana Sim",
      "author_url": "https://www.google.com/maps/contrib/102017389371979656757/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLfFkqKLC8QXvJTJNEk1Vb3Oi8w2e3DQiWRqRJQOw0r21Ob6w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "Teacher Yogi’s approach to teaching phonics has been nothing short of exceptional. Her methods are not only engaging but also highly effective in helping my little one grasp the foundational elements of reading and writing.\n\nTeacher Yogi also excels in creating a positive and encouraging classroom environment. She fosters a sense of curiosity and excitement about learning phonics, which is crucial for maintaining my little one’s interest and motivation. Her patience and genuine care for my little one’s progress is evident, and she takes the time to provide individual attention and support.\n\nIn addition to her in-class teaching, her communication with parents is consistent and informative, offering tips and activities that align with what is being taught in class.\n\nOverall, Teacher Yogi’s phonics teaching is highly effective, engaging, and supportive. Thank You!",
      "time": 1719634124,
      "translated": false
    },
    {
      "author_name": "Zack Lim",
      "author_url": "https://www.google.com/maps/contrib/103236380810667563048/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVV5WASfbU06bDDehrWCa8oyPkWpyw3uJgt6GPprJ_l3d-mGCvb=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "I highly recommend Kidz Literacy Cove for anyone looking to enhance their child's reading and English skills. My children attended this school since preschool and thanks to the dedicated efforts of Teacher Sarah, Teacher Jasmin, and Teacher Kieran, they have made remarkable progress in their reading abilities.\n\nTeacher Sarah's enthusiasm and innovative teaching methods made learning phonics engaging and effective. Teacher Jasmin's patience and encouragement helped build my children's confidence in reading aloud. Teacher Kieran's attention to individual learning styles ensured that each child received personalized support.\n\nThe environment at Kids Literacy Cove is nurturing and supportive, and the teachers truly care about their students' progress. I am grateful for the positive impact they've had on my children's education. Thank you, Teacher Sarah, Teacher Jasmin, and Teacher Kieran, for your dedication and commitment!",
      "time": 1720655315,
      "translated": false
    },
    {
      "author_name": "Eileen Tan",
      "author_url": "https://www.google.com/maps/contrib/100127289567405449807/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJeP0Wq3kxLyE8BfOwxoT68EOm3HagnPPKzBchbXw0oYxxoMg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "My boys have been with Teacher Sarah since they were little. The phonics programme is great as it is well executed by Teacher Sarah. We like it that she speaks proper English to the children and not Singlish like other schools. Klc is not only for young children as they also have an extensive programme for primary school kids. Even though my sons joined the group class, there was individual focus targeting on weaknesses. Would definitely recommend KLC to everyone!",
      "time": 1719659931,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10295363778517685487",
  "user_ratings_total": 13,
  "vicinity": "3A Kensington Park Road"
}