{
  "formatted_address": "62B Jln Eunos, Singapore 419510",
  "geometry": {
    "location": {
      "lat": 1.3217646,
      "lng": 103.905563
    },
    "viewport": {
      "northeast": {
        "lat": 1.323135780291502,
        "lng": 103.9069474802915
      },
      "southwest": {
        "lat": 1.320437819708498,
        "lng": 103.9042495197085
      }
    }
  },
  "name": "Kim's Place Seafood Restaurant",
  "place_id": "ChIJJSw0vREY2jERpJYzQVeUcMo",
  "rating": 3.9,
  "reviews": [
    {
      "author_name": "Stella Tan",
      "author_url": "https://www.google.com/maps/contrib/113535181452161177021/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLtH0TNsUaNFD51-GA-A5_NQdbINgtanPJIY7qoRjOFBzC7nA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "I rarely post 1 star reviews but if I can I really wish to give 0 stars. After reading all the negative reviews on Google, I’m upset I didn’t read before coming here. I hope the boss reads some of the reviews online and understand what’s actually going on\n\nTotally the worst place to go for a Mother’s Day Dinner with my family. Too many issues but I’ll just list a few,\n\nReservation was not taken properly, table was only set up when I was there.\n\nAircon was not switched on until awhile later and I thought it was just warm in the restaurant.\n\nI ordered Large Fried Rice but was charged XL fried rice, I did not argue this with them because many issues were already there and I’ve decided to just write a bad review instead, more on why I didn’t even bother to argue this below.\n\nBad service, slow service, rude waitress aunty. We had 2 tables and she happily placed a place of pistachio on the plate saying it’s Mothers’ Day for every table and wishing everyone to be happy (开心果 开开心心) which I thought was a good gesture until I saw the bill. $5*2. Then she said, “you didn’t say you didn’t want it when I placed it down”. Maybe I was naive to think it was a good gesture for Mother’s Day.\n\nShe then said 我扣给你, oh maybe yes you realise you’re wrong but in the end she charge me $8 instead of $10. Total bill came up to be $300.10 and she said, l’ll just charge you $300. This is such an insult, you think I’m here to argue over $2.10? It’s integrity. She made a bunch of other comments too.\n\nWhen I was telling my family about this $10, she shouted back, it’s $8 not $10. Excuse me? Guilty and had to explain how much was charged? Regardless of whether it’s $8 or $10, I don’t think the service and food here is really worth $300.\n\nPhotos attached showing what we ate for $300. I believe these are normal dishes we can eat at any Tze Char place. Most of the food were salty, sweet & sour pork, pork ribs, broccoli. Crab meat was very soft, not tender.",
      "time": 1746964651,
      "translated": false
    },
    {
      "author_name": "R YCL",
      "author_url": "https://www.google.com/maps/contrib/100619990702796326121/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUlvVY-QbzejB-5rnRokOZ6XbFCm60fjR4TRDqOtZyEeTkTjquF=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "3 weeks ago",
      "text": "First of all, the 50ish years old looking auntie lied to us about the size of their hokkien mee (HM). When asked what’s the smallest size as I wasn’t too hungry, she said $8 so i ordered it. It was quite a big portion which I finished it in the end as I don’t like to waste my food.\n\nI later found out from the boss himself (son of the late Mr Kim) that there’s a $6 plate HM! Why did the auntie lied to me on such thing?\n\nThe HM it’s the wet type which I like. But the flavour was disappointing. Broth is not flavourful enough. If you are looking for wokhey, this is definitely not the HM you are looking for. Chilli is also so so and they apparently don’t put pork belly. But their fried lard was done pretty well and not too big/dry.\n\nConclusion: I won’t go back for the HM.\n\nBtw, we also ordered the hotplate oyster omelette which was really good! That one can order.",
      "time": 1745856755,
      "translated": false
    },
    {
      "author_name": "Dav",
      "author_url": "https://www.google.com/maps/contrib/111042881286989408469/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVYvXUIUPV_3FzOOSAmnSUMLqKV-vFfh9VU-cTCzRhBg0TV874eiw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Okay big portion for $8 but not soft enough. Chilli is good service can be improve. RIP Mr Kim!",
      "time": 1731992430,
      "translated": false
    },
    {
      "author_name": "Peiling Koh",
      "author_url": "https://www.google.com/maps/contrib/103253263092189016007/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIpDdAOqPDE9iUXLUR9oSDVnPKp2LSOK5LRZx1kNXyCWLhcQQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Definitely zero stars if I can give, there are way better tze char & hokkien mee. Do not patron this place, what a disappointment. Overpriced and not good.\n\nThere is a plump auntie that is really rude. Really bad customer service. She should get fired.\n\nOrdered XS at Kim’s Hokkien Mee (clearly said $12), got served S ($24) instead. Told the staff, they argued we asked for S. Menu is confusing on purpose. Feels like a scam and no integrity.",
      "time": 1744474338,
      "translated": false
    },
    {
      "author_name": "Dennis Huang",
      "author_url": "https://www.google.com/maps/contrib/110193182918374997866/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUZF5NL1jxdTf62qldV2yyIwfS3bhrAEc3lbLCJ89qE5V_ksjCm=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "This is one cozy place you must visit. Great place for friends gathering, family dinner. Business meet up. Renovated with air conditioning. Has a wine bar to chill out, Enjoying food with the best wine at reasonable price. Service is fantastic. The Boss shared a secret of making an additional dish with 2 bowls of rice. How? 😀. Go check it out. Strolling distance from Eunos MRT. Very easy finding your way to the place without a car.",
      "time": 1682256215,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14587322295530002084",
  "user_ratings_total": 445,
  "vicinity": "62B Jalan Eunos"
}