{
  "formatted_address": "Elias Rd, Elias Mall, Singapore 510625",
  "geometry": {
    "location": {
      "lat": 1.3777069,
      "lng": 103.9424671
    },
    "viewport": {
      "northeast": {
        "lat": 1.378959030291502,
        "lng": 103.9437466302915
      },
      "southwest": {
        "lat": 1.376261069708498,
        "lng": 103.9410486697085
      }
    }
  },
  "name": "King Grouper Fish Soup (Elias Mall) 石斑王鱼汤",
  "place_id": "ChIJEVcFd7U92jER_o_IYpIrj50",
  "rating": 3.2,
  "reviews": [
    {
      "author_name": "oXRYSTALo Ong",
      "author_url": "https://www.google.com/maps/contrib/114556064085815871377/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSTtKcF9FYMbh-XNbDu8f7Whl3gi-ZY6T8pFPOm3v9Y98Ws7jL=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "King Grouper Fish Soup in Elias Mall:  A Delicious and Affordable Fish Soup Experience\n\nAlright, folks, listen up! Donkey and I were craving some delicious fish soup before my shopping spree at a Japanese home goods store, so we decided to try King Grouper Fish Soup in Elias Mall. This place is a popular spot, and we found ourselves in a line of about 7 people. The stall is run by a single guy, who was incredibly busy keeping up with the orders. While he was clearly working hard, he didn't seem very chatty or overly friendly. He seemed a bit stoic, but it's possible he was just focused on ensuring everyone got their food quickly.\n\nWhat We Loved:\n\n• The Fish Soup: I'm a big fan of sliced fish soup, so I ordered the Teochew Style Red Grouper Slice Fish for us to share. I also ordered white rice for Donkey and mee sua for myself. The fish was incredibly fresh, with larger slices compared to what we had at the Compass Point stall. The soup was refreshing, and the chili added a nice kick. It's clear they use generous portions, which might be due to the slightly cheaper rent at this coffee shop compared to a shopping center. We were both impressed with the quality of the ingredients, especially the giant groupers (龙趸, lóng, dǔn) that King Grouper Fish Soup is known for. These fish are highly prized in Hong Kong for their firm, bouncy flesh, rich in collagen, and chewy skin.\n\nDonkey's Take: I loved the freshness of the fish!  It was so delicious.\n\nMy Take: The soup was so flavorful!  I'm glad we decided to try this place.\n\nWhat We Didn’t Love:\n\n• The Service: While the wait time can be a bit long and the service could be warmer, the quality of the food makes it worth it.\n\nRating:\n\n• Food: 4.5/5 (Delicious and fresh)\n\n• Service: 3/5 (Could be more friendly)\n\n• Value: 4/5 (Reasonably priced)\n\nOverall:  4/5\n\nOur Verdict: If you're looking for a great fish soup in Singapore, I highly recommend giving this place a try! You won't be disappointed with the food.",
      "time": 1730213360,
      "translated": false
    },
    {
      "author_name": "Doraemon",
      "author_url": "https://www.google.com/maps/contrib/112665277904119154671/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX2VSCcaT9axvOwx2nD8XD3PgZ8V5VFnv420aocMSfLa6GlcEmN=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "Kitty and I were craving some delicious fish soup before her shopping spree at a Japanese home goods store, so we decided to try King Grouper Fish Soup in Elias Mall. This place is a popular spot, and we found ourselves in a line of about 7 people.  The stall is run by a single guy, who was incredibly busy keeping up with the orders. While he was clearly working hard, we noticed he wasn't very chatty or overly friendly. Kitty mentioned he seemed a bit stoic, but it's possible he was just focused on ensuring everyone got their food quickly.\n\nKitty, a big fan of sliced fish soup with rice, ordered the mian xiang for us to share, and I had a side of rice.  Both were absolutely delicious! The fish was incredibly fresh, with larger slices compared to what we had at the Compass Point stall. The soup was refreshing, and the chili added a nice kick.  It’s clear they use generous portions, which might be due to the slightly cheaper rent at this coffee shop compared to a shopping center. We were both impressed with the quality of the ingredients, especially the giant groupers (龙趸, lóng, dǔn) that King Grouper Fish Soup is known for.  These fish are highly prized in Hong Kong for their firm, bouncy flesh, rich in collagen, and chewy skin.\n\nThe total cost was about $21—$20 for the fish, 50 cents for the rice, and the mian xiang.  Overall, while the wait time can be a bit long and the service could be warmer, the quality of the food makes it worth it. If you're looking for a great fish soup in Singapore, I highly recommend giving this place a try! You won't be disappointed with the food.",
      "time": 1730201332,
      "translated": false
    },
    {
      "author_name": "sp hp",
      "author_url": "https://www.google.com/maps/contrib/108667216785951629604/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIrp5V_TUZoRZ5GIPMCoJvDbIv-B-BEAr-ceRryHiXIJ4Bcww=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "a year ago",
      "text": "It's average, first time trying from this outlet.\n\nOrdered Teochew style red grouper sliced fish soup, upsized $20. More than enough fish for 2 people to share comfortably with the upsized version. Taste is average and not so sure about the freshness. Cook could have been better as had 3 pieces of fish slices clumped together.",
      "time": 1696420675,
      "translated": false
    },
    {
      "author_name": "Susan Ho",
      "author_url": "https://www.google.com/maps/contrib/109820726961776492506/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJsk3weZO7l9DJEiEo8mOkjCIF8I7WbY_wk4_08W7usE0fHAw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My husband & I enjoyed eating from King Grouper Fish Soup at Elias. No. 2 Teochew Style Pomfret sliced fish with added tofu $0.50 & 2 rices are our regular choice. Fish is fresh. It is very appetising dish. Yummy meal. Staff is very friendly and good service 👍🏻👍🏻👍🏻👍🏻",
      "time": 1703683634,
      "translated": false
    },
    {
      "author_name": "Jacob TAN",
      "author_url": "https://www.google.com/maps/contrib/114080558508206655685/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUv7ChYSn_mkLArSNaLDWMUf1ZDQof9r4wk1hpAqCrkFj2Y3mn2=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 3,
      "relative_time_description": "a year ago",
      "text": "Fish soup here is not as good as other branches. The batang fish slices are inconsistent in thickness and sizes. Fish has no fishy smell but not as firm as other branches. Soup is tasty but is not clear like other teochew fish soup stall.",
      "time": 1705380471,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11353341093346840574",
  "user_ratings_total": 29,
  "vicinity": "Elias Road, Elias Mall"
}