{
  "formatted_address": "250 Sims Ave, #01-01, Singapore 387513",
  "geometry": {
    "location": {
      "lat": 1.3149676,
      "lng": 103.8826401
    },
    "viewport": {
      "northeast": {
        "lat": 1.316382630291502,
        "lng": 103.8839769802915
      },
      "southwest": {
        "lat": 1.313684669708498,
        "lng": 103.8812790197085
      }
    }
  },
  "name": "Kingston Medical Clinic Pte Ltd",
  "place_id": "ChIJn-k0TssX2jERnMfIngkYxAU",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Lin Lin",
      "author_url": "https://www.google.com/maps/contrib/110339607376172141675/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKLOhVczFRb_lVSLuiaec3WOSWfI_zBZQ7SeGLJgQ9BlcYMKQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I was there with my helper this morning. Prior to the visit, I booked an appointment over WhatsApp yesterday, response was prompt. When I reached at 7.30am today, there was already a very long queue but because of my appointment scheduled, it was still very swift and fast. I then left my helper there for medical check up and nurse told me they will bring her up for SIP after the check up.\n\nAfter I left the clinic, I received a message from the nurse regarding my helper’s short sightedness. They told me to get her a pair of glasses. They said they have also in-house optician to prescribe her the necessary. Price for same day collection is also very reasonable $100+ inclusive of GST.\n\nThroughout the whole process, I was greeted with friendly nurses. Despite the crowd in the mornin, the nurse answered my questions patiently, as it was my first time there. I want to compliment the staffs:\n\n1. Registration staff Chloe\n2. Admin Nat\n3. Clinic manager Sandi\n\nThey all worked together to help me settle my helper’s medical checkup, SIP and glasses prescription smoothly and efficiently. When I received my helper at 4.40pm today, I also received the medical report at the same time! What a hassle-free service provided! Not to also mention their great and responsive, thank u so much Kingston!",
      "time": 1729681419,
      "translated": false
    },
    {
      "author_name": "Ho Ah Ngen Ho",
      "author_url": "https://www.google.com/maps/contrib/107321534433150478693/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIqccpfzHVb5_0BGWOP9uAVORFALEjWe6ptIc4mE8T0D3R4DA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "I’m a senior citizen of 82 yrs old. I took my son, intellectually disabled man of 40 yrs old for medical check up.\nThere were many people there for medical test . Most of them were maids and foreign workers.\nI was given a number. I was told to wait for about 45 minutes for my turn. After 45 minutes I was still waiting.\nJust then a lady, Xin Ru who was working in the clinic took a chair for me to sit down. She then asked what I was here for. I told her I took my intellectually disabled son for medical test.\nShe was a living example of a kind, sincere and thoughtful person. Seeing my condition; an old man who could hardly walk properly and towing an intellectually disabled son,  she helped to get my disabled son for his medical test.\nShe was so courteous that she even got a payment machine to me to make my payment.\nI’ve not seen such a courteous, kind and sincere person for a long time.\nI congratulate Kingston Medical Clinic for having such a valuable staff like Xin Ru. She will be a valuable asset to your clinic and humanity.\nLittle act of kindness of hers will make your medical Center a popular one in your region.\nThank you very much Xin Ru.\nThank you Kingston Medical Clinic for your services and congratulation for having such a kind and thoughtful staff as Xin Ru.\nMy deepest appreciation to you all.\nThank you, thank you and thank you.\nSign off as\nHo Ah Ngen, father of Ho Loong Chung Joseph.",
      "time": 1746814843,
      "translated": false
    },
    {
      "author_name": "Will Eu",
      "author_url": "https://www.google.com/maps/contrib/107485474074795381913/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK-yo6dIWwHsLPGgTD1L1O1zPUNCjzApNHijhrb8yYv9k7Tzw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Excellent service at Kingston Medical Clinic! Miko, the receptionist, was friendly and professional, making check-in a breeze. Barry did a great job with the X-rays, putting me at ease throughout. Highly recommend thanks to their outstanding staff. 5 stars!",
      "time": 1729150739,
      "translated": false
    },
    {
      "author_name": "dennis domingo",
      "author_url": "https://www.google.com/maps/contrib/100347630107390996634/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKRlPXNe_51CWeSCnSGZ6ZxlSb_WBY_lu9PQLhwGD8boGZk4Uva=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "\"I had a wonderful experience at this office espicially to Ms.MIKO. thanks in no small part to the exceptional receptionist. From the moment I walked in, she greeted me with a warm smile and made me feel welcome. She was professional, efficient, and answered all my questions with a genuine willingness to help. Her friendly demeanor set the tone for a great visit, and I truly appreciated how smoothly everything was handled. Great job, and thank you for making the experience so pleasant!",
      "time": 1741580512,
      "translated": false
    },
    {
      "author_name": "Sid ian",
      "author_url": "https://www.google.com/maps/contrib/112066165401962734719/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKDjXeFX3vsxAaCVlt7H6lVC265z9jWwlAGHeX2CE2UdH8wyg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I had my medical test last 23 and Ms Miko was such a pro in handling on drawing blood, felt no pain. The lady before me was so anxious that she was able to calm her down. Thank you.",
      "time": 1737791686,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=415483495222658972",
  "user_ratings_total": 719,
  "vicinity": "250 Sims Avenue, #01-01"
}