{
  "formatted_address": "63 Hillview Ave, #03-06 Lam Soon Industrial Building, Singapore 669569",
  "geometry": {
    "location": {
      "lat": 1.3570307,
      "lng": 103.763132
    },
    "viewport": {
      "northeast": {
        "lat": 1.358502280291502,
        "lng": 103.7644145802915
      },
      "southwest": {
        "lat": 1.355804319708498,
        "lng": 103.7617166197085
      }
    }
  },
  "name": "Kitzig Design Studio Pte Ltd",
  "place_id": "ChIJj9SL0U8Q2jERC-RItSoijis",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "CELINA0709",
      "author_url": "https://www.google.com/maps/contrib/111244285921477313017/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV0tFf91nciVNe397mp2gWZgyTFK8g90-Rw5LIUiwmvvARqJovz=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "I recently had the pleasure of working with Ms Cecilia on my renovation and I couldn’t be happier with the results! From our first meeting, she was incredibly professional and attentive, taking the time to understand my style and needs.\n\nMs Cecilia brought an unique creativity to the project, suggesting ideas I hadn’t even considered. The attention to detail was impressive; every element, from the lighting to the accessories, was thoughtfully chosen to create a cohesive look.\n\nThroughout the process, she managed the project seamlessly, keeping everything on schedule and within budget. The transformation of my space exceeded my expectations, and I’m thrilled with the final outcome.\n\nI highly recommend Ms Cecilia Zheng from Kitzig Design Studio to anyone looking for a talented and dedicated interior designer. Her expertise truly made a difference, and I look forward to working with her again in the future!",
      "time": 1729067740,
      "translated": false
    },
    {
      "author_name": "Rayner",
      "author_url": "https://www.google.com/maps/contrib/114489020182971019726/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIdzIIejOe2OpJHbFRCDVu5juFA91vgcFf_vXCQDfx5hyqD6Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "We engaged Kitzig Design Studio for a major renovation of our landed property in 2022. From the start at the project tendering stage to the ongoing construction/renovation to the completion and handover, we found the entire project to be very well managed and professionally handled by our assigned site manager, Ms. Cecilia Zhang.\nMs. Zhang was frequently onsite to check on the progress and often took photos to update us and the architect, as well as seek clarifications to the design or layout plans. She proactively monitored the progress vs the agreed timeline. Our requests were consulted, considered and then well executed.\nThe litmus test for customer service and satisfaction usually comes after handover and post payments. We are delighted to share that Ms. Zhang and the Kitzig team were very responsive to our feedback and prompt to our service requests, as well as provided high level of after-sales service and support. This is something any homeowners will really appreciate, and the entire experience left us with no qualms to engage Kitzig again for our next project(s).",
      "time": 1727590047,
      "translated": false
    },
    {
      "author_name": "Lim Cher Siong",
      "author_url": "https://www.google.com/maps/contrib/102061962807455208931/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJGC7GL2Bfc-SdE_cKZltXQmWDyBo30F9hg4xHL7RCc1c_PsQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "Their renovation pricing is fair and transparent, and their sales manager, Cecilia, is quick to respond when you need help or advice. Her attentiveness to detail and positive energy leaves a lasting impression on me.",
      "time": 1721825004,
      "translated": false
    },
    {
      "author_name": "Official Folder",
      "author_url": "https://www.google.com/maps/contrib/118197883302880308728/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKc5QLztJb03ZiuU1BKE52G4JA73hiWZ5JZGVQdSUMAEngQGg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Our company was engaging the service to do over our work spaces. The service provided by the project coordinator and team was excellent. They done their great housekeeping daily after work. This is impressive! Will recommend Kitzig to others.",
      "time": 1674005320,
      "translated": false
    },
    {
      "author_name": "Henry C",
      "author_url": "https://www.google.com/maps/contrib/100297380669650077340/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK2g4A0nIGKjD_o_YwvzgBvVfY0BQe4v1ZQ40gjnNsB6GGyqvQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 years ago",
      "text": "Unprofessional company. I had engaged them to perform wood panelling for a feature wall and also to build a laundry room. They requested to split the job into 2, for their convenience in completion which I reluctantly agreed to and indicated timeline as end March to finish the entrance wood panelling and end April for the laundry room. Subsequently, they reverted that entrance panelling will be completed by end April. In mid April, they reconfirmed completion in last week of April 2021. However, at the very last moment they messaged to say that they can't do the job as their boss told them to execute only big orders. They did not have the courtesy to even call to explain or apologie. Wasted 2 months of my time following up with them and working on the design details with them. Horrible experience and totally unprofessional company.",
      "time": 1619415927,
      "translated": false
    }
  ],
  "types": [
    "general_contractor",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3138483557149238283",
  "user_ratings_total": 11,
  "vicinity": "63 Hillview Avenue, #03-06 Lam Soon Industrial Building"
}