{
  "formatted_address": "Queen St, Singapore 180271",
  "geometry": {
    "location": {
      "lat": 1.3011016,
      "lng": 103.8537261
    },
    "viewport": {
      "northeast": {
        "lat": 1.302188280291502,
        "lng": 103.8554240302915
      },
      "southwest": {
        "lat": 1.299490319708498,
        "lng": 103.8527260697085
      }
    }
  },
  "name": "koat.",
  "place_id": "ChIJPR8qTnUZ2jER6qbBIozZ17A",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Kaitalyn Green",
      "author_url": "https://www.google.com/maps/contrib/102186292984395147848/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVjKqBD6RD03dIXjWg9mGstk0MTJ-0c5AFGZa5Q3D_EjACoHgI=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Koat is run by a lovely and friendly couple who serves delicious food in a warm and dreamily decorated place! The atmosphere was really cosy and though I did not walk away with any of the dear tuesday ceramics, they were still beautiful to look at.\n\nI can tell that they've put a lot of thought into their menu and especially enjoyed the pistachio furikake ice cream (a combination that I would have never thought of myself) 🥰 and though the cheese was stronger than what I usually eat, it was still a hearty dish together with the honey, dried fruits and crackers!\n\nLooking forward to whatever they have planned next~ and will definitely bring a friend with me next time haha\n\n(the mint they gave away at the end of the meal is also in such cute handmade packaging 😍)",
      "time": 1739120923,
      "translated": false
    },
    {
      "author_name": "Amanda Han",
      "author_url": "https://www.google.com/maps/contrib/114747343996971053797/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKrORS2pia5NkIiQUY3GZ5yZisks4qvVw6Si6UXi4h9q1RY7g=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "If anyone asked me to recommend a hidden gem, I think this has got to be it!\n\nTo start, the home was a feast for the eyes. Lights were placed in strategic places, giving an aesthetic angle for every inch and corner of the room. The soft music that was playing in the background complimented the rain that day. We were totally relaxed.\n\nWe were greeted by the warm home owners, who then served us our preordered drinks. I had a hojicha latte and to my surprise, the quality of the coffee shone through the thickness of the hojicha and the milk. With just the barista skills reflected by my coffee, I was already anticipating for my meal.\n\nWe had a Japanese pumpkin & butternut squash soup served with black pepper puff twists as our first course. Wow wow wow, I have to say I did not expect the puff twists to work with the soup but it definitely did! The bowl that came with it was equally exceptional that I probably will not be able to describe well in words. Just imagine seeing a bowl looking like a bowl, but it is as light as a feather and it is made of paper (I know it sounds redundant, but just have a look and you'd understand).\n\nOur second course was a honeyed camembert dish, which I originally did not think much of but to this day, I am STILL thinking about it! That dish was so well balanced and the mouthful was an absolute delight. We had all sorts of textures working with the dish from crunchy almonds to soft berries and my taste buds were constantly teased that I was totally addicted. To make things worse, the rye sourdough crackers were so fun to explore as we were given a variety to taste and savour. Wow, kudos to the owners for creating a truly remarkable dish!\n\nWe finally ended the night with a vanilla bean ice cream that came in two flavours: pistachio and berry compote. I had the berry and my partner had the pistachio. Both ice creams were legendary, but what made my night was the pistachio. I don't want to spoil the surprise, but the pistachio was paired with a particular ingredient that I would've never thought of, and the pairing was a match made in heaven. To whoever has made it this far, I urge you to try it then you'd understand what I mean 😂\n\nI was quite sad that my time here has come to an end, but the owners gave us YET another surprise that I never seen before! I appreciate the hard work put into every single aspect of my meal from my sight, to my ears, and of course, to my taste buds.\n\nThank you for taking so much pride in your work, and I truly hope that you will continue to share your creations to the everyone else and may success follow 💕",
      "time": 1735834096,
      "translated": false
    },
    {
      "author_name": "Chan Ruey Chyi",
      "author_url": "https://www.google.com/maps/contrib/110856151901859474190/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIsRP3aQDuQeE67IsFaTz-LMJvvIlqPYwuTGQXTnR6x4Wz5QCg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Love the experience, the ambience. Salute to the owner for all the effort and thoughts in everything, from the creative pairing of the dishes to the comfy space to the small little door gift. Highly recommended!",
      "time": 1735461753,
      "translated": false
    },
    {
      "author_name": "K Ng",
      "author_url": "https://www.google.com/maps/contrib/116653343284545647613/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUhCfr0yeJLZfbQSU_RPnzf11pm0m-pqwYZ6ecyB2wWUTgUznji=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Had a wonderful meal at Koat. The dessert was phenomenal- loved the unique pairing of pistachio and furikake!",
      "time": 1734253826,
      "translated": false
    },
    {
      "author_name": "ivan hoh",
      "author_url": "https://www.google.com/maps/contrib/104868375942957913424/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVWbzqLScI5juaAfAkigKBMrdpGoTSndWqoghONpC2zqEEMbHVJ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Handsome and pretty boss 👍🏾",
      "time": 1735459412,
      "translated": false
    }
  ],
  "types": [
    "museum",
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12742892866569873130",
  "user_ratings_total": 5,
  "vicinity": "Queen Street"
}