{
  "formatted_address": "11 Neo Tiew Lane 2, Singapore 718814",
  "geometry": {
    "location": {
      "lat": 1.4196408,
      "lng": 103.7205184
    },
    "viewport": {
      "northeast": {
        "lat": 1.421083730291502,
        "lng": 103.7218020302915
      },
      "southwest": {
        "lat": 1.418385769708498,
        "lng": 103.7191040697085
      }
    }
  },
  "name": "Kranji Marshes",
  "place_id": "ChIJ3dcI_PUN2jERTnYeNNfju5c",
  "rating": 4,
  "reviews": [
    {
      "author_name": "OngOng Journey",
      "author_url": "https://www.google.com/maps/contrib/109641485461646377275/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW-WNTWMZjzndd1mcnacn_69lmzlWG7SsMExAgpXA3myR4O9OgI=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "6 months ago",
      "text": "Kranji Marshes offers a unique escape into nature, but it's a mixed bag in terms of maintenance and experience. Located in Singapore, the marshes are a good option for those looking to immerse themselves in a quieter, more natural environment away from the hustle and bustle of the city.\n\nThe walking trail is decent, making for a pleasant trek, and I found that a 30-minute walk provided an opportunity to appreciate the surrounding flora and fauna. However, the lack of upkeep was evident. Some paths were overgrown, and the area felt somewhat neglected, which detracted from the overall experience.\n\nOne significant downside was the mosquito situation. I ended up with 18 bites during my visit, so I recommend bringing insect repellent or wear long sleeves and pants if you decide to go. The marshes can feel quite deserted, which might appeal to some seeking solitude, but it could also be a bit unsettling for others.\n\nOverall, Kranji Marshes has potential for a refreshing nature walk, but be prepared for a few inconveniences along the way. If you are willing to overlook the maintenance issues and the pesky mosquitoes, it can be a worthwhile retreat into Singapore's natural landscape.",
      "time": 1730882812,
      "translated": false
    },
    {
      "author_name": "lontongstroong",
      "author_url": "https://www.google.com/maps/contrib/112708452931686187176/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIGL4TilfhYmnv66DwIz3eDOGEeLdHIAXoJyV4pmEI2w1bf6Q=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "7 months ago",
      "text": "Super quaint and ulu place where most of the visitors are bird watchers (run into a few during the visit). Quite hard to reach because closest bus stops (let alone train stations) are kilometers away. Walking to the location is also hard since the road has no pavement. The upside is that it's free of charge and the observation tower at the end of the trail gives a nice vantage point over the bird reserve and Kranji Reservoir nearby. Maintenance works could've been better since some of the sheds seem to be quite run down.",
      "time": 1729347093,
      "translated": false
    },
    {
      "author_name": "Yellow Bear",
      "author_url": "https://www.google.com/maps/contrib/104489311735261065689/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXJw6wU_ViJ96j0KUowLXVVtxYUueaV518tEdvuXXsBsEMiDzjh=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "Rather small but really quiet and peaceful.\nDo wear sunblock as it’s really hot and sunny here. Also insect repellent, if mosquitoes love you.\nEnjoy the beautiful nature and stay hydrated.\nFree admission.",
      "time": 1715166723,
      "translated": false
    },
    {
      "author_name": "Eleanor",
      "author_url": "https://www.google.com/maps/contrib/118015160359706421100/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV_-yda9EbraaaEvEb_ayR3Ah-deqXk11w-Fna8d2vyRz9AHMkrOw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "It was a pretty small area but the lookout points were beautiful. Managed to spot quite a number of bird species and sunbird’s nest. The route was well paved and manageable for a toddler. The weather can be quite warm so do bring along water bottle, there’s a water refill area at the visitor entrance (at the front) and also a vending machine. There is also toilet facilities at the entrance. In case of wet weather, there were a few sheltered huts that you can take shelter at. However, I had difficulty getting a cab from the area to head home.",
      "time": 1711727689,
      "translated": false
    },
    {
      "author_name": "Athena M",
      "author_url": "https://www.google.com/maps/contrib/103232186648182903163/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWNiIRQ_dlsGuSrq0GuUDQVTmY6tAcd25iK2VqYjT77u1XTym2x9A=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "Easy walk (1km to the tower) with great greenery and wildlife to be seen. Glad to have caught so many birds, but think it would have been better if I went earlier because then it would be less hot (I went at 10am). There are some unshaded parts on the way in so wear lots of sunblock! The view from the raptor tower is great and the breeze is nice.",
      "time": 1607681087,
      "translated": false
    }
  ],
  "types": [
    "park",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10933583033803896398",
  "user_ratings_total": 451,
  "vicinity": "11 Neo Tiew Lane 2"
}