{
  "formatted_address": "10 Neo Tiew Lane 2, Singapore 718813",
  "geometry": {
    "location": {
      "lat": 1.4198053,
      "lng": 103.7195597
    },
    "viewport": {
      "northeast": {
        "lat": 1.421221180291502,
        "lng": 103.7209334302915
      },
      "southwest": {
        "lat": 1.418523219708498,
        "lng": 103.7182354697085
      }
    }
  },
  "name": "Kranji Sanctuary Resort",
  "place_id": "ChIJZYm6guYN2jERdmoxoxm98Kc",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Clara Lay",
      "author_url": "https://www.google.com/maps/contrib/107566272009282710247/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXvP9ckMLMv6yT8ILWlRTD1-1e3DuCLF8uGDeroHBjY4tAu9R70=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Had a relaxing 3D2N stay. The room is rustic as a true countryside abode is, signs of aging everywhere but everything works. No major mosquito problem as we came well prepared with repellent and coils. The resort also does fogging and turn on the electric mozzie trap every evening.\n\nBest part is the luxurious bathroom, as we stay in an Executive Room equipped with a sauna and jacuzzi.\n\nLack of facilities without a pool or cafe means having to drive out for daily necessities and activities. Not your typical 4-star resort, but just the right place to escape the city, with the Kranji Marshes right next door, to watch the birds, stroll in nature and be transported to a different world.",
      "time": 1742180792,
      "translated": false
    },
    {
      "author_name": "Eng Dylan",
      "author_url": "https://www.google.com/maps/contrib/102957553502403433439/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKE3LcckcyjmXF9DUKyHVWP8jWQ5ndbAQbHCMElzRbpMvu72A=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "2 weeks ago",
      "text": "Came across this pet friendly resort which is quite rare in Singapore. So we decided to do a short getaway with the furkids and booked the executive room at $384. Here is my honest review after staying there for 2D1N.\n\nCons\n1. sign of aging- basically there's no facility (swimming pool, eateries, room service and etc) even the prawning activities has been shut down. it's literally a dead town.\n2. everything is chargeable- despite the 'not so cheap' price that we have paid, everything that u request will be chargeable. We wanted to borrow knife or scicsors from the management but they said they dont have?! Eventually we manage to borrow from the indian worker who is working there. The pitiful small size of BBQ pit is chargeable at $50 with a small mesh, 6 pcs of fire starter and a small bag of charcoal. That said, u really need to prepare everything on your own, plan your own activity and do not expect resort to help.\n\nPros\n1. The only thing that I like for the stay is the shower room area. Spacious with steam room, rain shower and jacuzzi. Everything works.\n\nIn short, we feel is quite a pity that the resort is going downhill. We hope the management can do something to revive the place. For now, I don't see the reason to return.\n\nIn contrast, we think that the neighborhood Bollywood vege farm is well maintained with nice restaurant and vegetable farm.",
      "time": 1746500407,
      "translated": false
    },
    {
      "author_name": "OngOng Journey",
      "author_url": "https://www.google.com/maps/contrib/109641485461646377275/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW-WNTWMZjzndd1mcnacn_69lmzlWG7SsMExAgpXA3myR4O9OgI=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "6 months ago",
      "text": "I recently stayed at Kranji Sanctuary Resort and wanted to share my experience. While the resort has some charming aspects, it was a bit disappointing overall.\n\nFirstly, the resort felt a bit run down and didn't quite match the spaciousness depicted in the photos on the website. We initially booked an executive room with a bathtub, but it turned out to be too small for two adults and our dog. We ended up having to pay extra to upgrade to a family room, which, while more accommodating, also lacked a bathtub.\n\nOne of the major drawbacks is the location. It’s quite far from the city, which is great if you’re looking for a peaceful escape in nature. However, it makes accessing food a challenge. Unless you prepare your own meals, dining options are limited. The resort does have a BBQ pit, but the small fridge restricts how much you can store, and there’s no option to cook since there are no pots or a microwave available for heating up prepared food.\n\nOverall, while Kranji Sanctuary Resort offers a serene environment and a chance to enjoy some greenery, the lack of basic amenities and conveniences made our stay less enjoyable than we had hoped. It might be a suitable retreat for those who plan to bring their own food and have a preference for a quieter, more rustic experience, but for us, it missed the mark.",
      "time": 1731141287,
      "translated": false
    },
    {
      "author_name": "Eason Lim",
      "author_url": "https://www.google.com/maps/contrib/103258395039691511503/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKoOnFDQ9SzpKAzZ80MXUpfazxII5eeORQC-j4bGURzf-JzhQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Give them a chance. You won't regret it. Despite only taking over this place very recently (months), they have made the place awesome to stay in. Take 925 to Kranji Reservoir Park and cycle down using Anywheel or takje 975 to a bus stop nearby the farm. Walk will be 25min minimum\n\nPros:\n- Amazing staff. Absolutely deserve a raise... especially becasue of the trouble I gave them haha. Initially, I thought the day counter staff looked a little cold, but after speaking to him for a couple of minutes, he's an honest, knowledgable, helpful and patient person. Gave us advice with regards to visitors as well. Made us feel extremely welcome. Night staff was very efficient and calm when settling our issue. Words alone cannot describe how wonderful the receptionists are. They will keep customers coming back\n\n- Very Quiet place\n- surprisingly spacious and luxurious toilets and rooms. Had a Sauna, Bath tub. The bed and sofa bed were humongous and comfortable. My friends commented that it was better than their home beds.\n- They really do try their best. They carried out mosquito fogging in the morning.\n- bbq pit rental lasts your entire stay\n- big and practical car porch for bbq. There was a shared backyard with other guests that we didn't utilise.\n- there's bicycle parking for Anywheel.\n- Roads surprisingly well-lit at night.\n- nearby many organic, heritage farms. I loved the atmosphere.\n- Allows for Lalamove (super helpful as i brought extra items for my bbq)\n- Fantastic TV. Loud, clear and with tons of free entertainment.\n- Internet was 100% up for M1.\n- Air con was decently cold but have to adjust\n\nCons:\n- Truly a mosquito farm, but is to be expected. its literally a farm area, nearby sungei buloh wetland reserve. but their zapping machine works i think, after i turned it on there were far less.\n- still a long walk to the bus stop. no transport options to here. Actually I recommend if they could get a buggy to ferry people over, or run a feeder service.\n- have to plan out your own activites. The old shops nearby are all closed. Swimming pool is also down. There's a playground though. But they mentioned they will make the place better",
      "time": 1736507304,
      "translated": false
    },
    {
      "author_name": "James Ang GuangMing",
      "author_url": "https://www.google.com/maps/contrib/104490140609449908462/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWKIcmuJqVXsZB7Pj9UJ7ya6BETLcL6ZwfrWkDi0tAfimjDmnXC=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "A must come if u want a getaway from city life. Pet friendly. Room is clean and decent. 5 stars toilet with Jacuzzi, rain shower, steam room. Highly recommended for pet lovers, families, couples and individuals. Will definitely visit again.",
      "time": 1718714278,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12101380116554279542",
  "user_ratings_total": 85,
  "vicinity": "10 Neo Tiew Lane 2"
}