{
  "formatted_address": "133 New Bridge Rd, B1-51C Chinatown point, Singapore 059413",
  "geometry": {
    "location": {
      "lat": 1.2848128,
      "lng": 103.8446478
    },
    "viewport": {
      "northeast": {
        "lat": 1.286246230291502,
        "lng": 103.8460451302915
      },
      "southwest": {
        "lat": 1.283548269708498,
        "lng": 103.8433471697085
      }
    }
  },
  "name": "Kuafood Fried Skewer @Chinatown Point",
  "place_id": "ChIJRx5XEssZ2jERe-6OE69zBAc",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Jason Rogers",
      "author_url": "https://www.google.com/maps/contrib/105529253681857889257/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX9wq1n6PDvRq3c7pOF02EIBJYCg2SGumBRwLx07cmXSqxb3xiJ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Unforgettable Flavors at Kuafood Fried Skewer – A Culinary Delight!\n\nWow.. just wow... My wife, Melita, and I recently stopped by Kuafood Fried Skewer 夸父炸串 at Chinatown Point during our visit to Singapore, and we were utterly blown away by the experience. This hidden gem truly redefines what street food can be, combining exceptional flavor, freshness, and craftsmanship.\n\nThe skewers? Simply the best I have ever tasted! Each piece was masterfully fried to golden perfection—crispy on the outside, yet tender and juicy within. The explosion of flavors with every bite was nothing short of extraordinary. From savory meat options to delightfully seasoned vegetables, every skewer was a showcase of quality ingredients paired with a sublime seasoning blend that left us craving more.\n\nWhat set Kuafood apart was the attention to detail in preparation and presentation. The balance of spice and texture was impeccable, and the signature dipping sauces elevated each skewer to new heights. The authentic flavors of China were evident in every bite, yet they were thoughtfully adapted to create a taste experience that anyone can enjoy.\n\nBeyond the food, the service was warm and welcoming. The staff were enthusiastic and knowledgeable, offering recommendations that didn’t disappoint. The cozy yet vibrant ambiance of the stall made the experience even more enjoyable—a perfect pit stop amid the bustling Chinatown Point atmosphere.\n\nKuafood Fried Skewer is a must-visit for anyone who loves street food or is looking to try something new and incredible. It’s not just a meal—it’s a culinary adventure that will linger in your memory long after the last skewer. This place has set a new benchmark for fried skewers, and we can’t wait to return for another round!\n\nIf you’re in Singapore, do yourself a favor and make Kuafood Fried Skewer your next dining destination. You won’t be disappointed!",
      "time": 1736424799,
      "translated": false
    },
    {
      "author_name": "Touristmouse",
      "author_url": "https://www.google.com/maps/contrib/110409011587721664076/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVQwdnnLVXAyDc72dXSDd23W5Gz3eSWS0b1idu6OY0BJjmLShxezg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "This unassuming joint has been a reliable go-to spot for the past year. It's great for solo diners and the skewers remain warm and crisp even when taking away. The skewers selection are fresh, offering a wide variety of options, many of which are priced affordably at under $1 each. If you are level 3 mala, just go for the extra spicy level, you'll love the kick.\n\nDisclaimer: I received a freebie (potato cubes and it's so yummy) for this review. However, my positive feedback is genuine and unbiased.",
      "time": 1734241739,
      "translated": false
    },
    {
      "author_name": "Yoke Lan Sun",
      "author_url": "https://www.google.com/maps/contrib/114581990278151077956/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUC24DxCe2JJVB383hCvHPfZ8aBZ0qDxa8nZlw8p3nOq3c3FxTW=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "One of my fave “small food” eatery! Super tasty and cheap! Just $2 for a meaty chunky lamb skewer and the huge slab of sotong is just $8.90! 3 lamb and a sotong skewers made for a hearty satisfying meal for me! Must try if you are here! You will be back for more! This is at Chinatown Point B1!",
      "time": 1732881229,
      "translated": false
    },
    {
      "author_name": "Clara Lim",
      "author_url": "https://www.google.com/maps/contrib/100891774814482708958/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLGbnICDR8Z_jbYVMI4iYcekuO9m8Nm_GC27-fGtcHXkMI=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Best Chinese skewers in sg! I’m so addicted to it, the seasonings are so good. Definitely my go to place from now on. Just wish there are more seats available and hope they can open more outlets soon.",
      "time": 1740337401,
      "translated": false
    },
    {
      "author_name": "B",
      "author_url": "https://www.google.com/maps/contrib/111410330030701782424/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWJxKV0KhIn6w2trt1aFB_gi1t4AckyYcpJkGcCKu5zV1IyE0tfyQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "First try after reading the reviews! Pick and choose your skewers (just like how you choose your tong tau foo) and pay at the counter. Counter staff (guy) is polite and also asked what level of spiciness I would like them to be prepared. I had it takeaway. I would say the ‘dine in’ seating is cramp (counter seating) and about 4 seats only. Hence a takeaway would be more advisable. Receipt would have your queue number and pick it up once the electronic counter flashes your number. The skewers are not super cheap but I guessed kind of market rate but it’s definitely tasty. I especially love the chicken skin and the mushroom. The tofu is not bad too. Try it! 😋",
      "time": 1729268832,
      "translated": false
    }
  ],
  "types": [
    "meal_takeaway",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=505656253956943483",
  "user_ratings_total": 248,
  "vicinity": "133 New Bridge Road, B1-51C Chinatown point, Singapore"
}