{
  "formatted_address": "113B Alkaff Cres, #03-06 Alkaff Oasis, Singapore 342113",
  "geometry": {
    "location": {
      "lat": 1.3360357,
      "lng": 103.8728417
    },
    "viewport": {
      "northeast": {
        "lat": 1.337477780291502,
        "lng": 103.8742011302915
      },
      "southwest": {
        "lat": 1.334779819708498,
        "lng": 103.8715031697085
      }
    }
  },
  "name": "Kumari’s VEETU BIRYANI",
  "place_id": "ChIJraJdxpsX2jEROR0LAK7HzSI",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Rajesh J",
      "author_url": "https://www.google.com/maps/contrib/116132360046537990764/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXk5xvHmhsfQuczmK2eDDuwPkrUGhhkybzVStsTJkYxKptj42SW=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "🌟 A Taste of Home at Kumari’s VEETU BIRYANI 🌟\n\nIf you're craving authentic, homemade biryani in Singapore, look no further than Kumari’s VEETU BIRYANI. This gem of a place serves the best mutton biryani we've ever had here, transporting us straight to the streets of Chennai with every bite.\n\nThe mutton biryani is a masterpiece – the meat is cooked to perfection, tender and flavorful, while the biryani itself is light and aromatic, with spices balanced just right. It's so good, you'll find yourself going back for seconds (or thirds!).\n\nBut the delights don't stop there. The fish fry that accompanies the biryani is simply outstanding, crispy on the outside and juicy on the inside. And don't even get me started on the bread halwa – it's perfectly sweetened, making for a delightful end to the meal. The brinjal gravy is a perfect match for the biryani, adding an extra layer of flavor that ties everything together beautifully.\n\nWhat truly sets Kumari’s VEETU BIRYANI apart is their commitment to quality and service. The food is always on time and served with a smile, making every dining experience a pleasure. And the best part? It's all budget-friendly, so you can enjoy a feast without breaking the bank.\n\nI wholeheartedly recommend Kumari’s VEETU BIRYANI to anyone looking for a taste of home. Trust me, once you try it, you'll be a repeat customer just like me!",
      "time": 1733660429,
      "translated": false
    },
    {
      "author_name": "Flo Yeow",
      "author_url": "https://www.google.com/maps/contrib/101597484841229205770/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUCED0nHINoONtoIhYrg_037nt9gzG8G4ZOxJ3RLinEhCioWYU8hrs=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "This home-cooked dum biryani truly hits the spot! Made with a recipe from Chennai, it's the kind of comforting and flavorful meal that's perfect for enjoying at home.\n\nBoth the mutton and chicken biryani options are authentically prepared, with a fragrant blend of spices that will transport you straight to India. The accompanying brinjal curry, onion raita, and bread halwa complete the experience beautifully, making for a satisfying and well-rounded meal. Even the Chicken 65 included in the combo was delicious.\n\nHowever, while the food itself is wonderful, the overall experience falls short of a 5-star rating, particularly if you're opting for self-collection. The pick-up location is a bit out of the way, and their limited menu and logistical setup can be inconvenient. While I understand they're operating as a home-based business, the hassle involved in getting the food doesn't quite justify the price, even for authentic biryani.",
      "time": 1735484280,
      "translated": false
    },
    {
      "author_name": "Carl Jon",
      "author_url": "https://www.google.com/maps/contrib/112143363314779316826/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLhuYNCWY0SBeZnKXRENlU4FwdTwMtrTdtBRaSPwWY4-B_K_A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "This is my 2nd time buying from this home based seller. And as a foodie i must say this, their biryani is one of the best i’ve had. This time round i got the chicken biryani combo. It was good and above my expectations, however I still prefer their mutton option. Then again i prefer mutton biryani to chicken so my opinion may be biased. But take the chance and give them a shot. Its worth it.",
      "time": 1728823961,
      "translated": false
    },
    {
      "author_name": "vinmathi kannan",
      "author_url": "https://www.google.com/maps/contrib/106979275740438407679/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLzibhoQNwuTvDSJnRapZIZ4YYxkf_Ir4QnlBQmljwYWO0FPw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I recently tried Biryani from @Kumari's VEETU BIRYANI, and I’m thrilled to share my experience!\n\nThe biryani itself was a feast for the senses! Each bite was bursting with flavor, and the tender meat paired perfectly with the fragrant rice. I also loved how the spices were balanced; it was flavorful without being overwhelming.\n\nI decided to try a couple of side dishes, and they did not disappoint. The raita was incredibly refreshing, complementing the biryani beautifully, while the crispy Chicken 65 were the perfect appetizer – which is tasty as like made in home.\n\nWhat really stood out was the presentation – the dish was vibrant and colorful, topped with fresh herbs that added a lovely touch. The portion sizes were generous, making it excellent value for money.\n\nIf you're a biryani lover or just looking to try something new, I highly recommend @Kumari's VEETU BIRYANI. I can’t wait to return for another delicious meal!\n\nOverall, @Kumari's VEETU BIRYANI exceeded my expectations!",
      "time": 1730519053,
      "translated": false
    },
    {
      "author_name": "CL Teo",
      "author_url": "https://www.google.com/maps/contrib/102535170759412154877/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVYlEvpHheDngelDoDhmuSgAC5nJkL8piQfQuL1LL_Nof5cGPkhvw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Chanced upon Kumari's one night before my errands' day near his area & decided to try my luck to check if he still had available set for purchase. Bless him to accommodate to my last min request. So swift in his replies & didn't had to place deposit for the order. My mum picked up the Chicken 65 from my lunch & said it was delicious too! Can't thank you enough & the everything was definitely soooo good! Will be back to try mutton 😁",
      "time": 1733375896,
      "translated": false
    }
  ],
  "types": [
    "meal_takeaway",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2507880117654199609",
  "user_ratings_total": 289,
  "vicinity": "113B Alkaff Crescent, #03-06 Alkaff Oasis"
}