{
  "formatted_address": "59 New Upper Changi Rd, Singapore 461059",
  "geometry": {
    "location": {
      "lat": 1.3240631,
      "lng": 103.9406743
    },
    "viewport": {
      "northeast": {
        "lat": 1.325297030291502,
        "lng": 103.9419710802915
      },
      "southwest": {
        "lat": 1.322599069708498,
        "lng": 103.9392731197085
      }
    }
  },
  "name": "Lai Kee Pau & Dim Sum - New Upper Changi",
  "place_id": "ChIJCaUhYAAj2jERVapXJkAko58",
  "rating": 3.6,
  "reviews": [
    {
      "author_name": "MsOmNom",
      "author_url": "https://www.google.com/maps/contrib/112478801214182052307/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW5Opn7jQzSDSRXXPnHGjf5zS2xLzPdlIC5czq9fQxJOuFG9XSR=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "Lai Kee Handmade Pau & Dim Sum - An Underrated Gem for Dim Sum Lovers\n\nIf you're on the hunt for fairly good dim sum that doesn't break the bank, Lai Kee Handmade Pau & Dim Sum should be on your list. This underrated gem offers a wide variety of dim sum dishes and is gaining a reputation in the neighbourhood for its delicious food, excellent value, and friendly service.\n\nVariety and Value\n\nLai Kee offers a wide range of options aside from the classic dim sum, they also offer other variety. Which is impressive, especially for such an affordable spot. Aside from the usual suspects like har kao, xiao long bao, chee cheong fun and siu jing bao, you can also find a selection of steamed rice bowls featuring pork ribs, chicken with mushrooms, and other hearty options. The sheer variety ensures there's something for everyone, whether you're a dim sum connoisseur or just looking for a satisfying meal.\n\nQuality and Taste\n\nThe taste is pretty solid considering that they are a heartland kopitiam (coffee shop), hitting all the right notes for a good dim sum experience, even better than some of the dim sums I've had at some 5 star hotel breakfasts. The har kao (shrimp dumplings) are plump and juicy, with a wrapper that doesn't fall apart. The xiao long bao (soup dumplings) are flavorful and contain a bit of soup inside. The little jiǔ cài siu jing bao (chive dumplings) are plump and generously filled with chives. The steamed rice bowls are also a highlight, with tender meat and well-seasoned sauces.\n\nService and Atmosphere\n\nOne thing that stands out about Lai Kee is the friendly and attentive service. The staff are always ready to help with recommendations and ensure your dining experience is enjoyable. Despite the relaxed and casual atmosphere, they don't skimp on the customer service, making you feel welcome every time you visit.\n\nOverall Recommendation\n\nLai Kee Handmade Pau & Dim Sum is a fantastic spot for anyone looking to enjoy delicious dim sum without the high price tag of more established restaurants and eateries. Whether you're going for a quick lunch, a weekend brunch, or a casual snack, Lai Kee delivers on both taste and value. If you're a fan of dim sum or just looking to try something new, this place is definitely worth checking out. Given the variety, taste, and friendly service, it's no wonder I've become a regular customer.\n\nNext time you're craving dim sum without breaking the bank, skip the fancy spots and head to Lai Kee. It's definately worth a try.",
      "time": 1715948101,
      "translated": false
    },
    {
      "author_name": "Z Y",
      "author_url": "https://www.google.com/maps/contrib/103093195558273147765/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU8s78bxXcm5i_Yil1Yw04tWxn4sxvpDr3Z-6A84peWtxefvax5Aw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "How food should not be. This outlet joins the skimpy bandwagon to \"produce\" uninspiring and low-quality dimsum.\n\nFried dishes are especially bad. Pre-packaged, cold, stiff, and only cheap sweet-or-garlic chilli sauce condiment",
      "time": 1710567129,
      "translated": false
    },
    {
      "author_name": "Dr. V (Dr Ghib)",
      "author_url": "https://www.google.com/maps/contrib/107383177799977353360/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVUOjqIbJgsiAkd4VGpNVdDLNL1hkDlphGmQg3PfccwIdOS6ycq=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "Absolutely phenomenal, this place! Each dumpling tastes like magic, even for an angmoh like me. It's a real gem and a bargain compared to Ding Tai Fong. I’m quite picky with flavours, but this spot hits all the right notes for me. Highly recommend!",
      "time": 1713776198,
      "translated": false
    },
    {
      "author_name": "John Tango",
      "author_url": "https://www.google.com/maps/contrib/117082529878868496412/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXQ4AhMqnkKdC02onsOqMEKkVAO-J27jkLRroisKjrYuZkud3tjGg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "Good service with a good variety of dim sim items. Pricing reasonable. Staff is engaging & helpful.\n\nWill be back to try more.",
      "time": 1710199089,
      "translated": false
    },
    {
      "author_name": "Chen Wan Ting",
      "author_url": "https://www.google.com/maps/contrib/104695222678202776376/reviews",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIuwtwq5p-zkhrwQbv_LjVBN2_Rn6rwRJ5_eCScXkjD--OXUg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "",
      "time": 1736968929,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "store",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11503077731174165077",
  "user_ratings_total": 5,
  "vicinity": "59 New Upper Changi Road"
}