{
  "formatted_address": "Choa Chu Kang Ave 4, Block 429A, Singapore 681429",
  "geometry": {
    "location": {
      "lat": 1.3833279,
      "lng": 103.7405924
    },
    "viewport": {
      "northeast": {
        "lat": 1.384570080291502,
        "lng": 103.7418182302915
      },
      "southwest": {
        "lat": 1.381872119708498,
        "lng": 103.7391202697085
      }
    }
  },
  "name": "Le Da Chicken Rice 乐达鸡饭",
  "place_id": "ChIJiQvWZwAR2jERpAiQSjT-oVw",
  "rating": 2.3,
  "reviews": [
    {
      "author_name": "Daisaac Nyk",
      "author_url": "https://www.google.com/maps/contrib/108849700277134844636/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJkqMopU-zKpa4AlkMoUF_IO4Ujvtbdg319mPRNtMyKhhUP3w=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Had roast chicken drumstick rice w braised egg and char siew ($6.80). All are good and tasty! Chilli was on the thicker side and might not be spicy enough for some. But it was good still.\n\nSaw past bad reviews but I do not understand. I wasn't treated w bad attitude. The young man in there (w a left ear stud, I think) was fine, attentive, and he looked kind. Nothing rude at all.\n\nGive the stall another chance for those who have been shunning it due to past bad impressions or outdated reviews.",
      "time": 1738816776,
      "translated": false
    },
    {
      "author_name": "Ember Shen",
      "author_url": "https://www.google.com/maps/contrib/117465885711011307889/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUTDsusnetYbY0hLczH1lIOHCatqSOTs-gwxdOqaEw5c2XKknU=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "The uncle has a bad attitude.\n1. I told him i want 双拼 noodles. He complained that i never say what ingredients i want. Ok, then just ask me, dont complain\n\nBut the char siew pork belly noodles is so good. I have to go back again\n\nThe curry chicken noodles is good too, generous portion of tau pok\n\nThis is my new favourite chicken rice place in cck.\n\nPros: part of the $3 dbs paylah cashback hawker. I came at 7.39am as i fear 8am would be too late. The soup is also some hearty goodness, not just leftover salt water like other chicken rice stalls.\n\nThey also have a meal at $3.50, so i submitted the info on Crowdsource for Budget meal go where\n\nThe star of the meal is the rice. Fragrant. The chicken pieces will be little for the $3.50 option though 🤣",
      "time": 1735350376,
      "translated": false
    },
    {
      "author_name": "Weijie Ong",
      "author_url": "https://www.google.com/maps/contrib/103363327623034179213/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJPKd_rX-wyTkjFM2eNvkNQpBPPBOOpEpFzE86hh-Wr46JA1g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Don’t know what’s up with the other reviews but the chicken rice here is super solid. Previous chicken rice stores that were at this outlet all closed until this popped up, they even provide soup and a special green sauce to go along with my chicken rice. Superb char siew and roasted pork too, a must order on the side",
      "time": 1731234916,
      "translated": false
    },
    {
      "author_name": "Kirstin",
      "author_url": "https://www.google.com/maps/contrib/112193022901766889001/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVrn7x--SFjg1UqxuxANsENFL70_MNVh3Ot9sSyR7JP5dzGgbOAHA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "9 months ago",
      "text": "Beware of this chicken rice place at all costs! As what other reviewers had mentioned, store holders are utterly dishonest. When placing an order of a small chicken rice at 3.50, seller had the audacity to charge you the higher price of 4.50.\n\nChicken rice was one of the worse I've ever tasted. Think mushy, bland rice with no soy or sesame oil fragrance/ taste paired with powdery chicken breast, accompanied with unfresh chili sauce.\n\nIf there was an award for worst chicken rice in the island, this would be it. Avoid at all costs.",
      "time": 1722426427,
      "translated": false
    },
    {
      "author_name": "J",
      "author_url": "https://www.google.com/maps/contrib/113966954151240288230/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXgl7XEvYTh_ONFtwf2-GP2b3GcV0_clXthy_UtK3NV2ATn81DzLg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Food is not bad but I would only like to comment on their sales practice. I would consider it dishonest because their staff would always try to \"upsell\" you on the dishes.\n\nToday, we told the staff we would like 2 plates of chicken rice, add char siew. The guy behind the counter said ok they will make chicken rice for 2 and add a plate of char siew. Technically he is not wrong but the change in combinations turned 2 plates of $5.50 (total $11) into $17. An additional $6. On top of that, the staff kept trying to push additional side dishes to us like gizzards and eggs when they are well aware that it’s already too much food for us.\n\nIn the end, we got 2 rice, 1 huge plate of chicken breast meat and a plate of char siew. The chicken breast meat is enough for 3 pax. We couldn't finish the food.\n\nI remembered pre-COVID I had to specifically explain in detail my orders so that the staff could not \"misinterprete\" it. I guess after 3 years, they are still using the same practice since the staff have already changed.\n\nI wouldn't recommend coming here especially if you're in a big group. You'll end up overordering. But know that its not your fault.\nIf you have the time, check out the Google Reviews on the other brances. Several have highlighted the same dishonest practice.\n\nTip: if you really wanna patronize them, study the menu and listen very carefully to the staff when they repeat your order.",
      "time": 1709827495,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6674895623282493604",
  "user_ratings_total": 12,
  "vicinity": "Choa Chu Kang Avenue 4, Block 429A"
}