{
  "formatted_address": "15 Swan Lake Ave, Opera Estate, Singapore 455711",
  "geometry": {
    "location": {
      "lat": 1.3212661,
      "lng": 103.9241436
    },
    "viewport": {
      "northeast": {
        "lat": 1.322472380291502,
        "lng": 103.9255785302915
      },
      "southwest": {
        "lat": 1.319774419708498,
        "lng": 103.9228805697085
      }
    }
  },
  "name": "Le Petit Paris",
  "place_id": "ChIJAeR-m0Qj2jERuoyabEUhbHI",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Maureen Thomson",
      "author_url": "https://www.google.com/maps/contrib/117291052441663319431/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLPvDLhcwpwDlXjOh_MKWFLjHt9JNmyKqac8185GScbSuF1GtA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We found this place by chance as we looked to try a different French restaurant. The wait staff were incredibly welcoming and efficient. The food was delicious and brought when we were ready. The smoked pork belly was devine, foie gras and desserts delicious. A fabulous personal touch by the chef as he greeted all the guests and chatted. We will definitely come back.",
      "time": 1744981994,
      "translated": false
    },
    {
      "author_name": "Marie K",
      "author_url": "https://www.google.com/maps/contrib/108093104899567342594/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWaQe6QB9YhkHILl7fWa_1GbLop8GgtRpr5mZlpjcqMed1k2Ah87A=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "if you can’t already tell from the various pictures, my family and friends are regulars here- and there’s a reason we keep coming back!\n\nwe often come here for brunch because it’s in our neighbourhood and the food is simply delicious! all the pastries are fresh and so comforting, my family also really likes their eggs benedict and big breakfast!\n\nwe also come for dinner to celebrate special events, because we love the food so much haha. every single dish on the menu is delicious so you really can’t go wrong, but my personal favourite has to be the smoked pork belly.\n\ntheir desserts are also super nice! the chefs specialty cakes under the counter are super unique and unlike any dessert i’ve ever tried (my brother is currently on a mini quest to try them all 😂) and i love their gelato 😋😋\n\nalso the ambience and general vibes are so nice and chill. the interior is super pretty and cosy and the staff are so friendly, and they give the best recommendations! if you’re ever unsure what to order just ask them and you can’t go wrong haha. the chef is also super friendly and often comes out to chat!\n\noverall, easily once of the best cafes in sg (and i’ve been to a lot) never had a bad dish or experience here!",
      "time": 1746242535,
      "translated": false
    },
    {
      "author_name": "wanz",
      "author_url": "https://www.google.com/maps/contrib/114627786041186937710/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLLSn71woDqE-cEgVXzqlJvpwyCDh4Sn61sO2R2C7ndydhHxQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Been here twice and will definitely be back. Highly recommend the smoked pork belly - it was so tender and melt-in-your-mouth with all the right flavours.\n\nWe also ordered salmon mosaic, duct confit and ratatouille. Everything was perfect.\n\nWe ended our meal with a banana bergamote cake made by Chef Felicien Cueff himself. It was delicious, refreshing, light and hit the right spot.\n\nI always had the impressionable French food was inaccessible around here but am so lucky to have found Le Petit Paris by chance tucked in a corner of Siglap at very reasonable prices.\n\nAnd the service was fast and excellent - very friendly, attentive and approachable staff, including Chef himself.\n\nThanks again for having us :-)",
      "time": 1742045388,
      "translated": false
    },
    {
      "author_name": "Chang Xian Tham",
      "author_url": "https://www.google.com/maps/contrib/104338661189095898016/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKRPfWXu0o4OiZ5_7xhXnqm1WrJUnKCvT89yx30lkHN2pAnzg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "An excellent French restaurant in a quiet location. The lamb chops were to die for, the pork belly succulent and flavourful. Service was good and attentive, and chef came out to check on the food too. Will definitely come back again.",
      "time": 1743332942,
      "translated": false
    },
    {
      "author_name": "Hui Qing Whye",
      "author_url": "https://www.google.com/maps/contrib/108878916779249494376/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLH-mqVLk-eJTH_xcBpXBKgb3ryZY6HyUg8sBJ6Q-B6fZzQEQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "I visited Le Petit Paris a week ago to celebrate my birthday, and it was a truly memorable experience. The service was excellent—friendly, attentive, and thoughtful. They even surprised me with a special birthday celebration, which made the evening feel extra unique and personal.\n\nThe food was fantastic! The air-flown oysters were incredibly fresh, plump, and briny. We also tried the foie gras, duck confit, and seafood spaghetti marinara—each dish was well-executed and full of flavour. I’d highly recommend all three if you’re visiting for the first time.\n\nFor dessert, I especially enjoyed the pistachio ice cream—smooth, creamy, and rich with authentic pistachio flavour.\n\nOverall, a wonderful dining experience, ideal for special occasions. Highly recommended.",
      "time": 1746813508,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "bakery",
    "restaurant",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8245001599867063482",
  "user_ratings_total": 866,
  "vicinity": "15 Swan Lake Avenue, Opera Estate"
}