{
  "formatted_address": "Watertown Condominium, Singapore 828755",
  "geometry": {
    "location": {
      "lat": 1.4063405,
      "lng": 103.9021081
    },
    "viewport": {
      "northeast": {
        "lat": 1.407453930291502,
        "lng": 103.9034180802915
      },
      "southwest": {
        "lat": 1.404755969708498,
        "lng": 103.9007201197085
      }
    }
  },
  "name": "Learn Piano Lesson - Min Min Tay (Singapore)",
  "place_id": "ChIJhaLP1RwX2jERa7HBbLIidV0",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Jerry Jiewei Liew",
      "author_url": "https://www.google.com/maps/contrib/102161170479813745778/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL5bUHlAU9vtxXLalFPDNg3DMTQDnGAjO7SHgXvq77LMKFj4A=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Had a chance to work with Min Min recently. From the few sessions of interactions with her, can tell she's really passionate about music and what she do. Rare to find such gems in the music industry :) Speak to her to see if for yourself too! Thanks Min Min!",
      "time": 1706759807,
      "translated": false
    },
    {
      "author_name": "xiaoming yin",
      "author_url": "https://www.google.com/maps/contrib/103579837925079640696/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX5-7gfZVVw4lvP-qcSFR922N2cK5eLHHF4JTnOUp4OPhlnu22pMA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "My son has been learning from Min Min since year 2012 at age 10. He has advanced so much in term of technicality, musicality in piano playing and knowledge in music theory.\n\nMin Min is a very patient teacher with strong background, she is very good at adapting teaching method to each individual's capacity of learning but also challenging them to improve. She plans the course well in advance in anticipating for piano exams so that the student will have time to go through a few rounds of simulated exam just before the real ones.\n\nI will definitely recommend Min Min to other parents or students who are planning to start their journey for learning piano!",
      "time": 1572580954,
      "translated": false
    },
    {
      "author_name": "Destiny See",
      "author_url": "https://www.google.com/maps/contrib/108841342710900646913/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLt9BXezHP4qLSZW7QP2Rli99g1Sk7wgKxpKz478zAonW6nzQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "I’m an adult learner and I’ve been doing my piano diploma with Ms Tay since 2019. Ms Tay is a very patient and caring piano teacher and I look forward to my piano lessons with her every week. Being a skilful musician, she is able to demonstrate how the different pieces should be played and expressed. And I like how she provides examples & analogy to help me better understand how the pieces should be played or expressed. She is also very clear in explaining the music concepts and provides scaffolding so that i don’t feel overwhelmed with the pieces. More importantly, she looks after the well-being of her students and goes out of her way to know her students so that music lessons are comfortable and enjoyable. Am blessed to have her as my piano teacher!",
      "time": 1634975237,
      "translated": false
    },
    {
      "author_name": "Lim Kang Ying",
      "author_url": "https://www.google.com/maps/contrib/114260846252888713892/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX6refseygUTW1wB3yIJm6eNjv37_TvTwGzlYc5oWKtJPmT9d_i=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "I have been learning piano from Ms Tay since I was 6. She is very responsible, making sure that we were all very well informed about when our lessons were and when we would have our breaks. She always strives to improve her teaching skills, for example, being more patient since she first taught me, and being more understanding and easy to understand. Her lessons are well planned out, and she always reminds me on what to take note of when learning a new piece, like the ornaments, or like the accidentals. Furthermore, as she is very experienced, she knows that sight reading and finger exercises are very important, which is why she takes the time to keep reminding me to do so, as I often am not self motivated to help myself. All in all, Ms Tay is a great teacher.",
      "time": 1572342937,
      "translated": false
    },
    {
      "author_name": "erika",
      "author_url": "https://www.google.com/maps/contrib/117650313701333136488/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLhof4E73Jn5J6qCwpy94NRFCIx-N-cM8X1mf1HA-Sknf0-3w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "I came to Ms Tay when I wanted to do my diploma and have been under Ms Tay’s teaching for a few years. Ms Tay has been shaping my musicality and technique ever since and under her teaching, I’ve learnt so much from engaging an audience to music analysis. She’s not only helped me in graded exams and O Level Higher Music recitals, but also has been giving me life advices; something I’ll forever be thankful for :)\n\nThe thing I really love about her teaching is that she doesn't make you feel bad about your mistakes. She’s really there to help you move forward with her supportive gusto. We always laugh together when I make a bad/awkward move, and progress from there. She helps me figure out what the pieces mean to her and what they could mean to me\n\nMs Tay is a truly talented and knowledgeable musician (thank you for making my Wednesday classes the best Ms Tay!!!) I recommend her to all pianists, especially those looking for advanced piano lessons, as well as increasing their piano knowledge!",
      "time": 1572520085,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "school",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6734326967526601067",
  "user_ratings_total": 11,
  "vicinity": "Watertown Condominium"
}