{
  "formatted_address": "15 Pasir Ris Way, Singapore 518531",
  "geometry": {
    "location": {
      "lat": 1.3812703,
      "lng": 103.9457203
    },
    "viewport": {
      "northeast": {
        "lat": 1.382621930291502,
        "lng": 103.9471397802915
      },
      "southwest": {
        "lat": 1.379923969708498,
        "lng": 103.9444418197085
      }
    }
  },
  "name": "Learning Adventure Preschool @ Pasir Ris",
  "place_id": "ChIJg1_olCo92jERAhEjKgkKZ9s",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Jane Chia",
      "author_url": "https://www.google.com/maps/contrib/101323514694204743206/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVEDkFSFRyLZCOEq6vYF8EY77rwh9_ZgH4hIoPcwMrB3H3o2l-H=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "My son is now 10m and has started attending LAP since he turned 5m. Ever since he started attending the infant care, he has shown tremendous progress in motor skills, speech, and openness to trying new things/meeting new people. I can also tell that he truly enjoys going to school as he shows excitement and happiness. This is an indication to me that the teachers take care of him very well! Charlene, the principal, provides prompt updates and demonstrates responsibility. I also want to commend the teachers for always putting on a smile and greeting my son enthusiastically every morning. They put in a lot of effort for the curriculum with arts & craft, water play, and celebration of the different festivals. See photo for the effort they put into decorating for CNY (there’s loads more in the center). Thank you to all the staff at LAP for making me feel safe and assured for placing my son in your trusty hands! :)",
      "time": 1649046935,
      "translated": false
    },
    {
      "author_name": "Alex Tan",
      "author_url": "https://www.google.com/maps/contrib/115428165020020247346/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIKc8Y3Co9WNN2zqUYS8dHedRkIMbvhEKoKRy32kL-QruvWQA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My daughters are currently in N1, they attended LAP since Infant Care. And my wife and I are very pleased with how the teachers engaged with the children and are very loving to them.\nTheir curriculum and dietary plans are well thought of and my children do show growth both in motor skills and language development!\nIt is also evident that the kids are in good loving hands when we see them so happy at school and are willing and excited to go to school everyday!",
      "time": 1689948504,
      "translated": false
    },
    {
      "author_name": "akai koh",
      "author_url": "https://www.google.com/maps/contrib/105298308224899129185/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKQHXnQUvabaJjqfC66lDljkVsJfHnWbNpnbF5lVEajs46DcQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My son has attended LAP for close to three years now since he’s was 6 months old. He absolutely loves the school and the teachers! His teachers are a great encouragement and the learning program is good. Though it is a small school, it allows for a lower student to teacher ratio, giving children more confidence, engage in group activities, and opportunities for one-on-one time with the teachers.\n\nOverall, it’s a great team and a great school!",
      "time": 1689595856,
      "translated": false
    },
    {
      "author_name": "Seri Shimohara",
      "author_url": "https://www.google.com/maps/contrib/117095297868684352378/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLCFXOfYqtxwrf1t2DwDZc6jLZ8kmx8mGFG1fPXrUE-M7u80w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My daughter has been attending LAP for over a year since N1. Her reading, writing, and conversational abilities have improved significantly. It's a small-scale school, so they have a friendly and homely atmosphere, and she gets along well with anyone in her school life. They have regular field trips where children can make new discoveries and experiences, and children seem to be having a lot of fun. Additionally, they organize events like sports day and Mother's Day, where parents can participate, allowing us to actually see how our children are doing at school and create opportunities for parent-child communication. The principal always responds promptly, and I can consult with them right away if there's anything I need, so I feel at ease leaving my child in their care. I am grateful to the principal and all the teachers at LAP.",
      "time": 1689778354,
      "translated": false
    },
    {
      "author_name": "Kim Koh",
      "author_url": "https://www.google.com/maps/contrib/116943634866247938009/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKCFjB-WJ9NR3LJv0jtN_zK0rorWnj5-49a1WZ2i1RC318ZEQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My child has been with LAP for several years, having joined at the playgroup level. LAP’s teachers continuously strive to deliver an all-rounded education to the children, and their warm and nurturing approach have greatly helped the development of my child’s motor, cognitive and emotional skills and knowledge in the academic subjects. The teachers also spare no effort to offer a variety of interesting and engaging learning activities for the children, and take time to share meaningful updates with parents. As a result, my child enjoys and looks forward to attending school at LAP, having built close bonds with the teachers and fellow children at school. My sincere appreciation to the principal, Charlene, and the team of teachers at LAP for their strong commitment to work closely with all parents to best support the children.",
      "time": 1690816533,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15809616051385340162",
  "user_ratings_total": 31,
  "vicinity": "15 Pasir Ris Way"
}