{
  "formatted_address": "8 Marina Blvd, #33 - 01 Tower 1, Singapore 018981",
  "geometry": {
    "location": {
      "lat": 1.2802436,
      "lng": 103.8541594
    },
    "viewport": {
      "northeast": {
        "lat": 1.281466030291502,
        "lng": 103.8553774802915
      },
      "southwest": {
        "lat": 1.278768069708498,
        "lng": 103.8526795197085
      }
    }
  },
  "name": "LeVeL33",
  "place_id": "ChIJuVSo3A8Z2jERPTOqcYWM9i4",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Redwan Rahmat",
      "author_url": "https://www.google.com/maps/contrib/116109231522237376506/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUH8Qf_gogr3481MqxVK2mkFQ8gjMSzP3aUa8bgyG4bHpDrZs4=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "We had a delightful anniversary dinner at LeVeL33.  Luckily, we were able to observe a practice session for the national day fireworks.\n\nThe wait staff were most helpful, and graciously accommodated our reservation despite our slight delay.\n\nThey suggested some exceptional dishes, and were very thoughtful regarding our dietary needs. The food was superb. I thoroughly enjoyed my steak and my wife found her fish delicious.\n\nThe view from the terrace is breathtaking. I can envision that during the National Day or New Year's fireworks, this would be a perfect location.\n\nWe were fortunate enough to witness the fireworks for a considerable time, as well as a flypast of military aircraft in close proximity.\n\nAll in all, a great experience, well worth the advance reservation and the price.",
      "time": 1742420697,
      "translated": false
    },
    {
      "author_name": "Hankinsonholidays",
      "author_url": "https://www.google.com/maps/contrib/110316767631706390154/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWFVRd9WKwireIRPVv144H0pgYJ8z2DKMDZDJLCxfyYUkr2w2E=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Came here to celebrate my birthday and it did not disappoint. We mainly went here for the view so we're really pleased that the food was just as amazing as the views. We had tomato salad to start which was really tasty. Followed by steak which was cooked well. The cauliflower main was one of the best things I've ever eaten as a vegetarian. But the main star for us was the side of carrots which were spectacular, the photo does not do it justice. The views were amazing and got better and better as the night progressed. Service was brilliant, not too much , not too little! Thank you for a great way to spend my birthday.",
      "time": 1739673253,
      "translated": false
    },
    {
      "author_name": "Peace",
      "author_url": "https://www.google.com/maps/contrib/114931179946292454839/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXRRBhU08FAiqjOGecmZmMb8QMO6ZHVz2LQFf7DIBPDCKg3S-CY=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "A huge thank you to Allissa for making our day extra special! I had made a reservation for three without requesting any special arrangements. Noticing us taking photos, Allissa kindly asked if we were celebrating anything. When we mentioned it was one of our birthdays, she surprised us with a piece of cake—a truly thoughtful gesture. The food and service were excellent, and we will definitely be back!",
      "time": 1742891167,
      "translated": false
    },
    {
      "author_name": "Mela Salde",
      "author_url": "https://www.google.com/maps/contrib/110263532735576696661/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVTlkeeBtUyYAxaGTfiQ5RCRODblugKc3cs07zq8VlvTJhQ5KRb=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "If you’re looking for a date spot in the heart of Singapore’s CBD - leVel 33 is the place to go!\n\nWould like to start of by commending their service, one of the best I have experienced in Singapore. The servers really go above and beyond to ensure you have a wonderful time.\n\nBeer was great! I think they make it in-house? I’m not a very big beer drinker so we got the tasting paddle! 100ml per drink so it was manageable between 2 people.\n\nWas also pleasantly surprised for the quality of their food! (big meat eaters so we didn’t get much variety)\n\nBeyond their food and drinks, the views itself is the big selling point. Stunning views to see Singapore’s skyline + mbs. We went for an early dinner so we got to enjoy the day/night view",
      "time": 1745812824,
      "translated": false
    },
    {
      "author_name": "Sunny Simantov",
      "author_url": "https://www.google.com/maps/contrib/112277157820165191857/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUx2j21G4dkaG1ju7G2kXxnFaubxE-ZvSx3tkgpZb0fJgcUfffDmg=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Had a fantastic dinner here. Food and drinks were great,  I enjoyed the pork collar, along with a cocktail and a beer, although I was a bit disappointed by the salad.\nJust looking at the view is an experience on its own, breathtaking. The location itself is very chic, with a lovely atmosphere.\nStaff is professional and polite.\nReserved a table two days in advance.",
      "time": 1742854797,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3384046674781025085",
  "user_ratings_total": 3690,
  "vicinity": "8 Marina Boulevard, #33 - 01 Tower 1"
}