{
  "formatted_address": "Bedok Reservoir Rd, #01-3508 Block 703, Singapore 470703",
  "geometry": {
    "location": {
      "lat": 1.3371311,
      "lng": 103.920094
    },
    "viewport": {
      "northeast": {
        "lat": 1.338455930291502,
        "lng": 103.9214033302915
      },
      "southwest": {
        "lat": 1.335757969708498,
        "lng": 103.9187053697085
      }
    }
  },
  "name": "Light of Life Veterinary Clinic and Services",
  "place_id": "ChIJqa5Or1s92jERMR30h9UvhOg",
  "rating": 3.9,
  "reviews": [
    {
      "author_name": "Ven Siew",
      "author_url": "https://www.google.com/maps/contrib/107465417665828931864/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXj9G3LBKW4717WbmIKW7s2qf3W0F-h9mfsCI1wfjMPlFJq9COC=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "As first time cat owners, we visited them for regular check ups, and they ALWAYS patiently answered my 101 questions. When we faced an incredibly stressful and problematic situation, their team reassured us with their directness, tough love, compassion, and expertise, no sugarcoating, nothing of the sort. Thank you again for taking care of Juanito and our pockets.",
      "time": 1743499515,
      "translated": false
    },
    {
      "author_name": "Chloe Gan",
      "author_url": "https://www.google.com/maps/contrib/104168143337668848641/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVOmTtC2oYp7jUfDDVPvEbOqUorrGm8_T2pqCK9TVwjg-BRx-4=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "Light of Life has been our trusted veterinary care provider for over a decade, with both my previous dogs receiving exceptional care from Dr. Denise, Michelle, and her team. Hoping that our current fur kid will not be visiting them so often but they will definitely be our trusted choice. Their professionalism and genuine compassion have always been evident in every visit.\n\nWhenever we visit, I come with a list of questions, and Dr. Denise never fails to answer each one comprehensively and in a manner that's easy to understand. This level of attentiveness and clarity always leaves me feeling reassured about my pets' health.\n\nThe clinic operates by appointment only, which ensures each visit is unrushed and thorough. This allows Dr. Denise and her team to dedicate ample time to each patient, ensuring all concerns are addressed and explained in detail. They prioritize the well-being and strive to give the best possible care to each of them.\n\nIt’s disheartening to see their current Google review rating, as my experiences have been nothing but positive. I believe this might stem from their straightforward and honest approach, which some may find too direct. However, I personally appreciate Dr. Denise’s clear and professional demeanor. She addresses concerns head-on, provides thorough explanations, and ensures we understand every aspect of our pets' care\n\nI wholeheartedly trust Light of Life Veterinary Clinic with the care of my fur kid. Their dedication, professionalism, and genuine love for animals are truly commendable. They have earned my trust and gratitude.",
      "time": 1718379593,
      "translated": false
    },
    {
      "author_name": "Megan Remedios",
      "author_url": "https://www.google.com/maps/contrib/101359010119550661685/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV0BtvpuuVGbGuCVZW8-WUL8Usb-tzfL5tq1IS5daROWcI1Zl7n6g=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I started coming to LOL vets since 2015 and all the way to the 2025 (for the unfortunate demise of my cat).\n\nIn the 10 years there have been some shifts in the way the clinic operates. Initially pet owners were allowed in with their pet and after COVID, the protocols changed and now patients wait outside, while their animals are observed inside.\n\nI don't have too much of an issue with this arrangement but I can understand how some other pet owners may be frustrated by this. I was glad that I was still allowed in on the day that I had to put my cat down.\n\nThe rates here seem fair and I like that Dr Denise doesn't try and over diagnose your pet.\n\nThe service here is top notch. Dr Denise and her team are very attentive and caring.\n\nIt's upsetting that many seem to have had a bad experience here but I'll definitely be back if I do adopt another animal.",
      "time": 1740287136,
      "translated": false
    },
    {
      "author_name": "Peijun",
      "author_url": "https://www.google.com/maps/contrib/117126347658418748548/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUsJRuSmRhJsVutqfzHtetlDmx26AVTbtN0r_X_ohJhehceG7k=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "long-delayed review . Long story short, In 2011 while all the vets suggest to put a stray cat with a jaw dislodged i suppose to sleep. Dr Denise Ng did not give up and kept him for 2 weeks under observation. She slowly nursed him to health and carried out the operation. C17 is now fat & healthy(i supposed). I am still bringing my pets to her as i believe she will always recommend the best for them.:) ..keep up the good work Dr Denise & Team...:)",
      "time": 1626149016,
      "translated": false
    },
    {
      "author_name": "Zheng Kang",
      "author_url": "https://www.google.com/maps/contrib/110615497432250158038/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLlbZOd6vMvq8kd8SSGsi34OvpBbUKbfS5-C1Jak3FmOfxNFA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "Recently, my pet needed veterinary care, and we turned to Light of Life Veterinary Clinic and Services. While I wasn’t able to enter the clinic myself, I was thoroughly impressed by the care and attention my furry friend received.\n\nDr. Denise and her team are truly exceptional. Their expertise and genuine love for animals were evident in every interaction. They took the time to thoroughly examine my pet, also answering our questions with patience and thoroughness on the spot. They provided detailed explanations about the treatment options, demonstrating their commitment to the well-being of the animals and ensuring the best possible care.\n\nThe supporting staff were also fantastic. They were gentle and kind, ensuring my pet was comfortable and calm throughout the visit. Their teamwork and dedication are truly commendable.\n\nI was particularly impressed with the clinic's cleanliness and the state-of-the-art equipment, which I could see through their transparent updates. It’s obvious that they invest in the best facilities to provide top-notch care.\n\nReading that the current Google review rating is only 3.8/5 makes me sad because my experience was nothing short of excellent. I believe Light of Life Veterinary Clinic deserves a much higher rating. They are a team of passionate professionals who genuinely care about the animals they treat.\n\nIf you are looking for a veterinary clinic where your pet will receive compassionate and expert care, I highly recommend Light of Life Veterinary Clinic and Services.\n\nThank you, Light of Life team, for all that you do!",
      "time": 1718378155,
      "translated": false
    }
  ],
  "types": [
    "veterinary_care",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16754569107880549681",
  "user_ratings_total": 149,
  "vicinity": "Bedok Reservoir Road, #01-3508 Block 703"
}