{
  "formatted_address": "Havelock 2 #03-08, 2 Havelock Rd, Singapore 059763",
  "geometry": {
    "location": {
      "lat": 1.2870384,
      "lng": 103.8451052
    },
    "viewport": {
      "northeast": {
        "lat": 1.288226730291502,
        "lng": 103.8465796802915
      },
      "southwest": {
        "lat": 1.285528769708498,
        "lng": 103.8438817197085
      }
    }
  },
  "name": "Lionheart Studio",
  "place_id": "ChIJH7ompnUZ2jERVn0MlClcHgM",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Brenda Tan",
      "author_url": "https://www.google.com/maps/contrib/111791635774887601386/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI0APSIpSyyYhgvzOIfpvtLSJMLrhx6LmXEyqyjREDMZr7tnA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 years ago",
      "text": "Thank you Lionheart Studio for making our Team Building Event such a successful and meaningful one.\n\nWe, as a beginners, were quite ambitious. We wanted to paint based on one concept and it must relates to our department and company:\n\nConcept:\nWe are like a piece of jigsaw puzzle,\nand we need all to make the big picture.\nWithout one, we are incomplete…\nTogether we are unique!\n\nLionheart Studio was very patient towards our requirements. Their Creative Director, Jim work together with me, provide us with professional advice and suggestions and we came out with the final design for our masterpiece.\n\nOn the actual day, Jim had a briefing session for my team to prepare them for the painting session. He also arranged 3 of his staffs to guide us along the way.\n\nSharon, Lionheart Studio facilitator, was very helpful too. She specially arrange the Pre-discussion session for Me and Jim and also took care of us during the painting session. She also help  out to liaise with the caterer so that I can finished up my painting. And she even offered to heat up one of the food that we specially brought due to certain food allergy. (They don't have a microwave oven in the studio, she asked for help with their neighboring stall!) really appreciate her kind gesture!\n\nI am really glad that we have made the the right choice to select Lionheart Studio for our team building! Thank you once again Lionheart Studio!",
      "time": 1554197319,
      "translated": false
    },
    {
      "author_name": "J",
      "author_url": "https://www.google.com/maps/contrib/115130390337047112782/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXwaKV6rRBwh8JHel6g4eyk2BiJ2FKZORBdWrktyPq-iLOUv9G2=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "6 years ago",
      "text": "Participate as a volunteer @ LionHeart Studio, did painting with the elderlies.\n\nThis was a very cozy space, you can concentrate on doing your painting here.\nThe place is easy to find, just 5 minutes walk from Clark Quay MRT station.",
      "time": 1543024271,
      "translated": false
    },
    {
      "author_name": "R T",
      "author_url": "https://www.google.com/maps/contrib/114091916111220081861/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLcL6iI9phNbRnK_i13sr1DWWTK4mbC6_HBoWFCeERIf92Bbes3=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "A very fun and accessible art jam session for a beginner. The owner gave me and my friends generous advice and guidance.\n\nAs a beginner, l felt encouraged and empowered because l felt enriched with knowledge. The owner helped me to make sense of colours and painting tactics eg. blending, tones etc and styles eg. impressionist. I’m also more able to differentiate the difficulty level of paintings and choose ‘realistic’ levels of paintings to embark on. We were all quite happy with our paintings.\n\nAs the shop was closing, the owner also allowed us to make song requests. l requested for epic music and tada, my friends and l finished up our paintings.\n\nOverall, it was a great experience. l love an environment which is pleasant and nurturing - l will be back!",
      "time": 1582736621,
      "translated": false
    },
    {
      "author_name": "hui lin",
      "author_url": "https://www.google.com/maps/contrib/106480022826742135219/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW27uG_BQUXvnPdL9fYgJhlXq1EPv-Z0SO4lbquyBtAP4acp50a=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "This is our first time painting in a studio, and I have to say that it was an amazing experience! It is a cozy studio with a soothing ambience and refreshing environment, perfect for art lovers to unwind and let their creativity run free!\n\nThis art studio is not just for artists but also beginner-friendly. Jim, the owner of Lionheart is very experienced himself, and is able to give great advice for beginners who paint! It even has free flow drinks, which you can enjoy while you paint. It is also located just a few minutes away from Clarke Quay MRT so it was very convenient for us.",
      "time": 1582099968,
      "translated": false
    },
    {
      "author_name": "Vivian Wee",
      "author_url": "https://www.google.com/maps/contrib/103125238179129279709/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKTQ474wX3_Z7hNbqyckMUIIZg8CKjlAF1wHEYZAE5s6rwrkA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "A great way to celebrate birthday! spent quality time bonding over acrylic painting on canvas. Owner Jim was very encouraging and helped us work on our very first masterpieces. Location is accessible, environment is relaxing. Worth trying out!",
      "time": 1581046856,
      "translated": false
    }
  ],
  "types": [
    "art_gallery",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=224718365062364502",
  "user_ratings_total": 25,
  "vicinity": "Havelock 2 #03-08, 2 Havelock Road"
}