{
  "formatted_address": "21 Block, 1A Tampines Ave 1, #01-87 East Wing, Singapore 529757",
  "geometry": {
    "location": {
      "lat": 1.3449801,
      "lng": 103.9353948
    },
    "viewport": {
      "northeast": {
        "lat": 1.346295780291502,
        "lng": 103.9368328302915
      },
      "southwest": {
        "lat": 1.343597819708498,
        "lng": 103.9341348697085
      }
    }
  },
  "name": "Little Skool-House Temasek Polytechnic",
  "place_id": "ChIJt1XoF2o92jERG-Di6qRpZzU",
  "rating": 3,
  "reviews": [
    {
      "author_name": "Kaylyn",
      "author_url": "https://www.google.com/maps/contrib/100787838522961136275/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX3nSM1arawNCAlFcG15VZ6T9k4okAMr7khTLLMsxrT2uQxf6G2=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "Very poor customer service, i wanted to know more about the school because the child im enrolling has special needs hence i wanted a sit down conversation with the staff there, but the counter lady was very rude and even stopped me from opening the door. Just said a flat no and can register through website. Am very disappointed!!!!!",
      "time": 1745915374,
      "translated": false
    },
    {
      "author_name": "Melissa Kerri",
      "author_url": "https://www.google.com/maps/contrib/101124421895487611401/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIaW-Skc0HGazRZd23_0LKg8fDl14C5OUSb4sf3boJgBNAq2A=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "Placed my child on the school’s ECDA waitlist as well as contacted the school personally.  I was informed via email that vacancy priority will go to the children of Temasek Polytechnic’s staff which I fully concurred with, seeing that this school is located in the school‘s premise itself. Was told to fill up a form to be placed on the waitlist which I did, and there were no other exchange of emails. I emailed the school about 6 weeks later in the afternoon just to check roughly how many children are ahead of my boy in the waitlist, so as to have a better sense of whether I should continue waiting or perhaps commit to another school further away. Approximately one hour after sending the email, my husband forwarded to me a message notification stating that my child’s interest in little skool house at TP has been removed by the centre citing no vacancy. Naturally, I was appalled and was wondering what are the odds of this being a mere coincidence? I went back to my email wondering whether I have missed out any emails but nope, nothing was sent to me. I called the school and the principal Ivy answered. She told me it was a mere coincidence and that she herself was the one who amended the ECDA list and removed him. And I was told not to worry, as despite the fact that she personally removed him from the wait list, my child remained on their personal wait list and that once again, priority goes to TP staff but they’ll contact me again if there is any vacancies. This baffles me completely because it’s as good as telling me that HDB has removed us from the ballot list for a BTO house, but not to worry as they have a private list which we are supposedly still on. I told the principal that it  was a very simple question. We are all adults here. Even if you can’t answer due to privacy issues, there is no need to be so passive aggressive in your action. Say I buy your story that it was sheer coincidence. Can you tell me roughly where my child is on the waitlist? And as usual, I was reiterated that TP’s staff have priority, that she despite being the principal can’t give me an answer unless she opens another class, that she can’t reveal or say anything. I was disappointed nonetheless and hanged up the phone. After which I received 3 missed calls and an email from an admin stating that she will be on leave the next day and that she will contact me via email the following day. I responded to that email citing that a waitlist only serves to exist purely because there is no vacancy in the school isn’t it? Why remove my child from the waitlist after asking us to fill up a form to join the waitlist and then cite “no vacancy” as your reason for removal. Have all the other kids born in 2021 also been personally removed from your ECDA’s wait list (but still remained on your private wait list then)? Does it even make sense? And not surprisingly, I did not receive any email replies to my question following the staff’s one day leave. With such staffs, poor communication and questionable principal overlooking the school, there is no way I would ever trust my child to be left in their hands. Such passive aggressive action shouldn’t be coming from a preschool principal herself in a setting where I’m supposed to entrust that my child is going to be taught good values and virtues at. I won’t even go so far as to recommend this school to my enemy’s children. Should issues arise down the road, as a parent who am I supposed to turn to?\n\nEdited: I finally received an email reply from the school today (7 days later). On the evening of the morning that I posted this review. Sheer coincidence again? It’s anyone’s guess.",
      "time": 1672481271,
      "translated": false
    },
    {
      "author_name": "Vishal Pendharkar",
      "author_url": "https://www.google.com/maps/contrib/106587282851270444211/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXhChOk_mc680TaAMXlv_XedjBk8FNXpTl0_gbGxyBPSg4LxoK69Q=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "6 years ago",
      "text": "Nice childcare. Good staff and infrastructure",
      "time": 1543909195,
      "translated": false
    },
    {
      "author_name": "Eric Lim",
      "author_url": "https://www.google.com/maps/contrib/111316249400541962543/reviews",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXED8jdU-ylI9y451_l3IMabkj7R0c5FVcDmTEsPFZNzb_HSdmtmA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "",
      "time": 1705371488,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3848160563647668251",
  "user_ratings_total": 4,
  "vicinity": "21 Block, 1A Tampines Avenue 1, #01-87 East Wing"
}