{
  "formatted_address": "67 Lor Penchalak, Singapore 536290",
  "geometry": {
    "location": {
      "lat": 1.3458103,
      "lng": 103.8757578
    },
    "viewport": {
      "northeast": {
        "lat": 1.347261030291502,
        "lng": 103.8770667802915
      },
      "southwest": {
        "lat": 1.344563069708498,
        "lng": 103.8743688197085
      }
    }
  },
  "name": "Little Oxford Schoolhouse @ Bartley",
  "place_id": "ChIJqS8cuDwX2jERbBeVhi3LNJ0",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Elaine Lee",
      "author_url": "https://www.google.com/maps/contrib/112472687762922010002/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJQOll7V3zFoFvw_9IS7D5746U3nPJKT1RnzOm6BgTpOkuESw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "My 3 year old daughter enjoys Little Oxford Schoolhouse tremendously. The school's curriculum is very fun and beneficial for my daughter. After a few months of joining the school, I noted that my DD is able to string long sentences by herself. She also gets a lot of sun and physical activity with the outdoor playground and activities that the teachers organize. The teachers and staff are also very caring and nurturing; they also constantly give updates to the parents on activities in school (what the children learn in the week / month). With my DD at Little Oxford Schoolhouse, I am assured that she is getting a wholesome education and being well cared for!\n\nI will highly recommend Little Oxford Schoolhouse if you are currently looking for a preschool!",
      "time": 1648063845,
      "translated": false
    },
    {
      "author_name": "Sophie Guerin",
      "author_url": "https://www.google.com/maps/contrib/113578060943064368190/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUGkHzo6cknAOuKJLQWcLojftPBy6O2Nvq705gw5x8G1b5VaXE0=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "Wonderful school, excellent teachers and staff.  Little Oxford was the first school we enrolled our little girl in starting at 18mo. By the end of her first week she was asking when she could go back. The weekend was just too long!\n\nHer language and coordination blossomed at Little Oxford. She now uses “please” and “thank you” appropriately and uses appropriate greetings for adults and other children. She started to pick up Mandarin very quickly and can easily switch between basic English and Mandarin greeting and simple sayings.\n\nThank you, thank you to the wonderful team at Little Oxford!",
      "time": 1617164979,
      "translated": false
    },
    {
      "author_name": "Yi Hui Chin (Stephanie)",
      "author_url": "https://www.google.com/maps/contrib/102854251452007891819/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV-lfdxvangVosCJD7Qr2TjEuv-vZoqMyhDWJMhEB3V_YF9riZE=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Prior to registering to Little Oxford, we visited half a dozen other preschool in the vicinity. However, after careful consideration(environment, teacher student interaction, diseases handling, student teacher ratio and communications with parents etc), we went with Little Oxford. This was one of the best decision of our lives. Initially, we were quite worried on her adaptability to start school(never been to childcare before), however, with a week of conditioning prior to starting (joined her class for their outdoor activities) she gets to meet and familiarise with her teachers and classmates and that helps! The school provided daily updates for the first 2 weeks which puts our heart at ease looking at her smiles while participating in the activities. She settled down quickly and even asked to go to school during the weekends! We can feel how the environment is just so heartwarming and welcoming when all the teachers including principal greeted my Little Girl loudly by her name in the morning. Nothing can assure us more on our decision than her response on how she loves her teachers and friends and the enthusiasm of going to school every morning. Communication between school and parents are also adequate and prompt, done via the Little Family Room app. Thank you for such a holistic experience Little Oxford. ☺️",
      "time": 1683280894,
      "translated": false
    },
    {
      "author_name": "Ade",
      "author_url": "https://www.google.com/maps/contrib/101287735374767267223/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUDKrXj12T1s0-e6a_RwFBpKSchcklQpdLCw4gX-IHFqanSMEm4=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Choosing the right school to enrol our child in is never an easy decision to make. As a first-time mum 2 years back, I had all the concerns and worries you can think of. From whether my child will eat well, to what food will the school serve to wondering if he will sleep well and so on. We went for 13 school tours before deciding on Little Oxford. And the decision was made the moment we stepped in.\n\nCurriculum aside, as that was not one of our main areas of concern, the Little Oxford team did a wonderful job, not only in helping to settle our child into school life but also in helping us as parents to slowly let go and trust the school team.\n\nThe first day for us was during CoVid and only either one of us was allowed 2-3 hours for the first 3 days. Hence we relied a lot on updates from the school, which was offered to us at a more frequent rate than we expected. This was highly appreciated. The school staggers enrolment (till now), which makes settling in more manageable for both the teachers and children.\n\nMy first-born took a long time to stop crying at drop-off and his teachers knew that it was hard for my child and me when the crying starts. Shortly after drop-off, they'll voluntarily update me that he has stopped crying.\n\nFast forward 2 years later, our first-born has settled well. No more tears and only good memories + things to say about his days at school. Naturally, we started looking into his learning path. One of the outstanding things about the learning here is the use of mandarin. From our encounters, Little Oxford follows their bilingual commitment very closely. We hardly use mandarin at home so we didn't expect our child to know much, we relied a lot on the school. To our surprise, our son comes home speaking to us in mandarin and can identify many things in mandarin- thanks to his Chinese teacher.\n\nEvery day at school is a new day of success and learning for us. We are so grateful for the skills that our child has learnt, for the activities that the teachers put so much effort into planning and for the school updates.\n\nSending our love and sincere gratefulness to the whole Little Oxford @ Bartley team. Every teacher teaching different levels, seem to know every child in the school. It feels a bit more like a family, less like a regulated school. We look forward to our second-born's time with Little Oxford soon.\n\nThank you so much, especially to Ms Pooja, Teacher Imah and 何老师\nIt's the smallest things that make the biggest difference.",
      "time": 1684250900,
      "translated": false
    },
    {
      "author_name": "Alvin Lim",
      "author_url": "https://www.google.com/maps/contrib/102761337451782936207/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI0vKxlBgp35J8781GVmkhnN-sIDHizI6ptrdb8IKNCGKUAvGc=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My daughter enjoyed going to school at little oxford bartley, it's becausenwe had to move hence needed to change schools. Actually now that we are at another school do we realise how pampered we were at little oxford.  Simple things like constant updates and showering in school made all the difference.\n\nI would recommend anyone to give them a chance, our experience was nothing but wonderful.",
      "time": 1702300349,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11327902359135524716",
  "user_ratings_total": 11,
  "vicinity": "67 Lorong Penchalak"
}