{
  "formatted_address": "98 Farrer Rd, Singapore 259226",
  "geometry": {
    "location": {
      "lat": 1.319875,
      "lng": 103.8118615
    },
    "viewport": {
      "northeast": {
        "lat": 1.321277530291502,
        "lng": 103.8131542302915
      },
      "southwest": {
        "lat": 1.318579569708498,
        "lng": 103.8104562697085
      }
    }
  },
  "name": "Little Oaks Montessori Kindergarten",
  "place_id": "ChIJf-upoQUa2jERyiZWa1FyEFQ",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Karlenia Villasmil",
      "author_url": "https://www.google.com/maps/contrib/109587121259335578997/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWgmMcZjw8jUGwbO7fwLLFUNj5H-YEsqqX1YQBrycKRTFKKFeU=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Little Oaks has been a wonderful experience for my children. The teachers and staff are warm, caring, and dedicated to providing a nurturing environment that fosters social, emotional, and academic growth. The curriculum is engaging and age-appropriate, and the facilities are clean, safe, and well-maintained. My children have thrived here, making new friends and developing important skills that will serve them well in the years to come. I highly recommend this kindergarten to any family looking for a supportive and stimulating environment for their little ones.",
      "time": 1714039740,
      "translated": false
    },
    {
      "author_name": "D Cyrus",
      "author_url": "https://www.google.com/maps/contrib/109050011035309995024/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocImQRiwWkdvQdk-gvVWNFEzjZRTdAqahiJ9hZOm2fDy_uXqMg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "We have sent all our kids to Little Oaks. The staff/teachers have all been attentive and caring. Our kids always come home happy and love talking about their daily activities. They always look forward to go to school, and this confirmed with us that we made the right choice.\n\nLittle Oaks has helped to boost our kids confidence and encouraged them to explore their interests. This is one of the reasons why we chose a Montessori style preschool.\n\nThe teachers are all passionate about their job. You can feel it when you talk to them. The founder of the school, late Ms Felicia, left a wonder legacy that the school continues to uphold.\n\nWe are glad to be part of the Little Oaks family.",
      "time": 1715523969,
      "translated": false
    },
    {
      "author_name": "Arianna Claridge-Chang",
      "author_url": "https://www.google.com/maps/contrib/101521794068121935378/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUdPInZE0sC4Xe2_9almNyzN2gQCYy8EX9yiqYMG-zmzKpRFA9x=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Little Oaks has been such a beautiful second home for our daughter for the last 2+ years.\n\nThis school provides a remarkable foundation for early education with incredible role models in all the Little Oaks staff. They create such a fun, nurturing educational environment while never compromising on Montessori values and continue to shape intelligent, independent and curious minds in all their students.\n\nOur daughter was previously at a large, commercial daycare and she was miserable there so making the move to a more intimate and nurturing environment like Little Oaks was the best thing we did for her. I would give this 100+ stars if I could. The sense of community is a bonus for parents. I will be sending my son there once he is old enough. Love your work Little Oaks!",
      "time": 1715219179,
      "translated": false
    },
    {
      "author_name": "Katrina Ibaviosa",
      "author_url": "https://www.google.com/maps/contrib/109880924657661359166/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKeOLHTHuPM_xBdcTK12oH9Ykq_3zmTTqVyQAYEgxyMvcTpKw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Little Oaks is a gift that keeps on giving. We are so happy with how our daughter is blossoming into a bright, inquisitive, and well-rounded individual, and this is in no small part due to the warm and nurturing environment that Little Oaks provides. Big love to all the teachers and administrators who make their students feel loved, important, and looked after. Could not recommend this school enough.",
      "time": 1714021892,
      "translated": false
    },
    {
      "author_name": "AK",
      "author_url": "https://www.google.com/maps/contrib/116315626151139251352/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIjY1x_VDBJ_eKXzu6dkBBGkIPbNp3ICDu0d9380q7ElrLSOYw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My daughter attended Little Oaks for just over two years and I wish she had been able to stay longer. Thanks to Little Oaks, she had the opportunity to practice some of the important but often overlooked life skills that children of this age need to learn. The curriculum was truly enriching and engaging, expanding the students' minds while still allowing them to have fun, play and explore. The teachers all go above and beyond to make the children's school experience a joyful one. Could not recommend enough.",
      "time": 1713875960,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6057467192832042698",
  "user_ratings_total": 27,
  "vicinity": "98 Farrer Road"
}