{
  "formatted_address": "Punggol Pl, #02-816 Blk 274B, Singapore 822274",
  "geometry": {
    "location": {
      "lat": 1.4030918,
      "lng": 103.9030684
    },
    "viewport": {
      "northeast": {
        "lat": 1.404413880291502,
        "lng": 103.9044012302915
      },
      "southwest": {
        "lat": 1.401715919708498,
        "lng": 103.9017032697085
      }
    }
  },
  "name": "Little Mighty Me",
  "place_id": "ChIJ04Uk0uIV2jERByVjPC53oGQ",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Jennifer Lawrence",
      "author_url": "https://www.google.com/maps/contrib/108026899866727554868/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJYmyUuRMYAl0EkLsnKRaPy2FVdBVULB991VRrIXEPe-9Wc=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "We have been absolutely delighted with the infant care at Little Mighty Me. Over the past five months, we've seen tremendous improvement and remarkable growth in our child’s developmental milestones. The dedication and passion of the teachers in educating and nurturing our infant have been truly outstanding.\n\nThe school provides a wealth of daily activities that keep our child engaged and stimulated. Each week, we receive photos through the app that showcase these wonderful activities, allowing us to share in our child’s experiences and progress. Additionally, the app keeps us informed about our child’s daily routines, including feeding, napping, and diaper changes, which provides us with great peace of mind.\n\nThe teachers are exceptionally communicative, promptly notifying us of any concerns and providing their observations during drop-off and pick-up times. As first-time parents, we greatly appreciated the invaluable advice and guidance they have given us. The strong teamwork established between us and the teachers has been instrumental in our child’s development.\n\nWe are also impressed with the school’s commitment to hygiene, the small teacher-to-infant ratio, and the nutritious meals provided. The variety of toys and activities available supports our child’s developmental needs wonderfully.\n\nOverall, we are extremely happy and satisfied with our decision to enroll our infant in Little Mighty Me. We highly recommend this school to any parent looking for exceptional infant care.\n\n----------------------------------------------------------------------------------------------------\nUpdate:\nWe would like to express our heartfelt thanks to Ms Gen and Huang Laoshi for their dedication, effort, love, and genuine care in guiding our child throughout the infant journey.\n\nOur little one is now transitioning smoothly to the playgroup.\n\nTheir commitment to each child's well-being and development truly shines, and we couldn't have asked for better teachers.\n\nThey deserve the Best Teacher Award! Highly recommended!",
      "time": 1738634816,
      "translated": false
    },
    {
      "author_name": "Melissa Kooi",
      "author_url": "https://www.google.com/maps/contrib/111903701766587866342/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXJdzHdHF36uQSfnVYxRTvJlzAugEnppJr2Dv5puOVtKM__7vY=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "I am glad to have found Little Mighty Me in 2020 to enrol my son in a playgroup. The attention he gets from school and the feedback from teachers matters that he was able to get the help he needed at an early stage. I am also thankful to the teachers in the school for planning activities for the children – the various outdoor activities that help them to be more street-smart and independent.\n\nMy son loves and enjoys going to school at Little Mighty Me.",
      "time": 1729493245,
      "translated": false
    },
    {
      "author_name": "Cutiepie 94",
      "author_url": "https://www.google.com/maps/contrib/101441544172387374054/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJtmiPZFgDXg8rQ-wh3nhv5W6tVXB1ihmBpP8ljNAmyZbOcVQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "The infant care teachers are very friendly and caring. They understands my needs and give helpful advice as well. My son manage to adapt to school in just one week and love to go to school to play with his friends and teachers. There are various engaging activities for the infants to play and learn with. My son look so lively and happy in the photos taken during those activities. I am very glad i picked Little Mighty Me as place for my baby boy to go.",
      "time": 1725422743,
      "translated": false
    },
    {
      "author_name": "Arundhati Kulkarni",
      "author_url": "https://www.google.com/maps/contrib/107824632354891163883/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJyCLDLxjRpbRMVbhLyPpgkrWmd1Pr10Skof4U8Eej3SnVnYA=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "5 months ago",
      "text": "For the past 3 years LMM has been another home. Home for my COVID born now 4 year old. Given separation anxiety kids have, mine was on another level. The staff and teachers have been very patient and helpful with him and always been responsive to me and my queries. It’s a joy to see them greet the kids the morning with a big smile and ensure that kids feel welcomed and have a great bond with them as well. Thank you LMM!",
      "time": 1733300676,
      "translated": false
    },
    {
      "author_name": "Michael Sky Lin",
      "author_url": "https://www.google.com/maps/contrib/107384822385284623867/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU-JB67OLdlBazCDnzgkYtEx1Kbxee7lJ01RFM0Gwg1YQU1fdAN=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "a private childcare centre located on the 2nd level with a small playground and a small fitness corner and a pavilion right outside.\n\nclass size is about 12 to 15 kids ratio to 1 english teacher and 1 chinese teacher. school organised periodic outings for the kids but due to current covid-19 situation, temporary suspend all class outings except letting the children to explore the nearby surrounding area.\n\nteachers are all very professional and dedicated and most importantly caring towards the children which was the main reason for my son to enrol in the first place.\n\ncurrently checking in and taking temperature of all children is right outside of the school entrance before they are allow in. whole school is disinfect regularly.\n\nteachers will also send food menus of what the kids will be having the whole week in advance to the parents. nice gesture i feel.\n\nthere is an app to check daily photos of your child arriving and departure, some news from the school or MOE which is very convenient for us parents. overall a highly recommended centre if you are staying nearby.",
      "time": 1620159276,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7250926440531830023",
  "user_ratings_total": 30,
  "vicinity": "Punggol Place, #02-816 Blk 274B"
}