{
  "formatted_address": "83 Ceylon Rd, Singapore 429740",
  "geometry": {
    "location": {
      "lat": 1.3079478,
      "lng": 103.9009186
    },
    "viewport": {
      "northeast": {
        "lat": 1.309335930291502,
        "lng": 103.9023225302915
      },
      "southwest": {
        "lat": 1.306637969708498,
        "lng": 103.8996245697085
      }
    }
  },
  "name": "Little Seeds Preschool (St. Hilda's Church)",
  "place_id": "ChIJn2xFQm0Y2jERrWHTt14j0QE",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Y F",
      "author_url": "https://www.google.com/maps/contrib/106008292615394469945/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX8qMDXINyEOM60M7Vvf0kIUNokBkbGpS8Vije3k46U2j20Eg2_=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "We love Little Seeds preschool! Our child is always excited to go and comes home full of stories about what they learned and did. One of the best parts is their beautiful outdoor garden — our child loves spending time outside, exploring nature and learning through play.\nIt’s such a warm, happy place where children can grow, learn, and stay connected to the natural world. The teachers are super kind and really care about little ones. We feel lucky to have found it!",
      "time": 1745890684,
      "translated": false
    },
    {
      "author_name": "Ling Kris",
      "author_url": "https://www.google.com/maps/contrib/111436727001090623165/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL33JNr_iV6Qgkx_sNacj7TtAenUhTtB8z_A5bdeDSyV2qiWA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Teachers have been very patient with my littlest when she started playgroup last Nov :) They have been so kind and patient towards her and the transition took faster than expected. Hygiene is great too. Great Christian songs and prayer too! God bless the school :)",
      "time": 1738575569,
      "translated": false
    },
    {
      "author_name": "Ang Jian Yung",
      "author_url": "https://www.google.com/maps/contrib/101127774898483923123/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIaOrBEeNBTElPJb8WXrTVktFkmYA39H5fIETzKYjGJBtChRoc=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Our child enjoys going to school and big part of it was because of little Seeds. The teachers are a big part of why her transition to school wasnt as difficult as we were expecting.\n\nWe sent her to a holiday programme at another school and it made her hate school! So much so that our kid would wake at 6am to tell us that she doesn't want to go to school.\n\nWhen she resumed back at Little Seeds she took less than a few days to acclimatize to going back to school, she's all smiles in anticipation to going to school now :)",
      "time": 1740632940,
      "translated": false
    },
    {
      "author_name": "Rachelle Sindo",
      "author_url": "https://www.google.com/maps/contrib/117372290446745185637/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWwf1BSwWQ2sShGX3ObioQTVfnPZtLU_-IuVXRg1Vc77w7f6LmY=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "We just moved our son to Little Seeds and were pleasantly surprised at how quickly he adjusted. The school's activities are thoughtfully planned, communication is consistent, and the teachers, staff, and environment are warm and welcoming. We trust our child is in good hands.",
      "time": 1715351849,
      "translated": false
    },
    {
      "author_name": "Cassandra Neo",
      "author_url": "https://www.google.com/maps/contrib/114952841760448185763/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL8uTnKH7i0jWAv1Vucj1sb30CbEG5CgwgLJp2qIl7hUIwsGw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "If you want your child to feel loved at school, come and experience it for youself! My child started here at the new site at the beginning of 2024 in the playgroup class. As a new parent looking for a school with the 'perfect' fit, we inevitably went around the area looking. After visiting 3 to 5 other reputable schools, including popular branded ones, we felt that Little Seeds Preschool (SHC) was the one. We visited twice to ensure that we were making the 'right' choice. The principal and the senior teacher were very patient with us, explaining the curriculum and showing us around the school. It is comparable to the other schools in every aspect. My child gets to play outdoors in nature everyday as the weather permits, including water play and mud play. The staff grow fruits and vegetables on the school grounds which adds to my child's learning. There are additional enrichment classes to sign up for if parents are interested. It is clear that my child is happy and learning when he displays new knowledge outside of schooling hours. Communication between parents and the school is of a good frequency, providing information on what my child is learning about. The teachers will also communicate any concerns in a timely fashion (e.g. accidents, when my child got hurt). The school also has an in-house cook and they have ensured that my child's food allergies are accommodated. If you are a Christian and looking for a faith-based preschool, look no further. Thank you Ms Winnie and your wonderful dedicated team of teachers and staff!",
      "time": 1735264963,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=130924753888436653",
  "user_ratings_total": 21,
  "vicinity": "83 Ceylon Road"
}