{
  "formatted_address": "Simon Road, 2 Kovan Rise, #01-01, Singapore 548008",
  "geometry": {
    "location": {
      "lat": 1.3617649,
      "lng": 103.884835
    },
    "viewport": {
      "northeast": {
        "lat": 1.363229230291502,
        "lng": 103.8863913802915
      },
      "southwest": {
        "lat": 1.360531269708498,
        "lng": 103.8836934197085
      }
    }
  },
  "name": "Little Sprouts Montessori Pte Ltd",
  "place_id": "ChIJ8y-SAtMX2jERcvxcwja7yXE",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Sari Rosalina",
      "author_url": "https://www.google.com/maps/contrib/109223184541368262092/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL1pxYdt8LCA8ApzBHvy0lCWeLfdof5RkFTp4dy9jfHyz2DQw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "My son entered this school when he was 2,5 y.o as our family just moved to SG. This was his 1st school with full foreign languages that he was not familiar with. I admired the love, care, and patience that all teachers and classmates demonstrate for my son. All teachers sometimes asked for familiar words in my mother tongue that easily understood my my son. The high point on this school is the teacher to students ratio, which is exceptional to give full attention to the development. I highly  recommend Little Sprouts.",
      "time": 1731370963,
      "translated": false
    },
    {
      "author_name": "SH Wong",
      "author_url": "https://www.google.com/maps/contrib/104008148131550238160/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKlcFFvOufA2IIKIld4gl2WnR478BmcS55kHCCSoJquyUgf=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Both my kids(currently N1 and K1) started attending Little Sprouts when they turned 18 months and I have definitely been happy with my decision to enrol my kids there!\n\nThe teachers are caring and nurturing. They understand each child’s temperament and are very patient with them. Classes are small, so the children build a great relationship with the teachers. They have also become very good friends with their classmates :)\n\nCurriculum is holistic, I like that they also focus on character building. Since they adopt the Montessori method, learning is very hands-on which is what my kids enjoy.\n\nMy kids seem to be progressing well and I definitely trust my kids with the school!",
      "time": 1687936491,
      "translated": false
    },
    {
      "author_name": "Harine Ganesan",
      "author_url": "https://www.google.com/maps/contrib/111062000539080577575/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUoBviQUw4VY-JkU7VBRh1ORjPQeX4Npp0hV1QrCnqxTjRdWNyJ7w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My daughter studied in Little Sprouts Montessori from the age of 3 until she graduated her K2. The school is just amazing and the teachers are so good. They give a lot of personal attention to each and every child and they would keep us parents updated with every single detail.\nI am very happy that I chose this school for my daughter where she was groomed so well by her teachers and she is very well prepared for her Primary. I thank each and every teacher who has taken great care of my daughter Anokhi.",
      "time": 1705396358,
      "translated": false
    },
    {
      "author_name": "Aaron Sim",
      "author_url": "https://www.google.com/maps/contrib/115581626939612714809/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIKE0lma_zeQGKT2gd_tQ7KUafBINXhxnluQZiOn-3VubFXxA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Both my kids have been at Little Sprouts Montessori since playgroup age and I’ve been very happy with the school. Apart from the stellar curriculum, there are a couple of things that differentiate Little Sprouts from others:\n\n1) Character class: Little Sprouts has a class called character class where they teach students positive characters/values as they believe in molding more than the academics for children. My kids will often come home and share the characters they learned (for example: “orderliness”, “perseverance”) and more often than not, display these characters in their daily lives\n\n2) Teacher-student-ratio: I love the small teacher-to-student ratio where my children gets the most attention from the teachers. I view this as very important as the kids are in their formative years and the extra attention really helps them to learn better and gain confidence fast. I’ve done my homework with other schools and no others can achieve this.\n\n3) the teachers and staff: all of them are full of love, have spent years within Little Sprouts (where the turnover is generally low) and I get a full rundown on what happened to my children each day.\n\nI highly recommend you to try Little Sprouts Montessori.",
      "time": 1687937734,
      "translated": false
    },
    {
      "author_name": "hui ying",
      "author_url": "https://www.google.com/maps/contrib/109245325359260044886/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX2hh6d7Ksuv--hHpnMJqg0SHzN_nd3jL926WHeP1m4Mxnvz3syBQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Ethan is very happy to be at this school and absolutely is like his second home..the Teachers are super sweet and amazing, very nice, patient, encouraging and helpful , my boy love all his teachers like his own family member.\nThey know the importance of getting the parents involved should an issue arise, and do it in a very respectful, approachable manner. Great school!!!",
      "time": 1688003806,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8199290440468200562",
  "user_ratings_total": 4,
  "vicinity": "Simon Road, 2 Kovan Rise, #01-01"
}