{
  "formatted_address": "832 Yishun Street 81, Block 832 Block 832, Singapore 760832",
  "geometry": {
    "location": {
      "lat": 1.4146974,
      "lng": 103.8346957
    },
    "viewport": {
      "northeast": {
        "lat": 1.416172780291502,
        "lng": 103.8359628802915
      },
      "southwest": {
        "lat": 1.413474819708498,
        "lng": 103.8332649197085
      }
    }
  },
  "name": "Little Green House @ Yishun",
  "place_id": "ChIJ0-ZW6xEU2jERkuNbkfZVeFA",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Chong Laiteng",
      "author_url": "https://www.google.com/maps/contrib/103658511356141745442/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJEPJwCMQ-x8AjPzdx79PI0sT4NeI0p6fvl7IAepWdYdMQGcg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Little Green House @ Yishun has been an incredible place for our family, and we couldn't be more grateful for the exceptional care our child, Giselle Loh, has received. As we bid farewell to this wonderful child care center, we want to extend our heartfelt appreciation to two remarkable individuals who have made a lasting impact on our child's development and well-being: Teacher Yang and Teacher Siti, particularly in Giselle's Chinese class.\n\nFrom the moment Giselle stepped into the doors of Little Green House @ Yishun at just one and a half years old, we knew we had made the right choice for her early childhood education. The warm and nurturing atmosphere at the center, coupled with the dedication and expertise of the staff, has made it a second home for our little one.\n\nTeacher Yang's commitment to Giselle's Chinese language development has been truly exceptional. She possesses the rare gift of making learning both fun and educational, inspiring a genuine love for the language in our child. Under Teacher Yang's guidance, Giselle has blossomed into a confident and expressive little communicator. We are incredibly grateful for the patience and encouragement Teacher Yang has shown Giselle over the years, nurturing her love for the Chinese language.\n\nTeacher Siti, on the other hand, has been a constant source of comfort and support for Giselle throughout her journey at Little Green House. Her caring and compassionate approach has ensured that Giselle always felt safe and cherished, allowing her to develop not only academically but also emotionally. Her kindness and dedication have provided Giselle with a solid foundation upon which to build her future learning experiences.\n\nIt is with heavy hearts that we say goodbye to Little Green House @ Yishun, but we do so with the knowledge that Giselle is well-prepared for her next educational adventure. The exceptional care provided by the center, and especially by Teacher Yong and Teacher Siti, has been instrumental in Giselle's growth and development during her time here.\n\nWe will always hold a special place in our hearts for Little Green House @ Yishun and these incredible teachers who have played such a vital role in Giselle's early years. Thank you for your dedication, love, and support, and for making Giselle's time here truly unforgettable. We will miss you all and wish the center continued success in nurturing and educating young minds.",
      "time": 1696987763,
      "translated": false
    },
    {
      "author_name": "Liang Lina",
      "author_url": "https://www.google.com/maps/contrib/100293574985397577882/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIdpgUkrNdDuDMApyKnp_MDgjh8ncM8UKfwdjc0vQFxU4E_=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I want to express my sincere gratitude to all the teachers who have contributed to my child's growth and curiosity for learning. Throughout the 4 years at Little Green House @ Yishun.\n\nThanks Yang Lao Shi and Teacher Siti, I'm so thankful for the wonderful experience and quality care Leryn is getting from you. Leryn always excited to go to school and raves about her amazing teachers and friends when she comes home. Thanks for putting my mind at ease while I'm away, and thank you for everything you do for her everyday.",
      "time": 1696991507,
      "translated": false
    },
    {
      "author_name": "Jonathan Gwee",
      "author_url": "https://www.google.com/maps/contrib/110996689190673881254/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWi2FVL4gO1eHF6RfINt0U4bmyDN8vKN2vzgpY-pzF6wx-nCR1N=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 3,
      "relative_time_description": "9 months ago",
      "text": "*Update* I understand from the school board that the Principal has been replaced. Hopefully, the service standards of the school will improve moving forward.\n\nEnrolled our child into the school for 9 months. Overall, the teachers are very dedicated, but the Principal(Ms Lisa) handled administrative matters extremely poorly.\n\nBi-weekly updates of child's progress were only approved after every 2 months or so, despite frequent reminders from my wife and I.\n\nThere were also many other instances where the Principal's nonchalant replies made us question her capability. To keep things general, when my child's name was not in the class register after having been enrolled for 1.5 weeks(which I had raised multiple times during this period), I asked the Principal why this was the case, because it was causing some difficulty signing my daughter into the school every morning. I was simply responded to with \"I don't know. I need to ask my admin.\"\n\nThat reply doesn't inspire a lot of confidence from myself as a parent, coming from somebody who is supposed to be in charge of running the school. From my perspective, even a response saying I'm not sure, but I will check it out and revert to you shortly shows commitment to addressing the issue. Her response simply showed a lack of acknowledging that there was a problem and a lack of responsibility as the head of the school.",
      "time": 1724302221,
      "translated": false
    },
    {
      "author_name": "Wee Nee Ng",
      "author_url": "https://www.google.com/maps/contrib/107144986466575063672/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI6PGTBUOdZtF8Qlr1A4s74NDIoEBq2HWmKlTwmZejlQ89WhA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "The school has taken great efforts in the language, social and emotional literacy of the children.\nI have seen great personal development of my son. He is able to express his emotions effective and articulate well in English conversation. He has started to speak Chinese words and shown interest in learning and writing the Chinese language which is an achievement for him and a key milestone for me as a parent.\n\nThis year especially the last 4 months, he is also more confident and comfortable with people around him, and have started to enjoy school.\n\nThanks and grateful to Principals and all Teachers @ Little Green House Yishun for their patience in guiding our children as well as listening to the feedback of the parents and constantly making the school experiences better and better for the children and at the same time keeping us parents updated on our children's progress in school.\n\nKudos!",
      "time": 1697793950,
      "translated": false
    },
    {
      "author_name": "suqi cai",
      "author_url": "https://www.google.com/maps/contrib/103259749997516708770/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJsH0siDGGgOXDoxyrX5tI8_ooUG06Uw92uFQtu69q9c5ArjA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My daughter has been enrolled in the school since March 2023 and she likes her teachers a lot, always telling me about them being kind to her. Initially it was hard getting her to go as it was her first time attending school, but the teachers made it easier for her to transition to school life. She has learnt a lot in the past 7 months and I'm thankful she is now looking forward to go to school.",
      "time": 1697765664,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5798479037728547730",
  "user_ratings_total": 63,
  "vicinity": "832 Yishun Street 81, Block 832 Block 832, Singapore"
}