{
  "formatted_address": "1 Toh Ave, Singapore 508031",
  "geometry": {
    "location": {
      "lat": 1.3648245,
      "lng": 103.9746936
    },
    "viewport": {
      "northeast": {
        "lat": 1.366202830291502,
        "lng": 103.9760517802915
      },
      "southwest": {
        "lat": 1.363504869708498,
        "lng": 103.9733538197085
      }
    }
  },
  "name": "Long Win Aircondition Engineering Pte Ltd",
  "place_id": "ChIJ25s8W1g82jERIo83n3MgTio",
  "rating": 3.2,
  "reviews": [
    {
      "author_name": "Desmond Ng",
      "author_url": "https://www.google.com/maps/contrib/100114506530048705775/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ1_198YPqQ7FmEbfI2O1N432GCeiE4J0LJfv_9zRg1PKzRJg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "9 months ago",
      "text": "Been using long wind for my A/Cs servicing for more than a decade.\nI have also engaged them for installation 7 years when I was residing in Serangoon despite knowing that the prices is on the higher side not to mention A/C servicing charges has gone up significantly over the years but I still stick to them.\n\nHowever I m disappointed with the service rendered a couple of days back.\n\nHave an existing leakage issue and when crew was here, I was advised that the other team are able to fix the issue.\nHe will highlight to the admin staff to send me a quotation.\n\nFollow up on the next day and waited and waited.\nSomeone name Tritan contacted me a couple of times and I pleaded with him that the escalation needed to be addressed urgently. He assured me that will revert back by Saturday.\nLong story short, when I reached out to the office and  was told that he is off.\nWhat the F? How irresponsible is that?\n\nAnother incident was last year, my A/Cs was down on Xmas Eve.\nThey were able to despatch the crew last minuet. Somehow changing certain parts ain’t justifiable hence I requested for a quotation and till NY Eve still hear nothing for them.\n\nLong wind has given me the impression that they don treasure loyal customer like me.\n\nSad to say with these 2 experiences, I reckon is time to look for another reliable and responsible company to service my A/Cs.",
      "time": 1722332552,
      "translated": false
    },
    {
      "author_name": "Isaac W",
      "author_url": "https://www.google.com/maps/contrib/111878235997609324617/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ1AwNNij_Y84cFvX78HTz0FzNuRkAFXjWH0_B1a5Jm7F--Iw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Their prices are a little on the expensive side but it is worth it as they provide good service. The technician who fixed my leaking aircon is well-trained and also took the trouble to find the root cause which is a blocked pipe opening under the sink. This had gone undetected for years by other aircon companies, they just did the usual vacuum and left. A few months later my aircon would leak again. Glad that Long Win was able to fix the issue permanently. They also laid a canvas sheet on the floor to keep it clean when servicing. This is great attention to detail.",
      "time": 1674164010,
      "translated": false
    },
    {
      "author_name": "Baoquan Wang",
      "author_url": "https://www.google.com/maps/contrib/114172119519396670012/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKfPHHdZg4sg3JTQfO4bE11mMZmX0duFK6r7S8WmlCAob8BQw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "I have a very bad experience with this aircon servicing company\n1: I have engaged this company for aircon serving, two weeks later the aircon doesn’t produce any cooling air. Nobody touch the aircon except the servicing agent check the main machine\n2: After call the company, the company send two guys down to check. The guy say the gas pressure too high need to release some gas. After release the gas he said released too much, need to pump in more gas. After pump in the gas, he said it may be the compressor problem. What’s more his gas finished, need to ask another group ppl to come to fill up the gas. So I wait another 1 hour, another group of ppl came and checked said it may be the PCB problem. He said he is not too sure.\nThe next following working day, the staff send me a bill proposal to change the PCB.\n\nIt’s really not professional and skilful. I have regretted to engage this company service\n\nFirst: The serving and checking may cause my aircon spoil?\n\nSecond: Haven’t solve the problem, the technician haven’t identify the problem then ask for bill to change the PCB",
      "time": 1688369475,
      "translated": false
    },
    {
      "author_name": "Daniel Goh",
      "author_url": "https://www.google.com/maps/contrib/117213880136670702804/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVZd06_upFR5AnFt7a8p2ZhS1gYYG5faZqv38hOPPI3VeISnZ2HIw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "Over the past 15 years, my family has been using them to install new air cons in our homes and has contracted them for regular maintenance service including chemical cleaning. Their customer service and technical work is first class! My son will soon be having his own home and will also be engaging their service.",
      "time": 1615608112,
      "translated": false
    },
    {
      "author_name": "Ong Marcia",
      "author_url": "https://www.google.com/maps/contrib/112613966869109683754/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJq3tMbQILMxNtGgnx0AN8sXU6zyfVA6lHWnufXVgpEJTL_cw=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "2 years ago",
      "text": "I have my aircon serviced today. 2 units plus swopping of the louvres cost me 129.60. The services was done in 25 mins. It took about 3 to 5 mins to  swop the louvres and i was charged 40 sgd for this simple job. Actually the louvres parts were just loose and can be fixed during the servicing without additional cost. I felt that it was over-charging.",
      "time": 1676030237,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3048409678740950818",
  "user_ratings_total": 15,
  "vicinity": "1 Toh Avenue, Singapore"
}