{
  "formatted_address": "100G Pasir Panjang Rd, #01-07/08/19/20, Singapore 118523",
  "geometry": {
    "location": {
      "lat": 1.2768843,
      "lng": 103.7964053
    },
    "viewport": {
      "northeast": {
        "lat": 1.278704280291502,
        "lng": 103.7976583302915
      },
      "southwest": {
        "lat": 1.276006319708498,
        "lng": 103.7949603697085
      }
    }
  },
  "name": "Lorna Whiston Preschool (Hort Park)",
  "place_id": "ChIJVTR4RrQb2jERm6jhux-4M6s",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Camellia Chan",
      "author_url": "https://www.google.com/maps/contrib/109936268617512577542/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIal2QAs59MGfmwbjo323TmjorMskTQdfGiBAMVKRMe0stkXg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "We recently transferred our children to Lorna Whiston Hort Park, and we’ve been so impressed with how smoothly the transition has been. The teachers are incredibly patient and attentive, making sure our kids felt comfortable and supported from day one.\n\nOur little ones especially love the outdoor play sessions, which are incredibly important for their physical and cognitive growth. The masterclasses have also been a highlight, offering unique learning experiences that go beyond the usual curriculum.\n\nIt’s clear this school cares deeply about both education and wellbeing. Thank you for creating such a nurturing space where our children are excited to learn and grow every day. Highly recommend!",
      "time": 1746529528,
      "translated": false
    },
    {
      "author_name": "Fiona Jia",
      "author_url": "https://www.google.com/maps/contrib/105834482733899677397/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVXvRLTmps0ORczxlh8a5kk-TVr8bQ1bQSqajoiKzCMB7CD8Txf=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Lorna Whiston Hort Park has been an amazing place for my baby! The teachers are incredibly genuine and caring, and it’s clear they truly love and understand the kids. They were thoughtful enough to share timely updates during the initial days, which really helped ease my worries as my baby adjusted to the new environment.\nThe fact that many of the teachers have been with the school for years speaks volumes about the quality and stability of the team. My baby cried for just three days and now absolutely loves the school—he looks forward to going every morning and says goodbye without hesitation during drop-offs.\nI also love that the school makes great use of its proximity to Hort Park. Even without a dedicated outdoor space, the kids get to explore and play in the park, which makes them so happy.\nSpecial shoutouts to Ms. Jacqueline, who patiently addressed all my questions and went the extra mile to help me find the best solutions, and Ms. Connie, the principal, who gave me confidence that my baby is in excellent hands. Teachers like Huang Lao Shi, Ms. Rachel, and Tong Lao Shi have made communication seamless and helped my baby transition smoothly from half-day to full-day sessions.\nThis has been a wonderful experience just three weeks in, and I’m sure the other teachers are just as amazing. I highly recommend Lorna Whiston Hort Park—it’s a fantastic, caring place that I truly trust with my little one!",
      "time": 1745391623,
      "translated": false
    },
    {
      "author_name": "Yvonne Lim",
      "author_url": "https://www.google.com/maps/contrib/104517557505686244069/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKKIulpUaPr5NQz6yryyrG9ydkzVEbq4cef6VDNKi53TzJJCNs=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "We are new to Lorna Whiston and our experience so far has been amazing! My child absolutely loves attending and looks forward to school every morning. The teachers are attentive, making the transition really smooth. I also appreciate the variety of activities offered—music, sports, taekwondo, and arts—all of which my child enjoys. It’s a huge plus for parents that these are included in the curriculum, saving us from having to arrange separate extracurricular classes. I also love that they go to the park three times a week, adding some much-needed outdoor fun to their day. Highly recommend!",
      "time": 1739861529,
      "translated": false
    },
    {
      "author_name": "Agnes Seah",
      "author_url": "https://www.google.com/maps/contrib/114677461053383270520/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKsdGOWOMpX4PgUlPbT4DlOpL45n5VfQM5IyalqqTJZs95vjQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Lorna Whiston Hort Park has been an amazing place for our children. They look forward to school everyday, thanks to the caring and supportive principal and teachers. The masterclasses are fun and engaging, making learning enjoyable. We especially love the outdoor sessions 3 times a week, it’s a great balance of education and nature exploration. A truly wonderful preschool that nurtures both learning and happiness!",
      "time": 1742012922,
      "translated": false
    },
    {
      "author_name": "TiewHeng Theresa Chew",
      "author_url": "https://www.google.com/maps/contrib/101022067552603881670/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUjV1M2Qvlhg61PmTUqtdq9jUMkcX1-J8T0U4JTwpiBQc0_bl1gTA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "My grandson Jeremy really enjoys n like the school.\nEvery morning without fuss getting ready for school.\nI like to thank Connie for introducing Lorna Whiston (Hortpark) to me.\nInitially we were worried that Jeremy may not be able to adjust to the school.\nHowever during the open house he was very happy n enjoys the activities.\nThe outdoor activities n to Hortpark were indeed a good and  interesting programs.\nI like to thank the teachers and staff for taking care of him.\n\nGrandma\nTheresa",
      "time": 1746535236,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12336406250733545627",
  "user_ratings_total": 22,
  "vicinity": "100G Pasir Panjang Road, #01-07/08/19/20"
}