{
  "formatted_address": "844 Sims Ave, #01-700, Singapore 400844",
  "geometry": {
    "location": {
      "lat": 1.318255,
      "lng": 103.9013159
    },
    "viewport": {
      "northeast": {
        "lat": 1.319505630291502,
        "lng": 103.9026173802915
      },
      "southwest": {
        "lat": 1.316807669708498,
        "lng": 103.8999194197085
      }
    }
  },
  "name": "Loving Nature Fortunate Coffee Cafe SG",
  "place_id": "ChIJe8Yr5c4Z2jER5aKXKjKSRhI",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Oren Cohen",
      "author_url": "https://www.google.com/maps/contrib/102001544808530119670/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWht2UtqxUUyVj-GVSXWMzdkXhaIhVerilRbCMpR7hYLKRtGKcyvg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "More than Vegan food - Inspiration at its best!\n\nBeyond the super earthy, healthy, Asian-inspired vegan food — which is truly nourishing and full of flavor — what makes this place exceptional is the heart behind it. The staff here are all volunteers, preparing everything themselves during the weekdays so they can serve this abundance with love on the weekends. They do it as part of a non-profit initiative whose mission is to promote veganism.\n\nAll of their breads are naturally fermented and easily digestible — even for those who are gluten sensitive. You can feel the love and intention in every bite and every interaction.\n\nIt’s more than a meal — it’s a reminder of how food, community, and purpose can come together beautifully.",
      "time": 1744525700,
      "translated": false
    },
    {
      "author_name": "Yasai Aisa",
      "author_url": "https://www.google.com/maps/contrib/109686602623073872708/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLLxWXrT_TKT05PlKBE7046-6ZkgliOwZySksWzI8SLAYCk5Q=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Really enjoyed the food we had here! Prices are really affordable especially for the quality :)\n\nThe dumpling soup was super interesting because you break it open to release all the ingredients into the soup.\n\nThe pesto was a bit dry imo, but still delicious\n\nThey only have 2 flavours of ice cream, and we got the double scoop of each flavour. This time they had a mango flavour instead of the usual pink vanilla, which had a really good texture\n\nEverything is handmade in-house so the quality is really there. They're run by a group of friends and family, which explains why all the staff are super warm and welcoming. Well worth the trip to the east!",
      "time": 1741436044,
      "translated": false
    },
    {
      "author_name": "Jennifer Liepin",
      "author_url": "https://www.google.com/maps/contrib/107459204527494230825/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXG3e-72Bb07jIBnvEfdaFpyW1E77zknlFD3EQ7f_fMvIKHtVawvA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "My favorite restaurant in Singapore!\nThe food they serve just beautiful, healthy, and prepared with care.\nIt’s affordable at ~$6 for a set meal!\n\nMy husband and I each received beautiful presented rice colored slightly with blue butterfly pea flour for added health, and wealth, alongside the sides that came with each of our respective meals.\n\nAdd to this the kindness of our host who patiently explained the menu to us, and then gently brought and served our meals.\nIt was an incredible experience. Michelin stores should be awarded to restaurants that are humble, but go above and beyond to show care for their visitors.\n\nI rarely set up a meal routine, but I’m determined to eat here once a week until I leave Singapore.",
      "time": 1744620093,
      "translated": false
    },
    {
      "author_name": "Sim Jun Xun",
      "author_url": "https://www.google.com/maps/contrib/116359336950711248804/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVU9qP3Ffu4mJBRQpS6zEcACoFaaX0ZENJqlPxqg8gR7ihdA8MD=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "A lovely, cozy and warm vegan dining place. A gem for residents in the area and a find for those on a foodhunt. Would love to try out the rest of their menu. The staff and their service are friendly (though not overly) and happy to serve. Highly recommended to visit and enjoy this wonderful place!",
      "time": 1743313075,
      "translated": false
    },
    {
      "author_name": "Danielle ben-menahem",
      "author_url": "https://www.google.com/maps/contrib/104776322277160887406/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK16mIVhtDX94FqP_LIQW85kBMCnbrtGyHaouI5ME08r3Wrqg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "This restaurant truly moved me. The food is not only delicious and creative — it feels alive. Every dish is thoughtfully prepared, and you can taste the care that goes into it. The naturally fermented breads are a standout, and even as someone sensitive to gluten, I felt great after eating here.\n\nBut what really touched me was the heart and intention behind it all. The people working here are volunteers, giving their time and energy to share something meaningful. It’s not just about serving incredible vegan food — it’s about raising awareness, connecting people, and offering nourishment on every level.\n\nThere’s something deeply beautiful about this place. You don’t just eat here — you feel something. A sense of purpose, generosity, and genuine love. I left with a full belly and an even fuller heart.",
      "time": 1744526295,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1316900685213049573",
  "user_ratings_total": 144,
  "vicinity": "844 Sims Avenue, #01-700"
}