{
  "formatted_address": "161 Lavender St., #01-12, Singapore 338750",
  "geometry": {
    "location": {
      "lat": 1.3126401,
      "lng": 103.8610956
    },
    "viewport": {
      "northeast": {
        "lat": 1.314159380291502,
        "lng": 103.8624102302915
      },
      "southwest": {
        "lat": 1.311461419708498,
        "lng": 103.8597122697085
      }
    }
  },
  "name": "Lunì - Scent, Bar & Kitchen",
  "place_id": "ChIJNeCJszIZ2jERYCiJ6Zl44RY",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Maria T",
      "author_url": "https://www.google.com/maps/contrib/116264055153062131613/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUK40BHJ2eCA7u59EjUypilgZ7__V3iQD2cHnw3ADFa3iD82rHd=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Had an amazing night out at Luni with my husband! The drinks, the food, the whole vibe — everything was spot on. The medium-rare steak was *chef’s kiss* and really proved that great bars can also serve great food.\nBut honestly, the real star was the scent/essential oil-infused cocktails. So unique and super well-made! Xan, the bartender, is clearly passionate about what he does and it really showed in the drinks and the way he talked about the whole concept.\nIf you’re looking for a fun, different experience, Luni is *the* place to go. Can’t wait to come back!",
      "time": 1742030052,
      "translated": false
    },
    {
      "author_name": "Lorraine T",
      "author_url": "https://www.google.com/maps/contrib/100765991992046713300/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUpe0Qo6BsEHvhW6D8jG0r0aTU4MG7OCAPyFl6CcxYT9YUcdzOI2A=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Your olfactory senses activated the moment you step in, in the most lovely soothing way. Scent-sational cocktails. Appreciate that there's a washroom right in their space as compared to the old Apartment coffee where you had to head back out for a public bathroom. Lovely lighting. Good music for a Sat night tho a tad loud if you're seated near the speakers. Best Espresso martini - you can actually taste the coffee instead of artificial liquor sweetness. All praise for this place.",
      "time": 1743872462,
      "translated": false
    },
    {
      "author_name": "Noel Huang",
      "author_url": "https://www.google.com/maps/contrib/117294615995197685380/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXZqFhj1lu7L3yViN38gH0X8-7K5a3eOENVn0bTENHT00ayOY-yRg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Went to Luni on a rainy evening, this scent inspired bar was incredibly cozy and so happened they had Thai kitchen takeover which I love!\n\nThe owner and bartenders here are really attentive and friendly, you might just end up becoming friends  or staying long than expected.\n\nIt's really nice to see Zack's passion for scent and attention to detail coming fruition in this bar. 🍻 Thanks for the amazing night.",
      "time": 1746832234,
      "translated": false
    },
    {
      "author_name": "Janice Lee",
      "author_url": "https://www.google.com/maps/contrib/106560684916099273567/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXQf-OHJi6CmZ_ZCgS1ck62TLUXsdPM_tA8CZ1BYdORFLFtMt4R7g=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "I found out about a very interesting and unique place when I signed up for Cocktail Making Class. Turns out the place is Lunì - Scent, Bar & Kitchen. Yes, my first thought is what has scent got to do with bar and kitchen? But knowing that there is a kitchen cemented my decision to go for the class with empty stomach so that I can try the food here. I will also see how scent plays a part in the whole experience.\n\nActually, aroma always plays a very important part in gastronomy, but more of accompaniment to taste. And at Lunì, this element takes the center stage instead, and it works beautifully. The cosy, stylish bar, with lots of soft glowing lights, is lightly filled with aroma of lemongrass, amping up that cosy feeling.\n\nThe essential oils, infused into the cocktails, take things up a notch with the enjoyment of the drinks. I’m usually not into bitters, but at here, with the sweet aroma added, I totally dig it due to the good balance of bitter taste and sweetness from the aroma. The other cocktails are also unique and so good on the palates. Yes, aromas do enhance the taste of the cocktails, by a mile.\n\nThe food here is delicious, which is why I suggest coming here with some room in the stomach. The food menu is well thought-out, with simulating flavours to juxtapose perfectly with the cocktails while not eclipsing the delicate aromas of the drinks.\n\nThe service here is excellent. The bartenders and service staff are all so friendly and prompt to action. Xen, the sensei for Cocktail Making session makes it fun with the casual easy vibe. He is so knowledgeable, thus sharing with us the history and origins of cocktails, making the experience even better. And the part about locking the true aroma of mint, it is so eye-or-nose opening. This us a must-try experience.\n\nTruffle Angel Hair Pasta with Scallops and Ikura is so briny sweet, with a hint of zest to perk up the taste. This dish is special in which the pasta has this curly and slightly firm, chewy texture, like it had been lightly deep fried beforehand. I like this unique texture.\n\nGrilled Tiger Prawns is a must-try here. The prawns and broccolini are perfectly grilled to have that rich, intense aroma and taste of char, while retaining the creamy texture and juicy core respectively. The char is very pronounced, being top notes of the flavours yet having none of the bitterness.\n\nTo top it off, the sauce of passion fruit and yoghurt is creamy and tangy, contrasting so well with the char and elevating the taste.\n\nEmber cocktail surprises me with its bitter taste that I actually like! Bitters is not my thing, but this drink catches my fancy with its sweet aroma and smooth feel. Yes, aroma makes a difference here.\n\nThoughts: Exciting Experience created by Aromas",
      "time": 1746254003,
      "translated": false
    },
    {
      "author_name": "Junior Kuah",
      "author_url": "https://www.google.com/maps/contrib/115312575101606366703/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWVm4jPQ-oVavWQA33dr-8ndFNic8tpsMDtAuQpEMFGL9K8HnOy=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "If you're looking for a place that combines incredible service, delicious food and drinks, and a vibrant atmosphere, Lunì - Scent, Bar & Kitchen is the perfect destination. From the moment you step inside, you're greeted with warm smiles and impeccable service. The staff is attentive without being overbearing, ensuring that your experience is smooth and enjoyable from start to finish.\n\nThe food is absolutely outstanding. Each dish is thoughtfully crafted with bold, fresh flavors that delight the senses. Whether you're in the mood for something light or more indulgent, Lunì has something to satisfy every craving. The drinks menu is equally impressive, offering a wide selection of expertly mixed cocktails and an extensive wine list that pairs beautifully with the menu.\n\nWhat truly sets Lunì apart, however, is its atmosphere. It's the ideal balance of lively and relaxed, making it perfect for both intimate dinners and social gatherings. The ambiance is chic yet welcoming, with modern design elements and a cozy vibe that invites you to linger and savor every moment.\n\nOverall, Lunì - Scent, Bar & Kitchen delivers a fantastic dining experience that hits all the right notes. Whether you're a foodie, a cocktail lover, or simply someone looking for a great night out, this place is a must-visit. Highly recommended!",
      "time": 1742349351,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1648731541037721696",
  "user_ratings_total": 89,
  "vicinity": "161 Lavender Street, #01-12"
}