{
  "formatted_address": "Level 1 Public Area, 10 Airport Blvd., Changi Airport Singapore, Terminal 4, Singapore 819665",
  "geometry": {
    "location": {
      "lat": 1.3386111,
      "lng": 103.9830556
    },
    "viewport": {
      "northeast": {
        "lat": 1.339992330291502,
        "lng": 103.9843265302915
      },
      "southwest": {
        "lat": 1.337294369708498,
        "lng": 103.9816285697085
      }
    }
  },
  "name": "Ma Mum",
  "place_id": "ChIJLVQT0Mc82jER1fLJ-uBtW_s",
  "rating": 3.4,
  "reviews": [
    {
      "author_name": "Mr & Mrs Rajja",
      "author_url": "https://www.google.com/maps/contrib/107685768793518937435/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUPrIziG5_YNB4k_QG334UK6vyDyYuLdfW0_rQh89tevvn6tVE=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "During our recent visit to Changi Airport Terminal 4, we had the pleasure of dining at Ma Mum restaurant, and it turned out to be a wonderful experience. We tried the Mee Siam Chicken Delight (MS3) and the Mee Siam Grilled Chicken (MS4). Both dishes came in generous portions, which we found very satisfying after a long day of travel.\n\nThe Mee Siam was flavorful, with a unique twist – both dishes included slices of mandarin orange, adding a noticeable sweetness to the overall taste. As Sri Lankans, we are more accustomed to spicy and savory flavors, so the sweet notes were a bit unexpected. However, it was a refreshing change and a memorable culinary experience that highlighted the fusion of local tastes with a touch of creativity.\n\nThe dining area at Ma Mum is spacious and comfortable, making it an ideal spot for travelers looking for a relaxed meal before their flight. The service was efficient, and it’s convenient that they accept both card and cash payments. We also noticed that the restaurant is quite popular among travelers, with many guests choosing to have a final taste of Singaporean flavors here before departing.\n\nOverall, Ma Mum restaurant offers a pleasant dining experience with quality food, generous portions, and a comfortable environment. We would definitely recommend it to anyone passing through Terminal 4, especially those looking to enjoy a local dish with a slight modern twist before leaving Singapore.",
      "time": 1745779545,
      "translated": false
    },
    {
      "author_name": "E. T.",
      "author_url": "https://www.google.com/maps/contrib/107311556962022163450/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWLvuciHNDv-u_5s-LZwGLpTJSfcjqirhwBGStTVrehAwrN2RtJ=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "Conveniently located in T4 (very close to the shuttle bus waiting area), Ma Mum is a convenient option for quick breakfast.\n\nThe classic half-boiled eggs & toast set is a popular choice, with the eggs cooked to perfection. However, it's advisable to use the soy sauce sparingly, as it was too thick & quickly darken the eggs. 🙁\n\nReady-made food such as drinks & beverages were served at the order  / payment counter. For dishes that require preparation, diners need to self-collect at the side counter when the buzzer sounds.\n\nTo maintain cleanliness, diners are responsible to clear the tables & returning trays / utensils to the designated area.",
      "time": 1731686702,
      "translated": false
    },
    {
      "author_name": "Sabrina Sabrina",
      "author_url": "https://www.google.com/maps/contrib/111239783877648211496/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKZhDmBTStqkbPCNWYNAIxFCq9vOmNguM_q3GrLa4ZGncSmZA=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "Went terminal 4 public mamun rest. Lousy to the max. Drinks awesome. Thai tea and iced milo. Food terrible. The tendon soup is ok ok.. spicy to whoever loves chilli.. The mee siam is watery , no need to elaborate on watery mee siam already.  The mee rebus was another level of regret buying. The toast strawberry bread acceptable.",
      "time": 1743672945,
      "translated": false
    },
    {
      "author_name": "Palastri Shop",
      "author_url": "https://www.google.com/maps/contrib/111728062515922801664/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUrbeTU3Qhl-_1REG4h7uIYNZJ-P2gVkQcdr1N85N0wW78v2T0T6Q=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "If you're craving flavorful Thai food while waiting for your flight, Ma Mum Restaurant is a surprisingly satisfying option tucked inside the airport. Specializing in Asian cuisine with a focus on Thai dry noodles, this spot delivers bold taste in a convenient location.",
      "time": 1746896444,
      "translated": false
    },
    {
      "author_name": "Durga Morgan",
      "author_url": "https://www.google.com/maps/contrib/102108421385955683752/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVkSijw3NuPjYVeHC-2CeZ3nG_fjNqMu4AI3kOropodejcmp6TgMg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Bought Kra Pao chicken basil and green curry with rice. Chicken basil tasted like light soy sauce. not eatable. Green curry tasted so sweet and coconut is too strong. Price we paid was broad day light robbery.",
      "time": 1743327157,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=18112191139448222421",
  "user_ratings_total": 277,
  "vicinity": "Level 1 Public Area, 10 Airport Boulevard, Changi Airport Singapore, Terminal 4"
}