{
  "formatted_address": "17, Jln Niaga Aspira 1/2, GERBANG NUSAJAYA, 79200 Iskandar Puteri, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.4193559,
      "lng": 103.593781
    },
    "viewport": {
      "northeast": {
        "lat": 1.420696280291502,
        "lng": 103.5951446802915
      },
      "southwest": {
        "lat": 1.417998319708498,
        "lng": 103.5924467197085
      }
    }
  },
  "name": "Magic Monkey Car Wash",
  "place_id": "ChIJ-Wm3yfAL2jERjIG1AdHR3g0",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Gator",
      "author_url": "https://www.google.com/maps/contrib/114331842318070680564/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUf5N0YPQocYYralVhzxgKqHfnlJgSiXhs54DUya0oFIumc-54QVA=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "This car wash delivers a mediocre result for the price. While my vehicle came out clean, the job wasn’t thorough – water streaks and moisture remained in door seams and around mirrors, requiring extra drying on my part.\n\nMain Issues:\n⚠️ Inconsistent Pricing – Was quoted a high price initially, but magically \"remembered\" a lower rate when I mentioned being a returning customer. This feels dishonest.\n⚠️ Rushed Drying – Visible water spots and damp areas left behind, especially in crevices\n⚠️ Average Cleaning – No major complaints about the wash itself, but nothing exceptional either\n\nThe Bottom Line:\nYou can get your car washed here, but:\n- Negotiate the price firmly before service\n- Check all areas before leaving as drying isn’t thorough\n- Manage expectations – this is strictly basic cleaning\n\nBetter options probably exist nearby unless you’re in a pinch. Won’t be my first choice next time.",
      "time": 1744568549,
      "translated": false
    },
    {
      "author_name": "Sunil Gill",
      "author_url": "https://www.google.com/maps/contrib/101763455865318767396/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUcXX_Bp1_4FbpoNUIAPttFkgQwu96p7VrEEK9gERDZBNClj7tO=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Poor service on wiping out the wet stuffs.. same wet cloth used to cover the whole body. Some place was not even touched while scrubbing. If you ask for water wax service, don't be surprised if they wash at once.. As they said their soap is included with wax chemical.  As far as I seen, this method not efficient at all and the wax won't last long \"if\" it's really exist in the shampoo. If you could understand their language, it would be your advantage as you will know what actually they are talking about. Thanks.\nStrongly not recommendeded",
      "time": 1743425334,
      "translated": false
    },
    {
      "author_name": "Andrew Sim",
      "author_url": "https://www.google.com/maps/contrib/105042322091437379337/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVoRCorENMbw6UFjn5oqvhMIK1HTxqRupQlkoFKGJ_ZmZ__BnzeMw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Chanced upon this awesome place in Gelang Patah at around 1am.\n\nA really great place to give your vehicle a bath.\n\nThe team of Burmese gentlemen really are professional, leaving nothing left unnoticed.\n\nA water wax session set me back by RM36.00. Come on, their service and attention to details was really worth it, compared to the butchers over in Johor Bahru, milking the hordes of hungry Singaporeans.\n\nWhen your vehicle is getting her shower, you are invited, yes, invited by one of the personnel there to wait in the lounge. You read that right. A clean, well thought off lounge. Not some dirty ass waiting room like most in Johor Bahru. Quiet, cool, and with a telly for some entertainment. You can also see the process of your vehicle's bath through a plexiglass. Very well thought of by the guys.\n\nThey even cleaned the seats of your vehicle, besides the standard vacuuming. I got a shock when I sat down and my fatty arse was sliding on the seat. Awesome.\n\nThere's a Sarabat stall, about 10 metres away from them, should you need to grab a beverage while waiting for them to complete the process.\n\nVery friendly bunch of personnel there. No angry looking faces at all.\n\nThis will be my go to place in Gelang Patah for a carwash after 12 midnight (and they shut at 0200H).\n\nHighly recommended place.\n\nPS. Since it's only RM36, for a waterwax experience just tip them a little to show your appreciation. Since the ones in Johor Bahru are already charging RM50, just give it to them at Magic Monkey. They deserve it.",
      "time": 1737530339,
      "translated": false
    },
    {
      "author_name": "valerine shalini",
      "author_url": "https://www.google.com/maps/contrib/104752022600409720700/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKpiIU8GPnpq5uY8o1_xeCEt0HP2k56ydVTuAYTD9bwtVrm1g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "🪄Thank you MagicMonkey Carwash  for your extraordinary service! 🙏\nThe car looks spotless! You guys did an amazing job with the detailing. Service was so👌 efficient!\nYour team was super friendly & professional.\nI’m so happy with how my car turned out. I’ll be coming back for sure!...It made the whole experience enjoyable.. 🚘 Very convenient specially near to Tuas Customs importantly‼️\nThank you boss Pupathi Raja Mohan . No regrets & sure value for money!!\n💪 HUAT AH! 💥\n#YourCarSpa\n#iskandaPutri",
      "time": 1736420144,
      "translated": false
    },
    {
      "author_name": "Mary Arumugam",
      "author_url": "https://www.google.com/maps/contrib/101772532315325257189/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX--xFi87O2juvR344HoK7hB0wObQqczloOXVwsWErR-5AXAq_W=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "I personally visited Magic Monkey Car Wash, and I was thoroughly impressed with their service. They handled my car with great care and attention to detail. The location is just a convenient 10 to 15-minute drive from Tuas Customs, making it easily accessible. Their services are not only affordable but also highly reliable. I’ll definitely be returning and would recommend them to anyone looking for a quality car wash.\"",
      "time": 1727768485,
      "translated": false
    }
  ],
  "types": [
    "car_wash",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=999466862929871244",
  "user_ratings_total": 67,
  "vicinity": "17, Jalan Niaga Aspira 1/2, GERBANG NUSAJAYA, Iskandar Puteri"
}