{
  "formatted_address": "49 Teban Gardens Rd, Block 49, Singapore 600049",
  "geometry": {
    "location": {
      "lat": 1.3209128,
      "lng": 103.7381523
    },
    "viewport": {
      "northeast": {
        "lat": 1.322414430291502,
        "lng": 103.7396285302915
      },
      "southwest": {
        "lat": 1.319716469708498,
        "lng": 103.7369305697085
      }
    }
  },
  "name": "MakanShiok",
  "place_id": "ChIJb-ZKF68a2jERdMTKLnF6DBk",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Eisza",
      "author_url": "https://www.google.com/maps/contrib/117742483001456034338/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLN-3p3HxNX9CZaIuUt1gxschvqDSj6YJAkeN2_WpCBpyC--z9i=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Every year I will go to Makan Shiok! to buy the ketupat & lemang . This year they have extra service - someone to open the bamboo for lemang . I like 👍\nHopefully they can continue the good service. Thank you to the friendly & helpful staff too. Selamat Hari Raya 💓",
      "time": 1743313060,
      "translated": false
    },
    {
      "author_name": "Mizzy Jeffresha",
      "author_url": "https://www.google.com/maps/contrib/116358281711281852548/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJGxJWkvmfQNjyuuCpkrX8u4TLPWngLLGZJfurnD5JKIx_2wQ=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "Overall is good! The portion is good but bit oily the rest is ok. Price so so but the staff is friendly!! Good service! Anyway, should separate zon smoking area farer.. The smoke alot.. Lots of people smoking.",
      "time": 1747060571,
      "translated": false
    },
    {
      "author_name": "Nazree Agil",
      "author_url": "https://www.google.com/maps/contrib/100956713605472273382/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV5wxAOWy44joYKd_J76udeB67eu7JHVzXQJNA64xalPA62tac1GA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "2 years ago",
      "text": "Although it’s far, the food at this coffee shop are quite good and affordable. The new western shop Hotbox is quite good. Tried their Steak, Chicken Cutlet and Samyang Prata. *update I tried their Lamb Chop. Worth it. Price are quite affordable.\n\nRatna chicken rice is also quite good and value for money.\n\nThe kueh at the drink stall is also good. The goreng pisang was freshly made when I bought it and the Makcik wasn’t stingy when I ask for extra crispy bits. Gave a full bag 😂\n\nDid not try the other stalls but my colleagues said the food wasn’t bad. Nothing fancy. Overall it’s a good makan place to have lunch or just lepak. That said, the area is quite ghetto. 😌",
      "time": 1666606561,
      "translated": false
    },
    {
      "author_name": "umake mehungry",
      "author_url": "https://www.google.com/maps/contrib/111406931807185833571/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU7xXdedN7uiieenG0ai83EG55YmxvC0-lvsAbSPXlae6fnH-U=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "3 years ago",
      "text": "The sudden crave for Ayam Penyet had led us to “MakanShiok” coffeeshop where a variety of Halal Food can be found and different from the main stream of stalls that we can find in the nearby Hawker Center. I came to know of this stall as one of my colleagues help us to Tabao during the CB (Circuit Breaker) period and I kind of recalled that it tasted above the average.\n\nJust like a standard set of Ayam Penyet, it comes with bowl of soup, rice, vegetables, tempeh, fried Tau Gua, cherry tomato and the delicious looking piece of chicken. The soup is flavourful, garnished with fried onions and goes well with the plate of Ayam Penyet.\n\nAyam Penyet - $5.50 (Drink not included)\n\nThough the rice was not as good as I had thought ~ it was neither fragrant nor fluffy. However the chicken complemented the plain rice. If you like hot and spicy, you will enjoy their chili too.\n\nTake a look at the glistering skin of the chicken thigh and its sauce, its quite tempting, isn't it?\n\nComparing Ayam Penyet in the vicinity, there are definitely better ones but if you are looking for non fried Ayam Penyet, this should be considered as one of the better ones around the area.\n\n[Utara]\n\nNasi Briyani Chicken was special item on menu that day. The execution of the plate of chicken Briyani is a little bit different with the use of mint leaves as garnishing. Briyani rice was fluffy and fragrant with the curry gravy.\n\nThe chicken was fried and was fragrant. The meat goes very well with the rice and gravy.\n\nIt was my first time ever in ordering Tomato rice. The fluffy long grain rice has hints of tomato taste comes with a big piece of chicken meat with some gravy drenched on the rice.\n\nThe dish was rather fiery with chili coated on the chicken. It looks wet in its gravy and from the texture of the skin, the chicken was pre-fried before coating with the gravy.",
      "time": 1634353028,
      "translated": false
    },
    {
      "author_name": "inin adam",
      "author_url": "https://www.google.com/maps/contrib/107573089335236709687/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUNdVmycktWN1Gx9FeS7MC1CFhpfq4Unt_APFMjaeiNfnGQWRA63A=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "Nice varieties. Good place to have your food there. 5 stars if all the stalls are open so we will have more choices.\n\nUpdated as of 9 feb, nasi padang corner stall price very inconsistent. The rest of the stalls are ok but too bad this stall brings down the rest. When asked the female cashier, she just gave me boh chup look. Very disappointed.   7bux for 1st photo. 6bux for 2nd photo. You guys decide",
      "time": 1675916090,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1804952177203659892",
  "user_ratings_total": 825,
  "vicinity": "49 Teban Gardens Road, Block 49, Singapore"
}