{
  "formatted_address": "17 Petir Rd, B2-07 Hillion Mall, Singapore 678278",
  "geometry": {
    "location": {
      "lat": 1.3783585,
      "lng": 103.7633465
    },
    "viewport": {
      "northeast": {
        "lat": 1.379480880291502,
        "lng": 103.7647537302915
      },
      "southwest": {
        "lat": 1.376782919708498,
        "lng": 103.7620557697085
      }
    }
  },
  "name": "Maki-San (Hillion Mall)",
  "place_id": "ChIJbXbhW7sR2jERgYb9OBfATQs",
  "rating": 3.9,
  "reviews": [
    {
      "author_name": "I W",
      "author_url": "https://www.google.com/maps/contrib/107686746966044708528/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLR7qMD7CnzxdTPSlKI_8v7zMjNlXGM2jRE5RrfdOt4e5vRqw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "4 months ago",
      "text": "I always thought of Maki/Gimbap as an ingenious method of getting you to pay more for your food.  If the separate ingredients were to be laid out before you (before being rolled up), I doubt many might be willing to pay between $8 to $12 for those.  But once rolled up, people pay such amounts for what they presume they are getting.  The whole is certainly worth more than the sum of parts.\n\nSo I decided to give Maki-San a try only after I stumbled on a Grab Food voucher promotion.  You pay $21 for a $30 voucher.\n\nI was impressed by their \"What a Catch Salad\".  All ingredients were very fresh.  Their (lightly) smoked salmon didn't have an overpowering smell.  I felt so refreshed after eating it.  Fantastic value if purchased in conjunction with the Grab promotion.\n\nI was dismayed by their Little San Sushi, even though I chose the ingredients that went into it.  In the end, the rice-to-ingredients ratio was too lopsided in favour of rice.  All I could taste on eating the maki was rice, rice and more rice (see picture).  I won't order this again, not even in conjuction with the Grab promotion.  Not even if you gave me a 50% discount.\n\nA saner rice to ingredients ratio was present in their \"California Dreaming Sushi\".  Not too bad.\n\nI gave this place 3 stars - the rating was dragged down due to their Little San Sushi.\n\nDo note that this is a takeaway place - there are no seats in the shop for dining in.",
      "time": 1735481568,
      "translated": false
    },
    {
      "author_name": "Lyn Lyn",
      "author_url": "https://www.google.com/maps/contrib/111715484324240200504/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWVLDO0KmjFvmY0VUApKe3gX9S8IsKEzP1xFjWN_3a4_NYq8uMEog=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "Had shredded cucumber, ebiko, mushroom, tempura crisp. A little expensive for these ingredients. Hardly can taste the mushroom as too little.",
      "time": 1742690730,
      "translated": false
    },
    {
      "author_name": "Mohamed Malim",
      "author_url": "https://www.google.com/maps/contrib/107759202029739714866/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUC4AOiqIDa1oVnvNLPIyCF1dQWPUN-Cig7s4fJA2k6r53VOT47=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Maki San at Hillion Mall impresses me with customizable sushi rolls and fresh ingredients.\n\nThe efficient service and modern ambiance enhances my family's  experience.\n\nWhile it can get busy, the quick-moving line and adequate portions make it a great spot for a tasty, personalized meal. Recommended for sushi fans who enjoy creating their own combinations.",
      "time": 1725005527,
      "translated": false
    },
    {
      "author_name": "Low",
      "author_url": "https://www.google.com/maps/contrib/111838593380014561310/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL3LLeotFkv_BBlcv4zUtS4XKwuk_7wAkhQsicY4qE57KvU2w=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 2,
      "relative_time_description": "7 years ago",
      "text": "The entrance is located outside of, and seperate from the Hillion Mall. It is facing towards the bus stop of Bukit Panjang MRT exit A.\n\nThe eatery is quite spacious for its type (SUBWAY-like). Order forms are available upon entry. It has got a funny, fishy smell every time we go through. The concept is excellent that you get to customize your sushi or salad bowl. The variety of ingredients is also quite large. However, most of them do not taste like what they are supposed to be. Fresh produce items are also done roughly. One time we ordered asparagus, but the stems are so hard that you cant even really chew on them! The rice is also quite mushy that it is nothing like Japanese rice. Meats, in general, are disappointing as they are prepared and processed in advance, and served cold.\n\nMost staff can't really wrap the rolls well that the sushi can fall apart easily once lifted from the box. Though there's a machine that help them cut athe sushi evenly at the end, and the takeaway boxes are very cute, the basic taste of food is simply a pity.",
      "time": 1503387978,
      "translated": false
    },
    {
      "author_name": "Khern Hui Lim",
      "author_url": "https://www.google.com/maps/contrib/106723737777253111687/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVYjsMf85x2S10Ee3fKZCnU4zX5f1aZhe3_tYy0etY1wl_rT-Ph=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "7 years ago",
      "text": "Cheap-tasting, pretentious “sushi” that aren’t even made with sushi rice. The sushi rolls don’t really have much flavour to them. I bought the soba bowl and after waiting for a whole hour what I got was chunky, clumpy noodles(see attached pics)lacking in sauce, or flavour to say the least.",
      "time": 1526530822,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=814518313596847745",
  "user_ratings_total": 337,
  "vicinity": "17 Petir Road, B2-07 Hillion Mall"
}