{
  "formatted_address": "50 Jurong West Street 61,JW50, #02-23 Hawker Heritage, Singapore 648202",
  "geometry": {
    "location": {
      "lat": 1.3412561,
      "lng": 103.6974152
    },
    "viewport": {
      "northeast": {
        "lat": 1.342609980291502,
        "lng": 103.6987689302915
      },
      "southwest": {
        "lat": 1.339912019708498,
        "lng": 103.6960709697085
      }
    }
  },
  "name": "MALA YOU (麻辣友)",
  "place_id": "ChIJFWtqm_MP2jERRsh5t41P_BY",
  "rating": 3,
  "reviews": [
    {
      "author_name": "Bloody Toad",
      "author_url": "https://www.google.com/maps/contrib/113593135148233291633/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJooAGd1Q2h9WWYjEtkzermDgY3f0RcQXkZcKRrE6OLKjOnKQ=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 3,
      "relative_time_description": "10 months ago",
      "text": "Newly opened Mala stall. I decided to give it a try. Approached by a malay lady (surprised!  First time served mala stall by a malay! ). IT seems this stall is halal? (I did not check whether they has the logo)\n\nPicked my ingredients (7) of them,  no pork so I chose chicken. Handed over for her to calculate price. Came up to $21... Costly for a medium portion, but I did add quite an amount of chicken meat.\n\nThey accept CDC voucher,  but was not ready and wifi connection was down when they tried using it to scan. No choice. Cash payment it is then. She then passed me change with electronic tab.\n\nCooking - the lady put the ingredients onto what look like automated cooking machine (interesting), after that I did not go kaypo further. It took around 6 minutes before my buzzer signalled me to collect.\n\nPackaging - Good quality plastic container with good quality chopsticks and disposable wooden spoon. Packed nicely and no spill. Nice.  Good quality,  but bad for environment 😅\n\nTaste - I ordered mild spicy. They put quite a lot of dried chilli and peppercorns. They also added some spices which I usually did not find in other mala. Star anise, bay leaf and somewhat olive lookalike but do not taste like it. (Google internet picture one similar is either it's nutmeg,  or another spice named \"cashew \") They also added orange peel! Interesting!  Taste wise,  it did not have the wokhei, and I find it not as aromatic, but for those who wanted to try out the added spices you are welcome.\n\nConclusion:  taste and price should improve. Must remember this is hawker,  not restaurant.",
      "time": 1721540278,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1656286233052694598",
  "user_ratings_total": 1,
  "vicinity": "50 Jurong West Street 61,JW50, #02-23 Hawker Heritage"
}