{
  "formatted_address": "1 Cuscaden Rd, Level 2, Singapore 249715",
  "geometry": {
    "location": {
      "lat": 1.3047647,
      "lng": 103.8251569
    },
    "viewport": {
      "northeast": {
        "lat": 1.305938630291502,
        "lng": 103.8263603302915
      },
      "southwest": {
        "lat": 1.303240669708498,
        "lng": 103.8236623697085
      }
    }
  },
  "name": "Manhattan",
  "place_id": "ChIJh-KXsYsZ2jERvp0vI8ZeAOw",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Kenneth Tan",
      "author_url": "https://www.google.com/maps/contrib/104132495789756968200/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUG1_mVm-MYbLUeq9tnuPVBF2RJX2h4Fa3eGrchbDNT8C7EZfw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Had a good time at Manhattan Bar with a friend yesterday night! The sophisticated ambience and expertly crafted cocktails made for a wonderful evening. The service was relatively acceptable and the drinks were delicious. The server could have been more helpful in recommending drinks though, and the wait for drinks and titbits was a tad too slow. And they got a different drink from what my friend had ordered as well. Gotta brush up on that service level a bit. Despite this, I was overall impressed again by the attention to detail and the quality of the drinks. Will still recommend for a night out with friends!",
      "time": 1744436662,
      "translated": false
    },
    {
      "author_name": "TLC Is In The House",
      "author_url": "https://www.google.com/maps/contrib/116246063219109577345/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW2ebPCJdxHLl-TQj3diUpiuDTggmj2HgMTW59h9QzwBAwk0BrU=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "What's your poison? If you asked me, I'd go for pretty much anything at Manhattan. Yap, I'm actually vouching for them cos if there's one thing to be said, they're consistent.\n\nThe cocktails, both old and new, are well-crafted even if our palates don't always agree. We're partial to their aged Negroni but most times, we can never resist trying out something new when we drop in.\n\nThe icing on the cake has to be the food. Their smash burger is top 3 in my book, from the fries to the patty, it's da bomb.\n\nSo Kudos to the kitchen that deserves much praise for serving up perfection on our every visit. On that note, I'm frankly hard pressed to admit if I'm excited more by their food or their cocktails. Alas, it wouldn't be the Manhattan we love without both.",
      "time": 1743645084,
      "translated": false
    },
    {
      "author_name": "Lucien Hopkinson",
      "author_url": "https://www.google.com/maps/contrib/100777485846423159419/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKiHNZhWI2WJNA9uJviUliqnVPsvtDWEpU00HeNhnYInoTOnA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Where do I start? The exceptional cocktails? The brilliant food? I’ll start with the staff. Eldridge and jimmy were just incredible. Frankly, we’ve never had service like it. These are special people that make this institution even more memorable. This is now our new local due to incredible drinks and the amazing people like Eldridge and Jimmy! Highly recommend",
      "time": 1738679880,
      "translated": false
    },
    {
      "author_name": "Joyce Wong",
      "author_url": "https://www.google.com/maps/contrib/109538528137114722250/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWRGITQckv3bbVW97lGbrmc_ISE3EWbUG1vk3pJJAV4E2YGNpt1LQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "It was a pleasure to be here for their Christmas festive  mixture of cocktails!\nAnd to Aldrech and all the wonderful service staffs whom have served us throughout while we were at my table whenever we needed them (Especially to take all the beautiful photos and sharing the ingredients of the drinks 😅)\nThank you very much once again and I would recommend for everyone to come here to try and myself will also come back again! 🥰☺️🎉🥳🍹🙌👏",
      "time": 1733839875,
      "translated": false
    },
    {
      "author_name": "Goh Nai Shin",
      "author_url": "https://www.google.com/maps/contrib/101410878484704974922/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXu3cEmeioeUMlRb-d84Dfn9tre2cy24H2kURD-rBxzV1QEPk4=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Me and buddies had an exceptional experience at Manhattan bar in Conrad Orchard! The unique cocktail selection truly impressed me, particularly their signature Negroni and the guest bartender's twist on the classic. The cocktail flights offered a delightful exploration of flavors, but be warned - they pack a punch! The wine list is impressive, with even the house wines exceeding expectations.\n\nThe addictive popcorn snacks are a must-try, but beware - I devoured five bowls! The service was top-notch, attentive, and knowledgeable. The ambiance is cozy and beautifully decorated, making it the perfect spot to unwind.\n\nOverall, Manhattan bar is a gem, offering an expertly crafted drink menu, delicious bites, and a warm atmosphere. Highly recommended for cocktail enthusiasts and those seeking a sophisticated night out.",
      "time": 1728815812,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17005696398037851582",
  "user_ratings_total": 996,
  "vicinity": "1 Cuscaden Road, Level 2"
}