{
  "formatted_address": "1 W Coast Dr, #01-57/58 NEWest, Singapore 128020",
  "geometry": {
    "location": {
      "lat": 1.3164853,
      "lng": 103.7573965
    },
    "viewport": {
      "northeast": {
        "lat": 1.317744280291502,
        "lng": 103.7586182302915
      },
      "southwest": {
        "lat": 1.315046319708498,
        "lng": 103.7559202697085
      }
    }
  },
  "name": "MapleBear West Coast",
  "place_id": "ChIJ59Vwy-8b2jERbW7fMTjEgJ0",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Moony Li",
      "author_url": "https://www.google.com/maps/contrib/107866555518387743475/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU6kWrW9jJWjWQJ38RQ1kYw73qjzreH4W8rqW4aZL--6DflkNtz=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "My first time receiving Mothers’ Day gift from my kids. Thanks school for organizing the Mothers’ Day crafts with the art group.",
      "time": 1747053451,
      "translated": false
    },
    {
      "author_name": "Mandy O",
      "author_url": "https://www.google.com/maps/contrib/104242255425366004396/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLjOD_3YtxBZ1bpBIVapXS8JoH5hGFMWbltycv5jrwhzoZM9g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "This school totally deserved my 5* review. A few pointers to highlight why I would highly recommend this preschool over the others in the neighborhood.\n\n1) First and foremost, the hygiene is applaudable. They have their in-house cleaning lady that cleanse tirelessly everyday. And they are quick to act and contain spreadable disease like HFMD and influenza. For my child’s past year with the sch, there was no major outbreak.\n\n2) They have their in-house chef who cooks fresh meals for the kids daily.\n\n3) They are academically strong, not the super advanced kind but phonics, maths, science - they have them covered. And they bring in several 3rd party enrichment classes to let student opt in and out. Because of this, we cut down on alot of enrichment classes during the weekends and really focus on playing and bonding as a family.\n\n4) They are receptive to the parents’ feedbacks and really go the extra miles to address parents’ concerns.\n\n5) Lastly, I visited several school and what really made me settled on this one was that the director (overall-in-charge), Ms Rupal, is very hands-on. You see her day in day out. And the vibes from the teachers! They are passonate! You can feel they care from the heart, unlike other similarly premium sch, the teachers are often tired out when you talk to them.\n\nSo glad we came here and i hope this review helps other parents to make their decision when looking for preschool in this area.",
      "time": 1745579807,
      "translated": false
    },
    {
      "author_name": "Ibrahim Shadid",
      "author_url": "https://www.google.com/maps/contrib/115638638855153213085/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVEGhEwjAgwwNr3hJ0-ZXXy7RpsR1GqrChMmW5PqGPU5siwstnbig=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "MapleBear is a fantastic childcare center! The educators are warm and caring, and Principal Rupal ensures a nurturing, engaging environment for the kids. The facilities are clean and well-equipped, and communication with parents is excellent. Highly recommend!",
      "time": 1738637852,
      "translated": false
    },
    {
      "author_name": "Isabelle Baroz-Kuffer",
      "author_url": "https://www.google.com/maps/contrib/117176273123474259042/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ3CWqsXSpgV7HRFpsTtjxdvSut-hPrWyEDppFCytf8R5M42Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My son started at maple bear west coast at 2 years old and is very happy there. We are also very comfortable to leave him there in the morning. The teacher team, the principal and the owner are very caring to children, involved and motivated. They also listen to parents and are in close contact to us. Maple. Bear west coast offer an almost  tailor made day care, fucus on the children well-being. I warmly recommend this preschool.",
      "time": 1697075001,
      "translated": false
    },
    {
      "author_name": "taruna kalra",
      "author_url": "https://www.google.com/maps/contrib/106958568699569001763/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV4_ukyqLKR-tGsAjrmHJPUZuZPRw0JqMf2hUS9MlsfBZEOaGnS=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "I recently got my 21 month old son admitted at Maple Bear West Coast. I am extremely happy and satisfied to have taken the right decision in choosing this pre school. My son has settled in quite well. The teachers and staff including centre director Ms. Rupal ensured to put in their best effort and displayed great level of patience to ensure my son is felt welcomed. School is nicely maintained with good sized indoor sand and water play area and provides a nurturing environment with multiple activities organised as part of ‘learning through play’ process. Also, it’s worth a mention that proper hygiene and sanitisation standards are being followed in the current Covid times to ensure well being and safety of all kids. The centre is under able hands of Ms. Rupal who has a wealth of experience in the field of eduction.",
      "time": 1604228067,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11349286806607588973",
  "user_ratings_total": 9,
  "vicinity": "1 West Coast Drive, #01-57/58 NEWest"
}