{
  "formatted_address": "100H Pasir Panjang Rd, #02-01, Singapore 118524",
  "geometry": {
    "location": {
      "lat": 1.2781867,
      "lng": 103.7964805
    },
    "viewport": {
      "northeast": {
        "lat": 1.279562930291502,
        "lng": 103.7977244802915
      },
      "southwest": {
        "lat": 1.276864969708498,
        "lng": 103.7950265197085
      }
    }
  },
  "name": "MapleBear Labrador",
  "place_id": "ChIJyUrpXLgb2jERXuA6RQN6B04",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "benjamin tan",
      "author_url": "https://www.google.com/maps/contrib/107438831695985625174/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVV2W8d_CkaKcHaLTADGpwQkGG9eUyx0tWk1PuDHk6A_PWTG7C5=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "My son has been attending MapleBear Labrador for four years, from the age of 2 to 6, and it has been an incredible journey for him and our family. Before deciding on MapleBear Labrador, we visited many preschools, but none came close to offering what this branch did. Choosing MapleBear Labrador has truly been one of the best decisions we’ve made.\n\nWhat initially impressed us was the school’s spacious and welcoming environment, featuring an indoor playground and a thoughtfully designed outdoor program conducted twice a week. The school’s proximity to Hort Park allows children to explore nature while staying active, which has been a highlight of the curriculum. But beyond the facilities, what truly stood out was Alan, the school owner. His passion and sincerity were evident when he shared his philosophy: that every child is unique and gifted in their own way and should be given the space to explore, learn, and grow.\n\nAlan’s belief is beautifully reflected in the incredible teachers he has brought on board. Each teacher embodies the spirit of love and nurturing, treating every child with genuine care and respect. I will dearly miss their warm smiles and the heartfelt greetings they give to each child as they arrive at school. It’s these small yet meaningful gestures that create such a positive and loving environment for both the kids and their parents.\n\nOver the years, my son has thrived at MapleBear. He has enjoyed every moment of his preschool journey, made wonderful friends, and grown into a confident, independent young boy. The teachers have played a pivotal role in his development—teaching him essential life skills like feeding himself, toilet training, holding a pencil, writing, and even taking responsibility for revising his spelling. Their dedication and patience have been extraordinary, and I’m grateful for all the effort they’ve poured into helping my son grow academically, socially, and emotionally.\n\nAs my son graduates to primary school, we reflect with immense gratitude on the safe, nurturing, and enriching environment MapleBear Labrador has provided. Thank you, Alan, and your amazing team, for shaping my son’s formative years and giving him such a solid foundation. MapleBear Labrador has been more than just a preschool - it’s been a second home for our family, and we’ll always cherish the memories and relationships we’ve built here.",
      "time": 1735895832,
      "translated": false
    },
    {
      "author_name": "Rosa Seo",
      "author_url": "https://www.google.com/maps/contrib/106166289965558555329/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVbTpc08KFPByIyfMXJmWpV4ymMJ5q8MKA1r6HaqCSRJ8HIL9qv=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 years ago",
      "text": "I send my 2-year-old son here for a playgroup and he is always in a playful and lively mood when I pick him up after work. The almost real-life feeds of this day on the Maple Bear mobile app let me know what he is eating for snack and lunch, when his diapers are changed, how long his naps are, and when he is dropped off & picked up. Principal and teachers communicate regularly and in details of how my son’s day went.",
      "time": 1533296949,
      "translated": false
    },
    {
      "author_name": "Sunil Jaat",
      "author_url": "https://www.google.com/maps/contrib/115634375999575992571/reviews",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLgSchg6LatL-vkjSEIXjYduYlNnkC_b75TR0RoDXZ5fK3JvQ=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "5 months ago",
      "text": "",
      "time": 1733856216,
      "translated": false
    },
    {
      "author_name": "C S",
      "author_url": "https://www.google.com/maps/contrib/115328420894116036527/reviews",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ-Utj2HYItHD6DMllBg3FuUf_pQU7nV9qXw0LSA1YQmWY72Zg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "",
      "time": 1732932200,
      "translated": false
    },
    {
      "author_name": "Gk Sung",
      "author_url": "https://www.google.com/maps/contrib/105784031139278784611/reviews",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJr4doXYvH2JSTzR9ZE6m4hX-_FF4aE9qqhq7fbX07LnyrEhA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "",
      "time": 1651672088,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5622596814260330590",
  "user_ratings_total": 7,
  "vicinity": "100H Pasir Panjang Road, #02-01"
}