{
  "formatted_address": "1 Springside Ave, Singapore 787013",
  "geometry": {
    "location": {
      "lat": 1.4032266,
      "lng": 103.818977
    },
    "viewport": {
      "northeast": {
        "lat": 1.404473180291502,
        "lng": 103.8202890802915
      },
      "southwest": {
        "lat": 1.401775219708498,
        "lng": 103.8175911197085
      }
    }
  },
  "name": "Maplebear @ Sembawang Springside",
  "place_id": "ChIJ0XyK0j8T2jEReypp3qe7G3o",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Chantel Ong",
      "author_url": "https://www.google.com/maps/contrib/110626905966549270177/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX--_DnW4UATduYvCYaQVAidmaCKtNLL56WPBo92H-8pgSa-8Ricw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "As a working mother with a very busy schedule, I am very thankful and appreciative of the team of educators at Maplebear Sembawang Springside. They are quick to keep me informed of my kid's wellbeing and progress. I especially love the daily updates the centre provides! The centre directors are experienced, loving and caring. They constantly keep me updated of the school curriculum and are very approachable! Most importantly, my kid loves going to school! Thank you, Sherlyn, Alvin and team! ❤️",
      "time": 1646457602,
      "translated": false
    },
    {
      "author_name": "Joyce T",
      "author_url": "https://www.google.com/maps/contrib/106846300400107876864/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUg0A_WOX_uIvP72sGsPdIWIE0KEDoOMx-cROn2RdI6wyG4zLcU=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "Thank you, Maplebear Springside, for giving my daughter such a wonderful learning experience from 2023 to 2025. Your team has created a warm and nurturing environment where children truly flourish. I've seen remarkable progress in both her English and Chinese skills, and more importantly, watched her grow in confidence and social abilities.\n\nThe balance of academic learning with play-based activities is done well and shows thoughtful consideration here. I especially appreciate the dedicated outdoor playtime for psychomotor development, and how each class has their own space, which helps reduce the spread of illnesses.\n\nSpecial shoutouts to:\n• Ms Li (李老师)- You are really an exceptional teacher who makes learning fun while understanding and catering to each child's unique needs. Your thoughtfully planned activities, creative use of tools and props, and deep understanding of child development make such a difference in my daughter's Chinese proficiency, confidence in herself and enjoyment of school! Thank you so much for supporting and nurturing the children so well.\n\n• Teacher Lee - similar to Ms Li, you are so good at managing a busy toddler classroom while ensuring quality learning. You put in so much energy and dedication into creating engaging lessons, telling stories. My girl has grown so much in singing, reading and writing too :)\n\n• Teaching Assistant Shirley - Your gentle, patient nature is perfect for supporting young children, especially those new to school. Thank you for always taking good care of the children, and supporting the two teachers so well that the children can learn well!\n\n• Ms Karine (Former Principal) - Thank you for your exceptional leadership and dedication, always going above and beyond—from teaching when needed to being consistently responsive to parents.\n\n• Admin team\n- Thank you, Sherlyn and Alvin, for your understanding and responsiveness to parents' needs!\n- Principal Elsa, your ability to connect with the children and create a fun learning environment, even in such a short time, is truly impressive. thank you for being such a cheerful presence!\n\nWe will miss this school community dearly!",
      "time": 1747714343,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8798832626663762555",
  "user_ratings_total": 2,
  "vicinity": "1 Springside Avenue"
}