{
  "formatted_address": "77 Pasir Ris Ave, Singapore 519732",
  "geometry": {
    "location": {
      "lat": 1.3831576,
      "lng": 103.9433305
    },
    "viewport": {
      "northeast": {
        "lat": 1.384530430291502,
        "lng": 103.9446928302915
      },
      "southwest": {
        "lat": 1.381832469708498,
        "lng": 103.9419948697085
      }
    }
  },
  "name": "MapleBear Pasir Ris Park",
  "place_id": "ChIJrQjp4Ks92jERr2SviS264aQ",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Alex Lim",
      "author_url": "https://www.google.com/maps/contrib/110482115800011389417/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJONuK4dr_G3Vn5qOWwYCWQZyQMe7npm82pVJ2bYv537U3vHg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "MapleBear Pasir Ris Park was renowned for their care for the kids. My son had been well taken care by the teachers and staff and looked forward to going school every day. The place was conducive for learning and the teachers were all experienced and never failed to unleash the full potential of every kid that came upon their path. Keep up with the good work and continue to bring up the standard of early childhood to greater heights!",
      "time": 1580386758,
      "translated": false
    },
    {
      "author_name": "Aakansha Verma",
      "author_url": "https://www.google.com/maps/contrib/108842807110627305818/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUpzAG06SvQDO6RKt_3hUPQ6s5s19xh1H_VN8dABCtg3MtNHcE=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "Our little girl Arya started school at Maplebear Pasir Ris Park branch when she was 20 months old.\n\nSchool hunting for little ones can be quite exhausting, we admittedly visited multiple schools but our decision making became much easier when we found Maplebear as it fit our two primary criterias: the play-based learning approach and the fact that the centre does not just have an outdoor enclosed and private play area, but is also located stone's throw away from the lovely Pasir Ris Park and beach!\n\nMe and my husband had always hoped to send Arya to school at a relatively young age as they really learn so much at school observing their young friends, especially at a time like this with the pandemic, where our kids cannot get as much exposure to playing with other kids their age outside of school, the social bonding element has become especially challenging.\n\nWhen Arya started school, needless to say, the first three days of dropping her off and goodbyes were the hardest - not just for her but for us too! However it only took her a few minutes to feel completely at ease once she was under the care of her lovely teachers and amongst her new friends.\n\nIt has been over 4 months now since and it is safe to say that Arya absolutely loves going to school - we're quite lucky there are no tears when we wake her up in the morning as she is always excited to get ready to don her cute uniform - a red Maplebear tee and her black skort! Who wouldn't love school at this age - there's lots of arts and crafts, singing and dancing, playing by the beach, and all things fun, all whilst continuing to learn - not just the usual alphabets, colors, numbers, but on how to become confident and self sufficient too.\n\nA big thank you to Teacher Doris for always being super attentive, caring and meticulously tracking Arya's overall development. Teacher Doris keeps us posted on our daughter's progress religiously. Also grateful to Arya's Mandarin teacher Wang Lao Shi for her constant love and support.\n\nWe'd like to thank all the teachers and staff for making school time enjoyable and taking so much effort in ensuring that our little ones are loved, feel completely safe and learn while having lots of fun.",
      "time": 1618396502,
      "translated": false
    },
    {
      "author_name": "蔡思宁",
      "author_url": "https://www.google.com/maps/contrib/111378630860267051643/reviews",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK6kRiBdvOy-QoEkCyE4J-uqNwMxZEG1xMIAa3t43Uhp2UNmw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "",
      "time": 1723727356,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11880981996726346927",
  "user_ratings_total": 3,
  "vicinity": "77 Pasir Ris Avenue"
}