{
  "formatted_address": "Singapore",
  "geometry": {
    "location": {
      "lat": 1.2760601,
      "lng": 103.8550414
    },
    "viewport": {
      "northeast": {
        "lat": 1.27920995,
        "lng": 103.85630315
      },
      "southwest": {
        "lat": 1.275010150000001,
        "lng": 103.85242375
      }
    }
  },
  "name": "Marina Bay",
  "place_id": "ChIJ63796xAZ2jERMe6WUY-13n4",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Edwin Petrus",
      "author_url": "https://www.google.com/maps/contrib/114785935323023325370/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjViVW8tEXRYc3BatiNcUhGofE27kumEgAfonPrCpL4BlwYPaqBsCw=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Marina Bay MRT station is an interchange station among three Singapore's metro lines: North South Line, Circle Line, and Thomson East Coast Line. It offers seamless transfer among three lines which passengers do not need to tap in and tap out. The signages at the station may clearly direct passengers to move around lines or just exiting the metro system at this station.\nThe interchange station was clean and comfortable with cool air conditioning system. Public toilet is also available here.",
      "time": 1730338859,
      "translated": false
    },
    {
      "author_name": "Anand Maria Ignatious",
      "author_url": "https://www.google.com/maps/contrib/103419252108664168842/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX0KA3fXYJM_SlA_l8ZU8LvRkG1Kz7SYxCfhK5oJmfE8caSAxPU=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "Marina Bay in Singapore is a stunning example of modern urban planning and architectural brilliance. Located at the heart of Singapore's downtown, it is a vibrant hub that perfectly encapsulates the city-state's blend of innovation, luxury, and cultural diversity.\n\nOne of the most iconic features of Marina Bay is the Marina Bay Sands, a massive integrated resort that dominates the skyline with its three towering structures connected by a unique rooftop SkyPark. The SkyPark offers breathtaking panoramic views of the city, especially at sunset when the skyline is bathed in a golden glow. The infinity pool at the top is also a must-visit, offering a surreal experience of swimming with the city at your feet.\n\nThe area around Marina Bay is equally impressive. The Marina Bay Promenade is a beautifully designed waterfront walk that provides scenic views of the bay and is a perfect spot for an evening stroll. The Merlion Park, featuring Singapore's iconic Merlion statue, is another highlight, drawing tourists and locals alike for photo opportunities and to enjoy the atmosphere.\n\nFor those interested in culture and the arts, the ArtScience Museum, with its lotus-inspired design, offers a range of exhibitions that blend art, science, and technology. The Marina Bay Sands itself houses numerous high-end shops, restaurants, and a world-class casino, catering to every kind of luxury experience.\n\nThe Gardens by the Bay, located just a short walk away, is a futuristic garden space with towering Supertree structures that light up beautifully at night. The Cloud Forest and Flower Dome within the gardens are also spectacular, offering a unique blend of nature and technology.\n\nTransportation in and around Marina Bay is seamless, with excellent connectivity via the MRT and buses. The area is also pedestrian-friendly, making it easy to explore on foot.\n\nOverall, Marina Bay is a must-visit destination in Singapore, offering a mix of luxury, culture, and breathtaking views that make it one of the most memorable places in the city. Whether you're there for shopping, dining, sightseeing, or just soaking in the vibrant atmosphere, Marina Bay has something for everyone.",
      "time": 1724215069,
      "translated": false
    },
    {
      "author_name": "Geri Q",
      "author_url": "https://www.google.com/maps/contrib/102558929303329687344/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJrmkXnL0qm3yPRCz0TFq5Bo_yOx_fP1VWsIKGhYFUNiwjmBpg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "If you take TEL (Brown) to change to CCL (Circle Orange) please do not take the wrong escalator or will lead to out of station and then get charge again when entering the other gantry. Ugh. Put CLEAR SIGNAGE up at your station for exit and for people who want to change to CCL line.",
      "time": 1739956332,
      "translated": false
    },
    {
      "author_name": "Gerg House",
      "author_url": "https://www.google.com/maps/contrib/101248749349265886177/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLLhbypvVr8gBy2PueHA9ZUNpBwYcDf-X66k0aXxLl1SXj09Q=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "3 years ago",
      "text": "Interchange station for North South , Circle and Thomson East Coast Line. Amenties surrounding the station is sparse. So do not expect to travel here often unless to change lines. Walking distance between MRT trains is some distance so prepare to do some walking.",
      "time": 1642831905,
      "translated": false
    },
    {
      "author_name": "Shuren Lin",
      "author_url": "https://www.google.com/maps/contrib/116848753776391265221/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLQZwkscImU79lXk7BzPtkHmMJWx-s8ZxxTgfZvLF82v7wvIA=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "2 years ago",
      "text": "TEL line is very new but have to walk a long way from nsl. Usage is currently low during weekdays and I still see staff directing people. Probably need to have improvement in infrastructure. Also saw some water leakage which is not quite right for a new station",
      "time": 1675436582,
      "translated": false
    }
  ],
  "types": [
    "subway_station",
    "transit_station",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9141943920762482225",
  "user_ratings_total": 168,
  "vicinity": "Singapore"
}