{
  "formatted_address": "421 Race Course Rd, Singapore 218668",
  "geometry": {
    "location": {
      "lat": 1.3158832,
      "lng": 103.857507
    },
    "viewport": {
      "northeast": {
        "lat": 1.317161330291502,
        "lng": 103.8589303302915
      },
      "southwest": {
        "lat": 1.314463369708498,
        "lng": 103.8562323697085
      }
    }
  },
  "name": "Marymount Bakehouse Singapore",
  "place_id": "ChIJHwT_cRAX2jERH0o5ukJ2T_o",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Rodney Loh",
      "author_url": "https://www.google.com/maps/contrib/105326284804742259739/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVpmpNrB2WqiTW-mWcnrgJLwLFqYamnkeUMhyq_t2Cl_8STQwnI=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Great food at Marymount BAKEHOUSE. The interpretation of the shepherds pie is refreshing,   less heavy that the traditional ones and very full of flavours. The lemon cream morel sourdough pasta is also very appealing to the palate with the refreshing lemon cream taste. It also makes the pasta less heavy and very light and flavourful. The service is great and the wait at the place is not too long as the table turn over is fast. Recommended",
      "time": 1744793856,
      "translated": false
    },
    {
      "author_name": "Rachel Lee",
      "author_url": "https://www.google.com/maps/contrib/111701172499580628303/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWBcAE31JASI9t9RnDs2rgV5HCiCekNCsNh_YDrpHX-j0JuBXDg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "- U P D A T E -\nCame again on 26th Apr, with the same friend, to of course try the pasta! Ordered the Shepherd's Pie too. oh goodness - the pasta was tossed with lemon cream - what a game changer.\n\nThe citrus was not overly strong, but enough to cut through the cream to give us a refreshed palate every bite. Made with sourdough starter, the in-house made pasta had a lovely al dante texture throughout.\n\nThe Shepherd's Pie has a wonderful crust on it, topped with mashed potato, sour cream, and what we felt was fried gnocchi. Instead of minced beef, we got a surprise: pulled beef. Cooked to perfection, it was beautifully seasoned and tender - the contrast of this with the mash and crust - just wow.\n\nMy friend was interested in buying sourdough to bring home, but we were there at roughly 3+pm again, and a lot of the sourdough was already sold out. Do get there early for more options!\n\nWill definitely be back!!!\n\n-----\nFirst time here on 8th Feb, brought by a friend. I must say, my mind and taste buds are blown away. I must come back, and on an empty stomach.\n\nWhat we ordered was fresh and... i don't even know how to use words to describe the blend of flavours and textures i experienced that day. You really have to come experience it for yourself.\n\nWe sat next to the kitchen, which had large windows so we could observe what was happening. A staffer passed and saw that we were very curious and interested in what was going on and stopped to explain and describe what they were doing. It was an incredible experience.\n\nThis same helpful person also shared with us the sourdough process, and that they also make their own pasta from sourdough starter! I am excited to come back to try that for sure.",
      "time": 1745688001,
      "translated": false
    },
    {
      "author_name": "Alan Tan",
      "author_url": "https://www.google.com/maps/contrib/103801214611209064283/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUqOkQAy5TCUpHEtjF56vXMJ_I6MCpkmeP8MJQEwJSkUsXklzBC=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "A very special cafe that specialises in pies and also offered other cafe food. Love the variety of quirky and unique pies offered in house. We tasted the drunken chicken, which is essentially good. The pie is quite filling and is enough as a standard meal itself if you are not feeling too hungry. I wanted to have more pies but could not due to the above reasons. Also, I wanted to try the other main dishes. In total, 2 persons share a pie, 2 main courses and also coffee. Would definitely want to visit here again.",
      "time": 1746519990,
      "translated": false
    },
    {
      "author_name": "Grace Sim",
      "author_url": "https://www.google.com/maps/contrib/114737788242403804330/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ5rdZXURj7PgjKh0NHwhXgkGxzzFvDws-bBdZYF4winPmQEg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Have loved MMBH since their early home-based bakery days during COVID-19. Their loaves were a real highlight of, and sustained my family through, the circuit breaker.\n\nSince then, MMBH has come such a long way and only gotten more and more creative with their offerings and flavours.\n\nStrongly recommend their sourdough loaves which have an incredible crumb, their black garlic butter, their pies (shepherd’s pie is my fav) and their tangy lemon pasta! Recently tried their chicken noodle soup + panzanella salad - both were homey, rustic and just delicious.\n\nWith their delivery option, they’re also always a go-to for potlucks/hosting dinners - guests are always impressed by the look of and even more so the taste of MMBH’s food.\n\nService is always warm and cheery. It’s a joy when I get to chitchat with the friendly staff at the counter.",
      "time": 1743619567,
      "translated": false
    },
    {
      "author_name": "Dc Lim",
      "author_url": "https://www.google.com/maps/contrib/114386808303009012506/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV3WWVDC6nY1y88VGebd6_3Viy3z0pYA2IXYE6DZUBSku7GIcUq5w=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Had a wonderful experience at Marymount Bakehouse Singapore! The staff were incredibly warm and welcoming, providing attentive and friendly service throughout our visit. The highlight was their delicious Shepherd’s Pie—made with freshly braised beef, it was rich, flavorful, and perfectly comforting. The quality of the ingredients truly stood out, and every bite was a delight. The cozy atmosphere made it an even more enjoyable experience. Highly recommend this place for anyone looking for great bakes and excellent service. Will definitely be back for more!",
      "time": 1739438100,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "bakery",
    "restaurant",
    "store",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=18036765061606361631",
  "user_ratings_total": 210,
  "vicinity": "421 Race Course Road"
}