{
  "formatted_address": "723 E Coast Rd, Singapore 459071",
  "geometry": {
    "location": {
      "lat": 1.3122359,
      "lng": 103.922917
    },
    "viewport": {
      "northeast": {
        "lat": 1.313543680291502,
        "lng": 103.9242759802915
      },
      "southwest": {
        "lat": 1.310845719708498,
        "lng": 103.9215780197085
      }
    }
  },
  "name": "Masalaa Bar",
  "place_id": "ChIJLfD_pN8j2jERCH3WFHh6RN8",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Narendra Mehra",
      "author_url": "https://www.google.com/maps/contrib/112490221553463694651/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJcRIpwTycX5h3Vs6Pm308Jh3iyyeNRrZ6lB8Ma-rX_crZKJv4=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "Masalaa Bar restaurant situated on East Coast Road in Singapore is a nice lively place for Indian street food and the regular vegetarian and non vegetarian items. Sunday afternoon the place was full. Fortunately not much waiting. The MB Chicken Masaledar was excellent. The butter nans were perfectly done. Pani puri was a bit of a disappointment. Not enough fillings. The khau galli kheema pau was decent. Overall a good experience. Prices are reasonable. Enjoyed the food and ambiance. Will surely visit again.",
      "time": 1737285540,
      "translated": false
    },
    {
      "author_name": "Bhavya C",
      "author_url": "https://www.google.com/maps/contrib/104800051445197212658/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX6r_1GmdbRHmfuINShy0eXVm15eMZ3ZPTVE2hKd-3F6fU7DXLi=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "Came by for lunch, but unfortunately, it didn’t live up to expectations. The service was friendly, but the food was so underwhelming. We had -\n1. samosa chat: somewhat messy to look at, heavy on some spices, overall it was ok. Nothing more, nothing less.\n2. Surmai fry: found this exceptionally poor and inedible. My very first bite was a bitter rank mouthful, gave it another try - the batter coating on the fish was off, it’s so heavy handed and was just a terrible mix of undercooked spices, overcooked fish that wasn’t fresh, most likely frozen. Just terrible everything. And you’re spending a decent money for this dish by the way.\n3. Dal Makhani: it’s called ‘MB special dal makhani’ - sorry to say, we found this too lacklustre in flavour and nothing special, not quite as authentic as one would hope.\n4. Pista kulfi: it’s as if the worst was yet to come - the kulfi was served rock solid! It’s Straight out of the freezer. So once you get past the unappetising and wickedly suspicious unnatural green appearance of the pistachio kulfi that you think for a moment is probably what a paan kulfi should be like, better be prepared to spend a good portion of your time and strength to get to your first bite on your spoon. After a fair bit of struggle to make a dent in that solid lump we were served, I was just ready to give up. Husband held it in his hands to warm up the container and then we managed to even get our spoons in the thing. Now one would wonder - was no one taking notice of our struggle? or they just couldn’t care (so service is not attentive after all), and why not serve it after loosening up the ice cream in a warm water bath first? Also, the kulfi is not good, not worth it at all - more water content hence the state of it.\n\nThis was very frustrating for a Sunday lunch. And For the price, and the smaller portion sizes, was expecting much better quality and taste. Had been there few years earlier and we remember it was so much better. Unfortunately, I’m not sure if this was just an off day, but I won’t be rushing back anytime soon.",
      "time": 1733652428,
      "translated": false
    },
    {
      "author_name": "Stephanie Hale",
      "author_url": "https://www.google.com/maps/contrib/118047026544237739365/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJi4IVKZAEfnAcVhNsUDcNVkg7UVBSCkaJtGZQrm8ZmMDSwZg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "10 months ago",
      "text": "This was one of the worst dining experiences. Although there were many tables available when we went, they squeezed us in a corner table.\n\nWe requested to be seated at a table that was empty but the bald guy said that it was reserved. Throughout our dining no one came in to that table and it remained unoccupied the whole time.\n\nThe food and the service were below average to say the least. There is nothing special about the food.\n\nIt’s quite unhygienic as well. The waiters are always rushing. The waiters are very young, probably working illegally as students or something, and do not know how to take an order and serve an order.\n\nPlease avoid this restaurant at all cost. You can find many other good North Indian restaurants at way reasonable prices.\n\nUtterly disappointed! 😔",
      "time": 1721537647,
      "translated": false
    },
    {
      "author_name": "Vishal Shirsat",
      "author_url": "https://www.google.com/maps/contrib/116744492848799178941/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW0-q-CO8MYuhbrg-jNqybe6Q0IA_HFV_LtLtZIQV1OzF3hbptzDw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Masalaa Bar is a super good place for very good food, a nice ambience, and ever-smiling service. We chose this place for dinner with friends, and although we had to travel a bit to reach this place as we live in the western part of Singapore, it was fully worth the travel. We ordered the Mumbai street food, Vada Paav and it was super delicious, as we know the real taste of it back in India. There is also a good variety of drinks (alcoholic and non-alcoholic), and the food menu, although looks a little small, includes all of the items that one needs to taste good Indian food. We ordered the standard starter items like chicken and fish tikka and peanut masala, but what surprised us was the mutton sukka. It was very filling and tasted good. To finish the dinner, we ordered some Veg Biryani, and it also tasted as expected and better than expected. The ambience of the place is very pleasant, and the chairs and tables are comfortable to sit at. The service is good, and they suggested some dishes, which we placed an order for and were not disappointed.",
      "time": 1729670154,
      "translated": false
    },
    {
      "author_name": "Sonal Sathe",
      "author_url": "https://www.google.com/maps/contrib/113125912119074899987/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW_P5BZ8MtKQEYNFEm4G2uJsugkwH_EzLPNwejFKL21P264N7F3=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "We went for their Konkani Gazalee Seafood festival last weekend. All 5 of us had their prawn thali. The prawn curry and fried prawns were quite good and even the sol kadhi was nice (last time was not good). Amboli was very good too! We ordered extra bombil and surmai fry and both were tasty.  The mutton sukha we ordered was excellent!\nOverall, we had a good experience with the thali (spice level was just right!)\nThe desserts, however, were just average. Kulfi (pista and mango) was okay. The gulab jamun was good but served at some burning temperature (clearly microwaved)... burnt my tongue :( and I had to wait like ages for it to cool down. Not happy with this.\nDefinitely will be back to try more food!",
      "time": 1737951078,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16088118425038519560",
  "user_ratings_total": 2651,
  "vicinity": "723 East Coast Road"
}