{
  "formatted_address": "275 Braddell Rd, Singapore 579704",
  "geometry": {
    "location": {
      "lat": 1.3430944,
      "lng": 103.8520901
    },
    "viewport": {
      "northeast": {
        "lat": 1.344559330291502,
        "lng": 103.8535443802915
      },
      "southwest": {
        "lat": 1.341861369708498,
        "lng": 103.8508464197085
      }
    }
  },
  "name": "Masjid Muhajirin",
  "place_id": "ChIJSwO-imwX2jERQL2TDbrTvTw",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Eddy Ram",
      "author_url": "https://www.google.com/maps/contrib/115337872424234672400/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJXc1fKSEWJUiNuRtfjlbBT_hbLl8ZjkByPI5OrRWEUWQIzfw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Update Review-31st March 2025\nNow that Ramadan sadly has just passed, hence my feedback on my many patronage to Masjid Muhajirin, among other mosques.\n\nI'm deeply impressed by the dedication of the volunteers.  Haji Alex( pictured in red shirt) and Haji Hussain( pictured in white top standing), in particular, fostered a welcoming and inclusive environment for all worshippers, regardless of background. Their attentiveness, including Haji Haron, Haji Omar and Encik Nasrin was remarkable; noticing me not having my Iftar(only korma and water consumed) due to personal prayer I want to achieve, they thoughtfully saved food for me.  The  foreign volunteers, mainly Bangladeshis, displayed exceptional commitment, their selfless service truly inspiring.\n\nUstaz Ashraff's unwavering support and helpfulness also deserve recognition. Ustaz goes beyond his duties and always ready to be hands on deck.\n\nFinally, I was fortunate to meet and mingled with the honurable Chairman, Haji Zafran, a humble and insightful leader who values his staff and volunteers. His down to earth persona, genuine care and his people's managament will inspire all and hence it will make everyone want to contribute to his vision for Masjid Muhajirin's success.\n\nThank you Haji Alex/Hussain, and to all the volunteers.\n\nMr.Chairman Haji Zafran sir, thank you once again and wishing you more successes your vision deserves.\n\nSelamat Hari Raya, Maaf Zahir & Batin.\n\nAfwan,\n\nEddy (The Mosque Hunter)\n....................................................\n\nAssalamuailikum!\n\nFirst & Foremost, a big gratitude to Encik Isak, aka Mr.Alex who heads the operation at our holy Masjid Muhajirin. Gratitude also to Wak Nasrin, Encik Omar , Encik Zahid and last but not least Encik Hussain, aka Mr. Fitness Iron Man. I hope i got his name right, who cycles daily from Bishan.My humble apology if I am wrong. More on these fine ambassadors later.\n\nToday's Khutbah Jumaat, the subject is close to my heart. Don't get me wrong all Khutbah Jumaat is of utmost importance and need to listen too with attention. Today's subject is about Merperhalusi Adab dalam Solat or Refining Our Etiquette in Prayer. I wont dwell more on it but lets respect others in attendance so we all can focus our our intentions to Allah swt. Every individual should and must adhere to what is being sermoned to us today. It is all about making effort and upbringing. Thank you Ustaz Ahmad Dahri.\n\nNow back to our respected gentlemen that I mentioned in the begining. Encik Alex, as everybody is familiar with this name, always ensures the daily operations is of high standards, set up, all in attendance are comfortable, requests that he always try to accede to...I salute his efficiency in providing the total expereince for all of us attending prayers. Today Mr. Mike made an effort to provide me food after Isaa'h prayers as I was starving and weak 🙏.\n\nMasjid is a place of peace, calm and serenity( not noisy) that we devote our allegiance in Islam and Allah swt. But a bonus is the volunteers at the Masjid that makes the Masjid a place to welcome is in open arms. Someome you can talk to and ask for advice. Very approachable. Thank you Enciks, Nasrin, Omar and Ibrahim and Zahid🙏.\n\nBtw, small suggestion may we have health classes headed by Mr.Hussain. Fitness is important in our daily lives towards our ability to pray.\n\nLast but not lease abig thank you to the cleaners. Very clean toilets. Thank you so much.\n\nTo the managemt, please print this for our respected gentlemen to show their services are valued and Allah is all seeing and all knowing. I will check if they received it. 🫡\n\nMay Allah bless us all and to the best month that we all look forward to Ramadan\n\nAfwah,\nServant of Allah\nEJ",
      "time": 1743835461,
      "translated": false
    },
    {
      "author_name": "Nor Azman Bin Sulaiman",
      "author_url": "https://www.google.com/maps/contrib/101102877818340666871/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUMu3q0MUfMSIygAjWkX4pzRHdx-vRfeTMUKkKV2Zu6T7LDZmhD=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Come her for Fridays prayer. Good clean place.. Recommended..👍🏾👍🏾👍🏾",
      "time": 1735131025,
      "translated": false
    },
    {
      "author_name": "meer",
      "author_url": "https://www.google.com/maps/contrib/106965501845054584952/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWOjRjFOQj-p5MBlA162w4rbmcUi6Hmr_0WN170F2gKvcp7AetIlQ=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Located in Braddell Road, in Toa Payoh North area, Singapore.\n\nThis mosque is located in Singapore Islamic Hub. Macam masjid-masjid lain, masjid ini sepenuhnya tidak menggunakan aircond dan pengudaraan air luar yg masuk dengan beberapa kipas bagi ventilasi kawasan.\n\nThe mosque is well ventilated.\n\nThere is bus stop nearby where you can take a ride from Bishan Interchange or Bishan MRT. I took a ride from Ang Mo Kio also can. Need to transfer bus la. Very convenience.\n\nThe parking got basement car park. Also got 3 level of praying area. Ground floor for men, 1st floor for women, then the upper level reserved for jemaah if crowded.\n\nNice place to pray terawih. Very good place. Got 2 projectors that will be projecting the info and ads for us like donation etc.\n\nIn Ramadan, fasting month, got makanan / food for berbuka puasa. But no moreh.\n\nRate: 8/10",
      "time": 1679932204,
      "translated": false
    },
    {
      "author_name": "Jasim uddin",
      "author_url": "https://www.google.com/maps/contrib/102739945804248884111/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU_ZkQLqIW0ule77tSPywA0r-JZA9ltFWegCkQzbHtxgGNfW3hh=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "The masjid has been re-built as part of the Singapore Islamic Hub development and was opened to public in January 2009.\n\nMasjid Muhajirin is the first masjid to be built under the Mosque Building Fund. Back then it was easily recognizable by its prominent dome and minaret at the entrance of the building.  Sited next to the Islamic Centre of the Islamic Religious Council of Singapore, it was completed in April 1977 with a capacity of 1400 people and serves Muslims of all ages living in Toa Payoh and Bishan.\n\n📍 Location: 275 Braddell Road Singapore 579704",
      "time": 1742106734,
      "translated": false
    },
    {
      "author_name": "Amirul Muhammad",
      "author_url": "https://www.google.com/maps/contrib/114314957343623963401/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWUq31wQeVgPvcySUrRfOwMt5EBSX2bUXICZTZhXFAKB9EXCLLQhA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "Love the masjid, very nice and got plenty of space for muslims to pray.",
      "time": 1745284169,
      "translated": false
    }
  ],
  "types": [
    "mosque",
    "place_of_worship",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4376887208919153984",
  "user_ratings_total": 244,
  "vicinity": "275 Braddell Road"
}