{
  "formatted_address": "149A Towner Rd, Singapore 321149",
  "geometry": {
    "location": {
      "lat": 1.3186389,
      "lng": 103.859489
    },
    "viewport": {
      "northeast": {
        "lat": 1.320173930291502,
        "lng": 103.8609986302915
      },
      "southwest": {
        "lat": 1.317475969708498,
        "lng": 103.8583006697085
      }
    }
  },
  "name": "Mathland Academy",
  "place_id": "ChIJKZYyq4IX2jERfQkgR9skS20",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Pero Cornelius",
      "author_url": "https://www.google.com/maps/contrib/115507529181331877742/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJQc3GG1NEnN2rRGgnqa8w5_iVYw-DH_zNn2W89KI0QDZiurdk=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "In Secondary 3, i was struggling with my A-Math. After going for lessons with Ms Erica, I was more motivated and inspired and my Math had started to improve. I eventually scored an A1 for my A-Math in O levels.\n\nMs Erica makes her lessons engaging and interesting. Shes also a caring teacher and looks out for her students. She gets along with everyone well and her lessons are straight forward and she makes the concepts easy to understand. She even provides her own detailed and summarised notes that are useful and easy to understand. During exam periods, she would take time out of her day to consult me and teach me even if its late at night or if it reduced her own free time.\n\nEven after O-Levels, Ms Erica continued to teach me during Junior College for H2 Mathematics where I scored a B for A-Levels. I am truly grateful to have an incredible teacher like Ms Erica as my tutor for 4 years and would recommend her to my friends and anyone who is looking for a good tutor.",
      "time": 1744533868,
      "translated": false
    },
    {
      "author_name": "Jowell Toh",
      "author_url": "https://www.google.com/maps/contrib/113970360391863756410/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLkK9Mr3zxLltJBrrg_KIRbLNPKiPiOqasWIDogsFinwD6t5g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Teacher Erica has been my tutor for two years, and I’m truly grateful to have found her. Before meeting her, I struggled with my studies and kept changing tuition centers, but none of them helped.\n\nTeacher Erica is friendly and approachable. She is also patient when teaching, often coming up with funny stories to make lessons more engaging and easier to understand.\n\nI had been struggling with Science and Elementary Mathematics since my lower secondary days, but with her help, I not only managed to understand the subjects better but also started to enjoy them. My grades improved significantly—from a D to eventually scoring an A in my finals!\n\nEven after I graduated from secondary school, Teacher Erica continued to help me, and I can still reach out to her for math assistance whenever I need it. Really grateful to have met such an amazing teacher!!🫶🏻",
      "time": 1741718724,
      "translated": false
    },
    {
      "author_name": "May Chong",
      "author_url": "https://www.google.com/maps/contrib/107196935039857616744/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKWMbnU7M1-GyM87SG_czI6IQ0GsycVxujI_Fg74ySjsazNxg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I am a parent and I am beyond grateful for the remarkable dedication, love and support Teacher Erica has shown in helping my child thrive. Her passion for teaching shines through in everything she does and it is clear that she genuinely cares about the success and well being of each student. She goes above and beyond to ensure the child feel supported and encouraged. She creates a nurturing environment where students are not afraid to ask questions, make mistakes or explore new ideas.\nThank you Teacher Erica for your unwavering dedication and for making such positive impact on my child’s learning journey!",
      "time": 1737363158,
      "translated": false
    },
    {
      "author_name": "Monica Choo",
      "author_url": "https://www.google.com/maps/contrib/102082327066861789644/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJYFg573WC-UGXOJcG6JKsI2vlaXWGVKbdGmfopMo6pPAtH=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Javier started taking Science group lesson with Teacher Erica from p5 to p6. In Sec 1 and 2 he started taking 1 to 1 lesson with Teacher Eric on an ad hoc basics and the lesson really boasts his grade. Teacher Erica also teaches Math. Last year during EOY Javier started to take 1 to 1 lesson with Teacher Erica just few weeks before his SA2. His grade jumped from F9 to B3. We are really grateful to her and he started taking A math with her on a weekly basis this year. Teacher Erica is a very passionate and dedicated teacher and she always goes the extra mile to help Javier and also will try her very best to fit into his schedule. She is also very encouraging and this helps to boast his confidence. She is also very supportive and approachable and she trys her best to make lesson fun and interesting and Javier really looks forward to her lesson. Thank you Teacher Erica for being such a wonderful and supportive teacher.",
      "time": 1738468280,
      "translated": false
    },
    {
      "author_name": "Claire",
      "author_url": "https://www.google.com/maps/contrib/103440083497828957633/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVz8BVE-TgEZ5ssfOJAvTF7cFyZ0SHZBAL5f9JCQHyCemSERnAR=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I highly recommend this tuition based on my experience.I used to be Ms Erika's student for 5 classes in the year for o levels. Before taking her lessons, I was always on the brink of failing or just passing. Ms Erica's teaching was really helpful in clearing misconceptions I had on my lessons, and she makes learning enjoyable for me . Within 1 year, she helped me improve all of my grades tremendously from C-Fs to As-Bs for O levels.",
      "time": 1737448547,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "school",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7875428897597163901",
  "user_ratings_total": 15,
  "vicinity": "149A Towner Road"
}