{
  "formatted_address": "580 Queensway, Ridout Tea Garden, Singapore 149066",
  "geometry": {
    "location": {
      "lat": 1.304278,
      "lng": 103.8019459
    },
    "viewport": {
      "northeast": {
        "lat": 1.305690630291502,
        "lng": 103.8032061302915
      },
      "southwest": {
        "lat": 1.302992669708498,
        "lng": 103.8005081697085
      }
    }
  },
  "name": "McDonald's Queensway (Ridout Tea Garden)",
  "place_id": "ChIJGdIiwD4a2jERJm39sI0nkik",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Ribeye",
      "author_url": "https://www.google.com/maps/contrib/108129213100021627372/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVjsX2wodqm6tcuK3xSM4kccm8YMuGCBLmxd8sf2EhtIKIdDPW5=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "McDonald’s at Ridout stands out as a truly unique location for a weekend breakfast. Nestled within lush greenery, it feels more like a retreat than a fast-food joint. The garden setting is a highlight, with thoughtfully designed seating scattered across the grounds, offering cozy nooks and crannies perfect for quiet moments or a leisurely meal.\n\nThe seating arrangement ensures there’s something for everyone—whether you want to enjoy the serene pond views, bask in the sunlight at outdoor tables, or find shade under a pergola. The tranquil ambiance is a refreshing change from the usual bustling McDonald's outlets.\n\nThe breakfast offerings are familiar, with classics like the Sausage McMuffin, Hotcakes, and Hash Browns, but the surroundings elevate the experience. Enjoying a warm coffee while soaking in the natural beauty adds a pleasant twist to the usual McDonald's fare.\n\nIf you’re looking for a casual yet serene start to your weekend, McDonald’s Ridout provides an experience that’s as much about the location as it is about the food. A great spot to unwind and enjoy breakfast in a setting that feels more like a getaway than a typical fast-food outlet.",
      "time": 1733638454,
      "translated": false
    },
    {
      "author_name": "Zico De",
      "author_url": "https://www.google.com/maps/contrib/117863472029199389511/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXCzdYx905pLqhSXs1ZPoVOZnVPgzb5T3aOfsjR65gdCjCnJNZA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Extremely pretty and chill vibe in the evening times. A McDonald’s like none other in all aspects.\n\nThey have plenty of space as it gets a little crowded in the evening. A whole play area for kids, a pond with turtles, and a general well-maintained perfect photo-taking environment around the McDonald’s.\n\nHas indoor aircon seating and outdoor seating too with McCafe. It’s actually quiet even with the people.",
      "time": 1740137673,
      "translated": false
    },
    {
      "author_name": "Youyou Sun",
      "author_url": "https://www.google.com/maps/contrib/115999454686318686292/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXVZda3294hm4mKVkEVAXRHCnm1TREFV08Q0u9R1inhh95pwHvT=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Majestic atmosphere, delightful service, quite environment. Very calm compared to other McDonald’s. Kids playground and a nice garden in-front and behind the restaurant. Vibrant marine life in the ponds. Includes Mcafe with lovely lattes. Great overall experience. Food quality and exquisite, well cooked and seasoned fries and burgers were above the average macdolands burger.",
      "time": 1740137742,
      "translated": false
    },
    {
      "author_name": "Sagar karki",
      "author_url": "https://www.google.com/maps/contrib/115260259709081794374/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVO_Q8_F_LF09CAjB1W5X5f3Mq_968DfcKeSKjJCtfHM9xO2CVE-w=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Lovely whenever I want peace I always visit this place.. Very calm and near to nature lovely place... No crowed at all and you will get the best services here...\nLove their service standard as comparison to other Macdonalds...\nIf you have good enough time must visit..",
      "time": 1737465468,
      "translated": false
    },
    {
      "author_name": "Melanie E",
      "author_url": "https://www.google.com/maps/contrib/111136896090209853190/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUR0bJcxqNkJt-i1wxCH3EaQXevncA86panZszfT__NAs_0KWRp=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "A local told me about this amazing McDonald’s. Not only do you find different food, there’s a zen vibe to the place.\n\nFood: 4/5 - they get 4 stars for different food such as dark chocolate sea salt frappe, Mcwings, chicken Mccrispy, white peach yogurt pie, caramel frappe, and dinosaur McFlurry.\nService : 4/5 server was friendly\nAtmosphere: 5+/5 - the best environment I have experienced at McDonald’s worldwide. The Japanese themed garden called Ridout Tea Garden has bonsai-style foliage, raked sand and a pond full of turtles. Whether you choose to sit inside or outside, the zen vibe brings calmness and peace within. I could sit here all day. Equally beautiful is seeing the garden at night.\n\nIt’s worth checking out if you’re wanting a unique environment.",
      "time": 1734152240,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2995500191668071718",
  "user_ratings_total": 3557,
  "vicinity": "580 Queensway, Ridout Tea Garden"
}