{
  "formatted_address": "3 Anson Rd, #01-03 Springleaf Tower, Singapore 079909",
  "geometry": {
    "location": {
      "lat": 1.2748671,
      "lng": 103.8459685
    },
    "viewport": {
      "northeast": {
        "lat": 1.276410780291502,
        "lng": 103.8475531302915
      },
      "southwest": {
        "lat": 1.273712819708498,
        "lng": 103.8448551697085
      }
    }
  },
  "name": "McDonald's SpringLeaf Tower",
  "place_id": "ChIJbSX5nxQZ2jER7XXItxRWZLg",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Anna _",
      "author_url": "https://www.google.com/maps/contrib/102722719756135211401/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKKeL6zuZqCizU6O5cV83cqkuZF1vi5glgN8irVxJUzw6QkKqYt=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "I’m really frustrated with the attitude of this staff member—an older lady in a blazer and hairnet who seems to be in a higher position. I’ve noticed her condescending tone before, like the other morning when I overheard her telling another customer, “Please check your food. Sometimes the staff panic when there are too many people and forget to give some items.” She wasn’t wrong, but the way she said it felt more like a lecture than guidance.\n\nToday, I had a firsthand experience with her attitude. I was looking for salt at the self-service counter but couldn’t find any, so I approached her for assistance. I politely informed her that there was no salt left. Instead of a simple acknowledgment or apology, she snapped back in a stern tone: “I know. I went there just now and couldn’t find it. I am alone here today, so please be patient and wait. I don’t know where the salt is.” While her words were technically polite, her tone was full of unnecessary attitude.\n\nI’ve worked in F&B for years before today, and the golden rule is customer first, not attitude first. If she was busy or unable to find the item, a simple “I’m sorry, I’ll check again” or “I appreciate your patience” would have been enough. Instead, she made it sound like her staffing issue was my problem. Customers don’t owe staff patience if they’re met with entitlement instead of basic courtesy.\n\nI’ve really had enough of her behavior. A little professionalism and respect go a long way. I ignored her attitude and walk away today. She needs to stop this.\n\nAdd on to that, I just drank my ice latte with no syrup. The order is wrong, it has a weird tasting sweet flavour.",
      "time": 1743126190,
      "translated": false
    },
    {
      "author_name": "Patience Liew",
      "author_url": "https://www.google.com/maps/contrib/114221336667119453647/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLyt0qNcQYcVCTSXUhZ5tsNkT1lfV7HXbt0LChXydf8yUODwg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Terrible experience during lunch hour. Waited about an hour but did not get the meal. Thinking to ask for cancel order and refund, but unbale to talk to the manager. As the lunch hour is ending, so i have no choice but to leaved the receipt and table service number and heading back to the office. Will never visit McDonald again.",
      "time": 1740051211,
      "translated": false
    },
    {
      "author_name": "michael lin",
      "author_url": "https://www.google.com/maps/contrib/101093200154303210000/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWsfOmJxDMn30IhtL0DG3fgXEKZRunUICNs8PR-n5m7HUb8mjoY=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "9 months ago",
      "text": "Ordered the 2pcs chicken meal. Chicken came hot, crunchy, juicy. And unlike the spicy one. Wasn’t too salty and the taste of the normal flavour is more balanced. But the queue on a Thursday lunchtime is just far too long!  The problem is it’s too popular for its own good, probably down to it’s the only McDonald in downtown area.",
      "time": 1723696953,
      "translated": false
    },
    {
      "author_name": "Nadia Lee",
      "author_url": "https://www.google.com/maps/contrib/115350849857860056278/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSld_OjbCBCKAiIHnc3m3_Et8jMp0F-T1oEOAco8lrvixH8_XjxQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "The closest McDs to us, there is the nicest older gentleman that preps orders and calls them out during the day. He is extremely thoughtful (always making sure the kids get the themed hat that's currently \"in\" whether Pikachu or Minecraft), meticulously checking the orders are fulfilled accurately and just gas a nice positive kind demeanor. Prior to him, there would always be issues with orders with things forgotten but glad he's here and makes the experience so pleasant! Kudos to him!",
      "time": 1743227552,
      "translated": false
    },
    {
      "author_name": "K L",
      "author_url": "https://www.google.com/maps/contrib/106428407775262214678/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKkd9l7DTHI0601qf50KfGxpJVzrNN0q2Qai3JncyJb2B-28-0=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "Ordered a Filet-O-Fish that came with half or less of a slice of cheese. Is MCD on a cost cutting exercise or are we facing a cheese recession? Next time, can I bring my own cheese slices?",
      "time": 1738742051,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13286839447632508397",
  "user_ratings_total": 2561,
  "vicinity": "3 Anson Road, #01-03 Springleaf Tower"
}