{
  "formatted_address": "144 Upper Bukit Timah Rd, #01-39/40 Beauty World Centre, Singapore 588177",
  "geometry": {
    "location": {
      "lat": 1.3422905,
      "lng": 103.7761285
    },
    "viewport": {
      "northeast": {
        "lat": 1.343489880291502,
        "lng": 103.7773865802915
      },
      "southwest": {
        "lat": 1.340791919708498,
        "lng": 103.7746886197085
      }
    }
  },
  "name": "McDonald's Beauty World Centre",
  "place_id": "ChIJHVIuaooQ2jERWE7QqCmJjQE",
  "rating": 3.6,
  "reviews": [
    {
      "author_name": "Koh Jing Yan",
      "author_url": "https://www.google.com/maps/contrib/108446634020869675943/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXrAZupdvJMXrjUBteE2CIfHN50Swn2xiWGPLIPc0fRDz2BJI5F=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Customers have been waiting 1+ hour for their breakfast orders, apparently can see that there is no improvement over the past 2 months in reviews as well (only read and knew about them after being to this outlet for the first time aft 10 mins).. Usually I go to other mcd outlets, don't even need to take 10 minutes and it's served already... imagine taking 4 times the amount of waiting time for an order... insane.\n\nThe trays (by the photo) were there ever since I arrived, 20 minutes later I don't see these same trays being sent to the customers, leaving thr till damn cold issit..? 😔\n\nEither train your workers to be faster or hire more workers pls.. poor staff management..\n\nEdit: I ordered 2 Happy Meals and 1 free hashbrown (points), by right should be getting 3 hashbrowns in total, but got only 1! And when I checked the number of drinks, should have only 2 drinks given, but 4 were given... Staff to rmb to check the stuff given to customer to prevent losses as well... staff also forgot to give another happy meal product from the 2 happy meals...",
      "time": 1742455812,
      "translated": false
    },
    {
      "author_name": "edtayjb",
      "author_url": "https://www.google.com/maps/contrib/107467079327459015215/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJnxyZ0BYtgLZ6p7QJ-kzeM77_I23A7aVM-YXaEyCzSWBv6Fg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "I tried today, MacDonald's $1 coffee. And it's really value for money. Where else can you get a quality Cappuccino or a Latte for just $1. I hope they offer it on a permanent basis.",
      "time": 1746515402,
      "translated": false
    },
    {
      "author_name": "Jovial J",
      "author_url": "https://www.google.com/maps/contrib/114274169552770999568/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ0YlTIC54hxDsRSwcQq3cMxIGrEY0_4Sdz5eNXFc3OkUBkJQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "I had an extremely disappointing experience at this outlet. I waited close to 1 hour for my order, which is unacceptable for a fast-food restaurant. The process was chaotic—my number was shown as “Preparing” on the screen, then slowly moved to “Now Serving.” However, when my number was supposed to be called, it disappeared from the screen after 10 minutes, and I noticed they were serving numbers after mine.\n\nI approached a staff member named Cherry politely to check on my order, but to my surprise, she completely ignored me and walked away. I approached her a second time, hoping for at least an acknowledgment, but she walked off again, attending to other orders without addressing my concern.\n\nFrustrated, I went to the counter and asked for assistance. Only after I raised my voice slightly did they bother to check on my order. To my disbelief, my order had not even been prepared—they were prioritizing takeaway orders over dine-in customers.\n\nThis outlet has no proper management and lacks customer service. Many others at the counter were also visibly upset, complaining about the long wait and being ignored. This level of disorganization and indifference is unacceptable for any restaurant, let alone a fast-food chain. To the management of McDonalds Beauty World - please look into the similar reviews here and do something about it. If your staffs still cannot be bothered, then just sack them la.",
      "time": 1736560499,
      "translated": false
    },
    {
      "author_name": "Xenia Hong",
      "author_url": "https://www.google.com/maps/contrib/104983805986933215018/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJh9f0A4HhwIJig9oUXmNLZq9yMP-ddGAjNwGUZUqO9vOJt1Q=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "**1. Excessive Order Collection Time:**\nI had to wait for 45 minutes to collect my order, which is excessively long, especially considering this is a fast-food establishment where quick service should be expected.\n\n**2. Unhelpful Staff:**\nDespite informing the staff that my order had been placed over 30 minutes ago, they refused to assist or offer any solutions. Instead, they repeatedly cited a long queue without even checking my order number or offering any meaningful updates.\n\n**3. Disorganized Order Numbering:**\nThe order numbers were completely out of sequence. For instance, a pickup order (2573) was ready while my dine-in order (2545) remained in the queue. This level of disorganization is highly frustrating.\n\n**4. Lack of Clear Explanation:**\nWhen I raised the issue regarding the order number jump, the staff member’s response was simply that my order contained more than one burger. Does this mean I should have waited an additional 28 order numbers just because I ordered two sets of meals?\n\n**5. Overall Dissatisfaction:**\nI am extremely disappointed with both the service and the extended waiting time. Even local eateries like Kopitiam would not have such prolonged delays or such an inefficient system. I strongly urge you to take immediate action to improve service speed, staff performance, and the overall order collection process.",
      "time": 1740890875,
      "translated": false
    },
    {
      "author_name": "Prawnsalad1991",
      "author_url": "https://www.google.com/maps/contrib/103203190516039640744/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKjrrzITw62j4jGNdoauEWT-xiZMqy8wXsRNDkcSv0KXx7ZZg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "This Macdonalds has a very retro charm to it, like the one at Forum mall or Liat towers (1st McD in Singapore). I like the outdoor area, large windows and the cool air conditioning especially on hot days. It is exactly how I envision any Macdonalds to be designed. The food is great like other outlets. It’s my 2nd favourite outlet (1st is Airport T3). It does get crowded and seating is limited.",
      "time": 1735140254,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=111896377773018712",
  "user_ratings_total": 1298,
  "vicinity": "144 Upper Bukit Timah Road, #01-39/40 Beauty World Centre"
}