{
  "formatted_address": "118 Rivervale Dr, #01-32 Rivervale Plaza, Singapore 540118",
  "geometry": {
    "location": {
      "lat": 1.3851593,
      "lng": 103.9013153
    },
    "viewport": {
      "northeast": {
        "lat": 1.386551380291502,
        "lng": 103.9025903802915
      },
      "southwest": {
        "lat": 1.383853419708498,
        "lng": 103.8998924197085
      }
    }
  },
  "name": "McDonald's Rivervale Plaza",
  "place_id": "ChIJSaTYcRcW2jERI1SrczpjcZw",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Karen O",
      "author_url": "https://www.google.com/maps/contrib/116720431693328686281/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK1tqToxjprUXIz_y-pVCcdcn2eC420HlHofiWd9OO3RNukaQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Normally would dine after lunch hours to avoid crowds. Food is always served fresh and hot. The service staff is kind and friendly. Ordered grab food before and food is still warm. Not soggy. Pls keep it up. Thank u😊",
      "time": 1739587455,
      "translated": false
    },
    {
      "author_name": "Peter Wong",
      "author_url": "https://www.google.com/maps/contrib/116350795217769676294/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKDXWhVyQw6DyzJlEAhtpcbxCYw-2mJS6NqrESjzESQi-2vRQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "There's a staff by the surname Lee, he's really helpful and polite,hardworking staff with a positive attitude towards customers. He deserves a manager position! Can see that hes putting his heart working for the best for the visitors, i seldom praise ppl, but for him he definitely deserves my respect !",
      "time": 1745408095,
      "translated": false
    },
    {
      "author_name": "KC Ng",
      "author_url": "https://www.google.com/maps/contrib/116260762407619897998/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIk9mDkvb0tu0mm_rlSer9ZwKRdVD7fWEpp5C1IU0MlfnyXUQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "One of the dirtiest mac restaurant even seen. No one is cleaning up the tables and floor.\n\nAll staff and manager on the ground cannot communicate at all. I hope it is because of their social programme (hiring staff with disabilities). If this is so, I will take out inability to communicate in this post.\n\nDrinks served are below standard. Ordered sprite. No sprite taste in it. Only water and soda. Manager did not even know sprite syrup is low or out.\n\nBought 2 kids meal for my kids. They wanted to change the Pokémon cards into story books. Went to counter request for change. The counter staff immediately interrogated my wife why she have 2 set of Pokemon card? Now then they can finally talk.\n\nMy wife went with 2 set of brand new toys requesting for change. Not as if it is an old toy asking for an exchange. Is is even wrong to come with 2 sets? They control the sales of kids meal?\n\nMac restaurant service is going down the slope day by day. Nowadays mixed veg or zhi char stall service or waiting time is even better and shorter than them.\n\nU will not get hot food even if u wait long enough for the meal at mac. Drinks wil be diluted cos the ice melted while they prepare ur food. Food is cold and never at a time when I have my fish burger, the presentation will always be like my burger went for bungee jump and return to my table.\n\nThe reason for writing review is because we hope sometime will be done for the food or brand we like and love. Hopefully they will not take for granted and lost their footing.\n\nMac also has the timing system. The manager will clock the timing out. But the food was never served. Or maybe will be served 30mins later. KPI clocked. Mgt tot they did well. But in actual fact, it was never done.",
      "time": 1740806002,
      "translated": false
    },
    {
      "author_name": "Goh Tiong Yee (Northvistass)",
      "author_url": "https://www.google.com/maps/contrib/107796133926505233749/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLFA6vB9DdxLIkjSTnlyc5vewbCDst3UiL4rU6S3dGCoyaeYw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "in the last week",
      "text": "its horrible when i waited for 40 min before they bring me the food and the food is not good.The payment also very slow",
      "time": 1747374439,
      "translated": false
    },
    {
      "author_name": "William Lu",
      "author_url": "https://www.google.com/maps/contrib/115969486686664081306/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWyuRisFOll54oVs7HxOSI6-SCcNbJroHEXUOjXeW5Tra49I2E=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Was passing my plaza in the morning and didn't plan to take any breakfast but saw mcd has opened early in the morning. There are 4 kiosk for ordering here. Went to order, took the table service tag, and sat down. It took about 10 minutes for the order to be ready. It felt a bit long for McDonald's, usually it was faster than that especially not many customers yet in the morning.\n\nCoffee and tea are free flow in the morning, it is self-service at the condiment counter.\n\nGot TV playing premier league soccer match at the time I visited",
      "time": 1664003365,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11272900444984923171",
  "user_ratings_total": 1691,
  "vicinity": "118 Rivervale Drive, #01-32 Rivervale Plaza"
}