{
  "formatted_address": "Changi Airport Terminal 3, Airport Blvd., #01-03 65 1st Floor, Singapore 819653",
  "geometry": {
    "location": {
      "lat": 1.3566264,
      "lng": 103.9863923
    },
    "viewport": {
      "northeast": {
        "lat": 1.357647780291502,
        "lng": 103.98856895
      },
      "southwest": {
        "lat": 1.354949819708498,
        "lng": 103.98566675
      }
    }
  },
  "name": "McDonald's @ T3 Public",
  "place_id": "ChIJfyzyWto92jERJ1G6w_pk-Vs",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Takahiro Koyama",
      "author_url": "https://www.google.com/maps/contrib/109971102286888264645/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUeREisAdftMhkVeTjGoyeP6PZQCCmZiq4dtoi8EV9AAZjLWaxT=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "3 weeks ago",
      "text": "There are four McDonald's at Changi: T2 (Public Area & Transit Area), T3 (Public Area), and JEWEL (B1F).\n\nThis one at T3 is in a quiet area, so you can relax and take your time. It's open 24 hours, which makes it perfect for late-night or early-morning flights. The place is always clean and comfortable, which is another big plus.\n\nThe menu includes classic items like hamburgers and Big Macs that you can find worldwide, along with some Singapore-only specials.\n\nDon't miss the local flavors like the Satay Burger, Ha Cheong Gai Burger, and Thai Milk Tea Frappé — these are unique to Singapore and definitely worth trying!",
      "time": 1745739067,
      "translated": false
    },
    {
      "author_name": "Benedict Correya",
      "author_url": "https://www.google.com/maps/contrib/113292377967743781974/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVGGK89xGI0xzaALnRSueP9q_XEKHVc_VzRg-FwAWXsA37LqP5y7A=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Stopped by McDonald’s at Changi Airport Terminal 3 for dinner and tried the McChicken meal and Chicken McCrispy. The McChicken was fresh, with a crispy patty and just the right amount of mayo—simple but satisfying. The Chicken McCrispy had a nice crunch on the outside and was juicy inside, definitely a good pick if you’re craving fried chicken.\n\nThe place is spacious with plenty of seating, so finding a spot wasn’t a hassle. Ordering was quick and smooth with the self-service kiosks, and the food came out fast despite the evening crowd.\n\nIf you’re in T3 and want a quick, no-fuss meal, this McDonald’s is a solid choice—hot food, fast service, and a comfortable place to sit and enjoy.",
      "time": 1741528919,
      "translated": false
    },
    {
      "author_name": "Joanne Choo",
      "author_url": "https://www.google.com/maps/contrib/101437302539139459186/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLz7N5s7B9Nlrkx6qY5OOBIN_KDCEaRg0l8skrCfnOt7JOkhQ=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "McDonald's , this outlet is located at Changi Airport Terminal 3 (1st Floor #01-03), conveniently accessible by public transportation & Changi Airport MRT.\nI enjoyed a  delicious Fish fillet with fresh ingredients , crispy French Fries & Spirit beverage for tea break .\nThe staff are friendly helpful & attractive, it was very crowded, I appreciated one of the staff Mr.Ong, explained & helped me on the Menu  panel to place an order, I thank his kindness & patient ☘️💞☺️, and impressed me that all staffs also work in Team to serve all customers, excellent 👍 keep up the good work🤝🤝🤝🙏🫶💞💓",
      "time": 1734881814,
      "translated": false
    },
    {
      "author_name": "Xun Hang Tan",
      "author_url": "https://www.google.com/maps/contrib/116642568778683951734/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJgyX6Y7p6ce-ahXWpSuEpq9RggKjg6hpOssDKh3A1lcx2lEA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Super awesome MacDonald outlet. Probably one of the best in SG\n1) all the food is Smokey hot and so awesome\n2) staff is nice and greets when food served at your table.\nNice atmosphere too!",
      "time": 1730764784,
      "translated": false
    },
    {
      "author_name": "Singtel Abcde",
      "author_url": "https://www.google.com/maps/contrib/116122836770254136221/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJruIbnh6PV6uX41U1TzZTnxK_4ofcoRbpSjQ66077XKYdW=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Ms Rosanna is spotted by customers and reckoned as a kind-hearted, caring and diligent staff in the T3 Changi Airport McDonalds Restaurant outlet. She always went the extra miles to ensure all her customers ended up with an enormously sublime dinning experiences in her T3 Changi Airport McDonalds Restaurant outlet. She is always especially attentive & observant to all her individual regular customers' wants by sparing no pains to resolve their concerns & finally warmed the hearts of all regular customers. Ms Rosanna had even taught me on how to download the McDonalds APP. Indeed, really thumbs up her spontaneous helpful good nature. From here, I automatically learn some IT knowledge from her. So lucky to meet Ms Rosanna at T3 Changi Airport McDonalds.\nAlthough Ms Rosanna is merely a cog in the wheel of the Goliath McDonalds Restaurant organization, her superlative valuable customer service really speak volumes and make a difference in the super big global McDonald's family organization.\nTruly, Ms Rosanna is a credit to the whole Singapore McDonalds Family Organization. She is a precisely a McDonalds Shining Star to boost up the business profits for the T3 Changi Airport McDonalds Restaurant outlet. I strongly encourage more and more\nMcDonalds Restaurant outlets Staffs in Singapore to mimic her { Winning Customer Service  Attitude } so as to transform McDonalds Restaurant into a Surefire Prime Dining Paradise in the whole of Singapore and especially in the Changi Airport.",
      "time": 1741849644,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6627439354840764711",
  "user_ratings_total": 1979,
  "vicinity": "Changi Airport Terminal 3, Airport Boulevard, #01-03 65 1st Floor"
}