{
  "formatted_address": "1 Tanjong Pagar Plz, #02-24, Singapore 082001",
  "geometry": {
    "location": {
      "lat": 1.2752616,
      "lng": 103.842705
    },
    "viewport": {
      "northeast": {
        "lat": 1.276391180291502,
        "lng": 103.8439930802915
      },
      "southwest": {
        "lat": 1.273693219708498,
        "lng": 103.8412951197085
      }
    }
  },
  "name": "Meiplus Dentalcare",
  "place_id": "ChIJYcDMfGsZ2jERq5lgWQ_CXes",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "forest red",
      "author_url": "https://www.google.com/maps/contrib/115100396064824889238/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ-IQbUSWeK1i46dBRM86KARUXFJugs4XXP3ZFGKB7xXFaNNQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "They deserve a 5 star with excellence!\nI am in my 50s and have my fair share of dental visits ranging from normal cleaning to root canal treatments. Never have I ever encountered such an amazing overall experience that I want to give a  thunderous SHOUTOUT to Dr Kim Taeyun & his team.\n\nMy regular dentist couldnt have me when I had a sudden toothache. Past experince told me this is not a normal one that I could wait. So I turned to Google to look for a dental clinic that could have me on the same day. I was lucky to have found Meiplus who could fit me in last minute.\n\nIt was indeed my lucky day. It turned out I had to redo my molar root canal which I had already done once with an endodontist in Novena specialist centre 4yrs ish ago. There was a severe infection where the bacteria had eaten away my bone and invaded into my cheeks to also eat away the tissues. Thus I started my 5 months treatment journey with Dr Kim & his team.\n\nWith every visit, my confidence grew, my anxiety went away, I know I am in good hands. Dr Kim eludes exceptional high level of skill, expertise with genuine care, concern & attention throughout. He never once rushed through the job. Every step was explained clearly, every question was answered patiently in layman terms, with a gentle, firm but assuring tone. He is very dedicated to his professionalism. He said he will do his best try to save any tooth. And I clearly felt it in this 5 months process as mid-way, I have thoughts of giving it up cos once we thought all the bacteria was cleared as there was hardly any pus & blood during the previous visit but the CT scan showed otherwise. I was really defeated mentally cos I was looking foward to the crowning but he cheered me on and assured me no matter how long it will take to eradicate the bacteria, he is there for me and with me.\n\nI finally got my crown yesterday! Almost teared when I saw the crown.\n\nMeiplus is a hidden gem tuck away in the corner of Tanjong Pagar Plaza. They are not the normal dentist but qualified surgeons in a well equiped lab with latest technology to address complicated issues. Prices are very reasonable given the level of skilled expertise you will be getting coupled with a friendly & welcoming team.\n\nA sincere heartfelt thank you once again to Dr Kim & your team for taking care of my molar in this 5 months journey.",
      "time": 1744859555,
      "translated": false
    },
    {
      "author_name": "LS C",
      "author_url": "https://www.google.com/maps/contrib/108239312834076502643/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLwzu8xV0ARwqMP1C8gtWWSPDsUunn5vrojuvxC2lXK7usAuw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Had my implant done at Meiplus by Dr Kim.\n\nThe staff were kind, attentive, and thoughtful, they checked in on me after my appts. I really liked their post-appt care, which included an ice pack (for extraction) and clear printed instructions on to do’s and not to do’s. :)\n\nDr. Kim made my implant process very smooth. He was intentional about explaining each step at every visit, ensuring I understood what was being done and addressing any qns I had. The whole exp was relatively painless and professional. 👍\n\nHighly recommend Dr. Kim and the amazing team at Meiplus!",
      "time": 1745484511,
      "translated": false
    },
    {
      "author_name": "Vivian Ooi",
      "author_url": "https://www.google.com/maps/contrib/104600439415979618243/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWJCB8lw-13P2d2FE1j2wEQOOXleM_lYa8sc91sOXbqyCjm4YUGdA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "I had some complications with my implanted tooth, and after Dr. Kang left, I had no idea who to turn to.\nDental problems really scare me.\n\nAfter going through many reviews, I decided to see Dr. John Kim — and I’m so glad I did. He is incredibly professional, took the time to discuss all the options, and gave me his most valuable advice.\n\nDr. Kim is highly skilled and most importantly very gentle, which really helped reduce both the pressure and pain. I didn’t feel any pain or discomfort at all.\n\nHe is the second dentist I truly trust after Dr. Kang. I can’t wait to leave him a great review and show my appreciation for his care.\n\nWishing Dr. John Kim a very successful journey in his dental career!",
      "time": 1747388202,
      "translated": false
    },
    {
      "author_name": "Alan Chen",
      "author_url": "https://www.google.com/maps/contrib/101311358319472168586/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKEC8tjDfIKPSln04V4r2OrZqf6tDwG1CIZHfZP0_36CCO5nQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I recently underwent a full upper jaw implant procedure with Dr. John Kim, and I couldn't be happier with the experience.  From the initial consultation to my post-operative care, Dr. Kim and his entire team, especially Chloe, were absolutely fantastic.  Living in Australia, I appreciated the ease of communication via WhatsApp, which made scheduling and addressing any concerns incredibly convenient.\n\nDr. Kim's expertise and professionalism are truly exceptional. He patiently explained every step of the implant process – before, during, and after the procedure – which significantly eased my anxieties. His gentle approach and attention to detail made me feel comfortable and confident throughout the entire journey.  I was particularly impressed with the modern and sophisticated technology used at the clinic, and the rigorous sanitation protocols in place gave me complete peace of mind.\n\nThe clinic itself provides outstanding facilities, and all the staff members are warm, friendly, and accommodating.  Beyond Dr. Kim's skill as a dentist, it's the genuine care and personalized attention that sets him apart.  I highly recommend Dr. Kim to anyone in need of dental care, especially those considering complex procedures like implants.  He's not just a highly skilled professional, but a truly caring and compassionate dentist.",
      "time": 1740232753,
      "translated": false
    },
    {
      "author_name": "Su Seong Lee",
      "author_url": "https://www.google.com/maps/contrib/113975153391982696729/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI8CajTzkSeoByIAK6whiEYoh0HOkElcQvJriTrI4Mz8Zix6A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Meiplus Dentalcare provides outstanding facilities, adhering to rigorous sanitation protocols. The clinic is equipped with the latest technology to address a wide range of dental issues. The highly skilled practitioners deliver care with both competence and compassion. I received my dental implants at competitive prices and am thoroughly satisfied with the outcome. I highly recommend Meiplus Dentalcare for all dental procedures.",
      "time": 1739687694,
      "translated": false
    }
  ],
  "types": [
    "dentist",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16959925142926956971",
  "user_ratings_total": 157,
  "vicinity": "1 Tanjong Pagar Plaza, #02-24"
}