{
  "formatted_address": "165 Tyrwhitt Rd, Singapore 207569",
  "geometry": {
    "location": {
      "lat": 1.3122769,
      "lng": 103.8606598
    },
    "viewport": {
      "northeast": {
        "lat": 1.313762630291502,
        "lng": 103.8620416302915
      },
      "southwest": {
        "lat": 1.311064669708498,
        "lng": 103.8593436697085
      }
    }
  },
  "name": "Mercure Singapore Tyrwhitt",
  "place_id": "ChIJq6p62HkZ2jERJ40iH4-AExI",
  "rating": 3.8,
  "reviews": [
    {
      "author_name": "S bee",
      "author_url": "https://www.google.com/maps/contrib/113284297799243061507/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVGxe9bEKsXWEhZwQJ_qbH600mP5yURmQNL_spTPD2wBi5ObIoq=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "During my second visit to Singapore, I decided to book accommodations directly rather than through an agent, which turned out to be a wise decision.\nWhile Singapore is known for its expensive and compact hotel rooms compared to other countries, Mercure offers impressively spacious accommodations at excellent value. The service quality is exceptional. My family and I stayed in their garden view rooms, which featured top-tier amenities. As an Indian family traveling with both elderly members and children, we booked three rooms, and the hotel provided comfort suitable for everyone in our party.\nHelpful Information for Indian Travelers:\n\nBathroom Amenities: Yes, the bathrooms are equipped with health faucets.\nBathroom Privacy: No locks on bathroom doors - singing a song is recommended to let others know the bathroom is occupied.\nRoom Size: By Singapore standards, the rooms are spacious, with ample room for luggage and comfortable movement.\nSecurity: The property is extremely safe, with card access required for both elevator use and floor entry.\n\nOverall, Mercure Singapore provides excellent value, comfort, and security for families visiting the city.",
      "time": 1746524605,
      "translated": false
    },
    {
      "author_name": "Patrick Adrian",
      "author_url": "https://www.google.com/maps/contrib/105700561529951542616/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWYg3uR5YDMkouTIqVFLKG1DDAIYeR-4uGxR1FwDNGLjSjmwa-t=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Our stay at Mercure Hotel Singapore was an incredible experience, made even better by our room, which had a beautiful extension garden. This unique feature provided a private outdoor space where we could relax and enjoy the greenery. It created a peaceful and refreshing ambiance, making the stay feel extra special. Having our own little retreat in the middle of the city was a wonderful touch!\n\nThe room itself was modern, spacious, and well-maintained. The bed was extremely comfortable, and the overall design was sleek yet cozy. Everything was clean and thoughtfully arranged, with amenities like a minibar, a strong Wi-Fi connection, and a well-equipped bathroom. Housekeeping did an excellent job of keeping the space spotless throughout our stay.\n\nThe hotel’s facilities were also impressive. The staff was friendly, professional, and always willing to assist, whether it was for recommendations, extra requests, or general hospitality. The lobby and common areas had a stylish, welcoming atmosphere, adding to the overall charm of the place.\n\nAnother great aspect was the location. The hotel is conveniently close to public transport and plenty of great dining options, making it easy to explore the city. Whether you’re visiting for business or leisure, Mercure Hotel provides a comfortable, relaxing, and stylish stay.\n\nWe truly enjoyed our time here and would highly recommend it to anyone looking for a wonderful hotel experience in Singapore. We’ll definitely be back!",
      "time": 1742599818,
      "translated": false
    },
    {
      "author_name": "Angadjot Waraich",
      "author_url": "https://www.google.com/maps/contrib/112839082210859844257/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXMmAf2WArw4V__ce4x4oxznQrDRIXHGPGKH8vgW-hd65KS8ak7=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 4,
      "relative_time_description": "2 weeks ago",
      "text": "The hotel is in a great location—just a short walk to a 7-Eleven, Little India, and Mustafa Centre. The staff is very friendly and welcoming. However, the rooms are quite small, which might be a drawback for some guests.",
      "time": 1746509512,
      "translated": false
    },
    {
      "author_name": "Adam",
      "author_url": "https://www.google.com/maps/contrib/110441783337040038350/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJcJfu6YNdxlWPZUO0mGJI94Etm-cXUFtSQ3eIFDR9aQSb5-g=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "One of the best hotels to stay in when visiting Singapore. The rooms were very clean and the staff were very friendly and welcoming.\n\nI particularly liked the bedroom which has a bunk bed (double bed with a single bed upstairs). This is ideal for families with children.\n\nThere is also 2 washers and 2 dryers which you can use to wash and dry your clothes for $8. Very reasonable price.",
      "time": 1742906526,
      "translated": false
    },
    {
      "author_name": "Ronald Reid",
      "author_url": "https://www.google.com/maps/contrib/115026275502710921232/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUwiKmx-cf62n7KXMX9G86Fz8C3MbxSLyWxychLlnS3BnTqtz0NAw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "4 weeks ago",
      "text": "Great budget hotel. Clean, and well located . Breakfast is ok but lots of small cafes and markets and 7/11 type shop to go get your food there.  We were on a strict budget and this was adequate for us.",
      "time": 1745222725,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1302526069431242023",
  "user_ratings_total": 2642,
  "vicinity": "165 Tyrwhitt Road"
}