{
  "formatted_address": "20 Pasir Ris Street 71, Singapore 518798",
  "geometry": {
    "location": {
      "lat": 1.3767228,
      "lng": 103.9354461
    },
    "viewport": {
      "northeast": {
        "lat": 1.378062580291502,
        "lng": 103.9368026802915
      },
      "southwest": {
        "lat": 1.375364619708498,
        "lng": 103.9341047197085
      }
    }
  },
  "name": "Meridian Primary School",
  "place_id": "ChIJbSAqWpY92jERj-oo0YQQGP4",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Bryan Goh",
      "author_url": "https://www.google.com/maps/contrib/117296893209344009875/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI2JIa6holGGdCtsgyMUszaDU-RKCWfVd6U-TOdAwK8XcGD2A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I LOVE THIS SCHOOL I LEGIT REMEMBER ALL MY CHERS TEACHING ME SINCE 2020 WHEN I WAS P3 N GUARANTEED IN 2024\n\nMs Debbie Lim: she is uh kinda chill person but very nice (ft, english, science and social studies)(P3/4)\n\nMdm Lee Song Sang: uh she is kinda mid but uh she is very strict I must say that (ft and cl Cher)(P3)\n\nMrs Sharon Goh: Mrs Goh is kinda nice and strict if misbehaved ppl but she is kinda good Cher (P3/P4 math Cher)\n\nMr Shahid: he is very funny, nice, kind and respectful Cher he teaching is very good (p6 el cher)\n\nMdm Tang Tsin Ray: she is kinda a nice and chill person but she is a very helpful Cher (p4/6 cl Cher)\n\nMrs Stephanie Lim: she is kinda a mid Cher but very strict and very straightforward but overall she is kinda nice in teaching (ft, English (P5), social studies) (p5/6)\n\nMr peh: he is a very intelligent person that makes pe fun for everyone (i swear he never ever once scolded my class) (p3/5/6 pe Cher)\n\nMdm Hoi: she is a very sweet and caring person in teaching and kind Cher (p5 sci Cher)\n\nMdm Nurizan: she is a kind and generous person but she ask tons of questions in subjects but she is a nice lady (p6 sci Cher)\n\nMr Lim: he is super funny and good way in teaching (p5 math Cher)",
      "time": 1735884269,
      "translated": false
    },
    {
      "author_name": "Sumayyah Azman (Sacss)",
      "author_url": "https://www.google.com/maps/contrib/100151679377507040566/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIz7laxGG6oZ4c9jZMiXva1ywatZMlT4FzkWr_1dshLJ3jK1Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "MY UH 2ND HOME D: BEST PRIMARY SCHOOL EVER AND BEST FLOORBALL TEAM !! NO MINAH AND MAT VV KEWLLL !! be my valentine",
      "time": 1738833994,
      "translated": false
    },
    {
      "author_name": "Tan Linfei Annabelle (Hshs)",
      "author_url": "https://www.google.com/maps/contrib/107332452812526780459/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ6WcvaO7QAnw8XGEM_0VLrP6qDfm50w2dA4eFEex_Fu9JKeA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "I have a list of favourite teachers\n\n-Mr Benjamin Yeo, who was my english teacher in P5 and P6, he's so goofy HAHAHA\n\n-Mr Clement Tham, idk he's just goofy sometimes when he's smiley. (Science)\n\n-Mrs Jane Lim, I mean she's scary when she's scolds but she's still such a brilliant math teacher!!! Oh, also she is also my P5 and P6 form teacher.\n\n-Mr Raziz, my form teacher in P6 and my art teacher!!! He's so tall whaat\n\n-Mr Peh, he's a chill PE teacher (except for the one time he shouted at us but that was everyone else's fault not mine) he dragon boats- used to dragon boat-\n\n-Mrs Sharon Goh, I think she left the school some time ago, but she was my math teacher at some point, and she's really friendly, I still remember how she looks like, she's so pretty whaat!!!\n\n-Mdm Lim Chia Chia, my P5 and P6 Chinese Teacher, or was it more than that-? She so encouraging, and she provided us with so many resources!!!\n\n(ALSO WHY, WHY DID YOU GIVE SOMEONE ABSOLUTELY HORRIBLE THE AWESOME PRIZE HAH?) (ignore this :p)\n\nOverall I loved being a student at this school, can you invite me back one day- idk-",
      "time": 1722570372,
      "translated": false
    },
    {
      "author_name": "Evelyn Eve",
      "author_url": "https://www.google.com/maps/contrib/101049475398465257186/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLDUplOfpU96Ab_m60R1retUVSlIiKX75sUQhckBF6Fb8unOg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "11 months ago",
      "text": "Been calling the school, recorded the noise level and emailed the principal and MOE regards to their morning assembly, mid day concert and rehearsal.\n\nNone of them take action. Very inconsiderate school management!",
      "time": 1718708961,
      "translated": false
    },
    {
      "author_name": "Ana Johan",
      "author_url": "https://www.google.com/maps/contrib/110767525871682070100/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLKRvNM5DQqVLSTwUiHivQtISMc3UWzUrpwRA-hUuVlfyjQow=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "School front desk lady not helpful. We were not clear on what document to photocopy. So we went there with the document we have, and proceed to collect our FAS books. Then the bookshop and uniform needs 2 copies of the same document. My husband asked the office lady nicely, she just told to my husband rudely, why u don’t bring extra copy? And CONTINUE playing with her hp. Then an Indian  admin lady helped my hubby to do it instead. If we need to pay, pls say so. But don’t treat us like a dog just because we are FAS parents. It’s not ur money we ask for. Thank you.",
      "time": 1703639347,
      "translated": false
    }
  ],
  "types": [
    "primary_school",
    "secondary_school",
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=18309402447705598607",
  "user_ratings_total": 55,
  "vicinity": "20 Pasir Ris Street 71, Singapore"
}