{
  "formatted_address": "750C Chai Chee Rd, #01-01 Viva Business Park, Singapore 469003",
  "geometry": {
    "location": {
      "lat": 1.3235151,
      "lng": 103.9206728
    },
    "viewport": {
      "northeast": {
        "lat": 1.324911980291502,
        "lng": 103.9220313302915
      },
      "southwest": {
        "lat": 1.322214019708498,
        "lng": 103.9193333697085
      }
    }
  },
  "name": "MindChamps PreSchool @ Bedok",
  "place_id": "ChIJB9Ccfawi2jERKJ60DuzOFBo",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Mari Sabnani",
      "author_url": "https://www.google.com/maps/contrib/114412318617807790963/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXBaaayZrRb_hWz_JPsqBxsWd8Dl4HFieW4LfK67SA1zNDg07lK=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "We are incredibly grateful for the positive experience our child has had at MindChamps Bedok. The teachers are truly outstanding—warm, dedicated, and deeply committed to each child’s development. It’s clear that they genuinely care and take the time to understand each child’s unique strengths and needs.\n\nThe curriculum is also excellent, striking a great balance between academic preparation and nurturing creativity, confidence, and social skills. We’ve seen tremendous growth in our child’s communication abilities, independence, and eagerness to learn—all thanks to the nurturing and stimulating environment at MindChamps.\n\nA special thank you to the entire team at Bedok for making early childhood education such a joyful and impactful journey!",
      "time": 1746751205,
      "translated": false
    },
    {
      "author_name": "Vanessa Koh",
      "author_url": "https://www.google.com/maps/contrib/110674050938026851621/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIHsYuwxFHZ6ZmrjzZR5gGSrjK_-elLaBUDQ_6EMGVLf16TZw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "My child has been with Mindchamps Bedok since 2022. While there were some transitional issues in the earlier years for the school’s management team, it has since been resolved and we see a marked improvement in the quality of school activities and parent engagement.\n\nWhat stood out the most to us is that the school has a group of caring teachers. This has made us stay on with the school as we trust that our child is safe with them. The teachers take the initiative to keep us updated on any incidents at school.\n\nThe school also has good controls on the spread of infectious diseases and there are rarely any incidents.",
      "time": 1746670242,
      "translated": false
    },
    {
      "author_name": "Joseph Ong",
      "author_url": "https://www.google.com/maps/contrib/103832376740640068437/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWmSjAx9mTS7EB_UscHD7TILnaZGatl0Dfb0o5_ZMJOfc29IiAS=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Have enrolled my three children with the centre since 2017. The Management Ms Sara has been very supportive of the children's development throughout and despite the usual staff turnover issues in any organisation, the vision and philosophy of the Management stayed true and this showed in the children's enthusiasm to attend school. They were also very understanding in extending special care for one of our children who has food allergy.\n\nAll three of them, Olivia, Natalie and Garrison Ong have developed their foundation well and are more than adequately equipped with the necessary skills and knowledge to move onto Primary One in Tao Nan School. Special shout out to Ms Zee, 王老师, Ms Grace amongst all the teachers who have guided our children in the past 8 years and infused the right values in them.",
      "time": 1730286620,
      "translated": false
    },
    {
      "author_name": "Joshua Tan",
      "author_url": "https://www.google.com/maps/contrib/101807188244379759821/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ0pmT15UtusteLHbE-7WfEoo0qlUr1ToWbQ7GHbuYR4DOWIA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Visited the centre recently and had a great impression! The place is big, cozy, and the classrooms are neat and well-organized. The overall vibe is very positive — the teachers and staff look happy and seem to really enjoy their work. The children there also looked cheerful and well taken care of. Lovely environment for little ones!",
      "time": 1747109949,
      "translated": false
    },
    {
      "author_name": "Sin Han Lee",
      "author_url": "https://www.google.com/maps/contrib/105953192509975089495/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLsqzBEzE3aKlEKKL3SPILBH2Lceruy864XBu7cVlqpoWBJ-Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "We are truly grateful for the incredible dedication and passion of the teachers at MindChamps PreSchool @ Bedok. Our son is in Ms Wai Leng and 贺老师’s K2R class, and we’ve seen such a remarkable transformation in him. Every day, he comes home excitedly to share what he’s learned—sometimes even quizzing us with questions like, “Do you know how light helps us see things?” It’s amazing to witness his growing curiosity and confidence, especially in understanding and explaining science concepts at such a young age.\n\nThank you, MindChamps Bedok, for creating such a nurturing and inspiring environment where he can thrive both in learning and play. We couldn’t ask for a better start to his educational journey.",
      "time": 1746927660,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1879354457774661160",
  "user_ratings_total": 85,
  "vicinity": "750C Chai Chee Road, #01-01 Viva Business Park"
}