{
  "formatted_address": "1 Woodlands Rd, #02-15 Junction 10, Singapore 677899",
  "geometry": {
    "location": {
      "lat": 1.3804112,
      "lng": 103.7599899
    },
    "viewport": {
      "northeast": {
        "lat": 1.381705580291502,
        "lng": 103.7612308802915
      },
      "southwest": {
        "lat": 1.379007619708498,
        "lng": 103.7585329197085
      }
    }
  },
  "name": "MindChamps PreSchool @ Junction 10",
  "place_id": "ChIJS83CXrwR2jERe0iHtYOHsRE",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Selina Lin",
      "author_url": "https://www.google.com/maps/contrib/109108068740169224654/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL5I07mlEbKKyTjUCJnOUe4NgZsp23Z4_G8zYGmqG9kGjXK6w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "A Heartfelt Tribute to the Exceptional Educators\n\nI would like to extend my deepest and most heartfelt appreciation to the remarkable teachers and the dedicated principal who have been instrumental in shaping Adriel’s and Dylan’s formative years. Adriel, now in K1, and Dylan, now in N1, have both blossomed under your nurturing care, evolving into confident, expressive, and enthusiastic individuals. It has been truly heartening to witness how they’ve grown, not just academically but also emotionally and socially, thanks to your unwavering support and encouragement.\n\nYour kindness, patience, and dedication to their development have left an indelible mark. Whether it was through moments of learning, engaging activities, or simple acts of reassurance, you have fostered an environment where both boys felt safe, valued, and motivated to explore their potential. You have not only taught them essential skills but also instilled in them the confidence to express themselves, the curiosity to learn, and the courage to embrace new challenges.\n\nA special shoutout to the principal and the incredible teachers who have been instrumental in guiding Adriel and Dylan every step of the way. Your warm and welcoming presence has made every school day a joyful and enriching experience for them. It is a privilege to have you as partners in their early learning journey, and I am profoundly grateful for the positive impact you have made in their lives.",
      "time": 1747354069,
      "translated": false
    },
    {
      "author_name": "Christine Quek",
      "author_url": "https://www.google.com/maps/contrib/117881648642412024446/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJrLPaVtiGdBCb-2af0j4kpCpClXM3zoTwLOOv0e3Skhkgu1A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "We are grateful for the positive impact the school had on Athan and look forward to seeing his continued growth.\n\nTo all the teachers and staffs of the school, thank you for creating a joyful and nurturing environment for Athan. The warmth and patience of the teachers have made his first school experience a positive and exciting one.",
      "time": 1747292533,
      "translated": false
    },
    {
      "author_name": "K R",
      "author_url": "https://www.google.com/maps/contrib/105603772988672280587/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLH7Re40PMoKOUV-s1VQ_Ka3tPIIIcYoFvVf62Oi0sV3kvomxg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "My daughter has been with MindChamps since PG. We have seen great development in her communication and cognitive skills. Her use of Chinese Language has improved tremendously. She looks forward to school everyday and applies her learning back at home - roleplaying and recapping what she has learnt from her teachers. She has also shown leadership qualities.\nThe curriculum is engaging and interactive, at the same time well-structured to ensure that there is a study-play balance.\nWe want to express our heartfelt appreciation for the wonderful curriculum and team in MindChamps. It has been joyful to see positive growth in her learning which promotes her curiosity towards everything.\nThank you to MindChamps Junction10 team - especially to Ms Sharlene, Ms Yiting, Yow Laoshi for creating such a warm, nurturing, and inspiring learning environment. We look forward to enroll her sister to MindChamps soon! We are confident that the sisters will thrive well in their MindChamps journey.",
      "time": 1747294448,
      "translated": false
    },
    {
      "author_name": "Spencer Lee",
      "author_url": "https://www.google.com/maps/contrib/100540806757187061257/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKh9EFdXmsW9bXJR7nVUj_jblcC3S1puZMNZySIcf2L2NtWUg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Our daughter has been part of Mindchamps @ J10 since PG and now, N1. It is heartening to see her enjoy the curriculum Mindchamps has, and often comes home cheerful and fully engaged, always eager to share about the activities she’s done in class. She particularly enjoys music, gym and neuromooves classes, sometimes continuing the activities enthusiastically at home. School excursions are another highlight for her, and she always chats excitedly about her experiences.\n\nThe structured lessons and tailored approach by her teachers have supported my child’s development well, and we have seen her achieving important milestones, at times even surprising us with her progress. Mindchamps @ J10 has provided the nurturing environment she needed to grow into the confident, sociable, and talkative little girl she is today.\n\nWe are truly grateful to the dedicated and caring teachers and staff at Mindchamps @ J10. Thank you for guiding our little champ with such genuine love and care! Thank you!!",
      "time": 1746713043,
      "translated": false
    },
    {
      "author_name": "Peggie Bu",
      "author_url": "https://www.google.com/maps/contrib/110580704061330170608/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKVy8qCPFFuRfRrzOJbf1aKFgQA_T1Gv2QGDsBZUTh44FJDnA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "The HYPY workshop provided us with practical yet fun tips to make guiding our child’s Chinese learning at home more enjoyable. The teachers’ clear explanations made everything easy to follow, and I truly appreciate their effort in making the session interactive, informative, and engaging! A big thumbs up to MindChamps J10!",
      "time": 1740741965,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1274949169278568571",
  "user_ratings_total": 110,
  "vicinity": "1 Woodlands Road, #02-15 Junction 10"
}