{
  "formatted_address": "20 Pasir Panjang Rd, Singapore 117439",
  "geometry": {
    "location": {
      "lat": 1.2754092,
      "lng": 103.7985447
    },
    "viewport": {
      "northeast": {
        "lat": 1.276800780291502,
        "lng": 103.7998265802915
      },
      "southwest": {
        "lat": 1.274102819708498,
        "lng": 103.7971286197085
      }
    }
  },
  "name": "MindChamps PreSchool @ Mapletree Business City",
  "place_id": "ChIJq6qqusAb2jERBKyDYS4wSPQ",
  "rating": 5,
  "reviews": [
    {
      "author_name": "The Five Magic Beans",
      "author_url": "https://www.google.com/maps/contrib/104695391448280072185/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL8rwBTUBKILSP4DOh7myrStZetCgMKvl0aZE_YMQl0BZ4VWg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Mindchamps @ Mapletree Business City is a GREAT school - our boy comes home every day excited to share about what he learns at school, and talks lovingly about his teachers and friends\n\nEvery morning, Ms Chong checks on our boy diligently and teaches him to greet the day with a smile 🌻\n\nEvery evening, he shares about what he learns - going beyond the academics but also things around the world. Special shout out to his teachers Wu Lao Shi and Ms Adrea who is so patient with him when it comes to learning Chinese and music 🎶\n\nSpecial shout out to his form teacher Ms Franny. She pours her heart into the job and I see her on weekend birthday parties and kids’ play dates. It is no surprise that she was loved and moved at the K2 graduation earlier… it’s almost like her graduation too as a 2nd mummy to the class. Don't be deceived by her coloured streaks and her tattoo - she’s puts her ALL in the role as an educator, disciplinarian, and most importantly friend. The kids know it too - my boy called her “his best friend” until the other boys bribed him away with Pokémon cards.\n\nThe school isn’t complete without the top-down support of Principal Ms Bee. She has the job of managing the school as a business and parents as customers - but we have never felt the disconnect vs. enrolling our boy in a school with a heart ❤️",
      "time": 1733460564,
      "translated": false
    },
    {
      "author_name": "Claire Xiong",
      "author_url": "https://www.google.com/maps/contrib/104557490399108079564/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJw0_mFkcq4Ygv5jmdsFgrSzZMTUOHpy1TpykwswUaYZPVctw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I think MindChamps is a very good preschool because my daughter always feels happy in her school life.MindChamps also has many professional teachers, especially Ms Franny— English teacher, Ms Wu—Chinese teacher, Ms Andrea—Music teacher.Thank you for providing my child with a good environment for growth and learning.",
      "time": 1733886001,
      "translated": false
    },
    {
      "author_name": "SeungChul Han",
      "author_url": "https://www.google.com/maps/contrib/113001767430940106435/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJqk1zAHHxR5tuyjxeKpsLEHIvapQraAB06Hoc18LQRyOKcww=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "We are incredibly appreciative to all the teachers and staffs at Mind Champs, especially towards the K2 teachers Ms Franny and Wu Laoshi for the amount of effort they have put in to provide our daughter with a nurturing environment.\n\nShe has grown in so many aspects, from her confidence in expressing herself to her ability to adapt to new challenges. Encouraging curiosity and imagination allowing her mind to explore all the possibilities. Their dedication and care have played a significant role in shaping her development and making her learning journey enjoyable and fruitful.\n\nWe are truly grateful for the unwavering support and encouragement they have provided. Thank you for creating such a positive and nurturing environment for our daughter.",
      "time": 1734061156,
      "translated": false
    },
    {
      "author_name": "Li Miao",
      "author_url": "https://www.google.com/maps/contrib/107276915100887617015/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIyjrhJPMScVQovRZaYbk05w2VALgLrDwvGeW66oJLYj8w9LA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I believe that early childhood education provides a crucial window of opportunity to impact a child's overall development and lay the groundwork for their future. My daughter's young mind has grown, learnt, and blossomed in ways that have exceeded my expectations over the past two years of attending Mindchamps Preschool, which provides diverse content including reading, writing, maths, music, gymnastics, etc. She frequently mentions Ms Franny and Wu Laoshi at home and she is grateful for their loving care and devotion. As parents, we are also grateful for her teachers' professionalism and kindness.",
      "time": 1713278409,
      "translated": false
    },
    {
      "author_name": "Anna Chew",
      "author_url": "https://www.google.com/maps/contrib/109017886972988807148/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV8VeH4xo5z8PEcT63u1-RlEK6kiha9S1l7aCiF7KXRKNhUIMQhrw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "The Mother's Day Tote Bag Painting organised by Ms Franny & Wu Lao Shi for the Champs  has been fabulous & fun. It is certainly heart warming ❤️  to see the mums & children bond thru painting.\n\nThank you for your love and patience in nurturing our Champs in a safe, loving & enriching environment ❤️ ♥️",
      "time": 1746788776,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17602372119340231684",
  "user_ratings_total": 21,
  "vicinity": "20 Pasir Panjang Road, Singapore"
}