{
  "formatted_address": "1 Jurong West Central 2, #01-17E/F G/H, Singapore 648886",
  "geometry": {
    "location": {
      "lat": 1.3391211,
      "lng": 103.7065608
    },
    "viewport": {
      "northeast": {
        "lat": 1.341101680291502,
        "lng": 103.7077649302915
      },
      "southwest": {
        "lat": 1.338403719708498,
        "lng": 103.7050669697085
      }
    }
  },
  "name": "Minmed Clinic (Jurong West)",
  "place_id": "ChIJne0gv-8P2jEReeH83wvVwUw",
  "rating": 3.5,
  "reviews": [
    {
      "author_name": "Jenny Lim",
      "author_url": "https://www.google.com/maps/contrib/105777067946524644951/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUnhlQiNmtyWFBYIw3icAS8-d4t2oiRXnSDZ2XVeOl2lIl2_hPYKA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Came in as I got a cut on my toe and doctor treated it very carefully. He use the antiseptic wash and also the antiseptic cream + medical guaze to make the bleeding stop and ensure no infection. The wound somehow seen Dr Dawa Tshering and stop when it keeps bleeding at home. 😄 Nice doctor and very grateful for his help. Very appreciative of the nurses also + that the clinic opens 24 hours and in a convenient location. Mc is also automatically given even though I did not ask for it. Keep up the good work.",
      "time": 1740879580,
      "translated": false
    },
    {
      "author_name": "Carol Goh",
      "author_url": "https://www.google.com/maps/contrib/100351242190437134675/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIaUTER9nW3WOKxZH7ilfIDV7n0wng6BhWN1EeLVxITYz4w1Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "My daughter was having extreme bad headaches and the medicine prescribed by another doctor in another clinic doesn’t seem to help. Went to minmed and it was peak hour, yet, Dr Richter Louis (Lim Yong Hong) is forever so patient and attentive. He do a few checks on her and explain what was his concern and why are those dismissed. Then explain the different type of medication and potential effects. He assured us with his professionalism, knowledge and confident.  Nowadays it’s never easy to find a doctor that genuinely care. Thumbs up for Dr Lim!",
      "time": 1744800704,
      "translated": false
    },
    {
      "author_name": "donovan chua",
      "author_url": "https://www.google.com/maps/contrib/111779019169449436398/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIxfYkd1oflksAjWcdtb1sZk3zMhdClng5r9rc_-LWG6zvWhQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "i had the pleasure of interacting with staff member Winnie, who was extremely helpful. She promptly checked the queue number and verified the pricing for the flu vaccination. Winnie also reassured me that the doctor would call soon for the vaccine. Excellent service overall!",
      "time": 1743495978,
      "translated": false
    },
    {
      "author_name": "DOUBLEAnnE",
      "author_url": "https://www.google.com/maps/contrib/111042751805789686452/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW6Hgai7qQTyY-HcQOReiOmzvnfoSJmg1lpew55e8V32oL8K8bz4w=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I recently visited the clinic for a flu vaccination. Before my visit, I came across some mediocre reviews about this outlet. However, my experience was quite the opposite—possibly because I went during an off-peak period. The staff at the counter were polite and professional, and the check-in process was quick. In no time, a friendly doctor administered the jab. Although my appointment was scheduled for 3 PM, I arrived at 2:10 PM, and they neither turned me away nor made me wait until my scheduled time. The entire process was completed within 15 minutes. It seems that visiting during non-peak hours makes a significant difference.",
      "time": 1740202859,
      "translated": false
    },
    {
      "author_name": "huyoni5254 Ling",
      "author_url": "https://www.google.com/maps/contrib/106728956352612365551/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJj4LMnH17fgqcqIVcDY5dqpEpL8gBw0IbZnozUqSkyzwkoYA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "This is a very bad experience i had with Minmed Clinic Jurong Point, i am regular customer and use to visit them in the morning, all doctors i met in the morning are nice.\n\nBut on 24 April 2025, 7pm, i brought my son and met a young male Doctor with spectacular was very rude n do not listen to what i explained to him.\n\nMy youngest 12yrs old son claimed that his chest got pain when he breath in early morning at 6am. I was informed by my elsest son and i immediately check his blood exygen, 98, i apply essential oil for him to release the pain, i continue monitor for hours and i checked with Teacher. Teacher told me school having exercises the day before might be causing his muscles pain. My son was feeling better after wake up n i continue monitor until 10am 12pm, he told the pain gone, so i didnt bring him to see Doctor until 2pm he said Teacher need him to provide MC for absent as there is WA for Sci (my youngest boy seldom absent from school and he definitely not pretending). By the time he told me i already went to work so i told him to bring him to see Doctor after i finish work.\n\nThe rude Doctor tested his blood oxygen normal n told that nothing wrong with his lung but he suggested us to go NUH to do details check up as he think this is serious for a 12yrs old boy tp have chest pain. He is unwilling to give any MC to my boy as he told this is being a Doctor ethic????? I told him the scenario that he has no pain after enough rest, and pain could be due to exercise in the day before. He talked very loud and rude, said nothing to do with exercise in day before, this will not be the reason of the pain. He keep talking without letting me to explain how i monitoring my boy since morning. Of course i also worry my boy but impossible for me to send him to hospital immediately when he got pain on his chest. And this is his first time plus this youngest boy very healthy since he born n seldom fell in sick.\n\nStrongly not recommended this clinic, bad Doctor i ever met in my life.",
      "time": 1745500426,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5530936064366928249",
  "user_ratings_total": 260,
  "vicinity": "1 Jurong West Central 2, #01-17E/F G/H"
}