{
  "formatted_address": "3 Temasek Blvd, Mall, #01-K13/K14 Suntec City, Singapore 038983",
  "geometry": {
    "location": {
      "lat": 1.2958847,
      "lng": 103.8586554
    },
    "viewport": {
      "northeast": {
        "lat": 1.297307780291502,
        "lng": 103.8601772302915
      },
      "southwest": {
        "lat": 1.294609819708498,
        "lng": 103.8574792697085
      }
    }
  },
  "name": "Mister Wheel Singapore (不貳光車輪餅)",
  "place_id": "ChIJ3TbyMtwZ2jER4MkyJWn1BqI",
  "rating": 4,
  "reviews": [
    {
      "author_name": "C.K. Oh",
      "author_url": "https://www.google.com/maps/contrib/108989393776380460963/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLWMD9BM10F_asp7oG0wZlqfEOl-Pqlkq2jxQqa6lQpEOgXQQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I recently stopped by Mister Wheel at Suntec City and tried their red bean, strawberry custard, and Nutella crunch wheel pies—what a treat! Each one was freshly made upon order, which made a huge difference in the taste and texture. The red bean filling was perfectly balanced, with a grainy yet smooth consistency and a subtle sweetness that wasn’t overpowering. The strawberry custard was a delightful surprise—creamy and rich with a fresh, fruity kick that paired so well with the soft, fluffy exterior. My favorite, though, was the Nutella crunch; the gooey Nutella combined with that satisfying crunch took it to another level. You can tell they use quality ingredients, and the fact that they’re made right there on the spot adds to the charm. The wait time was worth it for such a fresh, warm snack. My kids had fun watching the staff make the wheel pies. If you’re at Suntec City and craving something sweet and unique, Mister Wheel is definitely worth a visit!",
      "time": 1742779196,
      "translated": false
    },
    {
      "author_name": "shirleen ng",
      "author_url": "https://www.google.com/maps/contrib/117830635458581738311/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJkIGaQb2ieANxj5lkcQ9lyfGWwEnb7vs6z86nLxEbzi8HB6H0=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "As much as ppl are commenting long waiting time (15min), the staff already put out a notice, so what's there to complain? They make them on the spot upon request to ensure freshness and prevent food wastage, compared to other similar concept stores making in batches and heat it up per order.\n\nIt's not too sweet for the batter, custard sweetness is mild, overall very healthy to consume without feeling guilty. Soft on every bite and got cute stamp designs according to the festives/events celebrated that period of time. Standard is merlion, which is also exquisite.\n\n(🤫 Price is $3.30 for custard and red bean and $3.90 for taro, but go Shopee digital purchases/flash deals and redeem 1-for-1! Thank me later! 😉)",
      "time": 1742535560,
      "translated": false
    },
    {
      "author_name": "Kent Lin",
      "author_url": "https://www.google.com/maps/contrib/113384018266361965949/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW1nh_MjzbKiURWm5AH-sewq0UZzPFW3XY2IRLVIixXTQoIJlSL=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Mister Wheel is traditional Taiwanese snack. It is similar to Japanese Obanyaki. This is their first international outlet in Singapore.\n\nAlthough the pancake slightly costly $3.90 each, they made on the spot after your purchase.  You will need to wait around 10 minutes.\n\nI ordered Taro. It is very crispy and the filling quite generous. When you bite, the filling is warm and crunchy.\n\nSuitable for kids and elderly as well.",
      "time": 1732372615,
      "translated": false
    },
    {
      "author_name": "Yi Ling",
      "author_url": "https://www.google.com/maps/contrib/115707001285123682601/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUlkcK6FpBb-Q_EER2W7ON8uPix2iL97NAPchaAE0TxCULNloBN=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "We had the Mister Wheel little pancakes for the first time when I was in Taiwan. I remember them being hard on the outside and soft on the inside with ooey-gooey fillings. I'm so happy to see that they have an outlet in Singapore. They offer several flavours beyond my imagination!\n\n⏰️ The waiting time was about 15 minutes, as they made these wheel pancakes from scratch upon ordering, ensuring freshness. The staff was friendly and very meticulous at work too!\n\nIt is a take out concept with a small bench at the back.\n\n-------\nHere is what we tried:\n\nWe tried about seven flavours of the pancake wheels; Sweet & Savoury options. Adding mochi for an extra cost was a nice chewy touch.\n\nWe also tried different savoury flavours: 🫓 Corn Soup, 🫓 Lobster Salad, and 🫓 Truffle Mushroom. All of the savoury options seemed to have a base of mashed potatoes infused with the respective flavours.\n\nFor the sweet flavours, we went with 🫓Taro 🫓Custard, 🫓 Earl Grey and I tried the 🫓 Durian Custard, a collaboration with a local Singaporean dessert shop.\n\nThe real durian custard was very aromatic, creamy, and slightly fibrous, and for $5.80, I think it was an interesting local twist!\n\nIts safe to say that my favourite dessert wheel was the 🫓 Earl Grey Custard. It carried a light floral essence of Earl Grey, and the soft, gooey custard sweet filling was a delightful treat.\n\n🍵 Beverages\nThey offer a good variety of hot and cold beverages, from coffee to milk tea. They specialise in their milk tea! The coffee is pretty decent like cafe standards, which surprised me!\n\nI tried the pandan milk, which was interesting and refreshing. It had a slight sweetness, but it seemed natural with no artificial flavourings, as the taro yam was imported from Taiwan.",
      "time": 1731425531,
      "translated": false
    },
    {
      "author_name": "Wesley Wong",
      "author_url": "https://www.google.com/maps/contrib/107433449088212182977/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLUoYBeMQ_z33NHa0ApQs6jkdbm2dVWs2A_BFN-7vHzZwwP_IWY=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 3,
      "relative_time_description": "5 months ago",
      "text": "The traditional wheel pie from this shop falls a bit short of expectations. Even when freshly made, it tends to be slightly dry, and the texture lacks the fluffiness I was hoping for.",
      "time": 1734758620,
      "translated": false
    }
  ],
  "types": [
    "meal_takeaway",
    "restaurant",
    "food",
    "store",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11675288915949046240",
  "user_ratings_total": 69,
  "vicinity": "3 Temasek Blvd, Mall, #01-K13/K14 Suntec City"
}