{
  "formatted_address": "3 Temasek Blvd, #01 - 645 / 646, Singapore 038983",
  "geometry": {
    "location": {
      "lat": 1.2943949,
      "lng": 103.8602496
    },
    "viewport": {
      "northeast": {
        "lat": 1.295784480291502,
        "lng": 103.8614494802915
      },
      "southwest": {
        "lat": 1.293086519708498,
        "lng": 103.8587515197085
      }
    }
  },
  "name": "Morganfield's | Suntec City",
  "place_id": "ChIJ98evxa4Z2jER8A5FJCiD7m0",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Wui Shyon CHANG",
      "author_url": "https://www.google.com/maps/contrib/107837272845330852818/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJanle24cae23xuIvm47C-gcQYVILoT2rgbHwmYNyffGpuV9ks=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Had my lunch here during a Saturday afternoon, not crowded with plenty of seats available. Ordered a platter for 2. The spare ribs were tender and juicy. However, the babybacks were quite dry and normal, not recommended. The servants were friendly. Price was at higher side. In overall, worth a try but I believe there are better spare ribs elsewhere.",
      "time": 1743935477,
      "translated": false
    },
    {
      "author_name": "GG K",
      "author_url": "https://www.google.com/maps/contrib/113182488876013163119/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJFHYPU6LcVzIMoSpThTDTStOqFYRiAlEmNoAPCaEDEixj2eg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Skip the babyback ribs and just go for the spare ribs! It's really difficult to find tasty ribs in Singapore, but Morganfield's does their spare ribs pretty well. The portions here are rather generous as well, so it's quite worth the price.\n\nThe babyback ribs were disappointing, they were really tough, dry, and lacked flavour. We got this in the Hickory Classic sauce, and also found the taste to be a bit plain. The fries on the side were average, and could afford to be a tad saltier.\n\nThankfully, the spare ribs were much better. They were really soft and tender, and very flavourful. The Bourbon Bacon flavour chosen for this, while premium, tasted delicious. The corn and potatoes on the side were not bad.\n\nService could be better, staff seemed a little unfriendly. Ambience was alright, good for convos as the place wasn't packed even on a weekend. There is a ribs buffet going on currently, which seems to be quite value-for-money if you're a big eater. If not, the ala carte options will suffice. We got one full babyback ribs and half spare ribs, and I'd say this was sufficient for two to share.\n\nOverall, give the babyback ribs a miss, these were really terrible, but I'd definitely recommend coming to try out their spare ribs!",
      "time": 1742920861,
      "translated": false
    },
    {
      "author_name": "DD W",
      "author_url": "https://www.google.com/maps/contrib/105492435028154249606/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVO4TpPAVSXyxkOcKavQ3wl_FQAMF0CV7qZo3PvwZgJYM7ZPH1W=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Baby back ribs with a pile of coleslaw and fries. Yummilicious and tender with. The bbq sauce is balanced with a hint of sweetness. There was a 1-for-1 promotion so it was quite crowded. The price wouldn't be so attractive if it wasn't for the promotion. Service was lacking and half-hearted. If it wasn't for the food probably this place wouldn't have lasted this long. I would still probably go again if there is a similar promotion in the future.",
      "time": 1744548604,
      "translated": false
    },
    {
      "author_name": "Elias",
      "author_url": "https://www.google.com/maps/contrib/106359185834452190948/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXN40RHgOpkhBW-krdKRzd9P9dAUojMs0RBWdAtRkiL0fxvSpQ1=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Service was attentive, pork chop was tender and well marinated. We found the bread pudding to be really nice. Found a plastic band in the mash potato but manager was attentive and offered a refire, dessert on the house and 20 dollar vouchers so we were not too affected. Really impressed by the service though",
      "time": 1741512207,
      "translated": false
    },
    {
      "author_name": "Richard Lau",
      "author_url": "https://www.google.com/maps/contrib/101673940051100677706/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWeVJ90s4rBMg6O2G99ew_ldsaGSHhfgcF6aliFTJ-GHXrjKHVrmg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I ordered the smaller portion of BBQ pork rib, the size is still quite reasonable for 2 pax! The flavour that I chose was the sweet version, and I love it so much! It is not overwhelming sweet, it is just nice to cover over the saltiness, makes it well balanced. The pork ribs are very soft and easily bite off from the bones. I like their BBQ corn also, it comes with a set with the pork ribs. To make it easier to eat, I use the knife to cut the corn kernel. The sauce they put on the corn is really amazing as well, I think it is a bit of mayonnaise, paprika chilli powder.",
      "time": 1738300846,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7921413003021717232",
  "user_ratings_total": 1019,
  "vicinity": "3 Temasek Boulevard, #01 - 645 / 646"
}