{
  "formatted_address": "Malaysia, Johor, Iskandar Puteri, Persiaran Medini 5, G-05, Ground Floor, Sunway BigBoxVillage",
  "geometry": {
    "location": {
      "lat": 1.3965156,
      "lng": 103.6266784
    },
    "viewport": {
      "northeast": {
        "lat": 1.397835780291502,
        "lng": 103.6280425302915
      },
      "southwest": {
        "lat": 1.395137819708498,
        "lng": 103.6253445697085
      }
    }
  },
  "name": "Mr.Dakgalbi Sunway BigBox",
  "place_id": "ChIJYW6hutIJ2jER6At05LqAUs0",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "konova josephine",
      "author_url": "https://www.google.com/maps/contrib/100288788015061648105/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXVZS9LenDTyJemxGP61hRDEa1Re53-NSuhz0Xxg_NWRowzPT9Y=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "The vibes here are pretty fun! It looks like you went to a real Korean restaurant. I mean, it is a Korean restaurant, but we are in Malaysia, right? So for me, it's like I'm not in Malaysia 🤣 whatever. While I wouldn’t necessarily come here for a romantic date (heh), I definitely recommend grabbing a group of friends. Never have I had a more pleasant meal. The staff was so polite and helpful, going above and beyond to make us feel welcome. We had a great talk, and thank you for that. I will definitely come again to taste other dishes. Oh yeah, the kimchi! Damn it, I almost forgot about it. Anyway, the kimchi totally met my expectations. I almost want to ask them for the recipes, haha, or maybe we can minta sikit untuk bawa balik. Kidding 😂",
      "time": 1738588612,
      "translated": false
    },
    {
      "author_name": "Caleb Lai",
      "author_url": "https://www.google.com/maps/contrib/111733963649704338081/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSXtLShdXXzAPOTWt3tHLHAUlMukwwPRGhTm4peDyK0X2VBVoo=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Excellent food and service. The dakgalbi was as good as the one I had in Korea. The waiters were very skilled in cooking the food in front of us.",
      "time": 1747133391,
      "translated": false
    },
    {
      "author_name": "Wesley Wong",
      "author_url": "https://www.google.com/maps/contrib/107433449088212182977/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLUoYBeMQ_z33NHa0ApQs6jkdbm2dVWs2A_BFN-7vHzZwwP_IWY=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "The Korean restaurant at Sunway Big Box Retail Park is a great choice for a cozy and flavorful dinner, especially if you're in the mood for authentic Korean cuisine. One of the restaurant's highlights is its signature spicy stir-fried chicken grill, which is prepared right in front of you on a large pan at your table, adding an interactive and exciting element to your dining experience.\n\nWhile the menu leans towards spicy dishes, there are also milder, non-spicy options available, making it a suitable spot for families with kids or those with different spice preferences. The one that’s stands out is the \"cheese fall\" – a rich, gooey layer of melted cheese that’s served in the same pan as the grilled chicken. The combination of the savory chicken and the indulgent, creamy cheese creates a satisfying flavor that’s hard to resist.\n\nOverall, the restaurant strikes a good balance between bold, spicy flavors and more approachable options, offering something for everyone. Whether you're a fan of Korean street food or just looking for a fun dining experience, this spot is well worth a visit.",
      "time": 1726296834,
      "translated": false
    },
    {
      "author_name": "Shawn Chua",
      "author_url": "https://www.google.com/maps/contrib/110148836935463026308/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWewcd9YZx11S771MmKdm2vhulnkCT4QJuXivg5WbMJ-qx4K_MT=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "5 months ago",
      "text": "Big portion for the price offered. The staff will cook the ingredients, rice and noodles right in front of you and serve you once it’s done.\nPortion were big and generous. Even for the kimchi when I requested for more they did not hesitate to give a big portion right away.\n\nFood were average not the best but I’m sold by their service and portion.",
      "time": 1733229145,
      "translated": false
    },
    {
      "author_name": "Tan Ee Fhong",
      "author_url": "https://www.google.com/maps/contrib/104938879176536000366/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIJqB2C2CtscEWoL-8aTKC1OFlEzA6HCKUlRQ5euD-D_hN4uA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "5 months ago",
      "text": "Tasty and not too spicy. Ordered a 3 pax set meal for me and my wife but is still hungry and added another fried rice at the end. They do not serve water but the banchan is refillable.",
      "time": 1734410653,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14795029266050583528",
  "user_ratings_total": 208,
  "vicinity": "Sunway, G-05, Ground Floor, Sunway BigBoxVillage, Persiaran Medini 5, Iskandar Puteri"
}