{
  "formatted_address": "152 Ubi Ave 4, #01-01, Singapore 408826",
  "geometry": {
    "location": {
      "lat": 1.3348442,
      "lng": 103.8966449
    },
    "viewport": {
      "northeast": {
        "lat": 1.336324230291502,
        "lng": 103.8982345802915
      },
      "southwest": {
        "lat": 1.333626269708498,
        "lng": 103.8955366197085
      }
    }
  },
  "name": "Mui Siong Minced Meat Noodles (Ubi)",
  "place_id": "ChIJoQu_EPsX2jERoEM0HGutb2E",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Shawn Chua",
      "author_url": "https://www.google.com/maps/contrib/110148836935463026308/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWewcd9YZx11S771MmKdm2vhulnkCT4QJuXivg5WbMJ-qx4K_MT=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "This place has completely won me over with its incredible flavors and perfectly executed dishes. The star of the show? The succulent, juicy pig liver that’s cooked to absolute perfection.\n\nThe liver is so tender and flavorful, with just the right amount of richness and no hint of that overpowering metallic taste you sometimes get elsewhere. It’s clear that the chefs here know exactly how to handle this ingredient—it’s sliced thinly, cooked just enough to retain its juiciness, and pairs beautifully with the savory minced pork and springy noodles. Every bite is a burst of umami goodness!\n\nThe broth is another highlight—rich, fragrant, and deeply satisfying. Combined with the perfectly balanced toppings and the option to customize your spice level, this dish is a true masterpiece. The portion sizes are generous, and the service is quick and friendly, making the whole experience even better.\n\nIf you’re a fan of pig liver or just looking for an amazing bowl of noodles, Mui Siong is the place to go.",
      "time": 1741243442,
      "translated": false
    },
    {
      "author_name": "Wei Ming Tan",
      "author_url": "https://www.google.com/maps/contrib/104144358766800192773/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLkGptYRqltn9hcTDBs9VcMA2gCSQtat5KhPtq6s1nF2m5xRoTx=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "A most delightful foodcourt dining experience. The bak chor noodles was good, but the strength is clearly in their servings of liver. Very generous and cooked al dente (if ever this chichi term could be applied to the humble Ter Kua aka pig liver) like how my mum cooks it. The noodles could be cooked just a tad less, but that is probably being picky. The chili was not bad. The porridge was also very good. I liked that it is not salty at all, and diners can salt it to their desired level. The pork slices were generous and lean, which generally means more cost to them as lean meat (as opposed to fatty meat) is expensive. Porridge man even asked me how I would like my eggs...a very Starbuckish gesture in a humble foodcourt. A very healthy breakfast if you ask to do without the century egg, which I did. I am sure it will even be more tasty if I just went the full-blown century egg pork porridge, but alas my cholesterol warning alarm had already gone off quite violently with the liver soup. And the ambience is foodcourt nice - I am not only presented with very clean aesthetic hand-washing points adorned with fake greenery, but also life-size wall stickers of Michael Jackson and Madonna in their signature poses. Obviously the owner of this foodcourt pays not only attention to the food quality, but the overall dining experience as well for the average worker in Ubi.",
      "time": 1733708090,
      "translated": false
    },
    {
      "author_name": "Amanda Lim",
      "author_url": "https://www.google.com/maps/contrib/102266895612135939440/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXxV7_k0x1HksddXwuH02Needkk-w-ggafIjQaF7Yhqm7u2UdoX=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Mui Siong Minced Meat Noodles and Porridge at Ubi is a hidden gem that brings a touch of nostalgia and authentic flavors to Singapore’s bustling hawker scene. Nestled in a modest coffee shop, this humble stall has gained a loyal following, and for good reason. Queue can be 30-45min during lunch time. So try to come off peak.\n\nThe star of the menu is undoubtedly their minced meat noodles, which are a perfect balance of flavors and textures. The noodles are springy and cooked to perfection, coated in a savory, slightly tangy sauce with hints of vinegar and lard. The minced pork is well-seasoned, tender, and generously portioned. Adding to the dish’s allure are slices of pork liver, meatballs, and crispy pork lard, each element complementing the others beautifully. The soup served alongside is light yet flavorful, a comforting counterpart to the boldness of the noodles.\n\nTheir porridge is equally impressive, boasting a smooth and velvety texture with just the right consistency. The rice is simmered until it blends seamlessly into the rich broth, with toppings like minced pork and century egg elevating the dish further. It’s the kind of comforting meal that feels like a warm hug.\n\nThe ambiance is quintessentially hawker-style—bustling, unpretentious, and full of character. Regulars chat animatedly over their meals, adding to the lively atmosphere. Despite its simplicity, Mui Siong exudes a charm that reminds you why Singapore’s hawker culture is so beloved. A must-try spot for anyone craving authentic and satisfying comfort food.",
      "time": 1733539255,
      "translated": false
    },
    {
      "author_name": "BB CaveMan",
      "author_url": "https://www.google.com/maps/contrib/117715219935569504601/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLBpRHaYFjVuOyGxtzTNu1GcUvsh5dQCFF-31P0vARO5sD5dw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "No queue with ample of seats at around 9.45am.\n\nLivers comes in thick chucks and were perfectly done, not too tough, not bloody.\n\nTried both the soup and dry version. Equally good.\n\nThe flavouring for the noodle can be a little more.\n\nClean toilet.",
      "time": 1740985638,
      "translated": false
    },
    {
      "author_name": "Tan Ellie",
      "author_url": "https://www.google.com/maps/contrib/111125302058390843293/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKMlSo6Wn8C4uNsCZOGQ3LXtZE3yNt2wpFuC9ebBmgbhLvEIA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Ordered the dry liver + noodles (no. 4) for $6.50. Mui Siong serves the best pork liver in Singapore, thickly sliced and always cooked just nice. First time trying the dry version which is seasoned with vinegar. Prefer this over the soup version since it isn't that gelak with the vinegar. There's got to be at least 10 slices which is very generous of them.\nHappy to find another outlet now that the one at Veerasamy Rd is temporarily closed.",
      "time": 1728709249,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "restaurant",
    "food",
    "store",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7021021019640185760",
  "user_ratings_total": 131,
  "vicinity": "152 Ubi Avenue 4, #01-01, Singapore"
}