{
  "formatted_address": "275 Thomson Rd, #01-06, Singapore 307645",
  "geometry": {
    "location": {
      "lat": 1.3213008,
      "lng": 103.841635
    },
    "viewport": {
      "northeast": {
        "lat": 1.322685080291502,
        "lng": 103.8430886802915
      },
      "southwest": {
        "lat": 1.319987119708498,
        "lng": 103.8403907197085
      }
    }
  },
  "name": "Mukjja Korean Chinese Restaurant",
  "place_id": "ChIJnU9LayEZ2jERQe2Z59-wPnY",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Linda Liu",
      "author_url": "https://www.google.com/maps/contrib/105605233685634546443/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVYcBUNpPRjsIcuuv2qNKw5bZkS9FtKD373rlGObMuuvv61injnXA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "CNY lunch with family from the net after 26 years is truly a testament to the power of friendship and how amazing things can work out.\n\nWe chose to dine at\nMukjja Korean Chinese Restaurant, located at 275 Thomson Rd, #01-06 Novena Regency, Singapore 307645.\n\nAs we entered, we were struck by the cozy atmosphere, with only one table of 6 or 8 patrons finishing their meals, soon followed by a steady stream of customers.\n\nWe opted to try their signature dishes, saving room for dessert next door.\n\nThe ginseng chicken soup was a revelation, changing my perception of this traditional dish. The flavors were rich and well-balanced, without overpowering ginseng taste.\n\nThe chicken was incredibly tender, literally falling off the bone.\n\nOur set lunch consisted of their must-try items: a half-and-half Jajangmyeon and Jjampong, accompanied by tangsuyuk aka sweet and sour pork.\n\nThe Jjampong was packed with squid flavor and sweetness from the onions. While my sister found it slightly spicy, I craved more heat. The noodles were perfectly cooked, infused with the rich flavors of the dish.\n\nI thoroughly enjoyed the Jajangmyeon, with its black bean sauce, onions, and minced meat. My sister noted it was slightly salty compared to her previous visit.\n\nThe tangsuyuk was generously portioned, and I savored every bite. The sauce was balanced, neither too sour nor too vinegary.",
      "time": 1738406862,
      "translated": false
    },
    {
      "author_name": "Heizhudaddy",
      "author_url": "https://www.google.com/maps/contrib/112609819402783687098/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJyVvwtmaxsJ48keZEQqujdfeqp_tp74omMNiKSdrzxOrUJ3A=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Recommended by a fellow foodie to this place for the jajangmyeon and my it was awesome. Haven’t tried enough jajangmyeon to say it’s the best I’ve tried, but it is delicious. Sauce is a great balance between savory and sweet. We also tried the spicy seafood noodle and it was equally delicious, especially on a cool rainy day.\n\nSweet and sour fried pork is also good, not too sweet. And finally the samgyetang (ginseng chicken soup) completes the experience, where the flavorful soup is being simmered for long enough that the chicken, even the bones, just breaks easily.",
      "time": 1737283774,
      "translated": false
    },
    {
      "author_name": "Ong Chong Yen, Stella",
      "author_url": "https://www.google.com/maps/contrib/108152284586785217597/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLfsOk6meTDFzZGlBr0lfknF7w-UR6WQnx40-I9q6Lv2oqshg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Lunch set -$44 for tangsuyuk, jjampong (less spicy was perfect for me) and jajangmyeon. Very worth it with hearty portions! The amazing thing was that as the tangsuyuk got cold, the sauce got more sticky and the caramelization became more outstanding, absolutely delicious. The jajangmyeon was good but a bit oily, needed the yellow radish to cut the grease. Loved every bit of the jjjampong.\n\nBought a pack of kimchi ($12) as takeaway and it's getting better by the day-refreshing, mildly spicy and v addictive. Not too sour.",
      "time": 1740585757,
      "translated": false
    },
    {
      "author_name": "Garett Lee",
      "author_url": "https://www.google.com/maps/contrib/102429779161382378043/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXqsbomW_9k_E_jIsDC2-9o7CycpwcvI9g1ho_vo3yA8VSe4fNC=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "They have moved to the unit just next door and it's renovated nicely with a lovely interior decor that's speaks well of their growth of their business over time! My family loves their jajangmyeon and its truly the best in town compared to so many other establishments that we have tried before! The sweet sour pork is great too! I love their fried chicken in spicy garlic sauce - it gives the right kick of spice without being overly spicy! During our meal time there, we had a handful of Korean families dining there too - clearly a testament of their following; something to be proud of!",
      "time": 1723960617,
      "translated": false
    },
    {
      "author_name": "Paulin Chua",
      "author_url": "https://www.google.com/maps/contrib/100888944122113034322/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJi5X0-owEEDEuw9bftO4iGmHnvwM5IQpHIu0fzfZAicKVwNw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "3 weeks ago",
      "text": "Another good jajangmyeon option. We tried their seafood fried jajangmyeon. It's oilier as compared to the usual jajangmyeon as there is chilli oil in it but its more fragrant than the usual jajangmyeon. Not the best but worth a try. We like their spicy garlic fried chicken. Delicious 😋 😋 😋  as its full of onion, garlic and chilli. Mukjja is definitely a korean Chinese restaurant worth a try.\nAdding in our 2025 review after 2 yrs!! Back at Mukjja for their jajangmyeon and this time we took their set A which comprises of half jajangmyeon and seafood jjampong and tangsyurou. The jajangmyeon was still as good but the jjampong is stick lacking the wok hey taste and soup base was thin. We prefer the thicker soup base. Must order their tangsyurou as it's really sooo 👍. Right sweet and sourness and meat was crunchy and soft at the same time.",
      "time": 1745667207,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8520442020741377345",
  "user_ratings_total": 327,
  "vicinity": "275 Thomson Road, #01-06"
}