{
  "formatted_address": "8 Stadium Walk, Level 2 Water Sports Centre, Singapore 397699",
  "geometry": {
    "location": {
      "lat": 1.3012675,
      "lng": 103.8728744
    },
    "viewport": {
      "northeast": {
        "lat": 1.302746330291502,
        "lng": 103.87512855
      },
      "southwest": {
        "lat": 1.300048369708498,
        "lng": 103.87206115
      }
    }
  },
  "name": "Mulberry Learning @ Kallang",
  "place_id": "ChIJyep4f8oZ2jERAYmXcA6lTp8",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Shyam Kumar",
      "author_url": "https://www.google.com/maps/contrib/117335304725080729875/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUMsMrVbPlS3j46nVzbetbYp6OeTg-GKyj9tghhCh5b14yz8HWz=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Our two kids went to Mulberry Learning @Kallang for the past two years and it was such a a wonderful experience. The school is located by the river and very close to two MRT stations (Stadium & Tanjong Rhu) with beautiful views and ample activities (outdoor play area, water fountain, beach volleyball area – for sand play, running area near stadium etc) all around the school which keeps them well engaged.\n\nA special mention must go to the incredible Chinese teacher, Xie Laoshi, whose dedication and enthusiasm for teaching the language has been truly inspiring.\n\nSimilarly, Teacher Thivya, their English teacher, has been exceptional in fostering a love for reading and writing. Their innovative and creative teaching methods have made learning English an enjoyable and enriching experience for our kids.\n\nWe are so grateful to the entire staff at Mulberry Kindergarten @ Kallang for their hard work and commitment. We highly recommend this kindergarten to any parent looking for a warm, supportive, and stimulating environment for their kids.\n\nThank you, Mulberry @ Kallang, for two wonderful years!",
      "time": 1742721491,
      "translated": false
    },
    {
      "author_name": "nikita saboo",
      "author_url": "https://www.google.com/maps/contrib/100293422761913059446/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL7YqJiD9Yn9uy8oRWEC_NoCVDhDikVSlU97gKgVA3A-0h-HQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "We've had an amazing experience at Mulberry Learning  Kallang. The teachers are passionate, patient, and skilled at creating a supportive and engaging environment that fosters curiosity and creativity. The curriculum is well-rounded, with a perfect balance of play, exploration, and structured learning. Our child has developed new skills, made wonderful friends, and grown in confidence. The communication is excellent, with regular updates and opportunities for feedback. The facility is bright, cheerful, and well-organized, providing a happy and safe space for our child to learn and grow. We feel grateful to have found Mulberry Kallang and highly recommend it to other families seeking a high-quality preschool experience.",
      "time": 1724019771,
      "translated": false
    },
    {
      "author_name": "Wendy Quek",
      "author_url": "https://www.google.com/maps/contrib/106671907541946449038/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU9r37MtUS89fBf8_N_z4iuYf7v0SC_5JCVBUECbnExnG_5vjL1=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Mulberry Learning at Kallang is a lovely preschool. My child has been with them for the past three years, starting from her infant days, and the growth and development we've seen in her have been incredible. The care and dedication of the teachers are truly outstanding—they create a nurturing environment that fosters both learning and emotional growth.\n\nThe preschool’s location near Kallang River is a fantastic bonus. It provides wonderful opportunities for outdoor play and scenic walks, which enrich the children's experience and connect them with nature. Many caring teachers there who are well trained and experts in their fields too. Lots of activities and planned excursions too to encourage them to learn beyond the classroom.\n\nIf you’re looking for a preschool where your child will receive exceptional care and have plenty of fun, Mulberry Preschool Kallang is the place to be. We’re so grateful for the positive impact they’ve had on our child's early years!",
      "time": 1725341204,
      "translated": false
    },
    {
      "author_name": "rightangled",
      "author_url": "https://www.google.com/maps/contrib/107666330651895140446/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKYRMtoLC4DT1FnKhClyjyze9ByF4DiVx0bDVO2EkrOrMPNWg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "We have been very happy with our experience at Mulberry Kallang! Our son started in infant care, and from day one, we have felt the love and care that the teachers provide. The infant care area is very spacious and conducive.\n\nOne of the standout features is the access to amazing outdoor facilities at the Singapore sports hub. The children regularly get to enjoy activities like playing in the sandpit, splashing in the kids’ pool, playing in the playground with nature or running on the track. We always feel very assured that he is in a safe, fun and loving environment.  Every day, our son goes to school with a smile which speaks volumes about how much he enjoys his time there.\n\nWe feel very fortunate to be part of this loving community and highly recommend it.",
      "time": 1726806441,
      "translated": false
    },
    {
      "author_name": "Megan Frankel",
      "author_url": "https://www.google.com/maps/contrib/110627080027263063444/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ-K-bXW38TVooV6j0RzftDJgZ8tEurRAwuOxi4jMLh5a7STw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "Mulberry Kallang is a wonderful and nurturing school. They offer the perfect balance between play and academics, allowing the children to thrive in a safe and happy environment. The school communicates very efficiently with parents and are very attentive to each child based on his/her specific needs. Teachers and admin staff alike are so warm and nurturing, encouraging learning through play as well as discipline and routine through a very gentle approach. I would highly recommend Mulberry Kallang as a foundation for any child’s school journey!",
      "time": 1723107140,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11479293981651077377",
  "user_ratings_total": 10,
  "vicinity": "8 Stadium Walk, Level 2 Water Sports Centre"
}