{
  "formatted_address": "36 Namly Cres, Singapore 267551",
  "geometry": {
    "location": {
      "lat": 1.3270753,
      "lng": 103.7944996
    },
    "viewport": {
      "northeast": {
        "lat": 1.328435730291502,
        "lng": 103.7958223802915
      },
      "southwest": {
        "lat": 1.325737769708498,
        "lng": 103.7931244197085
      }
    }
  },
  "name": "Mulberry Learning @ Sixth Avenue",
  "place_id": "ChIJB2zYkoQR2jERcNKDtoY4Hjo",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Vanessa Ng",
      "author_url": "https://www.google.com/maps/contrib/103792641691462146336/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLvj2J0gcvwvvJUok5lXDVZaT2rQcqCNPUev97m6P8YMInM5Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "While the school’s cozy environment and their intended curriculum were initial factors for our choice   , I wish to highlight the teachers who spends the most time with them are definitely many times more crucial .\n\nHigher management/ owner  of this school needs to work on appreciating the teachers , poor management led to high turnover rate and resulting in a constant understaffed situation in the school.\nI just want to say this school is beyond lucky to have nurturing teachers especially Teacher Tiara and Chen Lao shi who taught my child with so much love , effort and patience . If not for them , I would have shifted out of MB @ sixth Avenue  long ago . This 5 star review is solely for  the teachers who haven’t given up because of their love for the kids in school.",
      "time": 1731010377,
      "translated": false
    },
    {
      "author_name": "Sharifah Fadilah",
      "author_url": "https://www.google.com/maps/contrib/105079355777431508601/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKIe0qRcB4y2_oIljrqA7TaN1cru5ECkvmEKO4TSEHhSWzsSA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Mulberry@Namly is such a wondrous place for children to grow and develop. Their teachers here are what makes the school a great place. They're kind, hardworking, and very nurturing (all traits you'd want in teachers). Principal is proactive and on the ground as well.\n\nXu Laoshi has been a wonderful teacher to my daughter, Farah, guiding her with great care and patience. Her kind and gentle teaching approach has created a nurturing learning environment, and Farah feels truly fortunate to have her as a teacher. It's no surprise that when Farah struggles to wake up some mornings, just mentioning Xu Laoshi's name instantly perks her up :)",
      "time": 1739640606,
      "translated": false
    },
    {
      "author_name": "Samantha Ong",
      "author_url": "https://www.google.com/maps/contrib/115096931313342147417/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIT90-IZ093KEvPShw56GIJxZ-5rJs4WKdx9xmrTHqlFcD1nw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Enrolled my eldest in MB sixth ave when they first opened. Love the new environment and teaching methodology.\nWe can’t thank the teachers enough for the care and dedication they bring to the classroom every day - especially Teacher Tiara and Chen Laoshi plus all the ex teachers that has left. Our child has blossomed under their guidance and truly looks forward to going to school.\n\nThe down side is, mngt/owner of this franchised branch needs to work on how to retain their teachers - this has been the biggest issue since day 1.",
      "time": 1731028864,
      "translated": false
    },
    {
      "author_name": "FerEng",
      "author_url": "https://www.google.com/maps/contrib/110795527058006497439/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKRErBTbiXfmcTLuZwIrSIRCPCgTexpF46a8ta8rCFeduovlw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "My son started his pre-school journey at Mulberry Namly at Sixth Avenue when he turns 18 months and up till today. What attracted me was the school's interior that are modern that gives off a warm and cozy vibe. Spacious outdoor environment with waterplay facility that's within the compound that my son love most, while he develop gross motor skills and having active learning through play. Thankful for the group of dedicated educators in making learning fun & engaging for my son. Special shoutout to Teacher Tiara & Chen Laoshi, grateful for your tireless efforts & commitment in nurturing our child. My son also frequently shares about his daily adventures with us about school.",
      "time": 1730105363,
      "translated": false
    },
    {
      "author_name": "Huang",
      "author_url": "https://www.google.com/maps/contrib/103273144164265251349/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIGOTXCAywA2HvRHuqf9cUzUgh1KbsJQMBDuIBtikdSWVc1VA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "I can say that it is one of the best nursery schools in Singapore. My daughter is very happy here. The school management system is very complete. It pays attention to every student's problem and parents' opinions, and quickly handles problems and communicates in a timely manner. The teachers are also excellent and professional, and the environment is clean and tidy. Highly recommended!",
      "time": 1677720444,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4187846854740005488",
  "user_ratings_total": 11,
  "vicinity": "36 Namly Crescent"
}