{
  "formatted_address": "51 Fernvale Link, Singapore 797536",
  "geometry": {
    "location": {
      "lat": 1.3948965,
      "lng": 103.8787727
    },
    "viewport": {
      "northeast": {
        "lat": 1.396204180291502,
        "lng": 103.8801839802915
      },
      "southwest": {
        "lat": 1.393506219708498,
        "lng": 103.8774860197085
      }
    }
  },
  "name": "My First Skool at 51 Fernvale Link",
  "place_id": "ChIJ8R_YbXoW2jERr4vwJWFSGt4",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Chantal Lim",
      "author_url": "https://www.google.com/maps/contrib/104119409093113264472/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLbcazL24jpsTFDl6hiWnHQgGU2TmGr2IaD1hLk6ej1uTCLUw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "As a parent, I couldn't be more pleased with the experience my child has had at MFS, 51 Fernvale Link. From the very first day, we had felt welcomed into a supportive and nurturing community. The school’s commitment to fostering a love of learning is evident in the innovative teaching methods and the individualized attention given to every child. It’s reassuring to know that my child is not only receiving an excellent education but also developing important life skills.\n\nUnder Ms Gillian's leadership, she had created a warm and welcoming school environment where my child feels safe and supported. She is also committed to open and two-way communication.\n\nLastly, we would like to express our sincere gratitude to Teacher Sandra and Wang 老师 for their outstanding dedication, support, and care throughout this school year. Communication with us has been clear and consistent, and they always take the time to address any questions or concerns with kindness and professionalism.\n\nZhi Yu has flourished under their guidance, and we have seen tremendous growth, both academically and personally. Zhi Yu looks forward to school every day and is excited to share what she had learned.\n\nThank you for your unwavering commitment to our child's success and well-being. We felt incredibly fortunate to have both Teacher Sandra and Wang 老师 as Zhi Yu's teacher for the year.\n\nWe highly recommend MFS at 51 Fernvale Link to other parents looking for a place where their child can excel and feel supported.",
      "time": 1733900856,
      "translated": false
    },
    {
      "author_name": "Michelle Tan",
      "author_url": "https://www.google.com/maps/contrib/106484076540715759097/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ-9c9EUnzN9WSsrNBBtj3l6vk04E2AcjyfQAo0_hCpmQCs8g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Kudos to MyFirstSkool Team!❤️ Although my son is only with them around six months, but I’ve already decided to write this review to show my appreciation for the hardworking teachers—especially Teacher Annie Liza Ligon Lim and Teacher Feng Bing. They understand my child’s situation, and I truly feel that he has been well taken care during this period.\n1.\tTeacher Annie noticed that my child didn’t enjoy eating, so she came out some strategies to help my son, and now my son is able to eat in school, as well as at home too. I’m so grateful!!\n2.\tTeacher Annie also has a great way of using different tones of voice to capture the children’s attention. My son really enjoys listening to her stories.\n4.\tMy child, who previously didn’t speak Mandarin at all last time, and now he has started slowly speak mandarin at home, I super surprise!!! Sometimes he will say 这里，那里，我要，飞机 etc. One day, he suddenly started singing 拔萝卜at home, I really quite shock for this, and very happy he got such improvement. Thank you Feng Lao Shi!!!\n\nAt the moment, I feel very confident leaving my child to them, and I can go to work with peace of mind.\n\nThank you both teachers!❤️ Our society needs more teachers like you, keep it up!❤️",
      "time": 1745422064,
      "translated": false
    },
    {
      "author_name": "Angela T",
      "author_url": "https://www.google.com/maps/contrib/114552158801350504645/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUH9DYbwzSkh-x1y6pm4xYHC5qRaym3fYw2JBmilqvRL-VCAoSr=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "I can't recommend this school enough!\n\nWe enrolled our daughter when she was 26 months old, and it has been an incredible experience. She has blossomed in her time here, becoming more sociable, independent, and empathetic. Her communication skills have improved significantly, thanks to the engaging activities the school offers.\n\nThe teachers and staffs are truly exceptional—caring, knowledgeable, and dedicated.\n\nA special shout-out to Teacher Zel and 何老师 for being such loving and caring teachers to our daughter. Grateful for their amazing efforts in planning activities and crafting a wonderful curriculum. Our daughter loves both of them so much! ❤️\n\nEvery day, our daughter looks forward to going to school, which speaks volumes about the nurturing environment. We have no regrets about our decision, and we're so grateful for the positive impact this school has had on her development. Thank you My First Skool @ 51 Fernvale Link!",
      "time": 1726674156,
      "translated": false
    },
    {
      "author_name": "Ro Hini",
      "author_url": "https://www.google.com/maps/contrib/101047125480659341684/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL3IJ77G-_D0C4nsc1f8hLewuaZISMVm7RBF5ArOfwWCu8IUQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "We are truly grateful for Lin Laoshi, my son's Chinese teacher from Nursery 1 and Playgroup and Teacher Graze from Nursery 1 from MFS Fernvale Link. They are both nothing short of extraordinary! From the very first day, they have both gone above and beyond to create a nurturing and loving environment for my son.\n\nLin Laoshi's dedication shines through in the way she connects with her students. Thanks to her encouragement and engaging teaching style, my son's Chinese has blossomed, and he absolutely loves learning with her. What warms my heart the most is the genuine love and kindness she shows every day. She always speaks so positively about him, celebrating his achievements, no matter how small, and that has made a world of difference in his confidence.\n\nTeacher Graze has a unique way of making learning fun and engaging, which has sparked a genuine love for English in my son. His progress has been remarkable, and I can see how much he enjoys the stories and activities she brings to life in the classroom. She has a wonderful ability to connect with her students, always offering encouragement. Her positive reinforcement has boosted my son's confidence immensely.\n\nWe feel incredibly lucky to have both of them in our lives. Thank you, Lin Laoshi and Teacher Graze for your unwavering support and for nurturing not just my son's language skills, but his spirit as well. You both are truly gems and as parents we feel so supported by both of you. We love you both and are eternally grateful to have met you! ",
      "time": 1731133661,
      "translated": false
    },
    {
      "author_name": "Shuyi Tan",
      "author_url": "https://www.google.com/maps/contrib/108102431572914369124/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVaMjJAAK599li4AmDj-IzFBfPZU8g1KOl25Uz8IFhrksiC0fNtyw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I have 2 girls , the elder one graduated 3 years ago and MFS at Fernvale Link helped to set her great interest in learning, the teachers (Jiang Lao Shi, Teacher Tiffany and a few more) whom had taught her had been very patience. She had shown these good traits in her primary school journey.\n\nNow my younger girl had been in MFS at Fernvale Link coming to 2 years and she is showing a lot of love towards others, keeping her on track with the milestones, performing with confidence. Teacher Sandra and Wang Lao Shi had certainly guide the kids very well. Other teachers like Teacher Fa, Teacher Fahana, Teacher Jomian had also been very fun loving with the kids.\n\nMost important, the principal Mrs Gillian and deputy principals are the ones who helped to shape the good infrastructure of the teachers.\nI had seen other preschools, and MFS at Fernvale Link is the one where I see principals mingling with the kids, morning with story telling and sing along.\n\nPlease continue the efforts and bring more smiles to parents and enrich kids with fun and knowledge!",
      "time": 1730719166,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16004194803016305583",
  "user_ratings_total": 58,
  "vicinity": "51 Fernvale Link"
}