{
  "formatted_address": "Blk 997 Buangkok Cres, #01-01, Singapore 530997",
  "geometry": {
    "location": {
      "lat": 1.3848996,
      "lng": 103.8813021
    },
    "viewport": {
      "northeast": {
        "lat": 1.386194830291502,
        "lng": 103.8827086802915
      },
      "southwest": {
        "lat": 1.383496869708498,
        "lng": 103.8800107197085
      }
    }
  },
  "name": "My First Skool at Blk 997 Buangkok Crescent",
  "place_id": "ChIJW5elNYAX2jERyTjP92xcXXo",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Nabilah McGhie",
      "author_url": "https://www.google.com/maps/contrib/106490828311695266914/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVMQxxF9o09-MEQr5m41khnEO8rF46YDdKCItNmKriy0kKE6XId=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Buangkok MFS Center has been wonderful for our son. The teachers and staff are nurturing, patient, and advocate for learning beyond the classroom through outdoor activities and excursions. Their dedication and creative approach made our son’s first school experience truly memorable. Highly recommended!",
      "time": 1737710123,
      "translated": false
    },
    {
      "author_name": "Muhammad Farhan",
      "author_url": "https://www.google.com/maps/contrib/118113664982791345364/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK0cjgqZmrkguhaoZbP2t-TqNkc9NAkIupKCGh25hwYNX5XKQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "My son graduated from My First Skool in 2023 and have been with them since he was an infant. We sincerely appreciate all staff that have been taking care of him over the years and we are happy to see that he is coping well in primary school. My son often talks about his preschool memories, especially of his friends and teachers.\n\nThe teachers and leaders at Buangkok branch are caring and enthusiastic in taking care of the children. We always look forward to the centre events that we get to participate in. Thank you My First Skool for being a special part of  our son’s preschool journey!",
      "time": 1737456894,
      "translated": false
    },
    {
      "author_name": "Nadzerah Jufri",
      "author_url": "https://www.google.com/maps/contrib/114379308257947738986/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLUL7Wy-wce30_P_6zCPC0IKBozOhh61Xk7ODPiyEYOnr2GIw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "MFS@BKC01 has always played a big role in my family’s day to day routine. It has and will always be our number one choice. From the principal to the staff, everyone has always put the children’s safety and security as a priority. Be it physical, emotional, or mental wellbeing, the children are in good hands. Thank you MFS@BKC01.",
      "time": 1735861920,
      "translated": false
    },
    {
      "author_name": "Jacynda Teo",
      "author_url": "https://www.google.com/maps/contrib/106869789709834461358/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKW_EyKxmvNJGOPTwNtlIC0mz63yDYntbFdBHLBTCx4qj0O_sc=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "I’d like to express my heartfelt appreciation for the outstanding experience at My First Skool preschool center at 997 Buangkok Crescent. The efficiency and warmth shown by both the teachers and non-teaching staff are truly remarkable. The clean and inviting environment of the school creates a healthy and welcoming space that promotes a positive learning atmosphere. My children genuinely enjoy attending school and often talk enthusiastically about their teachers and friends, which speaks volumes about the nurturing environment you provide.\n\nI am particularly impressed with the thoughtful planning of daily meals and curriculum, reflecting a deep understanding of the children's needs. The enriching courses have significantly enhanced my child's learning capacity. Additionally, the their extension bay offers a well-designed transition into a more structured classroom setting, helping them adapt smoothly. The teachers in the infant care are exceptionally reassuring regarding my child's growth, which has been incredibly comforting for me as a parent. Thank you for creating such a supportive and effective educational environment!",
      "time": 1726044151,
      "translated": false
    },
    {
      "author_name": "AnarchistGodwin",
      "author_url": "https://www.google.com/maps/contrib/104170583610621314799/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJSoGZmT9dSkCIULL6UfDg15GXNztkIkXcEDJwJcimgnO9_UA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "We couldn’t be happier with the care our daughters have received at MFS BKC01! From the moment we send our child for infant care, we felt welcomed and assured that our children would be in great hands. The staff is incredibly nurturing, attentive, and genuinely passionate about fostering a safe and engaging environment for the kids.\n\nOur daughters have thrived here, making friends and enjoying a variety of enriching activities that promote their growth and development. We appreciate the open communication and the regular updates we receive about their progress.\n\nIt’s clear that MFS BKC01 prioritizes the well-being of every child, and we are so grateful to have found such a wonderful place for our girls. Highly recommend to any parent looking for a loving and supportive childcare setting!",
      "time": 1727443391,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8817305268545075401",
  "user_ratings_total": 9,
  "vicinity": "Blk 997 Buangkok Crescent, #01-01"
}