{
  "formatted_address": "312C Sumang Link, #01-163, Singapore 823312",
  "geometry": {
    "location": {
      "lat": 1.4111341,
      "lng": 103.9010473
    },
    "viewport": {
      "northeast": {
        "lat": 1.412497280291502,
        "lng": 103.9024060802915
      },
      "southwest": {
        "lat": 1.409799319708498,
        "lng": 103.8997081197085
      }
    }
  },
  "name": "My First Skool at Blk 312C Sumang Link",
  "place_id": "ChIJkYuHaOUV2jERY3HDQgW3Luo",
  "rating": 5,
  "reviews": [
    {
      "author_name": "PikachuJoel",
      "author_url": "https://www.google.com/maps/contrib/102134982700217796814/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLfuzo9D4WqLG5se4crhUgfhuFlYY7SLnAYHhGn2BHJ6a414A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "The principal and staff were helpful and  friendly. The teachers were caring and took good care of my child.  The  N1 teachers and other staff regularly updated the well-being of my child.  They took our concern seriously and gave us timely feedback. They also planned interesting learning resources for us to engage with our child at home. Definitely will recommend parents to sign up in this centre!",
      "time": 1735196552,
      "translated": false
    },
    {
      "author_name": "Austin Chan",
      "author_url": "https://www.google.com/maps/contrib/107260261137384742697/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLbHkxPbe59lFb7SjkWlypR7UVq_f2dunZ9jogh7j50BReU8Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I have 3 children who attended My First Skool @ blk 312C Sumang Link. My 2nd girl is graduating this year. My K2 child get to attend a variety of field trips from outdoor exploration to knowing more about Art through school collaboration with National Gallery Singapore. The K1 and K2 children's Art pieces was showcase in NGS too!\nThere was a series of transition activities the school did to help orientate my K2 child to get ready for Primary School and learn about money sense by \"buying\" food during lunch and tea time!\nMy 3rd child who is in N2 enjoy going to school everyday and looking forward to play with her friends.\nOur family enjoys the festive celebrations that the school organize for everyone to have fun and get together. I really want to thanks the school Principal Ms Joey for being such a great and exceptional leader, for managing the entire school and us distinctively. I also want to thanks the K2 teachers Tr Wani and Li Laoshi as I saw how much my girl have improve in her both English and Chinese. She is more open up now and more courage when facing problems. I also want to thanks the N2 teachers Tr Lee and Yan Jie Laoshi for having so much patient with my #3 as she having emotional break down due to having new member in the family. Both teachers were by her side when she had a melt down in school and explain things to her slowly in order for her understand.",
      "time": 1735372893,
      "translated": false
    },
    {
      "author_name": "debbie khoo",
      "author_url": "https://www.google.com/maps/contrib/115208416899539027770/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL6xQAbI_dVc_D_a3dXhlg6l72k9WVD3tMYbHycV0D3yLm6ew=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Loveee the teachers and principal here.\nWe used to send our oldest kid to another childcare center under another organization, and did not quite enjoy the experience there. we soon had to switch due to moving of house. Chanced upon the first Myfirstskool in AMK, and then another house move led us to Blk 312 Sumang Link due to our pleasant experience in the AMK branch. Ever since then, we have always shared with friends and family how nice the teachers are, how our kids have grown up in a caring and nurturing environment. Our kids have learnt well under the care of the teachers and principal. All my three kids are proud graduates of Myfirstskool Blk 312 Sumang Link, and I will continue to advocate the childcare centre Myfirstskool to many others. :)\n\nA Happy Parent.",
      "time": 1735209556,
      "translated": false
    },
    {
      "author_name": "朱贺然",
      "author_url": "https://www.google.com/maps/contrib/106906385735390749872/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLKYAS-RSaC9huKWDEfu1Es_JMYKDKcmyl5MoP3vzTZS_cd3w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Hi Everyone,\n\nI would definitely recommend Blk 312C Sumang Link. I am extremely grateful to Teacher Wani, Li Laoshi, Ms Joey and all other teachers in My First Skool Sumang Link. It is a great school. I see my son has improved a lot from being a shy boy when he just came in since February 2024 to a more outspoken and braver boy who will ask more questions in class. I enjoyed myself during their school excursion to Snow City and the family carnival whereby the teacher initiated the students to become the host for the game and giving their instruction to respective family of their classmate to play the game. They have been practicing the script for quite some time in school. It is really a meaningful event whereby parents can join in and bond with the children at the same time. Besides, this is the only school which provide handmade card for the kids to bring back home.\n\nI wish everyone in My First Skool Sumang Link to be healthy and best wishes for the new schooling year 2025.\n\nThank you for all the efforts and patience guiding my eldest son.\n\nBest Regards,\nXue Ling",
      "time": 1736410273,
      "translated": false
    },
    {
      "author_name": "tony teng",
      "author_url": "https://www.google.com/maps/contrib/108809007508362624029/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX1rAtDOsgFF7g_WqywZ9niMzyAZYYOs1nL70sCggbyP9048ps8=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Cooking auntie May auntie Sue\nMs Wani 黄老师 Ms Lee 李老师 孙老师 and principal Joey all very close to both my daughter and son at the pass few years now they both going to primary school\nReally a great help for their growing up\nThank you all of you",
      "time": 1735648107,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16874626087026651491",
  "user_ratings_total": 8,
  "vicinity": "312C Sumang Link, #01-163"
}