{
  "formatted_address": "Edgedale Plains, #01-739 Blk 682B, Singapore 822682",
  "geometry": {
    "location": {
      "lat": 1.403503,
      "lng": 103.9157073
    },
    "viewport": {
      "northeast": {
        "lat": 1.404715630291502,
        "lng": 103.9173439302915
      },
      "southwest": {
        "lat": 1.402017669708498,
        "lng": 103.9146459697085
      }
    }
  },
  "name": "My First Skool at Blk 682B Edgedale Plains",
  "place_id": "ChIJe3Awams_2jERcAitaGWjlXs",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Aminur Rashid",
      "author_url": "https://www.google.com/maps/contrib/117984860042151620901/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKoOx7RFLDdJ6FoCoD6owESNISIVhCOAv3EyROQWe1GMGKjUA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "My experience with My First Skool at 682B Edgedale Plains has been nothing short of exceptional. All three of my children have graduated from this school, and I am incredibly grateful for the strong foundation it has provided them. Today, they are excelling academically and socially in primary school, a testament to the values and skills they developed during their early years here.\n\nThe school has instilled important values that continue to shape their character. They have grown into confident individuals who are not only vocal and expressive but also empathetic and kind to those in need. These qualities have helped them flourish beyond early childhood, allowing them to navigate their growing years with resilience and compassion.\n\nA huge thank you to the dedicated and commendable staffs, whose patience, guidance, and nurturing approach played a significant role in my children’s development.\n\nAdditionally, the school maintains a well-kept and hygienic space where children feel secure. Even the meals provided left a lasting impression—my children still fondly remember the healthy and delicious food they enjoyed there!\n\nI highly recommend My First Skool at 682B Edgedale Plains to any parent looking for a strong, supportive preschool environment that not only prepares children academically but also helps them grow into kind, confident individuals.",
      "time": 1739608875,
      "translated": false
    },
    {
      "author_name": "janness lin",
      "author_url": "https://www.google.com/maps/contrib/101586842078824121301/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ-3qtu1MQleLgLj0R-fcoGJLllh0aIJALCtYgPJ3cZZTRIFw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Our daughter loves attending My First Skool at Blk 682B Edgedale Plains! The teachers and principal are friendly, caring, and supportive. They organize plenty of fun activities and field trips, which our daughter really enjoys. There are also various enrichment classes to choose from, which is a relief for working parents who can’t send their kids to attend enrichment classes during weekdays. Overall, it’s a happy and engaging place for our child’s growth.",
      "time": 1740100450,
      "translated": false
    },
    {
      "author_name": "Kathleen Palaganas",
      "author_url": "https://www.google.com/maps/contrib/110921127393259142738/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK4yVXs4DTl-6ucFdEpUi2WG8rCSAI9LsHYyTI1m0EvHT6JYA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I commend My First Skool at 682B Edgedale Plains for the exceptional care provided to their students.  As a working mother, I have peace of mind knowing my children are in the capable hands of their wonderful teachers, school staff, and proactive principal and assistant principal.  Their collaborative approach ensures the children's well-being and addresses parental concerns effectively.  They have done an amazing job with my eldest child, and now, in Primary 1, they are effectively fostering independence, respect, and loving behavior in their students.  Their curriculum and teaching methods are efficient and effective.  Parents receive timely updates on their children's well-being and activities. The teachers and staff deserve significant commendation for their outstanding work. They made a significant effort to create a meaningful and wonderful graduation celebration (K2 Class 2024) for my eldest daughter last year. It was truly emotional and  enjoyable. To the new Parents, let My First skool, to be your first choice 😉👏💞",
      "time": 1739511997,
      "translated": false
    },
    {
      "author_name": "Monica Goh",
      "author_url": "https://www.google.com/maps/contrib/109289991449735221083/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWpL0FUXPF-QXvwkg8rm7-an43WYoyXLBDHb4EhcXLQqj0fUVAp=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "My two children are both with MFS at Blk 682B Edgedale Plains and have been attending school here for 3-4 years now. They've been with the school since nursery one and have thrived year on year there.\n\nThings we love about this MFS:\n\n1. A very involved and approachable principal.\nMy eldest was flagged with slow speech and developmental delay and from the get-go, even before we enrolled to the school, the principal Ms Vivian was helpful, honest, supportive, and highly engaged every step of the way. She also took the time to work with parents who are keen to better support their children's learning journey. Last year, I worked closely with her on my children's weaknesses. She spent time analysing the areas each of my children are lacking in and gave me tips and taught me how to work with them at home to improve these areas, even providing tools to do so.\n\n2. Good and patient teachers\nThe teachers there are able to strike a good balance of strictness and discipline with fun learning opportunities. We can clearly see the teachers' passion to educate and engage with their students. Despite their busy schedules, they are still patient and willing to go the extra mile to address our concerns and what each child needs.\nExamples:\n- Toilet training was challenging with my eldest, but with Wu lao shi and Hsieh lao shi's help, he was able to do so eventually. They also helped us by giving us advice on how to work on that at home as well.\n- My eldest also has a sensory issue and is a picky eater so meals were challenging. In the first year, he only drank water and refused to eat anything at school. The teachers patiently worked hand in hand with us at home and at school to improve his eating habits and he now eats his school meals (even veggies which I am still am unable to achieve at home) and does so in a timely manner.\n- Daily, Teacher Susan would have individual sessions with the children on their weak areas.\n\n3. The school provides many opportunities to learn beyond the classroom\n- The school organises field trips that my children really enjoy. From trips to the museum, outings to the nearby grocery shop, goat farm and on an LRT ride around the neighbourhood.\n- We get easy access to after school enrichment classes with options related to sports, Chinese and English speech and drama, keyboard lessons, abacas and coding.\n- The school encourages parent-child engagement through home projects and events during special dates like mooncake festival etc. They even rented a bouncy castle and set up a fun fair carnival for children's day last year.\n\nThe principal and her teachers have been instrumental in helping my children thrive and learn key life skills. We also appreciate that the principal and the teachers have experience working with children like my eldest with speech and developmental delays. They also work with other special needs children as well, so their patience and knowledge is very helpful.\n\nIn summary, we highly recommend the school to parents looking for a school for their child.",
      "time": 1739758321,
      "translated": false
    },
    {
      "author_name": "B",
      "author_url": "https://www.google.com/maps/contrib/104241396643151236640/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUO83aNItUnzqFDIQ_0KzPHv_KWJYDR5iol4QqEl3aGrlC6HYA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "We had a wonderful experience at My First Skool at Blk 682B Edgedale Plains, where our daughter Hayley Lim attended for about 1year. The school provides a nurturing and safe environment that allowed Hayley to thrive academically and socially.\n\nA special mention goes to the principal, Ms. Vivian, whose leadership and dedication have made a significant impact. She was always approachable, supportive, and proactive in addressing any concerns we had, making the transition into school life smooth for both Hayley and us as parents.\n\nThe teachers and staff are equally commendable, displaying a genuine passion for teaching and care for the children. Hayley always came home excited to share her day and the fun learning activities she participated in.\n\nWe are deeply grateful for the positive influence the school has had on Hayley’s growth and development, and we highly recommend My First Skool at Blk 682B Edgedale Plains to any parents looking for a caring and enriching preschool environment.",
      "time": 1737513374,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8905203494138218608",
  "user_ratings_total": 10,
  "vicinity": "Edgedale Plains, #01-739 Blk 682B"
}