{
  "formatted_address": "38 Jln Eunos, Singapore 419500",
  "geometry": {
    "location": {
      "lat": 1.3207005,
      "lng": 103.9053991
    },
    "viewport": {
      "northeast": {
        "lat": 1.322036880291502,
        "lng": 103.9068689302915
      },
      "southwest": {
        "lat": 1.319338919708498,
        "lng": 103.9041709697085
      }
    }
  },
  "name": "My Little Gems Preschool",
  "place_id": "ChIJc6E7jAQY2jERtbtb9I209y0",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Mercy Goh",
      "author_url": "https://www.google.com/maps/contrib/104895561247455324138/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJV1vszhqGLrShkLvsH5imPSkG8c8rrzdKzudvGCl7zQipEgAg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "My nephew graduated from My Little Gems, and his parents highly recommended this preschool!\n\nPrior to enrolling our son into PG class commencing June 2024 (18 month-old), he was extremely fearful of strangers, had anxiety issues even with distant family members whom he doesn’t meet very often. We had our concerns that he might struggle in school emotionally.\n\nWe were pleasantly surprised that he was doing so well in school since day 1, thanks to the support from teachers - Teacher Min, Huang Laoshi and Shi Nuo who established a welcoming and nurturing environment for our child.\n\nFast forward 6 months later, our son has never resisted going to school, he has gained independence, motor skills and improved social interactions with strangers. Inculcating moral values alongside knowledge through education has reflected in our son’s character today.\n\nTo summarize our positive experience with the school, we’re always receiving constant updates from his caring teachers, organizing enrichment classes in school such as gym classes helped to boost his confidence and motor skills, planning outdoor field trips & visits to old folks homes for exposure and learning, and lastly.. our son was dancing confidently on stage during his year end concert!\n\nIf you are a parent like myself, hesitating to enrol your child to school early, I would highly recommend My Little Gems!",
      "time": 1733887178,
      "translated": false
    },
    {
      "author_name": "Cindy Teo",
      "author_url": "https://www.google.com/maps/contrib/111753692454087926411/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJwnlcU1QmUG8NKHUqo1gkl8tArMrWy7uOxKLJJDsB61f35mg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "When I first discovered My Little Gems School, I was drawn to their curriculum and emphasis on mindfulness. The school offers a holistic education that focuses on the well-being of each child.\n\nMy older daughter transitioned to My Little Gems School mid-way from another school, and I witnessed her transformation in every aspect. At the recent graduation concert, the school revealed a new side of her. She has become more independent and responsible.\n\nMy Little Gems School is truly a hidden gem in the neighborhood. In addition to the standard curriculum, the school enriches children's learning by exposing them to diverse cultures through excursions and guest speakers.\n\nThe teachers at the school are all dedicated and supportive. I am impressed by how well they collaborate and how they know each student, regardless of the class they teach.\n\nI also want to take this opportunity to thank Teacher Joyce and 张老师 for shaping my daughter's character and guiding her to be ready for Primary One.\n\nAdditionally, I have also enrolled my younger daughter at My Little Gems School. She is not always the easiest to manage, but Teacher Min and 黄老师 have been incredibly patient with her. At first, she would cry every time we left for school, but now she is excited to go, even asking to go on days when she is not feeling well. It is amazing how much she has changed.\n\nI am very thankful for what My Little Gems School has brought to our family. A big thank you to Principal Ben and the teachers for creating such a wonderful place for our children. The teachers here are a true blessing, and I am looking forward to continuing our journey with them as my younger daughter progresses to N1.",
      "time": 1733755756,
      "translated": false
    },
    {
      "author_name": "Yuan Yu",
      "author_url": "https://www.google.com/maps/contrib/111274097453361850782/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKYMKtEK4VK_4c27YbKDFWQMqs29OQPh9-rZhCr2hsPCmJnQGVf=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I will strongly recommend My Little Gems preschool. Teachers are truly dedicated to kids’ growth. I admire Principal Ben’s education concept, which is to treat kids with respect and true love. I am very grateful that my son joined this school. His teachers not only take good care of kids but also teach them how to be a good person. 2024 year end concert was amazing. Teachers must have put into a lot of efforts to prepare this big event. My kids involved in the event happily though it means that he had to get to school a bit early in the morning and stay a bit late after school for a whole month. Thanks teachers very much for your loving heart and hard work ❤️",
      "time": 1733575680,
      "translated": false
    },
    {
      "author_name": "Leng Shuh Pei",
      "author_url": "https://www.google.com/maps/contrib/111233118155140744474/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIs8ZOg6WV_Udqc74Z_QZ3hgcTkVYSZC2LwZAaErDW-tnKzXg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Great place to have your children learning  to have good value and great childhood experience.  Lately we had our year end concert, it was marvelous and was surprise to see how the children had grown up so much and able to dance and participate the concert in an astonishing way. We would like to thank all the teachers and staff for the hard work and effort in grooming them. Love and peace to you.",
      "time": 1702029260,
      "translated": false
    },
    {
      "author_name": "Anthony Ong",
      "author_url": "https://www.google.com/maps/contrib/105152586362049608890/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIArrx3OlgQNF44_FiWMtwiftP0ZJPYaerLvobeNq3s2YwOuA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Both my 2 boys attended my little Gem Preschool. Teachers are patient, kind and great and the education curriculum well planned around instilling our young the right values in life. Looking back, never regretted the decision to bring my sons to My little gem Preschool. Wonderful experience overall !",
      "time": 1733555944,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3312314572737330101",
  "user_ratings_total": 69,
  "vicinity": "38 Jalan Eunos"
}