{
  "formatted_address": "1 W Coast Dr, #01-05 NEWest, Singapore 128020",
  "geometry": {
    "location": {
      "lat": 1.3160037,
      "lng": 103.7574628
    },
    "viewport": {
      "northeast": {
        "lat": 1.317291680291502,
        "lng": 103.7587941302915
      },
      "southwest": {
        "lat": 1.314593719708498,
        "lng": 103.7560961697085
      }
    }
  },
  "name": "My Little Kingdom at West Coast",
  "place_id": "ChIJVeTPet8b2jER9W0do2MhmM8",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Jennifer Lam",
      "author_url": "https://www.google.com/maps/contrib/116346604476732019416/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKvNjJmgPgHT06UQDMB8AVgOf2s46TZcMkTlibUhRNayMsoSQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "We did a lot of research before deciding to put our child in My Little Kingdom. Of all the preschools we visited, the warmth and friendliness of the Principal and teachers from My Little Kingdom stood out. We felt assured when the classroom teachers were willing to meet up with us and my child, who has special needs, prior to our confirmation. My child used to have separation anxiety and would cling onto me if she does not feel safe. However, from day one, she walked into the preschool happily and continues to enjoy school a lot each day. My husband and I got to know her teachers better over the past few months and we are now very impressed with the culture of care for children that we find in My Little Kingdom. My child's teachers, Ms Esther Li and Teacher Ivy,  are incredibly caring and loving. As a result of the nurturing environment, my child has grown in her motivation to learn new skills and also grown in her confidence interacting with her peers. Thank you, My Little Kingdom, for being such a wonderful preschool for my child!",
      "time": 1730088993,
      "translated": false
    },
    {
      "author_name": "Karthik R",
      "author_url": "https://www.google.com/maps/contrib/108424902625766852151/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL8Q0IMIoUjWXEp5IJXWnUk-YDahOhFwpbjSQ1sRtQ-l0IEYL4=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "We stumbled upon MLK when we first moved to West Coast and that has been the best decision for our kids learning journey.\nFrom toddler playgroup to K2, it was an incredible journey for our kids. Every teacher in MLK has been nothing short of wonder! Our kids loved going to school every day these past 3+ years - Lovely staff, kids, Aunty Jenny's food and incredible Principal who leads them all. MLK will be missed and as parents we sometimes wish - we had our such an early schooling :)\nWould gladly recommend MLK any day and Good luck to the great team!",
      "time": 1736606478,
      "translated": false
    },
    {
      "author_name": "Galina Bushueva",
      "author_url": "https://www.google.com/maps/contrib/101551417573250456569/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJcUwSe_vbTRk-8GD8iCbA_s7w7H-93Y5PtYngQVA2VrgY_SA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "We just love My Little Kingdom❤️❤️❤️\nI'm delighted to share my positive review of My Little Kingdom Preschool. The teachers at this school are not only good but also incredibly kind and nurturing. They create a warm and welcoming environment where children thrive. The curriculum is designed to make learning fun, with a wide range of activities that keep the kids engaged and excited about education. Field trips 🌿🌿🌿are a fantastic addition, making the learning experience even more enjoyable and interesting. My child has truly blossomed at My Little Kingdom, and I couldn't be happier with our choice. It's a wonderful place for children to grow and learn. Every morning she is happy to go to school, she asks to go earlier❤️❤️❤️so that she can spend more time at school.",
      "time": 1698067842,
      "translated": false
    },
    {
      "author_name": "Elifcan Dursun",
      "author_url": "https://www.google.com/maps/contrib/110934086180157458721/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJnv6acZMlFl782rotknE54H6SMjht8I8BtQOvlF1FTkweT5Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "We started looking for a school for our 19 month old son as of last year. We visited many schools and decided on MLK. Now, I realize how correct our decision was. My son had severe separation anxiety, and to be honest, I thought he would have trouble adapting to school. But his adaptation happened much faster than I expected, and although it’s only been two weeks, he wants to go to school in the mornings. The loving and attentive teachers have played a huge role in this. Especially Teacher Anthea was incredibly helpful in my son developing a bond with the school and easing his separation anxiety. Moreover, unlike the other schools we visited, the quick responses to our questions and their proactive approach really earned my appreciation. I would like to thank admin manager Rachel and incredibly caring Principal Yvonne for this. I hope our journey at MLK continues like this. So far, I definitely recommend MLK to parents living around the West Coast.",
      "time": 1727142987,
      "translated": false
    },
    {
      "author_name": "Juan Bernardo “J3” Patiño",
      "author_url": "https://www.google.com/maps/contrib/115689417105172004706/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSO3RxVQs-vKWRgO7IBkBOHKTTtH0zfSMiCWb56pbJDtAjb5T4Vg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "We're so happy that we found My Little Kingdom (MLK)! Overall as parents, we're so grateful for the teachers and staff for being so kind and nurturing. You can really feel the love the teachers feel towards their students. I couldn't really ask for more.\n\nOur daughter entered when she was about 3 years old, and now she's graduating from MLK to Primary. We're just so happy with her development from being shy to now being a lot more outgoing! When she comes home from school we're always delighted to see the little activities and crafts that they're doing. She's also made lots of friends there where they go on playdates even on weekends. I'm really happy we decided to go with MLK for our daughters preschool.\n\nKudos to Ms. Yvonne, the principal because she's definitely bringing in the right teachers who truly love the students even if they're having a bad day, or entering school in a not so good mood. Our little one is a bit sensitive, so there are times when she goes to school crying, but whenever we \"peek\" inside with what they're doing she's just so happy at school! Plus, from talking with other parents, the teachers really see the gifts of each child and nurtures them.\n\nIf MLK had a primary school, we'd definitely still continue to send our kids here too!",
      "time": 1701824712,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14958742874133196277",
  "user_ratings_total": 15,
  "vicinity": "1 West Coast Drive, #01-05 NEWest"
}