{
  "formatted_address": "60 Springside Walk, #01-07 The Brooks I, Singapore 786020",
  "geometry": {
    "location": {
      "lat": 1.4047893,
      "lng": 103.8195092
    },
    "viewport": {
      "northeast": {
        "lat": 1.406198880291502,
        "lng": 103.8210006302915
      },
      "southwest": {
        "lat": 1.403500919708498,
        "lng": 103.8183026697085
      }
    }
  },
  "name": "MyPizza",
  "place_id": "ChIJ0V6Dh20Y2jERXGRohtBmyPs",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "CW T",
      "author_url": "https://www.google.com/maps/contrib/110213850832346635768/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXdJMHGEWd_NicJMM8gX6YQyAKkO4uw8Lb5XHNUm6uT85BBmZKWrA=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "The pizzas we ordered were delicious - the crusts were light and were just the right amount of doughy and crispy. We had the recommended Spinach Special which we understand had won international awards. The chef was proud of this achievment and rightly so. The Spinach Special pizza tasted great and ranks as one of the most unique ones that I've ever had. The sides were also good. The chicken wings tasted fresh, not the frozen kind.\n\nThe star of the place though is the chef owner. Really friendly guy who chatted with us to make sure that the food he served was up to expectations.\n\nThe only room for improvement, if I may, would be if they could clear the tables as soon as their customers finished and left. When we were dining, three tables with  dirty plates and leftovers were left  uncleared the entire time we were there.  That would have made the environment  a lot more pleasant. Also, the volume of music playing in the background could be a tad lower. Not dissing, just some constructive suggestions.\n\nThe next time we want pizza, this place would be one of those at the top of our list. Also, I hope that when we next meet, the football club he supports will be in a better position in the league table than it currently is.",
      "time": 1745135796,
      "translated": false
    },
    {
      "author_name": "Zahra Azahari",
      "author_url": "https://www.google.com/maps/contrib/104979596654604258785/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWBqYHxgRIWHoEzvcNCSGBoXy2KLirIZqo_GZXuKv90VdJr7g6T=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Everything was absolutely delicious. We came all the way from the East and it was worth it. You can taste the quality of the ingredients. Even had a great chat with the owner who is super friendly and really cares about his food and customers.\n\nWe tried the Boston pizza and the BBQ chicken wings. Ended up buying the spicy chicken pizza to take home.",
      "time": 1745049093,
      "translated": false
    },
    {
      "author_name": "Aimi Ashikin",
      "author_url": "https://www.google.com/maps/contrib/107519103008004532736/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU5IS8wlEPXEnxRpYo00KVq2MI5FCDPS3o5du7KRlfBPUP7hvA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Delicious artisanal pizza at a great price!\n\nWe ordered New York, Cheese, Garlic Salmon and Pepperoni pizzas for dinner and every single one of them tasted amazing and had plentiful toppings! Even though we brought the pizzas home, it remained flavourful and the crusts remained crispy on the outside but soft one the inside.\n\nWe also had the BBQ chicken and it was extremely tender and well marinated. Would definitely recommend getting this as part of the meal!\n\nThe owner is very friendly too! Made the whole experience and atmosphere inviting, like a warm welcome into someone’s home.\n\nDefinitely worth travelling to have the pizza here!",
      "time": 1746190408,
      "translated": false
    },
    {
      "author_name": "Alex Tan",
      "author_url": "https://www.google.com/maps/contrib/102590134141603794962/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ1OIWd_114zxmyNmJt3LRZ253_L19PenZNfZHR1PZ_qjMzmA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "I’ve tasted pizza around the world, this pizza indeed is one of my top favorite. Magic is in the dough they use, not too dry not too soft, not exactly crispy but you are able to taste the fragrance of the dough. I think is because they always make it fresh for their customers.\n\nI frequently bring my family there for pizza, my kids love it. Always finish what we’ve ordered without fail.\n\nIm sorry for the finished food pic, I just love my pizza hot.",
      "time": 1745234158,
      "translated": false
    },
    {
      "author_name": "yammy l",
      "author_url": "https://www.google.com/maps/contrib/111479134907015329324/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKCEOqyHwo4GuK5D8BPHh8h_vjlO2SGvzdsDcsuQ8a9ocFAQpc=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "great pizza place near my house. it's completely fresh and made to order. I've NEVER enjoyed eating pizza crust until I ate theirs lol!!! I would say it's a bit more than what u would usually pay for pizza, but to me I feel that u pay for what u get. in this case it's the quality of the pizza dough, ingredients freshness and overall taste. my sister and I patronised this shop multiple times already. we are happy customers!\n\nshown in pic: spinach pizza and garlic butter salmon pizza. my go-to order!",
      "time": 1744265277,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=18142864144656262236",
  "user_ratings_total": 815,
  "vicinity": "60 Springside Walk, #01-07 The Brooks I, Singapore"
}