{
  "formatted_address": "17 Petir Rd, #B2-26/27 Hillion Mall, Singapore 678278",
  "geometry": {
    "location": {
      "lat": 1.3785742,
      "lng": 103.7628663
    },
    "viewport": {
      "northeast": {
        "lat": 1.379960430291502,
        "lng": 103.7642101802915
      },
      "southwest": {
        "lat": 1.377262469708498,
        "lng": 103.7615122197085
      }
    }
  },
  "name": "Nan Yang Dao (Hillion)",
  "place_id": "ChIJq2NYc6wR2jER8CAyxP2TiUo",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Jimmy Chew",
      "author_url": "https://www.google.com/maps/contrib/103599033305840908098/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUCcv8D1LG0riK_L-pNY5OOhD4MGESHc0uvo1ll9GwaKNe8C_gL=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "For a time being, I strongly suggest to give this place a miss for now. We sat down at 8:12pm and ordered fried kway teow, Malay mee goreng and lemon chicken chop rice. Simple dishes. We got the fried kway teow and mee goreng in about 10mins.  The prawns for the fried kway teow were not fresh and tasted powdery.\n\nWe had to wait until almost 8:45pm before getting the chicken chop rice. Other tables that came later have their orders delivered. I had to remind the service staff twice that our order is very much delayed.\n\nI peeped through the serving counter and saw the lemon chicken chop rice left on the kitchen table unfinished.  I have to say the quality and presentation of their lemon chicken chop rice is not what one would have expected. The chicken chop doesn’t look like one, more like a mess of fried flour batter with pieces and bits of chicken inside. Very unappealing and not appetizing at all. Taste is suspect and not like the lemon chicken that one would get from a normal zhi char stall. Only saving grace was the sunny side up egg!\n\nStrongly recommend not to order this dish or any dish that’s related to chicken chop. Maybe their fried chicken, but that too looks dry and tough, doesn’t look like freshly fried.\n\nJust giving this place a miss for now. Sadly the quality of their dishes were better in the earlier months when the opened.",
      "time": 1747055185,
      "translated": false
    },
    {
      "author_name": "carol liem",
      "author_url": "https://www.google.com/maps/contrib/103700477221165577307/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVz92aj3kZ27nDyY7Mw_5-wpehrgGiKR51KDdROHsFb8mCAyUz7=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "5 months ago",
      "text": "The place is crowded and tiny. The servers and cashier are rude and unfriendly. There is only QR code on the table. When I asked for the menu, they unwillingly gave it to me and asked me to order immediately without giving me time to read through the menu. The queue system is illogical. The dine in customers have to queue with takeaway customers.\nThe only saving grace is that the food is good! The Chendol is delicious but they serve dessert as the first dish. The nasi\nlemak with curry chicken taste authentic and fresh. The lala bee hoon is delicious and generous in serving. They even added Chinese wine to the dish. The fried rice with salted egg pork chop was delicious and generous in serving too!\nSo, it’s a place to come to eat for the nice food but I will recommend to send all the serving staffs for training. Only, 1 staff who was clearing the dishes was polite. I think a good eatery need to make customers feel comfortable and happy eating at their eatery.",
      "time": 1734634526,
      "translated": false
    },
    {
      "author_name": "Daniel Wong",
      "author_url": "https://www.google.com/maps/contrib/115145949078497107987/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLZC2vWmWAZMQwC-xT7LcQSx49f-di0SYE94vcS44Xnu6Lo5Q=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "This restaurant offers an amazing variety of Malaysian dishes. The Nasi Lemak Ayam Berempah was great and is a must order here. The rice was full of coconut flavour and the chicken was well marinated and the meat was perfectly cooked and moist.\nUnfortunately the noodle dishes I tried were not as good as I wanted to give this value for money restaurant 5 stars.\nThe Char Kuey Teow had wok hei and lots of crunchy taugeh, unfortunately it was not as flavourful as my favourite Penang CKT in SG.\nThe signature trio mini noodles looked very Instagramable but it was difficult to eat as the bowls were so tiny. Also they used the yellow noodles for all 3 bowls which was had a strong alkaline taste which even affected the taste of the soup. Anyway of the 3, I would say only the curry noodles is good.\nWill be back to try their other dishes.",
      "time": 1742857091,
      "translated": false
    },
    {
      "author_name": "David Goh",
      "author_url": "https://www.google.com/maps/contrib/107379959606856336842/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW_vFtKm18Pa8JONurWR49WHTsQphGDOAt6dgEDXhxue31IwAKz=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "3 weeks ago",
      "text": "Small table which couldn't accommodate the ordered food. Food is ok but don't order the tea. It is a rip-off. See illustrated photo of the menu photo and actual tea of 8 treasure tea. Taste is terribly bland. All in all, it isn't worth the price paid.",
      "time": 1745854776,
      "translated": false
    },
    {
      "author_name": "Yong Hui",
      "author_url": "https://www.google.com/maps/contrib/111569262981447172168/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIHN3T5jDnWiNC8q2KdM6f3WISxluLQC7nXrjlzaNs_xq4qhT4=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "It's always crowded, need to wait.\n\nService was fine.\n\nThe drinks Milo dinosaur is a disaster. Paid $5 + tax  for ice. The actual milo is pathetically little. Better to bring your own Milo also better than this, load with full cup of ices\n\nRemember to mention less less ice for your drinks",
      "time": 1738843922,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5370986748743655664",
  "user_ratings_total": 1489,
  "vicinity": "17 Petir Road, #B2-26/27 Hillion Mall"
}