{
  "formatted_address": "Singapore, 号205号heartland mall #01-08, SG Hougang Street 21, blk 205号 邮政编码: 530205",
  "geometry": {
    "location": {
      "lat": 1.359469,
      "lng": 103.8851289
    },
    "viewport": {
      "northeast": {
        "lat": 1.360680180291502,
        "lng": 103.8865321302915
      },
      "southwest": {
        "lat": 1.357982219708498,
        "lng": 103.8838341697085
      }
    }
  },
  "name": "Nan Yang Dao (Heartland Mall Kovan)",
  "place_id": "ChIJtd1Lhm8X2jERUvJVbNBADZU",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Shalini Subramaniapillai",
      "author_url": "https://www.google.com/maps/contrib/115407276577492817561/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVSRdy29VRo_M_GQwjTfp8bfVe6aOweSnvvez0mVYHg1JHKFiQ-gQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Food was good and the service was very good.\nWe ordered Nasi Lemak Ayam Goreng Berempah, Penang Fried Keat Teow, Lemon Chciken Chops with fries, Iced Coconut coffee and lastly Ice Kacang.\n\nNasi Lemak and the Kway Teow was sooo good.\nThe chicken chops was great disappointment (we just left it untouched) - it was like they poured the lemon syrup on top of ur fries n chicken, we couldn’t eat at all.\nThe quantity of each dish was enough for an individual and the price was reasonably okay.\n\nThe coconut coffee and ice kachang was ok ok.\n\nDining in for the local cuisine and signature dishes is recommended.",
      "time": 1740303951,
      "translated": false
    },
    {
      "author_name": "Fairy",
      "author_url": "https://www.google.com/maps/contrib/110707374703256523409/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLEi0dDZkdHrz1a50eJxXpfzmlQC5Ivayi_y2PRepQS58WfQ0GJ=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "The polo bun was delicious, with a crisp, golden crust and a soft, slightly chewy interior. It tasted freshly baked.\n\nThe clam beehoon was also very tasty, with a generous portion of clams and a flavourful soup.\n\nThe teh was strong.\n\nAlthough the restaurant was packed and bustling, the service remained attentive. The waitress who attended to us was responsive and very polite.",
      "time": 1744995093,
      "translated": false
    },
    {
      "author_name": "Ming",
      "author_url": "https://www.google.com/maps/contrib/109226628464118431877/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVWHRYf7Zu9EWPn3SlPV5wUb8cACsHb2FsYqoWRxGnfZhw887rc=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "Ordered delivery on foodpanda. Food came in 30mins. CKT was okay, wok hey not strong enough, could use more soy sauce as the dish was rather bland. Ingredients pretty good with lap cheong, taugeh, 2 big prawns, fishcakes, pork lard, etc. Nasi lemak was the better dish. 3 pcs of tender fried chicken with achar, peanuts, ikan bilis, fried egg and sambal. Sambal not spicy enough. Rice was quite lumpy and not fragrant enough.",
      "time": 1746945510,
      "translated": false
    },
    {
      "author_name": "SZ Lim",
      "author_url": "https://www.google.com/maps/contrib/114108831723577323443/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIACEKucLGfg0Gi6Py-eUqV4jnqbmvAVx8zKN66BIIiv7h9Rg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 2,
      "relative_time_description": "4 months ago",
      "text": "We visited them on new year's day. They were slightly short staffed, but service was good, hence the 5 stars. The uncle is the boss I think and he was very courteous with every customer even if it was a busy morning. Customers would have to rush in but he and another lady staff would maintain order at the restaurant.\n\nThe atmosphere was also nice, with no rushing of customers and clean tables.\n\nAside from the service and atmosphere, things were not that good tho. Their online system had items and promos which were manually removed after ordered. We ordered the food + drinks promo and was told to reorder separately as it's a public holiday. Was surprised cause:\n1) they should have allocated their system properly so I could decide when ordering.\n2) couldn't they have helped to cancel and replace the order, instead of us having to reorder after they cancel?\n\nFood was served slow and we realized they missed out our order. I believed its an isolated incident and it didn't affect our mood.\n\nFood was to be truthful not the best. We had the nasi Lemak Ayam berempah, Penang prawn noodles, and penang char kuey teow. The Ayam berempah was not bad, which would get 4/5, they gave too little sambal, and wanted to charge 50cents for more sambal.\n\nThe prawn noodles were more like Singapore prawn noodles than penang prawn noodles, and even so it was definitely below average Singapore prawn noodles. Also, the fact that they don't allow mixing of noodles + beehoon just emphasizes even more than it is not authentic penang prawn noodles. Also, there was no chilli paste that usually comes with the prawn noodles. Overall, if I could rate 0 for this, I would.\n\nTheir char kuey teow had the wok hei, and barely passes off as penang char kuey teow. I hail from penang and am qualified to claim that it's a below average plate of penang ckt. There were no cockles, and flavor wise was less flavorful even as compared to your typical Malaysia Boleh or Penang culture found in Singapore. For this plate of ckt, I would rate it 1.5/5.\n\nTheir drinks on the other hand are well done. I tried the kopi c less sweet and yuan yang C less sweet, both were very very good. Gao, with just the right amount of sweetness. The foam from the drinks just made it so much better. Their prices for the drinks are fully justified.\n\nOverall, food wise is below average and if I come back, it won't be for the \"penang food\". I wouldn't mind trying out their mee Siam curry chicken which I saw many people order.\n\nAnother small issue was the fact that we ordered chendol but due to shortage of manpower they were not able to churn it out. He forgot to remove it from the bill and I also forgot to point it out until after I had paid. The item was 3.50 but he returned me 4 dollars. By right he was supposed to return me 4.20 due to service charge and gst, but I did not sound it out as I was busy with my kid. I don't think he meant to shortchange me just that maybe he could be more mindful about these in the future.",
      "time": 1735705136,
      "translated": false
    },
    {
      "author_name": "Jasvan Chin",
      "author_url": "https://www.google.com/maps/contrib/106398283908714174143/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVzEr-gQSt4bbtXmBng3GqOQORALs6K--B2R7eE2cfrnu7-600L=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "The service was great on the day that I visited. Especially the store’s supervisor (I assumed) who operating the cashier counter, Her/ His patient toward the customers and politeness to everyone included the staff was phenomenal despite it was peak period of the restaurant and queues were forming up for take out/ dine in etc. Unfortunately that am not be able to find out her/ his name on the spot, and the receipt not printed with the cashier name on it. If the owner/ store manager could check this out would be good, from the surveillance on the receipt timing/ date. She made people’ day no doubt. Thanks for that!",
      "time": 1741930391,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10740311950263448146",
  "user_ratings_total": 1024,
  "vicinity": "SG Hougang Street 21, blk 205号, 205 号, #01-08 heartland mall, Singapore"
}