{
  "formatted_address": "200 Victoria St, #01-85/86/87 Bugis Junction, Singapore 188021",
  "geometry": {
    "location": {
      "lat": 1.2989104,
      "lng": 103.8547656
    },
    "viewport": {
      "northeast": {
        "lat": 1.300254480291502,
        "lng": 103.8566725302915
      },
      "southwest": {
        "lat": 1.297556519708498,
        "lng": 103.8539745697085
      }
    }
  },
  "name": "Nando's Bugis Junction",
  "place_id": "ChIJxZ2RNaUZ2jERMo68GmZP218",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "kelana 2",
      "author_url": "https://www.google.com/maps/contrib/108431673254955237866/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKY_sij0K3AciUwDDQq25KTAhfaSOycWQ96zsTOGHB9Unm9hA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Apr 25\nLunch 3 of us\n\nFirst time eating at this branch.\n\nLayout and ambience ok. Cleanliness good. It s work day so not too crowded.\n\nService attentive and prompt. Though all orders using apps but they still help with questions.\n\nFoods and drinks:\n- the galao is nice especially if you are looking for something non sugar.\n- the new menu honey thigh chicken bowl also very nice. Adequate portion with good sides add ons\n- sweet potato fries just too yummy cant stop once you start\n\nOverall it is very nice and a good option if you are hungry at bugis junction mall.",
      "time": 1745999221,
      "translated": false
    },
    {
      "author_name": "Teck Chong Law",
      "author_url": "https://www.google.com/maps/contrib/103886416957126587915/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV4T4j8ZZDc1RnbLe8accMbK-Vvmsgg-4gAYNyTuoMrehclwbHXEg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "5 months ago",
      "text": "The three of us had the two piece thigh and the meal for two.  The chicken and all the sides taste good.  The meal for two comes with two free flow drinks.  So we need to pay extra for another drink.\n\nThe staff were friendly and provided pretty fast service.",
      "time": 1732797152,
      "translated": false
    },
    {
      "author_name": "Elijah Tay",
      "author_url": "https://www.google.com/maps/contrib/105182314357710115010/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUj103XORl5476EkHxosdtaoewrQTmjkOvFnpiub4RSK1Uj9LEg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "It's very delicious, though slightly pricey (speaking as a student). I enjoyed the sweet potato fries a lot (not pictured). It's a nice place to share a meal with friends and/or family!",
      "time": 1742571277,
      "translated": false
    },
    {
      "author_name": "Tiffany Avi",
      "author_url": "https://www.google.com/maps/contrib/114416877603095628031/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVeUABtJFeiRtPR7NdbkOO_jJHqaGrMGsRVUS91WGM_N1XijaojBA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "4 weeks ago",
      "text": "Nando's Bugis Junction – Where Chickens Go on a Diet Before Serving\n\nWe went to Nando’s at Bugis Junction with stomachs rumbling and expectations high, hoping for a hearty, soul-warming meal. After all, when you’re forking out $16.30 for boneless chicken thighs, you’d expect at least, well… a decent amount of chicken. Right?\n\nWhat arrived at the table looked like something you’d find hiding behind the lettuce in a sad school lunchbox. The so-called \"chicken thighs\" could’ve passed for chicken thoughts—small, fleeting, and barely there. Blink and you might miss them. Or maybe that was the point: a culinary magic trick. Now you see it, now you're still hungry.\n\nLet’s be clear. For $16.30, I wasn’t expecting a whole farmyard experience, but I also wasn’t expecting appetizers for ants. Honestly, I’ve had more meat fall off a KFC drumstick I dropped on the floor.\n\nThe photos speak for themselves, but just to paint the picture: imagine paying steakhouse prices and receiving a snack-sized portion that would leave even a toddler asking, “Is that all?” At this point, I’d have had a more fulfilling experience (emotionally and nutritionally) at a fast food chain—and still walked away with change for dessert.\n\nIn conclusion: if you're looking to pay premium prices for portion sizes that would make a hamster complain, Nando’s Bugis Junction is your spot. Otherwise, save your dollars and your dignity. You deserve a meal, not a mystery.",
      "time": 1745234427,
      "translated": false
    },
    {
      "author_name": "Trung Nguyen",
      "author_url": "https://www.google.com/maps/contrib/116989337883280227101/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXm7CiRA1cdp0BaXSggq7qAdyRrdexxW6ag2wOh9-rPKCDurqZ3dg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Nando’s at Bugis Junction is a great spot if you’re craving flavorful flame-grilled chicken with a spicy kick! 🍗🔥 Their PERi-PERi chicken is always juicy, tender, and grilled to perfection. You can choose your preferred spice level – from the mild Lemon & Herb 🍋🌿 to the fiery Extra Hot 🌶️ – so there’s something for everyone.\n\nThe set meals are a good deal, especially the 1/4 or 1/2 chicken combos with two sides 🍽️. I personally love pairing mine with Mediterranean rice 🍚 and grilled veggies 🥦. They’ve also got PERi-PERi bowls, wraps, and burgers if you’re looking for something different – all customizable and packed with flavor 😋.\n\nThe ambiance is cozy and casual, great for a chill lunch or dinner 🪑🕯️. Service can be a bit slow during peak hours ⏳, but the staff are generally friendly and helpful 😊. It’s usually less crowded during off-peak times, so that’s the best time to go for a smoother experience 🕰️.\n\nIf you love bold flavors and don’t mind a little heat, Nando’s is definitely worth checking out! ✅ Bonus points for being conveniently located right in Bugis Junction – perfect for a meal after shopping or exploring the area 🛍️🚶‍♂️.",
      "time": 1744102801,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6907201753456610866",
  "user_ratings_total": 1826,
  "vicinity": "200 Victoria Street, #01-85/86/87 Bugis Junction"
}