{
  "formatted_address": "20 Tg Pagar Rd, Singapore 088443",
  "geometry": {
    "location": {
      "lat": 1.2798798,
      "lng": 103.8438153
    },
    "viewport": {
      "northeast": {
        "lat": 1.281212030291502,
        "lng": 103.8452338302915
      },
      "southwest": {
        "lat": 1.278514069708498,
        "lng": 103.8425358697085
      }
    }
  },
  "name": "NangLen Thai Restaurant Bar | Tanjong Pagar | Tom Yum Mama | Best Thai in Singapore",
  "place_id": "ChIJeSCdqQ4Z2jERpYGEyeFs1sw",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Shereen Y.",
      "author_url": "https://www.google.com/maps/contrib/115562818016091903505/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWCQ4kn93eRMnwSY3LrAf815J_1clK_A29vweRcX8XLPz8QIAdZ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "The moo ping was so juicy and tender. Jumbo cockles were huge and slightly bloody (which is good). Tom yum with mama noodle was average. Mango sticky rice was nice, the mango was sweet while the sticky rice not too sweet and it was still warm when being served.\n\nOverall, delicious food, nice Thai music and very observant and friendly staffs. Will definitely visit again in the future :)",
      "time": 1734268209,
      "translated": false
    },
    {
      "author_name": "Kai Ng",
      "author_url": "https://www.google.com/maps/contrib/105345469072974394760/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW6cLhiL-gQ4iwxKWZWwYSTeKgYsgwOUuDSmiwI8b0JHbGWqlsA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "They served us the lunch special basil chicken w/fried egg on rice:   4/5stars\nThe rice was weirdly bone dry. The sauce and veggies were fresh and crisp and perfectly. Spicy!  Only negative was the chicken pieces did not taste very fresh and a bit overcooked. But sauce was excellent. Fried egg also done well!\n\nIncluded homemade lemon tea(tasted good reminded me of Lipton lemon ice tea powder)3.5/5. My husband gives 4/5\n\nMango sticky rice 4/5\n\nFor the starter platter of mixed appetizers:\n\nThe pork skewers were the best. Meat extremely fresh and very tasty. The glaze was crispy and neat tender and juicy.  5/5stars\n\nFish cake was standard 4/5\n\nPandan wrapped deep fried chicken. Lemongrass also in it? Interesting at 3.75/5\n\nThe salmon skin disappointing a bit too fishy smell 3/5\n\nBoth sauces were delicious. 4/5\n\nLunch crowd comes at 1230 full house",
      "time": 1737088883,
      "translated": false
    },
    {
      "author_name": "Maisie Lim",
      "author_url": "https://www.google.com/maps/contrib/108467420716576542108/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLf5B2iJVWzKX3WvWP7mFRWNI5uRH4ai6gSlL_ovZAmxnxXvQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "a week ago",
      "text": "Food came out really quickly. Basil pork fried rice was really good, flavourful. Regular spicy was already pretty spicy, so its not for the weak. Tomyum mama noodles was decent, but the fire below the pot was pretty weak and it took a long time to heat up before we could eat the dish. Taste wise, very refreshing. Loved that the tomyum soup was not only creamy but also sour from the lime.\n\nPandan chicken, was pricy considering its a very small portion. 4 small and dry pieces of chicken for $8 and each piece of chicken was tiny and dry. You can give it a miss.",
      "time": 1746982203,
      "translated": false
    },
    {
      "author_name": "Natasha Liman",
      "author_url": "https://www.google.com/maps/contrib/102397633516649975287/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU2RD9JDItSWUt8NdNg1_9d8TnQdFHQ4b92Qtio5Rv92o9UcjzjqQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "We enjoyed our dinner at NangLen last weekend. The service was superb, and the atmosphere was great as well.\n\nMoving on to the food, we ordered:\n1. Tom Yum Mama (S) – It came with prawns, mussels, baby octopus, fish fillets, noodles, and two eggs. As someone who loves sour and spicy flavors, I felt the soup wasn’t quite sour or spicy enough. However, my hubby loved it (and he doesn't like sour), so I’d say it suits those who prefer a milder version. Portion-wise, it was pretty generous, and the soup is refillable.\n\n2. Pandan Fried Chicken – Pretty flavorful, and dipping it in the sweet chili sauce really elevated the taste. That said, we still felt it was missing that ‘punch’ factor.\n\n3. Holy Basil Roast Pork – We loved this one. It was spicy, the roast pork was crispy, and the addition of round beans made it crunchy—superb! Paired with steamin' hot rice = chef’s kiss 👌🏻\n\nWe'd love to come back sometime to try out their other menus (we're eyeing the fried squid, moo ping, basil fried rice).",
      "time": 1744209091,
      "translated": false
    },
    {
      "author_name": "L x",
      "author_url": "https://www.google.com/maps/contrib/116678363375930567885/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL4DEN5mCknnnfxXaualNcbY56pEyM96kZ-Mc5u8ZuJTZXGFA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Delicious! Must order Basil pork rice with egg set lunch! Abit spicy but soo gooood! Mango sticky rice is good too! Lunch set is super worth will definitely come back and try more😊\n\nEdit: also tried the garlic prawn lunch set, it is not bad but i still prefer the basil pork.😋 The prawns are peeled and easily removed from the tail, and has a bouncy texture which is good. But the seasoning is too salty that day and the garlic/shallot are not crispy but hard and easily stuck in teeth. If the garlic could be crispy it will be much better!!\n\nAlso had dinner there to try the mama noodles, prawn omelette, basil pork and pandan chicken.\nI like the mama noodles soup and the noodles were not overcooked. However, the soup hardly boil as we were sitting outside. Also, the seafood in the mama noodles were not fresh! The prawns are very mushy and the mussels are fishy..🤢 only the squid can be eaten..\nThe prawn omelette is not bad but i think it lacks the salt and egg fragrance, as you can tell from the pale color.\nThe basil pork is much dryer than the one i had during lunch, though i do like their flavor. Should add tenderizer to the pork!!\nThe pandan chicken is tender, pretty average.\nNot sure if dinner standard is lower or it is just bad day that day🤔",
      "time": 1741889064,
      "translated": false
    }
  ],
  "types": [
    "meal_takeaway",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14760104545757725093",
  "user_ratings_total": 260,
  "vicinity": "20 Tanjong Pagar Road"
}