{
  "formatted_address": "167 Thomson Rd, Singapore 307619",
  "geometry": {
    "location": {
      "lat": 1.3179655,
      "lng": 103.8434725
    },
    "viewport": {
      "northeast": {
        "lat": 1.319373980291502,
        "lng": 103.8446883802915
      },
      "southwest": {
        "lat": 1.316676019708498,
        "lng": 103.8419904197085
      }
    }
  },
  "name": "Nara Japanese Restaurant",
  "place_id": "ChIJeXsF6-cZ2jER3xfe4x5PF6s",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Trotting Horse",
      "author_url": "https://www.google.com/maps/contrib/114960726223703734828/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWmWrZOfc8yngJq5eHAmZ5zL2QIpFgvWp_3EMcLx0ogoNPe7XY=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I am very impressed by choices for the lunch set. Definitely can find something that suits everyone. They even allow replacing a small item in a set for another equivalent which not many places allow.\n\nIngredients are very fresh. The ebi prawn for tempura does not have the frozen prawn taste like many places do. This we appreciated.\n\nSashimi slices are thick with great texture. Very satisfying. Didn’t expect that there some fruit slices to end of the meal.\n\nService staff is very attentive and prompt.\n\nFrom Novena MRT, due to major road construction creating quite a bit of a mess at the huge road junction. Follow signages that say to Gold Hill after coming out of the MRT to cross the road using an overhead bridge and should be ok.",
      "time": 1741673440,
      "translated": false
    },
    {
      "author_name": "SJ",
      "author_url": "https://www.google.com/maps/contrib/115597023030181957554/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLR_Xr7LFUMJjYPc63mmVqsmlMDqI7KuMjeitnfmvOpkfJQ_w=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 2,
      "relative_time_description": "9 months ago",
      "text": "Be careful of surprise charges. Would not recommend. Decent to average food. Service can be improved but is overall ok.\n\nWould not have patronised if I’d have known before. What’s a shame is charging for the Yasai stick which are the “starters”. They turn out to be some raw vegetables that they serve unsolicited when sitting down for insane 5$. Wet towel comes for 40 cents - what a pity. That reminds me more of shabby Chinese backyard restaurant tactics.\n\nWould not go again. Money better spent somewhere else. Poor staff left with the complains while the owner probably insists on charging.",
      "time": 1721998220,
      "translated": false
    },
    {
      "author_name": "Benjamin Sim",
      "author_url": "https://www.google.com/maps/contrib/103987333962497841910/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXMwRjHbzNC75lJUis_LK00rbPrRAfcsuyz8GK8joxVU6z6Yf0=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "8 months ago",
      "text": "Comfortable Japanese Restaurant serving fresh and seasonal cuisine at good price points. Had the $158+ 7-course Omakase set. Service was brisk during lunch and we finished the meal at a leisurely pace (made it back to work by 1:45pm). Aburi nigiri items were delectable. Loved the Black Cod (Gindara) in the clear Ume broth.",
      "time": 1725015727,
      "translated": false
    },
    {
      "author_name": "Matthew Lee",
      "author_url": "https://www.google.com/maps/contrib/109397825257995094119/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIixaYVl0wJURE1BHYld5TXrWto_XXPpGQMy1A8MucbvABWdg=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "Visited on a weekday afternoon for lunch around 1130 and the place was totally empty. I supposed they have just opened for business and I was the first customer for the day.\nThis restaurant is quite interesting it has 2 entrances from opposite sides of the building which I guess the one facing the road is more prominent.\nThe moment I sat down I was shown a couple of menus which can be quite overwhelming. There was a wine menu, lunch set menu, ala carte menu and omakase menu. I have already kinda decided what I wanted to eat when I was browsing through the menu before I entered, so it just took a while for me to get the waiter to get my food ordered.\nI have to say looking at the prices on the menu it seemed pretty reasonable,  and the moment the food was served I have to say the portions were quite big as well so it was really value for money. I did order another Agedashi tofu outside of the set meal, and it was so unusual you get 4 pieces of tofu when you normally get 2 or 3 pieces at a more expensive price.\nLiked the chirashi bowl too. Fish was fresh and the portion was definitely filling. Everything on the tray was good, enjoyed the chawanmushi and the tempura. They were the last to be eaten but they remained crispy throughout.\nDo try the Bento sets its really value for money. A pity the restaurant didn't seem very popular as when I finished my meal and headed to the counter to make payment, I realized there was just another customer dining.\nDefinitely worth a visit.",
      "time": 1712660353,
      "translated": false
    },
    {
      "author_name": "Bee Hong Ng",
      "author_url": "https://www.google.com/maps/contrib/116585422797777328765/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWOPmI8B5jo8oRx0WYwaIB3jeXwaPGkJcaIG-p0xN_Hcy2rw34=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "An extraordinary Japanese restaurant close to our hearts. The seafood is impeccably fresh, and you absolutely must indulge in their grilled hamachi and succulent oysters.",
      "time": 1694236176,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12328409499040618463",
  "user_ratings_total": 162,
  "vicinity": "167 Thomson Road, Singapore"
}