{
  "formatted_address": "65 Airport Blvd., B2-03 Singapore Changi Airport, T3, Singapore 819663",
  "geometry": {
    "location": {
      "lat": 1.3558324,
      "lng": 103.9868107
    },
    "viewport": {
      "northeast": {
        "lat": 1.357003830291502,
        "lng": 103.9885666802915
      },
      "southwest": {
        "lat": 1.354305869708498,
        "lng": 103.9858687197085
      }
    }
  },
  "name": "Nasi Lemak Ayam Taliwang",
  "place_id": "ChIJTVmFhjc92jERePigpDS0QWw",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Luqman Hakim",
      "author_url": "https://www.google.com/maps/contrib/106669934280414926705/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXzAK2hZrAVb_NYUFJxzv_U77ISa2COCitxctR56uRB34RMYPg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Great Nasi Lemak with Excellent Service!\n\nI had a superb meal at Nasi Lemak Ayam Taliwang in Changi Airport. The chicken was cooked to perfection—tender and flavorful—while the sambal had a well-balanced taste that complemented the dish beautifully. The portion size was just right for the price, making it a great value-for-money meal.\n\nBeyond the food, the Changi branch stands out for its excellent staff and service. The team was friendly and efficient, ensuring a smooth and pleasant dining experience. The cozy environment made it a comfortable spot to enjoy a satisfying meal before a flight.\n\nHighly recommended for anyone craving a delicious plate of nasi lemak with a unique twist!",
      "time": 1743043345,
      "translated": false
    },
    {
      "author_name": "Ryan Tan",
      "author_url": "https://www.google.com/maps/contrib/113480107826816722985/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJLXWYFIzX_-S3sbC6MrdVgqeqLYkGHC30vLoZrjMjN5rx_lw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "Saw the food setting in the picture and think the food must be not bad. Ordered meal number 3 to dine and it was put in a paper box when it was served. Fork and spoon were plastic type. The box was so small, and with plastic utensils, difficult to eat with the thigh meat. Totally disappointing. Other stalls were provided with metal fork and spoon. How come this stall don't have? They want to cut cost by providing plastic utensils and no need to pay for washing fee??? What kind of service is this. Never go back again.",
      "time": 1744808395,
      "translated": false
    },
    {
      "author_name": "Yan Qi",
      "author_url": "https://www.google.com/maps/contrib/115869370988585670722/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWurwudSiGSQQJ0OrqnTvKxSsBrBm8qrNg-bi5-kRXJQLSICw8=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "A Delicious Discovery at Changi Airport T3: Nasi Lemak Ayam Taliwang\n\nI recently discovered Nasi Lemak Ayam Taliwang, a new outlet in Changi Airport Terminal 3's food court. This eatery specializes in chicken dishes, but also offers other options like Sambal Sotong and Beef Rendang.\n\nTheir signature Ayam Taliwang, Curry Chicken, Sambal Sotong, and Beef Rendang have become my go-to orders. Due to limited seating, I usually opt for takeaway, which is made convenient by their eco-friendly boxes that keep everything organized.\n\nThe staff's friendliness and efficiency impress me, as they manage high orders without long queues. Pricing is very reasonable, especially with my staff discount.\n\nWhat draws me to Nasi Lemak Ayam Taliwang is the ease of enjoying a well-cooked, tender meal. Their Beef Rendang and Sambal Sotong are particularly flavorful.\n\nIt's no surprise that they've won Michelin awards at their Yishun outlet - the quality and taste are exceptional. I'm hooked!\n\nRating: 5/5\n\nNasi Lemak Ayam Taliwang has earned a loyal customer in me. If you're passing through Changi Airport T3, do yourself a favor and try their delicious, award-winning dishes.",
      "time": 1732613097,
      "translated": false
    },
    {
      "author_name": "maya sari",
      "author_url": "https://www.google.com/maps/contrib/116639404436230371308/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIsW8CUEZ4CoaFy9xWIbkvG74Oh2MpUBAbCfvkjEF6ApSbEjw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "this is not ayam taliwang, just chiken and  tomato chili on the top, and the chiken still bleeds in the inside.",
      "time": 1745745050,
      "translated": false
    },
    {
      "author_name": "Nas P Ramlee",
      "author_url": "https://www.google.com/maps/contrib/105681396866553023456/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWk0ftlp4CYW3i6ZuraCr4jI2EQlsEmQk6OKKy7F5WvN2srfbzF=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "As a staff here, i will always come by here to grab the best nasi lemak I've ever eaten! With friendly staff who will always treat their customers with love and professionalism! Thank you so much for making my stomach feel full every time i buy from this shop!",
      "time": 1729852591,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7800714167775721592",
  "user_ratings_total": 149,
  "vicinity": "65 Airport Boulevard, B2-03 Singapore Changi Airport, T3"
}