{
  "formatted_address": "5 Lower Kent Ridge Rd, Singapore 119074",
  "geometry": {
    "location": {
      "lat": 1.2938219,
      "lng": 103.7829436
    },
    "viewport": {
      "northeast": {
        "lat": 1.29596855,
        "lng": 103.7840880302915
      },
      "southwest": {
        "lat": 1.29310635,
        "lng": 103.7813900697085
      }
    }
  },
  "name": "National University Heart Centre, Singapore (NUHCS)",
  "place_id": "ChIJcUayaFEa2jERuKqRXo9eaU4",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Rosalind",
      "author_url": "https://www.google.com/maps/contrib/117282314372583796372/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUIdD8KUWwjXch__zoh83-nnOhcpNdJ6M85HBaTsG3ZqH3oTSA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "25 April 2025\nAt NUH heart centre  F01-31 room 3\nPatient reported at counter at 1020am\nWas only called in at 1730\nDone at 1815.\nIs only a 45mins procedure but was told it will take a few hours????\nPatient cried when they infused another medicine in the room.\nWonder becos is subsidy the reason?",
      "time": 1745577435,
      "translated": false
    },
    {
      "author_name": "Jessica Lim",
      "author_url": "https://www.google.com/maps/contrib/109474232026091931178/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXzBKETjOnPckQa_vSBib0d_MZHxFYX07sl1zcLzMt7Db_w4bzN=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 2,
      "relative_time_description": "3 months ago",
      "text": "I usually trust NUH for providing good service, but did not have a great experience from the doctor attending to me (a British doctor). My polyclinic requested for a certain test (I saw the note written in the referral) to be done for me due to certain symptoms that I had and my concerns but upon seeing my age and ECG was pretty much dismissed and the test the polyclinic requested wasn't done at all. Wasn't asked about my family history, which would explain why despite my \"young age\" and \"ok ECG\" I had concerns.\n\nDidn't feel great that it seemed as if I was wasting the clinic's time because I looked fine and too young to have any heart issues.",
      "time": 1739930784,
      "translated": false
    },
    {
      "author_name": "E Goh",
      "author_url": "https://www.google.com/maps/contrib/114511187464922909362/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJVvzMMDSr7LCyG6-uBnLHaZhFIV8FepTzhAEq-ZUolOD396A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Dr. Wesley was very attentive and patient. He gave me a lot of advice on how to care for myself. PSA Zaliffah is helpful and caring. Was a pleasant experience.",
      "time": 1732590992,
      "translated": false
    },
    {
      "author_name": "Kheng Lim",
      "author_url": "https://www.google.com/maps/contrib/108206666122111886147/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK63Tj73nOX5Jbhf_CEkJi3IA2VzNSHBeT9UQRg27t3BcspBQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "I am incredibly grateful to Dr. Kok Fai, Dr Ivandito and their exceptional team for the outstanding care they provided during my father's recent heart surgery at National University Heart Centre.\nFrom the very beginning, Dr. Kok Fai and Dr Ivandito demonstrated unparalleled expertise and professionalism, which gave us immense confidence in the success of the procedure.\nThey took the time to thoroughly explain every step of the surgery, ensuring that we fully understood the process and what to expect. Their clear communication and patience in answering our questions were incredibly reassuring during a very stressful time.\nThe entire team exhibited remarkable coordination and dedication. Their collective efforts and seamless collaboration were evident throughout my father's hospital stay. Each team member showed a high level of skill and compassion, making my father feel comfortable and well-cared for.\nPost-surgery, Dr. Ivandito and their team continued to provide exceptional support, closely monitoring my father's recovery and addressing any concerns promptly.\nTheir commitment to my father's well-being was truly commendable, and it made a significant difference in his recovery journey.\nThanks to Dr. Ivandito, Dr Kok Fai and the dedicated team, my father is now on the road to a healthier life. We are deeply appreciative of their expertise, kindness, and unwavering dedication.\nI highly recommend Dr Kok Fai and Dr Ivandito and their team to anyone in need of heart surgery. Their exceptional care and professionalism have made a profound impact on our family.",
      "time": 1722840538,
      "translated": false
    },
    {
      "author_name": "Jonathan Walujo",
      "author_url": "https://www.google.com/maps/contrib/103644725915306187728/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXFR5lyovhZbUFYNwixlWspDXSibCAm6OEIjzbQbPfWHOydVXiFZA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "a year ago",
      "text": "My experience at NUH Heart Center has been a mix of good and bad. The doctors and nurses are no doubt of high standards and very professional. However, there seems to be a fundamental miscommucation between the staffs where often schedules are not properly organized. I, as a patient, have often been totally confused about where I have to go or what I have to do. One example: I had an appointment with the doctor at 1030 am. I was in taxi at 1010 am on the way to hospital when the staff called my mobile and asked me why I wasn't there yet because I have to do blood test before meeting the doctor. I had never been told to come earlier. So when I saw the doctor at 1030 am there was no blood test which he needed to examine my condition. This was one example and many more happened. Hope this can be fixed because I believe NUH has one of the best care facilities in Singapore.",
      "time": 1691629528,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5650151177372936888",
  "user_ratings_total": 67,
  "vicinity": "5 Lower Kent Ridge Road"
}