{
  "formatted_address": "1 Mandalay Rd, Singapore 308205",
  "geometry": {
    "location": {
      "lat": 1.3198862,
      "lng": 103.8488077
    },
    "viewport": {
      "northeast": {
        "lat": 1.321203830291502,
        "lng": 103.8503904302915
      },
      "southwest": {
        "lat": 1.318505869708498,
        "lng": 103.8476924697085
      }
    }
  },
  "name": "National Skin Centre Retail Pharmacy",
  "place_id": "ChIJszGLLnEZ2jERK5L93HXDk60",
  "rating": 2,
  "reviews": [
    {
      "author_name": "CCS",
      "author_url": "https://www.google.com/maps/contrib/113721018771927256976/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWMlRl2RBY5DT2YTuy4aoz9RbG9sZoMTGtgb0cRYrJeWdsslVoEsg=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 3,
      "relative_time_description": "3 months ago",
      "text": "This is probably the best retail pharmacy amongst the hospitals in Singapore.\n\nI have  sang three national anthems, and an avid hospital visitors. So I think I am qualified to make the following comments.\n\nFor starters, the place is brand-new and humongous. Their merchandise displays put any Orchard Road malls to shame.\n\nWhy? Displays are logically placed. Prices indicated clearly - especially for the elderlies. Judging from the number of dignified seniors, this place is the best kept secret amongst the wealthy residents of the Newton area.\n\nYet, their staff, from cashiers to pharmacists, and even shelving aunties are knowledgeable and helpful. Silent heroes.\n\nI have read with incrdulity the adverse comments of previous reviews. These people should visit the retail pharmacy of SGH, NTFGH and KTPH.\n\nEven paying is a joy here, not withstanding the prices.  Where else can you get a free full-sized moisturizer with ANY purchase? Where else in Singapore can you get UNLIMITED free plastic bags? (Hush)\nWhere else can you get cashiers who will patiently explain to longwinded English-speaking prosperous-looking aunties?\n\nGo check this place out- and this applies to CEOs and administrators of other hospitals.",
      "time": 1738924678,
      "translated": false
    },
    {
      "author_name": "Terence Lim",
      "author_url": "https://www.google.com/maps/contrib/102229173285915272863/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIyM3kOoPh-CsDJpfZ7XwCwS_qKMDK65xZofdRkiYx0FLKsJQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "Really bad efficiency. 45 minutes waiting from post registering my prescription needs, to check out. There were more staff than people waiting, dont see why it takes so long to get the medicine. Verifying ic and name before dispensing is ok but why do we need to do that at the cashier again? The procedures and priorities should be reviewed.",
      "time": 1733464168,
      "translated": false
    }
  ],
  "types": [
    "pharmacy",
    "health",
    "store",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12507555501124194859",
  "user_ratings_total": 2,
  "vicinity": "1 Mandalay Road, Singapore"
}