{
  "formatted_address": "33 Jln Remaja, Singapore 668693",
  "geometry": {
    "location": {
      "lat": 1.3584841,
      "lng": 103.7595287
    },
    "viewport": {
      "northeast": {
        "lat": 1.359896330291502,
        "lng": 103.7609202802915
      },
      "southwest": {
        "lat": 1.357198369708498,
        "lng": 103.7582223197085
      }
    }
  },
  "name": "Nest Preschool Hillview",
  "place_id": "ChIJ5TEJpUoR2jERs7mzY65QAgY",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Aishah Hamzah",
      "author_url": "https://www.google.com/maps/contrib/101738423414840651605/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU0GXjgs9bS9hV8ed9Y5F-l4W1xghUh51JF9wxyXxzC1Np3aqI=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I highly, highly recommend Little Sage @ Hillview for infant care. My daughter was enrolled for 4 months and in that short period of time, her development was exponential. She used to heavily rely on the yaolan to sleep, but transiting her to the crib was effortless, thanks to Little Sage. She also recognises a phone camera and will stare at the lens intently! ;)\n\nWe have no regrets sending her to school at such a young age, because all the teachers there are professional and qualified, providing her with the necessary resources for her growth. They are friendly and gentle with her, showering her with so much love that she gets excited whenever she realises that she's going to school! All of them have played a pivotal role in my daughter's life.\n\nSpecial shoutout and thanks to the Principal, Ms Sarah, for being a present figure and patiently answering my queries. She is also very hands-on and will assist the teachers without question. To Ms Elly, Ms Ashini, and Yu Lao Shi, who have been there with my daughter since her first day, I feel relieved knowing that she is in good hands every day. Thank you for your prompt responses in the app too, and for your reassurance whenever I had concerns! To Ms Tina, who although doesn't take care of infants directly, she was still very much involved in giving her feedback and observations, which we were extremely grateful for.\n\nYou can be assured that the teachers at Little Sage @ Hillview are dedicated. Even if they are not in charge of infants, they have the relevant certifications to take care of them when need be. We see that each teacher is passionate about what they do, and we are extremely grateful knowing that our daughter has been thriving under their care. Given the choice, we would love to continue with Little Sage, but because we are moving to the other side of Singapore, we regretfully had to withdraw her. Thank you Little Sage!",
      "time": 1701592365,
      "translated": false
    },
    {
      "author_name": "Joanne Tan",
      "author_url": "https://www.google.com/maps/contrib/104518832482957572928/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVNi4PPGpYGYKZkbOjeGL4gD9hkHTwzp28tc32mKPcHmuWilQCp=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I am very happy that I enrolled my baby son with Little Sage @hillview. The infants teachers have strong dynamics and have done a great job in caring for my son's well-being.  Most IMPORTANTLY, low sick rate.",
      "time": 1702290851,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=432997224108243379",
  "user_ratings_total": 2,
  "vicinity": "33 Jalan Remaja"
}