{
  "formatted_address": "300 Tanglin Halt Rd, Singapore 148812",
  "geometry": {
    "location": {
      "lat": 1.2999524,
      "lng": 103.7999953
    },
    "viewport": {
      "northeast": {
        "lat": 1.301293080291502,
        "lng": 103.8007644302915
      },
      "southwest": {
        "lat": 1.298595119708498,
        "lng": 103.7980664697085
      }
    }
  },
  "name": "New Town Primary School",
  "place_id": "ChIJkyM8ahAEBBAR_iZRVb31ljU",
  "rating": 3.9,
  "reviews": [
    {
      "author_name": "Raymond chen",
      "author_url": "https://www.google.com/maps/contrib/104531794665044577129/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocINUEseoSR8jbOTppKLZ876Mushcei2jkm7odWaTPTAVCxlvg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "I did not know that the school had a google review page if not I would have informed before. The school is very bad for conducive studying environment. My son was bullied by another student and no hard action was taken against him. Instead the bully was advised by the teacher. He still bullies my son at school from time to time. He also bullies other students when possible. I know that my son is not bright and saint but he needs to do well this year so he can go to secondary school but seems like it is not possible. I am getting tuition in order for him to cope and understand better which does not come cheap as it is $50 per hour. Kindly think twice before sending your child to this primary school as it will be hard to change school later.",
      "time": 1744083386,
      "translated": false
    },
    {
      "author_name": "SOPHIE zhang",
      "author_url": "https://www.google.com/maps/contrib/112028181390494211341/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLMJaAl0UKi_ALvRncWVbY_dPx3ABhsf6kvgkVlFCMmQnJlTg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "I strongly recommend parents not to sent their kids to this school as students are noisy and naughty. My daughter is taking PSLE this year but yet her class is still noisy during class time. Her teachers have turned a deaf ear to noisy/talkative students. I spoke to teacher during parent teacher meeting before march term break regarding it but nothing has been done for the past one week. My daughter said that the school has many intellectually disabled students as well who go crazy from time to time",
      "time": 1743592589,
      "translated": false
    },
    {
      "author_name": "Addison Patrick",
      "author_url": "https://www.google.com/maps/contrib/113719627750729349141/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUutbHBLlMRdHV7mVQVIa9kivbU6ORfTE2mp2KJLAmG3xJpdco=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Think twice before sending your kids to this school. The teachers are not good and nonchalant towards disciplining students. My kid was bullied by another student and the boy got away with verbal warning according to my kid. He started bullying again and my kid does not want to go school now. I complained about it to the form teacher but he said he will look into it nonchalantly and act on it. Plan to change his school next year after final examinations.",
      "time": 1744677039,
      "translated": false
    },
    {
      "author_name": "Vicknesh Rao",
      "author_url": "https://www.google.com/maps/contrib/108109730798303387733/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJb2m4jfDUFA0XvIMKRMJr34la9GbRX6e_-VzJMsmbttnF6Rg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "My son studies in the school and he always says that the class is super noisy. I have told the form teacher on it last month but nothing has been done. Seating arrangement of students have been changed but it is still noisy. Students also get into physical fight during recess time but no caning is done for these students but at most suspension according to him. I need to get a personal tutor just for him so he learn up fast for his PSLE. Hope the school principle or discipline master start doing their job seriously.",
      "time": 1743905989,
      "translated": false
    },
    {
      "author_name": "Hardiana Abdullah",
      "author_url": "https://www.google.com/maps/contrib/117850502738005071261/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJVqhUuCPnF5RgoHzF-QcXX_3cOWtiozEICCwSmbNRmn4Q3EQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "My daughter is taking PSLE this year but she complains that her classes are always noisy and disruptive. She may not be smart as she is taking foundation subjects only but she needs to pass them into order to go to proper secondary school. I told the teachers  about it during the parent teacher meeting session in March and my girl is still saying that until TODAY that the her class is noisy and disruptive when teacher teach. It gets worse when a relief teacher come as the whole class will go berserk. Hope putting here will make the school committee know about what is happening in class.",
      "time": 1744789178,
      "translated": false
    }
  ],
  "types": [
    "primary_school",
    "point_of_interest",
    "school",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3861543924045784830",
  "user_ratings_total": 51,
  "vicinity": "300 Tanglin Halt Road"
}