{
  "formatted_address": "6 New Industrial Rd, #02-03, Singapore 536199",
  "geometry": {
    "location": {
      "lat": 1.3414664,
      "lng": 103.885355
    },
    "viewport": {
      "northeast": {
        "lat": 1.342929430291502,
        "lng": 103.8865534302915
      },
      "southwest": {
        "lat": 1.340231469708498,
        "lng": 103.8838554697085
      }
    }
  },
  "name": "New Century International Pte. Ltd.",
  "place_id": "ChIJ2ZFknJYX2jERkA8wGiAx1H4",
  "rating": 2,
  "reviews": [
    {
      "author_name": "Amy Tan",
      "author_url": "https://www.google.com/maps/contrib/103697767815949394605/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUwkyBOjefnT3eNVprhljW9g-S9zh3dPR5ftRcHMIq4zqI2LuDZ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "If can, we would definitely give a 0 star. Asked us to clean the staircase floor, accused us of staining it when in actual fact, it is the flooring marbling or whatever it is that you call. Every floor has that stain. Landlord also told us to limit to 1 trash bag disposal a day. If you have more than 1, either you hire your own disposal company or they will bully you and charge a $500 disposal fee.\n\nThey are super micromanage and will view the CCTV at all times all day to make sure you adhere to them.\n\nThey have a basement carpark but it's only for season parking ticket holders. If you don't buy it, you cannot go down even if it is a thunderstorm day.\n\nCars have to park head in into the parking lot. Don't know what weird rule is this. Feng shui maybe? But if you don't, they'll send security guard to you.\n\nAnyways, good luck to current and future tenants! Two horrible years here, the worst of the worst landlords and management ever.",
      "time": 1716174562,
      "translated": false
    },
    {
      "author_name": "Ching L",
      "author_url": "https://www.google.com/maps/contrib/114459119182627047780/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUKZp5cmj5VhTX_k7M0yHTh-5vLsAPuF-tmJGvyHn4ZF_ADudBO=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "10 months ago",
      "text": "I’ve rented three different buildings on this road and the landlord/mgt here is by far the worst. The security guard hassled every. Single. Guest who came. And also us. Everytime I throw rubbish I have to fight one of the guards and mgt tried to slap us with a $500 disposal fee when we threw something they deemed over the limit of 1 bag a day (are you sure you’re an industrial building?), after not throwing anything for 30 days.\n\nThe unit also came without a guarantee on the existing aircon as it was marketed as “bare” so obviously they were all spoilt and we had to totally overhaul when fixing. However when handing over mgt demanded we service the aircon fully with numerous other extra fixes (redoing walls, redoing an already spoilt floor) that were not stipulated in our original tenancy agreement. I suppose it helped their >50% rental raise.\n\nBtw, forget about staying dry when it rains. There’s a porch but you’ll get shouted at by security for even driving near it bc mgt’s cars are parked there. It’s been so peaceful since leaving!",
      "time": 1720107366,
      "translated": false
    },
    {
      "author_name": "George fickleton",
      "author_url": "https://www.google.com/maps/contrib/114196963095574770671/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLby_wqkLinNjVC61cXEqbUC8c3smPyZrToMt_Oh_rjs186LQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "12 months ago",
      "text": "Ridiculous management. I have rented so many office spaces before, but this landlord really takes the cake.\n\n1. Limiting the number of trash bags we can throw in their garbage area\n\n- It was not even stated in the contract that we weren’t suppose to throw more than 1 trash bag a day . They asked us to pay an extra $500 for the disposal fee. LOL the owner can  drive so many lavish cars , but cannot even afford to pay for a bigger garbage bin.\n\n2. Loading bay lifts not even in proper working condition\n\n- They claim to service the lifts regularly but sometimes the lift doors don’t even open…. Was stuck for about 5 mins in the lift\n- Another incident that happened was when I pressed level 2 but it brought me to level 3 instead. Hehe love a good surprise!\n\n3. To protect their stupid fruit trees at the back of the building , they will FORCE you to park forward instead of the usual reverse parking. This is such that the exhaust don’t harm their precious fruit tree (believe me when I lol-ed at this ) So when my client comes to park at the outdoor parking, they will have to change their parking positions.\n\nOverall I would give this experience a solid -1000/10\nbut 10/10 for entertainment",
      "time": 1716282030,
      "translated": false
    },
    {
      "author_name": "Mei Ling Loh",
      "author_url": "https://www.google.com/maps/contrib/101168380979854319225/reviews",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXV4PQMJ2P5qNCKqBn_x-C9y7Y3jU4ZeDieLCs4BoQ129-McrVQzw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "",
      "time": 1661076941,
      "translated": false
    }
  ],
  "types": [
    "bank",
    "finance",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9138983557789650832",
  "user_ratings_total": 4,
  "vicinity": "6 New Industrial Road, #02-03"
}