{
  "formatted_address": "1 W Coast Dr, #01-49/50, Singapore 128020",
  "geometry": {
    "location": {
      "lat": 1.3162373,
      "lng": 103.7573826
    },
    "viewport": {
      "northeast": {
        "lat": 1.317567730291502,
        "lng": 103.7586397302915
      },
      "southwest": {
        "lat": 1.314869769708498,
        "lng": 103.7559417697085
      }
    }
  },
  "name": "NeWest Medical and Laser Clinic",
  "place_id": "ChIJj47DQpca2jERCrYi_CEibj4",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Eugene Lim",
      "author_url": "https://www.google.com/maps/contrib/110500550679529024209/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIllSwV9n8DBHA7zo7AiuDwhSvBpXD8DymI1sRg-ndaad04gw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Want to give a shoutout to the 2 male doctors on staff.\n\nWent to 3 GPs before seeing them and they were able to diagnose me instantly. I was very ill and had to be hospitalised for a week.\n\nEvery other GP was saying I have “flu” or “fever” but the doctors here knew something was up and didn’t dismiss my concerns.\n\nMost experiences I had with doctors in Singapore has been absolutely horrendous and honestly I could be a doctor myself at this point.\n\nBut the doctors here at Newest? Absolute lads!",
      "time": 1740883679,
      "translated": false
    },
    {
      "author_name": "Eddie Ow",
      "author_url": "https://www.google.com/maps/contrib/107117400227586969750/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJi2t5XCDiJ4IB-4bCGW_ytdRQjIu03NZ82lixbGk8jKzKZ-w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "I had been their patient for years and have no issue with the receptionist. They are friendly and helpful with extended service to patients.\nThere was once while waiting in the clinic, I heard the receptionist asking if needed to write Chinese wording for the medicine as the patient is Chinese educated.\nWhile I would says, respects are gained through actions and mutually. Treats others as per how you want to be treated. \" Customers is always right\" when u respects the service provider.\nKeep it up team Newest Medical",
      "time": 1729283672,
      "translated": false
    },
    {
      "author_name": "Eddie Wong",
      "author_url": "https://www.google.com/maps/contrib/116758212857225843154/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV2ZBV1gK2v_cxpLD5NuS3b0uxLyg9TuinV4ZNLlTPSsAeHbJ4=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "I don’t even have the chance to give them business. Lucky me. Tried calling them many times over 2 days during operational hours but nobody pick up. Left message on their business WhatsApp also never reply. Finally they answered my call this morning. I asked her why it’s so difficult to get hold of them and why they never read their WhatsApp. She said unapologetically “busy” “no time to answer calls”. So when I told them what I need and want to make an appointment. She just said that they don’t take appointments, come down before 11am. So I told her I can’t make it and might have to go other clinics then, she said “ok, thank you” 😡",
      "time": 1740452515,
      "translated": false
    },
    {
      "author_name": "Mavis Lim",
      "author_url": "https://www.google.com/maps/contrib/117739204371119239483/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIQuzrEZf9-l_uO09zdtYWrgzglg6pfVMbIu9xMaSXCYUWLsQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "I had an outstanding experience at Newest Medical & Laser Clinic and I want to specifically highlight the amazing work of both the receptionist and the doctor. The receptionist was efficient, and organized, making the check-in process smooth and quick. They answered all my questions with professionalism, setting a positive tone for my visit.\nDr Low Wymin was equally impressive, taking the time to thoroughly listen to my concerns and providing clear, thoughtful advice. I felt truly cared for by both the receptionist and the doctor. Their teamwork and commitment to patient care made my experience exceptional. Highly recommend this clinic!",
      "time": 1729592619,
      "translated": false
    },
    {
      "author_name": "Pine Ong",
      "author_url": "https://www.google.com/maps/contrib/110313662487272285907/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIDIwYpsuu9msQ6_SzK6vak2g_eg8RCmwQhYW2vFRED1ta5ZQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "I've been a patient at this clinic since 2022 and consistently received smooth service from the Receptionist. They demonstrate remarkable helpfulness, expertise, and organization.\n\nTheir systematic approach ensures seamless experiences for patients. I appreciate how they adhere to standard operating procedures (SOPs), maintaining clarity and consistency for all patients. This attention to detail prevents misunderstandings and fosters trust.\n\nThe Receptionists' professionalism and efficiency make a significant positive impact on my overall experience. I highly recommend this clinic for its exemplary patient care and administrative excellence.\"",
      "time": 1729248897,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4498570607149102602",
  "user_ratings_total": 56,
  "vicinity": "1 West Coast Drive, #01-49/50"
}