{
  "formatted_address": "1 Jurong East Street 21, Singapore 609606",
  "geometry": {
    "location": {
      "lat": 1.3337448,
      "lng": 103.7453915
    },
    "viewport": {
      "northeast": {
        "lat": 1.335106330291502,
        "lng": 103.7471285802915
      },
      "southwest": {
        "lat": 1.332408369708498,
        "lng": 103.7444306197085
      }
    }
  },
  "name": "Ng Teng Fong General Hospital",
  "place_id": "ChIJN6GRIgwQ2jERSCjOqPhNygU",
  "rating": 2.4,
  "reviews": [
    {
      "author_name": "Jenny Lim",
      "author_url": "https://www.google.com/maps/contrib/105777067946524644951/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUnhlQiNmtyWFBYIw3icAS8-d4t2oiRXnSDZ2XVeOl2lIl2_hPYKA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Came in via ambulance with my dad who fell down and require a night observation + stitching. The doctor and nurse attended to my dad promptly and he is also able to use his phone to update his status. Extremely grateful to the A&E counter nurse Mohamed Shairul who helped me request doctor to call me and also helped ask nurse to give my dad water.\n\nOverall a good experience though wait can be slight long.\n\nDr Tay who helped my daddy is also very good. He stitched him and called and updated me on my daddy status and told me medication can be provided here so we need not rush back to take. Very appreciative of the prompt assistance and care.\n\nFollow up by Ng Teng Fong Leon from Musculoskeletal Physiotherapy department was good. He called and ask if my daddy was going. I asked him to refer to NTUC healthcare with referral to AIC so we can let him do the physio sessions in the day care itself. He actually followed up immediately and call me multiple times which I missed but he followed up. Really appreciate his care and help.",
      "time": 1746585669,
      "translated": false
    },
    {
      "author_name": "Bryan lim",
      "author_url": "https://www.google.com/maps/contrib/101339629740467913751/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLsjlRifjdslhMPnuFbrOFcc2EYNzh1E1_pqWrJmlalzmbsig=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Was in Emergency Department since 12pm to 7pm\n\nCame here for injury wound investigating and stitching Nothing hasn’t been done through out the long hour wait\n\nPoor staff coordinating and address of urgency.\n\nVery disappointing on the services.\nWas told had scheduled to go another hospital for stitching on the next day instead.\n\nWill not recommend to come here for injury wound stitching.",
      "time": 1742811044,
      "translated": false
    },
    {
      "author_name": "Linda Tan",
      "author_url": "https://www.google.com/maps/contrib/113905852925319268558/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIcog0CoE5PS2DeD_mlQpH1iHOHArvp7lBo1qBb_Wf7JeSt0Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Date: [29 April 2025]\nSubject: Compliment for Excellent Care and Service\n\nI would like to extend my heartfelt appreciation for the exceptional service and care provided during my dad's visit to your hospital. From the moment we arrived,  we was met with kindness, attentiveness, and a high level of professionalism from all staff members.\n\nIn particular, I was deeply touched by the gentle and compassionate manner in which the medical team carried out their duties. Their patience, empathy, and dedication to my well-being made a significant difference in my experience. It is clear that your staff are not only skilled professionals but also genuinely committed to the comfort and dignity of their patients.\n\nPlease convey my sincere thanks to the entire team. Their hard work and humanity do not go unnoticed and are deeply appreciated.\n\nWarm regards,",
      "time": 1745888288,
      "translated": false
    },
    {
      "author_name": "Desmond Sia",
      "author_url": "https://www.google.com/maps/contrib/102065646221593847480/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXyNPSEdUovM_brHJ2l5bvCMn1Wcaq-qZLkF9qko-FTykWJ0UtDJQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Got admitted to Ng Teng Fong for heart balloning from 18 March to 20 March 2025. First 2 days stay at ICU was perfect. Nurses was helpful and really took good care of me. Was transferred to B2 ward on the third day waiting to be discharged. The stay there was the start of hell. Nurse injected me with insulin but forgotten to feed me resulting in low sugar and extreme hunger. Offered me breakfast 1.5 hours later when the other 5 patient had finished eating. Offered to me cos they have extra. So if no extra means I'll be left without food even though the ICU's Nurse has ordered breakfast for me the day before. Shouldn't the nurse to take note of the insulin injection which will result in low sugar? Anyway, she is busy listening to 1 patient's lecture on how to study for a degree. That's my 2nd stay there and will be my last. The MO who processed my discharge was professional and fast. That's the only plus point.",
      "time": 1742581267,
      "translated": false
    },
    {
      "author_name": "m s",
      "author_url": "https://www.google.com/maps/contrib/108260154237053408258/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXElyE6Hu4tsPG8u8gEoXjoMozSDHqjdRgcSZt6Xx5hRI2qJC6J=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "3 months ago",
      "text": "My dad showed symptoms of numbness in his entire face so I rushed down to the A&E together with my mother.\n\nCounter staff says possible mild stroke so they warded my dad first.\n\nHowever they hit me with the only one accompanying person is allowed inside. As you can see the centre is completely empty and there is NOBODY even inside. I told him my dad has a possible mild stroke and YET I am not even able to stay waiting together with my mother? My mother is already very stressed over this and we cannot even sit inside while waiting. Absurd. How would you feel if it was your own parents?",
      "time": 1738349622,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=417231645864503368",
  "user_ratings_total": 1015,
  "vicinity": "1 Jurong East Street 21"
}