{
  "formatted_address": "10 Eunos Road 8 #03-02 South Lobby, Singapore Post Centre, Singapore 408600",
  "geometry": {
    "location": {
      "lat": 1.3189703,
      "lng": 103.8945292
    },
    "viewport": {
      "northeast": {
        "lat": 1.320516480291502,
        "lng": 103.8954437302915
      },
      "southwest": {
        "lat": 1.317818519708498,
        "lng": 103.8927457697085
      }
    }
  },
  "name": "NorthStar Gymnastics & Fitness",
  "place_id": "ChIJu_u5qBkY2jERgw0UIAvGK1E",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Desmond Du",
      "author_url": "https://www.google.com/maps/contrib/116701260639761008772/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVj82YaCwIXN8HPNpvQqtQ5jEYTpDAz3woFHjG-RZi_c1zcwbo=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "I recently took a series of gymnastics lessons at North Star and had a great experience. As a beginner with no previous gymnastics experience, and although challenging, I was able to learn handstands, cartwheels, and front walkovers in just 6 lessons. The instructors at North Star were kind and paid attention to each student's growth and development, and the classes were well-structured with a balance of warm-up, skill practice, and cool-down stretches. The gym was well-equipped with soft and bouncy mats, and the environment was clean and safe.\n\nOne thing to note is that the lessons might appear pricey at $45 per class, but I believe the value is worth it for the 90-minute lessons.  Class sizes for beginners varied from 3 to 8 students, which was a good balance for individual attention and group practice. It was also great to see students of all ages and levels in the class – age is definitely not a determining factor when it comes to gymnastics.\n\nOverall, I would highly recommend North Star to anyone interested in trying gymnastics or looking for a new fitness challenge. I only wish I had started earlier!",
      "time": 1671275364,
      "translated": false
    },
    {
      "author_name": "MeiFang (MeiFang)",
      "author_url": "https://www.google.com/maps/contrib/110556894372672759080/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXHkoH-S6JE6tDdni3F7js1RCihQqzkSDVUeO5O22yJsOtlsNZqAw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "6 years ago",
      "text": "The best coaches in NorthStar Gymnastics! New and awesome equipments for kids and adult for gymnastics or parties 🥳 It’s great to join their lessons with flexible schedule and monthly plan.",
      "time": 1543990678,
      "translated": false
    },
    {
      "author_name": "Kay Zhao",
      "author_url": "https://www.google.com/maps/contrib/106762367661165431688/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUVyXC5orANcFLN4aFAjJsbvIG5V6WAPdsEiEUGYjQ50Boa1N4H5A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "My child has been with the gym for the past 2+ years. We regret that we didn’t transfer her to NorthStar earlier! Training days are her most looked-forward-to days in a week. Coaches treat the children like their own. My girl is always encouraged and guided by the coaches. Every staff member is so friendly and accommodating. There is that trust between the coaches and athletes and their parents. My girl has really felt home here. She has developed such a strong sense of team. She’s proud to be a NorthStar gymnast.\n\nI cannot imagine what the 1-star reviews complained about NorthStar. I guess it’s really unfair to judge a gymnastics club, or anyone for that matter, based on just a one-time interaction. We people are easy to read situation wrongly unless we give it time to really know the organization or the person. What I said is after 2+ years’ interactions with the gym as a parent.",
      "time": 1684677507,
      "translated": false
    },
    {
      "author_name": "Sharon",
      "author_url": "https://www.google.com/maps/contrib/113418640554462515017/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKkauLPp4kPOrcmS021pUWqRfbMH6jwJ1my9ALGsRC632eVdQ=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "a year ago",
      "text": "I found North Star gym to be unfriendly, inflexible and unhelpful. I sent my daughter for a trial class. First of all, the cost of a trial class is higher than a normal class when you sign up for the whole term. After trial, I tried to speak to the teacher but they told me to leave and they’ll contact me later. Ended up sending me a message with fairly generic comments. It took me insisting to have a call for them to agree to speak, instead of just messaging me. Didn’t provide full information, can’t accommodate for holidays.",
      "time": 1694428636,
      "translated": false
    },
    {
      "author_name": "Jin Liu",
      "author_url": "https://www.google.com/maps/contrib/108968299156657822280/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXwVBkmgxU_tWN4tSHDAFoYSo4ZiybJLVi8TbXG72KYsqUjibU=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "Nice place with great coaches. My boys are always on the countdown to their next session. They're so much more confident now.\n\nFrom observations during classes, the coaches are friendly and pushes the kids to do more with encouragements. They know when to be firm and have a way with the kids. Thank you Coaches, Lukus was showing off saying he is \"in the big boy group now\" and \"I can do the same thing\".\n\nThe admin staffs are helpful when we needed updates on the kids progress and packages. Make-ups are easy to arrange; let them know in advance and they got back when there's a slot avail. If you are going on long holiday, let them know and they will make recommendation accordingly (thank you!)\n\nOverall, will recommend if you're looking for a fun and progressive gym. Looking forward to the day Leonard can join his twin in the big boy's group.\n\nPS: we'll help Leonard gain more strength work on his skills so that he is catch-up and join his korkor!",
      "time": 1602008429,
      "translated": false
    }
  ],
  "types": [
    "gym",
    "school",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5848986292155846019",
  "user_ratings_total": 29,
  "vicinity": "10 Eunos Road 8 #03-02 South Lobby, Singapore Post Centre"
}