{
  "formatted_address": "70 Compassvale Bow, #01-01 Sengkang Grand Mall, Singapore 544692",
  "geometry": {
    "location": {
      "lat": 1.3832913,
      "lng": 103.8929314
    },
    "viewport": {
      "northeast": {
        "lat": 1.384635180291502,
        "lng": 103.8943438802915
      },
      "southwest": {
        "lat": 1.381937219708498,
        "lng": 103.8916459197085
      }
    }
  },
  "name": "Now Pizza",
  "place_id": "ChIJaVdAbwAX2jER2B0a1yRt_W4",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Melissa Lim",
      "author_url": "https://www.google.com/maps/contrib/110362614633867168535/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJWgSRm0T7Pe46ytQASBdijv6sqLBwV4wAD-GcB_HBCbeh5Kw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "in the last week",
      "text": "got home and opened the box and saw that all the toppings had slid to 1 side. I did not slant or drop the box. you can see the toppings have been cooked this way.\n\nwonder how the staff can put a pizza in this state into the box and serve it to the customer after seeing it like that out of the oven.",
      "time": 1747211073,
      "translated": false
    },
    {
      "author_name": "Eason",
      "author_url": "https://www.google.com/maps/contrib/115505878104229325323/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUXciS9t2bYsA5HxZLnmabMoLfbjBzFX48R3oVOllVOhvL97Izw=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "One side of the lasagna is completely raw. Dough was completely uncooked and disgusting. Chewy and a slight hint of toughness. The cheese sticks and chicken tenders were very dry and hard. It was so hard the fork they provided was unable to poke through.",
      "time": 1743062843,
      "translated": false
    },
    {
      "author_name": "Fred “TheShanghaiKid” Lin",
      "author_url": "https://www.google.com/maps/contrib/111416774506974585201/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUJZVuPA7GZRDFXiEf3rQH-fYuwWY6aI9lkqFZKAIhJ282VkiQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Surprisingly good pizza, although abit small. Highlight is the Light airy crust, cheesey topping, and most importantly, not too salty like most of the other pizza brands.",
      "time": 1738846662,
      "translated": false
    },
    {
      "author_name": "Jason Ng",
      "author_url": "https://www.google.com/maps/contrib/108821377697270430840/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX9tqNf1h-LHLX17e-WCFCERuGItYfQIKbUDbyG27da2Fu0sz-n=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "9 months ago",
      "text": "Buangkok peeps should rejoice, as there's now a quality and affordable pizza kiosk in your area 😍\n\n@eatnowpizza offers affordable 9 inch pizzas, with most going at $10.90. At such prices you get handmade sourdough pizza that is pretty loaded with ingredients! My favourite was the Meat Mania ($10.90) pizza, as the sauce was spot on with its strong savouriness and there were loads of ingredients like ham, pepperoni and cheese 😍 the stretchy sourdough crust was such a joy to eat, as it was really tasty on its own and had a great mouth feel!\n\nIf you like sweet savoury flavours, the Spicy Beef Pepperoni ($10.90) would be your choice. Not only you get a good savoury meaty flavour, the spicy paprika honey added sweetness and some heat that was well appreciated!\n\nThe Chicken Tenders ($6.90) and Mozzarella Cheese Sticks ($4.90) were okay, nothing much to shout out about. However, their pizzas are really worth trying! At such a price and quality, I would grab this for lunch or dinner if I'm staying nearby! Thank you @eatnowpizza for the invite and food!",
      "time": 1722871733,
      "translated": false
    },
    {
      "author_name": "andre mei",
      "author_url": "https://www.google.com/maps/contrib/105697087833568143560/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIGOPqLeiVCtbi9GEp_jkrwIQ9PI94kVYe6XeVRl0bkjr5yDQ=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "Hi, first of all this review is not regarding their food but their service.\n\nMy mother ordered 3 pizzas and was given 4 pizzas. When she took her order, she told the staff (a skinny malay employee) that she only ordered 3 pizzas instead of 4 pizzas. Instead of thanking her, that said employee doubted her and even challenged my mother when she told him that he gave the wrong order. After which he took the pizzas and checked through and removed the extra pizza and just “pushed” back the pizza box to my mom in a nonchalant way. No apologies whatsoever, just acting as though my mother is at fault.\n\nThere was no apology or thank you but rather that employee made it seem like it was my mother fault who was honest enough to tell your staff that an extra pizza was being given. So now honesty will be dealt with rudeness?\n\nThere was no also chilli flakes given and my mother had to come back all the way to take it and again your same employee couldn’t even be bothered to say sorry or thank you.\n\nIs this how your employee treat customers? We don’t expect a smile but cmon, questioning and challenging my mother’s order and acting as though she made a mistake when your employee gave an extra pizza and she was being honest.\n\nDo better please. Your pizzas are good but hope your employee doesn’t spoil your business.",
      "time": 1745039411,
      "translated": false
    }
  ],
  "types": [
    "meal_takeaway",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7997668518274932184",
  "user_ratings_total": 97,
  "vicinity": "70 Compassvale Bow, #01-01 Sengkang Grand Mall"
}