{
  "formatted_address": "11 Hillside Dr, Singapore 548926",
  "geometry": {
    "location": {
      "lat": 1.3567266,
      "lng": 103.8782427
    },
    "viewport": {
      "northeast": {
        "lat": 1.357964030291502,
        "lng": 103.8798928302915
      },
      "southwest": {
        "lat": 1.355266069708498,
        "lng": 103.8771948697085
      }
    }
  },
  "name": "NPS International School - Primary",
  "place_id": "ChIJAxaJ-FM92jERwvgQdI7bH4Y",
  "rating": 3.4,
  "reviews": [
    {
      "author_name": "Baisakhi Chatterjee",
      "author_url": "https://www.google.com/maps/contrib/113110045853522253427/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVJHyZRGycHSZ4ZJP6TBYV50l6xUzmcfRsUGz5mShIn5Ljy887WGQ=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "5 months ago",
      "text": "This place is amazing, my daughter studied here from K2 to Grade 5. The teachers understood the children very well, and in the PTCs, they always knew the strengths and weaknesses of my child. In their weekly assemblies, every students gets a turn once in a while, which is amazing! In 2024, the HOS, Mr Wyeth, has been allowing Chinese, Korean and other students from other races to join the school. The campus is not quite big, but the teachers can explain very well. The primary and secondary campus are in different locations, one at Hillside and one at Scotts Road. The school has many OBTs and field trips, making the children independent. In the secondary campus, the teachers are not that great, and always scold the students. At Grade 8, the school will choose which board you will take, depending on your marks. The school canteen is overpriced, as 3 cheese sticks cost $2.50!! The pizza is not that great, it is made out of artificial cheese and is FILLED with ketchup. This is a great school, you should definitely consider.",
      "time": 1732770635,
      "translated": false
    },
    {
      "author_name": "Astraeus Brigham",
      "author_url": "https://www.google.com/maps/contrib/102982344275567995798/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL9BxrlKUzIpds8CPA9NomNBYI5Z6vFyRUyXr0BI5YOj5TVVP0=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "2 years ago",
      "text": "a rather old achool, very pretty old facilities including but not limited to classrooms auditorium (it's actually a hall, but just called auditorium), sports court, canteen, toilet, and rain shelter and rooftop and corridors and road and laboratory..... its called an international school but i am not very sure about it. there are sat exam held here tho, since this november, from the new pilot digital exam. but the staff here are super friendly, uncles are veryyyy nice.",
      "time": 1668829714,
      "translated": false
    },
    {
      "author_name": "Kiana Roy sen",
      "author_url": "https://www.google.com/maps/contrib/113457697379904797228/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKcwSTtM-ofBWy_9FbTqynaMMtknV88DRChVWt6V7DmvOK5Lw=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "3 weeks ago",
      "text": "People are pretty rude there when I used to go, facilities weren’t as great. And a very small field",
      "time": 1745741103,
      "translated": false
    },
    {
      "author_name": "Archana Manjunatha",
      "author_url": "https://www.google.com/maps/contrib/114018414082449383988/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWP-q3zfLMiPG_cngSL_jTgVcN_MYwYgrykBiq29B9uUCifPs5B=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "12 months ago",
      "text": "My daughter studied here right from kindergarten to IB2, and has some of the best experiences and memories from the school. The principal Mr Kris Bhat and all the staff have the utmost care for the students and support and nurture them. During her time at school my daughter participated and won at the World Scholars Cup, attended Yale for the finals of the competition, launched her student led start up, won the Princess Diana award for her contribution to the community and was one of the shortlisted for the SG Presidents award for volunteering. All these were possible while still being academically focused due to the support and encouragement of her teachers. They always motivated her and supported her endeavors reminding her that she can achieve anything she wanted. Every PTC meeting was conducted with care to give constructive feedback to ensure the student is helped. The school balances the academic rigour with outbound trips, extra curriculars in sports, debates, dance and several other areas. My daughter who is also a trained indian classical dancer was given several opportunities in the annual day to choreograph the shows. The school follows a policy of leave no one behind and ensures every student has a role in the annual day. All these make it a very inclusive environment.\nOur experience with the school has been excellent and we thank NPSI and it's management and staff for their service.",
      "time": 1716695696,
      "translated": false
    },
    {
      "author_name": "DHIRAJ BODKHE",
      "author_url": "https://www.google.com/maps/contrib/110497708119276508849/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVoAK7hR5NrXTA6CTv-1tRIRjbldneZtHec44hJvUCzgX4tOFWWLQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "NPS International School Singapore is a great school for students of all ages. The teachers are highly qualified and dedicated to helping students succeed. The curriculum is challenging, but also well-rounded, with a focus on both academics and extracurricular activities. The facilities are modern and well-maintained, and the school has a strong sense of community. Overall, I would highly recommend NPS International School Singapore to anyone looking for a high-quality education in Singapore.",
      "time": 1674143310,
      "translated": false
    }
  ],
  "types": [
    "primary_school",
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9664684730239482050",
  "user_ratings_total": 87,
  "vicinity": "11 Hillside Drive"
}