{
  "formatted_address": "8 Purvis St, Singapore 188587",
  "geometry": {
    "location": {
      "lat": 1.2967133,
      "lng": 103.8552195
    },
    "viewport": {
      "northeast": {
        "lat": 1.297995080291502,
        "lng": 103.8565149302915
      },
      "southwest": {
        "lat": 1.295297119708498,
        "lng": 103.8538169697085
      }
    }
  },
  "name": "Nutmeg & Clove",
  "place_id": "ChIJ932MOA0Z2jERl0YHLKdA6VY",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Kenny Yap",
      "author_url": "https://www.google.com/maps/contrib/105256927610815725781/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXcPvs1ZpGoEXYjKq_FFRgFMieeHCw9D8043R8OsUqM_5Tcxisr=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Vibey bar especially at night when they dim down the lights. Nutmeg and clove is on the top 50 bars list and deservingly so.\n\nWe started off with their happy hour cocktails for $16++, and they come with some delicious free flow fried chicken sandwiches which was nice and toasty. Cocktails itself was packed with flavors and they don’t hold back with the alcohol.\n\nWe initially were seated at the bar area but requested to move to the table seats as it was too noisy being seated at the bar. We also had our dinner there but some dishes I would probably skip. The CBS and HCG ribs were really good, rendang M&C and fried carrot cake was nothing special and just normal carby dishes like what you would find anywhere else. We saw the table beside having truffle fries, curry hummus, the pendai fish and CQ chicken wings. While we thought they looked delicious and glanced at their food one too many times, they barely touched it before finishing the drinks and left.\n\nWe proceeded to order round 2 of drinks, and I had pretty unique matcha drink with salted jasmine foam, of course with whiskey as it’s a cocktail. Pretty interesting and if you’re a cafe person it’s hard to say no to this, but for $26++ I would wish for some explanation and a little smaller piece of ice.\n\nOverall great vibes and an extension and well documented menu. Love the small details like having a coaster for water (which is poured before you are seated) and another one for cocktails.",
      "time": 1739841735,
      "translated": false
    },
    {
      "author_name": "Gastro Kettu",
      "author_url": "https://www.google.com/maps/contrib/111577922562286773351/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXr66FZyYjgwsy17o_0Y6L9gYaBp-j1Xto_fp5U7MuC7FiSxUA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Nestled in the heart of the city, Nutmeg & Clove is a hidden gem that elevates cocktail culture to new heights. Upon entering the bar, you are immediately enveloped in an inviting ambiance, a perfect blend of cozy sophistication and modern design. The warm lighting and tasteful decor set the stage for an unforgettable evening.\n\nThe cocktail menu is a true standout, featuring unique creations that showcase the artistry of mixology. Each drink is thoughtfully crafted with fresh ingredients and unexpected flavor pairings, making it a delightful adventure for your palate. Whether you're in the mood for a classic twist or a bold new flavor, Nutmeg & Clove has something to satisfy every cocktail enthusiast’s cravings.\n\nService at Nutmeg & Clove is impeccable. The staff is knowledgeable and passionate about their craft, offering insightful recommendations and ensuring that every guest feels valued. They take the time to engage with customers, making each visit feel personal and special.\n\nDo keep in mind that a reservation is mandatory, as this hot spot tends to fill up quickly due to its popularity. It’s a small price to pay for the exquisite experience that awaits.\n\nOverall, Nutmeg & Clove is more than just a bar; it’s a destination for those looking to enjoy expertly crafted cocktails in a vibrant yet intimate setting. Highly recommended for a night out with friends or a romantic date!",
      "time": 1744719682,
      "translated": false
    },
    {
      "author_name": "Fitriana Dyah",
      "author_url": "https://www.google.com/maps/contrib/111312924429931985420/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLqaTvjNYjbFtevZ4Xlzu0dFmSXKllmMn8O6EE871oAMUyF9g=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Very unique selections of cocktails! Unpretentious place which makes it a great place to catch up with friends over drinks and nibbles. We ordered the signature nutmeg and cloves, ripple 75, the famous rendang mac & cheese and pork chips. Definitely one of the world’s best bars!",
      "time": 1744514577,
      "translated": false
    },
    {
      "author_name": "Brittany Grogan",
      "author_url": "https://www.google.com/maps/contrib/103628543000164712641/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJk6ywN5Gooxxa0Ab7aSj68HQLXYb8QghYtHNHehjBSfSFidPA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Had an incredible evening at Nutmeg & Clove. My partner and I had two cocktails each and they were all unique and delicious, and we wished we could try several more. I also love the lovely menu they've put together highlighting all of the community members they support with their cocktails. For food we just had the carrot cake and truffle fries, but both were outstanding. The carrot cake was a unique take on the dish, with much bigger pieces that are so crispy on the outside and so soft and pillowy on the inside, I was obsessed. We also had excellent service.",
      "time": 1738077735,
      "translated": false
    },
    {
      "author_name": "Eve",
      "author_url": "https://www.google.com/maps/contrib/101205309000274221514/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJVJhthvjIFmvnBlx1OzD34CJsFcVtkX4VvxeontHAAaz1dcw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "A good place to drink and chill. Their sig nutmeg and clove is great! Def will order again next time!! :) if you prefer woody whiskey, u will like old fashioned. Peanuts is outside of the menu but can request. $3 per bowl.",
      "time": 1742126132,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6262607843577775767",
  "user_ratings_total": 497,
  "vicinity": "8 Purvis Street"
}