{
  "formatted_address": "1 Grange Rd, #10-10, Singapore 239693",
  "geometry": {
    "location": {
      "lat": 1.30147,
      "lng": 103.83742
    },
    "viewport": {
      "northeast": {
        "lat": 1.302786730291502,
        "lng": 103.8386139802915
      },
      "southwest": {
        "lat": 1.300088769708498,
        "lng": 103.8359160197085
      }
    }
  },
  "name": "Nutramed Clinic",
  "place_id": "ChIJp-GkZosZ2jERToxvBFA7Spc",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Sabrina Lee",
      "author_url": "https://www.google.com/maps/contrib/109113051756642282053/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXm-JKcstMSKkpKD1jPlmNQHAefFHcIkxg97ysMuHeOZfFK4SLg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Recommended by my family to come here and it was a personalised and insightful visit. Dr. Phuah was super friendly, holistic and comprehensive with my existing conditions and gave tailored recommendations on how to live healthier and lighter. She even referred me to other specialist that would better help with my condition and took detailed tests for evaluating.\n\nThe ladies here are warm and friendly! It definitely cost more than your regular GP but I have a change of mind after visiting as you get a lot of insights, any potential concerns off your mind with a wider perspective of habits and lifestyle in the long-run. Thank you so much!",
      "time": 1732716977,
      "translated": false
    },
    {
      "author_name": "Carolina Gomez Perez",
      "author_url": "https://www.google.com/maps/contrib/116404596662715268267/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU2-3J28VMQeMA3slYoiPvbkws05rUvpzPO9mXtXIo-h7EZP5Nj2w=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "Dr Phuah is great and very professional. Unfortunately her staff is all the opposite. It’s contradictory that she has a holistic approach but she has so unprofessional and unkind staff working there. It is really stressful each time I have to talk to them because they are really rude and you can see they don’t like their job.\nSince the first moment they would refuse to answer the phone saying they only reply written whatsapp. In consequence instead of a conversation of 1min it took 10 messages to find a date… the appointment itself took so long time . I was with my kids and arriving late to the next appointment. I said to send me invoice and I would make the transfer. They were calling and writing messages as if I wouldn’t pay??  When I went to collect meds, the nurse talked to me in such a rude way!! And to finish, they send you all the docs with tests results with codes that sometimes don’t work, take time to open… no time for all that but of course the candid nurse wouldn’t make it easier for you in a  simple scan… of course not or send it directly to the specialist doctor who was waiting for the results. . I would have shared  my impressions directly with the doctor but the nurses wouldn’t pass me her direct email. Unfortunately, not wiling to come back.",
      "time": 1731494219,
      "translated": false
    },
    {
      "author_name": "Elizabeth Yap",
      "author_url": "https://www.google.com/maps/contrib/111481944072041731929/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUx33IZ-H2pOzhiJzVwDVxzHlLW1ymDecPQQzhCbez08CBtQGs=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "Always a thumbs up for this clinic, Dr Mel excels in every aspect of family health care, totally entrusting all tests for her consult for the last decade and love her carefully tailored advice on meds or supplements to suit  and support our lifestyle ,and her loyal staff through the years, excellent!!",
      "time": 1718116351,
      "translated": false
    },
    {
      "author_name": "周D",
      "author_url": "https://www.google.com/maps/contrib/100973912099714391799/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW7A3CRouVCq-faoxL9ViNApEvbhp4Rrf566T7V134KZy3s1Yvo=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Frustrating experience with this clinic … I made multiple bookings which were confirmed on HealthHub since March but each time, they claim that there is a system issue blaming HealthHub’s booking system and postponing it a week or, in the first instance, 3 weeks later. I’d avoid this clinic. Unreliable timings which means you can expect a long wait. In modern Singapore, there is no reason you have to wait for 3\nweeks to see a GP; it’s inefficient which probably says something about their service. Frankly disappointed. I’d give zero stars but the minimum is 1 star.",
      "time": 1712975441,
      "translated": false
    },
    {
      "author_name": "Darren Low",
      "author_url": "https://www.google.com/maps/contrib/105590735497682657500/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJwGHIoGwDjF-j3V0YW1eLupKSoq4A8LdTH1rg3BydpXwvD7A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "I have had the pleasure of being assessed and treated by both Dr. Phua and Dr. Yap\n\nThey are constantly up to date with their approach towards medicine and I highly recommend them.",
      "time": 1718114786,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10901591062861548622",
  "user_ratings_total": 19,
  "vicinity": "1 Grange Road, #10-10"
}