{
  "formatted_address": "83 Punggol Central, #01-13 Waterway Point, Singapore 828761",
  "geometry": {
    "location": {
      "lat": 1.4062619,
      "lng": 103.9014504
    },
    "viewport": {
      "northeast": {
        "lat": 1.408146830291502,
        "lng": 103.9028832802915
      },
      "southwest": {
        "lat": 1.405448869708498,
        "lng": 103.9001853197085
      }
    }
  },
  "name": "OCBC Bank | Waterway Point",
  "place_id": "ChIJWfJVReMV2jERvQCb7wg89RA",
  "rating": 2.6,
  "reviews": [
    {
      "author_name": "Celyn Chua",
      "author_url": "https://www.google.com/maps/contrib/113526572434501821937/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKyVo69cIFiICrputBZqZAq66u9otiX9g9GEGAvf-gCfKDHRg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I had an exceptional experience at OCBC Punggol Waterway Point recently, and I feel compelled to share my appreciation for the outstanding service I received. The uncle in front of the registration counter was incredibly professional, courteous, and attentive to my needs. From the moment I walked in, I was greeted warmly and assisted promptly. He understand my circumstances and gave me a number so that I can skip the queue for my mum.\n\nI went into a comfortable room and were served by a friendly young staff name NG FOO SHIONG DAVID. Not only he waited patiently for my family to reach, he even went above and beyond to ensure that all my banking inquiries were addressed and explained thoroughly. They demonstrated great patience and were very knowledgeable, making the entire process smooth and stress-free. It's rare to find such a dedicated and customer-oriented team, and I am truly grateful for their support.\n\nFurthermore, he guided my parents in all the problems and teach them to procedure of using Bank App confidently. I’ll definitely be returning and recommending him to others.",
      "time": 1743221109,
      "translated": false
    },
    {
      "author_name": "Mr H",
      "author_url": "https://www.google.com/maps/contrib/117445922271830258311/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI0QZeLuicG84Du49L8c8TZesuD6-GEBdHbOWvVf6qp-El6LA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "The bank recently contacted us, requesting that we visit the Bedok Branch to settle and refund money that was mistakenly deposited into our account last week.\n\nMy mother made an effort to visit the Punggol Branch on the same day we received the call to request a statement printout to verify the transactions before agreeing to sign the form to return the amounts of $6,000 and $5,420 to the bank. However, the bank teller informed her that it was not possible to print a statement for her and could only verbally share the transaction details. This feels unusual, especially since we are trying to resolve the matter and already made an appointment to sign the necessary paperwork to release the funds.\n\nAdditionally, regarding my stolen credit card, the bank allowed 16 unauthorized transactions to go through and is now asking me to pay the full sum, along with interest and late charges. This is despite my 12-year relationship with OCBC, during which I’ve likely spent 100 times that amount. In contrast, HSBC blocked a similar transaction immediately, resulting in just one charge, and put the disputed amount aside without adding interest or late fees until the matter was resolved.\n\nAre banks always in the position to win, leaving the customer to bear the cost?",
      "time": 1730338343,
      "translated": false
    },
    {
      "author_name": "calista c",
      "author_url": "https://www.google.com/maps/contrib/114103476238520430760/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUXpDDs7O_GJIfUxQ2GwpCGjNCIdBXrDZig7gu99108OaAEUVs0=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "9 months ago",
      "text": "not only myself, even my mum had a bad experience with this branch.\nMy mum spent one hour going in and out of different counters, but none of them could solve our problem. Staff kept pushing responsibility from one to the other, and at last, we realised, the issue could have been solved in less than 10mins if the staff at the branch were more attentive and helpful.\nService standard is not there.",
      "time": 1723870067,
      "translated": false
    },
    {
      "author_name": "Lynn Goh",
      "author_url": "https://www.google.com/maps/contrib/104762219858040785986/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIuP_txLTtbprGYFO60dW7zbdWLwd0-WxsJhw3Y8H3saHZXNw=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "9 months ago",
      "text": "Staff are blurred, gave incorrect queue no and caused unnecessary waiting time. When I was served, both customer service officer and counter staff are not professional and NOT service oriented.. I do not wish to quote staff names but your staff really need to re train on customer service. Staff represents the bank’s image which I feel the staff in this branch don’t really care.",
      "time": 1723266233,
      "translated": false
    },
    {
      "author_name": "G James",
      "author_url": "https://www.google.com/maps/contrib/101223512717845818710/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV6SPCz-X9BYvlhpEDJXjhT1JXUb0qPek51zbuDcRkBm5YRm_k5Zg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "7 months ago",
      "text": "TERRIBLE CUSTOMER SERVICE\nI went there to open an account for my child. My token no was called on Room 5. Two ladies were sitting very comfortably there: one senior looking Chinese lady and another junior lady. From the moment I entered, this senior lady seemed in no mood to serve. She talked to me very suspiciously from the beginning. (BTW, I have been an OCBC customer for more than a decade with over 100k avg balance). I STOOD there and talked to this lady for more than 10 mins. They did not have the minimum courtesy to offer me their chair. Clearly, she was in a hurry send me back without doing anything and go home. I know her name but I don't want to mention it here.\nI am closing my account. Staff like her leads to collapse of any organization.",
      "time": 1729435038,
      "translated": false
    }
  ],
  "types": [
    "bank",
    "finance",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1221948882978275517",
  "user_ratings_total": 82,
  "vicinity": "83 Punggol Central, #01-13 Waterway Point"
}