{
  "formatted_address": "1 Tampines Central 5, #01-04/05 CPF Tampines Building, Singapore 529508",
  "geometry": {
    "location": {
      "lat": 1.3531219,
      "lng": 103.9436755
    },
    "viewport": {
      "northeast": {
        "lat": 1.354272830291502,
        "lng": 103.9453191802915
      },
      "southwest": {
        "lat": 1.351574869708498,
        "lng": 103.9426212197085
      }
    }
  },
  "name": "OCBC Bank | CPF Tampines Building",
  "place_id": "ChIJ678bxeYW2jERbW6UZUHZjK8",
  "rating": 3.2,
  "reviews": [
    {
      "author_name": "Put Kira",
      "author_url": "https://www.google.com/maps/contrib/113030800467362830361/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVH99lSvnBu7WJewkFfdy5uxOQRGS9NoPBSZ81tXCExfKP0InU=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "This is a star given to the lady at general enquiry counter I met couple of times. I think she is used to serve in the market style at the bank. When a customer frustrated over the email promised by the bank that never came for more than 2 months; she should have listened versus tried to justify her action.\n\nI came more than twice since the CNY promotion of my child account for the disney pin. The counter lady kept telling me I should received an email from OCBC marketing contains redemption code (she triggered another email on my second time I came to report that no email received). However still, no email received. After I came to another branch for same reason; the other person approached me less than a week and sent me the redemption code.\n\nI came back to this branch as nearer to me to find that the disney pin machine was no longer there. So I approached her; I shared to her that I quite frustrated as for the silly pin I had to come back and forth; but was confused as the other branch managed to get it done efficiently.\n\nAfter I showed the code she then asked me to wait; told her I need to rush to fetch another child. She then proceed with asking when I need to leave and where is my child school (in which I dont think relevant at all). After she took the pin for me, she asked me to show the account and ask my contact to do another sort of verification.\n\nRefused, I told her I had visited 3 times including the last branch and showed the eligibility to get the redemption code. She then insisted; I got frustrated. I just wanted it to over; can you imagine after back and forth showing your account to get silly pin, you were still asked to verify at the end. The code itself should be enough; if the machine still there I should be able to get it myself.  The lady continued with reason that by right I can only collect it after 10 April since the machine was no longer available (?????? is she tried to threat or justify?).\n\nInstead of acknowledging my frustration; she keep explaining that she needed my contact to record the pin collection and etc etc etc. It is very simple and does not matters for customer if only she showed the acknowledgement in the first place by simply saying \"I am sorry for all this trouble\" or \"I apologies for all the issue you faced \". After all our disagreement, she said sorry only 1 time and at the end of conversation she asked me to calm and even remarked that she had said the 'sorry' word.\n\nI feel all this experience should no need to happened if only the front counter staff knows how to acknowledge a customer's concern. I think she had worked there quite some times already; but she may need some refreshment about the customer service.\n\nWe trust a bank with our money; decided to choose OCBC for the child's money I don't think I deserve to have this market-style counter service; more over it comes from big brand bank like OCBC. I hope the Tampines branch can consider this small reminder to the counter in front (esp to this lady) to bring back faith in the customer's experience. I thanked the Wisma Atria branch counter person who had been very efficient in handling my issue.",
      "time": 1744167094,
      "translated": false
    },
    {
      "author_name": "Zamair Ibrahim",
      "author_url": "https://www.google.com/maps/contrib/110123165784907667250/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU0NIByKuAoukgz_Sows3haBNTvx3qMYL92vyzkGKTuyybHdU1n=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I would like to extend my heartfelt appreciation to Hailey at the OCBC branch for providing me with exceptional service. From the moment I approached her, Hailey demonstrated an incredibly polite and patient demeanor, which immediately put me at ease. She took the time to thoroughly address all my queries, no matter how detailed they were, and did so with unwavering professionalism.\n\nHailey’s dedication to ensuring that my banking issues were resolved was truly remarkable. She carefully explained every step of the process, making sure I understood all my options, and went out of her way to ensure that I left the branch completely satisfied. Her attentiveness and willingness to assist made what could have been a stressful experience into an entirely pleasant one.\n\nIt is rare to encounter someone who embodies such a high level of customer service, and I believe Hailey deserves to be recognized for her outstanding work. She is a true asset to OCBC, and her five-star service has certainly left a lasting impression on me.\n\nThank you once again, Hailey, for your patience, professionalism, and kindness. Your assistance was invaluable, and I deeply appreciate all the effort you put into helping me.",
      "time": 1735363323,
      "translated": false
    },
    {
      "author_name": "little dot",
      "author_url": "https://www.google.com/maps/contrib/109760586618904817052/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWeTV8gxQUiiPe7sbn472vBAnvY-O8x8IhyPlKSiZGI4wbcbtAgMw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "Best staff at Ocbc Tampines goes to ROBERT!\nI am a silly fellow who locked myself out of my velocity, it is indeed a tiring process to reinstate the online account. Robert is very efficient and quickly settle the matter. He was so detailed that when I need to make a call to Ocbc tele bank to activate my password, he quietly write down all the information needed for the call on a piece of paper so I dun need to scramble for them. Never met a better bank staff. Thank u Robert!",
      "time": 1718695883,
      "translated": false
    },
    {
      "author_name": "Shir",
      "author_url": "https://www.google.com/maps/contrib/116046559141230301014/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUkWiU0nNwnHPb0n8_9EFf_lm02EpJtKkif6lXhTX_syKb_nRZSHQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Was down with my mom to settle her online banking and one token activation because we couldn't do it over the app. Received tremendous help from Xueyi who was extremely patient and thorough. Very professional service. Thank you!",
      "time": 1735209623,
      "translated": false
    },
    {
      "author_name": "Liu Kelvin",
      "author_url": "https://www.google.com/maps/contrib/113275429634810077182/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIrAOjrQgVQSEBw-lGVPmnRrXNHQpm6O05wK_DhmSOPD6fSdg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "OCBC Tampines Central Branch is the WORSE Brunch that I had encounter. Please do not name yourself as a top brand.\n\nYour atm machines are the worse I even encounter in Singapore across island. Such as machines are slow in process during transaction and by the time I cash out my money, I already being robbed. Your brunch had 2 white elephant for diposit coin which cannot use bank book update what is the point of using such so call good machine but a lease function can do.\n\nYour branch have 2 huge white elephant coin machine, 3 atm machine and out of these 3, ONLY One that can do bank book update. Worse still it fail to function as an update machine. Super lousy... Any other bank atm machine are even better your brunch.\n\nTo the Management team of OCBC Tampines Central Branch. You have fail customer service for not being observe customer need. Such a disappointment.",
      "time": 1740161215,
      "translated": false
    }
  ],
  "types": [
    "bank",
    "finance",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12649724328277208685",
  "user_ratings_total": 85,
  "vicinity": "1 Tampines Central 5, #01-04/05 CPF Tampines Building"
}