{
  "formatted_address": "257 Bangkit Rd, #01-51/55, Singapore 670257",
  "geometry": {
    "location": {
      "lat": 1.3784962,
      "lng": 103.7730112
    },
    "viewport": {
      "northeast": {
        "lat": 1.379791430291502,
        "lng": 103.7743574802915
      },
      "southwest": {
        "lat": 1.377093469708498,
        "lng": 103.7716595197085
      }
    }
  },
  "name": "OCBC Bank | Bukit Panjang",
  "place_id": "ChIJ9d7MMqcR2jERUvDS80JMbLY",
  "rating": 2.7,
  "reviews": [
    {
      "author_name": "aqilah natasha",
      "author_url": "https://www.google.com/maps/contrib/104723637965779103147/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUhb5trjIT4GUxZZNfRtcoGmfpbakxoIM9Wp-cpA1qZ0o_rL6LR=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 weeks ago",
      "text": "We waited for ALMOST 2 HOURS just to be told that the counters are all engaged and suggested to do online banking instead to open new account. The lady that approached us talked to us in a condescending manner. She did not guide us with proper information. We do not appreciate the lack of customer service. We suspect they only approached us because the bank was closing and they wanted to go home already. For reference, we arrived at 3pm but was suggested to do online banking at 4.40pm. Complete waste of time.",
      "time": 1746003554,
      "translated": false
    },
    {
      "author_name": "Zulfadli Waled",
      "author_url": "https://www.google.com/maps/contrib/101948464664202959825/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK1fhwz26WLbyrugKmFvhz7mMv7_-61xYGXpolOPRQES5VTZw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "Hi OCBC management,\n\nI hope this reaches to you and that proper actions are taken.\n\nOn the 14th of November, at approximately 430pm, I came to the branch to deposit a cheque that was attention to my alias that is Zulfadli Waled with my address, while my legal name is Muhammad Zulfadli Bin Waled. After the teller Bee Geok wrote down all the details such as my current account number and contact number, she returned from the back office and claimed that they are not able to accept the cheque.\n\nBee Geok then called out her manager, Cora Enriquez who claims that she is the Service Officer to assist the situation but she also mentioned that they would not accept the cheque.\n\nI have explained that the cheque is from Etrade that I have earned in exercising my stocks. I have even provided and showed transactional proof both on emails and the Etrade app but they still declined.\n\nI understand that banks have policies that name on cheque and legal name has to be accurate but the fact that I have provided proof of my alias as well as transactions, banks could proceed with it.\n\nI feel these actions were very discriminatory and racist. In the corporate and professional world, many has alias that they go with and i believe this would have gone through if it was a chinese or a white person. I can imagine how this would have been handled and processed differently if I had came in with a suit and tie instead of a tshirt and pants.",
      "time": 1731583349,
      "translated": false
    },
    {
      "author_name": "Chloe Lee",
      "author_url": "https://www.google.com/maps/contrib/104403176287365817098/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX3zcJpBZA2Fbw72BTGi5V-l1t504bmSDegJZYJ3NwOlTqN_SjSKQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "8 months ago",
      "text": "Terrible experience. Never trust this bank's website explanation. I have SRS account from this bank.  According to their website, I can put my SRS fund to Time deposit so I visited this branch but the staff Randy (not sure, but he is in the booth 5, working at 9:30am 6th Sep 2024) just said 'cannot' so I said that your website shows I can. I showed him their OCBC website explanation from my cell phone at his desk. He read it and browse the site and read again using his monitor. He went to his colleague to check it. But he returned and kept saying 'cannot'. He never said sorry about their huge misleading. I've never experienced this kind of unprofessional attitude from banks. It's simply unbelievable. Totally waste of my time.",
      "time": 1725591951,
      "translated": false
    },
    {
      "author_name": "Shakeel Diego",
      "author_url": "https://www.google.com/maps/contrib/103445401105791767707/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLBrYauCjVY1NS87c4qXsDT2sIEWWChVp1BP60zQh1QX3PBGuU=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Lazy staff, went there to do my debit card, told me to just do it at home, super lazy staff, very slow service even during non peak hours",
      "time": 1741759844,
      "translated": false
    },
    {
      "author_name": "Low Raymond",
      "author_url": "https://www.google.com/maps/contrib/115013286055011378839/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKS9r7WkDvplCgpclkVHeiCClzNmxubhw5PfT0H5a1wE-rhPg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "Take too long time to solve one of the debit card, the staff Miss Chong serve\nto me, I have said the card problem and issue the Q no. to wait my no, it took around 40 mins , to serve only 3 numbers difference, when my turn the counter,  the counter girl said she cannot handle my card and return back to miss Chong and unlucky she servicing customer wait another 20mins come to me and just took 2min done my card problem. I been waiting more than 1 hour and told her I was very angry.  Please ensure she won't be happen again and poor performance job.\nuncleraymond@gmail.com(email)",
      "time": 1655183686,
      "translated": false
    }
  ],
  "types": [
    "bank",
    "finance",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13144965262829875282",
  "user_ratings_total": 37,
  "vicinity": "257 Bangkit Road, #01-51/55"
}