{
  "formatted_address": "1 Maritime Square, #02-99/100 HarbourFront Centre, Singapore 099253",
  "geometry": {
    "location": {
      "lat": 1.2649571,
      "lng": 103.820444
    },
    "viewport": {
      "northeast": {
        "lat": 1.2657654,
        "lng": 103.8216838302915
      },
      "southwest": {
        "lat": 1.2629518,
        "lng": 103.8189858697085
      }
    }
  },
  "name": "OCBC Bank | HarbourFront Centre",
  "place_id": "ChIJM9EuaOIb2jERA_WsaQ7eLkE",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Winarto Kwek",
      "author_url": "https://www.google.com/maps/contrib/118302811831640795691/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVP3fAxaBDheXFOA3UH4cDEz4hr_FCni-DM4xV6DcV4Ba3sEUH2=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "First time coming to open bank account as foreigner. One of the customers service explained that please come again after the physical pass has been issued.\n\nAfter physical pass being issued, they said they need proof of residence. Submitted proof of residence, they said should be in the company letterhead (which was already printed with company letterhead and proper address). Then another excuse came saying that my company is not registered in their bank, etc.\n\nIn conclusion, wasted my time here…\n\nThen went to 2 others bank. With exactly same proof of residence, Can opened the account without any issues.",
      "time": 1745650566,
      "translated": false
    },
    {
      "author_name": "Jerry W",
      "author_url": "https://www.google.com/maps/contrib/102722817551383473964/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVK7PjRcS5aOOK_UwLFF9Zor0b2YTUGdKQoBk3i3jsT_aUHgm4=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Had a very bad experience from this person  surname Toh at counter 3.  She gave us a bad experience while we were there and did not look like she want to help us. From the moment we interacted with this person, she was already showing us an unhappy face. She even shouted and yelled at us. We are told as customers to respect the workers but if the workers dont even respect the customers, then clearly this job is not for her.",
      "time": 1743505446,
      "translated": false
    },
    {
      "author_name": "WEI HAO",
      "author_url": "https://www.google.com/maps/contrib/102997996903154052598/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLPoWwPUt0S5d5WiWbUKjPN2Kpn0xw8Av7pnMhJuZEkOcdKEA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "Sabeena saw me queuing up for quite some time. Approached me and asked why I’m there today. Found out what I want and gave me a solution immediately. The staff at the queue number counter should have the attitude of sabeena. I waited 30 mins for nothing. Thanks you sabeena for your service! 🙏🏻🙏🏻🙏🏻🙏🏻",
      "time": 1745301725,
      "translated": false
    },
    {
      "author_name": "Jimmy Chai",
      "author_url": "https://www.google.com/maps/contrib/103197195377199220904/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXACe1WmWF5eHra-VLrwl3LBfkvD30Uael5qtLCZSZq6HFPBXwKAQ=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "6 years ago",
      "text": "A nice and convenient place for those who are travelling by cruise or ferry to Batam. Connected to Vivo City. Plenty of car parks and eateries. Nice view too.",
      "time": 1539011418,
      "translated": false
    },
    {
      "author_name": "Ekaterina Shalunova",
      "author_url": "https://www.google.com/maps/contrib/116912762415642862804/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUqs4JQJCMf1KF-fEXAsoiuEcsY_xjCFMOT2uLeJFL1f_bHXNBMng=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "I am having the worst experience with OCBC Bank, far worse than I’ve ever had with any other bank in my life. Here is my story: Starting from October 10, spammers began withdrawing money from my account every few days, continuing until December 18.\n\nWhen I called the bank, the representative said they would block my cards and asked me to send a report listing all unauthorized transactions. However, they failed to inform me that I would lose access to my mobile banking app. They flagged only a few recent fraudulent payments (eight transactions), and that was it. Now, I no longer have access to my statements, and my bank managers refuse to share my personal account data with me—even though it’s my right. Without this information, I cannot provide the bank with a full list of the fraudulent transactions. They are not willing to help.\n\nThe next day, I called again to ask how I could regain access to my account, but another representative told me it was no longer possible. They also said I couldn’t retrieve a full report of my transactions. I explained that this is my personal information and that I have the right to access it. I asked to speak with a manager to resolve the issue, but they refused and eventually hung up on me.\n\nI decided to follow up via email. I sent my passport details and requested the transaction reports, but no one responded. In their email, they stated that I needed to fill out a form listing all disputed transactions within five days—but it wasn’t even possible for me to access the data. No one was willing to help or provide my own information!\n\nThe bank also informed me that I could only dispute transactions made within the past 45 days, which made me feel like they were scamming me. No one answered my questions or provided a solution, dragging out the process unnecessarily. Every day, I lose the chance to recover my money.\n\nBefore Christmas, my manager finally said she would send me my statements the next day. But when the next day came, the bank’s system was down, and she didn’t even update me until I asked. Then she told me it was Christmas time, and they wouldn’t be working. Shortly after, she stopped working at the bank entirely, and now I have a new manager.\n\nThis bank is completely insecure. They didn’t even notice that these transactions were suspicious—despite being made in the U.S., a country I’ve never visited or even had a visa for. I feel scammed, both by the fraudsters and by OCBC Bank, which seems to be letting this slide without taking any responsibility. Their customer service is the worst I’ve ever encountered. I strongly discourage anyone from using this bank to avoid losing their money like I did.",
      "time": 1735920841,
      "translated": false
    }
  ],
  "types": [
    "bank",
    "finance",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4696935614877857027",
  "user_ratings_total": 4527,
  "vicinity": "1 Maritime Square, #02-99/100 HarbourFront Centre"
}