{
  "formatted_address": "1 Fullerton Rd, Singapore 049213",
  "geometry": {
    "location": {
      "lat": 1.2860884,
      "lng": 103.8540571
    },
    "viewport": {
      "northeast": {
        "lat": 1.287426230291502,
        "lng": 103.8553888802915
      },
      "southwest": {
        "lat": 1.284728269708498,
        "lng": 103.8526909197085
      }
    }
  },
  "name": "One Fullerton",
  "place_id": "ChIJu1_G5ggZ2jERTrdta7SO3A8",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Harvey C",
      "author_url": "https://www.google.com/maps/contrib/117800717069356351432/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVvAkhmWR1smrPQuYZrF-WXJ9-ZuVLYRpDC0_Crbzg2wrTvpmk8=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "One Fullerton is a premier waterfront destination, offering a vibrant mix of dining, shopping, and stunning views of Marina Bay. The promenade is lined with a variety of restaurants, each serving delicious dishes, and many offer outdoor seating where you can savor your meal while enjoying the scenic surroundings.",
      "time": 1741830341,
      "translated": false
    },
    {
      "author_name": "A B C Traveller",
      "author_url": "https://www.google.com/maps/contrib/116585614877993483182/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU0LsuPMTT41P4vauMG4j9XRUCYVlSapMZWfq0mk0SVBO8vzVVFDg=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "The best place that has the view of Singapore by the river. You also can find many top class restaurants at this mall. Definitely one of the places you should drop by for photos.",
      "time": 1735734766,
      "translated": false
    },
    {
      "author_name": "IGst Ayu Pt Ita Chintya D",
      "author_url": "https://www.google.com/maps/contrib/110214121644543519378/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUPLPcU8M8f097C6eZVW7Fi6vvjoxvQgFISLkydZcM99y9igt34yQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "One Fullerton is a prime waterfront destination in Singapore that offers an exceptional blend of dining, entertainment, and stunning views. Located right by Marina Bay, it’s the perfect place to enjoy a delicious meal while taking in breathtaking views of iconic landmarks like the Merlion and Marina Bay Sands. The vibrant atmosphere and excellent selection of restaurants and bars make it ideal for both casual outings and special occasions. Whether you’re looking to relax with friends or capture the beauty of Singapore, One Fullerton is a must-visit spot",
      "time": 1732577907,
      "translated": false
    },
    {
      "author_name": "Toon Tran",
      "author_url": "https://www.google.com/maps/contrib/102078641965155497930/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWZj_ozK67YD0vUUpBQSjRzrxoJndFacBNmoJa0ee-_aRn9sWCk=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "One Fullerton stands as a premier waterfront dining and lifestyle destination in Singapore, offering an exceptional blend of scenic beauty and culinary delights. Situated right at the edge of the bustling Marina Bay, this architectural gem provides breathtaking views of the iconic Singapore skyline and Merlion Park, making it a must-visit for both locals and tourists.\n\nThe dining options at One Fullerton are diverse, ranging from high-end restaurants offering gourmet dishes to casual eateries where you can enjoy a quick bite with a view. Every restaurant boasts its own unique appeal, whether it’s the ambiance, the menu, or the unparalleled view of the water.\n\nAccessibility is a breeze at One Fullerton, with ample parking and easy access via public transport. The area is well-maintained, clean, and perfectly landscaped, creating a welcoming environment for all who visit.\n\nOne Fullerton isn’t just about dining; it’s a complete experience. With its array of boutiques and specialty shops, along with outdoor seating areas where one can just sit and soak in the vibrant atmosphere of Marina Bay, it truly is a place where leisure meets luxury.\n\nWhether you’re planning a romantic dinner, a family outing, or simply a solo retreat to enjoy the beauty of Singapore, One Fullerton offers a slice of the city’s best. Don't miss out on this quintessential Singaporean experience, where every visit is memorable.",
      "time": 1730521773,
      "translated": false
    },
    {
      "author_name": "Edwin Petrus",
      "author_url": "https://www.google.com/maps/contrib/114785935323023325370/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjViVW8tEXRYc3BatiNcUhGofE27kumEgAfonPrCpL4BlwYPaqBsCw=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "One Fullerton is the part of Fullerton Hotel, Singapore. It is a two-storey waterfront development at the side of Singapore River, facing Marina Bay developments. One Fullerton offers culinary options with wonderful view of breathtaking views of Singapore city landscaping. It is also next to the world famous Merlion statue.",
      "time": 1731413511,
      "translated": false
    }
  ],
  "types": [
    "shopping_mall",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1142945310992873294",
  "user_ratings_total": 1556,
  "vicinity": "1 Fullerton Road"
}