{
  "formatted_address": "83 Punggol Central, #02-17 Waterway Point, Singapore 828761",
  "geometry": {
    "location": {
      "lat": 1.4065772,
      "lng": 103.9016633
    },
    "viewport": {
      "northeast": {
        "lat": 1.408298880291502,
        "lng": 103.9029068802915
      },
      "southwest": {
        "lat": 1.405600919708498,
        "lng": 103.9002089197085
      }
    }
  },
  "name": "OneDoctors Family Clinic (Punggol)",
  "place_id": "ChIJWfL8ouQV2jERvHmGnX_zsSA",
  "rating": 3.3,
  "reviews": [
    {
      "author_name": "Michelle Lim",
      "author_url": "https://www.google.com/maps/contrib/107650191977382784096/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKkrtd43pnJIshynAd8p4_uUs2iqSQy1xPetaj3E5yGET20bQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "My son needed a general doctor medical check list to be filled as part of sped school application. We check with them earlier in one of the visit the dr say ok and request us to print out hardcopy. However, when visit them with the hardcopy the same doctor straight away told me need half an hour and she is changing shift. She will ask her boss/ next doctor to assess. After waiting for so long the clinic assistant just mentioned cause we have not seen them since he was young so they cant filled up the form. I ask of I provide the health booklet can they filled. They ask me go back to the clinic that i always visit. I purposely visit them at 4pm their low peak period and they still dont want to entertain us at all.\n\nThe medicine they issued do work well and the diagnosis is on the spot.\n\nAt 6pm I went to OneCare Doctor at Sumang Walk, Dr. Daniel has no issue with doing the report. This is what we want to see in Doctor being empathy and for the interest of\nThe patient. NOT the interest of business owner profit.",
      "time": 1745051651,
      "translated": false
    },
    {
      "author_name": "kwek Pei Yun",
      "author_url": "https://www.google.com/maps/contrib/104704209852808266732/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI_SGnQDFmCowMp6TFQd-i8RxjkRU4X5O3d-jpR-_qE2CWvkg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "Doctor is over confidence. My dad 85 yrs old tested covid19 positive with lung issue but doc did not advise to admit A&E dispute visited the clinic twice and called the clinic once but nurse insisted high fever is normal for covid19. My dad was admitted on the 4th days and lung was severely damage after in ICU for 10 days. Regretted visiting this clinic despite I have encountered similar issue 2 yrs ago with the same doctor. Will never step into this clinic anymore",
      "time": 1738506598,
      "translated": false
    },
    {
      "author_name": "Posh Berries",
      "author_url": "https://www.google.com/maps/contrib/108906390405244180645/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKQGLZl6vW8WKA5hq5Le2CtwMMA6o8yEwaRkvrRMx0ktMzZGYA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Latest Update: 11/7/2023 - Ms. Joleen is no longer working in this clinic. Was served by Ms. Liqin who looked cold on the outside but actually she’s a very nice & lovely lady to talk to.\n\nOne Doctors Family Clinic (WP) offers great visiting experience (though no one likes seeing a doctor especially in times of COVID-19), anyway this review is about the lady nurse (Joleen) who always brings smiles to waiting & queuing patients. She’s super friendly, very caring, warm-hearted & offers sympathy to patients in need or when in distress. All other frontline nurses & staffs are also very courteous & friendly too, highly recommended to people who need to see a doctor with friendly & caring staffs. A big thanks to Joleen for showing care & concern. And congrats 👏🏻 One Doctors for having such dedicated & caring staffs!",
      "time": 1689272531,
      "translated": false
    },
    {
      "author_name": "Alicia Peter",
      "author_url": "https://www.google.com/maps/contrib/117609892065536284354/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ4ylFp4FtAHR8EWtbutPuko64k5dztgkTj4k3buOZzsQyvKQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "Please avoid this clinic at all costs. Neither the doctor nor staff know what they are doing. We called ahead of time to check if their clinic can do a jaundice check for our 4 day old newborn, and they said yes can please come down. After registering and waiting, we saw the doctor and she knew nothing about jaundice checks for newborn and was asking us questions about it instead. Appalling. If you don't provide a service, please do not say yes just to secure an appointment. Knowing we are bringing a 4 day old newborn down to your clinic, it just shows just how much the clinic cares. Would not ever step back in there again or trust them with care for my child.",
      "time": 1729909468,
      "translated": false
    },
    {
      "author_name": "R “Foodie” M",
      "author_url": "https://www.google.com/maps/contrib/111332275061978951858/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUahZdeHR-pRF6Z_vSUIVlJFOuX4D8CdgludNnOTFvehiqrOtZy=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I was looking for clinics in Punggol which are convenient and accessible and I found OneDoctors at WWP. After checking out the google reviews, I was re-considering my options. I decided to visit the clinic on 14 May on a Sunday as I was very sick. The nurse at the reception informed me the waiting time and the number of patients ahead of me upon registration. No queue number was given but I was advised to return to the clinic instead of waiting there once I receive an sms when it was my turn. I had a consultation with Dr Cathryn Cai and she was asking questions and analysing my condition. She was patient and explained about the medication that were prescribed. I re-visited the clinic on 23 May and Atiqah assisted me with the registration and my enquiries as I confirmed with her the consultation rate since I had not fully recovered. She was patient and approachable. I had a consultation with Dr Soh Wah Ngee and he was very detailed as he asked about the duration of my condition and the experience of any symptoms. He showed empathy and listened during the exam. He also explained the effects of the medicine which he prescribed.Dr Soh showed professionalism and patience. Keep up the good customer service at the nurse reception and keep it up Doctors for your dedication and professionalism.",
      "time": 1685031841,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2355931809520712124",
  "user_ratings_total": 91,
  "vicinity": "83 Punggol Central, #02-17 Waterway Point"
}