{
  "formatted_address": "151 Bishan St.11, Block 151, Singapore 570151",
  "geometry": {
    "location": {
      "lat": 1.3450131,
      "lng": 103.8558801
    },
    "viewport": {
      "northeast": {
        "lat": 1.346343230291502,
        "lng": 103.8572952802915
      },
      "southwest": {
        "lat": 1.343645269708498,
        "lng": 103.8545973197085
      }
    }
  },
  "name": "Ong Yong Lee Eating House",
  "place_id": "ChIJNTPnrBIX2jER5mFfpriLsDU",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Irene Chan",
      "author_url": "https://www.google.com/maps/contrib/109358123366037020277/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU6PxXA8rruCVZmJ_eYMjDU6n6ZaTHs5HYTiMLDn92raVr5Zic=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "We have been patronizing Ong Yong Lee for years since they open. I would have to say their dishes have improved quite a lot over time.\n\nToday’s dinner is really good. Servings are generous. The flavors are very well balance. Not too salty not too oily. We choose to dine in on a weekday to avoid weekend crowd as their weekends are always very pack. To my surprise they are pretty full for a weekday today but they are service are still fast.\n\nWe started dinner with a sumptuous Lou Hei, was pretty good, not too sweet, ingredients are bountiful & crisp fresh. Follow with a very fresh big pomfret, herbal chicken, clay pot abalone with sea cucumber, 青龙菜, braised fins with fresh crab meat, lobster porridge & round up the meal with 楊枝甘露. All the dishes are really delicious. Even the dessert is pretty decent for a Tze Char.\n\nSomething worth to mention. We usually do not order 青龙菜 as sometimes can be difficult for our elderly parents to chew. However, today Bee Sis whom runs the place recommended 青龙菜 so we trusted her recommendations as always. Oh my, it’s really fresh and yummy even my mum commented.\n\nThis year’s CNY dinner with family & friends at Ong Yong Lee is a very memorable.\n\nThank you so much for the good meal!\n\nPs: Every dish was really delicious I forgotten to take pictures for most of them. 😆",
      "time": 1738770352,
      "translated": false
    },
    {
      "author_name": "Choon Yau NG",
      "author_url": "https://www.google.com/maps/contrib/113911647940453183517/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUNpVyoo67kLkfqTLW6oe5plwGIUoxraY-CP1dJrA9mBaXbo_0=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Great spot for an old-school dining experience! The crab noodle soup was flavorful and packed with fresh ingredients – perfect for seafood lovers. Don’t expect fancy service; it feels more like chatting with a friendly uncle, which adds to the charm. If you’re here, it’s all about the food, not the frills. Definitely worth a visit if you enjoy authentic flavors!",
      "time": 1731247324,
      "translated": false
    },
    {
      "author_name": "Isabelle Tay",
      "author_url": "https://www.google.com/maps/contrib/104140455507701408773/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXwS14sC6cmx3V32vPbnuT83KC1X-6goucv3u8I-ZKsEAr2ddE1=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "8 months ago",
      "text": "2nd visit: from 3 stars to 4 stars.\nFinally tried their fish steamboat and was quite happy with it. We also added the fried taro as its was crispy and fresh! Only dislike was there were way too much cabbage inside as if they were trying to fill the space. Also ordered the harlok prawn which was really good!! Definitely a more pleasant and delicious meal this time!\n-\nFirst time trying the food here. Overall was fine, very homey taste. Also ordered their prawn paste chicken which i forgot to take picture.\n\nPrawn paste chicken was good, lala was good. Vege was average. But the mayo prawn was sooooo disappointing which is also the reason for 3 stars :(\n\nThe prawns were huge but the batter was very bad. Some parts were too thick and tasted bland. The mayo sauce was not my type either... not sure what mayoniase brand they use but it tasted like cheap mayo with alot of lemon(?). Overall taste was sour and just weird.\n\nPrice wise is still quite okay though.. maybe will go back again to try other dishes.",
      "time": 1726146621,
      "translated": false
    },
    {
      "author_name": "Allison Lim",
      "author_url": "https://www.google.com/maps/contrib/114742243745231540658/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJrtG8xJGqBBrk1I2xsbrgM7bjEgEbycRQADFUUgZPFRLvKUw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Superb cai po hor fun, nice assam fish head and steam baby sotong",
      "time": 1744586930,
      "translated": false
    },
    {
      "author_name": "Sharmaine Lim",
      "author_url": "https://www.google.com/maps/contrib/114263510459996054273/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIDXthpstrKOyykPRHa-L3qaka7zmz_k2q52IU2ppF2DwYOkQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I’ve eaten here quite a few times, never had a bad experience and food is good, price is reasonable. Just that during peak hours like weekend dinner have to wait, which is normal since everything cook on the spot. I like the beef horfun, har qiong gai, kangkong and more. Can taste Wok Hey in the food, love it! Dinner on a weekday all food came within 15 mins.",
      "time": 1742298813,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "store",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3868745705092768230",
  "user_ratings_total": 287,
  "vicinity": "151 Bishan Street 11, Block 151"
}