{
  "formatted_address": "HDB Ang Mo Kio (MSCP) #01-10, 316B Ang Mo Kio Street 31 (S)563316, Singapore 563316",
  "geometry": {
    "location": {
      "lat": 1.3646696,
      "lng": 103.8476215
    },
    "viewport": {
      "northeast": {
        "lat": 1.366136380291502,
        "lng": 103.8491664802915
      },
      "southwest": {
        "lat": 1.363438419708498,
        "lng": 103.8464685197085
      }
    }
  },
  "name": "Ong Theng Sung Dr",
  "place_id": "ChIJ60fVLOAW2jERhIUbGNFfJXg",
  "rating": 1,
  "reviews": [
    {
      "author_name": "GOH R C",
      "author_url": "https://www.google.com/maps/contrib/112663808223140092742/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL6meo5IHDNdPdPgt7Wr09YA266kc_5Rh5uSgkOcCXjevri1A=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "If can, we won't give any star, same old story same Yishun branch same Dr Ong theng Sung and same old rubbish he said :\"your stomach don't have abnormal sound, and doesn't sounds like diarrhoea\".......if base of \"sound\" can diagnose whether got diarrhoea or not, everyone also can be doctor.\nplease spend few minutes and search Dr Ong Theng Sung's reviews, is much more funny then Mr Bean.",
      "time": 1703143766,
      "translated": false
    },
    {
      "author_name": "Minnie Chong",
      "author_url": "https://www.google.com/maps/contrib/102963186390386352210/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXUKdrILWMOx7L12sUllU1aov1aTZACkuvg-LeKqWYRSzqgFrU=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "5 years ago",
      "text": "I visited him when he was on shift at the Central 24-HR Clinic at Yishun. Dr Ong Theng Sung was arrogant, unprofessional and unsympathetic. He not only insisted my condition was inaccurate but hinted that I’m making up the pain in my head. He labelled me delusional. When I headed to a specialist for a second opinion, she confirmed that I indeed had the diagnosis. Don’t bother wasting your time there, I lodged a complaint with MOH and on the Central Clinic site.",
      "time": 1579186217,
      "translated": false
    },
    {
      "author_name": "Nerissa Batungbakal",
      "author_url": "https://www.google.com/maps/contrib/100822946809061203434/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXJDoseipfWzp2u3E2KMNOcJyE1HfI_zQSsDqqw4QlBjyssWJws=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "11 years ago",
      "text": "Beware of this doctor. I went there today because I didn't have enough sleep and said it was 'insomia' but he talked down to me. He said, \"because you don't have a lot of MCs, I will close one eye\" and \"you think we are stupid stupid?\" Omg, I retorted, \"Excuse me? Then what is the explanation for this?\" I would've asked him if taking antihistamine pills (drowsy ones) are okay every time I get this but he already verbally abused. If he did not believe I was sick, he shouldn't have given me an MC. Also, he gave me pills for insomnia. How ironic. He said I did not have insomnia. I guess he really should retire because his professional advice is alarmingly contradictory.",
      "time": 1380267313,
      "translated": false
    },
    {
      "author_name": "Melina Xu",
      "author_url": "https://www.google.com/maps/contrib/114306637196135610422/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWgaIa1grNDQCusgN7HiXd-26OdVIiqcNPaFm3qZbH3Rb-800R4=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "6 years ago",
      "text": "Had an encounter with him as a locum doctor at Pasir ris Central clinic. He is condescending and thinks that people are there just for mcs  Told him about having alternative painkiller for sciatica  Guess what, he gave paracetamol.",
      "time": 1553672822,
      "translated": false
    },
    {
      "author_name": "C.",
      "author_url": "https://www.google.com/maps/contrib/106889762370136504360/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKWiU8C0V2FhTj1xOL4XvGOB1hpG-Cr2KvHJhkJj8xMXCfBJg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "in the last week",
      "text": "this should be a zero stars review for dr ONG THENG SUNG of yishun central 24 hours clinic. very unprofessional and unsympathetic doctor who 1. makes inaccurate assumptions/diagnosis as he can't be bothered to ask appropriate questions.\n\n2. he told me to lift up my shirt and pull down my bottoms without a chaperone. i had to request for one and he replied with an attitude 'if you insist'.  i clearly had upper left abdominal pain near the ribs but he checked below my belly button and lower. fyi this is not the first time im seeing a doctor for same issue so i am aware that his instructions were abnormal. i clearly stated that i was uncomfortable with his abnormal requests but him and the indian lady did not compromise and had me to follow their ridiculous instructions.\n\n3.  arrogantly claimed 'no abdominal issues' and told me to 'get out' of the consultation room when i sat down after the examination. to which i asked if he needs me to return to the room later and he snarkily remarked 'i told you to get out already so consultation is over'.\n\nbtw the moment i went in, he already spoke with an attitude. i didn't go to the clinic to be talked down to. also ironically he gave me medication for abdominal issue. a complaint will be lodged with MOH.",
      "time": 1747800547,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8657431210346907012",
  "user_ratings_total": 10,
  "vicinity": "HDB Ang Mo Kio (MSCP) #01-10, 316B Ang Mo Kio Street 31 (S)563316"
}