{
  "formatted_address": "1J Cluny Rd, Singapore 259607",
  "geometry": {
    "location": {
      "lat": 1.3168902,
      "lng": 103.8183536
    },
    "viewport": {
      "northeast": {
        "lat": 1.318209680291502,
        "lng": 103.8196642302915
      },
      "southwest": {
        "lat": 1.315511719708498,
        "lng": 103.8169662697085
      }
    }
  },
  "name": "Original Botak Jones (Botanic Gardens)",
  "place_id": "ChIJc1pO5AEb2jERT4Q4DBcb_y8",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Senna An",
      "author_url": "https://www.google.com/maps/contrib/107100113993608617770/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVV-uojarYoYUTRCV1DshnmAIfNxtopmgb0ltc4De19O2inQhBA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Price might be a little bit high but the quality, the portion and satisfaction is definitely there!\n\nThe portion is huge. Love their cheese potato pudding and salsa.\n\nThe burger is one of the best in town.",
      "time": 1737883642,
      "translated": false
    },
    {
      "author_name": "Ram",
      "author_url": "https://www.google.com/maps/contrib/113247703719564015453/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIW-Zz0ewODwQ0nussKr_OSge6KBKog0v-uYI0PX_FX2ygRFw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "7 months ago",
      "text": "We were having our evening walk at Botanic Gardens and decided to have our dinner at the Sprouts Food Place.\n\nLuckily for us, the place was air-conditioned, and after walking for a bit, we definitely needed it.\n\nThere were a few stalls, and the one that I was keen to try was Botak Jones, I've been hearing it growing up but never had a chance to try it, so finally, this was it.\n\nThey had good options on their menu, and it all sounded nice, but we stuck with the safe choice of Fish & Chips and the Cajun Chicken (both came with 2 sides)\n\nPrice wise, it was reasonable and not too far off from something you'd find at Botanic Gardens.\n\nOrdering the food was simple via the kiosk, and the food came not too long after.\n\nI ordered the Cajun chicken with the sides of the Cajun fries & and coleslaw ($10)\n\nMy partner had the Fish & Chips with the sides of Cajun fries & Double Baked cheese potatoes ($17 since we topped up for the Cheese Potatoe)\n\nThe first thing that impressed us was definitely the portion, and it was definitely quite big. Actually, we could share just the fish and chips between us.\n\nThe 1st thing we tried was the Baked Cheese Potato, and that was definitely nice, especially when it was hot (you can taste the chunk of potato inside as well), so I'd recommend that\n\nThe coleslaw was fresh, not the kind where you find at those fast food outlets.\n\nWe loved the fries as well, crispy and thick. Given the portion alone, it was filling.\n\nNow for the fish and chicken, it was pretty decent, nothing much to shout about. Cooked well, and given the portion of it, it was definitely worth it.\n\nNot bad for my 1st try of this joint. I might try the steak next time around.\n\nOf course, getting to place, if you were to drive, it'd be easier, but walking in definitely takes time. Will try again if we're nearby.",
      "time": 1728016043,
      "translated": false
    },
    {
      "author_name": "Erin Lin",
      "author_url": "https://www.google.com/maps/contrib/105119472362592456108/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXiRGtf_a6ULRc8txB2XFsDoBMu-1QmYTnxjO7wE1IfcPz7nQKCbQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Food portions are huge and reasonably priced. This place probably also serves the cheapest coffee you can find in an aircon environment.",
      "time": 1747027074,
      "translated": false
    },
    {
      "author_name": "Shing Low",
      "author_url": "https://www.google.com/maps/contrib/100909888758969919559/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIJbem6IRzBg9ho0nkDmqc6SabN-OEtQ_TLdr8hq4LOEb2XXA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Nice area for meals in aircon. comfortable seats. Nice furniture. Good service from Botak Jones female staff. Recommended. Both the chicken meals are really yummy.",
      "time": 1732537602,
      "translated": false
    },
    {
      "author_name": "Christopher Koh",
      "author_url": "https://www.google.com/maps/contrib/104262271032362286480/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUstsDVbUVJ6o8yXCDaj_6cZdBcWjXakXMhNe4G1aRIey6TrJVG=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 2,
      "relative_time_description": "9 months ago",
      "text": "First time eating Botak Jones in almost a decade. Tried the breakfast omelette.\n\nIt was hands down outright awful at $17 for the cheese omelette and an extra side of baked beans.\n\nThe omelette egg portion was flavorless and had the consistency of eating a foam or sponge mat - springy and airy with nothing else to it. The tater tots were over-fried. The side of baked beans were cold, suggesting they came straight out of a can for $3.\n\nThe ordering system also messed up. I made payment via the automated counter, but it didn't register on their kitchen order side. After 10 min I asked about it to discover it wasn't reflected, so all in the order took almost half an hour for a disappointing meal.\n\nThe upside is that the environment is pretty and relaxing, and the staff at Botak Jones was really trying. Didn't help my meal much though.",
      "time": 1723947716,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3458512824647058511",
  "user_ratings_total": 62,
  "vicinity": "1J Cluny Road"
}