{
  "formatted_address": "8, Sinaran drive #01-05/07, Outside of Oasia Hotel, First floor corner unit, Singapore 307470",
  "geometry": {
    "location": {
      "lat": 1.3202264,
      "lng": 103.8449678
    },
    "viewport": {
      "northeast": {
        "lat": 1.321609730291502,
        "lng": 103.8461738802915
      },
      "southwest": {
        "lat": 1.318911769708498,
        "lng": 103.8434759197085
      }
    }
  },
  "name": "Otter & Pebbles",
  "place_id": "ChIJfUyARtIZ2jERCPS5DyTXLDs",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Mok Siewhui",
      "author_url": "https://www.google.com/maps/contrib/104330681002100385069/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLB5BlrZrJ-D99AeULGZk3AQmh5XR2yoc8upn-J1S6NP62Rx1w=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "This cafe is located next to Oasia Hotel, making it easy to find. Nice environment Relax and chill. The environment is perfect for relaxing and chilling and the staff are incredibly friendly.\n\nThe food was delicious and met my expectations. I highly recommend the Truffle Burnt Cheesecake with Ham. It is a unique combination of flavors that really stands out!\n\nI also tried fried avocado for the first time. I usually do not like to eat avocado but this one was surprisingly good. I absolutely loved the fried avocado.",
      "time": 1743662229,
      "translated": false
    },
    {
      "author_name": "Billy Cheng",
      "author_url": "https://www.google.com/maps/contrib/111053164897173159555/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWm3dLAWwNiJqXROeyb0gIiQWd7X8BkF1es5ky98T25-JUlE222=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "I love it! The decor and and atmosphere is so comfortable and relax. I love their branding, the otter logo is very adorable. The food is tasty and served quite fast except for the Dutch pancake that had to wait for 30min. Highly recommended their Udon. The udon and the soy milk broth are fantastic, makes me wanna order another bowl. The matcha original and matcha strawberry are nice and good too!",
      "time": 1745560696,
      "translated": false
    },
    {
      "author_name": "Pamela Lam",
      "author_url": "https://www.google.com/maps/contrib/101857651194332817338/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWk2_KXGCVRLYB87_nGQcC5OQesYfYr_McUXXv1clR3tt4H1L-h=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Lovely Japanese-themed café, located just outside Oasia Hotel and easily accessible from Novena MRT Exit A.\n\nFood-wise, the menu has 4 main categories - dutch baby pancakes, ochazuke, udon, and souffle pancakes. I loved the salmon soy milk udon -  the broth was so light and fragrant and pairs well with the mentaiko and butter at the side. My friend ordered the mentaiko udon and it was so creamy and delicious too! We shared a truffle fries, a cup of matcha latte & soufflé pancakes which was great as well. Spent about $90 - for the quality and quantity, it’s quite worth it😊",
      "time": 1743219637,
      "translated": false
    },
    {
      "author_name": "MH Tham",
      "author_url": "https://www.google.com/maps/contrib/112376174358198242550/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXJ4tOLbvkkJYRe2LZw4PmTrCsbezMPVke50H01b6T0gSd095fp=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Charming cafe with a unique theme and is great for chilling the afternoon away. The menu favours nutrition, and blends Japanese flavors with unconventional ingredients, though the fusion may take some getting used to.\n\nWe chose the pet-friendly outdoor seating, which was appreciated, but the pebbled floor might take pets some time to adjust to. Outdoor furniture is a bit stiff and tables small, but overall a spot I will recommend to fellow pet owners.",
      "time": 1743075115,
      "translated": false
    },
    {
      "author_name": "Ana Maritza Garrido",
      "author_url": "https://www.google.com/maps/contrib/111784466342502502654/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXIrA8CiuEmZj5dEI1ynbhB_mtPTC_qdkGug4SKBMu9o9jZs8ML=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "The staff at Otter and Pebbles could not have been more kind or helpful. I have very complex dietary requirements, so I am always hesitant before trying somewhere new to eat, however, the wait staff here were very helpful in speaking to the chef regarding ingredients in different dishes, showing me the ingredients of certain products they use (e.g.: oat milk), and allowing me to design my own basic dish. The food on the menu looks delicious, however, it is far too complex for my current dietary needs. As well as this, I had a matcha which was delicious and quite strong! I would definitely recommend but maybe not in the evening.\n\nThe venue is small but welcoming, with an aesthetic that I found relaxing and visually pleasing. The design of the restaurant is well thought out down to the cutlery, dishes and cups. It is a good place to catch up with friends or have a coffee and read, relax, work or study alone.\n\nThe only qualm I had on my trip is that the air conditioning was on far too cold for me, however, I did not take this up with the staff so I am not sure if this is adaptable and I was fine once I put on a thin jacket. Another fact is that the bathroom is not in the venue directly, but you have to go outside and into another part of the building, which can be inconvenient.",
      "time": 1744903753,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4264019497095656456",
  "user_ratings_total": 176,
  "vicinity": "8, Sinaran drive #01-05/07, Outside of Oasia Hotel, First floor corner unit"
}