{
  "formatted_address": "Outram Rd, Singapore 169037",
  "geometry": {
    "location": {
      "lat": 1.2814435,
      "lng": 103.8391367
    },
    "viewport": {
      "northeast": {
        "lat": 1.28412995,
        "lng": 103.8417345
      },
      "southwest": {
        "lat": 1.27712775,
        "lng": 103.8359621
      }
    }
  },
  "name": "Outram Park",
  "place_id": "ChIJaRyBB3IZ2jERiBztojttuT0",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Gayan Chathuranga",
      "author_url": "https://www.google.com/maps/contrib/115580882753025627106/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXSpetjxzaR-bYNfHedxX3hWZFWCxb1ZELukSNtoMk26_1hWOaJHw=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Outram Park MRT Station is a major transport hub in Singapore, offering seamless connectivity between the East-West (EWL), North-East (NEL), and Thomson-East Coast Lines (TEL). The station is spacious, clean, and well-maintained, reflecting the efficiency of Singapore’s MRT system.\n\nWhat stands out is the clear signage and accessibility features, including elevators and escalators, which make it easy for everyone to navigate. It’s also conveniently located near key spots like Singapore General Hospital and Chinatown, making it a great starting point for exploring the city.\n\nDuring peak hours, it can get crowded, but the trains run frequently, so the wait is minimal. Overall, a fantastic and essential MRT station that enhances commuting across Singapore!",
      "time": 1735361086,
      "translated": false
    },
    {
      "author_name": "Luke",
      "author_url": "https://www.google.com/maps/contrib/110051069223982775552/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU_QbE1cQfj-eOhvKz6VELcteXb2kxzxwpI9qRzFf4KGQ3Ux2B-=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "This is a big interchange, encompassing 3 lines at the time of writing. (East-West Line [Green], North-East Line [Purple], Thomson East-Coast Line [Brown]) Near this station is mostly just residential and the Singapore General Hospital (SGH). It is also near Cantonment Primary School. Train signs are helpful, but you might still get lost as the station has a lot of passageways and people. Air-con is ok. The station is quite clean and wide.",
      "time": 1743778735,
      "translated": false
    },
    {
      "author_name": "Genta",
      "author_url": "https://www.google.com/maps/contrib/117016178934992842533/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW8t7xK4a_YghQKADughmJgcm50hVTbRIIDhSYIjd8eAi5Jcaxkwg=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "As a bustling transportation hub, Outram Park MRT station serves as a gateway to various parts of the city. Its expansive layout and multiple interchange options make it a convenient transit point for commuters traversing Singapore's urban landscape. Whether I was exploring the vibrant streets of Chinatown or seeking adventure in the bustling city center, Outram Park MRT station provided a seamless and efficient means of getting around.",
      "time": 1712510189,
      "translated": false
    },
    {
      "author_name": "Little Lunalis",
      "author_url": "https://www.google.com/maps/contrib/108940426021814606386/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVVbnYmGFbDTU2qUy6z5T8ZRzRkfjexB-9jypb-qGLmu1kk46ne=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "I was feeling light headed with cold sweats on the train so I stopped by the station's bathroom. I was in there for probably 10 minutes because of an upset stomach, this was around 2pm, when I heard yelling outside the cubicle followed by constant sounds of the air dryer going off like someone was doing it on purpose. After I was done and got out, I realize the old lady cleaner was waiting for me to leave so she could clean the bathroom but she had a really bad attitude about it. She commented in chinese that I can take my own sweet time but she can't. Kind of appalled by what she said and took me off guard considering I was there before a cleaning sign was up and there were other people in the bathroom when I entered.\nI think she thought I was on the phone or something? Either way I felt like she could've just been more patient and waited or started with other bathrooms if she knows there's someone in there doing their business. Sorry, but I didn't choose for my body to almost black out on the train due to a stomachache 😂",
      "time": 1741966299,
      "translated": false
    },
    {
      "author_name": "Javen Leow",
      "author_url": "https://www.google.com/maps/contrib/103533744765056843646/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWTLUpcDbqWof7KrapjPymL5t189mndtX6g4MyUOGkEK0KueC3_=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Convenient interchange station between the East West Line, the North East Line, and the Thomson-East Coast Line.\n\nBefore the Thomson-East Coast Line opened, transferring between the East West Line and the North East Line used to be a terrible hassle, but as travelators were installed to connect the two lines (when the Thomson-East Coast Line was under construction), this is no longer the case (unless if the travelators break down of course).",
      "time": 1669127615,
      "translated": false
    }
  ],
  "types": [
    "subway_station",
    "transit_station",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4447706209909021832",
  "user_ratings_total": 233,
  "vicinity": "Outram Road"
}