{
  "formatted_address": "33, Jalan Eko Botani 3/4, Taman Eko Botani, 79100 Iskandar Puteri, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.438148,
      "lng": 103.6193344
    },
    "viewport": {
      "northeast": {
        "lat": 1.439528230291502,
        "lng": 103.6206437802915
      },
      "southwest": {
        "lat": 1.436830269708498,
        "lng": 103.6179458197085
      }
    }
  },
  "name": "Oven & Fried Chicken",
  "place_id": "ChIJ8cN9P9IL2jER4QQBAyOeXH0",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Gator",
      "author_url": "https://www.google.com/maps/contrib/114331842318070680564/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUf5N0YPQocYYralVhzxgKqHfnlJgSiXhs54DUya0oFIumc-54QVA=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "10 months ago",
      "text": "Chanced upon this restaurant while looking for something to eat at 9pm plus. It said open till late outside but never mentioned the time. Anyway, went in and ordered take-away. Inside, the restaurant was spacious and the server gave me a menu to look through. There were quite a number of food items but since I’m taking out, chose something more easy. Ordered the soy fried boneless chicken. I ate them after I got them from the server. The portion was generous. Chicken was crispy and coated with a very nice sweet soy sauce, similar to the ones I had in Korea. Now that I know that it’s open till late, probably will visit soon to try out the other dishes. Oh yes, they gave out plastic gloves for patrons to eat their chicken easily. Good gesture!",
      "time": 1720723075,
      "translated": false
    },
    {
      "author_name": "Jonathan Tan",
      "author_url": "https://www.google.com/maps/contrib/111596953680041808085/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIIG4JAJouvUf2SVPvjnt6T9huOCAwYpWTpV-nyP1TnqWVNPA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "The chicken is cooked to order and it’s definitely worth the 30 mins wait!\n\nThe sweet and spicy chicken was my wife and my favorite whereas my two kids loved the original baked!\n\nConsidering that this is a baked chicken place, the other dishes were also very nice and i would definitely order them again!\n\nOverall a nice place for chicken and beer!",
      "time": 1728051736,
      "translated": false
    },
    {
      "author_name": "Vaansi M",
      "author_url": "https://www.google.com/maps/contrib/106719410651893162044/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXnL7vOWWk2YQg1XnBlzMMU4uPZ9ueHnTajeTjRAiW4blbaO2ZTBA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "10 months ago",
      "text": "Personally I find the menu was kind of limited.\n\nBut I loved their oven fried boneless chicken thigh, it was juicy. Cheese ramen was normal nothing exceptional.\n\nGimbap was good. Service is fast too",
      "time": 1721313356,
      "translated": false
    },
    {
      "author_name": "Dee",
      "author_url": "https://www.google.com/maps/contrib/117281612188800814525/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK5kTNjihmKLXrroyz1l2lnLSJduRqLUO8SVR0l0jKeRWsUHw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "8 months ago",
      "text": "We came to this establishment on a Sunday evening at about 7pm. There was a small  crowd. Food was extremely slow and other tables were served their OFC before mine. When I ask lady boss for my order she had to walk over to the kitchen staff to highlight our table was fuming mad as food arrival was slow. She asked if we ordered chicken and if so they would need a longer time to bring our food to the table. What a joke, we ordered kimchi fried rice, Jampong noodles and Jajangmyeon too - I don't see them arriving. What is worst other tables who came in later have already got their food (chix) first. Whilst we were waiting for our food, man boss tried to take away our baby chair for other tables. I had to notify him I have 2 kids here ya. He replied saying he thought I was done with our meal. What a joke as well. He was walking around actively and observing the restaurant and he didn't notice our food didn't arrive after a long wait. He was going around talking to customers and probably introducing his restaurant's food but he didn't notice customers' annoyed face - they would like to have their privacy 😅 There were a lot of waiters around, who will warmly greet you when you enter the restaurant. It wasn't a good experience for me at all despite having 2 bosses supervising the restaurant with a lot of waiters. The only consolation is their delicious oven fried chix. Though not authentic, their Jampong and Jajangmyeon were curated more for msian taste buds. It was nevertheless yummy. When I see the complimentary side dish - pickled radish - I almost want to cry. Portion was small and seemed to be further cut into tiny pieces. Are you trying to save cost? Not that we are here for complimentary radish but it was so pathetic that you might as well don't serve it..",
      "time": 1726550360,
      "translated": false
    },
    {
      "author_name": "Winnie faner",
      "author_url": "https://www.google.com/maps/contrib/115650643859517505267/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUQMTKuQgMOyQZvgsqoWeXRqAjnc1esZidi2-Rf_vQfSEuSkPJObw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Is my second time here. The food here is really delicious 😋The staff here also well trained, the one who come and take our order, didn't jot down anything but can repeat our order all correctly 👍\nVery recommended, kudos to the staff",
      "time": 1731751005,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9033268825809814753",
  "user_ratings_total": 284,
  "vicinity": "33, Jalan Eko Botani 3/4, Taman Eko Botani, Iskandar Puteri"
}