{
  "formatted_address": "81 Pasir Ris Heights, Singapore 519292",
  "geometry": {
    "location": {
      "lat": 1.3809575,
      "lng": 103.9419055
    },
    "viewport": {
      "northeast": {
        "lat": 1.382890830291502,
        "lng": 103.9431409302915
      },
      "southwest": {
        "lat": 1.380192869708498,
        "lng": 103.9404429697085
      }
    }
  },
  "name": "Overseas Family School",
  "place_id": "ChIJ9xWcR44Z2jERVoxBJE_XLx8",
  "rating": 3.9,
  "reviews": [
    {
      "author_name": "Li Lo",
      "author_url": "https://www.google.com/maps/contrib/108629516583214094098/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX58IbjCbcvJzHa2uEJs7YKMavKmUq0tbmPnyuz6IF9tq50Sili=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I would say this school is amazing, from their admins to their teachers: Ms. Yovita, Ms. Lyn, Ms. Angie, the mid-school principle, and all teachers. They are really paying attention into details, especially about each student's guardianship.\nOFS cares and gives opportunity to every new student who would like to join the school without need to wait or being wait-listed, which I think that will be a waste of time if your children need to wait without knowing when they will be avail to enroll. Every second is matter to absorb as many education as possible (correct me if I am wrong).\nWhat I like most about the school is their facilities / all facilities are top notch but my input for OFS is you should build indoor basketball courts (OFS if you read, pls upgrade 2 semi-indoor courts to indoor by using carpet / no need wooden floor nor air-con, just install huge ceiling fans).\nAdditional info, parents can follow the students daily learning activities and what is next for agenda from online.\nThe school also offering free of charge after school or lunch break programs to nourish their students. They also offer paid after-school programs with professional instructors.\n\nFrom my son, he said that time flies in OFS because the friends and teachers are fun. He gets bored once home. He loves canteen foods especially pizzas.\n\nAll in all, I would recommend this school to my friends and relatives if they would like to search for an International school in Singapore.\nLove their layout as well because the school hallway and canteen air is always fresh and cooling even tough no air-con is used.",
      "time": 1739763597,
      "translated": false
    },
    {
      "author_name": "Claudia Vinciguerra",
      "author_url": "https://www.google.com/maps/contrib/114797341159925060191/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLxlRm1J4pij8e4bOUPcj073muTqdIQLumfAnAAgsV-YzlOyA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Today, as always happens at the Overseas Family School, there were great celebrations for the Lunar New Year.\nFantastic performances and delicious food.\nAt OFS, we truly believe in creating a united community through the celebration of different cultures.\n\n(Previous post)\nAt OFS, in addition to excellent teachers and cutting-edge school buildings, students also enjoy a welcoming and stimulating environment where they can study in peace. Highly recommended",
      "time": 1738919170,
      "translated": false
    },
    {
      "author_name": "Yuxin Wang",
      "author_url": "https://www.google.com/maps/contrib/104216077967219838065/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUI8qujwwbWyIrddIZ1Hpxq1k-p_TPbXzahTEI9ERIYQykzYTzT=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "BEST SCHOOL EVER!!! this school may be expensive but still they treat us very respectfuly and kindly we may have alot of stress during exam week but there will always be people who supports you alot its such a vibe here with friends and it feels very safe",
      "time": 1743533332,
      "translated": false
    },
    {
      "author_name": "Ben Dover",
      "author_url": "https://www.google.com/maps/contrib/117526589949305874165/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVFkW3x3eE5SbJULDeuF_Zj5qGv0uy9ZDqob-CZIb0ZS6DSqjc=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "Trash school. Dont do french. Have to make essay/brochure every week. They dont do anything about bullying. Saw someone vaping and they didnt care. Have seen students choking each other until face is red. DONT COME HERE",
      "time": 1739598012,
      "translated": false
    },
    {
      "author_name": "Emma C",
      "author_url": "https://www.google.com/maps/contrib/102614329244699007436/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIkfs_wgM4UFCE2Kt4_dmzYLUF-yAqBppsh12zwy3g1KM7x8ZrR=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Overseas family School has surpassed our expectations. From the efficiency of the admissions team, the quality of teaching, state of the art campus facilities and friendly fans helpful staff. OFS have nurtured my children in an inclusive and diverse environment, providing exceptional opportunities for them to thrive. I would wholeheartedly recommend.",
      "time": 1726581007,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2247251473991830614",
  "user_ratings_total": 165,
  "vicinity": "81 Pasir Ris Heights"
}