{
  "formatted_address": "820 Thomson Rd, #06-70 Medical Centre D, Singapore 574623",
  "geometry": {
    "location": {
      "lat": 1.341934,
      "lng": 103.8378186
    },
    "viewport": {
      "northeast": {
        "lat": 1.343283530291502,
        "lng": 103.8391835802915
      },
      "southwest": {
        "lat": 1.340585569708498,
        "lng": 103.8364856197085
      }
    }
  },
  "name": "Oxford Orthopaedics (Mount Alvernia)",
  "place_id": "ChIJI_CaBCUX2jERHRYz32XbtGU",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Victoria Anne U",
      "author_url": "https://www.google.com/maps/contrib/108628634138640337908/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUuozilH3cmgDK59tBI01akiJHMZ0AzOVnhYQxPS5m3fYFN0x_Q=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Being in healthcare, I found out about Dr James Wee through my routine ward work.\n\nI had the privilege of being an insider - I get to observe his patient care, read his reports and observe the after op care of his patients. One thing I notice about ALL his patients, is that NONE of them complain of pain post-op.\nHence, I decided to seek a second opinion.\n\nNo regrets!!\nDr James Wee is amazing!! He’s extremely patient and he really takes his time to explain thoroughly what was happening to my knee.\n\nEventually I got my ACL reconstruction done under him, and like he promised, it was a routine operation without surprises!\nHe’s is straight forward to the point and doesn’t focus too much on building excessive PR - which is what I appreciate!!!\n(I dislike doctors that spend more time on PR rather than treating their patients)\n\nYou can expect a consultation with Dr James to not just be fun, but incredibly robust - he explains the diagnosis from head to toe, and elaborates thoroughly his intervention methods, quoting various studies and protocols.\n\nPost-op wise, most (or in fact all) of his patients discharge the following day. Post op instructions are clear and straightforward, and medications are generous.\n\nOverall it was a very well structured, straight forward  organised experience.\n\nA HUGE bonus for me was his incredibly team of clinic staff.\nThey are so responsible and thoughtful, and incredibly organised.\nEvery appointment to date, they’re always smiling, welcoming me with warmth and joking with me through my nonsense and melodrama 😂😂. Appreciate all your efforts and care!!!!!\n\nThank you so much errbody!!!!!!!!",
      "time": 1742817147,
      "translated": false
    },
    {
      "author_name": "Jer Ttj",
      "author_url": "https://www.google.com/maps/contrib/110399077205822292121/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWXKyA_JZE-w0MZcxktK_2MJ8qblf41Gsww2eesrXbV6dhvDUS-0Q=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "I recently had the pleasure of being seen by Dr James at Oxford Orthopaedics and I cannot speak highly enough of him. Dr James has a calm and reassuring presence, which put me at ease right away.\n\nDuring my appointment, Dr James was incredibly attentive and really took the time to listen to my concerns. He asked thoughtful questions and took a detailed medical history, which made me feel like he truly cared about my well-being. When it came time to explain my diagnosis and treatment options, Dr James did so in a way that was easy to understand and helped me feel confident in the plan we developed together.\n\nThroughout the consultation, Dr James continued to be a great listener and was always available to answer any questions I had. He was patient and supportive every step of the way, which made a huge difference in my overall experience.\n\nOverall, I would highly recommend Dr James to anyone looking for a compassionate and skilled orthopaedic specialist. He is truly one of a kind and I feel lucky to have had him as my doctor.\n\nThank you, Dr James, for all that you do!",
      "time": 1681899530,
      "translated": false
    },
    {
      "author_name": "Fabian Low",
      "author_url": "https://www.google.com/maps/contrib/114116333818209941080/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJm8-9ysVXmdN6y_N4z9Sum0LRxfe4eVM2p2Xry2hE2Gx4URp0=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I cannot express my gratitude enough for the exceptional care and expertise provided by Dr. James and his remarkable team. I recently faced knee and ankle injuries that left me anxious and uncertain about my future mobility. Dr. James not only put my fears to rest but also guided me with unwavering confidence and compassion.\n\nFrom the very first consultation, Dr. James exhibited an extraordinary depth of knowledge and an incredible ability to explain complex medical matters in a way that I could easily understand. His commitment to exploring every possible avenue for treatment was evident, and he left no stone unturned in ensuring that I received the best advice and solutions for my injuries.\n\nWhat truly sets Dr. James apart is his surgical skill. I underwent surgery for both my knee and ankle, and the outcomes have been nothing short of miraculous. His steady hands and precision have given me a new lease on life, and I am on the path to recovery with newfound hope and optimism.\n\nMoreover, the support staff at Dr. James' practice deserves accolades of their own. Their warmth, professionalism, and dedication to patient care have been instrumental in making every step of this challenging journey more manageable.\n\nI wholeheartedly recommend Dr. James to anyone seeking top-notch orthopedic care. He is not just a doctor; he is a true healer who has transformed my life for the better. Thank you, Dr. James, and your wonderful team, for your unwavering commitment to patient well-being.\n\nWith immense gratitude,\nFabian",
      "time": 1695661799,
      "translated": false
    },
    {
      "author_name": "Jeslyn Ng",
      "author_url": "https://www.google.com/maps/contrib/101918916539881502264/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL5f33BYVoZm7ypqtR6AbNnGN6XBDiFtsr4ZnG8k7GxrJNR1A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Doctor James Wee is a very friendly, approachable, knowledgeable & always reassuring my body condition.\nWaiting time for appointment is also not as long, nurses in clinic is approachable & efficient :)",
      "time": 1696406021,
      "translated": false
    },
    {
      "author_name": "nine Nine",
      "author_url": "https://www.google.com/maps/contrib/103329892585490550710/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV_ZkblkvZ0dZH8zbAgpVlAuW9VJKSIO6aX_SVT0EriOHmeCi4l=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "A very comforting and profesional team. Dr Wee is a super good doctor who know his stuff very well. The beautiful staff there is truly helpful too! Thank you so much!",
      "time": 1683709875,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7328723724221486621",
  "user_ratings_total": 19,
  "vicinity": "820 Thomson Road, #06-70 Medical Centre D"
}