{
  "formatted_address": "96 Somerset Rd, Singapore 238163",
  "geometry": {
    "location": {
      "lat": 1.3009188,
      "lng": 103.8377695
    },
    "viewport": {
      "northeast": {
        "lat": 1.302116930291502,
        "lng": 103.8391222802915
      },
      "southwest": {
        "lat": 1.299418969708498,
        "lng": 103.8364243197085
      }
    }
  },
  "name": "Pan Pacific Serviced Suites Orchard, Singapore",
  "place_id": "ChIJ3w_cJpEZ2jERA6SulPiZREo",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Kelly Aw",
      "author_url": "https://www.google.com/maps/contrib/113074700566329805920/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLkJfe_L7o61SpRKm6K68hE00R5lLX5uoBWnclcn-KZmJEF5w=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "3 months ago",
      "text": "Booked a 2 bedroom suite and stayed for a week. Location is great! service staff at the reception were very helpful and friendly. But few points that the hotel might want to note and improve on…\n\n1. It would be nice if the housekeeping could empty the clean dishes from the dishwasher after they have made up the room.\n\n2. Noise is a problem here. My unit is all the way in a corner yet I could hear the lift door ding, kids crying next door, people talking outside… sound proof is really poor here. I felt like I was in a cheap hotel\n\n3. Air conditioning is pretty lousy. Temperature was always set at 23.5 degrees but during some parts of the night, the temperature could go down as low as 20 degrees and some parts of the night could go up to 25 degrees. Tried asking the technician for help but he said it’s like that. Nothing much could be done. It’s weird",
      "time": 1738503710,
      "translated": false
    },
    {
      "author_name": "Michael",
      "author_url": "https://www.google.com/maps/contrib/117980642132420899197/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUh_g8KRGgUpo0TcOSd6uJ9-365Ljs6upPlvwmqxxc2-8e6wTfy=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "4 months ago",
      "text": "During the booking process, I provided details about the occupants: three adults and one child. Despite this, I was only advised to reserve a one-bedroom suite. Upon arriving at the serviced suites, we discovered that the booked suite could only accommodate three people. This meant our child would have to sleep on the king-size bed with the parents for the next eight nights.\n\nI raised this concern with the booking manager, but the only option was to upgrade to a two-bedroom suite at my own expense. Ultimately, I escalated the issue to management, and within 24 hours, we were upgraded to a two-bedroom suite.\n\nWhile I appreciate that the upgrade was arranged, the entire experience was unpleasant and stressful. It was disappointing that it took so long to resolve the issue, but in the end, I am grateful for the assistance we received from Pan Pacific Serviced Suites Orchard, Singapore. Thank you.",
      "time": 1736382457,
      "translated": false
    },
    {
      "author_name": "Christopher Johanning",
      "author_url": "https://www.google.com/maps/contrib/105347622706349999999/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLe84Okl4Ql212hXdAXbqC0hLFTtywwgcy9Z17zTDoo9KHk0Q=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "We have a 1br service apartment for 30 days\n\nLocation: 5* - Excellent, right in the heart of Orchard, several malls, dozens of food options, MRT stop and buses.\n\nBreakfast: 5* - Included, moderate quantity of options but food is rotated and is very solid. No breakfast on Sunday. Able to work from here during the day. Light Snacks/water/coffee available through out the day.\n\nRooms: 4* - Good size for 2 people. Rooms in decent shape, maybe halfway between brand new and in need of a renovation, only minor scratches/markings. Clean, includes washer and dryer. Been a week and still can’t figure out how to connect devices to the TV. Not great soundproofing through the entrance door but we didn’t have any problems.\n\nLounge: 2* - 11th floor lounge looks pretty but we fast found out it is always freezing and AC blasting. No practical workspace/station but does have a conference room you can book for 2 hours included each day. Bring the temperature up to 24-25*, add a couple workstations and this is now a 4-5 star lounge.\n\nFitness Center: 3* - Average. Fairly small for a hotel gym, but it does the job.\n\nPool/Deck : 2* - Unfortunately pool is just too cold, hardly ever see anyone in the pool. No view. Could be good doing laps. Only a small section of the deck gets sun, can get very windy.\n\nSpa: 4* - the hot bath is the highlight. Also has a cold pool and steamroom.\n\nService: 4* - Friendly, helpful. Nothing extraordinary to merit 5* but no complaints.",
      "time": 1739100703,
      "translated": false
    },
    {
      "author_name": "Simona Kvašňovská",
      "author_url": "https://www.google.com/maps/contrib/109516546673264683571/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKJjiOG1XNqqnHzNROhUztaEUh0jIoSd9rqHOAR8QRHZPE2hQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Pan Pacific Serviced Suites Orchard was the place we chose to call home for our 3,5-month stay (from May to September) in Singapore , and we couldn’t have made a better choice. We were in Singapore for my husband's business trip, so I and our little 1.5 year old son spent a lot of time at the hotel. What is most important, our son didn't miss anything, if we had any request for a cot, a chair was granted to us.\n\nThe location is excellent, in the heart of the busiest Orchard Road, very close to MRT, so it’s very easy to explore other parts of Singapore from Somerset station.\n\nWhat really stood out, though, was the excellent service from the hotel staff. Their warmth and professionalism made our experience truly exceptional. During those 3,5 months in Singapore, every interaction with them made us feel at home and we just can't thank them enough for that.\nThe staff at breakfast created a unique atmosphere, we looked forward to breakfast every day. They were also very kind to our little son Tomáš. Lueda always entertained our son and Emile made sure that son had his favorite yogurt and fruit, the rest of the breakfast team was great too. Thanks also to the staff at the reception. Alyson was always waving at our son and he was jumping with joy in the stroller, as we walked past the reception desk.\nWe will remember this hotel and the staff for a long time, I look forward to telling our son about our stay in Singapore when he is older. We have beautiful memories of our stay in Singapore.\n\nGreetings to all hotel employees from Slovakia.\n\nSimona, Marián and Tomáš",
      "time": 1733688813,
      "translated": false
    },
    {
      "author_name": "Kelvin",
      "author_url": "https://www.google.com/maps/contrib/113975097663731462291/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXJ_TF3gZaAvnS1lxja0L1JaMBFcWb1VrOpokmPgK8GrtzX7miz=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "The best hotel apartment for stay in terms of rooms, spacious rooms, very good facilities and the location is very close to everywhere in Orchard, the staff service is extraordinarily good. I have stayed at dozens of hotels / apartment in Singapore but this is the best place for stay if you are looking for a spacious and clean room. ⭐️⭐️⭐️⭐️⭐️ very satisfied",
      "time": 1731984242,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5351571550148404227",
  "user_ratings_total": 280,
  "vicinity": "96 Somerset Road"
}