{
  "formatted_address": "700 W Coast Rd, Singapore 608785",
  "geometry": {
    "location": {
      "lat": 1.318735,
      "lng": 103.7426484
    },
    "viewport": {
      "northeast": {
        "lat": 1.320285680291502,
        "lng": 103.7440376302915
      },
      "southwest": {
        "lat": 1.317587719708498,
        "lng": 103.7413396697085
      }
    }
  },
  "name": "Pandan Reservoir Park",
  "place_id": "ChIJMdSL4qQa2jERUTf11hFg0Gs",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "C",
      "author_url": "https://www.google.com/maps/contrib/108121427451405924195/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUVEFBMqVdde84YgM7RmJUjTlK2YyphjppNJiT0NgrZFZyAG6RYYA=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Pandan Reservoir Park in Jurong offers a serene 6 km loop trail around its calm waters, perfect for jogging, walking, or cycling. I wouldn’t call it a park in the traditional sense, but it’s a great trail for those looking to get some exercise in a peaceful setting.\n\nWhile the path lacks shade, visiting during early mornings or late afternoons makes for a more comfortable experience. It’s also great for catching the sunrise or sunset, with beautiful open views across the reservoir. Amenities are limited, so bringing your own water is advisable. Benches along the trail offer spots to rest and enjoy the open surroundings. A solid choice for outdoor enthusiasts!",
      "time": 1739685108,
      "translated": false
    },
    {
      "author_name": "Mohan Raj",
      "author_url": "https://www.google.com/maps/contrib/108804241722328310328/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVTzI7rGClt_S-UJAzT0PAPzULnvjjzNwtozrcxLMxtewGTXFudmg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Beautiful lake followed by a 6km walking path to relax ourselves and enjoy the beautiful scenery in the evening and Night time.\n\nYou will get a Positive Vibes, Best place for chitchat, Making Photographs.",
      "time": 1741098908,
      "translated": false
    },
    {
      "author_name": "Forest BK",
      "author_url": "https://www.google.com/maps/contrib/116448453673911455728/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL76LHGcdk_DWwI1Uwpxr5pFf5padq-ZcHhARkF7WFUdeyixQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "🌊Pandan Reservoir Park is located at the west side of Singapore.\n💧It's among the sixteen reserviors built in Singapore during the developing years to meet the increasing water needs.\n💦Unlike others, Pandan Reservior was built on an elevated ground, supplying non-portable water to the neighbouring Industrial area and Jurong Industrial Estate.\n🌊Best time to visit is in the morning and evening hours.\n💧The Reservior features fishing decks, radio controlled boat deck and water sports located at different areas.\n💧A 6 km gravel path circled the entire reservior.\n💦It's a great place to jog or brisk walk in the early morning or in the evening.",
      "time": 1740781492,
      "translated": false
    },
    {
      "author_name": "Nur Iman Rostam",
      "author_url": "https://www.google.com/maps/contrib/110287485091231667131/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKk595S-r1_udolNvwjHBrRXawa0-51AXFXSDcmorPXWIc8HA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "If we have Bedok Reservoir Park in the east, then Pandan Reservoir Park is the west's version of a great outdoor venue for all of Western Singapore's residents who can access a variety of water-based activities including remote control sailing and electric motor boating. There is an observation deck with ample empty sitting nests, and a huge shelter covering the premises with access to toilets nearby.\n\nThere are bus services from Jurong East (143 or 143M) and Jurong Town Hall (78 and 79) to West Coast Road bus stops serving Blocks 31 to Block 47 of Teban Gardens. Future 2028-ready Jurong Region Line (JRL) Pandan Reservoir MRT Station (JE7) is on the eastern banks of the waterway facing Commonwealth Secondary School.",
      "time": 1720680375,
      "translated": false
    },
    {
      "author_name": "Yanger Walling",
      "author_url": "https://www.google.com/maps/contrib/109080997493312232833/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKmcWG1yYKnSA6Jn_p7897HOT2aZfZnAix96xNDi56lJaq_RLdm=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "3 years ago",
      "text": "Review written on: 10 October 2021\nThe entire perimeter around the reservoir is about 6.2 km. The track is gravels of rocks (nice crunching sound) and its a different feeling compared to the regular running tracks. There are shelters provided along the track. However, there is no shelter from trees and its a very open space.\n\nIf you plan to take a stroll or a run in the mornings, time it accordingly (6.2 km) to avoid the hot sun. Water fountain and washroom is provided near on end of the track. I think evenings would be better for photography if you are into capturing Street lamps. I started my run a bit late in the morning and mid-way, the sun got out and the running was no longer enjoyable.\n\nThe view is beautiful. Sit along some of the benches provided and take time to enjoy the view.",
      "time": 1633844638,
      "translated": false
    }
  ],
  "types": [
    "park",
    "tourist_attraction",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7768814986951210833",
  "user_ratings_total": 170,
  "vicinity": "700 West Coast Road"
}