{
  "formatted_address": "377 Hougang St. 32, #01-03, Rivercourt 530377",
  "geometry": {
    "location": {
      "lat": 1.3631284,
      "lng": 103.8954475
    },
    "viewport": {
      "northeast": {
        "lat": 1.364604830291502,
        "lng": 103.8964296302915
      },
      "southwest": {
        "lat": 1.361906869708498,
        "lng": 103.8937316697085
      }
    }
  },
  "name": "Pano Family Clinic (formerly Keystone Family Clinic)",
  "place_id": "ChIJEbSAU_8X2jEREHhYTMyoVuo",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Malcolm",
      "author_url": "https://www.google.com/maps/contrib/101550593245444019502/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU2XhCVNxDV0cLfIMzv_OYbbvw1jjiTLsGsfMSx9kM9Vq3bF20Z=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Had a pretty good experience here with Dr Joel. He was attentive, caring and patient. During consultation, he made sure to understand the cause of illness and gave advice accordingly with regards to ailment prevention and the course of action to recover. I felt really glad because many GPs nowadays just rush you off to collect a quick buck but I didn't get that impression here. Staff were generally quite friendly too. I like this place. :)",
      "time": 1745589021,
      "translated": false
    },
    {
      "author_name": "Zac Kwan",
      "author_url": "https://www.google.com/maps/contrib/112006201736915956882/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVOlymcjp152cLrpqXQAnhd-qcVUpqx4Nox2EYXI0ntVEcwhF6q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "We’ve been visiting this clinic multiple times since discovering how child-friendly and welcoming it is. My daughter always feels safe and comfortable here, thanks to the wonderful team of doctors like Dr. Max, Dr. Joel, and Dr. Renette.\n\nRecently, my daughter had constipation issues, and during our follow-up, Dr. Max took the time to explain everything clearly and provided the right treatment that eventually resolved the problem. We were also pleasantly surprised to receive a follow-up call to check on her progress—such a thoughtful and caring gesture!\n\nSuperb service and care from Dr. Max and the entire team. Highly recommended for parents looking for a great pediatric clinic!",
      "time": 1739788649,
      "translated": false
    },
    {
      "author_name": "Huey Woon Lee",
      "author_url": "https://www.google.com/maps/contrib/101231065544109634677/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL9TQQRD6K6TwKzp9AmVVw_m48DGW-BigOsIAreZnaglSLrZwI=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Was slightly concerned whether we would get good care cos we had never been to this clinic before. But I didn't need to worry! Wonderful nurses and doctor! My husband had severe nausea and chills. The nurses were so kind to lend us a blanket so that my husband could stay warm. Dr. Max, who saw us, allowed my husband to rest in a room until he recovered enough to be able to walk home. Thank you for taking such good care of my husband and being so patient with us. Will definitely visit this clinic again next time we need medical help!",
      "time": 1734961010,
      "translated": false
    },
    {
      "author_name": "Tay Ming Ting",
      "author_url": "https://www.google.com/maps/contrib/106417290186294912688/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXghCHl-yi3VgBOk1qTZgoUKSG0gdN60ZMDntcuqIkdRxU_b2C9=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "This has been my go-to clinic for myself and my whole family including my kids. Not only are the admin staff responsive and I could always ask for clarification over WhatsApp, the doctors are attentive too! I especially appreciate Dr Max who is meticulous and will always explain the conditions and treatments clearly! Nurse Clary is very professional too - always giving good explanations on drugs and answering any side questions that we have.",
      "time": 1739511688,
      "translated": false
    },
    {
      "author_name": "jade li",
      "author_url": "https://www.google.com/maps/contrib/108372844538284270998/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLTRm70SlQ7NWmoRMJB0r0D7E1_MNFSekEXR4q4JZqSFuvH=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Very thankful to Dr. Fu Xiaojia and Dr. Max for seeing my gal for her stomachache. Her pain was on and off. Dr. Fu warned us if the pain persisted, we needed to go to the hospital. As my gal's tummy ache had gotten better but she was still feeling bloated, we went back 3 days later,  Dr. Max saw my gal.  He concluded that she was having indigestion. He said since we already had medication from Dr. Fu, we just continued with it and could try GAVISCON.\n\nClinic's fe was reasonable and nice that young doctors are working late. It's hard to find evening sessions at clinics these days.\n\nWe have to thank the honest reviews that brought us to know this clinic.",
      "time": 1740904115,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16885869448279914512",
  "user_ratings_total": 75,
  "vicinity": "377 Hougang Street 32, #01-03, Rivercourt"
}