{
  "formatted_address": "46 Marine Cres, Block 46 Block 46, Singapore 440046",
  "geometry": {
    "location": {
      "lat": 1.3050607,
      "lng": 103.9127434
    },
    "viewport": {
      "northeast": {
        "lat": 1.306419430291502,
        "lng": 103.9140018802915
      },
      "southwest": {
        "lat": 1.303721469708498,
        "lng": 103.9113039197085
      }
    }
  },
  "name": "PAP Community Foundation Marine Parade Education Centre",
  "place_id": "ChIJDy9yoHUY2jERR8j95sn3YKw",
  "rating": 1,
  "reviews": [
    {
      "author_name": "Koh Victor",
      "author_url": "https://www.google.com/maps/contrib/101713261391399094840/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXXPTw21xz-xI2m-l_k1mmQeR_tPZU0IpoBuMg5YDahn9xylJnV=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "in the last week",
      "text": "I would like to bring to all attention a concerning incident involving Mr. Ngoi Khor Peng, Chairman of Kembangan Chai Chee Citizen’s Consultative Committee.\n\nOn 14 March@10am Mr. Ngoi attended an uninvited meeting with the MPTC, of which I was not aware, and proceeded to interrogate me about my feelings regarding staying in Ubi Estate. He provocatively suggested that if I were unhappy, I should form my own political party. This exchange occurred in the presence of Greenville RC Chairman,, and MPTC Estate Manager..\n\nI find his behavior unbecoming of a grassroots leader. His comments included threats to disengage communication with residents regarding my agenda of addressing municipal issues within the estate.\n\nFor years, MPTC has acknowledged the validity of my feedback regarding municipal matters as a resident. Mr. Ngoi's mannerisms come across as dominant and belittling, which undermines the purpose of community engagement. There are reasons to believe that his approach was a personal challenge.\n\nGiven these circumstances, I feel it is necessary to escalate this matter to the People's Association (PA) for an investigation into whether Mr. Ngoi is fit to serve as a grassroots leader representing the residents, or if he is unduly politically inclined towards a specific party. I am contemplating to make a police report on his threat.\n\nAgain, my feedback highlights is purely from a resident of Ubi Estate and is not intended to endorse any political agenda.",
      "time": 1747752921,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12421200218823706695",
  "user_ratings_total": 1,
  "vicinity": "46 Marine Crescent, Block 46 Block 46, Singapore"
}