{
  "formatted_address": "55 Keong Saik Rd., #01-04, Singapore 089158",
  "geometry": {
    "location": {
      "lat": 1.2806312,
      "lng": 103.8415186
    },
    "viewport": {
      "northeast": {
        "lat": 1.282119430291502,
        "lng": 103.8429389302915
      },
      "southwest": {
        "lat": 1.279421469708498,
        "lng": 103.8402409697085
      }
    }
  },
  "name": "Papa Doble Singapore",
  "place_id": "ChIJ9RIpYnUZ2jERkUH8C9sVeno",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Jacqui Windebank",
      "author_url": "https://www.google.com/maps/contrib/116819368899328882904/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLO7sp7A6Dqi-qyokb-PC-uRAp5cclNsQ8FbHPXlrGdOWXjUQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "4 years ago",
      "text": "While this is a lovely cocktails bar with interesting cocktails and great service, I was not as impressed as I expected to be. This bar made the World top 100 bars and while good I didn’t think it was that good. The cocktails were creative and tasty but I would have loved to see some\nDifferent cocktail presentations. Everything came in whiskey glasses with a large clear ice cube, with the only real variation being if it had a foam on top. The seats were not terribly comfortable if you are staying more than an hour. I will give it another shot post COVID just to be sure it’s not missing something due to the restrictions, but the feeling at this point is it’s a good cocktail bar but not great.",
      "time": 1604705276,
      "translated": false
    },
    {
      "author_name": "Flo Yeow",
      "author_url": "https://www.google.com/maps/contrib/101597484841229205770/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUCED0nHINoONtoIhYrg_037nt9gzG8G4ZOxJ3RLinEhCioWYU8hrs=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "I never knew this place existed. It's hidden behind closed doors; without any sign boards nor notices to mention who they are or what they do. Not exactly a speakeasy either, because it's just, there. That said, it makes them uniquely positioned for a lovely date night.\n\nCocktails are pretty impressive, for those who are into cocktails. They have guest bartenders visiting from time to time, so just take note when there are special occasions. Otherwise, they're a very principled bar, with stringent preferences, which is I guess what makes them special and unique and one of the best bars globally. Especially friendly team serving the crowd as well.\n\nCall for reservations, or else it's going to be difficult to get a seat later into the night.",
      "time": 1683676873,
      "translated": false
    },
    {
      "author_name": "Jenn CruznWant",
      "author_url": "https://www.google.com/maps/contrib/116597613783167720618/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWpdrGMlhn8u3rT341RMDdBkjHZRTmcsFep-7QvIHgI7JwFUoyyXA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "“Don’t bother with churches, government buildings or city squares. If you want to know about a culture, spend a night in its bars.” –Ernest Hemingway\n\nAnd Papa Doble doesn’t disappoint. Wonderful evening of charismatic mixologists and patrons alike. I was lucky enough to visit on the evening of the guest shift from Award winning West Wing distillers mixologist Callan C Green. This busy intimate speakeasy is in heart of Singapore’s buzzing Keong Saik Rd and is colourfully decorated. The staff are friendly and customer service is fantastic. I can’t wait to visit again in a few months to try their 1955 and Papa Doble cocktails. Thanks Andrew for a lovely and entertaining evening!",
      "time": 1662245115,
      "translated": false
    },
    {
      "author_name": "Meghnil Pagrut",
      "author_url": "https://www.google.com/maps/contrib/115931116400542136191/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXYGJaOnf2Q4YAPy6_RO8oehdwU8ewH0MMivkBvNR6ziVnfjcUkCg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Definitely the best cocktail bar we've been to in Singapore not only in terms of the quality of the cocktail itself but also the service by the team (looking at you Sha and Louis - keep it up). We had 7 drinks (Papa Doble, China, Italy, Spain, Bahamas, Thailand and Pandan Gin and tibicos) all of which were perfect and did an excellent job at capturing the exotic local flavours. The bartenders were kind enough to engage my curiosities and give me a peek into their cocktail making process which was equal parts chemistry and mixology. This bar should be on every cocktail lovers list!",
      "time": 1671863215,
      "translated": false
    },
    {
      "author_name": "Olivia low",
      "author_url": "https://www.google.com/maps/contrib/112673150798082275666/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWMJ17DCci4LDwuoG_M9HUeccYFVScu4GWCjrF8KGvGZ6-7Dw0U=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "2 years ago",
      "text": "The food and service is great, the drinks are decent, however they don’t justify the high price and atmosphere! There wasn’t really much bartending, cocktails were $24 and pre made in plastic glasses. Perhaps if I needed to host a big group on a weekday night, with no budget or food preferences, I’d come again.",
      "time": 1656673206,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "cafe",
    "bar",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8825390450329010577",
  "user_ratings_total": 258,
  "vicinity": "55 Keong Saik Road, #01-04"
}