{
  "formatted_address": "10 Airport Blvd., #02-203A Singapore Changi Airport, Terminal 4, Singapore 819665",
  "geometry": {
    "location": {
      "lat": 1.3390218,
      "lng": 103.9820703
    },
    "viewport": {
      "northeast": {
        "lat": 1.340326480291502,
        "lng": 103.9833999302915
      },
      "southwest": {
        "lat": 1.337628519708498,
        "lng": 103.9807019697085
      }
    }
  },
  "name": "PappaRich Changi Terminal 4",
  "place_id": "ChIJVXQCbQA92jERx6oMbV9OzBc",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Gopi Bala",
      "author_url": "https://www.google.com/maps/contrib/114775727475904526433/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI7ZzaudFcbdAGlKH6kwZCFzR8Me9ksnqE8OnLeAzyXe9hGDQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "3 weeks ago",
      "text": "Today was my first ever visit to to this restaurant.\n\nI ordered the nasi lemak with beef rendang and the Hainanese Chicken chop with fries.\n\nThe nasi lemak was mediocre, as the rice didn't really have the santan taste, and the chilli given was a paltry portion. The fried ikan bilis tasted stale as was not crunchy at all. Only the beef rendang passed the test.\n\nThe Hainanese Chicken chop was average at best. No issues with the chicken, but the so called sweet sour sauce was a disappointment. The fries while fresh were not salted.\n\nThe restaurant should consider having a little condiments corner where you can get chilli and tomato sauce and also salt and pepper to augment the rather insipid food served.\n\nWould I visit this restaurant again? Definitely not as you can get better food at hawker centres for less than half the price!",
      "time": 1745412791,
      "translated": false
    },
    {
      "author_name": "Ashley Liew",
      "author_url": "https://www.google.com/maps/contrib/115333748318871707993/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVddwioWn2vIWseGeLcQUEr7x5FpokOuwMgLuTFOfWDIXAE46A=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Our family’s first time here last night and it was a lovely experience. The staff were all friendly, prompt, and helpful. Appreciated how kid friendly it is especially for our two year old. He really loved the chicken rice! We liked the other dishes we had as well including the char kway teow and bryani rice. Located on level 2M of Changi Airport Terminal 4. Thank you! 🙏🏻",
      "time": 1744633290,
      "translated": false
    },
    {
      "author_name": "Ewe Keat Huan",
      "author_url": "https://www.google.com/maps/contrib/103626082513610890905/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVcpEkpp4b_KaWygB0NfRxr1geo73o12xphky_CrUovf85LgjzQLw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Review for PappaRich at Changi\nHad an absolutely awesome experience at PappaRich in Changi. From the moment we walked in, the place had a warm, welcoming vibe. We ordered the nasi lemak and curry mee—both were packed with flavor. The nasi lemak had fragrant coconut rice, crispy anchovies, and a perfectly cooked egg, with sambal that had just the right amount of heat. The curry mee was rich, spicy, and comforting—everything you want in a bowl of Malaysian-style noodles.\n\nBut the highlight of the meal? The coffee. It was incredibly smooth, bold, and aromatic—probably one of the best cups I've had in a long time. Whether you're grabbing a quick bite before a flight or just exploring Jewel/Changi, this spot is definitely worth checking out.\n\nRating: 5/5",
      "time": 1744632502,
      "translated": false
    },
    {
      "author_name": "Eve C",
      "author_url": "https://www.google.com/maps/contrib/109756518746414930822/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUQU3wOFRLMgNb3VcKY8wCYgWAjbktK7DbOQ0RgmSSo7MlZ8AJrJQ=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "An unassuming chain restaurant nestled within a stretch of restaurants serving heartwarming nanyang cuisine. The food comes with a lot of variety for you to choose from. Surprisingly I love the chicken rice. Everything was well done for this dish. Happy to have it returning to Singapore. For the roti canai with curry, I wished the curry gravy is a bit more watery which goes easier for dipping. But I am glad they allowed us to have more gravy because initial serving of gravy was just too little.\n\nPleasantly surprised the kaya toast was also well done with a good spread of butter that elevated the whole shioskness of the dish.\n\nThe staffs are friendly and they made me feel the auntie who lived next door.\n\nLove to go back again any time. The whole experience (esp after returning back sg) made me feel like I am home",
      "time": 1727360169,
      "translated": false
    },
    {
      "author_name": "Sahur Saleim",
      "author_url": "https://www.google.com/maps/contrib/111056858556057934573/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWk8h61NS4XQha4w5nyMUb3wLC7MY8PNBrCGg7lQZbnErV-5Mra=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Really great restaurant to dine at before or after your travel! Food is so good and service is really great. We love the chicken rice and satay :) Ting Ting served us really well. The Lava Cake was also exceptionally delicious. Thank you so much for a great experience! It's our Second time back this week!",
      "time": 1726899969,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1714831729879722695",
  "user_ratings_total": 63,
  "vicinity": "10 Airport Boulevard, #02-203A Singapore Changi Airport, Terminal 4"
}