{
  "formatted_address": "11 Bidadari Park Drive Mall, #02-25/26/27 The Woodleigh, Singapore 367803",
  "geometry": {
    "location": {
      "lat": 1.3385906,
      "lng": 103.8720405
    },
    "viewport": {
      "northeast": {
        "lat": 1.339859480291502,
        "lng": 103.8735090802915
      },
      "southwest": {
        "lat": 1.337161519708498,
        "lng": 103.8708111197085
      }
    }
  },
  "name": "Parkway MediCentre @ The Woodleigh Mall",
  "place_id": "ChIJ1Y-Ht7AX2jERLbMODslIB1k",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Shan Chia",
      "author_url": "https://www.google.com/maps/contrib/114224088457058795370/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLtPTGhSPJwvwMWKsIrys9FCuLVH8vI2s3C8zqIcbfs34v7nw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "My overall visit to the health centre was very pleasant. The environment was well-organized, and the nurses were warm, friendly, and helpful throughout.\n\nA special thank you to the radiographer, Ms Andrea Sato. She went above and beyond to make sure I was comfortable and well-informed during the mammogram screening. Thanks to her professionalism and gentle manner, the entire procedure was quick and stress-free.\n\nAndrea’s dedication and warmth really made a difference, and I’m really grateful for her support.",
      "time": 1746862029,
      "translated": false
    },
    {
      "author_name": "Foxy Bell",
      "author_url": "https://www.google.com/maps/contrib/101448186295734462218/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK8zp5yl_45JRkztloTNZRjA3TjK7vSjYacd1h4LkRXqLBzgw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Very conducive environment. Receptionists are friendly. Doctor Tricia is friendly and all the nurses are very friendly too. It gives patient a good mind of assurance while doing medical check up here. Seamless process  from registration to doing the\nMedical check.",
      "time": 1743038783,
      "translated": false
    },
    {
      "author_name": "Ler",
      "author_url": "https://www.google.com/maps/contrib/100368142169357218910/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIDN8U-rwp9PZbRYp9ElMpgKL3x0MBzs-TPVGBB_4fk7X1c7A=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Dr. Luke Tan is an exceptionally kind and responsible doctor who truly goes above and beyond for his patients. Before my recent holiday, I went for a medical check-up, and he made every effort to ensure that I received my report before my flight. His efficiency and dedication gave me peace of mind while I was traveling.\n\nWhat impressed me even more was that after I returned, he personally took the time to call me and go through my results in detail, addressing any concerns I had. This level of care and attentiveness is rare, and I’m truly grateful for it.\n\nOut of all my past medical check-up experiences, this was by far the best. I deeply appreciate Dr. Tan’s kindness, professionalism, and commitment to his patients’ well-being.",
      "time": 1742968474,
      "translated": false
    },
    {
      "author_name": "Leslie Chan",
      "author_url": "https://www.google.com/maps/contrib/103442075691497429582/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUQppXK4Q8yzs4m0vFwoRZ-HIDRGtxqTDIyfrYXcWJnUYYj2PTi=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "According to their website, this clinic should be opened until 930pm. We came in at 6pm and they told me there are no doctors in the clinic.\n\nThere was a response from the clinic that this is a communication problem. However this is not a communication issue. It is an issue of standards at your clinic.  For example, you could have set a standard to have at least 1 doctor available at the clinic when the clinic is open. I find it nonsensical to have a clinic that is open and cannot take patients.",
      "time": 1740106852,
      "translated": false
    },
    {
      "author_name": "Amanda Ong",
      "author_url": "https://www.google.com/maps/contrib/105326868594034719868/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXt5ycDOhPwwQZH3KPRyvaMMBJ_CX31GRw8Rt9112dhWE3xO6dA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "Traumatic experience shared in screenshots because it’s too long as text. They’ve reached out to me after I sent them an email, and the response was very thoughtful and accountable, and I appreciate it very much!\n\nI want to be clear: I’m not sharing this to attack or condemn the nurses. I understand they were trying to help and were simply doing their jobs. I also recognise that not everyone is familiar with responsive or intuitive parenting—especially if they aren’t parents themselves.\n\nI’m also aware that this was just the radiology department, and I hope that the pediatrics department is better equipped to handle these situations with more sensitivity.\n\nThat said, it would be incredibly valuable if nurses were given more education on how to support parents who are trying to soothe their children—and how to prioritise the child’s emotional needs over rushing to get the medical task done.\n\nYes, I came in for an X-ray. But I’m also a mum. And sometimes, the most humane thing to do is pause and acknowledge that a distressed baby’s needs come first. That shouldn’t be something parents have to fight for in a healthcare setting.",
      "time": 1742988029,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6415176222574031661",
  "user_ratings_total": 495,
  "vicinity": "11 Bidadari Park Drive Mall, #02-25/26/27 The Woodleigh"
}