{
  "formatted_address": "80 Marine Parade Rd, Singapore 449269",
  "geometry": {
    "location": {
      "lat": 1.3013366,
      "lng": 103.9052333
    },
    "viewport": {
      "northeast": {
        "lat": 1.302944280291502,
        "lng": 103.9060529302915
      },
      "southwest": {
        "lat": 1.300246319708498,
        "lng": 103.9033549697085
      }
    }
  },
  "name": "Parkway Parade",
  "place_id": "ChIJ2WUXmnEY2jERoGOSkJVgnrY",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Fabi Kieser",
      "author_url": "https://www.google.com/maps/contrib/115256318873646509428/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX7hIN6Rfa_hgTqQciwX77Pzsmqfxh3EBYSivXfyi_EI2UTd75q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Perfect \"normal\" shopping mall!\nReally enjoyed free wifi some snacks and the really good food court.\nValuable mall with lots of shops and brands. One of our favorite malls so far in Singapore.\nWith some nice child attractions.",
      "time": 1746660034,
      "translated": false
    },
    {
      "author_name": "Xoom Too",
      "author_url": "https://www.google.com/maps/contrib/105863133358477079886/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVLRzhuxFKh1jOBQiJLb1bjferwZ-xPRZ7v7ReqgRp2P_uVyh9Y4Q=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "The mall has 7 floors and throughout them there’s a FairPrice, food court, clothing stores, restaurants, snack stores, also some ATMs outside to the left of the main entrance, banks such as UOB, DBS, and way more. It’s not a flashy mall in my opinion yet if you’re staying in the area (like I was), you’d find it useful enough.",
      "time": 1746321270,
      "translated": false
    },
    {
      "author_name": "Kimberly H",
      "author_url": "https://www.google.com/maps/contrib/113222338250736421075/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK5GRFUINmtf3aOsj_G903HUDgffOMAdRYSXj34iMvEIkW-GQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "Food court here has recently reopened again after a near one year closure, used to be Food Republic but has since been rented to Kopitiam. Although there was no mention of it’s opening on social media, the crowds were robust and there were little empty seats on the 2nd day of opening.\n\nWhile I applaud the modern Safari design, I am disappointed to know that some or the stalls are still the same old stalls from the Parkway Parade era, such as the roasted meat stall, Blanco Court beef noodles, ah ma fish ball noodles and lam’s abalone noodles.\n\nOut of all the new entrants to the food court, only the Xi Yan Yong Tau Foo stall and the Fitra Halal Chicken Rice seemed promising and able to stay out of the many stalls competing for business here.\n\nI had expected Li Xin Fishball Noodles or at least some decent Bak Chor Mee stall to be invited to sell here, which would have been worth the one year wait, but all we get is a whole stretch of stalls that we haven’t even heard half of them.\n\nAfter the revamp, food prices are again pushed to an all-time high with a bowl of Xi Yan Yong Tau Foo at $8+, which can be rather straining on our pockets during this economy downturn. The food operator should look into revamping the prices to make food more affordable for the masses.",
      "time": 1743490657,
      "translated": false
    },
    {
      "author_name": "Hao Tan",
      "author_url": "https://www.google.com/maps/contrib/117487638688399238932/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWOJylh8Btd8impqdRRmHSYqWxG2DDbax1spOHCicJRhCoIbVAshA=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "One of the oldest Shopping centre within a Heartland.  But its had been very well maintained and efforts had been make to maintained it through many renovation.  Still many goods shopping stores, Banks, Money Changers,  Restaurants. You will enjoy shopping at this mall. Many goods foods within and outside the shopping mall. Parking easy as there parking within the mall as well as parking area near the neighbourhood.",
      "time": 1712366268,
      "translated": false
    },
    {
      "author_name": "Dean Zhang",
      "author_url": "https://www.google.com/maps/contrib/115562962645416216650/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUJ2cBtAVSRhgCybbHLq8AkVFBAurvYMNwjTANEOv4tBFyH8OsE=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Parkway Parade has been my go-to mall for years, and it continues to deliver a convenient and pleasant shopping experience. Located in the heart of the East, it offers a well-rounded mix of retail stores, supermarkets, dining options, and essential services all under one roof.\n\nWhat I really appreciate is the variety — from fashion and electronics to beauty salons, clinics, and banks — everything is easily accessible. The mall is also home to Cold Storage and FairPrice Xtra, making grocery runs super efficient. The recent updates and renovations have kept it modern and clean, while still retaining a cozy, familiar vibe.\n\nDining-wise, there’s something for everyone — from local hawker-style meals to cafes and international chains. It’s also quite family-friendly, with ample seating, clean restrooms, and a decent mix of stores for both adults and kids.\n\nWhile it can get a bit crowded during peak hours, especially weekends, the flow is generally manageable. All in all, Parkway Parade remains a trustworthy and practical mall for daily needs and relaxed weekends.",
      "time": 1746339016,
      "translated": false
    }
  ],
  "types": [
    "shopping_mall",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13159061356715074464",
  "user_ratings_total": 8876,
  "vicinity": "80 Marine Parade Road"
}