{
  "formatted_address": "169 Pasir Ris Rd, Singapore 519145",
  "geometry": {
    "location": {
      "lat": 1.3836949,
      "lng": 103.947101
    },
    "viewport": {
      "northeast": {
        "lat": 1.384410030291502,
        "lng": 103.9481794302915
      },
      "southwest": {
        "lat": 1.381712069708498,
        "lng": 103.9454814697085
      }
    }
  },
  "name": "Pasir Ris Park Area 3",
  "place_id": "ChIJM1pBu8c92jER7ATncRtME18",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Gatsby",
      "author_url": "https://www.google.com/maps/contrib/104607839695805855739/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK1iOXbPiGEq2PkqSN5akUoLLsMUtuHQY_O-1ly9EFy3yPudA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "First visit without no expectation but liked it.\nLocated straight down by overseas family school.\nTrees are different from what I see in my hometown so it is enjoyable and it was also great scenery of ocean.\nHowever, seems it doesn’t take care of well- a lot of trash in the water, and fishing and seems more keen attention is needed after camping to manage good condition of park.\nChildren playground is satisfying.\nWould like to see a diverse animals in next visit.\nIf I could borrow near here, it would be great.",
      "time": 1707540064,
      "translated": false
    },
    {
      "author_name": "Azhar Kamar",
      "author_url": "https://www.google.com/maps/contrib/114278465459509817931/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUWn123M9iZHuBDgYAT3UcIpyPmTMSy46ylI_Zx1zFg8Uuan-M=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "This is one of two few camping spots allowed in Pasir Ris Park. I pitched my tarp at the grassy open area right in front of the carpark. Nice place for chilling with moderate wind usually. Come on and bring your camping gear, enjoy your brunch, bathe in the sun and engage in some outdoor activities!",
      "time": 1693808524,
      "translated": false
    },
    {
      "author_name": "Will Will",
      "author_url": "https://www.google.com/maps/contrib/100147007012775813383/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLzSwTVP95DY4WEtB_qjvn1Jn5fI_HURU7bO7k9VQ3TzwdUOA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "4 years ago",
      "text": "Pleasant, tranquil and in recent,  i sensed the increase of users to the park. Not only humans but also many roosters, hens and chicks😂; occasionally,  you will also see wild boars, couple of stray dogs and  Hornbills.  Park is divided into 2 sectors by a connecting bridge across a funnelling canel. With good weather,  one would be able to catch a majestic sun rise. Few kelongs, passing container ships, occasional cruise ships, beach side restaurant, club houses, etc laid  the backdrop of Pasir Ris Beach. Other recreational grounds includes playgrounds for children,  beach ball court, basket ball court. Other amenities include toilets, resting huts along the entire stretch of the beach,  benches facing the beach, BBQ pits, can drinks dispensers, open air theatre stand, etc. The entire coaster line is lined with different types of trees arching and covering majority of the  foot and cycle paths, shading and shielding the area from scorching sun. The spot is also a haven for anglers and beach goers soaked in a closely resemblance of a Hawaii beach.",
      "time": 1602664707,
      "translated": false
    },
    {
      "author_name": "Chris Polii",
      "author_url": "https://www.google.com/maps/contrib/104818386450075091063/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXyWw5Hr5MTHHZAvATcPFIcBvjxWo_wNDicFIig82VkP9fC6do=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Of all the beach oats in Singapore, pastor ris park is the most conducive if one wants to do camping or just have a chill picnic. Regardless of the fact that it’s scorching hot right now, I’ve come here on a much more pleasant weather before, and on public holidays. And while there is slightly more people, it is still very pleasant. Today is really quiet! Even the massive children playground that is finally reopened is pleasant to hang out in. That said, if you’re looking to swim or play sand on the beach, this is not the best (and probably the worse) beach to head to. Not a wide shoreline, and many a times it can be covered with thrash and the water pretty filthy, this is due to the many kelongs not too far from the shore. Also eateries are few and sparse, unlike the more popular and densely populated beach parks.",
      "time": 1687335771,
      "translated": false
    },
    {
      "author_name": "Adrian Lunsong",
      "author_url": "https://www.google.com/maps/contrib/115667899378922008733/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV7OrvzwTqbnpEOiTbxDl0rFiJaN_0IH5VB_ZymPhCnWpsK2BZNTg=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "(Detailed review below)\nAmbiance ⭐⭐⭐⭐⭐\nAccessibility ⭐⭐⭐⭐⭐\nSafety ⭐⭐⭐⭐\nFacilities ⭐⭐⭐⭐\nCleanliness ⭐⭐⭐⭐⭐\n\nA definite highlight to exploring this park was seeing a hornbill playing on a tree. I haven't seen a wild hornbill flying free like this so it was just really cool. The park is great and if you're keen on camping, there are sites sections as such (you'll need to apply for a permit to use them). There are also facilities scattered throughout; gazebos, picnic areas, BBQ pits, showers/toilets with drinks vending machines, and I even spotted a gym pod where I assume you can use the gym equipment in them.",
      "time": 1662173736,
      "translated": false
    }
  ],
  "types": [
    "park",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6850903138919449836",
  "user_ratings_total": 314,
  "vicinity": "169 Pasir Ris Road"
}