{
  "formatted_address": "668C Jurong West St 64, Block 668C, Singapore 643668",
  "geometry": {
    "location": {
      "lat": 1.3415989,
      "lng": 103.7033065
    },
    "viewport": {
      "northeast": {
        "lat": 1.343010630291502,
        "lng": 103.7047153802915
      },
      "southwest": {
        "lat": 1.340312669708497,
        "lng": 103.7020174197085
      }
    }
  },
  "name": "Passion Vocal Studio @ Jurong",
  "place_id": "ChIJ-RpieY8Q2jERAkWWMssSsaw",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Cindy Chua",
      "author_url": "https://www.google.com/maps/contrib/104442716880644484281/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ-2dnly0HBAYXvHsOYoRdAioCI9SBOQcclFSDbSwhyZuHWRQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Ms. Alice is a very patient and skilled vocal teacher who can provide me detailed and useful suggestions for training my voice. She tailors the lessons to my needs/voice and uses a variety of techniques and approaches to help me improve my singing.\n\nDespite my experience singing in a traditional choir, I frequently find my voice lacking strength and power when singing. I made  progress with my tone quality through the lessons, and I feel more confidence in my solo voice when singing pop tunes. My friends were shocked at how much my voice had improved in just a few months.\n\nThe studio@Jurong is a cosy home setup that is conveniently accessible from Boon Lay MRT via a short walk, therefore I would highly suggest anyone looking to enhance their singing to have lessons with Ms. Alice!",
      "time": 1743865449,
      "translated": false
    },
    {
      "author_name": "James Phua",
      "author_url": "https://www.google.com/maps/contrib/105374646109187296793/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXBGtCASL0Lv7xyHgTgHZquzEnYM8XKWi8NxQOPysTKdfYyUHI=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I had a trial lesson with Alice, and I was blown away by her ability to bring out the best in me. After just one session, I achieved a vocal range I had never managed before. I've worked with other coaches, but Alice truly stands out—her techniques and guidance are exceptional. I highly recommend Passion Vocal Studio to anyone looking to improve their singing. Alice is a phenomenal vocal coach. I am definitely going back for more lessons! - James",
      "time": 1731579787,
      "translated": false
    },
    {
      "author_name": "yee loon",
      "author_url": "https://www.google.com/maps/contrib/107919312794880500757/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKeWHExZvZSZCIBXpD_3D0ftZMhqPcI8jXlhW7--1lMB2Oy=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "I'm taking regular lessons with Alice at her Jurong studio since this year.\n\nThe Jurong studio is a cozy home studio setup and location is accessible, short walk from MRT and also bus option is available too\n\nAlice is patient and always encouraging, she finds ways and alternative methods to help me understand techniques better if I feel it is difficult for me. She also takes notes of each student's progress so the learning is customized which is really nice :)",
      "time": 1728452690,
      "translated": false
    },
    {
      "author_name": "KS",
      "author_url": "https://www.google.com/maps/contrib/113397387340454490297/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL_3SP2YsxNF11sJXBBcvlORVnWmSokV5OPJCKhGRkDclGLpA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I have a fruitful musical journey with Alice from Passion Vocal Studio @ Jurong. During my 1st lesson, I told her my challenges are that often I ended up with a hoarse or painful throat after singing. After hearing me sing in class, she was able to identify the root of the problem and address it with appropriate techniques via vocal exercises and immediately I can feel the improvement in my voice.  Her methodology and instructions are clear and customised to my personal abilities such that I will be able to follow and master it. The studio classroom is cosy and clean and make me feel much at ease. The location is also easily accessible via public transport, be it bus or MRT with a short walking distance. Alice is friendly, patient and professional and indeed an awesome vocal coach!",
      "time": 1712801479,
      "translated": false
    },
    {
      "author_name": "Chloe Tiantian Cai",
      "author_url": "https://www.google.com/maps/contrib/108927244195265157395/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUjmckMZrDyLsTU_USZ-wDjp0Ov0K9jtvLsdPtxqGUYLb2NHiH5=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "My lessons started in Sept 2020. At that time, covid already changed our life. I spent most of the time at home, and was not able to connect with colleagues or friends the way I used to. I was trying to learn something new to keep up the good mood.\n\nThrough a quick search, Passion Vocal Studio caught my eyes, and I noticed Ms Alice Wong has been providing professional vocal training using the IVA technique. After checking the studio website, I decided to learn from Alice to discover my voice. I am not a professional musician or singer, but I can see Alice is giving her training in a systematic way, which is both practical and based on music theory.\n\nStarting from basic skills, she shared a lot of knowledge and helpful tips. She explained to me the correct way to pronounce the vowels and consonants in both English and Chinese, and the method to avoid too much air while speaking and singing. She also told me how to present or sing in front of a group of audience. Thanks to her teaching, I gradually acquired the methodology through weekly practices.\n\nBesides the learning part, I’m also having fun in each lesson. Alice is super encouraging and has a lot of patience, even when I forget the right way and repeat some errors. It is so important to have a great teacher like her, when I started from zero experience. Therefore, I really appreciate the training she provided, and highly recommend it to other learners who enjoy singing :-)",
      "time": 1628329498,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12443747909337761026",
  "user_ratings_total": 8,
  "vicinity": "668C Jurong West Street 64, Block 668C"
}