{
  "formatted_address": "5 Ang Mo Kio Ave 10, Singapore 569739",
  "geometry": {
    "location": {
      "lat": 1.359272,
      "lng": 103.8546536
    },
    "viewport": {
      "northeast": {
        "lat": 1.360408730291502,
        "lng": 103.8558574802915
      },
      "southwest": {
        "lat": 1.357710769708498,
        "lng": 103.8531595197085
      }
    }
  },
  "name": "Pathlight School (Ang Mo Kio Campus 1)",
  "place_id": "ChIJawslE_0W2jER__qZMMolSJ0",
  "rating": 3.4,
  "reviews": [
    {
      "author_name": "Florence Leow",
      "author_url": "https://www.google.com/maps/contrib/102656561598060120185/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWWAO5NDzda0lWfeRJhWD1zQtDlUm5XL-zVuqnQGNv9Rilxc3M7=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "🟦 Pathlight School ( Campus 2)\n2 Ang Mo Kio Street 44,\nSingapore 569250\n\n(  Supporting the special needs' children).\n***********************************************\n🔵 My husband and I came to Pathlight Campus 2 grounds on 20th July 2024 Sat to support the School Carnival & Annual charity event.\n\n🟢 We bought tickets / or coupons on the spot, and also purchased some of the merchandise ( writing books) designed and produced by the students themselves.\n\n🟨 I was also there to see The Harvard Din & Tonics sing. 💙 All in all, the students under the guidance of their teachers and mentors put up great performances throughout the whole day. ✅️ We were there from 3.45 pm till 6pm plus.\n\n🟧 There were musical instrument performances, singing performances, violin recitals, games' stalls and merchandise pop-up kiosks.\n\n🟫 All in all, the students gave off their best and we are very proud of them! 🟨 Please keep up the good work:)",
      "time": 1731503816,
      "translated": false
    },
    {
      "author_name": "Marcus Hao",
      "author_url": "https://www.google.com/maps/contrib/112043450782069171838/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK3_OLBY_EemXDj8dcowdFhiMrN0e3Rujbyai5tHmYHnH_0UA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "I know i have been keeping quiet all this years but after seeing a lot of bad reviews from both my seniors and juniors, i think i shouldn't hide anymore and i should share some thoughts and opinion.\n\nYes, i admit that Pathlight has helped me to grow as a person and transform to the person of who am i today. But i am never proud of being a Pathlighter. School fees and the facilities are fine, i have no complaints about it. Most teachers are nice and i even have favorite teachers. But however, some teachers are bias against me which is something i cannot forget.\n\nI remember once when i was in Sec 2, i got suspension for  defending myself, a student who is after my life went to attack me. I am a victim and they think self defense is wrong and is considered violent? Wth is this? If i am badly injured then are they going to be responsible? Toxic Management like legit.\n\nIf i were to be very honest, although i do not agree with Jason Goh about his communist, propaganda, and North Korea statement but reading his statement, some point actually make quite a lot of sense. Such as giving feedback about the school and Student Council thingy because i was there and i know it.\n\nWhy is the Student not allowed to give their own opinion about the school when the student parents is paying their salary thru school fees? I won't go much into details about student council exco and SC President overbearing behavior.\n\nHowever, I am actually the victim of their 2021 Student Council President and some of the Exco making accusation about me for cyberbullying. I reported this to my ex teacher to give them a chance to solve this. But nothing works out and the accusation keeps on going until i make a magistrate report and lawyer send letter to the school, this is where they started panicking.\n\nAs a alumni and a former Student Council of Pathlight, i am rather ashamed and disgusted to know such person can be a SC President.\n\nSo parents out there, if you want to enroll your child here, please really reconsider. Don't make your child hate you for sending them there.",
      "time": 1745398180,
      "translated": false
    },
    {
      "author_name": "Ron Ng",
      "author_url": "https://www.google.com/maps/contrib/106799570895276649835/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIolZgyI7-gNOOoEncd6R3hGYEqWbMb5blh_KMj4egbk8TkWA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "Your lab assistant Daniel fang had laughed at my friend scar along with Muhammad Shiddique for no reason when he was hospitalized due to blood vessel burst on his head. How would he feel if laugh at someone's scar would the person like it?",
      "time": 1737603683,
      "translated": false
    },
    {
      "author_name": "Koogle Rewiew",
      "author_url": "https://www.google.com/maps/contrib/105519177272477063292/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXDz89RfznQVq3U2WcxuF3iEKfm2QoLO_OxhIMAqSxUElU-xoE=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "2 months ago",
      "text": "CRITICAL REVIEW.\n\nAs many people have said, this school was pretty much “for show.” One main reason is to make the school look better in a way that more students with special needs can join this school, which makes sense, but looking at other campus around the area, I can say that I am completely disappointed in the priority of the development of the building.\n\nDuring my 2 years of being here, I can say that the school has sort of had a drop in their quality, especially with their food, which used to serve hotdogs and burgers, but they removed it for “health promotion.” The school could probably provide some alternatives like low sodium hot dogs, but unfortunately, that did not happen. They removed it altogether. Although the burger did come back, it seemed that the quality has dropped quite significantly when it comes to food altogether, although I can say that the rice store is the freshest one.\n\nNext up, the classrooms. I can say that they’re up to date, but the flooring sometimes slides over each other. They do not bother putting super glue at the minimum. Capacity of the classrooms can be given a break, as sometimes, satellite schools like Peirce has to provide classrooms for Pathlight, which is mainly due to Pathlight taking over old schools like Chong Boon in C2A.\n\nFinally, the students. I can say that I have met a few students who have different personalities, but the problem is those who have certain traits that is not appropriate in public spaces. Moreover, the teachers have not really tried anything to stop these kinds of actions from happening. It can be worse, as a student from Pathlight could act up in front of a whole different school, and it tarnishes the reputation of the school. Other than that, most students are alright to a certain extent, and yes, I do give the benefit of students having autism. It is something that they cannot control, but teachers should at least do something to help students overcome their flaws in their behavior.\n\nIn conclusion, a certain bias for a campus, below satisfactory food, the quality of the classrooms, and the students, make up a slightly painful experience for a student in Pathlight trying to get to their O-Levels. Not much to say, but some factors may need to be improved on. Some things such as school events can be an exception as they are exciting for all staff and students to participate in, but for one thing, is to increase the quality of the school to allow better experiences.\n\n(Do note I’m trying to be as neutral as I can in this review)\n\nUpdate: Don’t read Jason’s review, high bias",
      "time": 1740757227,
      "translated": false
    },
    {
      "author_name": "Pocket “Pocketer”",
      "author_url": "https://www.google.com/maps/contrib/116460186645551939894/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXcrz1UTVhczX8dF1iZPDhmF2vKKqbyQCNZdUF0VsraLH2rBKI=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "9 months ago",
      "text": "Maybe it’s not the school’s fault, but my brother who attends this school has had a horrid experience with their teachers. These incidences have included teachers humiliating him in class and being extremely rude. I make this review as an older sister who wants to make sure that others’s siblings don’t have the unfortunate luck of going through this too.",
      "time": 1722336303,
      "translated": false
    }
  ],
  "types": [
    "primary_school",
    "secondary_school",
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11333350012606872319",
  "user_ratings_total": 57,
  "vicinity": "5 Ang Mo Kio Avenue 10"
}