{
  "formatted_address": "391 Orchard Rd, #03-16 / 17, Singapore 238872",
  "geometry": {
    "location": {
      "lat": 1.3026585,
      "lng": 103.8346227
    },
    "viewport": {
      "northeast": {
        "lat": 1.303962830291502,
        "lng": 103.8359050302915
      },
      "southwest": {
        "lat": 1.301264869708498,
        "lng": 103.8332070697085
      }
    }
  },
  "name": "PAUL",
  "place_id": "ChIJXbIwl5EZ2jEROR8sDs8tzfw",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "SCM",
      "author_url": "https://www.google.com/maps/contrib/115049243355473093856/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUFajXDQk0XtEALc_xXfIgUOQvFg_kUCtgWeUZ6zax0v2dOHX8=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We recently dined at this restaurant and had an excellent experience. Their staff particularly Thea was incredibly friendly and attentive, making sure we felt welcome from the moment we walked in. The service was prompt, and she was always ready to offer recommendations. As for the food, it was absolutely delicious! Every dish was well-prepared, full of flavor, and beautifully presented. I highly recommend this place for anyone looking for both great service and amazing food.",
      "time": 1742994928,
      "translated": false
    },
    {
      "author_name": "Amy Zhang",
      "author_url": "https://www.google.com/maps/contrib/103941263460402404220/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLhvNKQv2mXjv1b7kfQXUf9_SIoR1sQkqJpxmMr0PQF-0Fucg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "The food is really good, especially the miso cod fish and the cheese platter.\nThe service improved a lot since the last time we’ve been here, the friendly staff offered to fill our glasses and had a very nice attitude. The overall atmosphere is awesome!",
      "time": 1742620601,
      "translated": false
    },
    {
      "author_name": "Justin Chong",
      "author_url": "https://www.google.com/maps/contrib/112509522239984521471/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWlWcGGiIKquX6nPxLOo9SyQ_9dj2rElAUaZncnVfkWIqSrtJTCGg=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 2,
      "relative_time_description": "a week ago",
      "text": "the food is kinda mid; sad but true\n\nwe had a 1 for 1 deal so it was about 22 per pax but lowkey bad food\n\ni had the prawn and scallop pasta and while it was generous with prawns and scallop it was kinda crazily priced at 40ish if i didnt have a 1 for 1 deal. the pasta itself was quite meh though, imo worse than astons and definitely worse than most cafe standard.\n\ntsai wei had steak and she said it was okay, better than harry's which also has a 1 for 1 deal, but too expensive.",
      "time": 1746794818,
      "translated": false
    },
    {
      "author_name": "Grace",
      "author_url": "https://www.google.com/maps/contrib/105806692430925591154/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVu1mEuwO6w7Ue3VkpNIoVhoI6QD-s-KygElnq56gdAPHLjHUCK=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "It was our first visit to this restaurant and it was very cozy.\nVisited on a Monday, slightly before noon, it was not that crowded. Seating available inside the restaurant or at the corridor.\n\nStaff were very efficient and we were guided to a table swiftly.\nIt was relatively easy to order. After looking through the physical menu, we scanned the QR code on the table with our phones and ordered online. Payment was convenient as it could be done online with a card or at the counter. We decided to make payment at the counter and the staff that attended to us had a very good smile.\n\nThankful for the foldable baskets next to the table where we can place our bags.\n\nServing time was alright but communication between staff could be improved.\nOne staff held the tray of drinks while another staff was in charge of serving the drinks. Before serving the chocolate viennois, the staff told the other staff that the preparation was incorrect as there was no whipped cream so she brought it back to the kitchen. It was good that the correct drink was served but the staff could have explained to the guest to hold on for a moment, step aside to speak to the other staff and bring the wrong item to the kitchen.\n\nOverall, the food and drinks were great.\nLoved the pain au chocolat which was very crispy.",
      "time": 1739274123,
      "translated": false
    },
    {
      "author_name": "Velika Mustika",
      "author_url": "https://www.google.com/maps/contrib/100934616774888846200/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWgeR78FUEU4ROPTvUc4ScbfhdRCYiBIUTRu3DJ3qZadQ55Kqes=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "If you're eating healthy or on a diet, I totally recommend this meal at PAUL! The chicken is super tender and juicy—just how I like it. There's not too much rice which is my preferences, and the ginger oil blends perfectly with both the rice and chicken. Everything is nicely balanced.\n\nIt was super busy, though, so our drink took a while to arrive.",
      "time": 1736661570,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "bakery",
    "restaurant",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=18216266435102777145",
  "user_ratings_total": 2146,
  "vicinity": "391 Orchard Road, #03-16 / 17"
}