{
  "formatted_address": "Blk 412 Eunos Rd 5, #01-104, Singapore 400412",
  "geometry": {
    "location": {
      "lat": 1.3182973,
      "lng": 103.8991316
    },
    "viewport": {
      "northeast": {
        "lat": 1.319526280291502,
        "lng": 103.9005072802915
      },
      "southwest": {
        "lat": 1.316828319708498,
        "lng": 103.8978093197085
      }
    }
  },
  "name": "PCF Sparkletots @ Geylang Serai Blk 412",
  "place_id": "ChIJRbHM-ucZ2jERviSIPJXo5UI",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Nishanthi Soundarajan",
      "author_url": "https://www.google.com/maps/contrib/118073112608485745014/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWS9dq0bl2ZtUE7yVhk3ilsDg7yRczPoS_qbRJXQJlpjXbh97uf=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Both my girls studied here for few years since we moved to this area. Having enrolled my girls in a private school previously, I can assure u I can’t find a better school than Sparkletots. Young, warm and caring teachers. You can see that the teachers are passionate in nuturing our young ones. Special commendation to Teacher Lim, Tanya, Jie Xin, May, Fu Laoshi, Chen Laoshi. I might have missed out few more names. The school is led by a wonderful principal herself. The school has an admin who handles finance and administrative matters which I feel is good and ensures it doesn’t overload the P. The P addresses parents’ feedbacks positively and amicably. My girls from time to time comes back with reading and other materials to engage them at no additional charges. The school also invites police and MP to the grounds and have a chat with the students as well. My girls loved their time in this school and now as they have moved on to primary school, they do share with me on how they miss their preschool, teachers and classmates from time to time. Highly recommend this school to anyone who is considering.",
      "time": 1739271285,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4820514703833310398",
  "user_ratings_total": 1,
  "vicinity": "Blk 412 Eunos Road 5, #01-104"
}