{
  "formatted_address": "21 Choa Chu Kang North 6, #01-04, Singapore 689578",
  "geometry": {
    "location": {
      "lat": 1.3972337,
      "lng": 103.7466908
    },
    "viewport": {
      "northeast": {
        "lat": 1.398695630291502,
        "lng": 103.7481028302915
      },
      "southwest": {
        "lat": 1.395997669708498,
        "lng": 103.7454048697085
      }
    }
  },
  "name": "Penang Savour",
  "place_id": "ChIJhxAQ25ER2jERTNrAIxIEWbA",
  "rating": 3.6,
  "reviews": [
    {
      "author_name": "Ng Kai Ting",
      "author_url": "https://www.google.com/maps/contrib/106260511257623585294/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJaTSXS3rLiS4HNejCmoerSeqjMH3uSOvOPNcWV1oFsiiHX6yZk=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "Service, atmosphere: negative\n\nExtremely Disappointing Experience at Penang Savour Yew Tee\nI had a truly terrible experience at Penang Savour Yew Tee. The service was downright awful, and it made the entire meal incredibly uncomfortable.\n\nFrom the moment we arrived, the Malaysian lady who served us was unhelpful, dismissive, and downright rude.\n\nMy mum asked a few simple questions about how the vegetables were prepared, and instead of checking with the kitchen (which was right behind her), she couldn’t be bothered. Her attitude was condescending and unprofessional.\n\nWhen our food arrived, we noticed that condiments were not readily available, we tried to help ourselves with the condiments as everyone “seemed busy”, instead of offering help/ getting the other staff to help, this same lady staff glared at my mum, rolled her eyes, and walked off without saying a word. ??????\n\nBy the way, other customers were helping themselves to condiments without any problem, but we were made to feel like an inconvenience\n\nThe restaurant was so small and It wasn’t even a peak time, so there was no excuse for this kind of behavior. I saw Other customers were helping themselves to condiments without issue, yet we were treated as though we were a burden.\n\nTo make matters worse, this same service staff stared at us throughout our meal, making us feel uneasy and uncomfortable.\n\nI then started to observe her behaviour and Only after noticing that I was looking at her, she appeared shocked and stunned.\n\nI then took out my phone, and it seemed like she realized I might write a review. She immediately approached our table, confronted me, and asked me not to post anything negative.\n\nWhen I pointed out her poor behaviour/ attitude , she don't seem apologetic at all and even tried to talk louder than me She tried to cover up that she was rolling her eyes at her colleague instead of my mom. Either way, this is completely unprofessional and disrespectful.\n\nThe food was also underwhelming, but the service was the real deal-breaker. We were paying customers, and yet we were treated with such disrespected, especially considering we were paying for the meal and GST.\n\nI would strongly advise against dining here unless you’re willing to tolerate poor service and an unpleasant atmosphere. You can definitely find better places to eat where you're treated with respect.\n\nThis is our first time dining there and I’ll never patronise it ever again 😔 disappointing 👎🏻👎🏻",
      "time": 1734853750,
      "translated": false
    },
    {
      "author_name": "eddy khoo",
      "author_url": "https://www.google.com/maps/contrib/100216526729811832950/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKpVrN8i2KNvE6Qtp5JRy0W1XliyAynK4VduvC1SHEK5llpmw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Poor quality & culinary skills.\n\nOrdered the Penang Prawn Mee.  Visually, the soup looked unusually very dark & the gravy was too thick.  As suspected, broth was probably from a prepacked source and the cooks mixed the water to sauce ratio wrongly.\n\nTaste wise, it did taste like prawn noodle soup with a nice hint of spice but it was extremely salty and had too much MSG in it.\n\nIngredients were also very little.  Just a bit of noodles and small slivers of pork and prawns.  Pork was exceptionally dry and tough and prawns were tiny & few.\n\nA very unexceptional meal which was touted as a recommended dish.   Not recommended.",
      "time": 1743427568,
      "translated": false
    },
    {
      "author_name": "Z Ong",
      "author_url": "https://www.google.com/maps/contrib/100995158974633407890/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW1xgmFxMVMMsfn6fUv_Eg0dR801XFWDUVnSx-hthHX-1B7p91m=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "Rice and chilli for the nasi lemak was good. Will come back for this. However the fried chicken was rather dry and the coating was too thick. Penang laksa was alright. Would prefer more herbs, fish and more sour. The fried ngo hiang with Kimball Thai chilli sauce was excellent when it's hot. Overall price was alright and table a little small but will come back for the food.",
      "time": 1702471479,
      "translated": false
    },
    {
      "author_name": "Paul Young",
      "author_url": "https://www.google.com/maps/contrib/109729405213634414664/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWU3OavStAsbuKt5dBPG5bLCK2xi2e9wWNxVGODgmQkuv6UwKay=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Actually, I am surprised by how good this was. Going in with low expectations, (how can anything beat authentic Penang food?), I was pleasantly surprised. CKT has sufficient amount of wok hey, chendol was delicious, the prawn noodle was really authentic. Cost is affordable as well.\nWell done:)",
      "time": 1695783046,
      "translated": false
    },
    {
      "author_name": "WPin P",
      "author_url": "https://www.google.com/maps/contrib/117893368337848889092/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXSghYi_2GKZXskSysqSxA25MOPV4mU8OaeHg8uALDHsDUrL5D2=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "2 years ago",
      "text": "Decided to check out this place based on a friend’s recommendation.\nThey have quite an exhaustive choice of Penang yummies on the menu.\nWe tried a few dishes\nChar kuey teow - has good wok hei (flame-heat) & the taste is ok (but not great … has a tinge of sweetness, which is not something my palate enjoys 😅)\nAssam laksa - quite authentic but lacks the prawn paste kick that you get at Penang\nPandan leave ‘chicken’ - surprisingly tasty considering that it is a vegetarian dish\nChendol - slightly disappointing … missing the gula melaka which is a key component for the dish\n\nOverall, it is a decent place to check out. While the flavours are not the great, they offer great value with fairly large portion & decent price.",
      "time": 1665808330,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12707192299558328908",
  "user_ratings_total": 152,
  "vicinity": "21 Choa Chu Kang North 6, #01-04, Singapore"
}