{
  "formatted_address": "12 Perak Rd, Singapore 208133",
  "geometry": {
    "location": {
      "lat": 1.3046907,
      "lng": 103.8532672
    },
    "viewport": {
      "northeast": {
        "lat": 1.306029580291502,
        "lng": 103.8546285802915
      },
      "southwest": {
        "lat": 1.303331619708498,
        "lng": 103.8519306197085
      }
    }
  },
  "name": "Perak Hotel",
  "place_id": "ChIJY_b6CLkZ2jERy0-ylqPkztY",
  "rating": 3.6,
  "reviews": [
    {
      "author_name": "Ranjitha P",
      "author_url": "https://www.google.com/maps/contrib/102167805426167691458/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI6Tg8Ii8M7RToNl3vS9DNO_pjgKgjyTi1vpy83K8OGYmLQkw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "Location is only the best part .Staff is not friendly and very rude .It doesn’t feel like hotel fees like hostel .Door is not open anytime we need to ring a bell to get inside.Lady receptionist was very rude, her manager  has to consider to train her on how to behave with customers . Breakfast was pathetic and 🪳 inside room .Bedsheets given is of no use . I would suggest please book other hotels don’t get scam with price .I repent booking Parek hotel during my vacation .\nHotel management has to consider training their staff on how to provide hospitality.\nI was even scared to order food inside the hotel such suffocating environment",
      "time": 1747125434,
      "translated": false
    },
    {
      "author_name": "Shahriar Hossain",
      "author_url": "https://www.google.com/maps/contrib/110599785825582258254/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWKgpztT7YG8rWoKY9MpnZKt7t0OgqwzBYLZ-jcOBoB_dkYkmjt=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "I recently stayed at Perak Hotel Singapore and unfortunately, my experience was far from satisfactory. From the moment I arrived, I encountered issues that made my stay unpleasant.\n\nFirstly, the room was much smaller than advertised, and it felt cramped and claustrophobic. The cleanliness was also subpar—I found dust on the furniture, and the bathroom had a lingering musty smell. The towels provided were thin and worn out, which was disappointing for a hotel that claims to offer comfort.\n\nThe noise level was unbearable. The walls seemed paper-thin, and I could hear every conversation, door slam, and footstep from the hallway and adjacent rooms. It was impossible to get a good night's sleep.\n\nThe staff, while not outright rude, were indifferent and unhelpful. When I raised concerns about the noise and cleanliness, they offered no solutions or apologies. It felt like they simply didn’t care about guest satisfaction.\n\nLastly, the location, while central, was not as convenient as I had hoped. The area was crowded and noisy, and the hotel itself lacked the charm and amenities I expected for the price.\n\nOverall, my stay at Perak Hotel Singapore was a letdown. I would not recommend this hotel to anyone looking for a comfortable and pleasant stay in Singapore. There are far better options in the area for the same price or even less.",
      "time": 1742563164,
      "translated": false
    },
    {
      "author_name": "Riho Lepik",
      "author_url": "https://www.google.com/maps/contrib/110976410053493113404/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWSJx92zmnRQbij1u4mL9ZbAoqpwk2va2Bb2SJjm6ycEpHj1560=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Great place in historic Singapore.\nLovely neighborhood (a bit noisy).\nThe room is big enough (for Singapore). A lot of cupboards. Big safety box (💻 goes in). The bed is very comfortable.\nGood breakfast!\nEverything is good 👍!",
      "time": 1744587421,
      "translated": false
    },
    {
      "author_name": "Nijalingappa L",
      "author_url": "https://www.google.com/maps/contrib/106132490592798444651/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ0uvnNlhKMw_Mdq_YEAbHDaUK2Wg1NAelFQInogxKEFn3kAA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "in the last week",
      "text": "Hotel staffs are not welcoming, we were bit early and requested receptionist to help us to charge the phone, she was extremely rude and said it's not her problem.\nRooms are very small, although hotel is near to metro surrounding area is filthy.",
      "time": 1747484064,
      "translated": false
    },
    {
      "author_name": "Anuj Aggarwal",
      "author_url": "https://www.google.com/maps/contrib/105878918463957022993/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWUa304eduW3uOxej98RyyES9w6atbOrDDSZq6D2GqT_bdH2Xth=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "I was keen to Stay in Little India Area and was looking out for an affordable option and hence Perak Hotel got my attention meeting these two criteria.\nturned out the only good thing about the property is it's location (1 minute walk to Bus and MRT).\n1.The front desk lady was horrible, and reminded me of my school headmaster. she was utterly rude from the start and she upfront said that you have to give us room keys when you step out and we won't be responsible for your belongings\n2. hotel staff was shady too. we did not feel comfortable when they were around.\n3. breakfast was as good as not available.\n4. Room's cleanliness was out of question. Ants and Spider webs all over.\n5. washroom was so small and the sewer pipe was right in the shower cubicle so you could literally hear when the floor above you was flushing.\n6. room's has zero sound proofing. sound from all directions keep coming.\n7.moreover the hotel does not allow you to keep your luggage even for 2 hours after your checkout with them. we had to book a luggage service separately.\n\nOverall do not recommend to stay here and do not fall for lower pricing as the hotel is not even worth this.",
      "time": 1732590499,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15478560360578043851",
  "user_ratings_total": 388,
  "vicinity": "12 Perak Road, Singapore"
}