{
  "formatted_address": "KidsSTOP 21, Jurong Town Hall Rd, Omni theatre building, Singapore 609433",
  "geometry": {
    "location": {
      "lat": 1.334501,
      "lng": 103.735502
    },
    "viewport": {
      "northeast": {
        "lat": 1.335921530291502,
        "lng": 103.7369328802915
      },
      "southwest": {
        "lat": 1.333223569708498,
        "lng": 103.7342349197085
      }
    }
  },
  "name": "Phoenix Indian Restaurant",
  "place_id": "ChIJ-d2VabkR2jERYQ1K_MKnO1M",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Amutha prakash",
      "author_url": "https://www.google.com/maps/contrib/116532026409587481693/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVeU1Y1PfYhTxNghSad9b8jMj7qcJgY4gmsu0I-l6bIYuccLqAh=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Phoenix Restaurant provides a cozy and inviting atmosphere, making it an ideal choice for a relaxed meal. The menu offers a range of dishes for both vegetarians and non-vegetarians  but my experience was limited to non vegetarian options.\n\nThe food is straightforward—simple yet flavorful, offering a satisfying dining experience without being overly complex. The setting is warm and comfortable, making it a good spot for a quiet, intimate meal.\n\nIn short, it's a pleasant option if you're seeking a calm and enjoyable place to dine. Highly recommended Phoenix !!",
      "time": 1736919771,
      "translated": false
    },
    {
      "author_name": "Ng Shing Yunn",
      "author_url": "https://www.google.com/maps/contrib/102971474312143449364/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK8Ff0Wqzjt1UeSHlZej_GKVIGTFr7IVDb3YK1RSXYfMZN5-Q8=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "Cosy restaurant hidden inside Science centre serving delicious Indian cuisines. Price reasonable and affordable. Enjoyed the dishes Gobi Manchurian , lentil soup and soft fluffy garlic naan with potatoes .",
      "time": 1723889938,
      "translated": false
    },
    {
      "author_name": "Rheddy Setgo",
      "author_url": "https://www.google.com/maps/contrib/107702284721775188115/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW_Bz85XEApD0-TQPV3yMBM8NvdWQB9lTd6mv4zg-9MRWEw7HwkVg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Very clean! Delicious authentic homemade tasting food. The butter naan is the best we’ve had during this trip. It rivals some of the best Indian food in California! Butter chicken could’ve used a bit of sugar but still excellent. It depends on your taste! The atmosphere is nice and cool and relaxed. You can find it inside a building in Kid Stop.",
      "time": 1701513379,
      "translated": false
    },
    {
      "author_name": "Abinaesh Thirukonda",
      "author_url": "https://www.google.com/maps/contrib/103669052526527682705/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLmFJWqK6c5NI7FjL_oG-LMCOTkSHNAHBQZE7ZO4tM6JoYaKFKF=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "10 months ago",
      "text": "This restaurant is inside the Kids stop of Singapore science centre. They serve good varieties of Indian dishes both vegetarian and non-vegetarian with more varieties to choose from vegetarian. The price of the dishes are reasonable for the quality and the atmosphere.\n\nAmong the food items served, Non vegetarian starters are quite tasty compared to the main items of curry or gravy. Naan and roti varieties are good and the chicken biryani is good too.\n\nIn the desert, plain kulfi and mango kulfi are must to try.\n\nThey serve beers and alcoholic drinks too which suits gatherings with friends for party or casual hangouts.\n\nOverall it's a decent restaurant with an affordable price and good food.",
      "time": 1720658881,
      "translated": false
    },
    {
      "author_name": "Jdmm Tgv",
      "author_url": "https://www.google.com/maps/contrib/104442987327733076271/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocItlRv0LTZDDmQch5dMpkExlDpl2a3iFR6xRESgtcXhSb0vmg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Looking for a place for lunch with 2 young children at the Science Centre and the other restaurant (Stella) had a line outside and food wait time was 30mins.  We saw that this place at KidsStop had seats so we decided to give it a try.\n\nWe were impressed. Staff were polite, helpful and very considerate of young children’s palates. They suggested good non-spicy options and offered to adjust spice levels on their own initiative. We ordered a naan basket with butter chicken (yum!) and wanted to add on another main but staff advised against. Indeed, we didn’t need it as they were so generous with the portion size and we were stuffed!\n\nThe naans were fresh, soft inside yet crispy on the outside (kids loved it). Sides of papadom, aloo paratha and mango lassi were also amazing. Service time was also speedy, very important when waiting with hangry children (and adults) 😅. Thumbs up, thank you for the excellent service, will certainly be back! Do try out this place if you’re visiting",
      "time": 1727503410,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5997571784672152929",
  "user_ratings_total": 761,
  "vicinity": "KidsSTOP 21, Jurong Town Hall Road, Omni theatre building"
}