{
  "formatted_address": "170 Upper Bukit Timah Rd, #09-02 Shopping Centre, Singapore 588179",
  "geometry": {
    "location": {
      "lat": 1.34296,
      "lng": 103.7760543
    },
    "viewport": {
      "northeast": {
        "lat": 1.344340330291502,
        "lng": 103.7772654302915
      },
      "southwest": {
        "lat": 1.341642369708498,
        "lng": 103.7745674697085
      }
    }
  },
  "name": "Physio And Sole Clinic (Bukit Timah)",
  "place_id": "ChIJcV5a-okQ2jER2PlZGWYseag",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Yong Rebecca",
      "author_url": "https://www.google.com/maps/contrib/118279694152707835956/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI0KSko_w2ACyFMI1yIT4wm_3x1PBq8CNvXRTiFufDo4HlUEg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "When I first stepped into the Consultation Room of Nicodemus, it lent a peaceful tranquility. He put me at ease and gave his listening ear on my concern.  I knew that his check on my condition was very thorough in order to explain so I could appreciate the reason of going through the recommended exercise regime. This is a superb approach - that of teaching independence and ownership. Finally, he prescribed the remedy with three sets of exercises with full assurance that if I worked hard on them, there would be good outcome. He never once coerced for a repeat visit. This is professionalism!",
      "time": 1740033650,
      "translated": false
    },
    {
      "author_name": "Lui Chen Tan",
      "author_url": "https://www.google.com/maps/contrib/107152626065176418467/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUG8SKCC06yllBxUEu3xQapNYIQmaEDoqGzUbtuZ3CYWhDMhh-e8w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I had a plantar wart on the ball of my foot, and it was painful to walk on. James was my podiatrist. He is very professional, patient, and kind. During each session, James would take time to treat the wart without causing any pain. I was also given detailed instructions on taking care of the wart at home, which I feel sped up the recovery process. After the first few sessions, there was no more pain when I am on my feet, and after a couple more, my wart is gone!\n\nThe receptionists are very friendly too. They are very accomodating when I had to change my appointment.\n\nThe clinic is very clean, and the tools are properly sterilized. Overall, I am glad that I chose Physio and Sole Clinic for my treatment.",
      "time": 1740901572,
      "translated": false
    },
    {
      "author_name": "viviencky",
      "author_url": "https://www.google.com/maps/contrib/105459355419868075051/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUQNTKBXSzd1fweTwq5RTNF3p1y4pqoETfAyGowBxpV0nmXfOjV=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I first found the clinic through Google. I had back pain problems after straining my back due to exercise and consulted Mr Su Yunfeng for physio. He always listens, is patient, professional and always offers practical advice. After a few sessions my back was much better and almost back to normal.\nI also had to visit the clinic for my 5 year old son who had a big toe ingrown toe/ infection and it hurt him so much that he couldn’t walk. We were anxious to get it treated asap, Mr James Teoh was our podiatrist and he was gentle, patient, detailed and kind to my son. Thankfully after the treatment my son managed to walk (and run) again!\n\nThe receptionists at the clinic are always professional, polite and provide great reminders for appointments.\n\nWould definitely recommend the clinic!",
      "time": 1740842816,
      "translated": false
    },
    {
      "author_name": "J K",
      "author_url": "https://www.google.com/maps/contrib/116466942973674100884/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJl73JbgCcXiWyZXYv6OVrpj4g6Isf5PjhWp_qXZ-nF9oB1bw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Thanks to my physiotherapist Nicodemus for everything. He is an excellent physiotherapist and thanks to all the lovely staffs there. My frozen shoulder is gone because of all of you. Thank you again!!!",
      "time": 1745901047,
      "translated": false
    },
    {
      "author_name": "Deepanshu Kalra",
      "author_url": "https://www.google.com/maps/contrib/118038577795269752452/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI0zg0tCuMPPvAiqEnQ7GNbJWcehV3hN59fPeBrnJU02D36AQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Yunfeng is an excellent physiotherapist who helped me fully recover from a grade 3 ankle sprain over 4 months. He was extremely patient, knowledgeable and thorough throughout my rehabilitation. Yunfeng always remembered our previous conversations, even when I saw him after weeks or a month. His progressive exercise plan was instrumental in getting me back to vigorous workouts at my gym.\nThe receptionists were wonderful as well, very prompt in their messages and scheduling appointments. I highly recommend Yunfeng for his expertise, personalized approach and ability to help patients achieve their recovery goals. The entire team provides top-notch care and service.",
      "time": 1725885614,
      "translated": false
    }
  ],
  "types": [
    "physiotherapist",
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12139783087577496024",
  "user_ratings_total": 114,
  "vicinity": "170 Upper Bukit Timah Road, #09-02 Shopping Centre"
}