{
  "formatted_address": "3 Temasek Blvd, #03-356, Singapore 038983",
  "geometry": {
    "location": {
      "lat": 1.2955208,
      "lng": 103.8596016
    },
    "viewport": {
      "northeast": {
        "lat": 1.296783230291502,
        "lng": 103.8608484802915
      },
      "southwest": {
        "lat": 1.294085269708498,
        "lng": 103.8581505197085
      }
    }
  },
  "name": "Picture Me",
  "place_id": "ChIJSTSl664Z2jERhasbkSxxgaY",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Wei Jiang Yia",
      "author_url": "https://www.google.com/maps/contrib/113652049797649033204/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIF-ex4PKkRStPp_9NZZOzD38wVU3kFoXIHnWwm8H6yIQxrcQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "On the 26th of January 2025,\n, a concerning incident occurred during my family's scheduled photo session\nat Lilipop Studio (picture me), located at Suntec City level 3, #03-356. Upon arrival at the studio with my family of five, including my wife and three daughters aged 10, 14, and 18, we encountered a distressing breach of privacy that I feel compelled to bring to your attention.\nUpon entering the studio at approximately 1:55pm, we were directed by a male staff member to a large white curtained area for our photo session. Shortly after, my wife discovered a hidden camera in the changing area, which was both unexpected and distressing. This situation not only caused discomfort and embarrassment but also raised significant concerns regarding our privacy rights.\nIt is evident that the actions of Lilipop Studio (picture me) in directing clients to an area under surveillance without prior consent constitute a serious violation of personal privacy. Such practices are unacceptable and must be addressed promptly to prevent similar incidents in the future.\nAs a entian in intestigation in his pith breten. I am prechie do to regent adiren\ninformation or assistance required to address this issue effectively.\nFurthermore, I intend to pursue all available avenues to ensure accountability, including seeking support from relevant authorities and publicizing this matter through various media platforms if necessary.\nI kindly urge you to take swift and appropriate action to address this grievance and prevent the recurrence of such violations in the future. Your prompt attention to this matter is highly appreciated.",
      "time": 1741187320,
      "translated": false
    },
    {
      "author_name": "Claudia",
      "author_url": "https://www.google.com/maps/contrib/100101292359561482982/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXAqCzFz_Pm4ahoAcm7S5em5LYRTYaqhKQU2AzXDPgzq6eBDI99=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "After a month, I decided to top up payment for a half body shot taken in Mar 2025. I called Aisha to trace my profile and pictures, and she took action immediately. Then the picture I selected was done up and emailed across by Celeste within the day.\n\nI hope this review gives buyers and shoppers confident to give Picture Me a shot. I also like to send encouragement 🙏🥰and appreciation to people who really try their best for customers!",
      "time": 1745502241,
      "translated": false
    },
    {
      "author_name": "Lisa Goh",
      "author_url": "https://www.google.com/maps/contrib/112035271188201892319/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLbmNv_hLtVTA7GCuS1mensfaZiA719XTDIsK6RPWHbj4ACmg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Vivi, the make up artist has been very professional & patient in perfecting the our makeover look. Marco, the photographer, is also very quick & able to make you feel at ease. Eve, the receptionist & editor is very professional & patient. She tried her best to edit my photo naturally according to my request patiently.",
      "time": 1746001250,
      "translated": false
    },
    {
      "author_name": "Amelia",
      "author_url": "https://www.google.com/maps/contrib/102935969516164562518/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVh35HQo0sTVMmxvfM2BSe8fodUmqRAW3uZnUlH1KAv1b8vs0U4=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I had an excellent experience with Picture Me Studio! They helped me seamlessly Photoshop my photo onto the uniform without needing to visit the studio in person. Saved me lots of time as I didn’t have to travel all the way down. Very convenient. The result was impressive - crisp, professional, and exactly what I needed. Highly recommend their services for anyone looking for top-notch photo editing! Thank you, Wendy!",
      "time": 1735911075,
      "translated": false
    },
    {
      "author_name": "M. Low",
      "author_url": "https://www.google.com/maps/contrib/108742539947873628484/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIz5He2YfLeOX2RCabpOqhtsPFDUh_ZDwWur6C2kSdTG-eVNA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I had a fantastic experience at Picture Me at Suntec, thanks to the exceptional service provided by Isa (customer service/make up) and Gary (photographer).\n\nIsa was friendly. patient and professional.\nShe explained the various packages available and recommended one that suited my needs.\nIsa's make up skill and attention to detail ensured I looked my absolute best for the photos :)\n\nGary was skilled, patient, and creative. He made the session enjoyable and comfortable, guiding me through poses while capturing beautiful shots that truly exceeded my expectations.\n\nTheir dedication to providing top-notch service and quality work truly stands out!",
      "time": 1734618116,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11997995318518721413",
  "user_ratings_total": 439,
  "vicinity": "3 Temasek Boulevard, #03-356, Singapore"
}