{
  "formatted_address": "241 Beach Rd, Singapore 189753",
  "geometry": {
    "location": {
      "lat": 1.300113,
      "lng": 103.8595413
    },
    "viewport": {
      "northeast": {
        "lat": 1.301416630291502,
        "lng": 103.8609145302915
      },
      "southwest": {
        "lat": 1.298718669708498,
        "lng": 103.8582165697085
      }
    }
  },
  "name": "Piedra Negra",
  "place_id": "ChIJNXNVrbEZ2jERFPPHBFHMMfE",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Marek Lew",
      "author_url": "https://www.google.com/maps/contrib/103923703570310955569/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWES7o47vn7ct8yKmsN5iFqFacfaO6uKcgNrVPl2S0fwULKuezCqg=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Absolute cracker of a bar & diner , very reminicent of New Orleans/Mexico.\nStaff were great , drinks cold , Neopolitan style pizza as good as you're going to get from any decent pizzeria, great music and super lo9cation to kick back & watch the world go by , as usually happens ..... you find one of the best bars on your last night 😢 would return here without a second thought so no hesitation in recommending.",
      "time": 1743584429,
      "translated": false
    },
    {
      "author_name": "Faris Karsheh",
      "author_url": "https://www.google.com/maps/contrib/110370541304346980764/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWIdr2CGUfB3g6pw3uYRVKy3IYOcKi_h7Z_D9rQHEPlTHeOm-fE=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Overall is a very good experience and I will come back again. Food was really good and served quickly for such quality. Taste is rich. The Latin touch was nice. Staff are responsive and were able to accommodate some special requests regarding order. It is a bit confusing to find different menus from different restaurants in the same place, however this is the case for all restaurants in the street, so don’t be surprised if. I consider the restaurant clean and accessible with wheelchairs",
      "time": 1737546465,
      "translated": false
    },
    {
      "author_name": "jayden",
      "author_url": "https://www.google.com/maps/contrib/105743541374316989018/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLwULvJdQDmvny72TJa5YalPplbiH7oOpP8fRxWfUiYNkgQ6pmd=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Intially was skeptical about the food here as this area is more towards tourist attractions and we were doubtful on the authenticity and quality of the food, however it change my opinion totally after trying it out!\nThe mutton Rogan josh was surprisingly fantastic and awesome! No doubt about it being stewed for 6hrs as per menu, the mutton meat is tender and soft, in fact its one of the easiest to chew after eating from many restaurants locally and overseas. The gravy is filled with herbs, it's not overpowering however yet just the right amount, even have an after Herby taste and even the meat has the taste in it too which is another evidence towards stewing it for long hours.\nOne bowl of the mutton is enough to even share with 2 pax and with the gravy definitely makes you eat another bowl of rice! (However the curry was slightly lukewarm, which would definitely be a 5 Star if it was warmer/hotter)\nThe chicken dum biryani is yet another awesome dish and definitely had a different unique taste compared to other places, the meat is also soft, smaller in thigh/drumstick, tender and the rice has a unique spice flavour to it.\nWe ordered jalepano poppers for starters as recommended by the Thai staff Lin, it was definitely a good recommendation for starters and in fact this was our first time eating jalepano in such a way, it's covered in batter and deep fried with cheese melting inside.\nAnother eye opening dish was the samosa which we were amazed of how they can turn a simple food which is available even in coffeeshops to turning it into a dish decorated sofiscitatedly with fine dining essence, the potato filling in it is definitely puff up and the condiments which is similar to \"pani puri\" sauce goes uniquely well with it, in fact if they were to sell pani puri, I would definitely order it.\nApple juice is also tastable of 100% pure juice, refreshing and nice to drink.\n\nSHOUT-Out to the friendly staffs on ground Especially LIN who was mending the bar counter was friendly and took the initiative to take our orders too even it feels her job was in charge of the bar station drinks, she's very friendly and welcomes us with a warm smile, she recommended the mutton Rogan josh to us instead which we only wanted to try out the normal mutton biryani, which turns out to be the best recommendation. Great service definitely adds on the dining experience!",
      "time": 1743925663,
      "translated": false
    },
    {
      "author_name": "Yuly Mirawati",
      "author_url": "https://www.google.com/maps/contrib/118082344017945085518/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ-UPJgw6LKDJ1oXtq6cv9poxpO-x6tloPqHLMc7MYqHVQVVw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 2,
      "relative_time_description": "2 months ago",
      "text": "Very disappointed at bad service we had during dinner last night. The service staff basically wear a black face, not attentive at all (few times pretended not seeing hand waving in the air). Gave us the wrong bill and forgot to pack the left over food. A man sitting next table to us was smoking away and the staff said nothing. I highlighted to him and he went “where?” 🙄 (the man finished by then) will not return ever.\nFood was fine, seasoning is light. I dont mind it, but for most maybe can be under seasoned. Almost cant taste any salt in the Guacamole.",
      "time": 1742021600,
      "translated": false
    },
    {
      "author_name": "Jessica K",
      "author_url": "https://www.google.com/maps/contrib/110408027871155200937/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV0eumyAz32jGrgv9rRej90LMWC7kjQRgedNYHR5Jr1JeU2b8YA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 3,
      "relative_time_description": "2 months ago",
      "text": "We heard good things about this place and decided to give it a try. We live in Texas and eat Tex-mex food frequently. The indoor seating area is small (kinda cramped) but the outdoor has more seating tables. The service was good but the food was alright. The meat in the beef quesadillas was more of a shredded meat (almost pot roast) than beef fajitas. The beef tacos were also ok.",
      "time": 1740748359,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17379897085344084756",
  "user_ratings_total": 1910,
  "vicinity": "241 Beach Road"
}