{
  "formatted_address": "5 Hamilton Rd, Singapore 209177",
  "geometry": {
    "location": {
      "lat": 1.3112838,
      "lng": 103.8606993
    },
    "viewport": {
      "northeast": {
        "lat": 1.312595330291502,
        "lng": 103.8620743802915
      },
      "southwest": {
        "lat": 1.309897369708498,
        "lng": 103.8593764197085
      }
    }
  },
  "name": "Pillow Talk Hostel @ Bendemeer",
  "place_id": "ChIJ1-Luh2MZ2jERbBiqaHddIwA",
  "rating": 3.6,
  "reviews": [
    {
      "author_name": "Rachel Feeney",
      "author_url": "https://www.google.com/maps/contrib/111169101919598446850/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWZA4AD8ocMXrg4kCVespBJU7MbSzeTn31lVElIUckpkgonWtxE=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "5 years ago",
      "text": "Overall good hostel. Double bed was very big and place was clean! Not very noisy either. Great place to just sleep and explore Singapore for the rest of the day. Downside was that reception is only 9am-9pm so not always around to help but all staff were very nice. Hostel was also quite cramped for the amount of guests, especially bathrooms. Overall good for the price!",
      "time": 1561099368,
      "translated": false
    },
    {
      "author_name": "Shekhar Upadhyay",
      "author_url": "https://www.google.com/maps/contrib/116477642317940809270/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVFGXJEul_1WzNakCIimtU2-xNJtc-e9prTI3b9agDiri336CqU=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 2,
      "relative_time_description": "6 years ago",
      "text": "This hostel is good for those travellers who are just interested in catching 40 winks and can sleep no matter how noisy it is outside their pod. Also AC stops working just when one is trying to retire for the day. Just can't sleep. The guy at reception says can't do anything. Only advantage this hostel offers its proximity to the MRT station. This place is good for only one visit unless the person cannot afford anything else decent in Singapore.",
      "time": 1551975223,
      "translated": false
    },
    {
      "author_name": "Wayan Meila",
      "author_url": "https://www.google.com/maps/contrib/111697005560860600111/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUBvW2D3Wm3AUlGrGPg2eMx4cRdCFYx7oeGDCZCKGyMxkHQMrMO=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "7 years ago",
      "text": "I found Pillow Talk Hostel by internet when comparing their prices online, their prices are very affordable. Located near MRT (4-5 block away, 15 minutes walk), also located near the food court, peace environment, got your own room key, locker, same gender room available (I got female dormitory). Everything is basically self service like the breakfast (burn your own toast and jam), the owner aren't interfering with your schedule. But the space is quite limited, like the room, the dining room and bath room are separated in close proximity, a reflection by the price we pay. Overall, nice stay.",
      "time": 1515166555,
      "translated": false
    },
    {
      "author_name": "早川真由（田中華子）",
      "author_url": "https://www.google.com/maps/contrib/111274913392695421292/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUJOiAbSWDhJ2Fq6q_CSjIJU8e7Gi9Gb2X2WGkqsUVPvVoj4y8=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "7 years ago",
      "text": "Good location, good staff, and low price!\nHere is good for back packers, not suitable for ordinary tourists. Bad point was....Break fast was only bread and Room was too cold at night, so it's better to sleep down bed. Hair dryer and cloth washers are available.",
      "time": 1514811211,
      "translated": false
    },
    {
      "author_name": "Jen",
      "author_url": "https://www.google.com/maps/contrib/101089222704901301061/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocICqTEFJc6wD_ta_wJJudRG7b7xkIRFMPQbzfHF8NsJ4VV01WO1=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "7 years ago",
      "text": "The only way I would recommend this hostel is if travellers were needing a cheaper space to stay for the night and didn't care about their living condition. The bathrooms were very small, dirty and they usually smelt awful. The brick wallpaper was falling off in our capsule. There is a no talking rule in the bedroom and security cameras on every corner, thus making it very hard to communicate with other travelers. They provided dirty slippers to use that was shared among all travellers. Free breakfast is a piece of toast with jam and half the time the jar of jam was empty... We slept under the air conditioner and we weren't able to get extra blankets the first night because there is no night staff. The location isn't the best, it's pretty far from the Gardens. The pictures displayed online did not matched what we saw in person. The common areas, where we were actually able to talk, would be rated a 0 out of 10. This is the worse hostel I have ever been too. If you can, spend the extra money for another spot in town.",
      "time": 1526975650,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9954391623342188",
  "user_ratings_total": 127,
  "vicinity": "5 Hamilton Road"
}