{
  "formatted_address": "633 Tampines North Dr 2, #02-06, Singapore 520633",
  "geometry": {
    "location": {
      "lat": 1.3657377,
      "lng": 103.9414527
    },
    "viewport": {
      "northeast": {
        "lat": 1.367130430291502,
        "lng": 103.9428619302915
      },
      "southwest": {
        "lat": 1.364432469708498,
        "lng": 103.9401639697085
      }
    }
  },
  "name": "Pinnacle Family Clinic (Tampines North)",
  "place_id": "ChIJydwhGQA92jERN9v7Jbn4WUw",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Lisa T",
      "author_url": "https://www.google.com/maps/contrib/101998729191684176802/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKeFDn-duE5HzLALt3mTye4XszHrfF9fRpqiWBTJTWMWw1BhWY=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "Clinic is clean, quiet and no queue. It looks like it’s newly opened in the BTO area. This doctor is by far the one that will ask me questions/listen well and not just give nods and write when I share my symptoms. Lady at the front desk was super efficient in preparing medicine and collecting payment. Not smiley but does her job well.",
      "time": 1735188441,
      "translated": false
    },
    {
      "author_name": "Chong Tee Lim",
      "author_url": "https://www.google.com/maps/contrib/109461726488295375671/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU2dP50qgTd-QOr7vth7K6WXE2Lp0LCY_TuE3BoUBP4sT65JGUAFg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "I recently visited Pinnacle Family Clinic at Tampines North and had a wonderful experience. From the moment I walked in, I was greeted by Ms. Cheryl, the receptionist, who was incredibly helpful and polite. She responded to my queries quickly and with ease, and her great personality truly made a positive impression.\n\nDr. Jon Lim Ming Liang was attentive and patient. He was very helpful and patient, taking the time to answer all of our questions attentively. His caring and kind nature made us feel at ease throughout the consultation.\n\nThe clinic itself is clean and neat, with an air filter at the entrance to ensure the air is fresh and free of harmful germs. This extra measure shows their commitment to maintaining a healthy environment for their patients. Additionally, the small play corner for kids is a thoughtful touch, providing a distraction for young children while waiting.\n\nOverall, Pinnacle Family Clinic at Tampines North offers excellent service, and I highly recommend it for anyone in need of medical care.",
      "time": 1720509076,
      "translated": false
    },
    {
      "author_name": "Casper Chu",
      "author_url": "https://www.google.com/maps/contrib/100846245554184812447/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXCIpuaRMhr5zNr3zn98iRz1mVWs2yXgQUrsjgQIRDsYxV3GuVF=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "I had a high fever of 39.5°C for the past three days and wake up early to see a doctor. It was my first time at this clinic, but I was greatly disappointed.\n\nDr. Kong only asked a few simple questions and didn’t even check my temperature or blood pressure, despite my high fever. When I requested a swab test or blood test, the response was that it wasn’t necessary! Instead, I was told to go home, take some basic medication, and come back if the fever didn’t subside. The prescribed medicine didn’t even include basic antibiotics.\n\nIt’s terrifying to see such a negligent doctor! I won’t be coming back.",
      "time": 1740619336,
      "translated": false
    },
    {
      "author_name": "EDMUND CHEW",
      "author_url": "https://www.google.com/maps/contrib/108344178212436117597/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKriHLY8knvS7dWSHlvRV-hLs4bVOHQJS8_8Vgwb706TMte2Q=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "I had an absolutely terrible experience this morning. Dr. Kong Rui Ting has been administering my injections every two weeks for some time, so I was expecting the same today.\n\nI arrived and waited for at least an hour due to a long queue, only to find out that a different doctor was on duty. While this wasn’t an issue for me, the doctor apologised and informed me that he wasn’t familiar with my specific injection, so he couldn’t administer it.\n\nI would have appreciated it if the counter staff had checked with the new doctor beforehand to confirm whether he was familiar with my injection type and able to administer it. After waiting for an hour, the counter staff told me to come back later in the day when a different doctor, who knew how to administer the injection, would be available. This situation is incredibly frustrating. What if I had been in a rush, or had other commitments or didn’t live nearby?\n\nI then went to Our Tampines Family Clinic, where the staff immediately checked with the doctor on duty. He confirmed that he knew how to administer my injection based on my specific type before giving me a queue number.\n\nI am extremely disappointed with Pinnacle Family Clinic (Tampines North), and my time was certainly wasted!!!",
      "time": 1740109906,
      "translated": false
    },
    {
      "author_name": "Choong Yee mooi",
      "author_url": "https://www.google.com/maps/contrib/109165671110163359454/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKbdvauUec1T0vwAP1sLg5NIW9GgK6XRZvJ6TIT1UgUUS4UUQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Good experience with this clinic. When there before CNY, although clinic are crowded but Dr Kong still patience seeing me. Very sick on that day. Clinic staff hmm... if not wrong her name Jes are friendly to every patient.",
      "time": 1738374748,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5501701893899672375",
  "user_ratings_total": 32,
  "vicinity": "633 Tampines North Drive 2, #02-06"
}