{
  "formatted_address": "651 Jurong West Street 61, #01-06, Singapore 640651",
  "geometry": {
    "location": {
      "lat": 1.3372618,
      "lng": 103.6967782
    },
    "viewport": {
      "northeast": {
        "lat": 1.338548480291502,
        "lng": 103.6980778802915
      },
      "southwest": {
        "lat": 1.335850519708498,
        "lng": 103.6953799197085
      }
    }
  },
  "name": "Pioneer Medical Centre",
  "place_id": "ChIJVdDqLJAP2jEROmwBNd004iM",
  "rating": 2.6,
  "reviews": [
    {
      "author_name": "See Hoe Pin (Alex)",
      "author_url": "https://www.google.com/maps/contrib/103814031129528005759/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWGwRFickkwqAIvKdgZBQdkj9C0ZrIhOhMQJ0MWVA9gIu2jgJ8acQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "What the hell is the doctor doing?\nTrigger happy and press the queue number in split second. You guys make your patient wait outside your clinic and now you expect your patients to teleport into the doctor room? Wake up please, even if you have a lot of patient it's not our problem. Because of you the qeune number was disrupted and some patient jumped qeune courtesy of the doctor. And please tell your front desk staff to be more professional",
      "time": 1744130847,
      "translated": false
    },
    {
      "author_name": "khaingzar aung",
      "author_url": "https://www.google.com/maps/contrib/101688665253727181999/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUuFBEneu3V7EMwGt8sIDrH6Dy3Ztv7PelIxhfhy0Ch-Bk4BN3hxw=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "4 months ago",
      "text": "Waiting time is too long. More than two hours to see doctor. Never open their announcing time. Doctor never reach right time. Consultation time is short period a few min only. Please respect timing and patients. Most of the patients are really sick.\nStaffs never serve seats for patients. 3 or 4 persons only can sit inside of the clinic.\nDoctor and staffs are OK. My point of view is waiting time and seats.",
      "time": 1736338662,
      "translated": false
    },
    {
      "author_name": "samita pey",
      "author_url": "https://www.google.com/maps/contrib/102232534584131046641/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUa2WESu3SHs8-8p9WtXcIYrjd69Pb4ZHRAa5L3GY_k0UtLqYFNFQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 weeks ago",
      "text": "Extremely disappointed with the experience at this clinic. I was queueing outside for almost an hour, carrying my very sick son the entire time, waiting for them to open. When I finally got in, the staff informed me that the replacement doctor on duty does not see children under 4 years old. There was no notice or information posted outside to inform patients about this, which could have easily prevented all this unnecessary waiting and stress, especially for a parent with a sick child. Very poor communication and absolutely unacceptable.",
      "time": 1745232792,
      "translated": false
    },
    {
      "author_name": "Salwa Halid",
      "author_url": "https://www.google.com/maps/contrib/110727399083236084099/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV2TJZwxFYADPDO4oTCGk-dvocCjPP2VkScb81r_-yifpN4ziY3=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "Registered at 8:30am but the doctor is not in till close to 9:30am and the first queue number haven’t even been called. The worst clinic ever. If doctor cannot come early, then say clinic open at 9:30am.",
      "time": 1734398713,
      "translated": false
    },
    {
      "author_name": "KA Fankabelle",
      "author_url": "https://www.google.com/maps/contrib/113834569863835973846/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLdmyR3hjtMbneNxX9Ctgc9CxLTM9CyjFkv6C12TjKW5YlvYA=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "4 months ago",
      "text": "My family and I have been visiting this clinic for years. We understand that the waiting time is long but we were ok with it, as long as we are able to get treated. The doctors are generally nice, patient and thorough when we consult them. The counter staff were ok in general. However, my recent experience in this clinic was disappointing. The counter staff was extremely rude and impatience. I politely asked a question about collection of medication (we waited for at least 20-30 mins already but still not called upon to collect) but received the following unpleasant responses:\n- Wait... Can you wait? Wait for few minutes... Just wait...\n- I am very busy. You just have to wait... Doctor still need to XXX\n- Doctor, can you XXX, the patients are complaining already\nWe understand that the counter staff may be busy (by the way there are 2 counter staff). As patients/family members, we do not want to make things difficult for the staff. What we wanted from the counter staff was that our responses to be answered politely, and be respected. I sat inside the clinic and observed that this counter lady, for every question that patients asked, her responses would be very hostile and rude, and unpleasant. One patient claimed that he was asked to come down to the clinic at 10.30am, but this counter rudely responded \"No, I did not said that (x2)\". The patient left the clinic, probably feeling why he was treated that unpleasant way when he was already sick.\n\nAll in all, doctors are good, but the system in terms of registration and medication collection needs to be improved. What is more important is, the counter staff (working on 26 Dec morning), needs to work the way she responds to patients. If every patients that asked you a question and you need to be so reactive, defensive, hostile and rude, then the problem lies with herself. She is busy, the clinic is busy, but so are we. Please give us the respect that patients deserve when we visit the clinic.",
      "time": 1735216198,
      "translated": false
    }
  ],
  "types": [
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2585687260745788474",
  "user_ratings_total": 85,
  "vicinity": "651 Jurong West Street 61, #01-06, Singapore"
}