{
  "formatted_address": "160A Jln Teck Whye, Singapore 681160",
  "geometry": {
    "location": {
      "lat": 1.3803814,
      "lng": 103.7572992
    },
    "viewport": {
      "northeast": {
        "lat": 1.381806930291502,
        "lng": 103.7585486302915
      },
      "southwest": {
        "lat": 1.379108969708498,
        "lng": 103.7558506697085
      }
    }
  },
  "name": "Planet Bakso Sambal Bakar",
  "place_id": "ChIJ-WHNUwAR2jERV8ycT7oz9Rc",
  "rating": 3.3,
  "reviews": [
    {
      "author_name": "Faisal Sani",
      "author_url": "https://www.google.com/maps/contrib/104477553258816382365/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLtAN3Gsnk7rOYlU9hlGYom88AGheyfnB-5v3uJjnlCUKYKQQ=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "3 months ago",
      "text": "First time i visited this new \"tik tok viral\" Planet Bakso malay eatery stall at Jalan Teck Whye coffee shop. On 31 January 2025 Friday night, which I assumed 2 days of Chinese New year public holiday (CNY) has ended before and it is a Malay eatery stall. For your info, I am not living around jalan teck whye. So I am giving here my experience there.\n\nUpon my arrival of the mentioned coffee shop at night, I looked afar and saw that a big muscular malay guy was carrying a guni sack of rice into the Planet bakso stall and I thought they were closed. So as to not wasted my trip there, I approached the stall cashier. There it was the big muscular malay guy standing at the stall cashier. I asked him politely, \"are you guys still open or close for business\". His replied was very rude like customer's owe him money in a way, \"why you asked, can't you see that we are here\".\n\nSo as I not to have any further uncomfortable experience with that stall, I just ordered my dishes as I want to see what is so viral about their dishes.\n\nUpon my ordering of my dishes to the big muscular malay guy, I noticed at the cashier there is a sign displayed indicating that a bowl of soup is chargeable at $1. So I continued my order of 1 dish \"rusuk bakar with sambal hijau\" and 1 dish \"ayam goreng with sambal gami\", to dine in. Then the mentioned guy asked me, \"any soup for me\". I replied \"no\". Because I knew he will charged an additional $1 for each soup.\n\nThen I paid for both of my 2 dishes which he did not hand me my receipt. So After paying i asked the guy, \"can I have my receipt\". He replied in a blur face, \"oh ok... I will give your receipt upon collection of your dishes\".\n\nThe reason why I asked for my receipt is to know what is the breakdown of prices that I ordered and why the cost is slightly higher.\n\nThen true enough after collecting my both dishes from the stall, I was shocked to see on my receipt that the malay eatery stall charged their customers an additional $1 CNY surcharge for each dish. Without letting their customers know about these additional CNY surcharges before customer start to order at the cashier. No signages were displayed about this CNY surcharge at their stall.\n\nAs for their dish tasting:\n1) rusuk bakar with sambal hijau - my rating is 2/5. The meat was chewy like rubber band which stuck in between my teeth and the meat gravy taste was bland. Nothing special at all. Only their sambal hijau was very spicy. The rice was ok for me.\n\n2) ayam goreng with sambal gami - my rating is 2.5/5. The sambal gami is very very spicy and it was more to oily spicy type. The rice was ok and The fried chicken is ok too. Nothing \"wow\" factor taste of this dish. Just a typical dish.\n\nMaybe because their viral dishes is just for Bakso dishes and not other else. But too bad, i don't eat bakso dishes. Well we are a paying customers and this is my experience and opinions. So this will be my 1st and last time visiting this \"planet bakso\" stall. There are more other eatery brands of good nicer tasting dishes and better customer service to visit in Singapore.\n\nPs: see my attached photos taken and receipt. I indicated in green arrow to show the big muscular malay guy at the cashier but he noticed me and turned his back while I took this photo from afar. Also, see my receipt which indicates the CNY surcharge. Anyone who cannot eat spicy sambal, you can just don't eat their sambal. Because it is very spicy. No joke about this as photos can be deceiving.",
      "time": 1738482740,
      "translated": false
    },
    {
      "author_name": "HOG RGST Traveller",
      "author_url": "https://www.google.com/maps/contrib/105192444470487012114/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW2jvXDmuAAbjFQJRk9JfSvHRSQWJdRBDZfgiROLDzwDzXueGUc=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "The best Bakso I have savoured in a long time being SG. Simply delicious and perfect. Generous beef balls  sized,  great portion and excellent chilli!",
      "time": 1733885859,
      "translated": false
    },
    {
      "author_name": "#janjiHalal",
      "author_url": "https://www.google.com/maps/contrib/108758946225990535484/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUYk63VcdErNaCpAstk9JrTc7Ylv0u3cuvfMUHo68UABFmKfdkF1Q=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Outdoor dining at Planet Bakso. Great & friendly food owner Ramlan. Superb marvellous range of bakso for you to choose from. Different range of level spiciness to suit your taste buds. Will venture next time on their different Ayam Sambal bakar. Just stay tune Guyz….#janjiHalal حلال",
      "time": 1729918701,
      "translated": false
    },
    {
      "author_name": "Peach Mint",
      "author_url": "https://www.google.com/maps/contrib/112428196440653463189/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUww9ZBV3MI9DA-mI40pWnbav6P03GwaTAr6K2PNNn6usgPa7o=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "There are many variety of bakso ,sambal bakar dishes and variety types of sambal can be found here..\nLoves their rusuk bakar with their sambal bakar belacan. Spicy but it was soo goood... Not forgetting their bakso was tasty too...\nWhen they just open, the queue was super long.. Now looks like they manage to serve better..\nOverall, their foods was good and tasty..Service was good..\nThe owner was friendly too..\nNo wonder long queue, foods was so nice..\nNo regrets eating here... ♡♡♡\nLove it ! Highly recommended!",
      "time": 1730033824,
      "translated": false
    },
    {
      "author_name": "Shah Kasmuri",
      "author_url": "https://www.google.com/maps/contrib/114191846994246887807/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJcRKj1hwh8MNNvXjirujUyaG89i67ge642J4NDiot9UN1hR9k=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "2 weeks ago",
      "text": "The food has lots of MSG and preservatives. Hand made yellow noodle is soggy.\nTheres a chinese prayer and all the soot from burning papers flew down in the eaties area. Informed the stall owners and she said \"what can I do\". I inform the Rasa Rasa staff and they say its ok. This is my last trip",
      "time": 1746339834,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1726342907459062871",
  "user_ratings_total": 26,
  "vicinity": "160A Jalan Teck Whye"
}