{
  "formatted_address": "30 E Coast Rd, #03-15, Singapore 428751",
  "geometry": {
    "location": {
      "lat": 1.303798,
      "lng": 103.902951
    },
    "viewport": {
      "northeast": {
        "lat": 1.305171980291502,
        "lng": 103.9043521802915
      },
      "southwest": {
        "lat": 1.302474019708498,
        "lng": 103.9016542197085
      }
    }
  },
  "name": "PlayFACTO School Katong | Student Care Katong",
  "place_id": "ChIJJ6PJLBsZ2jERp9a0ZJAFAHM",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Josh FWK",
      "author_url": "https://www.google.com/maps/contrib/117558795820364148312/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIecuzoz9iiHiJPm6LfX-WY_2HQ_yVW0RZbGT_qQxQmh353pw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "To my surprise, this day care center offers wide range and comprehensive enrichment classes on weekday. My kid has more rest time over the weekend.\n\nThe creative math and robotic & coding are in-house designed.\n\nTheir classrooms are layout along window panels which come with good natural lights. Great day care environment for children.\n\nConvenient sheltered drop off point and ample carpark lots available.",
      "time": 1650162817,
      "translated": false
    },
    {
      "author_name": "C L",
      "author_url": "https://www.google.com/maps/contrib/115499710062147361520/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLIa5EgGyV5eDQc39rzAbdtr8RPbEj05Shz8tEyHs71XOAUkg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "We first enrolled him in Oct22 to start Jan23 when he will be starting P1. Papers signed, money paid. Thereafter there was no confirmation of any arrangement nor any details at all. Not even until first day of school 3Jan. Called them in the morning to confirm and they agreed that he will be picked up at the bus stop.\n\nOf course, they forgot to pick him up on the very first day of school. Eventually did it after some calls, panic and confusion.\n\nWent down in the evening to clarify and they promised it won't happen again. Even wrote down on a piece of paper the timings of his pick up.\nOn the second day of school guess what? They didn't pick him up again. And they could tell me that they threw away the piece of paper.\n\nOn 19Jan, received a msg from them saying the centre will be closed from 20-24Jan. Very last minute and difficult for us to make alternative arrangements. When I asked them about it, they said it was informed in the \"group chat\". Well what group chat i asked and the response is \"Playfacto Katong group chat.\" No inkling how I could add myself to a chat I'm not on but that is the simple response I got. It turned out to be a broadcast so you need to save their number down as a contact first.\n\nOn 1March it happened again.... no one picked my son up from the bus stop and this time their reason was because his teacher was on mc and no handover was done so no one knew he had to be picked up.\n\nWe didn't encounter any other major issues for the remaining time he was there, but they did also forget to call him in for robotics class once so I imagine it's pretty chaotic and disorganised inside.\n\nI hope over time and with the increased number of students you are getting that organization would be top priority as it was genuinely a very mentally draining couple of weeks at the beginning.",
      "time": 1731427116,
      "translated": false
    },
    {
      "author_name": "Jonathan Yap",
      "author_url": "https://www.google.com/maps/contrib/118192119001199897089/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUIHkkcZ4EG1qPdr9FvJ_GYfJ6DnTKKgmdxhviF8dUeaybL8dDk=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "My child is in primary one and she goes to playfacto katong v after school. I am very appreciative of the teachers there especially Ms Jiening who has inspired my child and her grades have improved since she started. No regrets sending her here.",
      "time": 1728890551,
      "translated": false
    },
    {
      "author_name": "Goh Zhu Le",
      "author_url": "https://www.google.com/maps/contrib/114654074429258967694/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVsGTXYOGHM-Tk7-PqrjfukJ6YG2EXEDFqFXT3PDezpthYdRPvR=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I'm delighted to share my positive impressions of the student care centre. The facility's cleanliness and inviting atmosphere provide an ideal setting for both learning and play. The dedicated staff's patience and willingness to assist with school work have been instrumental in supporting the children's academic progress.\n\nThe diverse range of programs offered, including Creative Math, Robotics, and Coding, ensures that the children are both entertained and intellectually stimulated. The centre's convenient location, efficient communication, and impressive student-to-teacher ratio further enhance its appeal.",
      "time": 1692358719,
      "translated": false
    },
    {
      "author_name": "KH C",
      "author_url": "https://www.google.com/maps/contrib/114363975697964466557/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKYnUOMP4PmLzl73vLQn0nimcplV-jty9zeoNZ3YFXZATFM0w=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "The teachers and administrators are overwhelmed with the number of students. To a point they can't keep track of what's happening. Used to be good but now they're just too little staff members to handle the kids. Basically they just feed them lunch and do nothing else for the kids. Not worth the money.",
      "time": 1704707833,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8286629432084715175",
  "user_ratings_total": 56,
  "vicinity": "30 East Coast Road, #03-15"
}