{
  "formatted_address": "1 Maritime Square, #09-10 Harbourfront Centre, Singapore 099253",
  "geometry": {
    "location": {
      "lat": 1.2643925,
      "lng": 103.8202797
    },
    "viewport": {
      "northeast": {
        "lat": 1.265792780291502,
        "lng": 103.8214289302915
      },
      "southwest": {
        "lat": 1.263094819708498,
        "lng": 103.8187309697085
      }
    }
  },
  "name": "Podiatry Quest - Harbourfront",
  "place_id": "ChIJre2fc8Yb2jERwyPFPZU3xwY",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Sarah Halford",
      "author_url": "https://www.google.com/maps/contrib/100252886668264313595/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIm9DjRaooBFU5sUJxELRyrT8rWHDvOcPHl6HWsod88jKiXww=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Boon was really knowledgeable and took great care when treating my feet. He made me feel comfortable and at ease during the sessions and was attentive and thorough. My feet are now in much better condition and pain free. I would highly recommend their services!",
      "time": 1744104989,
      "translated": false
    },
    {
      "author_name": "Priscilla Tan Hayward",
      "author_url": "https://www.google.com/maps/contrib/113146855883196402513/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUg0Mk7W8ONb1Ile1WBlN0-WKQoOToJsujW6zYK73lljqHbyG7L=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "I went to see Boon Kiak for a persistent foot pain from plantar fasciitis. From the first visit, he took the time to listen to my concerns. He then explained, discussed and created a treatment plan for me that included exercises, stretches, a new set of insoles and shockwave therapy. He also recommended appropriate footwear for my condition. I felt supported and at ease throughout the treatment process and most importantly, the pain has reduced significantly.\n\nThere is zero pushy sales tactics to any treatment or product. Boon Kiak and his team are very friendly; transparent with treatment prices - they sent me the price list even before my first appointment. Highly recommend to anyone needing a professional, knowledgeable and patient podiatrist!",
      "time": 1745725257,
      "translated": false
    },
    {
      "author_name": "Darren Lim Zhen Yu",
      "author_url": "https://www.google.com/maps/contrib/111643719888721104506/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVzgjEqK6vlMQDTIdzM4-Z2qQ90QqGggiokTneBoPaBfjprlc2lFg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I sought Boon’s expertise for inefficiencies in my cycling and knee pain. He meticulously assessed my feet and crafted custom insoles, which initially were slightly uncomfortable. Responsively, Boon took back the insoles, and created a new pair  which significantly improved my cycling comfort and power. His patience and commitment to his work are commendable, and even with the wait for the perfect insoles, the results were well worth it. Boon is a true professional who values patient satisfaction highly. Highly recommended!",
      "time": 1700892956,
      "translated": false
    },
    {
      "author_name": "Caleb Lim",
      "author_url": "https://www.google.com/maps/contrib/117746892151656935854/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJeZYuxawtD4A2x2z4J053QN9Am9DzpSTfscNTlR1gZmzrXxQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Got my custom insoles for cycling from Boon Kiak. He is highly knowledgeable and professional from diagnosis to delivery.\n\nI was assessed to have a leg length discrepancy and fallen arch on my left foot which were causing all sorts of issues from my knees to my lower back.\n\nThe custom insoles prescribed are a life (foot) saver - they fit perfectly and provide both feet with incredible stability. They took about two longer rides to get used to, but have since become indispensable, allowing a noticeable increase in power within my power stroke and alleviating discomfort when cycling for longer hours.\n\nWill definitely recommend Boon Kiak for anyone looking to take good care of their feet.",
      "time": 1706339658,
      "translated": false
    },
    {
      "author_name": "Chen Hu",
      "author_url": "https://www.google.com/maps/contrib/112136202427202291026/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVmEgR36NSvOJzW5w6ByfaVBBzgx9FtH5ZZe0wbcAFE_evxfXTXfQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I had a problem with my right knee from running and cycling, including fitting issues causing numb toes. Despite a decade of running and cycling, I'd never seen a podiatrist until now. Boon quickly identified and solved the root cause, providing custom insoles for cycling and running with minor adjustments. The changes greatly improved my running form, addressing issues with landing on the edge of my foot. Though there's a slight weight increase, I plan to use them for all my training and long-distance races. Boon's expertise and adjustments for my tight plantar fasciitis were valuable. The cycling insoles are amazing; I adapted quickly and won't go back. Overall, a great experience, and I believe these insoles will enhance my athletic pursuits, making them more enjoyable and injury-free. 👍",
      "time": 1706079609,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=488420198718972867",
  "user_ratings_total": 28,
  "vicinity": "1 Maritime Square, #09-10 Harbourfront Centre"
}