{
  "formatted_address": "28 Irrawaddy Rd, Singapore 329560",
  "geometry": {
    "location": {
      "lat": 1.324142,
      "lng": 103.845271
    },
    "viewport": {
      "northeast": {
        "lat": 1.3256279,
        "lng": 103.8469268802915
      },
      "southwest": {
        "lat": 1.3217411,
        "lng": 103.8442289197085
      }
    }
  },
  "name": "Police Heritage Centre",
  "place_id": "ChIJs6qqmuAZ2jERjRDen8RgMpo",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Fun Kwok",
      "author_url": "https://www.google.com/maps/contrib/102827686654539049214/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX5BgcjyQE4CS1f9B9kh6tJHFJF3bOe9wyGOmKw2tzNyXkAS0M=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "We had to book the Police Heritage Centre tour in advance as part of the school holidays museum tour activities. The slots were very limited and I was not able to book it last year as they go really fast.\n\nDo be at the Centre earlier for the security clearance. The tour was conducted by a plain clothes staff. It would have been great if we could have more time to read through all the displays. The tour was very informative, but with the wonderful displays, I would probably need to try to book the tour again when they next open it for booking just so that I could really read more. You cannot be unescorted as this is a highly secured building and only photo taking are allowed in the public display area. There are parts of the Centre which the staff will inform visitors that photos aren’t allowed. We thoroughly enjoyed ourselves this trip and I am looking forward to the next visit soon. Fingers crossed that we would be able to book the visits.",
      "time": 1690757512,
      "translated": false
    },
    {
      "author_name": "Cham Jin fan",
      "author_url": "https://www.google.com/maps/contrib/104500750142966066274/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWu-bfbo04ACEvDq9XBjqQgi_NXkCCsUiIJWuZw_P6NSUGFAuvg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "It was rly fun and quite interactive; although some stuff were under renovation, i still learnt a lot of new things like how traffic police in the past used 'wings' to control the traffic . Overall, it was quite interesting. The guide also told us some interesting short stories that gave us some context. I think he was Mr. Eddy. The mueseum was kinda small with only 3 exhibits but it was like rly in-depth, so good job! You have to register beforehand but it was worth it.",
      "time": 1724148612,
      "translated": false
    },
    {
      "author_name": "Gill Allen",
      "author_url": "https://www.google.com/maps/contrib/110717692158725568452/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK75Wvx77V3MpWuIBf3Cz1UdfH4PyEtM4qR4kiq01AOY36I9w=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "You are meant to book online but I hadn't realised this. They were very kind and let me join the afternoon tour. Really very good. Singapore is one of the safest cities in the world now because of the way the police work here. Amazing.",
      "time": 1740730092,
      "translated": false
    },
    {
      "author_name": "Nur Iman Rostam",
      "author_url": "https://www.google.com/maps/contrib/110287485091231667131/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKk595S-r1_udolNvwjHBrRXawa0-51AXFXSDcmorPXWIc8HA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "\"Remember the men and women who have given of themselves to bring law and order to Singapore\" - a quote that is thematically explained throughout the Police Heritage Centre (PHC)'s three main galleries that showcase the historical accounts, uniforms, criminal artefacts and police tactical development of the past 204 years. Started in 1820 with a strength of 12 brave men who have braved in the face of danger to protect Singapore's peace and stability in the last 2 centuries.\n\nThe one-hour-plus guided tour is filled with informative articulation about true stories of Singapore's policing development in the early years of its founding. Then, it goes in chronological order and examines the real gruel past of the early 20th century, especially during the Communist years of the 1950s and racial riots of the 1960s. By the end of the tour, I felt very appreciative of the presence of our police officers guarding our streets and shores every second of our daily lives.\n\nDo note that New Phoenix Park is a highly secure zone as it shares the Ministry of Home Affairs (MHA) and the Internal Security Department (ISD). Remember to book your slots and ensure you have filled in your details on FormSG sent by PHC and clear security at the Guard House (the side entrance that chides along the building's main entrance with 'New Phoenix Park' signage) before entering and when leaving.",
      "time": 1726832726,
      "translated": false
    },
    {
      "author_name": "Paul Hayes",
      "author_url": "https://www.google.com/maps/contrib/117452511890680882757/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXR0i2z7sj7yVjmhMvJThHM4Om2x_tUy3iqOAckTDKZrCst3HNf=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "An amazing look at the history of Singapore and the history of the SPF. Very informative with excellent displays. The tour guide was very good and had lots to share.",
      "time": 1728189299,
      "translated": false
    }
  ],
  "types": [
    "tourist_attraction",
    "museum",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11111049628288422029",
  "user_ratings_total": 200,
  "vicinity": "28 Irrawaddy Road"
}