{
  "formatted_address": "Kaki Bukit Ave 3, Kaki Bukit Recreation Centre, Singapore 415814",
  "geometry": {
    "location": {
      "lat": 1.3371317,
      "lng": 103.9065971
    },
    "viewport": {
      "northeast": {
        "lat": 1.338587930291502,
        "lng": 103.9078849302915
      },
      "southwest": {
        "lat": 1.335889969708498,
        "lng": 103.9051869697085
      }
    }
  },
  "name": "POSB Account Services Centre (For Work Permit Holders)",
  "place_id": "ChIJN9tQ7-QX2jERVazx95IwJ6k",
  "rating": 2.7,
  "reviews": [
    {
      "author_name": "jo kavee",
      "author_url": "https://www.google.com/maps/contrib/103741073081664995127/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKWZjnaqdfbGwEgZLjVxS9vO-3AYcqEfHdQdDqKj3hPTApZaQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Greetings, today I went to POSB Kaki Bukit for my account opening. Apart from most of the reviews below, I really would like to thank all the staffs of the bank today and must say they are the BEST👍👍👍. As they come on time and handle the massive crowd with very well mannered and efficient. They have every corner separate section for the service required by the foreign workers. They keep on asking what their purpose is and try hard to help out as much as they can.  I believe some said they waited so long and then no queue number. But believe me today they have tried to settle most of the solvable issues as fast as they can even without queue numbers. Last but must mention the bank's security officer an Indian man is very helpful too and keeps cheering up the long waited queue👏👏👏.So I do really appreciate their great works and effort in serving the customers✨🫰👏👏👏 Good Job👍👍👍 I believe they have served more than 300 hundred customers today (quantity might be higher I guess)💪💪💪",
      "time": 1746852951,
      "translated": false
    },
    {
      "author_name": "Edy Syarman Alee Ng",
      "author_url": "https://www.google.com/maps/contrib/102045663077425151733/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVku2eIwJLJ7KAolD5KtO8OYjqvKCQMGU-TTqbZcmgFx45UQ_xNOw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "Here if want to get number. Please come before 630am for the Que. if you come 8am thinking office will open at 830am. Sorry number finished.\nHope this useful. I came 3x for this valuable experiences.",
      "time": 1736288988,
      "translated": false
    },
    {
      "author_name": "Tek Xue Nee",
      "author_url": "https://www.google.com/maps/contrib/114536324512229435640/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIN3b-gdpe1k-CIF7DEv_3uCjEPnPnVh5FYKaEMHRo2eU8QNFg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "I went to the Kovan DBS branch to inquire about closing my account, and they told me that I couldn’t do it there and had to go to the Kaki Bukit branch instead. However, when I arrived at Kaki Bukit, they told me the same thing—that account closure wasn’t possible there either.\n\nSo does DBS only allow account openings but not closures? What kind of logic is that? Where exactly am I supposed to go to close my account? It honestly feels like every branch is just trying to push responsibility elsewhere.\n\nOn top of that, the service attitude was absolutely terrible. The staff showed no willingness to assist, and when I stood in front of them trying to ask questions, they completely ignored me and continued chatting among themselves. This is by far one of the worst banking experiences I’ve ever had.",
      "time": 1741769889,
      "translated": false
    },
    {
      "author_name": "Sarala Sarala",
      "author_url": "https://www.google.com/maps/contrib/117095020867011810589/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX9uRT2IuKhpvsAz1vpFwMuLkImVJK3iaq6Uwk-_y-ezlbZiQ0=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "I hope this message finds you well. I am writing to express my concerns regarding the banking services provided to work permit holders, as I believe there are significant issues that need to be addressed.\n\nMany work permit holders, including myself, have been facing long wait times at the bank. For instance, customers often queue from as early as 5:15 AM, yet the bank only opens at 8:30 AM. This situation is particularly challenging, given that work permit holders are limited to using this specific bank for our financial needs.\n\nI kindly urge you to consider this matter seriously. Improving access and reducing wait times for work permit holders will not only enhance our experience but also demonstrate the bank's commitment to serving all customers effectively.\n\nThank you for your attention to this important issue. I look forward to your response.",
      "time": 1731737993,
      "translated": false
    },
    {
      "author_name": "Jessie G",
      "author_url": "https://www.google.com/maps/contrib/108982714778738310449/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK2XtOkfXtV3jfqm7cDSAHF5UtszVjmaIJkWzVrvdAFyTEaHw=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "6 months ago",
      "text": "When there to update contact number the staff at there is good and helpful but I heard something disappointed. I need advise for my online banking but I need to que up again so I ask another staff is it possible to go other outlet for advise, the lady staff tell me \" you went there most of them won't help you so better just que up here \" what do you mean by that !? POSB staff won't help us solved a simple issue as we are foreign workers?",
      "time": 1730793019,
      "translated": false
    }
  ],
  "types": [
    "bank",
    "finance",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12188764324284705877",
  "user_ratings_total": 277,
  "vicinity": "Kaki Bukit Avenue 3, Kaki Bukit Recreation Centre"
}