{
  "formatted_address": "66 Bussorah St, Singapore 199479",
  "geometry": {
    "location": {
      "lat": 1.3010659,
      "lng": 103.8598629
    },
    "viewport": {
      "northeast": {
        "lat": 1.302445230291502,
        "lng": 103.8612494302915
      },
      "southwest": {
        "lat": 1.299747269708498,
        "lng": 103.8585514697085
      }
    }
  },
  "name": "Positano Risto",
  "place_id": "ChIJKeStBbEZ2jERHH8jl7CCHjs",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Hena Shad",
      "author_url": "https://www.google.com/maps/contrib/105324684235747630371/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK06HXjy3T975nxHNP6F-eBBbQPwHwOiJkLvVSAA79doso0Dw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "We stumbled upon Positano Risto while looking for a good Italian spot in Singapore, and I’m so glad we gave it a go. It’s run by Mohamed and his family, and you can immediately feel the warmth and pride they put into the place. The location is great and the place was clean, but honestly, don’t come expecting fancy decor, come for the food, because that’s where this place shines!\n\nBetween us, we tried a good spread: the truffle fries were crispy and addictive, and the pesto chicken linguine was creamy and full of flavour without being too heavy. The linguine bolognese was proper comfort food, hearty and satisfying. The beef lasagne had that perfect cheesy top with rich layers underneath, and their signature pizza was spot on — generous toppings, stuffed crusts, everything you want in a pizza plus the citrus crown salmon which was, fresh, and beautifully balanced.\n\nEvery dish felt thoughtfully made, and you could tell it was coming from a place of real passion. It’s rare to find a restaurant that puts this much care into the food. We left happy, full, and already planning our next visit.\n\nOne thing that really added to the whole experience was Mohamed himself. He was so welcoming and took the time to chat with us — you can tell he’s well-travelled and passionate about bringing authentic Italian flavours to the table. That personal touch made the meal feel even more special.\n\nIf you’re after honest, delicious Italian food made with love — Positano Risto is well worth a visit.",
      "time": 1745351653,
      "translated": false
    },
    {
      "author_name": "- Daisy",
      "author_url": "https://www.google.com/maps/contrib/108537073281976304342/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUCcf1qJix6vohgGLgcTlGboARmSczCVAZgt2REqvQ4dYS4VsUY=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I visited this restaurant for the first time, and it was an absolute delight.\nWe ordered two pasta dishes, and they were far beyond our expectations—absolutely delicious. The tiramisu was also heavenly!\n\nBut what truly makes this place special is the owner.\nHe’s incredibly kind and attentive, making sure every guest feels welcome and well taken care of.\nHonestly, he might just be the friendliest person I’ve met in Singapore!\n\nIf you’re ever in Singapore, this place is a must-visit.\nThank you for the amazing experience—I’ll definitely be coming back!😇",
      "time": 1745045424,
      "translated": false
    },
    {
      "author_name": "thavaneesan malar",
      "author_url": "https://www.google.com/maps/contrib/115234555956026594839/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJqg-JJ34RC5Z4-Vzzfr1vnBa1wJ-7byvO36AHk_Nc9xJRSdQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Had the pleasure to dine in here today with my family. Was famished, and I was happy the food came in fast. The food was great and the service was excellent. My order came in with an issue, but the staff was quick to help me out. I believe the staff name was Min. He took apologised and got me a new meal within minutes. I was happy with the food, and they even gave us a complimentary dessert. Thank you for getting out tummies and heart fulll. Will be back again.",
      "time": 1746544444,
      "translated": false
    },
    {
      "author_name": "Yin",
      "author_url": "https://www.google.com/maps/contrib/102227565496753961097/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU3zMUQX4WWt3R5rIGMM5WsrpCQXryqLMZvdfMlca7mZ_UwDL1p=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Best to drop a booking if you want to secure the seats. Their signature pasta was pretty good with two big fresh prawns. My fav was the pesto, which had a pleasant aroma of the herbs and basil. The pizza was superb with stuffed crust with ham and cheese fillings.",
      "time": 1741422088,
      "translated": false
    },
    {
      "author_name": "kiwi cat",
      "author_url": "https://www.google.com/maps/contrib/112588863613545122979/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX7aPPE5HrcnEynIh9Ejax-pRm7vKQXoybuewpstKrHf18e3V4J=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "a week ago",
      "text": "i feel a little bad about giving a low score because the staff were lovely to us every step of the way. they constantly stopped by our table to ask us if we were happy with our food and also made sure to present a small dessert in time for our birthday lady.\n\nwell...the issue we had was indeed the food. the plating for alot of our dishes looked fantastic so we were beyond excited to dig in, but unfortunately we were let down by the taste. i had salmon linguine, and im not sure what kind of extra ingredient was thrown into the mix but there was a strong bitterness to it that almost completely overrided the flavour of the salmon and cream. and to be honest, even without bitterness, the taste of the salmon and pasta on their own is not enough to justify its $27 price... :( the other dishes we had werent so memorable either. the fries were great though!\n\nwe did come in at a peak period so i know the kitchen can get frantic and hectic, but i hope the chefs could maybe taste the food before sending them out so they understand what last minute adjustments they can make. i know its easier said than done but maintaining standards is so important in spite of the sweat and stress!! i say this as someone who used to be a cook\n\nthis review really isnt meant to be a jab at the business and how its kitchen is run, so hopefully it is taken as constructive criticism because i really want to see this restaurant and the people who work in it flourish. and yes i did say that the servers constantly asked about our food while we were dining, but at the time i just could not bring myself to be so brutally honest toward such bright smiling faces. i apologise! 😅",
      "time": 1746894287,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4259985992500608796",
  "user_ratings_total": 1843,
  "vicinity": "66 Bussorah Street"
}