{
  "formatted_address": "381 Lor 1 Toa Payoh, #01-01, OnePeople 319758",
  "geometry": {
    "location": {
      "lat": 1.3402797,
      "lng": 103.8455028
    },
    "viewport": {
      "northeast": {
        "lat": 1.341573530291502,
        "lng": 103.8468555302915
      },
      "southwest": {
        "lat": 1.338875569708498,
        "lng": 103.8441575697085
      }
    }
  },
  "name": "Power Mathematics | JC H2 Math Tuition | A-Level Further Math | Math Olympiad",
  "place_id": "ChIJ3yTs-pYZ2jER90vwe4DVEDI",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Y. L",
      "author_url": "https://www.google.com/maps/contrib/117943715705382146613/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJgDcDY--U6XSnTc4j4eW2K-pz_mjU0Rx1BY5Kan0vBIXuUvw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Since joining Power Mathematics at the start of J1, I've seen a huge improvement in my understanding and performance in math. Mr Wu is an incredibly supportive and patient tutor who always goes the extra mile to make complex concepts more digestible. Beyond the teaching methodology, the resources and practice materials provided have been extremely useful in helping me consolidate my understanding of each topic. His advice on presenting workings and answers has also been particularly valuable. His guidance has made my JC math journey much more enjoyable, and I highly recommend Power Mathematics to any student who wants to excel and cultivate a love for math at the same time!",
      "time": 1732949439,
      "translated": false
    },
    {
      "author_name": "Prawnsalad1991",
      "author_url": "https://www.google.com/maps/contrib/103203190516039640744/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKjrrzITw62j4jGNdoauEWT-xiZMqy8wXsRNDkcSv0KXx7ZZg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I would highly recommend joining the Further Maths ‘A’ level classes here. I found this class very beneficial. Mr Wu is a dedicated teacher that put in a lot of effort into creating quality learning materials that is very well organised, concise and easy to follow. These same materials could not be found online without being incomplete, extremely long winded, or out of syllabus. What I found memorable about the class was that all the material was printed in A4 with adequate writing space so I could read clearly and practice the questions. Some material were printed in colour. The detailed solutions were issued to every exercise, and Mr Wu responds at the first opportunity to any questions asked online. The learning environment is important. Around the same time, I attended some other tuitions that gave students tables which were less than the size of a seat to work on, and learning materials printed sideways on half an A4 page - it was not the case with this class. I can unequivocally say that not every teacher upholds such high standards and dedication to their students learning. Thank you Mr Wu!",
      "time": 1732105105,
      "translated": false
    },
    {
      "author_name": "nthn",
      "author_url": "https://www.google.com/maps/contrib/100455429085997094706/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWiUcJvX7EjxuGAW_nDDT9yAGT6QEHYfVHsg8DjBDmPBh70eaoy=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Mr Wu is an extremely helpful and very friendly person. He is very approachable and does not hesitate to answer my questions on whatsapp 😀👍. Helped me jump from an S in math to a high B in prelims 😮. His notes and explanations make things so clear and helpful, and techniques taught by him came out in Alvls 2024 allowing me to easily obtain marks for those questions👍👍👍👍. Great teacher, tuition centre and person overall 👍",
      "time": 1731660586,
      "translated": false
    },
    {
      "author_name": "jetchezz",
      "author_url": "https://www.google.com/maps/contrib/115840386678779085886/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL2RFzk1e8w_7dgTat1yAUyAqqeLfs_1XuVPqO9xCCCDEHe49w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Mr Wu is a patient teacher who takes his time to explain concepts clearly, helping me clarify any doubts I have. The clear and concised notes along with tutorials after each topic has helped me a lot. The abudance of resources that he has is something that should be taken advanatged of. Do request for additional questions and papers!",
      "time": 1733116987,
      "translated": false
    },
    {
      "author_name": "The Flash",
      "author_url": "https://www.google.com/maps/contrib/114600883487931162254/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUZbIAGyuh-y-RdYTEtlO_0QAHRzBMkd300S0H3u9UrAdv20Vxz=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Thankuu Mr Wu, your teaching was very critical and helpful. The way you planned ur lessons and executed them were easy to understand and learn within the timeframe. It made me do many different questions to prepare me for My H2 Mathematics Well. Hope you continue spreading your knowledge to other candidates and students to nurture them into well thinking and critical students who can attain high grades, values disciplined students. Atbb in your future in the teaching career!!",
      "time": 1731659171,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3607618049335643127",
  "user_ratings_total": 94,
  "vicinity": "381 Lorong 1 Toa Payoh, #01-01, OnePeople"
}