{
  "formatted_address": "418 Northshore Dr, #02-01, Singapore 820418",
  "geometry": {
    "location": {
      "lat": 1.4176931,
      "lng": 103.9011355
    },
    "viewport": {
      "northeast": {
        "lat": 1.418849230291502,
        "lng": 103.9026673802915
      },
      "southwest": {
        "lat": 1.416151269708498,
        "lng": 103.8999694197085
      }
    }
  },
  "name": "Pratunam by Soi Thai Soi Nice - Northshore Plaza 2",
  "place_id": "ChIJJ91H2QwV2jER-ZCPOWPna6A",
  "rating": 2.7,
  "reviews": [
    {
      "author_name": "イネズ",
      "author_url": "https://www.google.com/maps/contrib/104696902020566819250/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU95CKupaevkYx5t9t-FPBlysH18uUidV-HlB54TM0L1GM1idd7=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "Terrible experience at Pratunam @ Northshore Plaza 2. When we arrived, no one was around to seat us despite many empty tables. We waited for a while and eventually approached a Chinese lady with a ponytail to ask if we could sit, and her response was abrupt and rude: “Wait wait wait, yeah yeah, sit sit!” , completely unprofessional.\n\nWe scanned the QR code and placed our orders. I ordered the Runny Egg Basil Chicken Rice and Garlic Fried Pork.\n\nThe Runny Egg Basil only looked nice but taste-wise, it was a disaster. The rice was lumpy, dry, and there was zero basil fragrance. It was honestly so bad I lost my appetite.\n\nThe Garlic Fried Pork looked horrible right from the start, dry, stiff, and a sad portion. After chasing the staff a few times for it, it finally arrived, but it was inedible. No garlic taste whatsoever, just hard, dry pieces of pork.\n\nThis was without a doubt the worst Thai food I have ever had.\nVerdict: 0/5.\nNever coming back, and definitely not recommending it to anyone.",
      "time": 1745802603,
      "translated": false
    },
    {
      "author_name": "Chee Keong Tan",
      "author_url": "https://www.google.com/maps/contrib/117772683737470226564/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJO1VSaFA0onMLi3WUoz3qVY05Pke9yeSaiRsuaQ5-B30WY8A=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "You don't even deserve a star!\nOrdered minced pork with basil leaf, egg and rice for dinner on your first day of operation at Northshore Plaza. I only see some cut long beans and chilli mixed with minced pork, not a single basil leaf. Staff told me the ingredients are cooked from the stock prepared by central kitchen. Isn't this cheating your consumers?",
      "time": 1745735348,
      "translated": false
    },
    {
      "author_name": "Angel",
      "author_url": "https://www.google.com/maps/contrib/115989134996727083354/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKKE4WkQ7yiE1yWXHKFc-7S0D79G4_tPdMG_mNdylwH37O0eSne=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "Service was slow, it took maybe about 20-30 minutes for our first dish to arrive. The last dish took over an hour that we ended up taking away, furthermore 30% of the dishes were unavailable..\nSome mains were served cold, felt frozen and pre-prepared.. Minced meat omelette with no meat... The only thing remotely nice we ordered was the fried prawn donuts that were overly salty. The garlic chicken was also overly salty, and no garlic nor garlic flavour at all!\n\nIf you wish to try it, maybe wish for the hype to die down a little.",
      "time": 1745752979,
      "translated": false
    },
    {
      "author_name": "Dominic Ong",
      "author_url": "https://www.google.com/maps/contrib/103576974208083657199/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVHHTterGpHqiLEgYqRyBYVWpe7Zofyzy2FJl3bywJk2xi0RCGp=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "Not sure why so many poor reviews for this place, but I quite enjoyed the kai lan, Tom yu soup,  mince pork omelette, spring rolls, and pineapple fried rice. They were nice enough :)\n\nThe Tea was nice, but 2.50 a bit steep.",
      "time": 1746886177,
      "translated": false
    },
    {
      "author_name": "Bryan Chung",
      "author_url": "https://www.google.com/maps/contrib/111445960213680830492/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUHELH-XcQPgw8eh8aN346--iFp1vn2Phj09DqhZJb8EzJZJqWpsA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "Barely a week into opening, I was excited to try this place with my family. On a Sunday night, there was a queue outside. Could see many dirty tables inside just only 2 service staff outside. Waited 10 minutes in line and got out table. Upon trying to order, almost 1/4 of their menu was \"Out of Stock\". That's only 7pm. We waited 40 minutes and barely one kang-kong dish came out. They were cooking their food in a mass-style, many kang-kong came out serving many different tables. The pineapple rice came next and again, mass production. Terrible and salty! We told the manager (dressed in black) that we wanted to cancel all orders and we gave up. Many tables also gave up waiting and left. Can't believe they even charged us for the drinks and kang-kong. And the Manager admitted it was their fault for not expecting the crowd and their chef \"just landed in Singapore\" and didn't learn to cook yet. What? So you are basically not ready for operations yet you open for business? You just made a terrible name for yourself. The Manager said, \"please come back in 2 weeks.\" 2 weeks?! So yes, confirm they are not ready for operations. If you wanted your customers to come back, you could at least really not even charge for the terrible long wait with nothing coming out besides drinks. BAD. PLEASE AVOID.",
      "time": 1745835695,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11559587281929998585",
  "user_ratings_total": 21,
  "vicinity": "418 Northshore Drive, #02-01"
}