{
  "formatted_address": "4 Tampines Street 91, Singapore 528907",
  "geometry": {
    "location": {
      "lat": 1.3467368,
      "lng": 103.9385907
    },
    "viewport": {
      "northeast": {
        "lat": 1.348027230291502,
        "lng": 103.9399391802915
      },
      "southwest": {
        "lat": 1.345329269708498,
        "lng": 103.9372412197085
      }
    }
  },
  "name": "Professor Brawn Cafe (Tampines Outlet)",
  "place_id": "ChIJvwnpWlY92jERPFk-AUNkl-g",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Darren Lim",
      "author_url": "https://www.google.com/maps/contrib/114861659129307661631/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXGMNJF_hzPknMI4kPRNsBzyrS1KVZS2N7Z0LP-FZnxNZcu6y_A7Q=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "This is a great restaurant tucked in the Tampines neighborhood, a gem in the midst of the ocean of HDB dwellers.\nWe had dinner yesterday evening and it was an experience that I will never forget, the delicious food, the great atmosphere, the excellent customer service level and the hospitality that greeted us the minute we stepped into the restaurant.\nWhat is more important is that this restaurant offers opportunities for graduates of Pathlight School who aren't able to secure employment to develop a skillet working in this community partnership restaurant. It not only provides career opportunities but also galvanized their confidence, build up teamwork and leadership skills and further shaping their personalities.\nIndeed, Professor Brawn Cafe chain restaurants is an innovative approach to help challenging individuals merge into our society without being sidelined.\nMy rating is a 5 out of 5 for the food, the atmosphere, the customer service level, the warm hospitality and most importantly, the cause for which this restaurant chain stands for. Oh, also an ex-Executive Chef who worked in a 5 star hotel at your service. What more can you ask for? 😄",
      "time": 1746738389,
      "translated": false
    },
    {
      "author_name": "I liEk PoTaToEs ÙvÚ",
      "author_url": "https://www.google.com/maps/contrib/117174534983466318951/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXVdcwy4Aj331Esb4NSc7I-JL_V4UeEI1vOs3gFL7jE1Z34yKCX=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Love this new cafe in Tampines. Spacious with great ambience and air conditioned. Service is great! Tried their v day menu which comes with a cod fish main, lobster bisque and a rose dessert. Also ordered their clams in butter sauce and fish and chips separately. All dishes are prepared beautifully and tasted good. Will be excellent if they can ensure there are no bones in the cod fish. Surprising they also serve gong cha selected drinks! There is also an art shop within the same space where you can shop for items made by local artists before or after your meal. The meal ended with a surprise sweet gift from the restaurant - a stalk of beautiful big red rose on v day!",
      "time": 1740491631,
      "translated": false
    },
    {
      "author_name": "Kai",
      "author_url": "https://www.google.com/maps/contrib/117612273412230021726/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWSex6s7k1HD9obN8HVe1uHqrKhYH4ZXI-qIMeNQiNfn7ptFe6Z=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Situated inside a school, this restaurant serves mainly Western food and Gong Cha with a limited selection. We ordered the Caesar salad, soft-shell crab spaghetti, and steak. The salad was good, but one thing puzzled me: we added an extra portion of vegetables, expecting them to be included in the salad, but they were served as a side dish instead.\n\nThe steak was cooked to a good temperature but could have been perfect if it weren’t under-seasoned. The soft-shell crab was disappointing—the crab was very tough, and the pasta’s seasoning was lackluster. Price-wise, it’s not very cheap, but 60% of the profits go to the needy. Ultimately, I will visit again in the future to try other dishes.",
      "time": 1741515007,
      "translated": false
    },
    {
      "author_name": "Koh Hwee Chong",
      "author_url": "https://www.google.com/maps/contrib/115267672673265818588/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXMBQ9mKzMF9WQxpwTr9EGB0qAlknHiGKydUoE3z7ilrlz7YZ1XEA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Prof Brawn Café, nestled within the Art Faculty, offers a unique dining experience that combines delicious food with a meaningful mission. While the prices may lean toward the higher side, the café provides more than just a meal—it supports inclusion and showcases stunning gifts crafted by autistic artists. This makes it not only a place to enjoy great food but also a space to appreciate and support creativity and diversity. Dining and shopping here contribute to a worthy cause, making every visit impactful. Stop by, show your support, and be part of this inspiring initiative!",
      "time": 1740467182,
      "translated": false
    },
    {
      "author_name": "Cassandra",
      "author_url": "https://www.google.com/maps/contrib/117012786490278517792/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJBshnIiSAokVQlgG0va79EVrHll9Wpl9LZTR105QmZg4Xo-84=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "This is a repeat visit. I was served by really helpful trainee staff, John-Paul, Ashwin, and Hannah. On-site supervisor was able to guide the trainees how best to communicate and serve the customers.\n\nAs for my pepper allergy, chef William went on an extra mile to make sure it was free from pepper. Really salute to the team's effort. Keep it up. I have been recommending this cafe to others 😍",
      "time": 1740047464,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16759974777229039932",
  "user_ratings_total": 25,
  "vicinity": "4 Tampines Street 91"
}