{
  "formatted_address": "408B Joo Chiat Rd * By Appointment Only *, Singapore 427635",
  "geometry": {
    "location": {
      "lat": 1.3072649,
      "lng": 103.9038648
    },
    "viewport": {
      "northeast": {
        "lat": 1.308640980291502,
        "lng": 103.9052525802915
      },
      "southwest": {
        "lat": 1.305943019708498,
        "lng": 103.9025546197085
      }
    }
  },
  "name": "Propstation",
  "place_id": "ChIJk3qXjWE92jER48IAycUgyU8",
  "rating": 1.9,
  "reviews": [
    {
      "author_name": "DIANA MASPOT",
      "author_url": "https://www.google.com/maps/contrib/116264211976313645893/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKK5nTLLaWTnPIo5W6e2QAEyVIwh8MOzKIngz5ScoHxAhPd6tw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 years ago",
      "text": "If you want to order from Propstation, think again. Their level of customer service is extremely bad and great disappointment. They don't care or bother on customer's queries or concern. No initiative to respond to WhatsApp messages, calls and email at all. Only replied WhatsApp after so many days and yet they didn't resolved anything.\nIt takes them almost 1 month to just deliver a set of dried leafs and cylinder. I ordered 1st Jan 2022, received 15th Feb 2022 @8 30pm. I wanted to get in touch with them regards to the items, the best part, no one cares to respond. The WhatsApp messages i sent being read by them and it's blue tick, no one seems to reply for days! Shopee is more attentive and reliable infact i ordered items from other country they deliver less than 2 weeks! I will never order from Propstation anymore that's for sure!!\nPrice range is expensive with low quality products. It should be better than that. I regretted I've ordered from them.",
      "time": 1645504710,
      "translated": false
    },
    {
      "author_name": "Izian Izfian",
      "author_url": "https://www.google.com/maps/contrib/114539000152530756629/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVRKXHy_te1dS6r8PsM07gFl1Vpoh94CvK0AYHt7bZXY2T9NyTCAg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 years ago",
      "text": "BEWARE SHOPPING HERE. DO NOT RISK YOUR HARD EARNED MONEY.\n\nPurchased a table online, it never came. We messaged them on Instagram on the last day of the expected arrival date. They told us that there was a delay in shipment. After waiting for another week, no updates from them. We messaged them again and they again told us there was a delay.\n\nThey offered us products which is not even in their catalog (based on their website), at the same price. Is that product from a secret warehouse or stash?\n\nAlso to check for the shipment updates, we must take the initiative to ask them instead.\n\nIn summary: bad store, worse customer service.",
      "time": 1621579950,
      "translated": false
    },
    {
      "author_name": "Samsiah Fattah",
      "author_url": "https://www.google.com/maps/contrib/116208510719876551982/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXfv7ToEqzyj5f6uBAFIanUgbii33YVGBhJ0T4AWwM2z-fQ90M=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 years ago",
      "text": "Terrible customer service just ignored messages sent to them and did not advise customer earlier when item out of stock and delayed delivery when paid for next day delivery and did not inform me item out of stock until I received my order and found 2items missing and when asked just ask me to refer to the receipt given without apologising. I paid by Hoolah but no refund done and I have to email Hoolah for adv. This will be my 1st and last order from them please think twice if you would like to purchase from them!",
      "time": 1652957869,
      "translated": false
    },
    {
      "author_name": "Alfee Halil",
      "author_url": "https://www.google.com/maps/contrib/113708907957392967705/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX6EG75sjFA_-y9fPmNrTvm2DYfwVVi7mhVnD8nl1lo8v2v8BV6=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "Yes. The showroom was hidden, definitely hidden. The website should actually put directions on how to the unit. However it is a unique hideout. Reminds me of Europe’s narrow tiny hotels.\n\nSince it’s a small showroom, I was a bit disappointed with the variety of products. I was expecting a bit more of furnitures. Nevertheless, the service there was very good. I didn’t managed to get his name but he was very helpful and knowledgeable in his products. Male, brown hair guy. He gave suggestions on how to style faux plants, the base, etc. And managed to get it delivered on the same day!\n\nBig thank you for making our choices easier! Hope to purchase more stuffs from you guys soon!\n\nP.S: Lower down your expectations and you’ll get what you want there.",
      "time": 1618398231,
      "translated": false
    },
    {
      "author_name": "Nanie Ariani",
      "author_url": "https://www.google.com/maps/contrib/104399539874426465058/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocID3tRmwTZQuxaI-GD8cyh9gk4cqRL5ixH4-QxGklsHUNS2WQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 years ago",
      "text": "Bought a marble tray on sale for $28 during their live 31 Jan 2021 (if i'm not mistaken). Cut long story short, requested for refund, now coming to March 2022 already and I still have to chase for refund.  I have to chase. Full of BS. My first and last purchase.",
      "time": 1645861191,
      "translated": false
    }
  ],
  "types": [
    "furniture_store",
    "park",
    "home_goods_store",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5749162433168065251",
  "user_ratings_total": 14,
  "vicinity": "408B Joo Chiat Rd * By Appointment Only *"
}