{
  "formatted_address": "8 Marina View, Level 6 Asia Square Tower 1, Singapore 018960",
  "geometry": {
    "location": {
      "lat": 1.2784217,
      "lng": 103.8514742
    },
    "viewport": {
      "northeast": {
        "lat": 1.279768130291502,
        "lng": 103.8528271302915
      },
      "southwest": {
        "lat": 1.277070169708498,
        "lng": 103.8501291697085
      }
    }
  },
  "name": "PURE Fitness Asia Square",
  "place_id": "ChIJ6Zgp8REZ2jER4siEfDg88rs",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Timofey Beloglazov",
      "author_url": "https://www.google.com/maps/contrib/115244012835910031551/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXYlCSvH4F_3p2k64tQz82FviFdkRM6sdgc6IovBhLa5skLDDwF2A=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "There were once more outlets, but now there are only two. I've been using Asia Square Outlet for two years, and I can honestly say that things have gotten worse ever since I started using it.\n\nFor instance. Members of Suntec's venue were transferred to Asia Square Gym after it closed, which wasn't very comfortable because the gym became much busier. It appeared that new equipment was introduced in an attempt to make up for it, which was beneficial.\n\nI was surprised to see today that a sizable portion of the gym space had been removed to serve as a personal training area, complete with equipment that was previously accessible to all gym patrons.\n\nSince the items I was previously using are now only accessible to those who pay more for PT I am unable to use them.  The price only increased at the same time. More users, less equipment, and a higher cost.\n\nAnother thing that irritates me is that even though PT now has their own zone, they continue to use other zones.\n\nIt would be reasonable, in my opinion, for Pure Gym management to state that this facility is exclusively for PT, and they have no interest in members who do buy these services.",
      "time": 1739973220,
      "translated": false
    },
    {
      "author_name": "Kenneth Tan",
      "author_url": "https://www.google.com/maps/contrib/117736099329275564736/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLFxVgW4lF9ZcTMwuvCNq3XlzTclJ9aLridpFupDQVOIpbz7A=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "Keeps shortening hours, switch off aircon 1 hours before closure. It becomes hot and stuffy and rude counter staff. My friend had the water shut off on him during his bath because it was “closing time” . Very unprofessional and definitely no longer a so called premium gym. It is in fact worse than most “normal” and much cheaper gyms. Also had rats and insects in the lounge areas and change areas. Unheard of before. Used to be a good gym,  now after many years i would no longer recommend. Would say stay away.\n\nNot imagining… poor ventilation even when aircon is supposedly on it gets pretty warm. This is going to pose a health hazard. First time ever, there is a stale smell. Well someone is not being honest here about keeping the aircon on till 2230h.\n\nJust an update , since my review there are 8 others from Pure AST who have complained about the aircon issue. The reply by the owner is obviously ……\n\nThis issue has been brought up to management by other members and they have been very economical with the truth as they have been with the air conditioning and towel issues\nSame problem at Pure NAC.\n\nPure Fitness recently had a total management team change at the very top! I am patiently waiting to see if some of the destructive policies of the previous management will be corrected and if improvements are being made. So far the big lie of monthly “deep cleaning” has been removed. It is left to be seen if previous opening hours are restored and full aircon till maybe 15 min before closing and in the morning is restored. Till then I will leave the rest of the review as is. New Pure management! Make Pure great again !",
      "time": 1747140153,
      "translated": false
    },
    {
      "author_name": "D L",
      "author_url": "https://www.google.com/maps/contrib/113581946395181804374/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIYc6JTRKOYNmS5L8iXGsr8Sqdj3V6kZGya4fNo7Zw2g-n8lA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "I've been a member at Pure Fitness Asia Square for over 10 years - but due to recent changes over the past week, I cannot recommend this gym to my colleagues or friends.\n\nMy complaint relates to an area of the gym (the training track) that has been cordoned off for exclusive use for PT training.\n\nFirstly, the area is over-equipped and under utilised. There are multiple adjustable gym benches (I counted at least 4 - similar to the number in the free weights area) and racks full of weights that have low utilisation rates, or not consistently in usage - this is a clear show of bias against other paying members who do not utilise services of PTs.\n\nSecondly, despite already having an exclusive cordoned off area for PT usage, I still see PTs conducting their training in the main free-weights area, resulting in unnecessary hogging of equipment (while the cordoned off area is relatively empty)!\n\nTo the Pure Fitness management - you cannot simply put up a sign (attached below) stating - \"We appreciate your understanding.\"\n\nThe above is a reflection of poor planning by management! I just cannot comprehend how the senseless decision was made to create a cordoned off area for PT-only training.\n\nIf you wish to have an exclusive area for PT-only usage, then please - (i) implement specific timings (e.g. peak hours such as 12pm to 130pm) for PT-only use and then avail the area to other PAYING gym members during other periods; and (ii) enforce house rules where PTs are not allowed to use equipment in the main public area (since paying members like us are restricted from the cordoned-off PT only area)!\n\nIf the feedback above is not taken seriously, then I am quite certain that Pure Fitness is setting itself on a track that will see it lose members to other gyms around the Shenton area.",
      "time": 1739887747,
      "translated": false
    },
    {
      "author_name": "Kelly Pok",
      "author_url": "https://www.google.com/maps/contrib/118184060956347015970/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWJQV7xFbOV5eAkZWrfVIKs-yR57fDNOcCWNCrnCgG7iLRvMuAOpw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "The sales associate is very enthusiastic is throwing in freebies when trying to sell you the package and contacts you everyday. Post-sales, I've tried emailing the front desk, contacting the sales associate, calling their number and leaving messages on their website but no one even replies. It's been 3 days. Gym and facilities are fine. Instructors are also great. But customer service is really a zero.",
      "time": 1741218542,
      "translated": false
    },
    {
      "author_name": "Christine T",
      "author_url": "https://www.google.com/maps/contrib/106081710638478528478/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJHViH1i4QSIuNefd5rF3BjlOb5BM6i9lWGCwi0hMwmED9U=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Pure is going downhill fast. I have been a member for over 7 years. Recently they created a space especially for personal training. Occasionally there are PT sessions going on (which is understandable), but most of the time this private area is exclusive for their own staff to workout. Just saw 2 trainers doing their own workout in this EXCLUSIVE area (1 March 2025, ard 3.45pm).\n\nSo paying members are forced to a much smaller gym with lesser access to equipment and dumbbells, while their own staff are using this exclusive space. Such a joke. This is on top of the shut down of various gym and yoga outlets (now left with 2 outlets), and membership fees are constantly increasing. Will advise everyone against joining this gym.",
      "time": 1740816680,
      "translated": false
    }
  ],
  "types": [
    "gym",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13542953242761414882",
  "user_ratings_total": 288,
  "vicinity": "8 Marina View, Level 6 Asia Square Tower 1"
}