{
  "formatted_address": "170 Upper Bukit Timah Rd, #05-10 Shopping Centre, Singapore 588179",
  "geometry": {
    "location": {
      "lat": 1.3431115,
      "lng": 103.7760782
    },
    "viewport": {
      "northeast": {
        "lat": 1.344452130291502,
        "lng": 103.7772793302915
      },
      "southwest": {
        "lat": 1.341754169708498,
        "lng": 103.7745813697085
      }
    }
  },
  "name": "Qinetic Wellness",
  "place_id": "ChIJ6d_z_oMR2jERLnkIf0hCYsE",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Garett Lee",
      "author_url": "https://www.google.com/maps/contrib/102429779161382378043/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXqsbomW_9k_E_jIsDC2-9o7CycpwcvI9g1ho_vo3yA8VSe4fNC=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "I had a frozen shoulder issue that persisted for over more than half a year prior to seeing Kwan, despite visits to TCM and other physio clinics. While some relief did take place, the problem didn't go away completely. I saw a workshop focusing on frozen shoulder issues that Qinetic Wellness had organised and signed up for it, and it was from there I came to know of Kwan's level of knowledge which led me to sought treatment at Qinetic Wellness. A handful of sessions in, and I'm back to 100% and can train again with confidence.\n\nIn-depth knowledge paired with extensive experience is what makes Kwan a maestro in his field. His diagnosis is always on point, and he's always able to link the connecting issues to get to the bottom of the source of the pain and to then firm up the treatment plan. Bedside manners as a therapist are also top-notch, and he puts people at ease right away. 👍🏽\n\nThe experience with patient services is also great - Alicia is fab, sending in timely reminders about appointments and their policy of cancelling 24hrs beforehand allows for flexibility in rescheduling is very reasonable and fair.\n\nLocated on the fifth floor of Bukit Timah Shopping Centre, parking is ample, not an issue and the mall never gets overly crowded or busy, thanks to its largely less retail tenant mix, and more specialised services such as domestic helper agencies. The mrt station is also conveniently located close by. A plethora of food options where necessary, are conveniently located in the adjacent mall and across the road (Cheong Chin Nam).",
      "time": 1746511554,
      "translated": false
    },
    {
      "author_name": "Stephanie Zhao",
      "author_url": "https://www.google.com/maps/contrib/108777611640391864816/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKhjwBHokaQlvXdCqaKvawHx6WRA6aB-1rbCOzhcWo2IFyABA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Kwan is super knowledgeable and is able to identify the problem areas quickly. He identified lymphatic blockages as the source of my shoulder pain and was able to solve the root cause of the problem (something other treatments/therapies have not done for me). Highly recommend!",
      "time": 1746773388,
      "translated": false
    },
    {
      "author_name": "hsing lu Lai",
      "author_url": "https://www.google.com/maps/contrib/104178117015765496445/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK4mqv6bP2KHPmwxxBMfZwYk5wbsWArYQElymXEkCZ6oM_zlg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I’ve been to many therapists, but this one truly stands out. The attention to detail and personalized care I received were exceptional. They carefully assessed my shoulder and ankle issues and provided targeted treatments that made a real difference. Their deep knowledge and commitment to helping clients recover are evident in every session. Without a doubt, this is one of the best activity therapists in the neighborhood. Highly recommend to anyone looking for expert, results-driven therapy!",
      "time": 1740740091,
      "translated": false
    },
    {
      "author_name": "Ivan Hoe",
      "author_url": "https://www.google.com/maps/contrib/106663026908476797217/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX9T6PRDBM6yVeehNJ8VDb91GTXU4jtoUZbOnAm0xJ2LlmgRm0v=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "I was a student in International Sports Academy-Qinetic Rehab Exercise and Therapy Specialist Course September 2024 intake (27/9-29/9, 4/10-6/10).\nKwan was exceptionally professional in imparting the methodology, methods, techniques involved in manual therapy treatment and exercise prescription based on different conditions of clients.\nKwan was always encouraging us to think as detectives in examining, treating, assessing and fine turning our treatment of clients and to take care of ourselves during the treatment process.\nThere were always lots of hands on practice among our fellow classmates and even among Kwan's Team.\nHis Team: Alicia & Ryan also left a deep and lasting impression on me too as they were also encouraging and fine tuning our way of thinking and the correct treatment technique and thinking like a detective too. Excitedly looking forward to the next practice sessions, workshops, etc with the Qinetic Wellness Team & my fellow classmates & friends soon ❤️😁🙌",
      "time": 1728228315,
      "translated": false
    },
    {
      "author_name": "Gaius Chai",
      "author_url": "https://www.google.com/maps/contrib/102304301581870894983/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocINPvliRdccD-Gv0vSYklEVtCFniVgrPI__s9jLqgO53OmP8Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I was running late to my session by 10 minutes, but Ryan was incredibly understanding and still provided me with the full 30-minute treatment. Throughout the session, he was exceptionally hospitable, constantly checking in to ensure I felt comfortable and that the pressure points during the massage were just right for me. The relief was almost immediate, and the entire experience exceeded my expectations. I highly recommend Ryan to anyone looking for a professional and attentive massage therapist. I’ll definitely be recommending him to friends and look forward to returning for another session! plus the view was amazing",
      "time": 1736909323,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13934773076174076206",
  "user_ratings_total": 216,
  "vicinity": "170 Upper Bukit Timah Road, #05-10 Shopping Centre"
}