{
  "formatted_address": "6 Napier Rd, #07-05 Gleneagles Medical Centre, Singapore 258499",
  "geometry": {
    "location": {
      "lat": 1.3076257,
      "lng": 103.8202012
    },
    "viewport": {
      "northeast": {
        "lat": 1.308891530291502,
        "lng": 103.8215099802915
      },
      "southwest": {
        "lat": 1.306193569708498,
        "lng": 103.8188120197085
      }
    }
  },
  "name": "Quah Hak Mien Colorectal Centre",
  "place_id": "ChIJNykco7kb2jERUnsB0rdUezU",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Yanjie Shi",
      "author_url": "https://www.google.com/maps/contrib/101025320509360181245/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIDbPqAOX3IZKkaq2PsR9VL_TkcU6MrcuFaWWkbgEXZ2xKCzQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I was referred to Dr. Quah by a doctor friend who had personally witnessed his surgical expertise firsthand.\n\nFrom start to finish, my experience was truly exceptional. The surgery itself was highly successful, resolving my issue immediately. What stood out most was how remarkably smooth and nearly painless the recovery process was. This gave me the impression that Dr. Quah not only executed the procedure skillfully but also approached it with an emphasis on minimizing recovery time and discomfort. This outcome was a pleasant surprise, especially considering my initial expectations based on online research, which had led me to anticipate a more painful recovery.\n\nIn addition to Dr. Quah’s expertise, the care provided by the support staff and anesthesiologist exceeded my expectations. Their professionalism and attentiveness significantly eased my recovery immediately after surgery, creating a level of comfort I had not experienced in other hospitals.\n\nOne aspect that particularly impressed me was Dr. Quah’s approach to my condition. Since my case was not life-threatening or particularly serious, he did not rush me into surgery. Instead, he initially recommended more conservative, non-surgical treatment methods to address the issue while minimizing risks. This stood in stark contrast to other doctors who had suggested surgery during my first visit. While each case is different, I genuinely felt that Dr. Quah prioritized my well-being and health over financial gain.\n\nOverall, I am deeply grateful for the exceptional care I received from Dr. Quah and his team. Their professionalism, empathy, and dedication to patient welfare left a lasting impression, and I would highly recommend Dr. Quah to anyone seeking top-tier medical care.",
      "time": 1735267813,
      "translated": false
    },
    {
      "author_name": "Ilona Cyd",
      "author_url": "https://www.google.com/maps/contrib/101044979470331711413/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXev7QXOWQiAscKI1VkVwHfT-ICqx335iMtRFMOM0wdtQ9ppiU1=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Thank you to Dr. Quah Hak Mien and team for saving my husband's life. He is a very professional, caring, kind, and expert doctor. Dr. Quah, with his calm and gentle manner, was willing to listen to all explanations, even those from previous results of small hospital and laboratory in Indonesia. He quickly took action to find solutions, leading to a full recovery.\n\nLast year, Dr. Quah saved my brother-in-law’s life. When we brought him in bad condition, in Emergency Department, Dr. Quah carefully listened to what had happened. Then with his knowledge, professional surgical skills, and clear explanations, he decided on surgery for Anal Fistula. Everything went smoothly.\nHis kindness and care toward patients and their families gave us peace of mind and made us feel safe, knowing we were in good hands.\n\nDuring the hospitalization period at Glenegales, when my first son was in a car crash in Australia, Dr. Quah took the time to review the MRI results from Mater Hospital & referred us to his colleague to help us find the best treatment for my son.\n\nMy father-in-law also trusts him for his own condition because, as a skilled surgeon, Dr. Quah knows what is best for his patients and avoids worsening their conditions.\nNow, after recovery, my husband and brother-in-law are very healthy and in good condition. Dr. Quah is like our own family doctor. We hope he and his team will always stay healthy and successful.",
      "time": 1730626618,
      "translated": false
    },
    {
      "author_name": "Xiaoxian Huay",
      "author_url": "https://www.google.com/maps/contrib/101467865302097047625/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWpbYy_aDbxm_qkOv8IbO0BYVwp5PKL-00hEjpTs7VJkrN3us4=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Dr Quah attended to my acute appendicitis (perforated) at gleneagles. Throughout the entire experience, Dr Quah and his team were highly supportive and professional, and I felt I was in good hands. The wounds were minimal and recovery was as comfortable as it could be.\nDr Quah is patient, affable and reassuring, and   a great doctor I'd highly recommend.",
      "time": 1621925147,
      "translated": false
    },
    {
      "author_name": "Mig uel",
      "author_url": "https://www.google.com/maps/contrib/105169588653885549112/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocICwnTX-JFW7oIgM-u9kirW36QlhwcEy5DcSDkJ4FhNU0v4fg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Dr Quah correctly diagnosed my condition where GPs got them wrong. I was in a lot of pain. Surgery was scheduled soon and was successful.\n\nDr. Quah explained my condition very clearly, what to expect before and after surgery, and post surgery care. I’m very thankful for how everything went.",
      "time": 1672929732,
      "translated": false
    },
    {
      "author_name": "Joyce Tan",
      "author_url": "https://www.google.com/maps/contrib/110624343384298483894/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLG5tU-YWDqo8DKEiCblM31q9yQJcihJqdULevyrjXTwpN4IQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "I had hemorrhoids for years and although they were affecting my quality of life, I was reluctant to have the surgery as I had heard of the horrendous pain. So imagine my happiness and relief when I had a really smooth recovery with almost no pain after the hemorrhoidectomy. I also did the two scopes together with the surgery.\n\nDr Quah has awesome skills and is a patient doctor who explains well. The staff at his clinic are very helpful as well. I am thankful to have found a good doctor!",
      "time": 1624507819,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3853767054624652114",
  "user_ratings_total": 39,
  "vicinity": "6 Napier Road, #07-05 Gleneagles Medical Centre"
}