{
  "formatted_address": "1008 Bukit Merah Lane 3, #01-26, Singapore 159722",
  "geometry": {
    "location": {
      "lat": 1.2853126,
      "lng": 103.8049755
    },
    "viewport": {
      "northeast": {
        "lat": 1.286705480291502,
        "lng": 103.8063530802915
      },
      "southwest": {
        "lat": 1.284007519708498,
        "lng": 103.8036551197085
      }
    }
  },
  "name": "RACE WERKS MOTOR SPORTS",
  "place_id": "ChIJq5DlP8wb2jERBkccbevDEr4",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Jon Tan",
      "author_url": "https://www.google.com/maps/contrib/100404106979603496754/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLCMT1XI4G93JgQfXhgJKHk4pNsixBJzKr9k2c-318fK7dVKQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "The workshop is neat and well organised. The service advisor is friendly and helpful. Any after service is addressed promptly. The booking and duration to carry out Desmo service according to the maintenance regime is much faster. Cost is also reasonable. Recommended for owners of Ducati to bring your precious “Italian mistress” to this reputable workshop",
      "time": 1741698553,
      "translated": false
    },
    {
      "author_name": "KCKC",
      "author_url": "https://www.google.com/maps/contrib/116866368543366263728/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWp6hxwG7HrhbtlT8oqMCUJ25UIuqirHXnScSZA9uPLC0j7gIF6=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I just had some work done on my bike here, not my first time, but I felt Race Werks deserve another positive review to convince those looking around for good professionals to look after their precious bikes. The particular professional I am referring to is Uncle Ming (I think). This man is a tower of experience. For me, a lot of mechanics know their stuff but what is impressive is the ability to know of workarounds to small annoying issues, whether electrical or engine related. Not many, I am afraid, possess the creative mind nor experience to think outside the box to deal with these niggling issues. A recent example was an issue with my aftermarket taillight that would fail intermittently. A shop I went to told me to replace it. Uncle Ming removed a superfluous attachment that the previous owner had fixed and re-configured the wiring and assured me that it would not happen again. It hasn't happened again.\n\nMy most recent experience was to get him to convert my tubed tyres to tubeless with Outex tubeless kit, which I bought for him to apply. I wouldn't have trusted anyone else to convert my tyres. Whether it works and lasts is not his responsibility but he has the experience to take this on and the confidence to assure me it should work fine.\n\nWhen I first got my ride (2015 BMW R NineT), I went around searching for a good shop to look after it. My initial instinct was to go to shops that specialise in BMW bikes and there are many. So I tried them. To be fair, not one failed me. However, I wanted a shop near where I live (Clementi) so decided to try Race Werks cos a fellow rider recommended them. I was sceptical at first because they didn't \"specialise\" in BMW bikes. Then I witnessed Uncle Ming repair every make from Ducati, Moto Guzzi, Japanese makes, Triumph and Beemers. That is the wealth of experience he has that I was talking about. One can specialise in a make or two. This man knows them all. So, trust me when I say your precious ride is in the safest hands. There is no good reason for me to trust anyone else.\n\nI guess the only little issue is that Uncle MIng is getting on in age. Well, fingers crossed that he keeps healthy and going. And before I forget, Xiao Hui, their frontline crew is a gem to deal with. They are busy but she will workaround their schedules to attend to your bike and not ask you to come back in weeks. Yes, past experience with another shop.",
      "time": 1733112032,
      "translated": false
    },
    {
      "author_name": "Zr3n Zr3n",
      "author_url": "https://www.google.com/maps/contrib/111551263859108617901/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUaYSdXXtCrGIty87CyB1dgCvv28U6QIsGSEXtnSKMqOkdu3_TMag=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "3rd time servicing my ducati hyper 796 here.\n- Normal Servicing\n- Installation Of Parts\n- Replacement of Swingarm Shaft\n\nSo far so good workmanship from Jack👍🏼\nBeen a few shop that service ducati,so far here is better for me.\nPrice abit ex,but you pay for a good workmanship so i do recomend this shop.\nOutside the workshop have table & chair for you to wait while servicing your bike.\nTheres also vending machine if you need a drink too.\nDo book appointment before you come down👍🏼",
      "time": 1678159666,
      "translated": false
    },
    {
      "author_name": "Ian Barker",
      "author_url": "https://www.google.com/maps/contrib/114794359349608978567/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUE6uWw6Xp5M3FeDMHebabyt3-DvA16x7_tDT6pAZIn2NguClO6=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Great job in getting crash bars (USA) and fitting them. Bike looks great and the bars protect the legs from side impacts or dropping. Not cheap but no price on safety.",
      "time": 1716192258,
      "translated": false
    },
    {
      "author_name": "Khoonkeat Ong",
      "author_url": "https://www.google.com/maps/contrib/108180328589361983681/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJsroLP4DQbr6WX99Egm8coaSu0s2QJt8DN06QnikTBXNKyag=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "9 months ago",
      "text": "My preferred workshop for my bike. 小慧 is very friendly and can be helpful in arranging schedules. Unfortunately, they did not do a good job for the most recent service where I changed the tire and got them to resolve a noise coming from the suspension. Both were done properly but my left indicator and bottom control button stopped working when I took the bike. Turned out it is a wiring harness issue which I feedback to them for their attention which they just tell me it is the dash that is spoilt. It could have been caused by they zip tie my key to the handlebar at that location. Clearly, they can do better especially to told them to look into the wire harness. Hopefully after this review, they do.",
      "time": 1722308261,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13696224832702400262",
  "user_ratings_total": 105,
  "vicinity": "1008 Bukit Merah Lane 3, #01-26"
}