{
  "formatted_address": "585 N Bridge Rd, Level 8 Raffles Specialist Centre, Singapore 188770",
  "geometry": {
    "location": {
      "lat": 1.3012279,
      "lng": 103.857072
    },
    "viewport": {
      "northeast": {
        "lat": 1.302353430291502,
        "lng": 103.8583151802915
      },
      "southwest": {
        "lat": 1.299655469708498,
        "lng": 103.8556172197085
      }
    }
  },
  "name": "Raffles Children's Centre - Kids Clinic - 莱佛士儿科医疗中心",
  "place_id": "ChIJOdIUj7AZ2jEROISU21CEM5o",
  "rating": 3.4,
  "reviews": [
    {
      "author_name": "Lynnette Ng",
      "author_url": "https://www.google.com/maps/contrib/118211421079684763604/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW2HN8dJL0AEe2QyvdrRAnI_soZzKGJBHJfnPi85rsAz-BFf2A2=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "2 weeks ago",
      "text": "I share the same sentiments as Ms Huijuan Lin who commented below (scroll down for her review with picture dated about a month ago).\n\nDr MC Tan has been our child’s preferred doctor since birth as he is extremely patient and knowledgeable. He understands our concerns and offers sound advice and is overall a great doctor for us.\n\nHowever, a caveat! The staff at the registration counter is the direct opposite of being understanding or helpful. The lady who was tasked to take my child’s weight was extremely unhelpful to me and offered zero patience in the process of trying to force a crying, sick toddler to stand up at the weighing scale.\n\nShe nary offered any help while I attempted two tries to take the child’s weight, and in the process my child fell and hit the back of his head against the wall. She thereafter seemingly brushed us off and said try again later while she went to attend to someone else.\n\nThere was a marked difference in behaviour which I observed when another parent asked her for help to direct him to a bin to dispose off soiled diapers and she even went the extra mile to offer to bag and throw the diapers for him. I don’t want to insinuate any racial preference displayed by the staff but one cannot deny that it was quite evident! And in 2025 no less!\n\nThis incident left a bad taste, and I think perhaps the staff can be retrained or assigned somewhere where her preferences can truly shine and leave a better service experience with others than it did with me that day.",
      "time": 1746579981,
      "translated": false
    },
    {
      "author_name": "Nadia Lee",
      "author_url": "https://www.google.com/maps/contrib/115350849857860056278/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSld_OjbCBCKAiIHnc3m3_Et8jMp0F-T1oEOAco8lrvixH8_XjxQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We have been going to Raffles Children's Centre for years for the care of our two boys since the moment they were born and have always had a great experience.\n\nDr. Joyce: She is the pediatric surgeon to both our boys when they had to go through a procedure when they were very young and is one of the kindest doctors you will ever meet. She is so thorough in her explanations of the procedures, so you know all your options, before. After the procedure she will immediately update you on how they did. As they are healing she will then also check in and follow up via WhatsApp where you can ask her as many questions as you need. As first time anxious parents, we truly appreciated this especially since her responses also come with detailed colored drawings of how they are healing. How amazing is that?! She's a fantastic doctor and if your kids are doing any procedure with her, you can rest assured they are in great hands with the kindest doctor.\n\nDr. Chu: Our kids regular pediatrician and also another wonderful doctor we have had the chance to work with for the last few years. She was the pediatrician assigned to our first son when he was born and we are happy she was as she has been great to work with! She's quite popular so appts can get a bit backed up but when we are seen she is always very kind to the kids and remembers many of the little details about their history which is incredible given how many kids she must see over the years.\n\nDr. David: With our son's peanut allergy he has been working with us to understand how allergic he is to other nuts and gives us helpful advice as we navigate his allergies.\n\nOverall we are very pleased with the great doctors we have had an opportunity to work with at Raffles Children's Centre and the excellent team of nurses who are always kind and welcoming when they see us and the kids. Thank you to the whole team!",
      "time": 1744118055,
      "translated": false
    },
    {
      "author_name": "Steffi Lianto",
      "author_url": "https://www.google.com/maps/contrib/108521382032783257526/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU3sKnSyohBF6TFZdCYDUC6Wx0GEJpqWw7CmaZxxxiETtBhRcM=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "I’m coming from indonesia . I’m the satisfied customer here .  the hospital regisration also so easy. My kids is 3 yo and have a cough. He can’t throw his pleghm all by his self . I already visited 2 doctor in indonesia and cannot cure my kids. Thankyou so much Dr Chu Hui Ping for being kind to me and my kids, my kids all well now , he’s  healthy again!! Thankyou doctor & team .\nVery satisfied\n🫶🏻🫶🏻🫶🏻🫶🏻🫶🏻🫶🏻🫶🏻",
      "time": 1729145024,
      "translated": false
    },
    {
      "author_name": "M Letters",
      "author_url": "https://www.google.com/maps/contrib/104466970575958192555/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVxEsoO3iNYdjNEmrFJ0KV7vmXgybbj_QZ6HCzUDoc8_Q1vmII=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "Horrible experience - appointments are set but always have to wait at least 40 minutes from the appointment time. Kids have to wait and delay lunch for these inefficiencies.",
      "time": 1733890224,
      "translated": false
    },
    {
      "author_name": "Sharon Wee",
      "author_url": "https://www.google.com/maps/contrib/115208841090114048088/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIpqKqaZAKd_V7vUJ0IRdxD5oSWc9hphX3h520j9ys7Zx6kow=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Always attended by caring staff like lilian, cindy, Evelyn and head nurse kelly here. Dr issac is always accurate in his diagnosis and my son recovered soon after his prescription.",
      "time": 1728705584,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11111370188469339192",
  "user_ratings_total": 45,
  "vicinity": "585 North Bridge Road, Level 8 Raffles Specialist Centre"
}