{
  "formatted_address": "15 Robin Cl, Singapore 258297",
  "geometry": {
    "location": {
      "lat": 1.3188223,
      "lng": 103.8269834
    },
    "viewport": {
      "northeast": {
        "lat": 1.320037730291502,
        "lng": 103.8282865302915
      },
      "southwest": {
        "lat": 1.317339769708498,
        "lng": 103.8255885697085
      }
    }
  },
  "name": "Raffles House@Robin Close",
  "place_id": "ChIJBwPYjfkZ2jERToeaP1fGr0U",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Kaori",
      "author_url": "https://www.google.com/maps/contrib/103712644154694634220/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWFQhkq4HLS52cbxQFY0qUiK2ZcDfXoXIQZd6RiF7WSvrL2VvaI=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "This is a wonderful preschool with a homely atmosphere.\nI can see that the children feel safe and relaxed since the teachers are very friendly and kind, and take good care of the children.\nThanks to this, I think the children are growing up to be warm-hearted people. I often see older children doting on younger children.\nThe teachers also have a nice atmosphere among themselves, and I get the impression that many of them have been there for a long time.\nMy daughter now loves the teachers and her friends at this school. I am happy to have found this school.",
      "time": 1735802247,
      "translated": false
    },
    {
      "author_name": "WS Wong",
      "author_url": "https://www.google.com/maps/contrib/106674607940458199682/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKtmKj1S6d6QsqIots4QS9QFQy8Y8TlqtQlBV8m_pP5QB-Fwg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "While Raffles House@Robin Close is not a preschool from a big chain nor it has the best or biggest facilities - in fact the hardware of the school is quite basic, but their principal and teachers genuinely like and care about the children.  Special mention to Ms Yi Le who became the school principal since the beginning of 2024 who transformed the culture from almost toxic from her predecessor to the most kids-friendly, harmonious, fun and caring preschool.  I think kids learn the best when they are loved and treasured and they enjoy going to school, enjoy being around teachers and friends and feel going to school is to meet friends and have fun while learning. It's when they learn the best; and also, a good place to build a good character and learn discipline.",
      "time": 1735800481,
      "translated": false
    },
    {
      "author_name": "Glenn Ng",
      "author_url": "https://www.google.com/maps/contrib/105087645568220149285/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUqgf8ISTkHWGkWPsh0bP1raxGVSblmG0cgL1g_MXyyDcxfeLmv=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "My kid currently attends Raffles House at Robin Close and this is the 3rd preschool we have swapped to, but I have found the school to be holistically the best pre school for my child. Learning through play, and good interaction between upper and lower age groups for my only child.\n\nThe teachers and staff are genuinely caring, firm but gentle with the children and is great exposure to all walks of life.\n\nI enjoy that my kid gets to interact with with children her age from Japan, China, India and other European countries. Glad to also have made some friends with the parents of her classmates and we frequently meet up for play dates too.\n\nBest of all, feeding is such a pain for my fussy kid but the food and care of the teachers have helped increase my child's appetite (eats veggies in school!!).",
      "time": 1735803546,
      "translated": false
    },
    {
      "author_name": "E.N",
      "author_url": "https://www.google.com/maps/contrib/116569903159342472598/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIbMVumoKHPU7UsY6wXisFPspQuGHU23d4b_AWYwcf-7QDxNg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "As parents, we all hope to give our children the best possible start in life. Reflecting on the many decisions I’ve made for my child, I can confidently say that enrolling at Raffles House @ Robin Close has been one of the best choices so far.\n\nWe have been part of the Raffles House family for over a year now (and counting), and our experience has been nothing short of amazing.\n\nThe school boasts a wonderful mix of students from various nationalities and cultural backgrounds, creating an inclusive and enriching environment for the children.\n\nThe curriculum involves a blend of indoor classroom learning, outdoor playtime at the playground, Gym-Kids sessions (a child-friendly introduction to gymnastics), and occasional educational field trips—many of which parents are often invited to join.\n\nTeachers here are truly exceptional. They consistently bring joy and excitement to my child’s learning experience, and it’s evident every time we pick her up from school.\n\n**Special mention to Ms. Wujing, whose warmth and care have left such a lasting impression on my child that her name often comes up in conversations about school.\n\nI also want to take this opportunity to commend Ms. Yi Le, the new principal who took over in early 2024. As a first-time parent, I hadn’t fully appreciated the impact a principal could have until I witnessed the positive changes and energy Ms Yi Le brought to the school.\n\nHer dedication is evident in everything she does—from personally greeting the children during daily check-ins and check-outs to going the extra mile during celebrations (dressing up as a T-Rex or Santa Claus to spread cheer). Most importantly, she is always approachable and responsive, addressing any questions or concerns we may have as parents.\n\nI am truly grateful to the team at Raffles House for creating such a nurturing and stimulating environment for my child. Knowing my kid is in such capable and caring hands gives me complete peace of mind, and I highly recommend this preschool to any parent looking for a place where their child can thrive in.",
      "time": 1736152448,
      "translated": false
    },
    {
      "author_name": "JQ Ong",
      "author_url": "https://www.google.com/maps/contrib/117905163474724306073/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJAZQGXhrCF5UhzyG6GLU0EGCACj5ZPb89e21FyoC_8zdzh0CIK=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Raffles house at robin close has been a perfect fit for my kids. Teachers are caring and patient, good mix of students from different nationalities and cultures, principal Yi Le is super passionate about kids. Facilities are not fancy, but it has its own charm and I think my kids find it homely.",
      "time": 1736065602,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "school",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5021450187572938574",
  "user_ratings_total": 20,
  "vicinity": "15 Robin Close, Singapore"
}