{
  "formatted_address": "46C Lor 23 Geylang, Singapore 388375",
  "geometry": {
    "location": {
      "lat": 1.3152518,
      "lng": 103.8814617
    },
    "viewport": {
      "northeast": {
        "lat": 1.316593280291502,
        "lng": 103.8827192302915
      },
      "southwest": {
        "lat": 1.313895319708498,
        "lng": 103.8800212697085
      }
    }
  },
  "name": "Raffles Montessori (Aljunied) Preschool",
  "place_id": "ChIJxSsE7joY2jERFVgJz6P8xlo",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Michelle Lim",
      "author_url": "https://www.google.com/maps/contrib/109370884911696867286/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJqm4805CodFIAqAnRs_B1AUgSR9GD2rOdc5Uhtd6AkQhmeaQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Raffles Montessori is a lovely boutique size pre school. Although the school is small, the environment is very clean and has a positive learning for the students.\n\nApart from the regular teacher to student ratio, max 1:5 / 1:6, the school strived to be child oriented and focussed. Every child is assessed individually and guided by the teachers with full attention. The teachers and principal never compare the children’s performance and progress with their peers. The teachers are very professional, patient and caring to the children. They are always willing to provide guidance to the children when they require and keeps close update to the parents on the child progress.\n\nRaffles Montessori is an excellent pre school. When my child looks forward to school everyday, it reflects how much she loves to go to school.\n\nGood job Teachers! Keep it up, Ms Jasmine and team!",
      "time": 1700151043,
      "translated": false
    },
    {
      "author_name": "Angela Gan",
      "author_url": "https://www.google.com/maps/contrib/101281506016910539486/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIWYHjIOJBsArefL248Tc7-8sXyyC9esPF3IllLQJvUkSiwsQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Raffles Montessori is a wonderful school. The teachers put in lots of effort to make school fun, while ensuring the kids have a conducive environment to learn. This is evident from my son’s enthusiasm towards going to school every day. A small and close knit community, all the teachers in the school seem to have a genuine interest in the welfare of every student. This school has provided a nurturing environment for my son for almost 4 years now. I would definitely recommend Raffles Montessori to parents!",
      "time": 1664124462,
      "translated": false
    },
    {
      "author_name": "lingming yeoh",
      "author_url": "https://www.google.com/maps/contrib/115343121255874163277/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUd4WW7KBaTD9krQ2x0KlyfuoCVpm0pX0v-xn-TKKw7ksvtPx8=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "My son has been with Raffles Montessori (Aljunied) since he was 17 months old and will be graduating at the end of this year.\n\nWe decided on this school right after meeting the directress / owner of the school.\nMy son could barely communicate then but the school puts our mind at ease from day 1.\n\nRaffles Montessori is a boutique size pre school.\nApart from the regular teacher to student ratio, max 1:5 / 1:6, they're child oriented.\nThey focus on your kid individually and would never compare your child's progress with his peers.\nMany parents have the misconception that a Montessori is not academic driven and the child might not be able to catch up in Primary school but this is not the case for Raffles Montessori.\nNot only do they follow the MOE calendar and curriculum when the child turns 6, they don't stop your learning curve, above all, educators in school are excellent.\nThey follow up closely with parents but is also aware and careful dealing with the child's emotions.\n\nMy kid is a single child, in school, he learnt independence and many soft skills that would help him in the coming years.\n\nThank you so much for everything!",
      "time": 1664160317,
      "translated": false
    },
    {
      "author_name": "Kristina Natalia",
      "author_url": "https://www.google.com/maps/contrib/116058779667744416975/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKmg4UJbd6IlD-RZFGNKWF9QkMEWRNcU7enL8jU2EqQIUdBbg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Raffles Montessori (Aljunied) is a good school that helps to shape my son to who he is right now.\n\n1. Management, Principal and Teachers\nThey are professional and equipped well with Montessori teaching skill and knowledge. They are observant and attentive to the students. The main difference is they guide and teach with LOVE!\n\n2. School fee\nIt is on the high side if compare to normal pre-school. However, the material used in Raffles Montessori prepares my son well to the next level of education. No enrichment class requires to get him ready for primary school. Most importantly, the school teaches him good values and shape him to a boy that respects time and able to focus on his task on-hands.\n\n3. Location\nConvenient location, opposite Aljunied MRT and bus stops around the premises. It situated in a private building with a big piece of land on the ground floor for the outdoor activities.",
      "time": 1663757933,
      "translated": false
    },
    {
      "author_name": "Juan Carlos Lapena",
      "author_url": "https://www.google.com/maps/contrib/109970529451492680779/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKnQgLy_Up7ekzguAsb3wMbhzj2dLMKUN6qW5BbXvPFjeEQpg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Teachers and staff are all friendly and caring to the students. They make sure that the kids are learning and having fun. Keep it up!!!",
      "time": 1700392116,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6541193289285589013",
  "user_ratings_total": 13,
  "vicinity": "46C Lorong 23 Geylang"
}