{
  "formatted_address": "1 Raffles Institution Ln, Singapore 575954",
  "geometry": {
    "location": {
      "lat": 1.3466071,
      "lng": 103.843095
    },
    "viewport": {
      "northeast": {
        "lat": 1.348070580291502,
        "lng": 103.8444415302915
      },
      "southwest": {
        "lat": 1.345372619708498,
        "lng": 103.8417435697085
      }
    }
  },
  "name": "Raffles Institution",
  "place_id": "ChIJx9MvzT8X2jERLvSR1fntFoI",
  "rating": 3.9,
  "reviews": [
    {
      "author_name": "Gary Hong",
      "author_url": "https://www.google.com/maps/contrib/100426561456926509019/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVeUQnOM_jYhbH5dqZu7nRCecSAHAHiABJoPv3wQZDoc8ZB77jGXA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Attending Year 5 students briefing. First time step into their Lecture Theatre and feel like going back to school.",
      "time": 1741687667,
      "translated": false
    },
    {
      "author_name": "seal",
      "author_url": "https://www.google.com/maps/contrib/106768535245275935025/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX2bO-h3GISClKKHQMZU61VflLWL3vEoohd4PkSlgH2f1KXZxU=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "would absolutely recommend if you want to become a condescending, insufferable human being. what on earth are they teaching RI students? knew multiple boys from church who were somewhat decent, it's been four months since they entered RI and suddenly they're all insanely arrogant, racist and downright rude. one of them in particular, in the span of less than two months, developed a habit of repeatedly making 'jokes' about one of my classmates who also attends my church, and now he refuses to own up to his own mistakes, instead blaming everyone else around him. not a student there but for such a prestigious school, it clearly doesn't live up to its hype. almost every RI student i've encountered and personally talked to is ridiculously competitive, and unnecessarily bashes other schools for seemingly no reason, other than just for the fun of it. elitist and absolutely stuck-up. would have given this a one-star if not for the fact that there are, surprisingly, still decent RI students around, and not every poor soul that steps into that campus turns snobbish and rude.",
      "time": 1744854744,
      "translated": false
    },
    {
      "author_name": "Chan Kai Joen (Rafflesinst)",
      "author_url": "https://www.google.com/maps/contrib/112052474547225519840/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJECGk2UT70fzgw1FJ3CvBYH6y6KYnGBgx-IxEzV6EC42FupQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "RI is my school. The facilities are really good. The learning environment is also really good. I would want to be a student there forever.",
      "time": 1742461832,
      "translated": false
    },
    {
      "author_name": "WANG SIQI S1-08",
      "author_url": "https://www.google.com/maps/contrib/109969337411464675125/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU-0oDtp97RALDIirwYIQ_nmW7f-D_tfkQ9NiVzacNrtkJ9S1o=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "Snobbish kids. Like I get it that RI is one of the top few secondary schools but even the HCI and ACSI people aren’t that snobbish. They look down on everyone that isn’t from RI.",
      "time": 1745925342,
      "translated": false
    },
    {
      "author_name": "Aydan Joshua Chan Jan (Rafflesinst)",
      "author_url": "https://www.google.com/maps/contrib/106120520234822920672/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL9XZBYXVansE2cgq3YfOc_b7eDCjOPwZ_nvjsfisTWjJnC2w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "It's been a term in here and I'm going to give my honest opinion on this school. In short, RI has many pros and cons, and it depends on what you're looking out for. I'm here to point them out:\n\nThe stuff they give is also really hard. At the moment, we're doing advanced factorization and expansion with quadratic formulas and everything for math, and for Chinese we have to do a 2-minute-long video speech on something about raffles (a lot of the subjects have WAs related to raffles like History, Literature, Chinese, AEP). You need to really manage your time well and try not to stress out if you want to do well in raffles.\n\nI also feel that the toilets in some areas are terrible, in spite of the recent renovations. It's so bad, people gather at secret toilets hidden or overlooked all over the school just to get changed and it's becoming too competitive.\n\nOn the contrary,\n\nI think that the food here is amazingly eatable. Personally recommend the Chicken Rice and the Yong Tau Fu from the Thai store. The professor brawn cafe is really expensive though, but the chills store is good (it's like 7-11). Theres also slushy at Uncle Chang Cafe in the canteen.\n\nThe teachers here are absolutely goated, and they do their best when it comes to teaching, even if they're not so experienced, Some teachers have disliked teaching methods, like ahem ahem Sir V. S. but he's very experienced and I'm pretty sure he knows what to do.\n\nOne thing I really appreciate about RI is that they have 40++ CCAs to choose from. With this wide variety there comes more choices. The con about this is that at the start of the year for y1s it'll really stressful because there's the trials and everything. But after you finish its quite chillax. I made some good friends at my CCA, and as mine is only twice a week (other ones are typically thrice) it's really chillax. Make sure to do research for each CCA and consider your choices carefully. You don't want to end up in a CCA which isn't fitting.\n\nI think the Electives are also well crafted. I'm in RI-AEP and I feel that they catered the thing for us boys. They are also quite open to discussion and rebuking of opinion there, which is good.\n\nSomething I'd like to address about the reviews here is about how people tend to turn snobbish and mean when they come to RI. I feel like that tends to be quite true and relatable, even for me. I found that I myself turned more snobbish and rude when I joined RI. A lot of my peers and ex classmates in other schools like HCI and ACSi tend to notice that trait and point it out to me. Thats the issue; they don't realise how it happens till you tell them. For me, I personally feel that the reason for this patters is because of something I'd like to call the \"Best school attitude\". When boys come to RI they usually enter with the mentality that RI is the 'best' school in Singapore and they're the 'best' for joining RI as either they're the 'smartest' or best in what they do (DSA). This isn't the correct mentality, and i feel that the school is trying to lean more to correcting the students mentality, which is a step in the right direction. You will tend to hear a lot of the teachers trying to do so when they give exaggerated comments like \"you were once a golden statue in primary school but this is Secondary school and you won't be the best, so please correct your Primary school attitude.\" And stuff like that.\n\nIn addition, there also tends to be a lot of school flaming in RI like \"HCI people are Chinks and sucks\" and because of that combined with the \"best school\" mentality i mentioned earlier i feel that this is why the students are so condescending towards others. This is also something the teachers try to do here. Also school flaming is quite common everywhere, but its especially apparent in RI.\n\nTherefore, whilst Ri has many pros and cons, and has not the best students, I still feel that RI provides a condusive learning environment for students to learn whilst leaning more to corrrecting the attitudes of the students. However im just a y1 so take this with a pinch of salt.",
      "time": 1744995186,
      "translated": false
    }
  ],
  "types": [
    "secondary_school",
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9373941331704017966",
  "user_ratings_total": 320,
  "vicinity": "1 Raffles Institution Lane"
}