{
  "formatted_address": "Bugis Street Bugis Street Level 1 #D1, D9, Singapore 188867",
  "geometry": {
    "location": {
      "lat": 1.3002826,
      "lng": 103.8547549
    },
    "viewport": {
      "northeast": {
        "lat": 1.301498130291502,
        "lng": 103.8562988302915
      },
      "southwest": {
        "lat": 1.298800169708498,
        "lng": 103.8536008697085
      }
    }
  },
  "name": "Recoil - Bugis Street",
  "place_id": "ChIJu33L9LoZ2jERC02uzEPbhXQ",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "karthik raj",
      "author_url": "https://www.google.com/maps/contrib/104939349747401662934/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXi6RlQkdGFAu3eO_NdjmqKSnytS7haL-X4dvSlWGpN7ufGy7M1=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "⭐⭐⭐⭐⭐ Excellent Service from miss Isabelle!\n\nI had an amazing shopping experience at recoil, thanks to miss Isabelle! She provided outstanding service with a warm smile, making my visit truly enjoyable. She never disappoints in bringing more and more stylish designs and made sure the shirt I chose fit perfectly and suited me well. I really appreciated her advice on colors that complemented me, which made my shopping much easier. Her attention to detail and customer care were exceptional. I will definitely be coming back! For her attention on customer service l. Highly recommend!",
      "time": 1740384034,
      "translated": false
    },
    {
      "author_name": "Doraemon",
      "author_url": "https://www.google.com/maps/contrib/112665277904119154671/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX2VSCcaT9axvOwx2nD8XD3PgZ8V5VFnv420aocMSfLa6GlcEmN=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I've been a loyal Recoil customer for years, ever since I first discovered their store in Bugis Street.  I was immediately drawn to their trendy designs and the quality of their clothing.  Their shirts, in particular, have a great fit, and I love the way their cotton feels.  It irons easily and doesn't wrinkle as quickly as some other shirts I've owned.\n\nKitty and I have made Recoil a tradition for our Chinese New Year shopping.  We always find stylish pieces that we love. This year, we snagged a few new T-shirts and I even picked up a shirt for the festivities.  I was also impressed by their suit sets.  They're so well-priced and stylish, and it's great to find a complete outfit for a reasonable price compare to a tailor shop.\n\nRecoil keeps things fresh with new designs every year, and they always have fantastic sales, especially during Chinese New Year.  We even became Recoil members a couple of years ago, and we've since upgraded to Gold Members.\n\nThe staff is very friendly and helpful, although they can be a bit pushy during peak seasons like Chinese New Year. It's definitely busier during those times, but the selection and value are worth it!\n\nIf you're looking for couple wear with your partner, Recoil is also a great place to check out. They have a wide variety of matching or complementary styles for couples.\n\nOne thing to note is that most of their T-shirts are oversized.  So if you're someone who likes to wear oversized tees, this is definitely the place to come.  However, you can also get smaller sizes if you prefer.  Kitty and I usually go for extra small, which is typically equivalent to a size Medium for us.  If you want a more fitted look, just go down a size from your usual size.\n\nOverall, I highly recommend Recoil if you're looking for high-quality T-shirts, stylish shirts, or affordable suit sets. They're a great option for trendy and stylish clothing at a reasonable price.",
      "time": 1737216599,
      "translated": false
    },
    {
      "author_name": "KasperxP",
      "author_url": "https://www.google.com/maps/contrib/114210666729042004471/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKFYa8MDETS3nPqf21VkxqH_NACB_-eSyAX3lbL1OUdDU0r-jqJ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "One of my favorite places to shop since pre-COVID, this Store offers timeless sleek designs. The quality is good and prices are reasonable.\n\nThe Staff are well-trained and approachable.\nI'm hoping they have Jogger Pants with two back pockets.\n\nThey offer a wide range of products from Caps, Belts to Tees and Pants.\nDefinitely worth adding some pieces to your wardrobe.\n\nPS: Don't be like some establishments that have no standards yet expect a 5-Star Review. LMAO",
      "time": 1745116788,
      "translated": false
    },
    {
      "author_name": "oXRYSTALo Ong",
      "author_url": "https://www.google.com/maps/contrib/114556064085815871377/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSTtKcF9FYMbh-XNbDu8f7Whl3gi-ZY6T8pFPOm3v9Y98Ws7jL=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Recoil: A Go-To for Trendy and Affordable Fashion (4.5/5 Stars)\n\nRating:\n\n• Products: 4.5/5 (High-quality shirts, trendy designs, good value for suit sets)\n• Service: 4/5 (Friendly and helpful staff, but can be a bit pushy during peak seasons)\n• Atmosphere: 4/5 (Fun and vibrant, a good place to browse for trendy clothes)\n• Value: 4.5/5 (Great deals and sales, especially during Chinese New Year)\n\nOverall: 4.5/5\n\nDonkey has been a loyal Recoil customer for years, ever since he first discovered their store in Bugis Street.  He was immediately drawn to their trendy designs and the quality of their clothing.  Their shirts, in particular, have a great fit, and he loves the way their cotton feels.  It irons easily and doesn’t wrinkle as quickly as some other shirts he’s owned.\n\nDonkey and I have made Recoil a tradition for our Chinese New Year shopping.  We always find stylish pieces that we love. This year, we snagged a few new T-shirts and Donkey even picked up a shirt for the festivities. He was also impressed by their suit sets.  They’re so well-priced and stylish, and it’s great to find a complete outfit for a reasonable price compare to a tailor shop.\n\nRecoil keeps things fresh with new designs every year, and they always have fantastic sales, especially during Chinese New Year. We even became Recoil members a couple of years ago, and we’ve since upgraded to Gold Members.\n\nThe staff is very friendly and helpful, although they can be a bit pushy during peak seasons like Chinese New Year. It’s definitely busier during those times, but the selection and value are worth it!\n\nIf you’re looking for couple wear with your partner, Recoil is also a great place to check out. They have a wide variety of matching or complementary styles for couples.\n\nOne thing to note is that most of their T-shirts are oversized.  So if you’re someone who likes to wear oversized tees, this is definitely the place to come. However, you can also get smaller sizes if you prefer.  Donkey and I usually go for extra small, which is typically equivalent to a size Medium for us. If you want a more fitted look, just go down a size from your usual size.\n\nOverall, I highly recommend Recoil if you’re looking for high-quality T-shirts, stylish shirts, or affordable suit sets. They’re a great option for trendy and stylish clothing at a reasonable price.",
      "time": 1737352909,
      "translated": false
    },
    {
      "author_name": "Jasmine",
      "author_url": "https://www.google.com/maps/contrib/110463979983642463001/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUpsrIsQhjjbAkSbxjNN806Q64p-tsJ9wGhl8ZnHHOvOC8ZmWPs=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Sinchan t-shirts are now available at the store. The staff is very helpful. Amazing designs and unique collection",
      "time": 1735311789,
      "translated": false
    }
  ],
  "types": [
    "shopping_mall",
    "clothing_store",
    "store",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8396358164545424651",
  "user_ratings_total": 54,
  "vicinity": "Bugis Street Bugis Street Level 1 #D1, D9"
}