{
  "formatted_address": "Block 54 Chin Swee Rd, #07-23, Singapore 160054",
  "geometry": {
    "location": {
      "lat": 1.2874996,
      "lng": 103.8411942
    },
    "viewport": {
      "northeast": {
        "lat": 1.288739030291502,
        "lng": 103.8424209802915
      },
      "southwest": {
        "lat": 1.286041069708498,
        "lng": 103.8397230197085
      }
    }
  },
  "name": "Red Star Restaurant",
  "place_id": "ChIJIds6rnUZ2jERPx6E0UCf6HM",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "The Eating Shrimp",
      "author_url": "https://www.google.com/maps/contrib/113289028711322653544/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV9PpxfhlAZPHc57UJlAsrVfw5nPgiGO-FP6liS_F87ZC1jRgt0=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "3 weeks ago",
      "text": "you know a Chinese restaurant is established when it’s tucked away in a carpark 👍🏻\n\nI came to know about Red Star Restaurant when my partner told me over CNY that Yu Sheng was actually invented in Singapore, more specifically by this restaurant.\n\nSo after CNY, my family dropped by to experience the traditional yum cha ways. Upon arriving, you are instantly transported out of space-constrained Singapore and into another world. The Restaurant covers the floor space of an entire carpark level, bustling with energy. The food was generally good, although I think you can find better quality dim sum elsewhere in Singapore, but this experience- you definitely cannot. They come around with dim sum trolleys in true yum cha fashion offering you what they have.\n\nFor our first round, we took everything on the trolley: Siew Mai (good,juicy,yumz), chicken feet (I’m not a fan, I imagine myself sucking on the chicken’s feet and I just can’t, but my father said it was good), salted egg bun (nice, but standard) and some other dim sum which i cant name…\n\nFor our second round, we took a little less- Dan Tat (okay, standard), Deep Fried Prawn Cake with bread bits (which I dropped on the floor and screamed cause I was sad cause it was good) and glutinous rice which I did not try.\n\nOur third round- from the specialised Cheung fun trolley (prawn & char Siew- not nearly as good as the freshly made ones).\n\nWe finished off our fourth and final round with roast duck (really really good, meat was juicy and flavourful, skin was super cripsy like Peking duck) AND FINALLY our Har Gow came after asking the poor aunties and uncles about a thousand times “有HarGow吗？HAR GOW HAR GOW!!” Lol. It was good :-)\n\nThe total bill for four people came to $123, which is generally pretty pricey for dim sum but hey it’s the experience you pay for as well. Would I come back? I think I would if someone suggested it, but not willingly. Oh and avoid coming at peak hour at all costs if you can’t stand having to fight for carpark slots. 🤨\n\n27 April 2025:\nAt dinner time, red star transforms into a Zhi Char place! We got cabbage with scallop & whole garlic (nice but we regretted getting this as other dishes might have been nicer 🫢), sweet and sour pork (okkkk) & hei zou (super nice!!!).",
      "time": 1745775137,
      "translated": false
    },
    {
      "author_name": "Andrew Tan",
      "author_url": "https://www.google.com/maps/contrib/100064065631123526331/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVt7EE_EAseYfLUx8JxHsg0q28PqRxvVCyuCuJ8g0-F79JFsDta=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "There's something truly special about this charming dim sum spot that evokes nostalgia and sets it apart from others in Singapore. Unlike the bustling dim sum restaurants in Hong Kong that are often filled with loud chatter and excitement, this place offers a more serene experience. Tucked away in cozy HDB enclaves, it feels like a hidden gem that deserves to be cherished and preserved. It's a comforting reminder of the simpler joys in life.",
      "time": 1746269473,
      "translated": false
    },
    {
      "author_name": "Tong Peng Tan",
      "author_url": "https://www.google.com/maps/contrib/104377483463053572464/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKjGHDBKycOzwjy8nSDy_OSYNihZQKQWoF5AAHyw6tc9uJ6uw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Had Dim Sum at Red Star on this morning. This is a very long establishment with rich history. Probably been here once a very long time ago.\n\nThe food was good but not exactly 5* amazing, the duck and roasted specialties feels like a miss, otherwise their dim sum was ok. Service was lacking, the push cart wasn’t actively covering the ground but instead you have to self service by going to the push cart and taking what you want from there.\n\nDining here does provide a kind of nostalgic feeling and it is worth trying this long standing restaurant for at least once. Will I go out of the way to come here again? Probably not.\n\nOther than that, still a decent decent dim sum experience.",
      "time": 1741433479,
      "translated": false
    },
    {
      "author_name": "Joseph Lum",
      "author_url": "https://www.google.com/maps/contrib/117912763012378764047/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI2vYRaa0EB_CKvZAwGtoZD7hhuIDZH08MTfDlx745kij3bLlg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "3 weeks ago",
      "text": "The dim sum served was delicious, though the overall flavor profile leaned towards the saltier side. Most of the push cart servers, easily identifiable by their red hats, primarily communicated in Chinese or Cantonese.\n\nThe frequency of the push carts was good, ensuring a steady flow of food without long waits. Pricing is on the higher end compared to typical dim sum offerings in Singapore, but it is reasonable given the full-service restaurant setting.",
      "time": 1745740034,
      "translated": false
    },
    {
      "author_name": "Stephy Tay",
      "author_url": "https://www.google.com/maps/contrib/114918578836460834092/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXbANd0ny3P4G9xDJUOIybMCWN_mUgVn5ecEqRzE5Ux2aJ7L98C=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "The most near to hkg style dim sum in SG in my own opinion.\nHave been patronising them for more than a decade.\nThey serve really good porridge and fried dim sum.\nWeekend queue will be super long.\nBe there before 9am to beat the Q during weekend",
      "time": 1747123938,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8352100609700404799",
  "user_ratings_total": 3929,
  "vicinity": "Block 54 Chin Swee Road, #07-23"
}