{
  "formatted_address": "34 Sin Ming Ln, Midview City, Singapore 573955",
  "geometry": {
    "location": {
      "lat": 1.3603509,
      "lng": 103.8338559
    },
    "viewport": {
      "northeast": {
        "lat": 1.361674030291502,
        "lng": 103.8352595802915
      },
      "southwest": {
        "lat": 1.358976069708498,
        "lng": 103.8325616197085
      }
    }
  },
  "name": "Red SchoolHouse",
  "place_id": "ChIJG67JHD0X2jEReyHzsufYY7o",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Xinyan Yap",
      "author_url": "https://www.google.com/maps/contrib/118129758831811081693/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLCjj09maCSZgrpN6IAweheOdvRv-WXsB6Eh3AlMKta2wlK=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "My son spent his K2 year at Red SchoolHouse, and it was a fantastic experience for him. As a new student, he adapted quickly, thanks to the warm and welcoming environment created by the caring and friendly teachers.\n\nOne of the standout features of the school is the playground area on the top level, where children get to enjoy their daily playtime. This was something my son looked forward to every day, as it gave him the chance to have fun while developing his motor skills and socializing with friends.\n\nThe school provides regular updates on his progress and upholds high standards in behaviour and character development, which we truly appreciate. He especially loved the monthly excursions, which were always well-planned and engaging. The English and Chinese speech and drama performances were also a highlight, allowing parents to see the children’s growth and confidence.\n\nThe graduation ceremony was well-rehearsed and meaningful, making it a perfect way to celebrate their K2 journey. Now that he’s in Primary 1, he still fondly remembers and misses his teachers at Red SchoolHouse—a testament to the positive and lasting impact they had on him. Highly recommend this preschool for its nurturing environment, engaging activities, and holistic approach to early childhood education!",
      "time": 1741247621,
      "translated": false
    },
    {
      "author_name": "Lawrence Lim",
      "author_url": "https://www.google.com/maps/contrib/108858528903468327482/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI9Oy4IMtPYuuvsaN8W1tVE1XzrWo6EaxM5y-RdGrvy6EInQg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "As a parent of two daughters attending Red Schoolhouse, I couldn’t be more grateful for the amazing support and dedication shown by the entire team. My elder daughter has been with the school since 2020 and is now thriving in Primary 3. She has had countless joyful and enriching experiences, and it’s heartwarming to see how much she loves going to school every day. My youngest daughter joined the school in 2022 and is currently in K1. She’ll be moving to K2 next year, and I’ve already witnessed remarkable growth in her learning and confidence. It’s truly reassuring to know that both my children are in such capable and caring hands.\n\nThe teachers and staff at Red Schoolhouse are exceptional. Their hardworking nature, nurturing approach, and dedication to each child’s growth have made all the difference. They create a welcoming and engaging environment where learning is fun and meaningful. The school’s focus on developing not only academic skills but also social and emotional growth is commendable. My daughters always come home excited to share what they’ve learned, and it’s clear how much effort the teachers put into making each day special for the students.\n\nAs parents, we also greatly appreciate the open and consistent communication from the school. The staff keeps us informed about our children’s progress, upcoming activities, and any concerns, making us feel like valued partners in our children’s education. It’s this collaboration and transparency that make Red Schoolhouse stand out as an exceptional educational institution.\n\nTo the wonderful team at Red Schoolhouse—thank you for your patience, dedication, and unwavering commitment to nurturing young minds. You have created a warm and positive environment where children can thrive and grow. I am deeply grateful for all that you do, and I am confident that my daughters are receiving the best possible foundation for their future. Keep up the fantastic work!",
      "time": 1737716129,
      "translated": false
    },
    {
      "author_name": "KYChingS Y",
      "author_url": "https://www.google.com/maps/contrib/104604502496759145840/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKS8juZoZdqMJOPNjcymL4QEisdyTfS4osKgd-PTO1dFHOgQiG2=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "School is accommodating and welcoming in all aspects. My child has been with the school since last Nov and he looks forward to school every day. Classrooms are spacious and has lots of natural light. Kids get a bit of vitamin D daily with morning outdoor activities at the roof top playground that has lots of safety barricades.\n\nElena the deputy incharge runs the school with passion and a genuine love for kids. Teachers there are dedicated and enthusiastic and most importantly, kids at the school seem to really enjoy school and their friends.  The older kids converse confidently and eloquently, are well behaved and carefree. Observed quite a few siblings enrolled together there too.\n\nTeachers and Incharge -Elena- have done an excellent job at providing a safe space with healthy boundaries for our kids to thrive in. A space in which parent can have peace of mind, knowing that their precious little ones are in safe hands. 🙏🏻\n\nA real gem of a school !",
      "time": 1745334346,
      "translated": false
    },
    {
      "author_name": "Gayathiri Krishna",
      "author_url": "https://www.google.com/maps/contrib/100922529976043116481/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIJ6M2gpvyIJpzP3-dGcd-udSq9wfPpdMEYZqKdcg4U09rdWg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Red Schoolhouse has been an incredible part of our son Dylan's journey, ever since he joined at just 18 months old. Watching him grow, learn, and thrive in such a caring and nurturing environment has been a true joy.\n\nThe dedication, love, and positive influence of the entire RSH team have played a significant role in shaping Dylan’s early years. A special thank you to Ms Rachel and Teacher Katherine. Your warmth and support have meant the world to us. Teacher Katherine, especially, has been an invaluable listening ear, always addressing any concerns or uncertainties we faced in our journey as parents.\n\nWith our daughter still having two more years at RSH, we are excited and confident that she will continue to receive the same exceptional care and guidance.\n\nWe feel truly blessed to have such a wonderful group of people shaping our children's early years. Thank you for the lasting impact you've made on our family!\n\nWith heartfelt appreciation,\nWilliam & Dharshini❤️",
      "time": 1734624541,
      "translated": false
    },
    {
      "author_name": "D ushijima",
      "author_url": "https://www.google.com/maps/contrib/112675996458403991971/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU_MPe7MhAarTqpsYdN5l4iK04obp6PytDMXA8R1PyARQtWa0uT=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "My son has had the wonderful opportunity to meet great teachers at this preschool, gain valuable experiences and lessons, and make many amazing classmates and friends. He is truly happy here. I sincerely hope that Preschool House continues to thrive for many years to come, spreading love and care to as many students as possible.\n\nThe previous preschool expressed significant concern about my son’s restlessness and advised us to address the issue promptly. Despite consulting an expert, we couldn’t pinpoint the cause. While searching for a new preschool, I came across Red School House on Google and decided to enroll him there a year ago.\n\nWithin just a month of joining, my son’s behavior noticeably improved. He became calmer, started dancing joyfully with his classmates, and his academic abilities showed remarkable progress. The major difference from his previous preschool is the high level of transparency in school management and the close, supportive relationships between teachers and students. It’s evident that the staff’s wholehearted dedication and love have created an environment that positively nurtures my son’s motivation and emotional well-being.\n\nI was particularly impressed by how openly parents are encouraged to participate in school events. Parents can post photos from these events on the class WhatsApp group and actively exchange opinions on topics like choosing a P1 school. The teachers’ involvement extends beyond school hours, as they even participate in private events, maintaining a warm and close connection with the students.\n\nAs native Japanese speakers, we were initially worried about our son’s Chinese language skills. However, thanks to annual support sessions in Berries learning school and the red schoolhouse’s efforts, his Chinese conversation, reading, and writing skills have improved significantly, allowing us to transition to P1 with confidence.",
      "time": 1731831476,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13430817003400274299",
  "user_ratings_total": 22,
  "vicinity": "34 Sin Ming Lane, Midview City"
}