{
  "formatted_address": "29 Bendemeer Rd, #01-75 Market & Food Centre, Singapore 330029",
  "geometry": {
    "location": {
      "lat": 1.3192678,
      "lng": 103.8627675
    },
    "viewport": {
      "northeast": {
        "lat": 1.320633680291502,
        "lng": 103.8638935802915
      },
      "southwest": {
        "lat": 1.317935719708498,
        "lng": 103.8611956197085
      }
    }
  },
  "name": "Redhill Pork Porridge 红山猪肉粥 @Bendemeer",
  "place_id": "ChIJPxrrg8EX2jERYPuRs6dVr3Q",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "ellejay",
      "author_url": "https://www.google.com/maps/contrib/103392171617097923838/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWAUBfFnU0yxi0wM-V_4HCGfg8Ty9hq-C3MwOTGyFVFve7ZgXI=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Hearty bowl of porridge with thick liver slices, marinated pork meat, and pork meatball.\n\nMeatball was not the packaged kind but tasted quite average, and not a big fan of the tang cai. But other than that it was a good meal. The youtiao is deep fried on the spot!",
      "time": 1742657578,
      "translated": false
    },
    {
      "author_name": "Chinese Moon",
      "author_url": "https://www.google.com/maps/contrib/106735384857518209558/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIwUz7Ndtfcdpp5ki07hwPRtvJ48SDFLBn-svU7Lrp8ozH2Xw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "One of the best porridge stalls in Singapore.  Full flavoured with fresh ingredients.  Outstanding pork balls filled with ingredients.  Liver was fresh and not chewy.  Extra cost for you tiao.  Stall was clean and service fast and friendly.",
      "time": 1738737612,
      "translated": false
    },
    {
      "author_name": "Wei",
      "author_url": "https://www.google.com/maps/contrib/106857427212997686613/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJBFYE0L_31miPjpQ6L1I8jB4r8Pzg3breUE2dV76V5gZ9Nnw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "The porridge was pleasantly savory and offer a warm and comforting start to the day. The ingredients featured a simple yet satisfying trio of ingredients: tender pork slices, flavorful pork balls, and thick, fresh pig liver without any 腥味. Each element was well-prepared, contributing to a hearty and fulfilling meal. This is a good choice for a straightforward, comforting breakfast experience.",
      "time": 1737676482,
      "translated": false
    },
    {
      "author_name": "Danny Ngui",
      "author_url": "https://www.google.com/maps/contrib/113938023253730800625/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVw1YiNDMv-4QsER4SBL5nBlc6OpUVcdVEDJzz3PXcf8akcs7WQAw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "This place serves absolutely fantastic pork congee! The texture is thick and smooth, and the pork is incredibly tender, with each bite bursting with flavor. The ingredients are perfectly balanced, giving the congee a rich, layered taste and a wonderfully comforting mouthfeel that keeps you coming back for more. The service is also excellent—staff are warm and attentive, always quick to meet customers’ needs. The environment is clean and cozy, adding to the pleasant dining experience. This is definitely one of the best pork congees I’ve ever had! Highly recommended to congee lovers—you don’t want to miss it!",
      "time": 1730701941,
      "translated": false
    },
    {
      "author_name": "Jase Guan",
      "author_url": "https://www.google.com/maps/contrib/103226674877606563435/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIhB8RsuzfbMUxhc58V3KWMJDeLxVdA3cczBLiO_EpD50s54Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "When it comes to comfort food, Redhill Pork Porridge surpasses all expectations. From the first spoonful to the last, this dish offers a symphony of flavors that soothes the soul and satisfies the palate.\n\nThe texture of the porridge is impeccable - smooth, creamy, and just thick enough to coat your taste buds with warmth. Each grain of rice is cooked to perfection, providing a comforting base for the medley of ingredients that await within.\n\nSpeaking of ingredients, the pork in this porridge is the star of the show. Tender, succulent, and bursting with flavor, it adds a rich depth to every bite. Combined with the subtle sweetness of the accompanying vegetables and the aromatic touch of fragrant herbs, each mouthful is a journey of taste sensations.\n\nBut what truly sets Redhill Pork Porridge apart is its impeccable balance. Every component, from the seasoning to the garnishes, is meticulously measured to create a harmonious blend of flavors. Whether you're craving something hearty and filling or seeking solace on a chilly evening, this porridge delivers in every aspect.\n\nMoreover, the service at Redhill Pork Porridge is exemplary. The staff members are friendly, attentive, and passionate about ensuring that every customer has a memorable dining experience.\n\nIn conclusion, Redhill Pork Porridge is a culinary gem that deserves every bit of its five-star rating. With its delectable flavors, comforting warmth, and impeccable balance, it's a dish that I wholeheartedly recommend to anyone in search of a taste of culinary perfection.",
      "time": 1709788157,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8408033208084593504",
  "user_ratings_total": 62,
  "vicinity": "29 Bendemeer Road, #01-75 Market & Food Centre"
}