{
  "formatted_address": "Blk 740 Bedok Reservoir Rd, #01-3177, Singapore 470740",
  "geometry": {
    "location": {
      "lat": 1.3383114,
      "lng": 103.922848
    },
    "viewport": {
      "northeast": {
        "lat": 1.339720630291502,
        "lng": 103.9239820302915
      },
      "southwest": {
        "lat": 1.337022669708498,
        "lng": 103.9212840697085
      }
    }
  },
  "name": "Reiwa Soba Honten 令和十割そば本店",
  "place_id": "ChIJL8hdiRo92jERsa5CeFxGAOk",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Susan Tay",
      "author_url": "https://www.google.com/maps/contrib/117439194272049581423/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKRHmDryPMJ95rlSJONtMohbUMdBfXN6ZG70pp438AYIn4aKA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "a week ago",
      "text": "Had to wait a while as there was a queue at about 8pm.  Ordered their cold and hot soba plus a free other tempura seafood, vegetables, fish, etc.  Cold soba was just cooling, not cold.  The hot soba, soup tastes with a bit of yuju taste but I feel it is a bit too bland. Tempura is not that crispy as other tempura I have tried. Overall, just average and not worth the wait",
      "time": 1747036309,
      "translated": false
    },
    {
      "author_name": "Gabriel Joseph",
      "author_url": "https://www.google.com/maps/contrib/116431887901280922637/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI-Ftq_bri84WMKb9oTVYq8tZ_jt685o8IHfNTgO4pz4JhvYM4=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "TLDR: A wonderful find facing Bedok Reservoir, of which you can walk about to digest your amazing meal prepared by a Japanese chef!\n\nFood:\nWe had two Limited items: Raw Seaweed Kake Soba ($12) and added Pickled Mountain Vegetables ($2). Absolutely wonderful as the seaweed was fresh and light, complementing the smooth broth that immersed their wonderful Buckwheat Soba.\nTheir Tempura Soba ($16) felt like a good contrasting combination of fried and soupy goodness. The Lime Soba ($13) did not taste acidic at all. Light lime taste that made the broth like a cool lime juice with soba noodles. Savoury-only lovers would still enjoy this.\nSide dishes we had included the Tasmanian Beef Tataki ($12) which was tender and flavourful, Oysters in Butter and Sake ($13) - probably the best medium-sized oysters you can get in the area - and the Wakasagi Tempura ($7) which was very meaty inside and crispy outside.\nPortions (main and sides) were not too big to allow savouring a larger variety of items for a party of 3.\n\nService: Quick, Prompt, Accurate and Pleasing.\n\nAtmosphere: Simple, Cosy, Quaint*\n\nNegatives: Green tea is not refillable. Outlet is quite small, so deduct ‘Quaint’ if you dine in with a full house.",
      "time": 1736259198,
      "translated": false
    },
    {
      "author_name": "Weijie Aw",
      "author_url": "https://www.google.com/maps/contrib/111453483853385931354/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWv4C6D4bDRUuIrntUENAtzoKt0Ml-Jh5qOnsYSehduosrD9PRCvA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "Nice little Japanese eatery in Bedok reservoir neighborhood. Tried their cold lime soba and it was quite interesting! The broth was savory with a slight hint of sourness from the lime slices which was very refreshing! Great to eat during a warm day! The rest of the dishes we ordered were decent but nothing outstanding. Overall a pleasant dining experience.",
      "time": 1737387064,
      "translated": false
    },
    {
      "author_name": "Clarence Ow",
      "author_url": "https://www.google.com/maps/contrib/112234615480628100933/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX_dX_-LEj7UqCWF1JKZREPhyLFgPJjp7PYAIjqqOhzJhaYPuc=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Although it is located in the quieter HDB estate, it is considered one of the best Soba I had in Singapore.\n\nThe Soba have great accomplishment on both texture and flavour. Hot or cold, it would taste wonderful on its own.\n\nTheir house pour Umeshu are also fastastic. It is especially fragrant and creates enjoyment, and with the addition of the plum, create wonderness in the experience.\n\nTheir dessert is surprisingly good too. Hot and tender, mochi with chocolate within, creates  happiness in every mouth.\n\nOverall, coming back to this shop is a must. Although it is considered costly in the area, i guarantee that it is money well spent.",
      "time": 1736931192,
      "translated": false
    },
    {
      "author_name": "Alvin Li",
      "author_url": "https://www.google.com/maps/contrib/101636040394390892825/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUEJRUarzonItc6LmgTN1Zkf3sq-hVMQTzlPLSrYBY3UcMbYhmJ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Think of this as a blast from the past. (October 2021)\n\nInitially wanted to write for their Clementi branch, so anyway...this is about their Reiwa Pork Soba.\n\nWe like our soba or udon in cold dipping sauce in our tropical climate. Thus, Reiwa's flavourful dipping sauce takes some time to adjust. Their mentsuyu boasts chicken, fish and seaweed dashi spiked with chili oil, served warm!\n\nBefore Reiwa Soba, I had my fill at Shimbashi Soba at Paragon. It is hard to find good freshly made 100% buckwheat soba here and Reiwa Soba filled in this gap. On this visit, I added a side of kakiage for good measure.\n\nWe have not been to their new location (so far!) and thus is unable to try their recent menu, but I'm confident they kept their quality from the numerous reviews here.\n\nLocation of review: 308 Clementi Avenue 4",
      "time": 1737793234,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16789496773805780657",
  "user_ratings_total": 439,
  "vicinity": "Blk 740 Bedok Reservoir Road, #01-3177"
}