{
  "formatted_address": "8 Jln Kubor, #01-05, Singapore 199207",
  "geometry": {
    "location": {
      "lat": 1.3040726,
      "lng": 103.8593733
    },
    "viewport": {
      "northeast": {
        "lat": 1.305395530291502,
        "lng": 103.8606682302915
      },
      "southwest": {
        "lat": 1.302697569708498,
        "lng": 103.8579702697085
      }
    }
  },
  "name": "Rest Bugis Hotel",
  "place_id": "ChIJoaeOJ7cZ2jERDDGfVjr7qcQ",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Siti Fatimah (Siettie)",
      "author_url": "https://www.google.com/maps/contrib/109258443566596570863/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXodvdGNdY8DwPVabj6XrKk_kOTERVwK4kY-6q5Hb-R5YAc0grp=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "Husband and I have been looking for a decent hotel with a window, bath and swimming pool and we found it right at this little corner along Jalan Kubor (with an actual graveyard across the road for added effect).\n\nIt's pretty easy to get to, you can alight at the bus stop along the graveyard and come over. You won't miss the front grey facade. Two entrances. Inside it is warm and welcoming. One lift to serve all customers. There was a restaurant out back but we didn't get to try it out as we were there just for the night.\n\nThe rooms were straightforward according to consequential numbers. We had booked the room with the skylight tub as husband misses his tub from back home in England (we don't have a tub of our own here either), he was ecstatic, couldn't get him out of it. But overall the room was spick and span. Cupboard by the door fits bags and clothes and shoes and has an ironing board (didn't check where the iron is though). Bed is ridiculously comfortable, air-conditioning wasn't a problem and it was blissful as it has been scorching lately outside. Has one bedside power outlet.\n\nNo microwave, but has a kettle, coffee maker, mini fridge, safe, the sorts. TV and Projector works very well - just refer to the instruction manual on the desk. We had a bit of a problem with the Netflix (apparently there were 2 different apps available) and was a bit bummed about having to put up with it so we called reception and the desk personnel personally came up to help us work it out despite having no idea what the problem was either. Her name is Q (not sure about the spelling) but we greatly appreciate how she went the extra mile to connect the dots together and got us signing into Netflix so we could binge on shows for the rest of our stay.\n\nThe rooftop pool was a bit small but just nice for lounging and short little laps. It was nice to have a vantage point above Arab Street/Kampong Glam. Location-wise you get to get anywhere pretty easily on foot - you can go as far as City Hall on even the quayside (if you rather the bus you can hop on #80 in front of the nearest 7-Eleven at the start of the street). Just that it's between 2 stations so getting to the nearest MRT stations - Lavender or Bugis - needs a bit of a walk. Otherwise no complaints.\n\nFresh linen and towels available, and the shower and tub operating systems were so accessible - just buttons down and up, and the temperature was so easy to adjust.\n\nWe enjoyed our stay here a lot. It doesn't look like a lot from the outside, a bit grey the building is but it was really a good and cozy stay once you get inside.",
      "time": 1747318509,
      "translated": false
    },
    {
      "author_name": "Hayashi WY",
      "author_url": "https://www.google.com/maps/contrib/107969082480865791626/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVlIm2N9CO_X5BkiqZqsXoPeoJMzJ0W7HISy0LRPvJEcGetVr5BVQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "2 weeks ago",
      "text": "10 minutes walk to bugis Junction Centre\n2 minutes walk to a main road with a lot of Muslim restaurant .\nHotel room at basement is so nice because No odour or any smells. Room are clean and nice too\nBut, the only things need to improve is\nbath towels need to do new replacement coz it Torn and holey.",
      "time": 1746369743,
      "translated": false
    },
    {
      "author_name": "Ho Soo kit",
      "author_url": "https://www.google.com/maps/contrib/107164542257114146748/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUWm3EbP1Tk8dvDcnGKDZTDKKp_XJjc4SzoMqlgDwGNjJNl4kGy=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "A budget hotel that is within walking distance from the Bugis MRT Station 🚉\nas well as the Lavender MRT Station.\nThe rooms  are  clean and neat.\nIt has all the comforts  for a Budget\nHotels.\nLots of eatery in North Bridge Road.",
      "time": 1744903460,
      "translated": false
    },
    {
      "author_name": "Roy Mathew",
      "author_url": "https://www.google.com/maps/contrib/113490032390279506763/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWVWeWejNMjD_-kw6mRaQLgzkB4pvTdZnVNy5FKrgf88ekGM-TGjg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Simple hotel, nothing fancy but worth every penny ! Located in south Singapore, this is not far from Changi Airport and about same distance from Sentosa Island (about 20 minutes by car). The Singapore Flyer and Chinatown are also very close by (about 6 minutes away by car). Rooms are clean. Loved the beds and the pillows. Great air conditioning, WiFi and clean, bright bathrooms. Will come back here!",
      "time": 1741133692,
      "translated": false
    },
    {
      "author_name": "a h.",
      "author_url": "https://www.google.com/maps/contrib/107180295860049088157/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL3Q2GsUoGzUlrDqIcWKecrYZz4aqgdfRRA747zySTQLsjeDSk=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "5 months ago",
      "text": "The location is far from the train, but the bus stop is close and you can walk to Bugis.\nThe rooms are in the basement, with no windows and thin walls.\nYou can hear everything: guests coming home at night, people talking in the hallway, doors opening, conversations in the room, the sound of the hair dryer, etc.\nIt is a very hard environment for those who want to sleep quietly.\nAlso, a plastic comb that I had used for about four years, which had been propped up in a cup with my toothbrush, was thrown away when I cleaned the room.\nIt was tattered and cheap, but I had used it for a long time, and I knew it was wrong to throw away a guest's personal belongings without permission. I was very shocked...\nThe staff was nice, friendly and helpful.",
      "time": 1732257650,
      "translated": false
    }
  ],
  "types": [
    "travel_agency",
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14171133930477924620",
  "user_ratings_total": 982,
  "vicinity": "8 Jalan Kubor, #01-05"
}