{
  "formatted_address": "302 Orchard Rd, #17-01 Tong Building, Singapore 238862",
  "geometry": {
    "location": {
      "lat": 1.3039854,
      "lng": 103.8348069
    },
    "viewport": {
      "northeast": {
        "lat": 1.305278330291502,
        "lng": 103.8360931302915
      },
      "southwest": {
        "lat": 1.302580369708498,
        "lng": 103.8333951697085
      }
    }
  },
  "name": "Rexults Clinic",
  "place_id": "ChIJcWkZOZIZ2jERyXpKLMywGsw",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Shine -",
      "author_url": "https://www.google.com/maps/contrib/105816137278950072277/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJlCoomoPtbhhKCn8G4dqF53PfSaHk1XqxuGFESqvU6GzLcIQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I recently underwent lip filler procedure with Dr Gan and am very pleased with its ourcome. She skillfully addressed its asymmetry and filled the lips beautifully ! I like how it had enhanced the fullness and definition of my lips, while maintaining a natural look. Also truly appreciate how during consultation, Dr Gan took time to understand my aesthetic goals before giving her professional advice. Hence, i also got other fillers to enhance the overall shape of the face. :)\n\nThe clinic is serene, and has emphasis on hygiene protocols to ensure a sterile environment for all procedures. The whole process was very meticulous.  Also appreciate the clinic assistant Trissy for being attentive and easing me in the entire process ! :) it's been a really positive experience.",
      "time": 1731254138,
      "translated": false
    },
    {
      "author_name": "Vita Bong",
      "author_url": "https://www.google.com/maps/contrib/102683698412922478144/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJWGbCKShwA37yYvNGID5rDv30hu1WXxAN1t4VF6CArWxYELA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "Always a great experience whenever i went there for consultation or treatment.\nDr Wong and the staffs are very friendly and attentive, and would always explain the products and procedures in a very detailed manner. The treatment results are also very effective and my condition has massively improved from my first visit.\nOverall, would definitely recommend more people to this place.",
      "time": 1717235741,
      "translated": false
    },
    {
      "author_name": "Rebecca Lim",
      "author_url": "https://www.google.com/maps/contrib/112770320357715675560/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIaVGhJLBIVmKynSlaq1zJ9be8hxL5mHrBqQKEknSJyDVlnbw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "12 months ago",
      "text": "Very attentive and friendly staff. Dr Wong is very comprehensive and patient in explaining my skin problem, while also maintaining clear expectation of the course of treatment. Would strongly recommend coming here for any of ur skin concerns!",
      "time": 1716526462,
      "translated": false
    },
    {
      "author_name": "Fiona Vidra",
      "author_url": "https://www.google.com/maps/contrib/113824732408600909169/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXydY9FXEPXy8g9M4H82D5T-NZg9VZ5V8bH7A1N4eI_U-xF04vv=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "Ive done radio surgery + AHA peel with dr Wong. Dr Wong explain patiently what I really need, treatment phase and recommend products which will improve my skin. Overall I am really satisfied. Not going to lie his councellor Ms Liza is really helpful to me getting through this. Hopefully to see the treatment result soonest!",
      "time": 1717845513,
      "translated": false
    },
    {
      "author_name": "Revi",
      "author_url": "https://www.google.com/maps/contrib/112399434771251619161/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLS9_mJpIn1oib-dID4TUcThmTVcDePwDAT1GTDliPcRkKTdw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My experience at Rexults was fantastic.\n\nThe clinic is located on the top floor of the Tong building next to Paragon mall. Upon arrival, the spacious waiting area caught my attention. It's not just big; it's welcoming and feels more like a luxury lounge than a clinic waiting room. The staff there were incredible - cordial, super friendly and go above and beyond to make the patients feel at home, including answering any queries prior to meeting the Doctor.\n\nBut the main highlight of Rexults is - Dr. Gan Lee Ping. I've been to a fair share of aesthetic clinics, but Dr. Gan easily stands out from the rest.\n\nDr Gan has an almost scholarly & methodic approach to Aesthetics, which is clear from the moment you start your consultation with her.\n\nUnlike other aesthetic clinics' consultation, Dr Gan does not just give you a quick once-over & mere superficial glances; Instead she takes her time discussing what she sees as the issues and what can be improved, using sketches and photos to document as focal points of the consultation and discussing openly with the patient.\nIt's a level of detail I haven't seen with other doctors, and it really shows how serious she considers aesthetics, as a discipline - wherein it is as much of an art as science.\n\nDuring the procedure itself, Dr. Gan, along with her nurse, made sure to keep me informed about what to expect, including any potential discomfort or risks. It was comforting to know each step of the process, and it really helped in easing any nerves I had.\n\nIn short, the visit to Rexults was beyond my expectations. The combination of a luxurious setting, exceptional staff, and Dr. Gan's unparalleled approach to patient care and aesthetics makes it a place I'd highly recommend to anyone considering any aesthetic treatments.",
      "time": 1707361238,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14707261924094671561",
  "user_ratings_total": 102,
  "vicinity": "302 Orchard Road, #17-01 Tong Building, Singapore"
}