{
  "formatted_address": "2 River Valley Green, Singapore 237993",
  "geometry": {
    "location": {
      "lat": 1.2938838,
      "lng": 103.8363894
    },
    "viewport": {
      "northeast": {
        "lat": 1.295038780291502,
        "lng": 103.8377873802915
      },
      "southwest": {
        "lat": 1.292340819708498,
        "lng": 103.8350894197085
      }
    }
  },
  "name": "River Valley Primary School",
  "place_id": "ChIJN0U4f5sZ2jERvMJyLZdur2s",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "That oneguy",
      "author_url": "https://www.google.com/maps/contrib/100327172399005681150/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX-FcOkISz16-uAd1UKv72Dxj-cPbcOncpzRnMejsi61q0scaO0=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "As a student, this school is great.\nNo air-conditioning next year as is for the construction site next to the school will finish since 2022 February.\nThe studying environment is close to perfect, and many friends talk and engage.\nThere's many progammes that take place in the school hall as they celebrate almost every event/holiday, and you'll receive custom-made school supplies, and the teachers are actively engaging with their students which makes it more interactive and entertaining besides a few. The school bus, though, is quite inconvenient in my opinion as you have to wake up early and school starts at 7:30. The canteen sells a variety of food ranging from Chinese noodles to Western burgers to Muslim, pork-free delights. The school also includes a garden and a fish pond to explore during recess and the perfect ratio of play to study time. The syllabus is above average than some schools, and the homework, although much, is informational and educative. On the contrary, you need to be smart in kindergarten and be fast to sign up for this school. This school has many subjects, English, Chinese, math, science, music, art, and teacher guidance period. This school also has a discipline master and a school counsellor, which is similar to a therapist. I look further into more pupils to enter this school.",
      "time": 1719584763,
      "translated": false
    },
    {
      "author_name": "Chloe Ang",
      "author_url": "https://www.google.com/maps/contrib/101759430871874781717/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKoyI7p1i4GnXFYgaI0AttiXapOJdU1o6B0hKpnMll4CHtH0g=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Honestly, the teachers who seem strict on the outside are actually really very super nice and patient when teaching you (unless you make trouble) they even make jokes and the only reason why they give us a ton of hw is because they care abt our studies. The canteen food is really nice, just that it's abit overpriced. I would give a 4.5 but Google dont let me so I put it as 4 stars 😋 the toilets are really clean in my opinion, idk about the boys' toilets, but it's just the level 1 girls' toilet the last cubicle is always overflowing and the second last cubicle can't be locked since the lock is broken so bring a friend when u need to go to the toilet during recess🙂 the students are also very skibidi, some might be a bit over-egoistic, but overall the students are very nice. 👍(sorry about the previous review, I wasn't in the right state of mind 🙂👍)",
      "time": 1738574803,
      "translated": false
    },
    {
      "author_name": "Green",
      "author_url": "https://www.google.com/maps/contrib/115558737356567175870/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIXMmT0QIFUJjpfI6pdJr2x2ZGr0IpPurpP--8DZZ9sbO-Lew=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "This school is ridiculous ever since the new principal and new head of student management arrived and don't get me started on the discipline master. The discipline master is so rough and when a student does something wrong and he sees it, he comes up to the student shouting as loud as he possibly can and on some occasions he grips the student so tightly on his arms and shakes him. During lessons, he tells many stories and only teaches 10% of the lesson, stories = 90% teaching =10% and when he sees the lesson is almost up, he blames the students for wasting his time. I could've done better for my psle science, but because he tells stories in class, I can't do any learning. Even days before psle, he is still telling students life stories. If you get him as your teacher your cooked... Sometimes when he's angry he just slams the worksheets on your table and when giving back tests papers he purposely shakes his head as if he's looking down on us. 5 minutes before recess ends, he makes everyone assemble at the games hall, students that played during recess can't even catch a breath and get a drink before assembling in the games hall and if a student is late, he publicly shames his in front of the whole co hort. Like he doesnt have to do this, just talk to him privately and you don't have to publicly embarrass him. If in the morning you are caught talking to your friend or not reading, he will make you stand up on the spot and make you read while standing. The school always threatens the students with not being allowed to play during recess or cutting their recess length. One time after our psle ended, some of our classmates brought a chess board to play during recess, they were playing in the canteen and when the discipline master found out, he went mad, he started publicly shouting at us for playing chess during recess, chess is an educational it works your brain and helps develop problem solving skills, why take that away from the children? And its after psle, we should get a break to play a game we love. Also another time when another class went to the nearby McDonald's and someone complained to the school, the teachers immediately assumed it was our class, teachers are so quick to point fingers at us, and when they found out it wasn't us, they PRAISED THE OTHER CLASS, because they actually studied and so they were allowed to cause they studied well???? And during some discipline cases of bullying, the teachers don't even find out the full story and immediately punish the students. Some teachers actually care for the students well being and are actually good teachers, but others are acting like they are forced to be there, like if you hate kids, then dont become to be a teacher",
      "time": 1733561470,
      "translated": false
    },
    {
      "author_name": "Jon Harry Kyle Smith (Peicaiss)",
      "author_url": "https://www.google.com/maps/contrib/103044785061794709555/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJpuYYru-pP0qFX-yaylyp18AQ_cuSpFwy7z4T3Cr2aIa68tw=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "3 months ago",
      "text": "Graduated from 2024, I'll say that before the new principal came to RVPS, i find that I actually enjoyed my time there. However, when the new principal arrived, it felt like everything changed. For example, recess is 30min. But, we have to ASSEMBLE in TWO STRAIGHT ROWS at the games hall EXACTLY 5 MINUTES BEFORE RECESS ENDS. So let's say that recess starts at 10am, you have to assemble in TWO STRAIGHT ROWS at EXACTLY 10.25AM SHARP. If you're late, you get scolded in FRONT OF THE ENTIRE SCHOOL like what? Oh and in the morning when you assemble (yes i have used this word a lot ik) at the school hall, you're EXPECTED to KEEP QUIET like SUPER quiet and read a book. If a teacher catches you talking, they may or may not give you a chance. However, if they do not give you a chance, they'll ask you to STAND UP in front of the whole school and read. I find it ridiculous. Previous principal was WAYYYYYY better.",
      "time": 1739618652,
      "translated": false
    },
    {
      "author_name": "Dylan Tan Hong Xu (Bmss)",
      "author_url": "https://www.google.com/maps/contrib/102976899855318187952/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLSdeow7y0DBTSvuMKgYhGCRBO_si3qu6ByW0aMaaIPaDPrcA=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "3 months ago",
      "text": "As a student, I’m glad that our classrooms has air conditioning, but the canteen food is not nearly as good as people say. For 2 SGD, you can get a tiny plate of chicken rice that you can finish in 3 bites, and the other foods are all very expensive. I am sometimes hesitant to go to school as during recess we have to assemble 5 minutes before recess ends and the teachers always turn the fans off to make us be quiet. The discipline master and mistress always bans us from playing during our recess because the kids eating in the canteen are always late to assemble.\n\nEdit: Now it is apparently the schools 40th anniversary and I have actually graduated. One day my sister came home and she said that there isn’t going to be WA1 to “Celebrate the school’s 40th anniversary”. If this IS true, it is obviously very dumb. I can’t imagine how the principal walked into the discussion room and was probably like “To celebrate our school’s 40th anniversary, lets hinder our children’s learning!” And people ACTUALLY AGREE TO THAT. Also, I forgot to mention this case in 2023. One particularly mischievous student purposely hid her wallet under the bag of the class chairperson (Who was very well respected). She was “panicking” about her “lost” wallet and we had to search for her. Eventually, we found it under the class chairperson’s bag, but nobody in our class believed that the class chairperson took it, not even the teacher. The only person who believed it was the discipline mistress, who after having a talk with the mischievous student, gave us a life-long speech about being RACIST to our classmate (because the mischievous girl was malay), even though we had 2 other malay students in the class and demanded that we owed the student and apology. I feel this is very terrible of the discipline mistress and she really has to learn the full story. Should definitely watch out for her.",
      "time": 1738582962,
      "translated": false
    }
  ],
  "types": [
    "primary_school",
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7759542278564266684",
  "user_ratings_total": 68,
  "vicinity": "2 River Valley Green"
}