{
  "formatted_address": "6 Loyang Besar Cl, Singapore 509026",
  "geometry": {
    "location": {
      "lat": 1.378617,
      "lng": 103.957872
    },
    "viewport": {
      "northeast": {
        "lat": 1.379661130291502,
        "lng": 103.9592956802915
      },
      "southwest": {
        "lat": 1.376963169708498,
        "lng": 103.9565977197085
      }
    }
  },
  "name": "Riverlife Kindergarten",
  "place_id": "ChIJNRykZLQ92jERPfAhH1UMieg",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Fiona Ng",
      "author_url": "https://www.google.com/maps/contrib/113684754801408594165/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUPG0PQRlcIWXk19_ekzAyCuakHWq5SKL3h8mCxK1G8_irLnoE=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "My 3 girls went to 3 different kindergarten and my favourite was Riverlife Kindergarten! I feel it's not as academic as the other 2 Kindergarten my elder girls attended but I still liked it best. The environment at Riverlife is very pleasant and the teachers are great too. Principle Mrs Tan is extremely loving and caring to all the students and interacts alot with parents too. I would say Riverlife Kindergarten is highly recommended! ❤️❤️❤️",
      "time": 1731508738,
      "translated": false
    },
    {
      "author_name": "Ann Malim",
      "author_url": "https://www.google.com/maps/contrib/111886871855428329320/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIoMobhEPTQwrJLCKV6QCSg--dlK8XTlPlyxBrZVorQCObjKA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Both my kids had been with riverlife kindergardten from Pre-nursery to K2.The curriculum is thoughtfully designed, incorporating biblical teachings alongside core academic subjects. They added STEAM class for K2 which my kids love.Our children has grown in faith, confidence and knowledge while being surrounded by a passionate teachers under the supervision of Mrs Tan (Principal). We highly recommend Riverlife kindergarten to any family looking for a place where their child can thrive\nacademically and spiritually. It’s more than just a school; it’s a place where children are molded into responsible, faith-filled individuals who are prepared for the future. Thank you to all the wonderful teachers of Riverlife. God bless you all",
      "time": 1727866682,
      "translated": false
    },
    {
      "author_name": "Christopher Susie",
      "author_url": "https://www.google.com/maps/contrib/105729732913487671261/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL6U3pHFOTDdBrjdXjTg_eES02wLH5MBbg67IJLLf9NAKYGQA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Riverlife has been an amazing experience for my daughter....\n\nAs Principle Tan and I discussed many times; my daughter was a \"busy bee\" and usually only listened to daddy (when we did the first interview) and Ms Tan voice to me later that she was a bit worrried.\n\nAt the end.... Samantha GREW SO MUCH with Riverlife and she did amazing in school learning, socializing and experimenting with new things.\n\nTeacher Belinda is also amazing and she guided my daughter thru a few rough patches and also helped her tremendously to grow and try new things (specifically she got her to try the school lunches and eat something different daily).\n\nI cannot say enough great things about Riverlife and how they helped my daughter grow into a great little student.\n\nEven when she started P1, Riverlife staff reached out to see how see did the first couple days....... You don't see that support from other places.\n\nAgain.... THANK YOU Riverlife for everything you had done and we look forward to our next little one growing with you in about 4 more years :-).",
      "time": 1736648951,
      "translated": false
    },
    {
      "author_name": "Serene Lee",
      "author_url": "https://www.google.com/maps/contrib/102810848399342404977/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIE4Yn89deRDf1cOp3EN1l4VdoXVLxhVsKJ9udpjIYE9EYf3g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "My children enjoys attending Riverlife Kindergarten. As parents, we feel that there is a good balance of play and academic learning.\nMost importantly, the principal is very involved and teachers work closely together with parents.",
      "time": 1730350370,
      "translated": false
    },
    {
      "author_name": "Shron Sugumaran",
      "author_url": "https://www.google.com/maps/contrib/110177721861474457062/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKomX9ql80ghLnCCAr-MFovyQUnFJaHlTCCU5T5fIL3vF1CTvI=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "As an Early Childhood professional, I had the privilege of visiting Riverlife Kindergarten for a project partnership, and I was instantly won over by the sense of peace I got from just the atmosphere. Children there were genuinely happy and engaged, educators knew their children well, and it almost had a Kampung spirit. The learning spaces are lovely, in particular their outdoor learning centres, cycle path area, playground, and their homegrown garden. The leaders and educators clearly have the children at the heart of all they do, and this is seen in their interactions with one another. They might seem like a simple faith-based kindergarten but by the end of the visit, I could see how much heart they put into their work. Kudos to the team!",
      "time": 1730160580,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16755937448342712381",
  "user_ratings_total": 34,
  "vicinity": "6 Loyang Besar Close, Singapore"
}