{
  "formatted_address": "1 Fullerton Rd, #02-06 One Fullerton, Singapore 049213",
  "geometry": {
    "location": {
      "lat": 1.286057,
      "lng": 103.854132
    },
    "viewport": {
      "northeast": {
        "lat": 1.287502380291502,
        "lng": 103.8553412302915
      },
      "southwest": {
        "lat": 1.284804419708498,
        "lng": 103.8526432697085
      }
    }
  },
  "name": "Riviera",
  "place_id": "ChIJsSmt3wgZ2jERhaS3KqmJDWU",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Fab Foodie Swede Malin Nordblom",
      "author_url": "https://www.google.com/maps/contrib/107062657007062713328/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUiibmrdYZC_0njkI_zLGd1hHVC_tIM-stmd1f4F6C2ByhrAra9=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "I had an excellent very long lunch here. A big plus for the stunning view over Marina Bay waterfront. They have a very talented chef and team, this is a place I definitely wanna come back too!\nEven the bread serving was great!\nWell balanced dishes, and beautiful played.",
      "time": 1744720500,
      "translated": false
    },
    {
      "author_name": "C T",
      "author_url": "https://www.google.com/maps/contrib/113390811001221493323/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLMu6SSOU4bkDyyu2eWos8LfSF5j-PQ4Uvkr9w8moMbeo2WbQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I recently hosted an event for 75 guests at this restaurant. The service and five-course dinner were outstanding, and we received excellent feedback from our attendees.\n\nThe event team was highly professional, well-trained, and coordinated every detail seamlessly. A special thanks to Arjun and the team for managing the event so well and accommodating my requests, including last-minute additions.\n\nThe venue itself is breathtaking, especially at night with its stunning views.\n\nThe only issues were with the tent cards—I had requested double-sided printing, but they were only printed on one side, and some of the cuts were misaligned. Additionally, the restroom is located downstairs, requiring guests to use the staircase, which was less convenient for those in high heels.",
      "time": 1731476891,
      "translated": false
    },
    {
      "author_name": "Cathryn Choy",
      "author_url": "https://www.google.com/maps/contrib/115349829321232168727/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKO17kPJ0C4WUpPUuCgpUkbEsqzFt9RS61GhO6nYlExxsExKy0_=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Has booked a private room for my corporate event and enjoyed the friendly services from all the staff, great food and the ambience of the entire place. Highly recommended for corporate events or just meal with great food & nice view.",
      "time": 1744409615,
      "translated": false
    },
    {
      "author_name": "Pat Yap",
      "author_url": "https://www.google.com/maps/contrib/103944108590422894108/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVraz6xxaPFkF1DW0ZVdJiFQPOnxdRAXH5G32Y9jGzMT4tn-8I=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Went for lunch with 2 acquaintances at Riviera Restaurant and coincidentally on a St. Valentine’s Day.  Because of this special day, they serve only the 4 Course Valentine’s Day set lunch menu.  The lunch came with artisanal bread with whipped butter.  The 1st course was the Hamachi Carpaccio - cured yellowtail fish loin with Kaluga Queen Caviar drizzled in yuzu ponzu, pickles and pistachio.  Quite refreshing and taste good.  Next, the Hokkaido Scallop served in sweet corn and crème de persil and crispy chicken skin served in a stick.  The sweet corn and crème go very well with the scallops! You could also dip the paper-like chicken skin into the crème!  I love this dish because it’s so refreshing and I kept asking myself whether this is real chicken skin or not.  The 3rd course was the Australian Grass Fed Wagyu Beef with pomme puree and mustard sauce.  Unfortunately they didn’t ask me about the doneness I wanted for the beef.  Luckily it was not tough and was done appropriately.  It’s quite good actually.  Finally, the dessert was Ice Cream and Sakura Tea Cake with vanilla mascarpone cheese, strawberry on white chocolate piece.  It came in the form of a beautiful rose ice cream.  Overall, the lunch menu was very good and the restaurant has a beautiful view of the Marina Bay.  No wonder there were so many Valentines couple lunching there!  It’s worth a visit as the food is also quite good.  $$$",
      "time": 1739619186,
      "translated": false
    },
    {
      "author_name": "Angela Chen",
      "author_url": "https://www.google.com/maps/contrib/110445049310349210653/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVLN40CcCuyvqixJtcV9vaLcIp5ClEHURBLhAm0qk5Vheeq--M=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "10 months ago",
      "text": "I had the pleasure of trying out this restaurant without a reservation on a Saturday evening and I was amazed by its location and stunning views. If you happen to visit on a Saturday during the National Day celebrations, you can even enjoy the fireworks display from here.\n\nThe menu offers a fusion of Western cuisine with a modern twist. My husband and I ordered the Tamahawk steak, and it was truly a generous portion meant for three to four people. For children, they have a kids' menu which includes a soup, pasta, and ice cream - all of which tasted great.\n\nOverall, I highly recommend this restaurant for its incredible views, excellent service, and delicious food. It is definitely worth a visit!",
      "time": 1719896854,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7281627532187116677",
  "user_ratings_total": 410,
  "vicinity": "1 Fullerton Road, #02-06 One Fullerton"
}