{
  "formatted_address": "15 Merbau Rd, Singapore 239032",
  "geometry": {
    "location": {
      "lat": 1.2912564,
      "lng": 103.8420506
    },
    "viewport": {
      "northeast": {
        "lat": 1.292640080291502,
        "lng": 103.8433130302915
      },
      "southwest": {
        "lat": 1.289942119708498,
        "lng": 103.8406150697085
      }
    }
  },
  "name": "Robertson Quay Hotel",
  "place_id": "ChIJiYGgrJ8Z2jERgiIOxtAZAOg",
  "rating": 3.5,
  "reviews": [
    {
      "author_name": "Sajid M Abdulla",
      "author_url": "https://www.google.com/maps/contrib/118312696610337288742/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUuHMWBlfyJM-IPcXQaYNdPIMWq8n3ovRmS8q62oUJQSXvfWtmQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "Rooms are small and average. But for small business trip, its ok. the location is great.\nCalm and quiet area. Near to all main areas. Easy access to MRT. Service is great from the reception and even the cleaning lady.\nOnly the drawback is they won't allow for late check-out without any pay, even for a half an hour.\nNeat swimming pool.",
      "time": 1745047666,
      "translated": false
    },
    {
      "author_name": "Sebastian",
      "author_url": "https://www.google.com/maps/contrib/102385464437319469975/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLN65doDptR30L_1X8uf-WxKvEOEBsF9qqlhW3nLhIlCpyAWw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "in the last week",
      "text": "Really bad quality. Don’t go there. Tiny rooms. Worn down hotel. When you turn off the AC, the ceiling starts to leak. Prepare yourself for a cold and humid/wet room.\n\nTerrible…\n\nWe left after two nights although we had (pre)paid for three nights.",
      "time": 1747476913,
      "translated": false
    },
    {
      "author_name": "Kirsten Eriksson",
      "author_url": "https://www.google.com/maps/contrib/110451920961384297516/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ37Hk0zqXs05hHhguDsS6LNpRFw-PEDXAmcO7nzXuEjNvGng=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "The worst hotel we have EVER stayed in.\n\nWe booked this hotel Dec 5th, 2024. Didn't hear anything from them until 5 months later, when they emailed asking us to upgrade rooms because the baby cot wouldn't fit in the one we had selected. We had booked through hotels.com and had selected a room that had the free baby cot as an option in it. We didn't receive the email as we were travelling (it was 2 days before we got there) so when we turned up after a 12h flight they insisted on charging a room upgrade fee as well as a cot surcharge. I showed them on hotels.com that they had this room advertised with a cot and that the cot was free. They went back and forth with me for 2 hours- using lots of excuses \"on our website it says.......\" (irrelevant- we booked through hotels.com), \"we've asked hotels.com to take that down ages ago\" (not the customer's problem) \"a cot is not the same as a crib\" (this one I didn't undertake??!!) After 2 hours I asked for a refund for the booking if they were not able to provide the service they had advertised. They refused.\n\nThey ended up charging us $90sgd for the room upgrade (even though it was  less than $20sgd difference on hotels.com) and gave us early check in for a reduced rate. We reluctantly paid, not wanting to lose hundreds of dollars.\n\nHere is the real kicker. When we got to our \"upgraded\" room they brought up the cot and it did not fit. It blocked the path to the exit, which is obviously so dangerous and a fire risk. The chair that was in the room also had to be moved into the bathroom. We immediately moved the cot into the hallway and told them it did not fit and they did nothing.\n\nThis hotel cares more about money than safety. I am shocked that they didn't think twice about putting our lives in danger (including my one year old son!!) Do not stay here. Despite this, the deluxe room was also horrendous.",
      "time": 1746837792,
      "translated": false
    },
    {
      "author_name": "Filippa Engström",
      "author_url": "https://www.google.com/maps/contrib/101419283470349856121/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVd8QTerlUJKQ2BOVL7x6jP04IUbj26M2ppxvESspLmkaQtHz8=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "I stayed here for 2 nights. Unfortunately, the experience did not quite meet expectations.\n\nUpon arrival, we were informed that there was an issue with their Agoda bookings, and we were asked to cancel our original reservation and pay again directly at the property. It’s now been over a week and I still haven’t received the refund. I’ve since learned the process can take up to 30 days, which is both inconvenient and disappointing — especially considering this was not an issue caused by us. The situation felt poorly handled and quite unprofessional.\n\nThe room itself was basic. The bed was extremely hard, making it quite uncomfortable to sleep, and there were no amenities provided in the room. Additionally, the walls were thin, and I could clearly hear the TV from the neighboring room, which didn’t help with getting a good night’s rest.\n\nOn a positive note, the location was convenient — close to the subway, the river for walks, and only a short 2-minute walk to a nearby mall with some nice coffee shops.",
      "time": 1744867784,
      "translated": false
    },
    {
      "author_name": "Kel Win Low",
      "author_url": "https://www.google.com/maps/contrib/101794738917669307453/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLGDXJZTUJGU15LoYMONXtJFKZ3qRtp2S4HZ8L2JeHPoeutPw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "The worst experience I had throughout my hotel stays in my entire life. Giving excuses and lies, been waiting for refund since February and now is April. Called bank 3 times, emailed booking platform and had teleconversation, emailsss with the hotel directly, still they said they dont know how to refund my payment. We had friend in Singapore went to the hotel asked for an answer, still nothing\n\nCancellation done and refund was never processed, we were forced to pay again when we arrive or no room to stay. I would advise to stay away from this hotel ! Spend your dime somewhere else, I wish for a ZERO star to rate",
      "time": 1743438085,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16717390201265988226",
  "user_ratings_total": 2541,
  "vicinity": "15 Merbau Road"
}