{
  "formatted_address": "7030 Ang Mo Kio Ave 5, #01-30 Northstar @ Amk, Singapore 569880",
  "geometry": {
    "location": {
      "lat": 1.3785214,
      "lng": 103.8759279
    },
    "viewport": {
      "northeast": {
        "lat": 1.379943680291502,
        "lng": 103.8772529802915
      },
      "southwest": {
        "lat": 1.377245719708498,
        "lng": 103.8745550197085
      }
    }
  },
  "name": "Rongji Seafood",
  "place_id": "ChIJudRkb1wW2jERbRCmd8LIFy4",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Alex Lim",
      "author_url": "https://www.google.com/maps/contrib/100178762770675228701/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVFuJN7p3se90U9Q6tJYp4Jqzk7SwCJlANuLkvgM7ReMux5O08FOw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "3 weeks ago",
      "text": "Sliced ginger can be found iterally in almost every dishes.\n\nArrival at around 5.30pm on a Sunday and it's already almost filled and 3/4 of the seats are reserved. Make sure you arrive early or have a reservation made especially for a bigger group. We were 4 pax to dine in.\n\nGroupa fish bee hoon in claypot - Strong flavourful pot of awesomeness. A lot of Chinese cooking wine is used and no lack of dried sole fish. It's a thick sticky milky soup. However, you will start to wonder where is the fish flavor. Overpowered by everything. Tad too much msg too\n\nClaypot fish maw and sea cucumber - Decent dish but nothing stood out. Good flavours though. The quantity increased with loads of in use of onions and sliced ginger\n\nKai Lan stir fried with 4 big prawns - The highlight of the dish is the 4 big prawns that are fresh.",
      "time": 1745763818,
      "translated": false
    },
    {
      "author_name": "Dayne Poon",
      "author_url": "https://www.google.com/maps/contrib/100728211576879585900/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI_uS6mdR_sytZJHYRCGlfkw5PK83TwOwrngmp4bUF5l7WP8zI=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "The food is not bad. I love their crab bee Hoon. Highly recommend to prebook it. Do make table reservations as it does get crowded during dinner time. Went on a Saturday about 6pm and the crowd still ok. But after 7pm is crowded.",
      "time": 1736920383,
      "translated": false
    },
    {
      "author_name": "Jayt Su",
      "author_url": "https://www.google.com/maps/contrib/108498247125077694100/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU-7kV7JkUrOrZyC9Mxg1LUoHoQqJ7DlViZ4oB_popPrxBBQIVq=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "Deeply disappointed.  If I can choose zero star I would give.\n\nCame at 8pm. All crabs and clay pot fish sold out. Ordered hor fan, Mongolian pork, yam ring and fish maw soup.\n\nNever had such lousy hor fan before. Literally chunks of kway teow stuck together and just put the liquid over. Tasted terrible. (See pics)\n\nMongolian pork was a disappointment too. No wok hei and just very normal. Yam ring was ok but very thin later of yam so not worth the $20. Fish maw soup not hot enough and turns cold very fast. Nothing special.\n\nNeed to order food at counter and pay first before food is served so no service as per say.\n\nFood delivered to us. The server didn't even want to give us chilli and said all chilli no more so left green chillies.\n\nMy children all said the food is not nice.\n\nWon't be back again and don't recommend anyone to eat there.",
      "time": 1737293279,
      "translated": false
    },
    {
      "author_name": "Bian Lee",
      "author_url": "https://www.google.com/maps/contrib/106963842817729813226/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXaoHeIPwcREH6QLh3OUzbIq0c9anMMcbK9qk_-4go1aoQg4GJKyw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "5 months ago",
      "text": "We were there early to ensure we had a table for dinner. By 6.30pm the entire coffeeshop was almost passed with their customers. The coffeeshop is clean and airy with quite of good variety of food.\n\nThe star of our dinner is the gigantic chilli crab. It’s juicy and meaty, served generous portion of spicy bean sauce. The sauce was a little salty to me. But I was totally won over by the meaty crab which cost a whopping $115 for one. We also like the sweet potato leaves and crispy anchovies. The latter added a new dimension to the dish. Must say the dishes are pretty huge portion. Food was so good\nAnd service is prompt, that explains why this place is so popular",
      "time": 1732361915,
      "translated": false
    },
    {
      "author_name": "Jeremy Khoo",
      "author_url": "https://www.google.com/maps/contrib/101975552015179312270/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVfnnxOpjXUlSmoDu1Iaj6w1RxG2W1EmHsEr-3z8O3-mjTLH2nGkA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "We used to eat at Rongji regularly when it was at the old Seletar Hills market so wanted to check if it was still as good. Happy to report that the quality of the food is still excellent and service is much faster than in the past. All the dishes were excellent especially the egg fu yong, fish head curry, French bean with dried shrimp and the prawn paste chicken wing.  So glad that the previous chef has passed down his skills to the next generation.",
      "time": 1729781184,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3321343987765612653",
  "user_ratings_total": 604,
  "vicinity": "7030 Ang Mo Kio Avenue 5, #01-30 Northstar @ Amk, Singapore"
}