{
  "formatted_address": "86 E Coast Rd, Singapore 428788",
  "geometry": {
    "location": {
      "lat": 1.3050948,
      "lng": 103.9042942
    },
    "viewport": {
      "northeast": {
        "lat": 1.306580330291502,
        "lng": 103.9055561302915
      },
      "southwest": {
        "lat": 1.303882369708498,
        "lng": 103.9028581697085
      }
    }
  },
  "name": "Rooftop 88",
  "place_id": "ChIJCcdUARAZ2jER4dfhk6WG_Sg",
  "rating": 3.9,
  "reviews": [
    {
      "author_name": "Robin K",
      "author_url": "https://www.google.com/maps/contrib/104864140680494166371/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUTfgGbeW2fK-agqoI0-dUiyXmkZdj-fQcz7P7HWnMcI5YkThnv=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We came here on a whim since we were in the neighborhood and since it was beautifully sunny. Rooftop 88 is a gem in Katong with good HH wines and beers, a  real resort-style rooftop pool and garden area, relaxed vibes, and - what really stands out - an amazing barman by the name of Anthony! He is single-handedly looking after all the guests with such genuine joy and care and professionalism and makes everyone feel 'at home'. Upon chatting with him during the ensuing rainstorm, he was so talkative and humorous and gave tips on where to dine in Langkawi for our next trip. A big shout-out to Anthony. He is here for an internship but comes across as a real host and owner of his work. Well done 😎👍🏻👍🏻👍🏻. I hope his management reads this and recognises him accordingly : ) .",
      "time": 1743851340,
      "translated": false
    },
    {
      "author_name": "Gasper Chan",
      "author_url": "https://www.google.com/maps/contrib/116187504655013802323/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIH3t5BKwK0eU_DN_p7N9UG6oaozj2lMlJAdbb2sT7-pLG1OZI=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Very nice rooftop dining space!\n\nTo note: the restaurant doesn’t actually serve their own food, food is ordered and sent up from their sister restaurant (BaBa Chews). This is a casual dining spot situated next to the swimming pool at Hotel Indigo. To get to this place, the hotel concierge needs to help you access the hotel lift.\n\nFood is decent but I would come back for the atmosphere, with great views over the Katong landed enclave. With unblocked views, it is also very breezy.\n\nWould recommend for the ambience though it might be better to directly go to baba chews for the food and come here for their cocktails.",
      "time": 1740376726,
      "translated": false
    },
    {
      "author_name": "Gabriel Quek",
      "author_url": "https://www.google.com/maps/contrib/111029600621744254559/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJFFkU-BI_cwKoLTf9K_aBG0dUQ0nyIQS7ZRiOKgAgIjerRjQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "8 months ago",
      "text": "Decent food with a great view. Seating here is quite limited, there are maybe a total of 5 dining tables, and maybe 7 or 8 small high tables for drinks.\n\nFish & chips was very good, but we found a bone in it.. so be careful. Cheese steak sandwich was mediocre, best give it a miss.",
      "time": 1724611521,
      "translated": false
    },
    {
      "author_name": "Joe Yap",
      "author_url": "https://www.google.com/maps/contrib/111833439200984936772/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWpGJ8XkmIr8DVpq3B-gw_70Rt1oV8QUFnHrQ1VnNYgpuBC8eTX=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "Rooftop 88 at Indigo Katong Hotel: A Scenic Feast with a Peranakan Twist.\n\nRooftop 88, perched on the 16th floor of the Indigo Katong Hotel, offers an unparalleled dining experience that combines breathtaking views with exquisite flavors. The concept is novel: food is delivered directly to diners from Baba Chews restaurant below, akin to an elevated in-room dining service. The panoramic view of the Joo Chiat area from this vantage point is nothing short of spectacular, providing a breezy and serene ambiance that is hard to match.\n\nHowever, this unique setup comes with its challenges. While the effort to bring food up from the ground level is commendable, it does pose inconveniences for both staff and patrons. Service can be less attentive due to the distance and effort required to navigate between floors. Special mention must go to Alex, who showcased remarkable dedication and service in ensuring our dining experience remained seamless. For those requiring frequent attention or additional dining accessories, it may be more practical to enjoy the culinary offerings directly at Baba Chews on the first floor, especially on windy days when the breeze might disrupt your dining experience.\n\nNow, onto the culinary delights – and what delights they were! We indulged in a variety of dishes, each presenting a unique take on traditional Peranakan cuisine. The Beef Cubes were succulent and tender, dissolving effortlessly in the mouth. The Dry Bak Kut Teh was a revelation, offering the robust flavors of the traditional soup in a novel, broth-less form, with meat that was perfectly marinated and tender. The Black Pepper Crayfish Hor Fun was a symphony of flavors, with the wok hei (wok's breath) adding a smoky depth to the spicy, peppery sauce, and the crayfish adding a juicy, fresh element.\n\nThe meal was rounded off with a Lava Chocolate cake, a comforting classic that pleased without straying into overly adventurous territories. Our beverages, the Sapphire Rendezvous and Nonya Margarita, were delightful twists on traditional drinks, blending well with the fusion Peranakan theme.\n\nWhile the prices at Rooftop 88 are on the higher side, the quality, creativity, and flavors of the food justify the expense. It is a premium experience that, in my opinion, is worth trying at least once for its unique setting and culinary offerings. However, for a more convenient dining experience with equal culinary satisfaction, a visit to Baba Chews at ground level is highly recommended. I look forward to returning to the restaurant to explore more of its Peranakan dishes.\n\nIn conclusion, Rooftop 88 offers an extraordinary experience combining great food and stunning views. However, for practicality and convenience, the ground-level Baba Chews provides an equally satisfying culinary journey.",
      "time": 1708609588,
      "translated": false
    },
    {
      "author_name": "Shirley Lim",
      "author_url": "https://www.google.com/maps/contrib/107008356042810291032/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKvn-auIjoNhsC1YKww6LBc9O-XYV9gCf9uf_KopQZugM_q2_Q=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 weeks ago",
      "text": "Made a lunch reservation on 5 May and was informed by Level 1 reception that he would inform service staff about our arrival.  It’s a cosy small dining area with good views of the skyline.  Unfortunately, we left as there were no sight of any service staff after a 15 minutes wait.",
      "time": 1746419789,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2953664976333690849",
  "user_ratings_total": 18,
  "vicinity": "86 East Coast Road"
}