{
  "formatted_address": "73A Pagoda St, Singapore 059232",
  "geometry": {
    "location": {
      "lat": 1.283685,
      "lng": 103.8437405
    },
    "viewport": {
      "northeast": {
        "lat": 1.285011480291502,
        "lng": 103.8451568302915
      },
      "southwest": {
        "lat": 1.282313519708498,
        "lng": 103.8424588697085
      }
    }
  },
  "name": "Royal Hostel Singapore",
  "place_id": "ChIJ098XKXMZ2jERUUufr7hCmTo",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "Jade Rushby",
      "author_url": "https://www.google.com/maps/contrib/106376770127152161334/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV_Aa1YFRE9P-QzWkp0O3ezVuV76xlgYzzJ1ebVHXpcNlU350xqNw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "2 months ago",
      "text": "Location is great- lovely street in the middle of chinatown and next to MRT. Shared space is very basic with not much room to sit. Shared fridge. Stayed in a 4 bed which had locker spaces but was very squished with no privacy curtains which seems like a basic necessity to me. Reception is in a building opposite which is quite annoying - part of a seperate / linked hostel which seems nicer. Staff were nice. Mainly stayed here as was the cheapest place for a backpacker, but our bus was about 4 hours early and we couldn't get hold of anyone - spent many hours waiting on the street, wasn't really worth it",
      "time": 1740979334,
      "translated": false
    },
    {
      "author_name": "Anil Kumar Chunduri",
      "author_url": "https://www.google.com/maps/contrib/109586163993462968767/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJEMIodYFdkzwxXOjc_uiarxQsbxSs_4kXzOY0mDvGHrClGYdc=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "Worst hostel in my life. No one will come to know till they face the problem. I am not here to say bad or good before you book this hostel read reviews and do it.\n\nPros: location only\nCons:\n1. No lift, if you got room with luggage you have to move on steps.\n2. To separate room for changing clothes even for ladies.\n3. Very low air condition because they have to serve you in budget.\n4. No secure lockers to keep your luggage.\n5. No security guard or incharge to check at night time. Any one can enter in to hostel 24/7.\n6. Finally reception people very worst behaviour. They are not worried about your travel only their concern is to come in time and leave to home in time. I personally faced this problem in Singapore. My next flight is at 11pm but these people not allowed me to keep LUGGAGE till 6pm. I packed and kept at reception at 10am and gone for outing by the evening they call me and said if I don't come with in 6pm they will through my luggage outside.\n\nThis is so harsh behaviour, I took all my luggage out side.. Kept on road, luckily it is not RAINING on that day if so what to do.",
      "time": 1745812195,
      "translated": false
    },
    {
      "author_name": "Isabel Farronato",
      "author_url": "https://www.google.com/maps/contrib/102898466841310605691/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKNnfTkE0RRXZqGgy35lNYIGHyPpFS1WMWLKDUMuzJNblj1ju4=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "8 months ago",
      "text": "Not a great stay. Reception is supposedly open from 9-6, but no one came until 10am on the day I needed pay/check out. The dorms were bigger than described - I booked a 4-bed dorm, but it is connected to rooms with about 12 other beds! The bathrooms stink of pee and have clearly not been cleaned. The only positive is the location - right next to the Chinatown MRT station.",
      "time": 1726624013,
      "translated": false
    },
    {
      "author_name": "Henrikus Wills",
      "author_url": "https://www.google.com/maps/contrib/103077371179571832647/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVkvlvKMQiUIU1ytlQzTvCOYiBaArLctEuDf5isoypAOzPoFJQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Worst budget hostel, avoid at any cost. Booked for 5 nights for a 2-bed room but there is no door or curtain and practically sharing with other 8 people. Very noisy after 11-12pm even with the so called curfew. The bed is also dirty, I got skin rash on first night and decided to book another hostel after second night. The shower is very small and water keeps leaking. The stairway is very narrow, making it difficult to carry your luggage especially if you get the 3rd floor room. The only positive is location, right next to the MRT exit.",
      "time": 1685930759,
      "translated": false
    },
    {
      "author_name": "Zoe Fogg",
      "author_url": "https://www.google.com/maps/contrib/117781485199510893304/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLOT2jU2PylKhmJ1Fv8De6pY_wPVGCnLo2aXD8qKe1IC2NbqA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "7 years ago",
      "text": "Great location right on the China town food street! Loads to do and everything within walking distance! Would recommend this place as a budget place to stay in Singapore. We stayed for 2nights.\n\nThe staff are super friendly and advise on the best places to eat and go. They can even post your postcard for you for S$1.50. The place is really nice and clean and spacious for Singapore but if you've never been it still feels a bit small. Large lockers are available (bring your own lock) and linen is included. They give you a breakfast coupon too which is worth S$2.\n\nThere's only two showers and two toilets so be prepared to queue or get up early/late to miss the crowds.\n\nWe were disappointed with the noise levels despite signs saying please be quiet. We had a 6am wake up on Monday morning due to hostel guests turning lights on, opening and closing lockers (loud) and generally having no consideration for others. But if you get a good bunch of people then your in for a treat!",
      "time": 1511678849,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4222479486624418641",
  "user_ratings_total": 193,
  "vicinity": "73A Pagoda Street"
}