{
  "formatted_address": "8 Sentosa Gateway, Sentosa Island, Singapore 098269",
  "geometry": {
    "location": {
      "lat": 1.2583209,
      "lng": 103.8205147
    },
    "viewport": {
      "northeast": {
        "lat": 1.259286630291502,
        "lng": 103.8220365302915
      },
      "southwest": {
        "lat": 1.256588669708498,
        "lng": 103.8193385697085
      }
    }
  },
  "name": "S.E.A. Aquarium",
  "place_id": "ChIJj-3Cq_0b2jERJv2MBkSVsPQ",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Lam Chu",
      "author_url": "https://www.google.com/maps/contrib/113418152435589683975/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV_XZpLrptSBDI-qP_pycD2KGS2FtHwrmfEqbhhEU7maC2cOxza2Q=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I first visited this aquarium when I was younger, and the massive tank left a lasting impression in my core memory, sparking my love for marine life and aquariums. It’s absolutely mesmerizing—a stunning place to explore. The ticket prices are reasonable, and the exhibits are beautifully designed. I also appreciate their strong focus on conservation and education, which is something I deeply value. Spend a few hours here—you won’t regret it! I was super fulfilled after getting here.\n\nThe only thing I’d change is the souvenir shop’s location and size. It’s too small and not placed at the end of the aquarium. I assumed there would be a bigger shop at the exit, so I skipped the one in the middle of the route. Unfortunately, by the time we were leaving, it was too crowded to go back, and we missed the chance to buy anything. Please consider adding a larger souvenir shop at the end—I’d love to buy plenty!",
      "time": 1743137574,
      "translated": false
    },
    {
      "author_name": "Pavethira SN",
      "author_url": "https://www.google.com/maps/contrib/110456655737767856951/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIW2_XpRXwy0xYIhl2qiK04xldzdcqM-5USoyhLtieYaBdAwA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "World class and well maintained aquarium. Very informative and attractive for kids. The amphitheatre set up of the big wall of underwater creatures makes oneself awestruck. The underwater tunnel with sharks crossing above was mesmerising. Try opting for a dolphin encounter ticket to witness and play with the dolphins. One might get wet while the encounter session and no photography allowed. It will be a hell of an experience for all to play and touch the dolphins in a very close vicinity. There are even advance encounter tickets which allows you to go and swim along with the dolphins.",
      "time": 1747046442,
      "translated": false
    },
    {
      "author_name": "sudipta dutta",
      "author_url": "https://www.google.com/maps/contrib/102602164068825668849/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXaAch5FxZyJK6n-3HuaSFCTSfpDYgx0DtHtvHIXpQrISQAvKd4ww=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "Visiting the S.E.A. Aquarium at Resorts World Sentosa was like stepping into a living, breathing underwater world. With over 100,000 marine animals across 1,000 species, the scale and variety are truly breathtaking. One of the highlights is the massive Open Ocean Habitat — its floor-to-ceiling viewing panel offers an unforgettable, immersive view where manta rays and sharks glide past gracefully, almost as if in slow motion.\n\nThe aquarium is cleverly divided into themed zones representing different marine ecosystems. From the vibrant Coral Garden to the thrilling Shark Seas, each area is both visually stunning and rich with educational content. The informative displays and interactive touch pools kept both kids and adults engaged, making it a fun and meaningful experience for the whole family.\n\nWe found that arriving early helped us enjoy the exhibits at a relaxed pace before peak crowds arrived. Plan to spend at least 2–3 hours to truly soak in everything. If you're up for a deeper experience, the VIP tour offers behind-the-scenes access and up-close interactions with marine life — well worth it!\n\nOverall, the S.E.A. Aquarium is more than just a tourist attraction; it's an inspiring dive into the wonders of the ocean, leaving you both awed and more appreciative of marine life.",
      "time": 1745317987,
      "translated": false
    },
    {
      "author_name": "Simson Lee",
      "author_url": "https://www.google.com/maps/contrib/117383861413855053186/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU4uORFaj5cu6R2aPUqrQta_Kuk3pZAM5_9FkV_tzGGcb9O_2My=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Went it on my birthday with my girlfriend.\n\nAbsolutely stunning, breathtaking views and creatures. Especially the jelly fish zone, just reduce the brightness and you can have super effect of it. Attached with photos below.\n\nWent on a weekend, Saturday about 3pm, less crowded. Both of us spent about 3 hours throughout the journey. Definitely revisiting again next time. Highly recommended.",
      "time": 1742483600,
      "translated": false
    },
    {
      "author_name": "Radovan Dacej",
      "author_url": "https://www.google.com/maps/contrib/103359563848868637538/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJCZSjFDESTVewfd7bJ1NxD_tmiF-wxRHcA6F3jsgemT_fA1g=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "Stunning. Plenty to see and learn, recommend to take your kids there.  We went on Monday in April before lunch, not crowded at all. Suggest to take your time. Wheelchair accessible. Not eating or drinking inside. Booked via booking.com and received e-tickets with barcode directly for the attraction.",
      "time": 1745377626,
      "translated": false
    }
  ],
  "types": [
    "aquarium",
    "tourist_attraction",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17631756660555709734",
  "user_ratings_total": 30223,
  "vicinity": "8 Sentosa Gateway, Sentosa Island, Singapore"
}