{
  "formatted_address": "70 Collyer Quay, #01-02 Customs House, Singapore 049323",
  "geometry": {
    "location": {
      "lat": 1.2824961,
      "lng": 103.85339
    },
    "viewport": {
      "northeast": {
        "lat": 1.283835130291502,
        "lng": 103.8546031802915
      },
      "southwest": {
        "lat": 1.281137169708498,
        "lng": 103.8519052197085
      }
    }
  },
  "name": "Sabai Fine Thai on the Bay",
  "place_id": "ChIJs1KdHQ8Z2jERZN0IHVn3gJ0",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Jon Wan",
      "author_url": "https://www.google.com/maps/contrib/100955139997659919511/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWFy-wrUI_67EGCOWgbj1sNgpYvWkiCgvYYNwDmK7Kw6zsPQr-4=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Very nice location serving authentic Thai food. They also had vegetarian options. Service very prompt and they can cater to small and large crowds",
      "time": 1739376103,
      "translated": false
    },
    {
      "author_name": "Grace Ng",
      "author_url": "https://www.google.com/maps/contrib/103494993663494337347/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLeKU9hmQQFpfZVYSGUR3BhBulQUDiprYqkEoXEX-WIFn1lEw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "Overall the food was tasty and service was good. The duck curry gravy was delicious but wish they could let customer have the choice to replace duck with chicken. I dont't recall asking for a vegetarian version of pineapple rice which had too many pieces of carrots and pork floss for my liking (see photo). Wished they had prawns and cashew nuts in it and served in a pineapple.",
      "time": 1715436926,
      "translated": false
    },
    {
      "author_name": "Bericbogan",
      "author_url": "https://www.google.com/maps/contrib/118245532817873639336/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVv8s7f4J4ccxloKqbIedNqfri7QCtxcZ2Z39PiP0JB966UAtj6ng=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Nestled along the tranquil waters of the bay, Sabai Fine Thai is a culinary oasis that transports diners on a gastronomic journey through the vibrant flavors of Thailand. From the moment you step inside, you're enveloped in an ambiance that seamlessly blends elegance with warmth, setting the stage for an unforgettable dining experience.\n\nStart your culinary adventure with an array of appetizers that tantalize the taste buds and awaken the senses. The Crispy Spring Rolls, with their delicate crunch and savory filling, are a perfect introduction to the Thai culinary tradition. Pair them with the zesty Thai Dipping Sauce for an explosion of flavors that dance on your palate.\n\nFor the main course, Sabai Fine Thai offers a symphony of dishes that showcase the diversity and complexity of Thai cuisine. The Pad Thai, a classic favorite, is elevated to new heights with the perfect balance of sweet, sour, and savory notes, mingling harmoniously with tender noodles and succulent shrimp or tofu. Each bite is a revelation, a testament to the chef's mastery of his craft.\n\nIf you're feeling adventurous, delve into the chef's specialties, such as the delectable Panang Curry. Rich and creamy, with a hint of spice that lingers on the tongue, this dish is a celebration of Thailand's culinary heritage. Served with fragrant jasmine rice, it's a feast for both the palate and the soul.\n\nNo Thai meal would be complete without sampling the desserts, and Sabai Fine Thai does not disappoint. Indulge in the heavenly Coconut Sticky Rice with Mango, where the sweetness of ripe mangoes meets the creamy richness of coconut-infused rice, creating a symphony of flavors that leaves you longing for more.\n\nComplementing the exquisite cuisine is the impeccable service, with staff members who are knowledgeable, attentive, and eager to ensure that every aspect of your dining experience is nothing short of perfection.\n\nIn conclusion, Sabai Fine Thai on the Bay is more than just a restaurant—it's a culinary sanctuary where passion, artistry, and tradition converge to create an unparalleled dining experience. Whether you're a connoisseur of Thai cuisine or simply seeking an extraordinary dining adventure, Sabai Fine Thai promises to delight and enchant, leaving you with memories to savor long after the last bite has been savored.",
      "time": 1713368037,
      "translated": false
    },
    {
      "author_name": "Lionel Tan",
      "author_url": "https://www.google.com/maps/contrib/105174264645946437106/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUXCyP-ULq1yn-tCDYm0YKlY1s6GAsZ0GyvMW7bSsoM9_ipqnP4=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "While this restaurant is at Collyer Quay it is a pity it does not have nice views. The egg dish is highly recommended. It is fluffy and goes well with the accompanying chilli. The red beef curry was also great and recommended. The other dishes like the fried fish, fried rice and desserts were average. As expected, the price is high for the location.",
      "time": 1704583255,
      "translated": false
    },
    {
      "author_name": "Dana Nurlan",
      "author_url": "https://www.google.com/maps/contrib/104798199350169287938/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUP3XYomYPyHT5ETxhP_BJK_3e2WLGG-Ogu9ZYs0ASVSW1C4Sg0ZQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Such a great place for a visit! I loved how polite and attentive the staff was! Especially want to thank Mister Nit for a wonderful treatment 🫶🏻 wish you all the best ! Would recommend this place to everyone",
      "time": 1739701052,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11349343023084920164",
  "user_ratings_total": 336,
  "vicinity": "70 Collyer Quay, #01-02 Customs House"
}