{
  "formatted_address": "5 Stadium Walk, #01-02/03 Leisure Park Kallang, Singapore 397693",
  "geometry": {
    "location": {
      "lat": 1.3021918,
      "lng": 103.876502
    },
    "viewport": {
      "northeast": {
        "lat": 1.303405080291502,
        "lng": 103.8779239302915
      },
      "southwest": {
        "lat": 1.300707119708498,
        "lng": 103.8752259697085
      }
    }
  },
  "name": "Saizeriya - Leisure Park Kallang",
  "place_id": "ChIJKey-7mMZ2jERq06qeFJutAY",
  "rating": 3.3,
  "reviews": [
    {
      "author_name": "Rennie Lee",
      "author_url": "https://www.google.com/maps/contrib/104896149882118051128/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWlI9ttj92m3GJKTZ-eyIJbVH2ebrFhZEfbM4MRxj7R0ET5_Hjv=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I enjoyed the food here, it’s really value for money! The new spicy cream pasta was flavorful, not too creamy. It’s like a spicy and slightly milky Japanese wafu pasta. Wings are good as usual. The broccoli dish was full of flavor with garlic!",
      "time": 1743389682,
      "translated": false
    },
    {
      "author_name": "just Wai",
      "author_url": "https://www.google.com/maps/contrib/113857140644341643606/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVNgBjXxrCbmCqGbXjDpOAtIcufovh5dPOtZgBboEAz50enAg-f=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "4 months ago",
      "text": "Summary: On Sunday after my badminton nearby, I came to this Saizeriya for lunch with my friend. Is around 4pm plus. Not really crowded here yet we have a bad experience due to some 1 server. A tall young male. Will explain more in the service section.\nFood 2.9/5 stars, compare to other Saizeriya is pretty bad.\nWe order, Black pepper chicken pasta, 5piece chicken wings, Bolognese poach egg pasta and Garlic focaccia.\n\nBlack pepper chicken and Bolonese poach egg pasta, 2/5 stars. The pasta is too watery and taste pretty plain, pasta doesnt really absorb the sauce. The poach like some kopitiam half-boiled egg, pretty badly done.\n\nGarlic Focaccia, 2.5/5stars\nIs crispy and soft but just lack of the garlic flavour at the side, only the centre got taste but it just dont have the garlic taste. And i never compare it to other outlet yet.\n\nChicken wing 4.1/5 stars\nI would say their chicken wing is better then other place, chicken wing is very juicy and crispy from the outside even though the presentation of the wings is not that fancy compare to other store. But i give this a good point for taste.\n\nService\nThe counter guy is just pretty bad, firstly he tone and his attitude is very bad. I have to repeat alot of times of what I want to order, pretty I already speak to him very clearly and use my finger to point directly on the food I want in the menu, and also give him a few seconds to process before I move on to another items. Throughout, he sounds very impatient and irritated. And once we settle down back to our seat, the food came which is kinda fast and is fresh. But sadly, there is no utensils on our table at all. I have to go take myself and the only place that store the utensils is actually at the counter there...\n\nAtmosphere\nThe place is pretty nice and chilling. Giving a relaxing vibes.",
      "time": 1737293158,
      "translated": false
    },
    {
      "author_name": "David Teo",
      "author_url": "https://www.google.com/maps/contrib/107361104645557352106/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIWA749dMhnuXoJOYu9jbOy3acg8cxzcbcjZcnhuDyJ9kTYhPQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Always killing with their value for money lunch sets. $9 for a tasty plate of creamy cheesy chicken baked rice, a side plate of salad and refillable soft drink. The place to be on a budget.",
      "time": 1744298737,
      "translated": false
    },
    {
      "author_name": "Wesley Wong",
      "author_url": "https://www.google.com/maps/contrib/107433449088212182977/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLUoYBeMQ_z33NHa0ApQs6jkdbm2dVWs2A_BFN-7vHzZwwP_IWY=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "9 months ago",
      "text": "This Saizeriya location, like others in Singapore, consistently attracts a long queue during peak dining hours. The restaurant offers affordable food without compromising on quality, making it a popular choice. It's particularly favored by teenagers and families, especially after their sports activities.\n\nHowever, one downside is the cleanliness of the establishment. The floor, particularly near the drink bar, tends to be quite dirty. It would greatly benefit from more frequent mopping by the staff to maintain a more pleasant dining environment. Overall, while the food and prices are commendable, the cleanliness needs attention to enhance the overall experience.",
      "time": 1722153140,
      "translated": false
    },
    {
      "author_name": "Octavius Fok",
      "author_url": "https://www.google.com/maps/contrib/110377552549649139063/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUTScHU42ahK0CDKmV4jgfIY3MdiLQgUHxkEFmYaK7aEiuXJway=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "my experience was ruined by this one supervisor.\n\n• talked to customers rudely when customers politely requested for a change of seat due to a big group\n• ⁠placed food down in a manner than led to the plate creating a loud bang\n• ⁠impolitely asked that a customer “put your leg down from my chair” and proceeded to stare down said customer\n• ⁠overall unprofessional attitude when serving customers\n\nOverall, Jonathan’s performance was below expectations and contributed to a disappointing experience for our guests, leaving a negative impression and potentially damaging the reputation of the establishment. As an outlet manager, he is expected to uphold high standards, but unfortunately, his actions fell significantly short of those expectations.",
      "time": 1746852083,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=483132360526286507",
  "user_ratings_total": 67,
  "vicinity": "5 Stadium Walk, #01-02/03 Leisure Park Kallang"
}