{
  "formatted_address": "22 Jln Kelulut, Singapore 809039",
  "geometry": {
    "location": {
      "lat": 1.3834391,
      "lng": 103.8757174
    },
    "viewport": {
      "northeast": {
        "lat": 1.384713130291502,
        "lng": 103.8770455302915
      },
      "southwest": {
        "lat": 1.382015169708498,
        "lng": 103.8743475697085
      }
    }
  },
  "name": "Sam Mui Kuang Pottery",
  "place_id": "ChIJe401bGcW2jERAcEDdOHI6bQ",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Johnray Lee",
      "author_url": "https://www.google.com/maps/contrib/108116698830136772544/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX33TbWkr_kBuDSsiTeaUSXNIhuvDV8W_HENcRVfqFVM7TX278gCA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "6 years ago",
      "text": "Did a pottery class that lasted for 8 sessions. Class was well paced with a variety of ceramics built. From a basic cup to a final Teapot set that I got to bring home after firing and glazing.\n\nTeachers are very friendly. Recommended to attend for a try at pottery. Will go back for wheel throwing when I have the time.",
      "time": 1538745433,
      "translated": false
    },
    {
      "author_name": "C.C Quah",
      "author_url": "https://www.google.com/maps/contrib/116254700547999874013/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXS__F_bS2OskoSu1ldK4zlzZBumlrapfRsXkoU5LjioEqe20HopA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "14/03/23\nMy kiln finally arrives!! After much consideration, I decided to get the kiln from them. At the least, I know customer support is there. Soo Kim help to program and even check the space in placing the kiln etc. 👍\n\nSep' 2022\nMy 1st time there, I went there to get materials. I would say bosses there are all very friendly and helpful, patience in answering my questions for this thank you! 😊\nI would go back again!",
      "time": 1678788957,
      "translated": false
    },
    {
      "author_name": "Rui En Koh",
      "author_url": "https://www.google.com/maps/contrib/109591156526314112137/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXdcaJ-j0s1a9Rc1i0TrOjD_Ql2sDVImD_DarN8hcc3lL-XXV0XqQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "love love love the vibe there and the people there were so so friendly!!\n\nwent there to get supplies and the lady was so helpful - patiently answering my questions about underglazes, recommending how many layers etc. as a beginner who is totally new to ceramics, this was really really helpful. she didnt seem to mind that i had alot of questions rather she welcomed them and encouraged me to ask more (im not a student there but i would think that with such guidance i would learn so much more)!\n\nhighly recommended and ill definitely be back\n🤍",
      "time": 1720258924,
      "translated": false
    },
    {
      "author_name": "Audrey C.",
      "author_url": "https://www.google.com/maps/contrib/100227797580332023528/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXN22JoFyLFt6qpjbhR_s4J4RbuBeEp1AC-DUDqbbdYC1REQZ68=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "3 years ago",
      "text": "Last year I received 10 classes for my birthday. I am not a expert but did quite a bit of pottery on the wheel the last 6 years.\nI arrived there and have been received by a wierd and reasonably agressive old woman.\nAfter having explained that I had 10 lessons to take I entered the \"atelier\"  I ve been assigned a wheel and a man came to give me the instructions. A session of 15 min of starting kit and off we go! I did mention that I was used to throw clay but it didn't seem to light up anything in his totally empty eyes.\nAnyway I was there to reconnect with the clay and I was ready to. As I am not an expert and wanted to learn more about the techniques, I was expecting over the next sessions to be guided... Well just a big hope. They just leave you play with the clay and learn by yourself. When after several sessions I started to ask support, I felt like annoying them... I finally ended up doing it my own way. So my husband paid for 10 lessons where I just learned nothing. I had to pay for the clay, the firing the color... Well you basically pay everything on extra and they even don't provide the basic skills. The cherry on the cake was when at the end of my 10 sessions the boss told me they wouldn't renew my subscription as they were planning to do renovation and they will close. THIS NEVER HAPPENED, the other ladies were even not aware of it. Anyway I guess that I was this ennoying lady who wanted too much interaction and support. The ambiance there is awckward, tense, and nobody is in a good mood, especially the old mum who is a kind of screaming dragon and speak only with her Chinese clients.\nI really Don t recommend this place!!!!",
      "time": 1636434392,
      "translated": false
    },
    {
      "author_name": "Diane F",
      "author_url": "https://www.google.com/maps/contrib/116962999867528215804/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUmrdvQazEnULFD-C8P5JLaEAbSbnRV6RFNq7M6k1k2p6rzSaaD=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Attended a handbuilding/coiling course that had 10 sessions and where you learn to make 7 items. It's really good because it teaches you the fundamental techniques of clay works from easy items (cup) to progressively difficult (chinese teapot with lid and teacups). I  booked all my sessions with Lynn, as she's a great teacher.",
      "time": 1640931262,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13036171467040211201",
  "user_ratings_total": 10,
  "vicinity": "22 Jalan Kelulut"
}