{
  "formatted_address": "299 Thomson Rd, Singapore 307652",
  "geometry": {
    "location": {
      "lat": 1.322061,
      "lng": 103.8410368
    },
    "viewport": {
      "northeast": {
        "lat": 1.323409880291502,
        "lng": 103.8423971802915
      },
      "southwest": {
        "lat": 1.320711919708498,
        "lng": 103.8396992197085
      }
    }
  },
  "name": "San Yu Adventist School",
  "place_id": "ChIJ58ieLOEZ2jERwFXVtjVidi4",
  "rating": 3.9,
  "reviews": [
    {
      "author_name": "임준희",
      "author_url": "https://www.google.com/maps/contrib/102372271640607529223/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLOR9nDLs86Qp3tJp-aWP6BCJSaBT97_0DfQLuSsWUMyEOOsw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Joining San Yu was the best decision that I've ever made in my life. My 1 year in San Yu has been fantastic. Making my best friends and learning from such kind and dedicated teachers, my school life was full of joy and enthusiasm. My English skills have also significantly improved, thanks to San Yu. Even though I'm leaving this school due to the AEIS, the memories I've made in San Yu would last forever - for the rest of my life. (Shout out to all of my amazing friends and teachers - thank you for making my life in San Yu unforgettable!)",
      "time": 1745505269,
      "translated": false
    },
    {
      "author_name": "Gwendoline",
      "author_url": "https://www.google.com/maps/contrib/104996859992566753783/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKORh17ebbIpAUf3vVOo2l6tIvHKi-6SPBWfHUtf_6qwp9SuA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "SYAS is a very good school. The teachers are very conscientious and responsible. They can teach the course clearly and easy to understand. The only drawback is that most students speak Chinese. But as long as you listen carefully, study hard, and make friends with English-speaking students, you will gain a lot. I used to be a student in it, but now I have left. I will never forget the time I spent in SYAS!",
      "time": 1745826394,
      "translated": false
    },
    {
      "author_name": "Brendan",
      "author_url": "https://www.google.com/maps/contrib/103282216841022692390/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJblpDQeQAN4Th7jBNn39uae8tRNQategiwrzRRHlSwoA0Pr8Y=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "As an ex student in San yu adventist school, my experience in this school was absolutely horrible and disappointing due to many factors and learning lifestyles. In this post, I'm mainly here to provide all the bad evidence I've experienced in this school, and to think twice before enrolling your child in this school. Firstly, to start off, this school not only provides primary school Singaporean local MOE syllabus, but also provides secondary school education based on the local syllabus. The bad thing about this school's education, is that the secondary education in the school is not good, they provide the students to learn the hardest and most complex subjects in their secondary school education. Why they provide the hardest secondary school education? You may ask, it's mainly because this school is trying to be as good as the top schools in Singapore, e.g ACS, RI, Hwa Chong based in my opinion. Students definitely tend to struggle in their education, of they are studying the secondary school syllabus in the school, as an ex student, in the past, I have also struggled in this school's education platform. The second reason that this school's education platform is not good for the students, is because the school never gives different timetables to students on even and odd weeks, so it's a very boring educational system, to add on even worse, the students of course would tend to sleep throughout lesson period in this school as 1 period, is simply too long, if you could imagine how worse 2 periods would be. The students never move to different classes during different periods and stay in the exact same class for hours until the day is over, that would be another factor why students don't do well with their grades in the school primarily because the lessons are too tiresome and not easy to study with. The third reason why this school is not good and that I have experienced, is because the school's students are extremely rude and rowdy, similar to gangster like students in the school, undisciplined and disorderly. The students are of course mainly foreign, most from China, Thailand, Myanmar, and different parts of Asia. The 4th reason that the school is particularly not good at, is the teacher are unkind, unwilling to teach the students properly and the school's staff is extremely irresponsible as they don't bother to help you when you are in need of help.\n\nSo I hope that if any parent is considering to enroll, His/her child in this school, I would strongly recommend not to enroll them and think hardly as they see this report of mine studying in 3 years of this school in the past. Now I'm glad, gracious and grateful to be an ex-student of this school 🙏 thank you for reading this report parents. 🙏",
      "time": 1737379353,
      "translated": false
    },
    {
      "author_name": "yue lin",
      "author_url": "https://www.google.com/maps/contrib/117908105038440573208/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK9T89mdGgmkFJcduCpCtDpIuerA6G1dPG1hBgxrMl8ZWtY2w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "I really like syas, I have many friends and met many nice teachers in syas!Although I passed AEIS, I will miss them 😭",
      "time": 1745827234,
      "translated": false
    },
    {
      "author_name": "Wong Linus",
      "author_url": "https://www.google.com/maps/contrib/105841369459275074642/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWxIcRwZlS3bL6uzc15-Oy274ri_pwU-vbwDE6pOAMmi5owACI=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Best school ever, trust me, teachers here are the best and you cant find such teachers other than this school.",
      "time": 1736341460,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3347971355836765632",
  "user_ratings_total": 56,
  "vicinity": "299 Thomson Road"
}