{
  "formatted_address": "171 E Coast Rd, Singapore 428877",
  "geometry": {
    "location": {
      "lat": 1.3067602,
      "lng": 103.9058362
    },
    "viewport": {
      "northeast": {
        "lat": 1.308053830291502,
        "lng": 103.9072829802915
      },
      "southwest": {
        "lat": 1.305355869708498,
        "lng": 103.9045850197085
      }
    }
  },
  "name": "Santa Grand Hotel East Coast, a NuVe Group Collection",
  "place_id": "ChIJraA5MPwa2jERbXtj4LEfXiM",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "JX",
      "author_url": "https://www.google.com/maps/contrib/116769873905008439961/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ_i8WEIdBahxhRTvB4n-N1rRr1o8npX7tNlq-IrZu8tsc5OQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "2 weeks ago",
      "text": "My recent stay was a complete disappointment and far from the 4-star hotel experience I expected. I arrived at 2:15 PM and was told my room was ready—only to walk up and find housekeeping still cleaning! When I went back to the front desk and asked if there’s another room that’s ready, the staff simply said no other rooms were available which I doubt. The lack of coordination between the staffs was frustrating. To make matters worse, after i checked in, I checked the fridge and I found an opened, half-finished canned drink—disgusting and proof of their careless cleaning.\n\nEven simple requests were mishandled: I asked for a shaving kit at check-in, but it wasn’t in my room, I had to ask again. For a hotel claiming to be 4-star, the service, cleanliness, and attention to detail were shockingly subpar.\n\nThe bathroom floor will also be wet after shower, I’m not sure how the water flow out but there it is. Not to mention, the towels are in terrible condition. Probably used 193682 times without changing.\n\nI probably won’t be returning and would caution others to think twice before booking here.\n\nOne good thing, they do up the room deck nicely. Staff was not rude or anything, it’s just disappointing.",
      "time": 1746350820,
      "translated": false
    },
    {
      "author_name": "Zuriel Mamba",
      "author_url": "https://www.google.com/maps/contrib/100097027827819745483/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXjjbnbgtrpHKDsQ_m9uOBbcQW6_NM5DrNtFVcH68Q8o1UewEnX=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Wonderful stay at the newly revamped boutique hotel along east coast. There's no lack of food choices here & several malls just a stone's throw away.\n\nAppreciated the bed decoration that tells how the important they treat their guests. Room was clean & tidy.\n\nA pity that we couldn't utilise the pool as it was pouring heavily. They have board/ card games for rental, simply ask the friendly staff.\nA huge hand to Mary for the warm hospitality & detailed explanation.",
      "time": 1742835738,
      "translated": false
    },
    {
      "author_name": "Alex Lloyd",
      "author_url": "https://www.google.com/maps/contrib/113407470469420046865/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUzxltq9rO-bqOxfIr-OWbwzpMuc6OiNJYD81SsfkWplq1z-Rs=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "We had a wonderful stay at this hotel during our short trip to Singapore. The location was absolutely ideal, situated in a charming local area with plenty of shops and restaurants just steps away, yet still close to major tourist attractions. It was also conveniently near the airport, making our travel hassle-free.\n\nThe hotel itself was clean, comfortable, and well-maintained, with friendly and attentive staff who made our stay even more enjoyable.",
      "time": 1743506501,
      "translated": false
    },
    {
      "author_name": "Michael Tan",
      "author_url": "https://www.google.com/maps/contrib/110116377845136603792/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXdt6131d2_gn4BNADILlPxt2nz_g6qKPZib8PRmhiohOXcmcIv=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "Our Stay at Santa Grand: A Mix bag.\n\nWe chose Santa Grand for its convenient location near our daughter's home, making it ideal for celebrating both Christmas and our anniversary with family. We booked a room with a skylight, anticipating a charming stay.\nUnfortunately, the soundproofing proved inadequate. Noise from neighboring families, particularly young children, disrupted our sleep throughout the night. We had to contact the front desk multiple times for assistance.\nThough no fault of the hotel and to their credit, the staff responded promptly and efficiently, relocating us to a different room. This room offered significantly better sound insulation and boasted a delightful view, significantly improving our experience. We appreciated the staff's attentiveness and their efforts to resolve the issue.\nThe hotel itself resides in a historic building, adding a unique character to the stay. However, the third-floor corridor could benefit from a refresh, as it currently has a slightly musty odor.\nDespite the initial soundproofing issue, we were generally pleased with our three-night stay at Santa Grand. The hotel's prime location and the staff's excellent service made it a memorable, albeit not entirely perfect, experience.",
      "time": 1735438509,
      "translated": false
    },
    {
      "author_name": "Elizabeth House",
      "author_url": "https://www.google.com/maps/contrib/113112777728393006270/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXsnssXI2_-nt5Hmx19RMOnvDRAdmxe4YVueMnvb698Qqtm7gRJ5w=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "A truly beautiful gem. The location is surrounded by varied restaurants, shopping, and a quick walk to the beachfront. The rooftop pool is so serene, and offers incredible views! Niki and Sylvia at the front desk were remarkably kind and helpful from arrival to departure. The room was very clean and comfortable, and I thoroughly enjoyed the complimentary snacks and beverages 😊 I also treated myself to a couple bath bombs from the front desk! All in all, it was a beautiful mini-vacation, and I look forward to the next trip! Thank you Niki, Sylvia, and Santa Grand staff ❤️",
      "time": 1735960989,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2548509287972567917",
  "user_ratings_total": 630,
  "vicinity": "171 East Coast Road"
}