{
  "formatted_address": "1 Create Wy, #01-11, Singapore 138602",
  "geometry": {
    "location": {
      "lat": 1.3042989,
      "lng": 103.7739138
    },
    "viewport": {
      "northeast": {
        "lat": 1.305787580291502,
        "lng": 103.7755204802915
      },
      "southwest": {
        "lat": 1.303089619708498,
        "lng": 103.7728225197085
      }
    }
  },
  "name": "Sapore Italian Restaurant",
  "place_id": "ChIJrccu6fUa2jERtI5L2Txe-_g",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Artem Moshnin",
      "author_url": "https://www.google.com/maps/contrib/114186673531048387843/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWvlti1ntxFtbwjSEgoSkij50Ksz-3FUWFhWwG5K3k15xyJo1u7=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "This Italian restaurant located at the heart of National University of Singapore, in Utown, have pleasantly surprised us. They offer very delicious, healthy and large-sized dishes at quite a relatively low price (with discounts for students). The dishes were beautifully served and were prepared quite quickly. I ordered the smoked salmon spaghetti which was very tasty but could use a little more flavour, so I added some spice (I asked for cheese but it is chargeable). The chicken chop was very big and absolutely perfect - it is flavourful and so soft to cut, and I especially liked the fact that it is entirely boneless. It comes with a choice of rice, pasta, or salad. The rice was plain white rice, next time I will opt for the pasta. The seatings were clean and pretty spacious. However, it was quite loud and noisy due to chatter coming from some corporate dinner happening there at the time. But despite it, our experience at the restaurant was pretty good. We were offered two free drinks for paying with PayNow too! The atmosphere in the restaurant is fine too. Overall, a good experience and would definitely recommend anyone interested in Italian food 🇮🇹 to try it out!",
      "time": 1711597606,
      "translated": false
    },
    {
      "author_name": "Wei Ting Tan",
      "author_url": "https://www.google.com/maps/contrib/102892616099523809069/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUXnvPnfMtMnRCfSGJccAhrFXOfh2lrYHBlqidDGH0nmBhYjuck=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Very generous portion with loads of seafood and texture of the pasta is good. The fish is cooked just right and there are actually 3 fillets. Very fresh ingredients cooked in perfection. Matcha latte is thick and creamy. The tiramisu is your dessert to go for that melts in your mouth. Staff are very friendly, especially Jim and Uncle Tay! Very fortunate to have met them :)",
      "time": 1701844928,
      "translated": false
    },
    {
      "author_name": "Ravish M",
      "author_url": "https://www.google.com/maps/contrib/116138807654098240752/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLpXPcC_WcFrUqrIH08l1LdjxR5tD4MpFcNKmlbs5y6pUcBAUA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Hidden Italian restaurant gem at NUS U Town. The food is prepared using fresh ingredients and chef is one of the best here. Ambience is great with clean spread out area. The staff is super friendly and willing to serve you. All times they are happy to listen to your needs and help to convey to the chef for your special requests. A great place to chill and enjoy Italian food and drinks 🍸🍷 and desserts 🍮 🧁 🍨. Plenty of carpark available at the nearby basement covered area. Would highly recommend this place for you alone, family, large groups,or gatherings. The place is reasonably priced and heard they don’t have service charges.\nTry to confirm the my review on taste, service, food, choices, and price. Don’t forget to try their mushroom soup and garlic bread.",
      "time": 1697552523,
      "translated": false
    },
    {
      "author_name": "TheKidfoodie",
      "author_url": "https://www.google.com/maps/contrib/103171403880283898348/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXe0T3wGgrAdDq3yv0HpNN-39Zg95yK1uW98HysxtGu8bhfbEo=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "The food was awesome I loved the risotto because it was creamy and the portion was very generous. They give u 3 pcs of cuttlefish, 2 king prawn and 3 mussels. The atmosphere was very rustic. The steak was decent, truffle sauce did not really have truffle flavour which was a bit sad.",
      "time": 1698142523,
      "translated": false
    },
    {
      "author_name": "Senkodan T",
      "author_url": "https://www.google.com/maps/contrib/105694380269027378061/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWYbxnbpc8UyipnLYz3WhxMf7l1T9u_Ya3ny6Kg61Kk120Kq45T=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "Update in 2024: Prices have jumped in the last year so I can't say they're good value anymore unless you're an NUS student who will get to enjoy their special discounted menu options. The cannelloni was pretty decent. The service is pretty good especially with the regular full-time waiter there.\n\nReasonably priced Italian food. Decent vegetarian options including eggplant parmigiana, and vegetable pizza. Pizzas are good sized to share. Freeflow water.",
      "time": 1706363232,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17941037155997159092",
  "user_ratings_total": 425,
  "vicinity": "1 Create Way, #01-11"
}