{
  "formatted_address": "163 Tanglin Rd, #03 - 122 Tanglin Mall, Singapore 247933",
  "geometry": {
    "location": {
      "lat": 1.3051081,
      "lng": 103.823845
    },
    "viewport": {
      "northeast": {
        "lat": 1.306541980291502,
        "lng": 103.8252967302915
      },
      "southwest": {
        "lat": 1.303844019708498,
        "lng": 103.8225987697085
      }
    }
  },
  "name": "SARAI",
  "place_id": "ChIJAY8U5CUZ2jERmkxFnZPIMDY",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Heidi Shyu",
      "author_url": "https://www.google.com/maps/contrib/112016927425501099833/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW0QYBWW4vo8noj9lz8onaxvxt5R6OmRXXvbA0Qt1eya6pHy_ke=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Delicious meal with quick and efficient service! The snap peas with scallops were so fresh. The marinated pork appetizer was very tender and tasty. Our flat noodle dish was flavored perfectly. The mango sticky rice with vanilla ice cream was a perfect way to finish our dinner. The restaurant has a beautiful setting as well. All in all, a wonderful dinner with great service.",
      "time": 1742212221,
      "translated": false
    },
    {
      "author_name": "Virginia Ng",
      "author_url": "https://www.google.com/maps/contrib/109677354795732504447/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocILVvm60Wl6vaG3S5qGw1SiOKRpzZZo5_wh0M9Xb8pm-9hc3iFm=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Celebrated our wedding anniversary here as I love Thai Food! Wonderful food and warm attentive service by Naomi, Mary and Kai! Had the discovery set lunch and it was delicious! Also had Thai white wine to pair with this meal. Thank you for a lovely experience!",
      "time": 1743659683,
      "translated": false
    },
    {
      "author_name": "Chris Heale",
      "author_url": "https://www.google.com/maps/contrib/110612061461848695659/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjViJygNiku95y-WO1EWByFao2nfqh1RABxSZ_nNtzmzGoiNmlu3=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "The service is amazing! So friendly and knowledgeable on the foods you are served. And oh wow the food is on another level. We had the Christmas taster menu and every course was a taste sensation! If you are looking for some amazing Thai meal don’t look no further!",
      "time": 1733748206,
      "translated": false
    },
    {
      "author_name": "HC L",
      "author_url": "https://www.google.com/maps/contrib/105381120259821237733/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL4AjoHyLWrgn0mQ9-z1eTIeRS1rdp--VFcDNRoBhx7ZLS0FL8=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Previously known as Patara Thai Fine Dining, my family and I were frequent customers because of the authentic Thai food and great service. We don’t even need the menu to order. However, after Covid, they renovated and the menu was changed to a more modern take of Thai food. We felt that the menu had become more fusion. Even the decor had become modern contemporary than a classical Thai  design. This time, we returned after a long break and managed to order some dishes we liked. Particularly liked the Spicy Smoked Fish Soup with Tooth Fish and Sweet Leaf Bush. The flavour was unique and not as boring as Tom yum soup. Unfortunately I forgot to take a photo. Loved the fried rice where the rice was perfectly fried with wok hei (burnt taste). The crab meat in the dish was very generous too. However the Kang Kong ordered was not generous and was insufficient for the 3 of us. As for the dessert: loved the kaya pudding but disliked the mango sticky rice. The mango was cut into thin slivers and they were not sweet. Lastly, service was perfect with Mary around. Just wished Eric, another old staff, was still working here.",
      "time": 1744715377,
      "translated": false
    },
    {
      "author_name": "wei K",
      "author_url": "https://www.google.com/maps/contrib/112531056212914057231/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLkjOZCyt-pJyEOmyJogEryxfT6D_cskzR6EY932nU77kfC-Q=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "My highlights are the softshell crab $28 with pomelo (fresh, well battered, not oily, sweet pomelo) and the moo ping $22 (really tender meat and well seasoned). Dry green curry with wagyu $36 (curry flavourful and meat is really tender and almost falls apart). Red curry with sliced sirloin wagyu was enjoyable too. Steamed sea bass was disappointing as the mud taste was really strong, I could not eat it. Maine lobster fish paste starter $28 was disappointing as well (can't really taste the lobster and the texture of the fish paste was hard) I didn't enjoy it. We had a slightly bigger group and were able to order more dishes to try with recommendations from service staff. However, had difficulty getting attention to top up our water (paid sparkling and still water, fine dining). We are not able to/ inconvenient to top it up ourselves as the bottled water was set on a side table near the wall away from us",
      "time": 1737176782,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3904841413254532250",
  "user_ratings_total": 828,
  "vicinity": "163 Tanglin Road, #03 - 122 Tanglin Mall, Singapore"
}