{
  "formatted_address": "5 Tampines Central 6, #01-01A Telepark Building, Singapore 529482",
  "geometry": {
    "location": {
      "lat": 1.3531422,
      "lng": 103.9421835
    },
    "viewport": {
      "northeast": {
        "lat": 1.354436030291502,
        "lng": 103.9435901302915
      },
      "southwest": {
        "lat": 1.351738069708498,
        "lng": 103.9408921697085
      }
    }
  },
  "name": "SATA Commhealth Tampines Medical Centre",
  "place_id": "ChIJe1vCEhI92jERI16LFIF_E4E",
  "rating": 2.2,
  "reviews": [
    {
      "author_name": "Nc Strength",
      "author_url": "https://www.google.com/maps/contrib/107550172788546876772/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXVnKTBKd0FBCj88oAr5T1i-T94oOp26CnA7rkSDBs3xlSHoveb=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 weeks ago",
      "text": "Came here to see doc , when reaching out to the front desk malay lady and told her im according to company’s PCP clinic then she direct told me that clinic is full ask me to go to loyang her behaviour shows me she dont want yo accept any more patients\n\nI travel here from bedok and end up have to go to loyang, if this clinic only can accept how many patient in a day please state out instead of giving this kind of respond and show this kind of service attitude. Please stated out to avoid other patients inconvenience",
      "time": 1745301910,
      "translated": false
    },
    {
      "author_name": "Kiri",
      "author_url": "https://www.google.com/maps/contrib/103381900618161302542/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXucsJ_dPQxid-CkM3v6z-lKvvCJ1b7xO64x75SR5FEKGU8qEA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "Recently visited for my work pass renewal but unfortunately, my experience was marred by the poor attitude of the front counter staffs (one middle age lady with headscarf and another lady with her name starts with P). Despite their roles in welcoming patients, they displayed a condescending demeanor making not only me but other patients feel disrespected with their tone of voice. I was explaining my part / concern but it seems like both of them are being argumentative towards me, “I cannot decide for you lah”, “you need to check with your employer” which, I told them off that I am only explaining/telling them.\n\nAs a patient, it’s essential to feel supported and informed throughout the process. I hope the clinic will take steps to improve their communication skills particularly in interacting with patients who may be unclear with the process. I mean you don’t need to treat us like we are no brainers?\n\nWhile the medical care itself was satisfactory, the subpar service of the front counter left a sour taste.\n\nKudos to the xray uncle and cleaner aunty for being polite and courteous at least to me which I hope to others too.",
      "time": 1737355630,
      "translated": false
    },
    {
      "author_name": "Jazz",
      "author_url": "https://www.google.com/maps/contrib/109857802419997450689/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUdqOkxo6agX2lq3MRGkSF75cLPbU90a4W3bn2fGrydpzbjhZus=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "6 years ago",
      "text": "Been here for Medical checkup which was required by the ICA for long term visit pass for my mother. We reached the clinic by 12:30pm but the receptionist asked us to instead come back by 2pm due to lunch time. Thats a hell long of a wait time for us. We came back to clinic by 1:50pm and they gave us a queue number. It took them overall 2hrs for a simple X-ray, Blood extract and 2mins of doctor consultation. The wait was way too long for the blood test (at counter C). We finally left the clinic by 4pm. Except for the wait time, everything was good and satisfactory. The total cost for the tests was approx S$50-S$51. The facility was maintained neat and clean including the washrooms. They also do pre-employment medical checkups.",
      "time": 1533713248,
      "translated": false
    },
    {
      "author_name": "thee hillman",
      "author_url": "https://www.google.com/maps/contrib/116016108226312150909/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI4cjUah6GsVcCDytjJ3JbQEFdzxqRfzT7bvyVjqXxW0vjQiw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "Dr Irving Teo is a joke, why Singapore even has such doctor practicing, appointment at 3pm waited for almost 2 hours and he decided he can take no more patient. Shoutout to the front desk for the patience in handling the patients though",
      "time": 1735295234,
      "translated": false
    },
    {
      "author_name": "Teck Lee Toh",
      "author_url": "https://www.google.com/maps/contrib/111212249542255800058/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL8z5S-S0nItMQzjC0xlXuRbmF2ayRTx4ufYoCvXowwRSpdzg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "The gentleman radiographer at the Tampines clinic on 6/11/24 9am provided attentive, patient, and clear service.\n\nWhen the X-ray referral from my doctor included conflicting instructions, he went above and beyond by calling the clinic to verify the correct details.\n\nAdditionally, as he was unable to provide the X-ray film due to a technical issue, he coordinated with the Chai Chee branch to ensure that printing and collection could happen on the same day.\n\nExceptional service!",
      "time": 1730941761,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9300917847822392867",
  "user_ratings_total": 144,
  "vicinity": "5 Tampines Central 6, #01-01A Telepark Building"
}