{
  "formatted_address": "8 Hamilton Rd, Singapore 209179",
  "geometry": {
    "location": {
      "lat": 1.3111044,
      "lng": 103.8607642
    },
    "viewport": {
      "northeast": {
        "lat": 1.312491530291502,
        "lng": 103.8620866302915
      },
      "southwest": {
        "lat": 1.309793569708498,
        "lng": 103.8593886697085
      }
    }
  },
  "name": "Scaled by Ah Hua Kelong",
  "place_id": "ChIJWRmi-rAZ2jERxA-pvrxs71Y",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Ng Wan Keat",
      "author_url": "https://www.google.com/maps/contrib/106272403703415093753/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU-Ci09lKrvviP2ZD4F2Nph0SEDXfenlBq463GB7NSK0wTfjCE03w=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "3 weeks ago",
      "text": "We visited a farm-to-table concept restaurant, offering a truly fresh and unique dining experience. We ordered a few dishes, and overall, the taste and presentation were very good. However, the beer-cooked mussels stood out for the wrong reason — while the sauce was fine, the mussels themselves had a strange taste, possibly due to their freshness. We did share our feedback with the staff regarding the mussel dish. Despite this, we look forward to returning to try more of their other offerings.",
      "time": 1745894586,
      "translated": false
    },
    {
      "author_name": "Edlynn Anzel (; Edlynn.z)",
      "author_url": "https://www.google.com/maps/contrib/111500889204447486621/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU1laKgpeRQfbgg3nPjpgb_dGz9m_w2v7jd_NRUza1dh_WtqOJk=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "I was most looking forward to trying this place after seeing reviews online. For Mains, I tried the brown butter grouper and the roasted prawns as recommended by the waitress. Both were average and the brown butter sauce was on the bland side. I couldn't quite shake the feeling that they weren't the fresh kind of seafoods and the texture was a bit of a letdown. Tuna Kinilaw was not the fresh kind of tuna I’d expected to be on top of the salad but it was a good side dish to contrast with heavier dish like pasta and brown butter grouper. The prawn dashi Aglio Olio pasta and Seabass Kabayaki were fine, nothing particularly noteworthy. The service was friendly and attentive, which is always a plus. The atmosphere was pleasant enough, a casual, relaxed vibe.\nOverall, It's not that anything was particularly terrible, but it didn't live up to the hype for me.",
      "time": 1743688199,
      "translated": false
    },
    {
      "author_name": "Penny Tan",
      "author_url": "https://www.google.com/maps/contrib/107955191979244018993/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKCv_sQ1mVml8Cy-GduDSd55cqAKOlA-v_C-ItSwYgnXL6U6Q=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "3 months ago",
      "text": "made a reservation for a birthday celebration and was 5mins early. man at the door was unwelcoming, he told us that our table will only be ready at 730pm and proceeded to shut the door. no smile, no friendly tonelity. it came across rather rude, definitely not what we would've expected for a restaurant where we are here for a happy occasion.\nAnyway, we ordered a number of signature sides and the best dish was actually the dessert. the seafood were fresh, but, taste and flavors were not well blended and hence not impressive, and no wow factor. everything was really oily. there weren't other options such as chicken or beef to go with, which may actually compliment the seafood, just like what we think the Panna cotta did, it was refreshing and goes well with the meringue and orange.\nWaitress was nice to explain each dish to us but the restaurant was so noisy that we couldn't hear clearly. not recommended for family or date.\noverall, won't be going back.",
      "time": 1739978864,
      "translated": false
    },
    {
      "author_name": "Victoria Han",
      "author_url": "https://www.google.com/maps/contrib/111698437552301557549/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIcg_7NLgtX-aMEKlvPyc8_sqd6fElWs3dbybqP2GNc4Fa1aj4=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "We have walked past this restaurant multiple times but only decided to try it out today and damn, it did not disappoint! Truly enjoyed the freshness and uniqueness of each dish. Staff were very detailed in their explanation of the dishes which helped make the experience even more wonderful. Overall, it was super yummy & the chill vibe makes it great for all occasions (dates, friends gathering, family etc.)",
      "time": 1737902190,
      "translated": false
    },
    {
      "author_name": "Henry Christian",
      "author_url": "https://www.google.com/maps/contrib/115131263219786984291/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVn4Zig-JYDC5moAunGmXk0Q8skpNnCpP5bqDRt5ura0wGbaYdE=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "The only seafarm-to-table restaurant in Singapore. I'm overjoyed at the freshness of the seafood here. We had prawns, fish, and mussels - all are cooked in local flavour  that comes with a twist. For example, the curry sauce with the mussel is a mix of Chinese and Indian curry, and boy, the  curry packs a punch! Between the two of us, we shared two small appetisers and two mains. We were stuffed with goodness! Service staff were friendly, knowledgeable, and eager to recommend the restaurant's must-haves and each dish that was served.\n\nExcellent dining experience.",
      "time": 1737615937,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6264345164604051396",
  "user_ratings_total": 1137,
  "vicinity": "8 Hamilton Road"
}