{
  "formatted_address": "1 Jalan Anak Bukit, #02-24E, Singapore 588996",
  "geometry": {
    "location": {
      "lat": 1.3385771,
      "lng": 103.7786733
    },
    "viewport": {
      "northeast": {
        "lat": 1.339887280291502,
        "lng": 103.7801515802915
      },
      "southwest": {
        "lat": 1.337189319708498,
        "lng": 103.7774536197085
      }
    }
  },
  "name": "Science Studios Learning Centre - Bukit Timah Plaza",
  "place_id": "ChIJ9whAmu8Z2jERyODsUufZTVs",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "May Lin Lee",
      "author_url": "https://www.google.com/maps/contrib/100225280302351213711/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUsvZEccI6b3zzjS1z-80SEBbyirMgqP-HQ-wbj05kSsFpaOJ-g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Science Studios helped my boy obtain AL2 for his PSLE. Prior to atttending classes at Science Studios, he was at the AL4 level. Their classes have a good mix of hands-on/practical lessons and there are lots of opportunities to apply the knowledge which helped my boy to internalise the concepts. The regular quizzes were also good as it provided checkpoints for my boy and the teachers to understand where he needed to pay extra attention to. All in all, very grateful to all teachers at Science Studios for giving my boy the much-needed boost for PSLE!",
      "time": 1735554408,
      "translated": false
    },
    {
      "author_name": "Erine Lim",
      "author_url": "https://www.google.com/maps/contrib/112824404201982759942/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUuIEd7uHNtIPCn8qErMt_KqGn-4xpaVe8Iqd_dz23zmYqB9iC13g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "My son had been with science studion since primary 5. At Science studio, the teachers put in effort to teach him the concept through practical experiments which he had enjoyed and be able to grasp the concept much easier. Science studios also have weekly online quiz for them to practice. Thank you to the teachers at Science studio that Daylen scored AL 1 in his PSLE .",
      "time": 1732839772,
      "translated": false
    },
    {
      "author_name": "Bryan Yeo",
      "author_url": "https://www.google.com/maps/contrib/114828785711353678385/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK1PciBCV5qa7_CxEeu1dRVzxobbyqC_SSHujPcOIVTqjQ2jA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My girl has been with Science studios for two years and she has so far achieved perfect score in her Science tests. As parents, we are glad that we had found our girl a conducive and excellent centre which is able to bring her Science standard to a higher level.\n\nThe trainers and teachers are very compassionate and put in great efforts in guiding and educating the students. There are also hands on lab experiment which the students get to experience the wonders of Science. Most importantly, the meticulous planned syllabus enable the students to have a better grasp and understanding of Science.\n\nI would highly recommend this centre to all parents who are looking to enhance their kids’ knowledge in Science.",
      "time": 1692774024,
      "translated": false
    },
    {
      "author_name": "Annie Sim",
      "author_url": "https://www.google.com/maps/contrib/115394368390067741084/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLrI5k4xJ3VOFWjW2-Y_tlWojby6JEaLB6vyrejsfMpxxufew=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Science Studios is an extremely awesome tuition centre as the notes are very useful and the teachers there are very kind, helpful and patient. I have a really great time going to Science Studios and have always been looking forward to every lesson as they always have hands-on experiments and quizzes(Kahoot!) which are very fun and exciting. These helped me to understand the topic more and understanding it while having fun, giving me more interest in Science which made me feel more enthusiastic about learning a new topic. There would be quizzes at the end of every lesson and practice papers by Science Studios when exams are near. The teachers will always help me if I have any queries and will always stop to explain if someone doesn’t understand. They will also give you some small token of encouragement if you submit your homework promptly. My Science was really poor in P3 (at AL5) and with Science Studios’ help in P4, my grades improved and I got AL2 for PSLE!\nThank you Science Studios for blessing me with a strong foundation for Science.😁\n\n~ Adolphus Lim P6/2023",
      "time": 1704206491,
      "translated": false
    },
    {
      "author_name": "Shirley Ang",
      "author_url": "https://www.google.com/maps/contrib/115245082641741976645/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJkZ13kPRMtjIaQAaWHnDOdQ9-7MDep1W9_3DC8KSHXP-UOWQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My girl is always looking forward to attending lesson at Science Studio. The teachers are helpful and patience. They will also advise me what are the areas that my girl needs to work on. Her result has been progressing well.",
      "time": 1708084424,
      "translated": false
    }
  ],
  "types": [
    "primary_school",
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6579154218210091208",
  "user_ratings_total": 47,
  "vicinity": "1 Jalan Anak Bukit, #02-24E"
}