{
  "formatted_address": "475 Changi Rd, Singapore 419892",
  "geometry": {
    "location": {
      "lat": 1.3194219,
      "lng": 103.9130666
    },
    "viewport": {
      "northeast": {
        "lat": 1.320653280291502,
        "lng": 103.9144695302915
      },
      "southwest": {
        "lat": 1.317955319708498,
        "lng": 103.9117715697085
      }
    }
  },
  "name": "Seng Kee Black Chicken Herbal Soup Pte Ltd",
  "place_id": "ChIJNfdSCgcY2jERKXFowRGbesM",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Claxton Ng",
      "author_url": "https://www.google.com/maps/contrib/111363749536749905332/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW0svU_K0h8_7Fq_2y-sWVkRJM02-VfvKZvDj0rAAd9TWssnYGQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Recommended by my colleague. Came to try out the foods. Food is acceptable and variety of choices, price is very reasonable. No wonder the Q are so long. One things I don’t like is the payment type are limited and drinks is order separately from the stall, very inconvenient.",
      "time": 1743932479,
      "translated": false
    },
    {
      "author_name": "Adrick Loh",
      "author_url": "https://www.google.com/maps/contrib/116967523325064503672/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSqxpxAhBHKvOrwj2rqIVkVX63y1J5yy77XZyeuL2vlR5xtrA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "2 weeks ago",
      "text": "Came many times for dinner here. Normally would order their pork mee sua and liver mee sua for wifey. This time ordered their white mee sua. More like soup but flavor and ingredients are to my liking. Their yellow wine lala is our favorite now. At $15 but worth it. Yellow wine is sweet and lala is the freshest I ever had in SG though small sized. We drink finish the yellow wine soup.\nP.S if you dun like your liver more than 50% raw need to tell them u like them cooked. It will still come out 30% raw.\nTried their seafood white beehoon. Stock is good but overall taste no as good as Sembawang popular white beehoon. My gout was activated after 15 mins into eating it. Confirmed rich in ingredients. lol\nCame on May 2025, their lala got strong fishy taste. The variety is different from the one I raved about the previous month.",
      "time": 1746362125,
      "translated": false
    },
    {
      "author_name": "Ivy Eyu",
      "author_url": "https://www.google.com/maps/contrib/113945057347369388154/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWj7mgpTQHk2FrKC7fHPFEYHf9jDvRQ2w_PKdxgCWlIzcb1NOHE=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Awesome tasty food. All dishes are well served and good. Great for family and friends gathering. Come early as it’s usually crowded in the evening and weekends.",
      "time": 1742172426,
      "translated": false
    },
    {
      "author_name": "Joshua Wong",
      "author_url": "https://www.google.com/maps/contrib/107244780137289771541/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKAa4l2VvuWc_liCsqks7_fkOioTSW01q4e-BJ3IDb7dpY1=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "It’s just 5 minutes brisk walk from Kembangan MRT, this restaurant is a must try if you want to have a Chinese-style cuisine.\n\nI visit this restaurant every year especially during Chinese New Year. The seafood dishes are fresh and reasonable priced, not to mention the flavour.\n\nFor a table of 3, we ordered Steamed Teochew-Style Red Snapper, Steamed Venus Clams (Lala), Fried Beancurd with Chicken Floss and Money Chye with Egg.\n\nNot many places serve Money Chye (Sweet Leaf or Star Gooseberry) but this restaurant. When it is stir-fried with egg, the taste is just perfect.\n\nAs fresh as it can get unless you catch it straight from the ocean, the seafood offered here is surprisingly fresh. You can choose your seafood at the glass chiller and choose the choice of cooking.\n\nThe Steamed Lala is just a fresh, while the beancurd is normal - how bad can a beancurd dish be unless the bean curd is spoilt or stinky?\n\nThe only downside about this restaurant is that they do not have printed menu - the menu is on the wall and it can be stressful to make your orders while queuing up to get a seat at the same time during peak hours. Unless you are a regular patron and you already knew what to order, new customers may have a hard time making deciding what to order while the staff is waiting to take your order at the queue.",
      "time": 1739430797,
      "translated": false
    },
    {
      "author_name": "A T",
      "author_url": "https://www.google.com/maps/contrib/110678197179454533023/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV3Uo396D9N1E1O_oRC7yGCLJukavmRdiUWOOcPuCW70wPXZlYBGw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "Decent food at affordable prices. Drinks overpriced.\n\nMy usual must eats are the mee Sua soup. This time went with a group of friends and tried many more dishes.\nA blogger highly recommended the fried Hokkien mee & salted egg sotong but I found it so so (note to self: stop following these unknown bloggers).\n\nThe must haves are the vegetables : long beans with crispy Hae bee. Chow tar bee Hoon is good too. Lala was decent.\nSkip the fried prawn balls that look appetising but….\n\nNot a place to sit down and chat as a long Q awaits your table.\nBut at $25-30 per head for 8 dishes, can’t complain.",
      "time": 1737250957,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14085741285116244265",
  "user_ratings_total": 3477,
  "vicinity": "475 Changi Road"
}