{
  "formatted_address": "50 Punggol E, Singapore 828824",
  "geometry": {
    "location": {
      "lat": 1.3933217,
      "lng": 103.9176177
    },
    "viewport": {
      "northeast": {
        "lat": 1.394767930291502,
        "lng": 103.9188328802915
      },
      "southwest": {
        "lat": 1.392069969708498,
        "lng": 103.9161349197085
      }
    }
  },
  "name": "Seoul Good Korean Restaurant (PUNGGOL)",
  "place_id": "ChIJ98EW-_g92jERT1piAsJAnow",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Deanna Wong",
      "author_url": "https://www.google.com/maps/contrib/111727073895895818213/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIqujZ73I2UXz-QnvDXXRo_vs74VsT866STA2dxjp7t41T4jOM=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Love this place!! Been here a few times already and will definitely keep going back. Great food, reasonably-priced alcohol and amazing service! The cold noodles are the best! We even got to eat dinner with the frog!\n\nIf you order one of the buckets/sets of alcohol and can’t finish, they’ll keep the bottles there for you next time too (they keep a record of your drinks with your name so they can keep track). Will definitely be going back again soon!",
      "time": 1744966512,
      "translated": false
    },
    {
      "author_name": "Kai",
      "author_url": "https://www.google.com/maps/contrib/103961412486889059100/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVu8fMZsK8VICJpIhG-TkOCDo-GvUxKgoaTgfepun3_I5cHcaVg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Wow... I can't even start to describe how bad the food was. Ordered delivery of kimchi carbonara pasta, ramyuen with fried chicken and grilled salmon rice which came up to near $60\n\nThe kimchi carbonara was so watery it made my eyes watery with tears. Looked like some laksa soup. 0/5\n\nNow imagine cooking a pack of plain maggi with no seasoning, add pure chilli powder and sprinkle prepacked seaweed. Thats the taste of the ramyuen with fried chicken. Sadness with chilli. To make more tears. Chicken was edible. 1/5 mainly for the chicken.\n\nThe grilled salmon rice was alright. Slightly less tasty than your average foodcourt faux korean japanese salmon rice. 2/5\n\nWe could not even finish our food. And my family, unlike me, is not even picky about food. It's just plain bad. Try at your peril.\n\nWe resorted to cooking instant noodles in the end. $60 down the drain.. its Seoul Bad...",
      "time": 1744592391,
      "translated": false
    },
    {
      "author_name": "Marcus Lee",
      "author_url": "https://www.google.com/maps/contrib/102351007558411518638/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJGpCgCrLcfWA5N1DHRLS-mpKt2vEQ2-oNOHp1QckKQNeTdpQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "Worst Korean BBQ I've eaten in Singapore. Meat was dry as hell. kimchi soup was horse shit . But anyone please do not come here to have their K BbQ .... it's the worse\n\nService was pretty decent , atmosphere was what attracted us here to begin with....",
      "time": 1746972563,
      "translated": false
    },
    {
      "author_name": "oXRYSTALo Ong",
      "author_url": "https://www.google.com/maps/contrib/114556064085815871377/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSTtKcF9FYMbh-XNbDu8f7Whl3gi-ZY6T8pFPOm3v9Y98Ws7jL=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "Seoul Good Korean Restaurant (Punggol Container Park):  A Fun Vibe with Room for Flavor Adjustments (3.5/5 Stars)\n\nRating:\n\n• Food: 3.5/5 (Decent flavors, but some dishes were a bit too salty for our taste)\n• Service: 4.5/5 (Friendly and helpful staff, going above and beyond to address our feedback)\n• Atmosphere: 4/5 (Fun and relaxed, especially the outdoor seating)\n• Value: 4/5 (Reasonable prices for the quality and location)\n\nOverall: 3.5/5\n\nDonkey and I were craving Korean food, so we decided to try Seoul Good Korean Restaurant in Punggol, which we'd been meaning to check out for a while.  We were really impressed by the fun and laid-back atmosphere of the Container Park where it's located. We opted for outdoor seating since it was a cool evening, and the indoor area seemed a bit cramped.\n\nWe ordered the Pork Jjajang Rice and the Chicken Kimchi Soup Ramen. The Pork Jjajang Rice was rich and flavorful, but I found the sauce to be a bit salty.  The Chicken Kimchi Soup Ramen was also thick and flavorful, but I felt it was a bit too salty as well.  We mentioned our feedback to the staff, and they were incredibly helpful, even offering to change our dishes for us!  We appreciate their attentiveness and initiative, and we're sure they'll take our feedback seriously.  Personally, I felt the dishes were alright because taste is subjective, but we appreciate the staff's willingness to go above and beyond.\n\nWe've heard amazing things about their chicken wings and bingsu, and we're already planning our next visit to try those.  We've also seen some mixed reviews about their BBQ dishes, but we didn't try them this time.  Overall, we found the dish we ordered to be alright, though slightly on the salty side.\n\nWe loved the friendly and helpful staff, especially when I was looking for recommendations.  The atmosphere at Seoul Good is fun and relaxed, and we loved being able to enjoy our meal outdoors.",
      "time": 1737293101,
      "translated": false
    },
    {
      "author_name": "Doraemon",
      "author_url": "https://www.google.com/maps/contrib/112665277904119154671/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX2VSCcaT9axvOwx2nD8XD3PgZ8V5VFnv420aocMSfLa6GlcEmN=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Kitty and I were craving Korean food, so we decided to try Seoul Good Korean Restaurant in Punggol, which we'd been meaning to check out for a while.  We were really impressed by the fun and laid-back atmosphere of the Container Park where it's located. We opted for outdoor seating since it was a cool evening, and the indoor area seemed a bit cramped.\n\nWe ordered the Pork Jjajang Rice and the Chicken Kimchi Soup Ramen. The Pork Jjajang Rice was rich and flavorful, but Kitty found the sauce to be a bit salty.  The Chicken Kimchi Soup Ramen was also thick and flavorful, but Kitty felt it was a bit too salty as well.  We mentioned our feedback to the staff, and they were incredibly helpful, even offering to change our dishes for us!  We appreciate their attentiveness and initiative, and we're sure they'll take our feedback seriously.  Personally, I felt the dishes were alright because taste is subjective, but we appreciate the staff's willingness to go above and beyond.\n\nWe've heard amazing things about their chicken wings and bingsu, and we're already planning our next visit to try those.  We've also seen some mixed reviews about their BBQ dishes, but we didn't try them this time.  Overall, we found the dish we ordered to be alright, though slightly on the salty side.\n\nWe loved the friendly and helpful staff, especially when Kitty was looking for recommendations.  The atmosphere at Seoul Good is fun and relaxed, and we loved being able to enjoy our meal outdoors.",
      "time": 1737470815,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10132607413638027855",
  "user_ratings_total": 422,
  "vicinity": "50 Punggol East, Singapore"
}