{
  "formatted_address": "#01-187, 269A Punggol Fld, Singapore 821269",
  "geometry": {
    "location": {
      "lat": 1.4030581,
      "lng": 103.8991325
    },
    "viewport": {
      "northeast": {
        "lat": 1.404369080291502,
        "lng": 103.9006539302915
      },
      "southwest": {
        "lat": 1.401671119708498,
        "lng": 103.8979559697085
      }
    }
  },
  "name": "SG LOCAL MART",
  "place_id": "ChIJ_zRoxwAV2jERI8SSKuoCRQE",
  "rating": 3.8,
  "reviews": [
    {
      "author_name": "Madhavan Charles",
      "author_url": "https://www.google.com/maps/contrib/113268070754110952062/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKIXW2cMLzFQaXFQgr9HfoGnTVNma6bm5dCdcVK0Htm5rwu=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 2,
      "relative_time_description": "4 months ago",
      "text": "I tend to go to Indian grocery stores around Sengkang and Punggol areas and make pricing comparisons on items as I'm a frugal spender. Comparisons made are for stores I visited only such as this store, Sri Murugan, Raj Provision, Vanilla Mart, Velan Mini super mart and others.\n\nPros: Customer service is normal. Vegetables are fresh.\n\nCons: Compared to other Indian grocery stores around the vicinity of sengkang and punggol amongst for the popular Indian items we buy such as prayer oil, yogurt, butterghee milk, vegetables etc, this place is more costlier. The prices are at least 10% to 35% more expensive for the same product, size and brand compared to the other stores such as Sri Murugan. Raj Provision is another store comparable to this store on how much the mark up the pricing for the items are overall.\n\nI'm not sure why the significant increase, but I'm assuming it either has something to do with overheads or the demand level for the specific items in store but the price difference is too steep to simply brush off. It is also the only Indian store at punggol and sengkang to charge for plastic bags so ensure you bring your own bags as the Indian items we typically buy can be bulky.\n\nMy opinion would be for customers is that if you're looking for best value price wise, this shop is not recommended.\n\nHowever, if you do not have the time or the convenience to go to another store, then sure why not. Cheers.",
      "time": 1736042336,
      "translated": false
    },
    {
      "author_name": "Atul Singh",
      "author_url": "https://www.google.com/maps/contrib/105851480485388378282/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV-C2ibHw5yIET--qEiOm4C_NUliGPVty8hcjEIqOI1DXn0ZGd2NA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "Very Unprofessional behaviour.\nI went to shop to buy one frozen item and saw the offer price written on the product. When billing happened, the discount was not applied. When requested for the discount, the billing person applied some discount. Then the owner came and he asked billing person to remove the discount.\nActually, they are charging premium rate on anything they sell. The Indian community does have much options and this store is the only one around.",
      "time": 1673961384,
      "translated": false
    },
    {
      "author_name": "venkata D",
      "author_url": "https://www.google.com/maps/contrib/115684455472944229716/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVgc9TXhzgh89s8B6m2qTDi5uq5Vbl4j9T0TgyCw26-W8Pfm7dr=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "Good place to shop household essentials\nYou can find authentic indian vegetables and groceries",
      "time": 1619080434,
      "translated": false
    },
    {
      "author_name": "Sadhguru Trading",
      "author_url": "https://www.google.com/maps/contrib/107204647272442164146/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK_NBiBS3I-GUnr5deTfPU8GPud1hRg7rD_tdt0ct7vIKkoJw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "We have long business relationship with this store and the way \"SG Local Mart\" has been transformed post founders have taken over the store is exceptional.\n\nI had seen the store online for directions when I lost my way, realized the past partner's close friend had been giving a 2 Star Rating whom I recollect that guy based on his profile (Venkatappaiah Chowdary Vattikuti) . He is not even a customer of SG Local Mart and he doesn't even has a single transaction with store since past 3 months of this writing as I understand from the Store Owner. Ignore such reviews,\n\nWe also see another reviewer from California giving 1 star. We had give the store owner advise to take legal action on such unethical reviews. Owner is graceful to ignore such people.",
      "time": 1665969595,
      "translated": false
    },
    {
      "author_name": "K K",
      "author_url": "https://www.google.com/maps/contrib/110822746875679393540/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL8UgVOkz1OZld8vCEmO_wDBdWgIHjaOfMc_rFLuel15LQ24A=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "2 years ago",
      "text": "Went back to patronise the store after being served by two friendly and helpful staffs, but this time round, a young lad who was manning the cashier counter was extremely rude and lazy. It would been 1 star if not for the previous pleasant shopping experience.",
      "time": 1671887837,
      "translated": false
    }
  ],
  "types": [
    "supermarket",
    "grocery_or_supermarket",
    "meal_takeaway",
    "restaurant",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=91482572190827555",
  "user_ratings_total": 33,
  "vicinity": "#01-187, 269A Punggol Field"
}