{
  "formatted_address": "10 Kaki Bukit Rd 1, #01-25 KB INDUSTRIAL BUILDING, Singapore 416175",
  "geometry": {
    "location": {
      "lat": 1.3356712,
      "lng": 103.9032173
    },
    "viewport": {
      "northeast": {
        "lat": 1.336953980291502,
        "lng": 103.9046392302915
      },
      "southwest": {
        "lat": 1.334256019708498,
        "lng": 103.9019412697085
      }
    }
  },
  "name": "Shalom Movers Pte Ltd",
  "place_id": "ChIJ1SM8DfAX2jER6EsO8vrIlMU",
  "rating": 4,
  "reviews": [
    {
      "author_name": "S. P",
      "author_url": "https://www.google.com/maps/contrib/109508037000255301744/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ47v-QMpj8C1C6_Rqenry4FhMegxIf7rZFAj9KzVuNBzt0hA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I had a wonderful and pleasant experience throughout my move and I'm certainly impressed with the team efficiency and professionalism.  Joy, the site surveyor was very professional and patient in answering all of my queries. The cartons arrived quickly, and the delivery man was really nice. Every member in Team A1 maintained a pleasant & positive attitude throughout the entire moving procedure. Regardless of how heavy the objects are or how exhausted the movers are, they are always smiling and ready.\nTheir camaraderie is truly fantastic. I can see how they found joy in their work.\nThank you Shalom and Team A1 for making our house move a breeze!",
      "time": 1743044711,
      "translated": false
    },
    {
      "author_name": "Tan Kim Kim",
      "author_url": "https://www.google.com/maps/contrib/100733110276340817454/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUhandG35tIFyzwFb2oAep18ecCLGRB19Kb9QZJU2RuzTTAxEpFkQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Shalom Movers always arrive before scheduled time with broad smiles. We like their professionalism and teamwork. Our experience had been a pleasant and assuring one, with Mr KS Ong always ready to answer questions despite the late hours. The team today was very patient, respectful towards team mates and great teamwork. It was very good to have a mixture of younger men and more senior ones and they are all strong.",
      "time": 1736919588,
      "translated": false
    },
    {
      "author_name": "xiaocai7",
      "author_url": "https://www.google.com/maps/contrib/116963494324246507942/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX1L-JZKHkTY7HZ-NaaK0uDziXXg3TSvBstdq7PpjrlXP231-TV=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "We engaged Shalom for our moving services. As my new house is not ready and need to handover the current place.\n\nWe had two moving tasks. The salesperson, Mr Matthew was friendly and empathetic of my tight moving schedule. He managed to squeeze a timeslot for us.\n\nDuring each move, their team especially team A, Tharma and team took special care when packing and moving our items.\n\nEverything done professionally and with great care, no wonder they say they are the top choices but alot of ministries, agencies and MNCs.\n\nThe benefit of engaging Shalom, was they even handled the security deposit and scheduled with our condo management.\n\nI strongly encourage anyone with moving needs to engage the leader and best.",
      "time": 1735637213,
      "translated": false
    },
    {
      "author_name": "Amos Tan",
      "author_url": "https://www.google.com/maps/contrib/117739904666191430490/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIod0tVGEBZ-9-TgrmB4CjYxJaQTsIjKlp6-gPOlqsjtHRVCw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I engaged Shalom despite having a cheaper quote on hand (sceptical about the service quality and most important of all the “bait and hook” strategy). It was a good decision made.\n\nShalom teams (KS Ong - sales, and its operational crew led by Hakim from Team B) were professional and always have a smile on their faces. They took great care of ensuring fragile items were carefully wrapped and protected no matter how big or small the items. Great team work (and a jolly one) was on display by the crew as well.\n\nThe move was seamless as Hakim and crew were efficient, professional and display lots of empathy. My wife was not feeling well on the day of the move and Hakim was very thoughtful to move/open up the sofa first so that my wife was able to take a rest.\n\nKudos to Shalom and keep up the good work!",
      "time": 1740900671,
      "translated": false
    },
    {
      "author_name": "Rachel Dowling",
      "author_url": "https://www.google.com/maps/contrib/102216644865825167386/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWWCByi0_-eyHcOS1dkUYBafLE2__FVmeKJwxphYhklSHIfM-nS0w=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "This is my 3rd move in Singapore and my 1st using Shalom, I have now found my movers in Singapore! I will not use anyone else! From initial contact to payment shalom were excellent and really did make the move smooth and pain-free. We opted for the packing service and it was incredible so effortless. We also scheduled Shalom for disposal service as well,  I would high recommend their friendly service, the gentleman that packed and moved us were really incredible and are a credit to Shalom, thank you!",
      "time": 1746755453,
      "translated": false
    }
  ],
  "types": [
    "moving_company",
    "storage",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14237225302153382888",
  "user_ratings_total": 271,
  "vicinity": "10 Kaki Bukit Road 1, #01-25 KB INDUSTRIAL BUILDING"
}