{
  "formatted_address": "855 Mountbatten Rd, Singapore 437839",
  "geometry": {
    "location": {
      "lat": 1.3029958,
      "lng": 103.8995913
    },
    "viewport": {
      "northeast": {
        "lat": 1.304387930291502,
        "lng": 103.9008875302915
      },
      "southwest": {
        "lat": 1.301689969708498,
        "lng": 103.8981895697085
      }
    }
  },
  "name": "Shaws Preschool @ Mountbatten Road",
  "place_id": "ChIJz3WpK2wY2jERb59T1s2tyCI",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "C T",
      "author_url": "https://www.google.com/maps/contrib/110798742721141255817/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKL4K_Z4UOJGSMmlhHDJUUJcbQ3edRcKQMgN6TFv9y0hySHcA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 2,
      "relative_time_description": "5 months ago",
      "text": "The only good thing about the school is the sports-based learning where the kids have regular outdoor activities.\n\nOther than that - frequent change of teachers, no standard check-in protocols (teachers just skipping the proper health check up despite multiple feedback). Lack of communication between the principal and the parents.\n\nSent the feedback to the principal close to three weeks ago and requested for them to call back twice but have not heard from them yet. The experience was good initially during the PN class, subsequently it seems to go south. Two school fees hike over the last 2 years, I would expect better standards.",
      "time": 1733713431,
      "translated": false
    },
    {
      "author_name": "Ben Tse",
      "author_url": "https://www.google.com/maps/contrib/109883348176654420960/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJARNxoKiiljZrXjws_VjfndupweOTu-ZboOt82G5EMt3ApMw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "My daughter spent 3.5years at Shaw's Mountbatten and never had a day she regretted going to school. She did not speak English or Chinese when enrolled in 2021, but the play-based environment has allowed her to catch up on the Singapore curriculum, and she has blossomed into an active, sociable and tough young lady.",
      "time": 1733390119,
      "translated": false
    },
    {
      "author_name": "Nain Bathija Gurnani",
      "author_url": "https://www.google.com/maps/contrib/114103501293762798013/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUFUN8bMxFghprPV9-Lo3BTB3L6obghrUgr425Xb8fhnfg7FtM=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "My child did his N1 & N2 at this school at the Tanjong Katong branch on the extended day program. I personally did not bother too much when he was at N1 cos i had 2 newborns to deal with. Big mistake on my part! At the start of N2, at the first PTM, i approached the teacher with concerns that I'm not getting to know whats happening in school and asked if i should practice writing with my child at home and they assured me that it will be taken care of at school and the children at this age are already quite overwhelmed with being introduced to writing.. My child was going to school everyday upto 3:30pm and hence i gave him mostly playtime at home.. Only towards the end of the year at the second and last PTM, (mind you there were only 2 Parent teacher meetings throughout the year) my child's class teacher tells me he might need a little help at home and the whole year had already passed and we were at literally the end of the year! And this was never pointed out to us inspite of me or my husband dropping him and picking him up from school every single day! That was one whole year wasted basically! Only when my child left the school were his workbooks given to me, not once were they shown to me during the parent teacher meetings and i was shocked to see that not even half the workbook has been covered! Now in K1 after switching schools i realise that he’s way behind other kids his age. Hence DO NOT WASTE YOUR TIME & MONEY AT THIS SCHOOL! They act like they are so full in the beginning, put you on waitlist and after a month call to offer you a branch of “their choice” stating theres no vacancy in the branch that you actually would like! Its all an act! My child's class hardly had 10-12 kids and kids were constantly leaving the school. WOULD NOT RECOMMEND THIS SCHOOL AT ALL! WASTE OF MY CHILD’S PRECIOUS 2 YEARS & LOADS OF $$$$!  Kind request to other parents too, if you could feedback on schools it will make decisions for other fellow parents easier",
      "time": 1739288804,
      "translated": false
    },
    {
      "author_name": "Rae Lu",
      "author_url": "https://www.google.com/maps/contrib/102976402020887940251/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKnFvcfb11ht3s9XmD1NobRd96ftc37y8KCxpNzOlGv6JvWhA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Nurturing and inclusive environment. Teachers are nice and friendly. Also loves their programs with so many fun activities that my kid has always enjoyed!",
      "time": 1711505549,
      "translated": false
    },
    {
      "author_name": "NIKKI TIAN",
      "author_url": "https://www.google.com/maps/contrib/114776863620573768720/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJhmzbNqpZpjX34GocLjU3mg585mH4AmbG6tViNRAshHPbyXQ=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "8 months ago",
      "text": "The school is fun , and my kid loves this school as the teachers are professional and  friendly , however , the school management , especially admin & communication channel are very messy and no improvement after parents feedback .",
      "time": 1726798962,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2506444292207386479",
  "user_ratings_total": 13,
  "vicinity": "855 Mountbatten Road"
}