{
  "formatted_address": "#02-06, Mapex, 37 Jln Pemimpin, Singapore 577177",
  "geometry": {
    "location": {
      "lat": 1.3484055,
      "lng": 103.8407604
    },
    "viewport": {
      "northeast": {
        "lat": 1.349851080291502,
        "lng": 103.8421952302915
      },
      "southwest": {
        "lat": 1.347153119708498,
        "lng": 103.8394972697085
      }
    }
  },
  "name": "Shepherd's Heart Student Care Centre",
  "place_id": "ChIJoQKi7j4X2jERr8JIHMlZ8u8",
  "rating": 3.8,
  "reviews": [
    {
      "author_name": "aldrich yeo",
      "author_url": "https://www.google.com/maps/contrib/110755931993756533277/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWyLvagpbsltdopdgNCkY_sSdO_q65-Laq-ryZA2suAeKg0vKU=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "\"The educational environment at Shepherd's Heart is exceptional, providing a holistic and enriching experience for students. The dedicated teaching staff not only excel in their subjects but also create a nurturing atmosphere for learning. The classrooms are vibrant and well-equipped, fostering an engaging learning environment.\n\nOne notable aspect is the commitment to cleanliness evident throughout the facility. The impeccably clean floors and hygienic food services prioritize the well-being of students. Additionally, the school maintains a strong focus on safety, implementing robust security measures and emergency protocols to ensure a secure environment.\n\nAcademic excellence is a cornerstone of Shepherd's Heart. The curriculum is thoughtfully designed to challenge and inspire students, and the institution has a commendable track record of academic achievement. The low teacher-student ratio allows for personalized attention, promoting individualized learning experiences.\n\nBeyond academics, Shepherd's Heart recognizes the importance of extracurricular activities in a child's development. The school offers a diverse range of extracurricular programs, encouraging students to explore their interests and talents. This commitment to a well-rounded education extends to the availability of excellent facilities, including libraries, laboratories, and cutting-edge technology.\n\nFurthermore, the school actively fosters a sense of community through effective communication channels. Regular updates and open lines of communication between teachers and parents contribute to a collaborative educational journey.\n\nIn summary, Shepherd's Heart stands out as a top choice for parents seeking an educational institution that prioritizes cleanliness, safety, academic excellence, and overall student well-being. The school's dedication to providing a comprehensive and supportive learning environment makes it an ideal place for children to thrive and grow.\" This place is a very good choice to send your child.",
      "time": 1705385597,
      "translated": false
    },
    {
      "author_name": "chantelle yeo",
      "author_url": "https://www.google.com/maps/contrib/101125571956355967230/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUvExGka7QCRp5ZQ7QsV9KyKdDhUW52YyUQXN3nzJ_iIDRjAM4=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "The term 'lovely' barely scratches the surface when describing Shepherd's Heart. The teachers here don't just impart knowledge; they create lasting connections with their students. Their passion for teaching is infectious, fostering an environment where learning becomes an exciting journey rather than a mere classroom routine.\n\nThe love and care extend beyond the classrooms to every aspect of the school. From the colorful and inviting decor to the well-maintained facilities, Shepherd's Heart is a place where attention to detail meets genuine affection. Clean, safe, and inspiring, the school sets the stage for an enriching educational experience.\n\nBut it's not just about the physical space; it's about the heartwarming atmosphere that envelops the entire institution. Shepherd's Heart is a community where every child is seen, heard, and valued. The love between teachers and students creates a supportive environment that encourages not only academic growth but also personal development.",
      "time": 1705386122,
      "translated": false
    },
    {
      "author_name": "Chantelle Yeo Yu Xuan (Kcpps)",
      "author_url": "https://www.google.com/maps/contrib/108161644768062896245/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK_ME758zMKA0GqcCws48IU53z-8oFrl21cutZPy8vmUBFfeA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Shepherd's Heart recognizes the importance of a balanced education that includes both academic and recreational activities. The emphasis on play is not just about having fun; it's a crucial component of cognitive and social development. The institution provides well-designed play areas where children can learn through play, fostering creativity, teamwork, and physical activity.",
      "time": 1705386029,
      "translated": false
    },
    {
      "author_name": "Chloe Lim",
      "author_url": "https://www.google.com/maps/contrib/106398694608553821055/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXrr6uf1FpRSMt2dR3TJwfgKFoeGlryzQeTefl-aMaBE-17el2C=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Been sending my kids there for a couple years now. They adopt a holistic approach to my kids' learning and really go above and beyond! Highly recommend.",
      "time": 1684136288,
      "translated": false
    },
    {
      "author_name": "Esther Chia",
      "author_url": "https://www.google.com/maps/contrib/116123891540762453494/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLlP_CSX10M6KgkdXFlIte2UyeeAE7uJo61wawmqsNZdXtwgw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Centre is clean and the staff are friendly. The teachers are very caring and do monitor my child’s homework.",
      "time": 1704545232,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17289980639726584495",
  "user_ratings_total": 10,
  "vicinity": "#02-06, Mapex, 37 Jalan Pemimpin, Singapore"
}