{
  "formatted_address": "39 Scotts Rd, Singapore 228230",
  "geometry": {
    "location": {
      "lat": 1.3118244,
      "lng": 103.8364761
    },
    "viewport": {
      "northeast": {
        "lat": 1.312922380291502,
        "lng": 103.8377443802915
      },
      "southwest": {
        "lat": 1.310224419708498,
        "lng": 103.8350464197085
      }
    }
  },
  "name": "Sheraton Towers Singapore",
  "place_id": "ChIJQeI7N-wZ2jERnpSwVQl2b00",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Juthaluck Yodwieng (Faye)",
      "author_url": "https://www.google.com/maps/contrib/105164146879015546003/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUvEU_MkPROkTW6A1h2RAiJvZBhQ9XM3jd-xMvsaF-4d0_AvWC_Yg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Was a short stay but it was nice.\nThumbs up to Housekeeping that keeps my room clean.\nThe room itself was nice. I booked the room with twin beds. Luckily I have got the corner room. Very quiet and private.\nI haven’t been to any facilities in the hotel. But I’m sure the staff would be attentive.\n\nGave 4 points to check in process. They charged my card and voided the amount for 3 times. No explanation of the facility in the hotel as well.\n\nOh! I ordered the chicken rice through in room dining and it was nice!! The quality is good. Tender chicken and perfect cooked rice. Got fruit platter for free along with the food as well!",
      "time": 1743444843,
      "translated": false
    },
    {
      "author_name": "Marcos O. Diogo",
      "author_url": "https://www.google.com/maps/contrib/113809644458768259113/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWiYIWq9T3_WO0_mPMb5d73CcD-i2S9rS0HZtqszYB_L90UBig=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "My wife and I had a great stay there, starting from a fast and seamless check in process followed by a complimentary upgrade due to status.\n\nUnfortunately Sheraton Trend is not to renovate its hotels therefore most of their locations felt outdated but this is not the case here, the hotel felt modern and in place, the pool, gym, lobby and overall felt modern\n\nSpecial mention to the lounge although I wasn’t able to take advance to the cocktail due to not being in the hotel ; the seating area is large and comfortable, refreshments are available 24h\n\nStaff was always on point and very professional.\n\nFast wifi and mixed breakfast with many options, the location is very convenient if you’re visiting the city since is 3min walk to the subway which could maje you reach Singapore downtown in 30min\n\n10/10",
      "time": 1747008049,
      "translated": false
    },
    {
      "author_name": "Christopher Lai",
      "author_url": "https://www.google.com/maps/contrib/103911031610319332396/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVcI213H4rWvF2uTAw560W6g8CmCdMpfvInibN13jYb3lXL94QpwQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "A decent five-star hotel with reasonable prices. The room was clean and quite spacious, while the breakfast offered lots of food choices that were tasty. However, since it is located within a business district, food options are rather limited. That said, Orchard Road and Chinatown are easily accessible by public transport, so it wouldn’t be too much of an issue.",
      "time": 1742553136,
      "translated": false
    },
    {
      "author_name": "Eric Cant",
      "author_url": "https://www.google.com/maps/contrib/107996174909627770891/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKKwYL92-iKmrY2WYqfAhqnksyG676hSAJRJl_0ZGsw_exzsA=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "The service from the front desk staff Vasu was unprofessional. Did not feel any warmth or friendliness and it seems he wasn't interested at all...\nThe service from the Executive lounge was miles better. You can see the genuine attitude and warmth from the staff in the lounge.\nRooms are dated and really in need of renovation. Bathroom is still using shower curtain. Carpet needs to be removed and the pillow had a bad smell due to the humidity.",
      "time": 1743913417,
      "translated": false
    },
    {
      "author_name": "saif alhammadi",
      "author_url": "https://www.google.com/maps/contrib/110639380386279926909/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLXOFfU4Cwke-zyfcI-le5nG4YZQaqX3_EqhW_Rl04q3vqkIQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We had a truly wonderful stay at the Sheraton Hotel. From the moment we arrived, the hospitality and service exceeded our expectations. The hotel was clean, elegant, and comfortable, making our entire experience incredibly relaxing.\n\nA special thank you goes to Angel and Zayn, who went above and beyond to make our stay memorable. Angel’s warm and welcoming attitude made us feel right at home, while Zayn was incredibly attentive, kind, and always ready to help with a smile. Their professionalism and genuine care for guests truly stood out.\n\nWe’re grateful for the exceptional service and look forward to staying here again. Highly recommended!",
      "time": 1743843189,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5579808245799752862",
  "user_ratings_total": 3079,
  "vicinity": "39 Scotts Road"
}