{
  "formatted_address": "65 Airport Blvd., Singapore 819663",
  "geometry": {
    "location": {
      "lat": 1.3555124,
      "lng": 103.9855924
    },
    "viewport": {
      "northeast": {
        "lat": 1.356476580291502,
        "lng": 103.9873080802915
      },
      "southwest": {
        "lat": 1.353778619708498,
        "lng": 103.9846101197085
      }
    }
  },
  "name": "SilverKris Lounge - Terminal 3",
  "place_id": "ChIJmSWWF4082jERIWnmIGTljBQ",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Shirin Montebare",
      "author_url": "https://www.google.com/maps/contrib/102580939645164539419/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXPq8t3s5m2x5HqNNx53OPVacn1yqJm16qdeEif1UGAzY6OUOQ-0A=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Dear Lord, this lounge was the greatest I’ve ever been to. The variety of food was amazing, and it was super clean. They also have showers and bathrooms, so you can freshen up and change your clothes. Since we were outside, we really needed a shower before getting on our plane, and I couldn’t believe how amazing the showers were in this lounge. We had such an incredible experience. I’ve never showered in a lounge before, and I’m glad my first experience was here. The food was all tasty, hot, and great. Definitely recommend this lounge!",
      "time": 1736806883,
      "translated": false
    },
    {
      "author_name": "Sameer Desai",
      "author_url": "https://www.google.com/maps/contrib/108318628916643608679/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWAceFUfrpPzhfZaUUBJEhZah64sK3VyqZkEmtDj78oyHHRc5zqcg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Fantastic lounge for Singapore Airlines Business class travellers.\n\nSprawling sitting area with a widespread F&B layout (including a bar). They have a sort of hidden away, sleeping pod section for 10-12 folks in one corner too. Besides this they have squeaky clean washrooms along with a shower facility for those who need it.\n\nWe stepped into the lounge around 2 PM for a 4 hour layover it was largely empty & kept getting fuller as the afternoon went by. Was 80-90% full by 5/5:30 PM when we left from there.\n\nTop notch facilities & strongly recommend experiencing the lounge if you're eligible & are able to spare the time.",
      "time": 1741963560,
      "translated": false
    },
    {
      "author_name": "Joshua Soo",
      "author_url": "https://www.google.com/maps/contrib/108503135376806338139/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIUfoMDTgCca9Ytxh0Bb1bZfEAGehqEH0MdvngfSFjvAsTKJg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Great selections of Singaporean, Western and Indian hot food options, salad, beverages. Love the food here compared to the Qantas First lounge in Sg. Highly recommend the Singapore laksa, prawns dumpling, lo mai kai and onde onde cake.\n\nThere are ample seatings with various seating options.\n\nHowever, the shower facilities seem limited and not as refined as Qantas First. It would be better if they also included Le Labo toiletries similar to their onboard amenity kit. :)",
      "time": 1743414115,
      "translated": false
    },
    {
      "author_name": "Marcos O. Diogo",
      "author_url": "https://www.google.com/maps/contrib/113809644458768259113/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWiYIWq9T3_WO0_mPMb5d73CcD-i2S9rS0HZtqszYB_L90UBig=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Absolutely spectacular lounge at the same level of its airline Singapore airlines, the details are very well taken care of one of the things I liked the most is how large the buffet area is\n\nMy wife and I got there 5h prior to our flight and after several hours exploring Singapore changi airport, the check in was quick\n\nThis is a business class lounge, the first class shares the same access. Also I believe there are more silver kris lounges across changi but if you have the opportunity to come to this one, do it, sleeping pods and capacity ( approx 1020 pax) is the key\n\nI could get to the sleep room but I got a comfortable seat myself and had a shower prior to the breakfast.\n\nThe breakfast was served 5am sharp and besides the large buffet there were also 4 refreshments and snacks stations across the lounge.\n\nI see no downsides here, the lounge could be far from the gates, indeed I had to change terminals, it took me no more than 10min using the after security train transfer, there’s 1 train every 2 min",
      "time": 1746915147,
      "translated": false
    },
    {
      "author_name": "Happy Bird",
      "author_url": "https://www.google.com/maps/contrib/108716533290322327726/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVFUYN1zBdnhezGS3qKnZtkHSHSiRCGdNoWqwtp1WX5jPujslv2=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Oh my goodness! This place is amazing! And enormous! There's a good reason why Changi airport and Singapore Airlines are ranked best in the world numerous times. Not only is the lounge incredible, the food is outstanding too! The are a few unique areas/zones in the lounge to suit any person or group needs.  There're even showers and a TV room just for kids. Simply incredible. Just this lounge alone makes flying SIA totally worth it. Will definitely be flying SQ business class  again soon just so I can visit this incredible lounge again.",
      "time": 1744755276,
      "translated": false
    }
  ],
  "types": [
    "night_club",
    "bar",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1480810595709511969",
  "user_ratings_total": 6264,
  "vicinity": "65 Airport Boulevard"
}