{
  "formatted_address": "439 Joo Chiat Rd, Singapore 427652",
  "geometry": {
    "location": {
      "lat": 1.3070632,
      "lng": 103.9043627
    },
    "viewport": {
      "northeast": {
        "lat": 1.308381230291502,
        "lng": 103.9056655802915
      },
      "southwest": {
        "lat": 1.305683269708498,
        "lng": 103.9029676197085
      }
    }
  },
  "name": "Sin Heng Claypot Bak Koot Teh",
  "place_id": "ChIJBw7Jy3IY2jERGn5LZ2j6O2s",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Zuriel Mamba",
      "author_url": "https://www.google.com/maps/contrib/100097027827819745483/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXjjbnbgtrpHKDsQ_m9uOBbcQW6_NM5DrNtFVcH68Q8o1UewEnX=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Spotted a queue here while we passed by the place searching for dinner. Decided to join the queue to try.\n\n2 types of bak kut teh (bkt) were sold here, we settled for the 'special' pot which was actually herbal bkt after checking with the staff. Ordered the claypot prawn vermicelli as well, as we were craving for prawns. Love how the vermicelli had soaked up all the prawn goodness. Klang style bkt was my preferred as compared to the teochew style. Besides pork ribs, we added offal to our bkt claypot. Pork liver was dry, ribs were tender though. The soup was savoury, herbal notes were presented however was mellow. Nevertheless It was enjoyable. Soup could be refill.",
      "time": 1742649452,
      "translated": false
    },
    {
      "author_name": "Sebastian Richard",
      "author_url": "https://www.google.com/maps/contrib/107352363332958754336/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIK_YajwCT9zLM1pe3vXNROqpdnhiibPPANSuQC08Z8Kg0Umw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "If you like herbal BKT, here’s the place for you and the meat was quite soft! Kang Kong was spicy enough. Sesame chicken was flavourful but the chicken portion was average and had bones, I felt more meat and less bones and skin would have made it better.",
      "time": 1742821218,
      "translated": false
    },
    {
      "author_name": "Karen Gads About",
      "author_url": "https://www.google.com/maps/contrib/113503192007654817905/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVkXw-3PJp4F15K6g2v9SUWUTMJgRuktDYTjG-ce1izYJYZWl1TgA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Walked past on a Wednesday evening and saw a queue. Being the Singaporean that I am, gotta try right! They were perpetually full house but service from queue to table to food serving was all very efficient, prompt and fast!\n\nI prefer this kind of herbal bkt (rather than the clear pepper soup kind), their soup is really hearty and homely. Love the old school vibe of the place, seems to have preserved all its old days vibes from the 70s/80s. An heritage and defo worth trying! We had a refill of soup (yes, free!) and slurped all our claypots clean!!\n\nOurs is the medium mixed bkt, comes with some organs. The other claypot is the small prawn vermicelli...both so good with youtiao!",
      "time": 1741784843,
      "translated": false
    },
    {
      "author_name": "Lim Jaspar",
      "author_url": "https://www.google.com/maps/contrib/115142463215299263560/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI_KtPou40NFMWkQuPWZD0m-vDfcA-peB3JXJYSfI_fgpo8qQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "Non aircon, coffeeshop fans. Spacious, airy enough. Food was only ok for the price. I ordered all small portions. You tiao is not inclusive and is paid, not crispy and passable when dipped in soup, and even then I still don’t want to waste my calories. Bak ku teh has two versions, pepper or herbal. I took herbal ($10), not much of a herbal taste to be honest. Meat slides off the bone easily. Soup also has mushrooms, baby corn, innards (I ask for dao ki instead), which is odd to me. Pork trotters ($7) soup is rather bland and watery. Collagen skin is fine. Nothing to shout about, I also didn’t finish. All in all, I had many better ones for this price.",
      "time": 1744702620,
      "translated": false
    },
    {
      "author_name": "kelvin goh (潇洒哥)",
      "author_url": "https://www.google.com/maps/contrib/106684983930626905310/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXyNhMh5e-vKLXx_0tvn9r9eZLI86_kRFLNRx08CUfjMDlaC_3r=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Sin Heng claypot Bak koot teh has open for many years\nThe soup is not herbal but peppery kick\nThey sell many type of local food\nPrice are reasonable\nParking is easy\nU can refill the soup if not enough\nDo try it if u are around Joo Chiat\n\nBak Kut Teh, meaning \"Meat Bone Tea\" in Hokkien, is a beloved Malaysian and Singaporean dish featuring tender pork ribs slow-cooked in a complex, aromatic broth infused with Chinese herbs and spices. The soup is deeply flavorful—savory, slightly sweet, and packed with warming notes of star anise, cinnamon, garlic, and dang gui (angelica root). Traditionally served with steamed rice, fried dough sticks (*youtiao*), and a side of dark soy sauce with chili, this comforting dish is often enjoyed for breakfast or as a nourishing meal any time of day.",
      "time": 1745635114,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7727044912000761370",
  "user_ratings_total": 1339,
  "vicinity": "439 Joo Chiat Road"
}