{
  "formatted_address": "20 Airport Blvd., Singapore 819659",
  "geometry": {
    "location": {
      "lat": 1.3414785,
      "lng": 103.9837718
    },
    "viewport": {
      "northeast": {
        "lat": 1.342855830291502,
        "lng": 103.9849648802915
      },
      "southwest": {
        "lat": 1.340157869708498,
        "lng": 103.9822669197085
      }
    }
  },
  "name": "Singapore Airport Terminal Services Workers Union",
  "place_id": "ChIJ____T4082jERDdgH2omRLz4",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Ricky M",
      "author_url": "https://www.google.com/maps/contrib/114725076752392236909/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWEpptThZY5myIUJi3Z-CWsV44SAabXIF-SAA9ThwBs5_OnvkGH=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I had a layover for 8 hours and it was not enough that’s how big and nice the airport is! So much to see and do. I feel like every single thing that I need was in this beautiful airport Food, shopping and entertainment!! This is a well thought out airport very beautiful and very clean.This is definitely one if not the best airport in the world.",
      "time": 1694199206,
      "translated": false
    },
    {
      "author_name": "Kristy Christy",
      "author_url": "https://www.google.com/maps/contrib/109425545174528688995/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX70uwEtjwgDfiD4vJpaHjC0UsXZo0Z_Cfyn7Yzvw4w5S9owUrbJw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "Hi SATS, if you’re going to hire a foreigner, at the very least, ensure they’re properly trained in basic customer respect. The lady at your counter was extremely rude, treating us as if we were criminals rather than travelers. Her attitude was unacceptable—nowhere near what should be expected at a check-in counter. We’re here to travel in good spirits, not to be disrespected or made to feel uncomfortable. Please make sure she receives proper training before placing her back at the front desk to deal with your customers or passengers again.",
      "time": 1731041875,
      "translated": false
    },
    {
      "author_name": "Amber Leffers",
      "author_url": "https://www.google.com/maps/contrib/114178302746415878688/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXbunRKeax6jxajFEwK24HZlI6CV-tYiJibWJ5cbjSHm_5G6kaA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "What an airport! This has everything to keep you busy during any long layover! Food, theatre’s, butterfly gardens , cactus gardens. Sunflower gardens, a gym, a place to sleep! And of course plenty of places to do shopping! They even have a train that takes you from each terminal!",
      "time": 1670493209,
      "translated": false
    },
    {
      "author_name": "Rajkumar Aravindan",
      "author_url": "https://www.google.com/maps/contrib/100231605714182541782/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVuslQ8Qlvk6lnssaQDyf9_mxC2L0Ek7abWG9rQT8uvSFz_xQnExw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Singapore Changi Airport is one of the world's leading international airports. It is an aviation hub for Southeast Asia, having quickly developed into one of the most important air transport hubs in the world.\n\nThe airport is part of the Changi Airport Group, which is responsible for the operation and maintenance of the airport facility, along with ensuring the smooth movement of passengers and cargo between various locations.\n\nThe grounds of Singapore Changi Airport are spacious, providing ample access to the various terminals. With over 100 airlines and some 245 destinations worldwide, travelers from more than 35 countries have the opportunity to land and enjoy their stay at the airport. The terminals are equipped with the latest in technological advancements and have been designed to ensure an organized and efficient flow of passengers and aircrafts.\n\nThe passenger experience at Singapore Changi Airport is both safe and pleasant. Passengers can look forward to a variety of facilities, such as free Wi-Fi hot spots, medical care, shopping outlets, ATMs, and lounges. All the facilities and amenities are designed to ensure that the passengers have an enjoyable and hassle-free travel experience.\n\nThe Singapore Changi Airport is also known for its customer service. There are friendly staff at every corner of the airport to help guests with their queries and make their time at the airport smoother and simpler.\n\nSingapore Changi Airport has been consistently ranking among the top airports worldwide. The airport is setting the bar for customer satisfaction and innovation. With its award-winning services and modern infrastructure, it is no wonder why Singapore Changi Airport continues to be one of the most preferred and admired airports in the world.",
      "time": 1688808425,
      "translated": false
    },
    {
      "author_name": "R K",
      "author_url": "https://www.google.com/maps/contrib/117211011746042070104/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocImjIPFx-uzwOqAzsRliHvNyH7-taXfluMos3VmMD4NzPq4KgU=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Singapore airport or Changi airport is one of the favorite airports of my travel list, self check in to the airport and quick customs and immigration clearance is one of the best things. various nationalities cuisine makes this place a more favourite place of mine.",
      "time": 1672463528,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4480960175511427085",
  "user_ratings_total": 300,
  "vicinity": "20 Airport Boulevard"
}