{
  "formatted_address": "3 Mount Elizabeth, #15-03, Singapore 228510",
  "geometry": {
    "location": {
      "lat": 1.3045739,
      "lng": 103.835553
    },
    "viewport": {
      "northeast": {
        "lat": 1.305771880291502,
        "lng": 103.8367048302915
      },
      "southwest": {
        "lat": 1.303073919708498,
        "lng": 103.8340068697085
      }
    }
  },
  "name": "Singapore Brain and Spine Specialist Singapore Brain-Spine-Nerves Center",
  "place_id": "ChIJEW8RUpIZ2jER4BbR9txZ-I4",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Liza Hee",
      "author_url": "https://www.google.com/maps/contrib/114704896926340100775/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIhK2kdjzNnZpQmFsePLhEIECeEhf8qF-Eu--z8Aq2j1FVLbQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I had my Discoplasty procedure done by Dr Prem Pillay in July 2024. Before that, I was suffering from sciatica pain for more than 2 years. My colleague referred me to Dr Pillay as he had the same procedure done a few years ago, and has been relieved from his back pain since. I’m so glad I consulted Dr Pillay and had the procedure done. Dr Pillay and his team, including staff from his clinic (Joyce, Vanessa and Dashini, etc.) have been most professional and caring. Dr Pillay had sent me for physiotherapy too, including aquaphysio, which helped me in my recovery process tremendously. Although I’m still going for physiotherapy and may have to continue to do so for at least the next couple of months, I’m confident that I can look forward to pain-free days ahead!",
      "time": 1741148410,
      "translated": false
    },
    {
      "author_name": "Marc Chiang",
      "author_url": "https://www.google.com/maps/contrib/111097457251677107755/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKgnKyRA3n5zA_x7vEmdpxEdhStViQOLVAQbTN8D6uMeIFBhQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Dr Pillay is very good in his profession and sincere. His staff are very friendly and helpful.",
      "time": 1741059333,
      "translated": false
    },
    {
      "author_name": "Koyie Wong",
      "author_url": "https://www.google.com/maps/contrib/101687285603624240487/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV0MKVO9keTsnFsfdn0yHgdeIX3ra-vSjOQNrD-9G0RdEX3yKiT=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Dear Dr. Prem Pillay,\n\nI am writing to express my sincere gratitude for the exceptional care you provided me in 2022. Your expertise and compassion were instrumental in my recovery, and I am eternally grateful for your guidance and support.\n\nI will never forget the day I was admitted to the A&E and faced the daunting possibility of paralysis. Your diagnosis and immediate action gave me hope and renewed my determination to fight through this challenging period. The discoplasty procedures on my neck and lower back were a significant undertaking, but your skill and precision made all the difference.\n\nThroughout my recovery, I was fortunate to have the unwavering support of your team, both in the hospital and at the Camden Physiotherapy Center. Their expertise and dedication were invaluable in helping me regain my strength and mobility.\n\nWhile 2022 was a year of both physical and emotional trials, it also taught me valuable lessons about resilience and the power of faith. I am truly blessed to have had the opportunity to be cared for with such a remarkable doctor and his team.\n\nEven though you advised me against running, I was overjoyed to complete the 5.6km JP Morgan run this year. This accomplishment is a testament to your exceptional care and the progress I have made.\n\nI am deeply grateful to God, my friends, family, and the wonderful team who made my recovery possible. Your compassion and dedication have made a profound impact on my life, and I will forever be thankful for your care.\n\nThank you again for everything, Dr. Prem.\n\nSincerely,\nKoyie",
      "time": 1728634498,
      "translated": false
    },
    {
      "author_name": "Chi U",
      "author_url": "https://www.google.com/maps/contrib/115444791617260519983/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXYHeLuJmbda77BS58lY5OhBjk3yw4qOy3H-h2I04E8ow8AwO0I=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "I went to see Dr. Pillay due to neck and arm pain. I was recommend to see Dr. Pillay by my  local friend.\nThe doctor understands patients condition as well as feeling and takes a necessary action.\nMy condition is getting better by the doctor advise.\nMuch appreciated.",
      "time": 1729239684,
      "translated": false
    },
    {
      "author_name": "Aroon Tan",
      "author_url": "https://www.google.com/maps/contrib/104424838371451710957/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVQhiqgpwFRIUXtmacZvnLXybx_Auo4HiE1gVA-ltyvSsG25v4=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I was fortunate to be referred to Dr. Pillay in April 2023 for persistent lower back pain and leg numbness. Dr. Pillay, a highly skilled and knowledgeable neurosurgeon, recommended a Lumbar Spine Microdisectomy for my condition. Throughout the past year, Dr. Pillay and his compassionate professional staff have ensured that I receive excellent care. I am pleased to report that I am continuously improving and am looking forward to maintaining a healthy spine under his long-term care.",
      "time": 1713406456,
      "translated": false
    }
  ],
  "types": [
    "physiotherapist",
    "hospital",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10302082953178584800",
  "user_ratings_total": 104,
  "vicinity": "3 Mount Elizabeth, #15-03"
}