{
  "formatted_address": "Outram Rd, Singapore 169608",
  "geometry": {
    "location": {
      "lat": 1.279677,
      "lng": 103.835984
    },
    "viewport": {
      "northeast": {
        "lat": 1.28536995,
        "lng": 103.8419793
      },
      "southwest": {
        "lat": 1.27514135,
        "lng": 103.8280189
      }
    }
  },
  "name": "Singapore General Hospital",
  "place_id": "ChIJ1WxMlW8Z2jERlkpUYbEJYFw",
  "rating": 3.4,
  "reviews": [
    {
      "author_name": "Gloria Lim",
      "author_url": "https://www.google.com/maps/contrib/116157737042856582486/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLxVdZMl1qIgJ-edDbfdjqYKNxpecejVbf1B993Qelzeb_FzQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "Stupidest hospital. the provide a QR code for 'faster' registration for visitors. But despite multiple tries, it shows us a webpage that it might not be safe. Shy bother putting up all these things but have none of them work?! It's pathetic for Singapore's known efficiency. The online self registration iPad available also DOES NOT WORK. Seriously. And during visitation hours, they only have two counter open for manual registration. Ridiculous.",
      "time": 1733979099,
      "translated": false
    },
    {
      "author_name": "HC Lim",
      "author_url": "https://www.google.com/maps/contrib/108605102198783139350/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLiaFPcG-FxEmdVWmFHpTqe8hfZJb6Ypw7shgbW7wDSvQrT-w=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "I would like to share an unpleasant  experience I had with the SGH  orthopedic specialist clinic.\n\nThe consultation with a Dr Tan SM was over in less than 2 minutes. After I pointed out the painful area in my foot, the doc immediately asked me to get  an x-ray and MRI first, and to arrange for another appointment to review the results.\n\nAs this was my  first appointment with the doc, I was surprised that there was no attempt to examine my foot at all. I proceeded with the x-ray that day and later decided not to do the MRI due to the high cost.\n\nI also wrote to SGH to request for a waiver of the consultation fee as I felt that the doc did not do his job. The reply I got from SGH was shocking to say the least. It claimed that the doc had examined my foot and shared  the x-ray results with me during the consultation. I disputed the claim and pointed out that it would not be possible for the doc to discuss the x-ray results during the consultation as my x-ray was taken after the consultation.\n\nAfter this terrible episode, I asked to see another specialist but was told that I would be charged as a private patient. As a last resort, I  requested for the x-ray record so that I can seek medical advice elsewhere, I was told I have to pay an admin fee for the record even though I had paid for the x-ray. Whereas, the chest x-ray my mum paid for at a polyclinic comes with a report and the x-ray film.",
      "time": 1746684425,
      "translated": false
    },
    {
      "author_name": "World 360 degree",
      "author_url": "https://www.google.com/maps/contrib/116975875492876627983/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUz8QZKXaQubqsj7Vw2NG7BzhQ_cEfoRvSrjOwnxC5BGmvzzBZJ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "10 months ago",
      "text": "My father has admitted to this hospital. He has blood cancer. The behaviour of doctors is really good. They listen from patients with patience. But the behaviour of nurses need to be improved.\n\nThe most important thing is the treatment cost is a little bit cheaper than any other hospital in Singapore.",
      "time": 1721258408,
      "translated": false
    },
    {
      "author_name": "Iphiginia Nai",
      "author_url": "https://www.google.com/maps/contrib/114217055050674758960/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU5aqjpU3xWJF_IFsovzG2JxTG75DXY5Dq7xSXc18aFi4Dthmq8hg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "Terrible medication top up system! I have been trying to top up my grandmother’s medication since 3 weeks ago, soon to be 4 weeks. I understand that the patient associates (the staff that pick up our calls) have been trying to help. But it seems like the clinic itself (Clinic H -  Orthopaedic Sports & Joint Centre) hasn’t been responsive and responsible enough to follow up my request. SGH website mentioned medicine top up should be made 1 week before patient runs out of medication. But I have been making calls on this since 3 weeks ago. This is too much. It has been 3-4 weeks. Clinic H -  Orthopaedic Sports & Joint Centre, your executive / admin needs to do a better job than this.",
      "time": 1745842097,
      "translated": false
    },
    {
      "author_name": "Alice Teo",
      "author_url": "https://www.google.com/maps/contrib/111354026295811440454/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWfn3dLDDGmDO-FLA07iuOMdGM43aY8uQ-9jEEIwud78175Q3Wf=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I would like to express my deepest gratitude to all the management and staff of SGH for the care and support I received during my treatment.\n\nA special thank you goes to Assoc Prof Chan Weng Hoong for his unwavering confidence and professionalism throughout this journey. I was extremely fearful and even considered backing out multiple times, but his calm assurance gave me the strength to carry on.\n\nI’m also very thankful to the young, handsome surgeon and the kind and pretty doctor assisting Prof Chan, who administered the local anesthesia before treating my infected wound. Their patience and gentle manner made the experience far less painful and much more bearable. I truly appreciate the way they handled everything with such care and empathy.\n\nIn contrast, I had a rather unpleasant encounter in the A&E department where a doctor insisted on proceeding without anesthesia, claiming it wouldn’t work on infected wounds. When I refused, he threw the scalpel on the table and walked off. Strangely, he returned hours later and even asked if the anesthesia worked—leaving me quite stunned by the lack of consistency in his approach.\n\nMy heartfelt thanks also go to Staff Nurse Loh Hui Tian in the high dependency ward. Despite her heavy workload, she remained friendly and attentive, always remembering and responding to patients’ needs.\n\nAnd most of all, I want to express my deepest appreciation to the ever-lovely Nurse Angelina. She took care of my wound dressings—a process that was extremely painful and terrifying for me. Despite my screams, she never once lost her patience. Instead, she comforted me with jokes, gentle conversation, and even calming music. Beyond her duties, she continued to check in on me through WhatsApp, responding even on her off days and public holidays. Her support—both physical and emotional—meant the world to me.\n\nLastly, I want to commend SGH for their compassion towards elderly patients. Unlike some places that dismiss the elderly by saying there’s little that can be done, SGH genuinely puts in the effort to treat them with dignity and respect. I saw this firsthand and it truly touched me, especially after what my 90-year-old grandmother experienced at another hospital.\n\nA big shout-out to all the staff and management at SGH—thank you, from the bottom of my heart. Your kindness and dedication have made all the difference.",
      "time": 1744515655,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6656330906700368534",
  "user_ratings_total": 608,
  "vicinity": "Outram Road"
}