{
  "formatted_address": "320 Orchard Rd, Singapore 238865",
  "geometry": {
    "location": {
      "lat": 1.3052151,
      "lng": 103.8329675
    },
    "viewport": {
      "northeast": {
        "lat": 1.306423380291502,
        "lng": 103.8340326802915
      },
      "southwest": {
        "lat": 1.303725419708498,
        "lng": 103.8313347197085
      }
    }
  },
  "name": "Singapore Marriott Tang Plaza Hotel",
  "place_id": "ChIJ7zeih40Z2jERst1twFSmrzc",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "The Maven",
      "author_url": "https://www.google.com/maps/contrib/116461366908429019678/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVnjdN19zKaqTWJ0_712hchuqAJ0FeeC_GhrRQGkRX_rJP9zIo=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "The room was very spacious, and there is a nice front porch area with the jacuzzi. Staff were welcoming and service was good.\n\nHowever, the jacuzzi was dirty with black and white particles floating around in the water, as if it was not cleaned properly at all. The kettle become faulty in the middle of the night and I couldn’t use it, had to plug in and out a few times for it to work. In the lounge, they forgot my drink order as well.\n\nOther than these things, the stay was good overall. It’s not a bad option for those that want a luxurious getaway for a day.",
      "time": 1746950931,
      "translated": false
    },
    {
      "author_name": "Kevin Sha",
      "author_url": "https://www.google.com/maps/contrib/102335538240299120662/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXbLmqHo1XaogEru6xIBiYeppz9fdgWi9_-vrVYGVQ6lLqupOD9=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Very bad experience in this Marriott hotel.\n\nI basically booked 3 rooms for 4 nights, travelled together with my whole family, a 1 year old baby girl, my parent and in-law parent, so total 12 nights. Also I am with Platinum Elite member.\n\nWhen I checked in, I told them that I have a baby girl with me, if have a spare bigger room pls upgrade for me, I don't need 3 rooms to be upgraded together, just one room upgrade, even for one or two nights, they tell me no.\n\nTwo days later, I asked again in executive lounge, staff is nicer there and tell me they can upgrade for me the next day for future two days as some rooms will be released. Thanks to that staff, very kind and respectful.\n\nThen what happened is the next day when I ask for the upgrade execution, a different staff seems have no clue on this, I basically have to repeat everything again.\n\nFinally got upgraded, checked in the room and called service line to arrange a baby cot and baby bath,  told me yes and all good on the phone, then waited for one day (more than 24 hours), these facilities for baby still not sent into my room.\n\nMore weird, when I checked in the new room, I saw 3 slippers in the waredore,  I used one, then I went out for dinner with my family for around 2 hours. After dinner, went back to the room, apparently some staff made the night bed for us, but the rest two slippers are gone!!!! My wife have no slipper to wear!!!\n\nI couldn't figure out how the two slippers are gone till now, very very strange, combining the baby cot and baby bath situation, the only explanation is - maybe they think upgraded guest don't deserve services at all???\n\nIt's awful as this is my first big family trip to Singapore, no brain at all.\n\nConclusion, I didn't try other Marriott in Singapore yet, but at least Marriott Tang is disappointing so far.",
      "time": 1743247698,
      "translated": false
    },
    {
      "author_name": "Kevin Miller",
      "author_url": "https://www.google.com/maps/contrib/101460333709325361943/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWsYDECJyaN27TI6Gzh18eQBVsI3tADjTnDyFzM4UrK2MsaSgIY0w=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Great hotel in the heart of the shopping district! Easily walkable to shopping galore and a very short transit or Grab ride to other attractions. The elevators were under service during the stay which made having a room in a high floor a challenge. Great service. Visit the Speakeasy when there!",
      "time": 1744941684,
      "translated": false
    },
    {
      "author_name": "Cyn Dee Too",
      "author_url": "https://www.google.com/maps/contrib/111779233135777656289/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIGsyAe_h1-0QT4mTZ2nscE2D6NpH5WJkXXETY9m7SjyIV1n6k=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Stayed here for 30days for work. Great location, right at Orchard MRT station. Have to thank Shane at front desk for allocating me a fantastic room- my window faces ION orchard so the view is fantastic esp at night!! Housekeeping staff are great- everyday I have 6 water bottles, 3 bath towels, 3 hand towels and 3 face towels!! Never had to ask for more water or towels!! The bed is super comfortable and the room is quiet. You can hear the neighbours door closing, but most hotels have that problem.\n\nFacilities also great. Nice big pool, ample chairs, towels and water. Gym was great- lots of machines, towel and water ;) Sauna inside the gym bathroom. There’s a spa but I didn’t use it\n\nthe only two issues I would have are probably the breakfast and the lifts. If the breakfast queue is long, it will take some time to get a table. There’s only one person who’s getting your room number and that same person takes you to your table. It would be better to have two or three, that way the queue could move faster. Food spread is great. Try the Singapore Laksa!\n\nMany reviews about the lifts. Yes it is slow, but to be fair there was only ONE time I had to wait for 3 lifts before I could squeeze into one to go down. Most times it was alright. There are 30 floors, I stayed on the 10th which was good enough. Currently they are renovating one of the 4 lifts.\n\nAll in all, a very pleasant stay. Would suggest to management to change a few things: Add a water filtration system in each room, minimise use of single plastic bottles. Have a QR for laundry/ room service/ extra amenities rather than having to call each time.",
      "time": 1746802790,
      "translated": false
    },
    {
      "author_name": "Jeffrey Schaffel",
      "author_url": "https://www.google.com/maps/contrib/113676184071099122961/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKmX9zH0bSD7btmjjsm7SUtrwbaM-YQs7K4E9hhNlBglfg9HQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Wonderful hotel on orchard road.  Great location for shopping.   Hotel is sparkling clean and staff are all professional.   Many food options and the breakfast buffet is excellent.   Rooms are spacious and quiet.   A perfect choice for an  accommodation in this area of the city.  Highly recommend the Tang Marriott when visiting Singapore.",
      "time": 1735783851,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4012608675946290610",
  "user_ratings_total": 3430,
  "vicinity": "320 Orchard Road"
}