{
  "formatted_address": "39 Keppel Rd, #01-02, Singapore 089065",
  "geometry": {
    "location": {
      "lat": 1.2719533,
      "lng": 103.836752
    },
    "viewport": {
      "northeast": {
        "lat": 1.273214580291502,
        "lng": 103.8380400302915
      },
      "southwest": {
        "lat": 1.270516619708498,
        "lng": 103.8353420697085
      }
    }
  },
  "name": "Singapore Art Museum at Tanjong Pagar Distripark",
  "place_id": "ChIJPS0vSwsZ2jERulqTcd4CFDA",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Graham Rodda",
      "author_url": "https://www.google.com/maps/contrib/108084311827510380964/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVT-IlZ93WXMed100Ts30adm5jrycrwvYWzr5dk9hM3CIdRzftS=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Wow, what a wonderful gallery. When we visited there was a combination of art from the permanent collection as well as some amazing temporary shows. Staff welcoming and helpful. Food vending machines available. A must visit for anyone who is interested in contemporary art. We caught the bus which was very convenient - if coming from Civic keep walking once you get off the bus, and then go through the pedestrian gate - once through the gate the sign posting improves.",
      "time": 1740659303,
      "translated": false
    },
    {
      "author_name": "vipul khosla",
      "author_url": "https://www.google.com/maps/contrib/104005715624851283091/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUquoFjNNdwcXR6vQVS8mSx8tSqRL6EIW4p7ao5-gv33GQFqH-N=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Singapore art museum is built in an interesting space in high ceilings abandoned warehouse like structure which itself gives it some character.\n\nI enjoyed my visit to the art museum. The layout of the galleries is interesting and the space allows for contemplation and absorption in some intriguing artworks. In some ways it also embodies a modern evolving Asian spirit.\n\nTwo tips that I would like to share:\n\n💡 I spent a lot of time trying to find my way to the museum. This was a real pain and took away from the overall museum experience. Best route is to get to harborfront station and then take a bus to the museum premises (opposite an abandoned old railway station or something)\n\n💡 The main gallery and building with the ticket counter is easy to navigate. But the galleries in the other adjacent buildings feel like a maze. Best to check at reception and get some clear understanding of the layout of the space.\n\n💡 The reception/ ticket counter staff are helpful so do not hesitate to get their guidance.",
      "time": 1738856143,
      "translated": false
    },
    {
      "author_name": "Aiden Nguyen",
      "author_url": "https://www.google.com/maps/contrib/113471153164084845113/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVa3iyUDDv2oZgFuEL1TQ3OnTJ59F0jrv8JZAU2III7QClbQsywZg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Visited here on July 2023. The exhibitions were incredible, and I could have easily spent an entire day here. Can't wait to come back and see what surprises me next!",
      "time": 1736562390,
      "translated": false
    },
    {
      "author_name": "Kornpath P.",
      "author_url": "https://www.google.com/maps/contrib/118130492280975372663/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXbAk9uE67l-AhL2--ex-ZycsIZVl585B6JC1DEwyaKxjqzO0I=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "An impressive visit during Singapore Art Week. The museum's curation is particularly intelligent and thoughtful, especially in their showcase of Thai artists. The selected works demonstrate great curatorial vision in identifying and presenting compelling contemporary art from the region. It was fascinating to see how they highlighted Thai artistic talent through thought-provoking exhibitions. The museum's commitment to showcasing Southeast Asian art makes it a must-visit cultural destination. The space itself complements the artworks beautifully.",
      "time": 1739029110,
      "translated": false
    },
    {
      "author_name": "Miles Macdonald",
      "author_url": "https://www.google.com/maps/contrib/112943810663501022344/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWUreqygWmoaNnd-pMws4f1HIA2GWx1UiIvv6-ESyWu2V93oTlvYg=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "I love modern art galleries. I find there's always something there to appreciate. Some exhibits are just beautiful to look at without requiring any deeper understanding of the artwork, whilst others require a cognitive engagement to understand the message the installation/exhibit is designed to create.\nThe exhibitions here incorporate both aspects. I loved the beautiful digital collages of Yee I-Lann whilst also appreciating the somewhat sad message created by Khvay Samnang in his videos about the forced resettlement of communities in Phnom Penh as a result of the illegal sale of lakes by the state to private investors.\nJust two examples from these exhibitions, but there's far more here. Just go visit and find those things that interest you.",
      "time": 1738105747,
      "translated": false
    }
  ],
  "types": [
    "tourist_attraction",
    "museum",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3464397167766231738",
  "user_ratings_total": 692,
  "vicinity": "39 Keppel Road, #01-02, Singapore"
}