{
  "formatted_address": "5 Stadium Walk, #04-01, Singapore 397693",
  "geometry": {
    "location": {
      "lat": 1.3021918,
      "lng": 103.876502
    },
    "viewport": {
      "northeast": {
        "lat": 1.303405080291502,
        "lng": 103.8779239302915
      },
      "southwest": {
        "lat": 1.300707119708498,
        "lng": 103.8752259697085
      }
    }
  },
  "name": "Singapore Ballet Academy",
  "place_id": "ChIJK9ZsQgQEBBARVqAP6W1BjAU",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Georgina",
      "author_url": "https://www.google.com/maps/contrib/116426046039396662875/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLoN9DK840r5iyaKYcDRXy1rn583QUJTO1uJZ-JIIyAjwIaqA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Both my girls have been with SBA for over a decade. Our experience with the school had exceeded our expectations.\nWhile my 1st impression of the school wasn’t great(find the school generally quite stuck up), my views changed when we started to know the teachers & staff better.  Yes, it wasn’t all rosy initially.  My girls wanted to quit at some point but I’m glad we hang on.\n\nAt a lower grade(pre-pri grade), my younger gal had changed a few teachers.  But as she moved up the grade, teachers were more or less the same.  While my eldest gal started at an older age, both girls were blessed to have been taught by many great teachers.\n\nMs Nicole is so creative in her contemporary choreo, she inspires🤩\nMs Huang’s class was never dull, girls always come out smiling😄.\nMs Kwok, a versatile dancer herself never fails to give the girls correction👍🏻(she’s no longer teaching)\nMs Lee (with her for the longest time), a professional dancer previously, always give good tips and truly cares for the girls🥰.\nMs Ong is very nurturing, constantly looking out for the girls. She even offer advice to the older girls if they choose to embark on a dance career.  She also took care of the girls’ competition leotards 💕\nNot to forget Mr Han (IMO master of master in ballet industry) with his no nonsense face, he instill strict discipline & gives quality teaching to the YG class👏🏼👏🏼👏🏼.  Our girls are so fortunate that they don’t have to fly overseas to attend his masterclass. 🥳\n\nThe amazing part of this school is even the admin staff are excellent.  Can see the hardwork of the back end staff, especially Joseph.  Since he came onboard, we parents really felt the admin staff had done an excellent job. Even outsiders gave compliments when they signed up for SBA’s annual masterclass. Under his wing, the admin team is doing such a great job that the girls can just concentrate on their training.\n\nThis is 1 school I highly recommend & if the girls stayed long enough, you will know why.",
      "time": 1689919449,
      "translated": false
    },
    {
      "author_name": "Jade Fry",
      "author_url": "https://www.google.com/maps/contrib/100216238110347494153/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI2ThEAcM8_G9CREXt7tNUzksUDjuuzrVy2Z7LxZM3m46YzuQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "6 years ago",
      "text": "I happened to chance here and i think i should give my views to give a real picture from my DD's exp, my DD attended classes here before switching to another sch, I find the method and comments to the students not very suitable as a ballet instructor. Only those who tripod the instructors gets favoured & even when my DD was in the sch youth performing grp teach by the principal, she was critically put down and she was expected to be good in pointe when she is only Grade 4  and 10 yrs old in YPG. In her new ballet sch now, the teachers are very good & she is happy in the new ballet school & winning comps & enjoying herself. The reason why this oldest sch is so backdated now is the way they treat the students and parents with disrespect.  My DD's 6 friends also left the school evantually one by one & so sad it was so much better when the previous principal was around.   Fyi, reviews given by a specific group of students and the teacher DD and the shop assistants  are dishonest ratings to boost ratings & these reviews given to push up poor ratings is a big shameful thing as this is very misleading to consumers like us. My best decision is to pull my DD out of this place end of last year. Reconsider the sch before enrolling and the fees keeps increasing too! There are many better schools out there with better timings. My review is a honest consumer rating whose DD attended the school till a year ++ after the good previous principal left.  This rating is left as seeing unfair reviews to mislead consumers.",
      "time": 1535196792,
      "translated": false
    },
    {
      "author_name": "Sunny Heng Zhi Qiang",
      "author_url": "https://www.google.com/maps/contrib/108993578064514596247/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI67q4dzmhUtQMMkOTRSpByB5ca1SaygeFm1lJ2Glf-pY88_Q=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 years ago",
      "text": "proud teachers and demeaning to the kids, notably a lot of favouritism going on in classes and left out kids. too many eager to please and curry favour parents. not a healthy environment from holistic and constructive learning. not recommended after hanging around the sitting area speaking to other parents who shared these feedback, heading to another sch with my $.",
      "time": 1596520714,
      "translated": false
    },
    {
      "author_name": "wang su",
      "author_url": "https://www.google.com/maps/contrib/113662162291002742786/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocILvW5C4ZR8g97QJAltwnXhujDAmaVG5iwUR6T9ecKjy_GP2Q=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "6 years ago",
      "text": "Extremely arrogant school,with very unfriendly and unattentive admin staff, they will ruin off your day.\nUnlike other schools,You won’t hear from them after their so call, trial lesson. guess this might because of  the new student is not welcome there or they simply does not want any new student to join at all?\nAnyway, There are plenty quality ballet school with positive teaching spirit out there,why you want to pay for something that not worth for the money?",
      "time": 1536933462,
      "translated": false
    },
    {
      "author_name": "Noelle Leong",
      "author_url": "https://www.google.com/maps/contrib/106820899427167065686/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXu3uYFda5elaIfuJNsQsAXmTls86b92VC95SPI3t_6I1CLoZYBJQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 years ago",
      "text": "The performance was simply extraordinary! Such talent performers send your children here for quality ballet education",
      "time": 1534390936,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=399766407246487638",
  "user_ratings_total": 41,
  "vicinity": "5 Stadium Walk, #04-01"
}