{
  "formatted_address": "11 Tampines Street 32, Tampines Mart, Singapore 529287",
  "geometry": {
    "location": {
      "lat": 1.3544353,
      "lng": 103.9600809
    },
    "viewport": {
      "northeast": {
        "lat": 1.355924830291502,
        "lng": 103.9617692302915
      },
      "southwest": {
        "lat": 1.353226869708498,
        "lng": 103.9590712697085
      }
    }
  },
  "name": "Sing Swee Kee",
  "place_id": "ChIJt3GpNQA92jERwM1F4kS6gCY",
  "rating": 1.7,
  "reviews": [
    {
      "author_name": "Priyanka Naidu",
      "author_url": "https://www.google.com/maps/contrib/109877699679834604379/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWH1_tRfSQ8Cii88afxSEu88O-ScW8TaiXPs6FBYEfT3a90dXE=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Absolutely ridiculous. Paid $13 dollars for grab food and requested for boneless meat. All I see is bones. Don’t you not read the request I put in? This is not the first time. In fact all 3 times I’ve placed orders across this and last year, you’ve not taken into the note I put in. $13 for one plate of chicken rice, the least you could do is read the note we put in. If I could give zero stars I would. The food ain’t that great either. Rice is dry. Soup is sweet? Why is a chicken soup sweet? And the vegetable seemed like they were just simply boiled and tossed into oyster sauce. Will not be ordering it again!",
      "time": 1742804048,
      "translated": false
    },
    {
      "author_name": "Klennie Lee",
      "author_url": "https://www.google.com/maps/contrib/102638827817485043046/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUmmxrBpRByrQPAH-Et2tMs4eMSvzhOsuIPYtqKq2PVDCwyq3KR=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "2 months ago",
      "text": "Add on extra meat (requested no chicken wing): $7.60. Steamed chicken overall was soft tender but abit dry (just to compare: no where near Tian Tian that tender juicy). Rice was little hard for my personal liking. Chili was watery and lack of “kick”. Soup just barely nothing else unlike novena foodcourt has some radish in the soup .\n\nTo be fair, I asked for no sauces thus the picture looks so bland ya.",
      "time": 1740204058,
      "translated": false
    },
    {
      "author_name": "ET Home",
      "author_url": "https://www.google.com/maps/contrib/102578398032035454582/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXMafW-_LESbX41tckC9OFdV7QioxPf9yWzSOJAKIzT4LjhRV-U=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "9 months ago",
      "text": "The chicken is too skinny to be served. The innate tastes like overnight leftovers. The piping hot soup is blend so make sure you have enough chilli and black sauce over it. The rice is below average for locals expectations. If you are foreigners, you may find it good because you have yet to to taste the real locals favorite. The steam and roasted chicken need a lot of improvement if you have operated for donkey years in Singapore.\n\nThe rice ball is not firm enough, if you choose to take away, I suggest you should choose normal rice because they make the rice ball out of the same rice but at a higher price.\n\nAnd funny thing is, even I order take away without cucumber, after 30 minutes, the whole packet of chicken smell awful.\n\nThe so called chicken chop taste like overnight leftover and deep fry but that is fine because of the costing of the Koufu rental but it’s too hard to chew. Though it’s not all the time because I experienced fresh and juicy one at times so it depends on luck.\n\nOnce I requested a steam chicken thigh rice, the staff told me it is sold out when the 2 whole chicken is still hanging up there. I’m wondering is it because it’s dinner time and don’t want to chop it.\n\nAnyway, it tastes just below average for a local Singaporean expectation just like their flagship Seah Street which disgraced me when I brought my foreign clients there.\n\nI remember the taste back then in 1997, I’m a great fan of Sing Swee Kee, so I hope you will make a comeback.\n\nAll the best Sing Swee Kee.",
      "time": 1722294482,
      "translated": false
    },
    {
      "author_name": "ʍɾɴ",
      "author_url": "https://www.google.com/maps/contrib/103383404265528637492/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWxICxksDBoWOljZqTWb-uotkWvr-HsC5xUuksPrhcFYJpZb8QV=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "Utterly disappointing. The set cost $6.90.\n\nThe amount of chicken, is pathetic. The roasted chicken was thin, with bones taking up a higher percentage than the meat, and just 5 pcs. Not forgetting to mention, the chicken was a tad dry, felt like some overnight ones.\n\nIt's more like I'm having Chicken Bone Rice.\n\nchilli was too watery.",
      "time": 1738907427,
      "translated": false
    },
    {
      "author_name": "rex ng",
      "author_url": "https://www.google.com/maps/contrib/102435267034445536964/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJoIe9RnSUmAx0fHSEaOhbkVsD-WOMZG0KFnTAGgYYb204-vw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "9 months ago",
      "text": "Expensive plate of chicken rice that cost $7.60 with the portion of chicken breast meat being so little and fyi this is after paying additional $3 for extra meat. Not worth patronising as it’s not nice either. And the person still has the cheek to tell me the portion is not little when i asked him about it.",
      "time": 1722863526,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2774422175476993472",
  "user_ratings_total": 9,
  "vicinity": "11 Tampines Street 32, Tampines Mart, Singapore"
}