{
  "formatted_address": "2 Adam Rd, #01-14 Adam Food Centre, Singapore 289876",
  "geometry": {
    "location": {
      "lat": 1.3242087,
      "lng": 103.8141348
    },
    "viewport": {
      "northeast": {
        "lat": 1.325594730291502,
        "lng": 103.8153750302915
      },
      "southwest": {
        "lat": 1.322896769708498,
        "lng": 103.8126770697085
      }
    }
  },
  "name": "Siti Nur Liyana Nasi Lemak",
  "place_id": "ChIJv4Mk4QYa2jERN70U6hzdTGk",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "T greensake",
      "author_url": "https://www.google.com/maps/contrib/102107525471936198024/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIZnv83PGhDQQ8QIfnt_ARJLi3OI_jhuI8AaxZ0AVYFHu9tcQ=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "28/10/2024\nHad Nasi Lemak Chicken Wing set ($4) for dinner, was quite good. Portion was generous. Chilli slightly on the sweeter side.",
      "time": 1730342738,
      "translated": false
    },
    {
      "author_name": "eee che",
      "author_url": "https://www.google.com/maps/contrib/113391715210349502507/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV2_MWG1z1HzgNibg7Df_t2NmGSk4pnWAO2FpKME-q-lzZpeSU=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "5 months ago",
      "text": "Craving for nasi lemak, 1st thought will be @adam road. Went there @2.45pm, the only nasi lemak store available Siti Nur and they are in transition selling their goreng menu after 2pm. Just try lah. Ordered set B with extra rice cost $4+1=$5.  The rice was not enough fragrant and the sambal chilli is sweet.(not spicy). The fried chicken wings wasn’t even marinated. No distinguish Malay taste. Sat in front of the stall noticed many customers go for their stirred fried rice and noodles. The nasi lemak is acceptable but not great 😌. Will come early to try the no.1&2 stores here around 11am",
      "time": 1732951903,
      "translated": false
    },
    {
      "author_name": "Kim Wee Soh",
      "author_url": "https://www.google.com/maps/contrib/105732667335415294658/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU8sKSzPxkbTGPKZzjQJXRJ3_trVOR35fxBg5J1qqUk17hczXZvPw=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "For the longest time Adam's road food centre had been famous for Muslim food, whether Malay Muslims or Indian Muslims. Since a kid, you can see many motorbikes and working cars crowding the parking, mainly Muslims patronising the food centre for affordable Muslim fare. Many bloggers have written about this food centre and it has gone on to spawn a famous Nasi Lemak chain as well as, lesser known, but also famous now, a Chinese prawn mee. Still, if you are after Nasi Lemak, this might be a good try, or, if you are after traditional Mee Rebus or Mee Soto, this place had been said to be the Must Try. Personally, I don't come here as much due to the limited parking but today I have the opportunity to try the famed Mee Rebus. This Malay Muslim dish, the key is always the sauce. Savoury taucheo favoured with seafood and mutton. This stall, had been touted to be a must try. Savoury umami sauce checked. Fragrant fried shallots checked. Al Dente noodles checked. Fresh Green Cut chilies checked. Lovely sauce to go with the yellow noodles. It's a must try. The only let down is probably due to inflation, you only get yellow noodles, bean sprouts, fried shallots, green onions and a hard boiled egg. You might jazz up the meal with add ons such as begedils or fried chicken wings. But the usual taukwa cubes and some sambal have been left out. Sauce lean on a balanced flavour and not too sweet. Not as starchy as some others but slurpable and filling. Portion is great and a filling carb on carb meal. Try it!",
      "time": 1684697473,
      "translated": false
    },
    {
      "author_name": "Hamzah Alsagoff",
      "author_url": "https://www.google.com/maps/contrib/110350566909335567625/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX1bOjlsUPXrHZA8ZPzRxT4zglwH576OxFTryfjNIR0UcI84DLb=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "12 months ago",
      "text": "If only one can indulge in such sinful consumption all the time then this will not be a cheat day treat. But alas usually what is really a tasty delish treat is often not good for us. For being such a good boy for the last many months I'll just let go for a short while and indulge.....before going back to self restraint.\n\n#SitiNurLiyaNasiLemak's Mee Rebus with its thick OG legit authentic gravy I miss harking back to good ole madman days of my beloved #O2Ads. And when you add hati mempedal — chicken heart and gizzard fried with spices — and lifted by fresh crunchy cut green chillies for me it's a satisfying treat. The lopes kept calling along with a hot cup of frothy sublime teh tarik of course double kurang'ed or reduced in sweetness.\n\nThis is just a warm #soulfood comfort on a beautiful blessed rainy day 🤲🏻🫶🏻",
      "time": 1716526482,
      "translated": false
    },
    {
      "author_name": "Alan Tang",
      "author_url": "https://www.google.com/maps/contrib/118416171152567325758/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX5iZ5sXanlLW_VTNQiIMHx9pNMEnYGra_uqKyBzySr3heMyvk=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "2 years ago",
      "text": "For the last two trips to Adam Road Food Centre, we had not been able to patronize the stall of “Siti Nur Liyana Nasi Lemak” as they were closed. We used to like their Mee Rebus and Mee Siam.\n\nWhen we arrived at 10:30am morning we were happy to find their stall opened, so I joined the queue to place my orders of Mee Rebus and Nasi Lemak. (Mee Siam we’re sold out.)\n\nFound out that the stall closes every Wednesday and Thursday since January this year. And from tomorrow, they would close for one month for Lebaran (Hari Raya Season).\n\nThe rice was still flavorful (sufficient coconut milk). However, we found their Ikan Kuning (though good sizes) were not crispy enough, hence unable to “crunch on” their heads and fins, which I enjoyed in a Nasi Lemak meal.\n\nIkan bilis was rather scarce, do understand that the cost of this item had gone quite a bit though.\n\nThey were generous with the Sambal Chilli and it was nice when mixed with the rice. Would be good if there were few more slices of cucumber.\n\nThe fried chicken wing was crispy as it just came out of their wok, nice👍.\n\nI can say their rebus was one of the better ones, very delicious and generous with their condiments, very authentic taste.\n\nImportantly, the ladies (believe mother and daughters) were all very friendly.",
      "time": 1679408739,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7587682588468493623",
  "user_ratings_total": 47,
  "vicinity": "2 Adam Road, #01-14 Adam Food Centre"
}