{
  "formatted_address": "2 Jln Lokam, #01-54 Kensington Square, Paya Lebar, Singapore 537846",
  "geometry": {
    "location": {
      "lat": 1.3452906,
      "lng": 103.8822301
    },
    "viewport": {
      "northeast": {
        "lat": 1.346827080291502,
        "lng": 103.8839714802915
      },
      "southwest": {
        "lat": 1.344129119708498,
        "lng": 103.8812735197085
      }
    }
  },
  "name": "SMAC BBQ (Paya Lebar) 木炭串烧（巴耶利峇）",
  "place_id": "ChIJ-fgnUswX2jERS6AAvoHTLvI",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "MC",
      "author_url": "https://www.google.com/maps/contrib/115334096318221690239/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU8Yz97m3sddTH5esxaSUwIrVJPcd8xCtiIyhW40uB_8gzFQcaovw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "This place is always my go-to when I’m craving BBQ skewers. The meat is cooked perfectly and well-seasoned. The prices are very reasonable, offering great value for the quality. They also provided free ice cream after the meal, which we thought was a nice and thoughtful touch.\n\nThe service is consistently good and I love that they offer both indoor and outdoor seating. Lately, I’ve been leaning toward the outdoor seating—it’s pet-friendly, so our furry boy gets to join us while we dine. It’s an excellent place for a relaxing weekend! Ideal for unwinding and savoring some quality time in a peaceful, quiet neighborhood.\n\nFavourites : Grilled Pomfret, Grilled Chicken , potato slice, lamb, and bacon wrapped enoki skewers, bean curd strips, eggplant with garlic and minced pork.",
      "time": 1740990864,
      "translated": false
    },
    {
      "author_name": "Skye Cai",
      "author_url": "https://www.google.com/maps/contrib/103575601236373049278/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWSjDcHZGcZoHJjoIs673qwJVkKO70N2D2zt9jORKf2UTSuRocJ=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 2,
      "relative_time_description": "4 months ago",
      "text": "Tried the barbecue but was quite disappointing.\nThe barbecue sticks are not charcoal barbecued. It’s more like electrical barbecued.\nItems are fresh. But they are spreader with yellow ginger oil and it has a strong curry taste, which is not original Chinese style.\nThe small lamb meat looks portioning small, but the meat are crispy at the outer, soft at the inner.\nThe best is the fried cabbage, very soft and juicy.\nLove the environment, it’s amazing and very fashion.",
      "time": 1735486017,
      "translated": false
    },
    {
      "author_name": "Kim Jun Hong",
      "author_url": "https://www.google.com/maps/contrib/115322490341831324881/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVbbaPeY7qivr4pI3RZ8rnEW7jssq1iGZNjpkT9QqGoSzHQpESw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "7 months ago",
      "text": "First time trying out this hidden gem located in a small mall at a quiet corner of Upper Paya Lebar Road.\n\n⭐️ Service: The service here is excellent—polite, friendly, and welcoming. Staff greeted me with smiles upon entering, which gave a warm and pleasant first impression.\n\n🍽️ Ambience: The restaurant is open until 2 am and offers both indoor and outdoor seating. While the place isn’t very big (about 12 tables in total), the indoor seating was particularly nice with strong air conditioning and clean tables. It’s perfect for a late-night dining experience in a cozy setting.\n\n💲 Prices: The prices are reasonable considering the quality of food served. It felt like great value for the taste and portion sizes.\n\n🧑🏻‍🍳 Food: The food here is fantastic! I enjoyed every single item I ordered. My personal favorites were the Grilled Lotus Root, Grilled Potato Chips, Edamame, Grilled Eggplant, every other grilled meats, and Enoki Mushroom in tin foil. But the real standout was the Grilled Beef with Soy Sauce—tender, flavorful, and almost like eating sirloin steak! Every dish was well-seasoned and fresh, making it a delight for my taste buds.\n\n✅ Areas for Improvement:\n- The food takes a while to be served, although it’s cooked fresh, which is a plus.\n\n- Only chopsticks were provided. Having forks and spoons available would be more convenient.\n\n- It would be great if they offered both Spicy and Non-Spicy options for the dishes. Currently, everything I ordered was spicy, and a bit more flexibility would cater to different taste preferences.\n\nOverall, it’s a highly recommended spot for late-night eats. I’ll definitely be coming back!",
      "time": 1727119710,
      "translated": false
    },
    {
      "author_name": "Lai Kuan",
      "author_url": "https://www.google.com/maps/contrib/113420734450615215661/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVRo856hTFXDc01NLLrzpVfcJTwnHUriSWWn33bZGpkONttXgVz6A=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Our 2nd time here. The food here is delicious, and so far, those we have tried, we are delighted with the taste and sauce.\n\nWe chose CNY Eve; come by here for your New Year's Eve dinner is a wise choice. Get to choose what we like, and no need to go to the usual Chinese Restaurants to force ourselves to take set meal.",
      "time": 1738063540,
      "translated": false
    },
    {
      "author_name": "Cassandra Tung",
      "author_url": "https://www.google.com/maps/contrib/112205811152135586206/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLqaXOzIAJ7WlgFT0Cp7FGn4P8uSfTjDmnt4pQO4n9XGlmZtA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "A good place for gatherings. The food is delicious. BBQ is a must. The staff are very friendly and the service is very good.",
      "time": 1733905096,
      "translated": false
    }
  ],
  "types": [
    "meal_delivery",
    "meal_takeaway",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17451118160299204683",
  "user_ratings_total": 159,
  "vicinity": "2 Jalan Lokam, #01-54 Kensington Square, Paya Lebar"
}