{
  "formatted_address": "78 Neil Rd, Singapore 088841",
  "geometry": {
    "location": {
      "lat": 1.2798371,
      "lng": 103.8423287
    },
    "viewport": {
      "northeast": {
        "lat": 1.281087280291502,
        "lng": 103.8437455302915
      },
      "southwest": {
        "lat": 1.278389319708498,
        "lng": 103.8410475697085
      }
    }
  },
  "name": "SMAC BBQ (Tanjong Pagar) 木炭串烧（丹戎巴葛）",
  "place_id": "ChIJdSPlD7kZ2jERGnNrkYYhyNQ",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Randall",
      "author_url": "https://www.google.com/maps/contrib/104155559371126919827/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWLcLxFiGkgBkWv7cUNid2_qglRVWLpYfpIYud-2_01DpQdeZcm=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Verdict: 4.1/5\n\nCame to this Chinese skewers joint (Chuan Chuan) for dinner with friends prior to TGIF drinks. SMAC is housed inside a shophouse-like layout, with traditional chinese accents in their decor (Think ceramic lacquered tiles, red lanterns etc), which provides an extra layer of authenticity to their ambience and food.\n\nFood-wise, we ordered an assortments of skewers ranging from grilled beef, grilled beef tendons, grilled pork belly, grilled squid, grilled potato slices, grilled lamb leg, grilled king oyster mushrooms and the good ole grilled mantou. For drinks, we had the chilled cola and bottled chinese snow pear juice to refresh ourselves while enjoying the skewered treats.\n\n1. Grilled Beef / Grilled Beef Tendon - 4/5\n\nDid not taste this personally, but was great according to my friends.\n\n2. Grilled Pork Belly - 4/5\n\nUsual pork belly chuan chuan, marinated nicely with various chinese spices and cumin powder, can never go wrong. Thumbs up!\n\n3. Grilled Squid - 4/5\n\nGrilled squid, no matter the cuisine, could be a hit or miss. For this one though, definite hit, chewy but not rubbery, bite-sized pieces (no monstrous mess around your mouth), succulent and delicious 👍\n\n4. Grilled Potato Slices - 3/5\n\nSadly, this one was not a wow factor. Although nicely seasoning, the potatoes lacked the crispiness to them even after the grilling process.\n\n5. Grilled Lamb Leg - 4/5\n\nThis came as a surprise, as I am not a frequent eater of lamb due to the tougher meat and gaminess of lamb meat. None of that sort when it came to this skewered lamb, might be one of the best grilled lamb I have tried. 👍👍\n\n6. Grilled Oyster Mushroom - 3/5\n\nAverage grilled mushrooms, not too dry nor juicy, worth a try if you need mushrooms in your meal.\n\n7. Grilled Mantou - 3.5/5\n\nMantou was tasty and crispy, with the right amount of seasoning on it. But the buttery taste was not present, so good but not the wow mantou I was looking for.\n\nService was good as well, but became harder to get the staffs’s attention as the night grows longer, with more customers entering the joint. Weirdly, the second level of their shophouse joint has space available, but my friends were not allowed to be seated upstairs, while others just went straight up upon arriving (at a later timing).\n\nWith all that said, will consider coming back next time for more chuan chuans when in the area. Cya on the next review! 再见！",
      "time": 1742543629,
      "translated": false
    },
    {
      "author_name": "Alfred Zhuo",
      "author_url": "https://www.google.com/maps/contrib/108957909517305400376/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLuTzYa1XtDu9yCvldjcGN9r6NLszX9aYQFcmosO1eWNnU32A=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "Do yourself a favor and go to other Chinese restaurants. Lots of fake reviews here (I suspect)\n\nThe food is not v good. Not delicious. 茄子Brinjal is too salty. The service is super slow ok. That is the biggest problem.  At least 45 mins to get these food to your table and other tables even waited 1 n half hours. My review echos Mr.Mak's review about extreme slow service at this establishment.\n\nDon't know how they get 5 star reviews from others but it is extremely poorly run. I have 3 other tables in front of me complaining about undelivered food and orders confused with other customers and food being served on other tables in wrong order.\n\nIt is extremely frustrating to see. We came on 7 dec Saturday evening and there is at least 3 other tables including mine that left frustrated and unserved orders.\n\nWe all cancelled some orders in the end because you can't possibly wait 1 to 2 hours for your food.\n\nThe snacks and ice cream is free and that is probably their way to make sure customers did not run away.\n\nThe cashier or boss person at the counter however did not give a good explanation for these slow food services. The kitchen looks in a mess and the 3 other tables in front of me. No one actually cleaned these tables for 30 minutes.\n\nCan you imagine what the servers are doing. They probably extremely short handed or pipeline failure. This restaurant was ran for 4 months already and it can't even deal with a normally weekend evening. Disappointed and will never come back again.\n\nGo jurong for better restaurants like this",
      "time": 1733575764,
      "translated": false
    },
    {
      "author_name": "Baiyu Li",
      "author_url": "https://www.google.com/maps/contrib/108165597418682371977/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL3KJd9lulhCb6VF94H4ZLlveCpuN8U0hK2w559nUNCNaxtTQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Good food and very generous portions. Service was quite fast. All the food arrived in less than 15mins. Vibes is good for gathering with friends or family.",
      "time": 1743337490,
      "translated": false
    },
    {
      "author_name": "David Chia",
      "author_url": "https://www.google.com/maps/contrib/103521130724369638495/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKgDOVFc5lLtc1-v0vMuTNJaYRyJATvsUTvyvDldmyuxpaZyQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Went there with a friend to try out this 串串 restaurant.\nHappened that i patronize the Hong Kong restaurant previously, it was actually the same location!\n\nThe Boss and Staffs were super friendly, even help to change our dishes when it was filled with skewer stick and shell.\n\nFoods were up to our standard though i'm being the picky one.\nDefinitely a good makan place to visit.\n\nIt can be quite dry just eating the stick. My recommendation\nEat Scallop while it hot (Oh... the juice)\nEat the stick\nEnjoy the Ice cold Beer!",
      "time": 1735783572,
      "translated": false
    },
    {
      "author_name": "Food Kakis",
      "author_url": "https://www.google.com/maps/contrib/112276475321726019597/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIk-dbK6K4RRi1TwSck_eoyVT0dM40p6GHEAUmNGTl26KsODw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "SMAC BBQ was established in 2017 and they draw inspiration from the rich heritage and culinary traditions of Northeast China. Their signature BBQ dishes are marinated using a secret blend of over 13 herbs and spices 🌿, then expertly charcoal-grilled to perfection 💯.\n\n🍊 CNY Set Meals 🍊\nFor 4-6 pax: $480\nFor 8-10 pax: $780\n\nTheir 4-6 pax set meal consists of a huge variety of items:\n\nGrilled gol pomfret fish, grilled live abalone, grillled live oysters, wasabi prawn balls, grilled pork trotter, lamb shank, grilled chicken, grilled lamb leg, sichuan mala chicken, dumplings, grilled fresh prawns, stir fried pork, cucumber with mash garlic, grilled prawn paste, grilled taiwanese sausage, stir fried cabbage, man tou, grilled king oyster mushroom, grilled potato slices etc\n\n‼️Exclusive CNY Perks:\nOrder any CNY set and enjoy one 🆓 yusheng to complete your festive feast!\n\n🍦Free ice cream up for grabs at the end of the meal\n\n🎶 Free KTV on the second floor and private dining room",
      "time": 1737688334,
      "translated": false
    }
  ],
  "types": [
    "meal_delivery",
    "meal_takeaway",
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15332541793231926042",
  "user_ratings_total": 82,
  "vicinity": "78 Neil Road"
}