{
  "formatted_address": "20 Jurong West Street 93, #01-03 Sports Centre, Singapore 648965",
  "geometry": {
    "location": {
      "lat": 1.3383436,
      "lng": 103.6943961
    },
    "viewport": {
      "northeast": {
        "lat": 1.339647630291502,
        "lng": 103.6956206302915
      },
      "southwest": {
        "lat": 1.336949669708498,
        "lng": 103.6929226697085
      }
    }
  },
  "name": "Small Wonder Pioneer",
  "place_id": "ChIJjzdbRrfbpaoRyr0wiI8kNKs",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Zera OO",
      "author_url": "https://www.google.com/maps/contrib/118359115896800191724/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWvGYNSTZqV5m8vpSFk647LObQVj4B-3otYo7mK2i-KlGkkj6U=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "I am truly beyond grateful for everything Small Wonder Pioneer Preschool has done for my family. Both my daughters, one in K2 and one in N1, have blossomed so beautifully under the care and guidance of the amazing teachers here.\nEvery teacher is so dedicated, patient, and full of heart. It is clear how much love and effort they pour into teaching, caring for, and nurturing each child every day. From daily lessons to special events like performances, they always go the extra mile to make every moment meaningful.\nSeeing my girls so happy and excited to go to school every day is the best reassurance any parent could ask for. They would even share stories about their day during the car ride home or while getting ready for bed, and those moments are truly precious to me.\nI am so thankful I chose Small Wonder Pioneer. It is more than just a preschool. It is a second home filled with warmth, care, and encouragement.\nThank you from the bottom of our hearts for creating such a wonderful environment for our children to learn, grow, and shine.",
      "time": 1745845768,
      "translated": false
    },
    {
      "author_name": "Rogi Ma",
      "author_url": "https://www.google.com/maps/contrib/109368425649414076341/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocId1deK0wkOL5ojUtGYs3iTac-lwp5Kk8V0hwam4RTIeYsc7A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I am truly impressed with the care and learning environment at Small Wonder Pioneer. The teachers are incredibly warm, attentive and nurturing, which helps my child feel safe and supported every day. I can see how the curriculum is thoughtfully designed to promote social, emotional and cognitive development in a fun and interactive way. It’s clear that the teachers and Centre Director genuinely care about children’s well-being and progress. I am grateful for the positive impact they have had on my child’s growth. I feel confident that my child is in great hands here.",
      "time": 1738802483,
      "translated": false
    },
    {
      "author_name": "ttjamaiah azs",
      "author_url": "https://www.google.com/maps/contrib/103488611035298187960/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXpJ1HGaGaQOLMm5yuCOOEazP83CRzZEhzFzUie7LVXu3NEKN5q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "As I recalled back, it is quite hard to choose Small Wonder Pioneer which is quite far from our home. No vacancy in other  centres. Little reviews can be found during our time when we want to enrol our daughter for Playgroup. Nevertheless, we entrust our daughter's well-being to the teachers & Principal.\n\nParents are often kept informed of the curriculum, health of our children and activities in & out of school via the app which is easy to access. Teachers are very helpful, caring & make the effort to communicate with parents. Applause to the teachers & Principal at Small Wonder Pioneer for their dedication & patience 👏🎉",
      "time": 1739244358,
      "translated": false
    },
    {
      "author_name": "Anna Nguyen",
      "author_url": "https://www.google.com/maps/contrib/117953433422360049839/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJWjfh7rfZN3ZJ8XgyzodoBn1y9PY33TNcFrMQEuLLiOkbG4w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "The teachers from Small Wonder Pioneer are so friendly and dedicated. They educate and take a good care of the children. My daughter is happy going to school everyday and she talked a lot about the teachers and friends. Parents concerns are always cared by the teachers. Thank you all the teachers there!",
      "time": 1738646902,
      "translated": false
    },
    {
      "author_name": "Ethel Yip",
      "author_url": "https://www.google.com/maps/contrib/116180509314633065952/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKlYglWEckSGr8rZG_pY-IDMJf_zUUOg_8NK5Z0QcUZhwNdiQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I am heartened that my child looks forward to attending school every day. The progress my child has made since joining the school has been evident. Kudos to the wonderful team of dedicated and nurturing teachers and principal at Small Wonder Pioneer, alongside its engaging curriculum and conducive learning environment!",
      "time": 1738851743,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "school",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12336525478158450122",
  "user_ratings_total": 9,
  "vicinity": "20 Jurong West Street 93, #01-03 Sports Centre"
}