{
  "formatted_address": "1 Dundee Rd, #01-01 Queens Peak, Singapore 149456",
  "geometry": {
    "location": {
      "lat": 1.2948713,
      "lng": 103.8067512
    },
    "viewport": {
      "northeast": {
        "lat": 1.296274480291502,
        "lng": 103.8081896302915
      },
      "southwest": {
        "lat": 1.293576519708498,
        "lng": 103.8054916697085
      }
    }
  },
  "name": "Small Wonder Preschool Queenstown",
  "place_id": "ChIJZSIvt4Ub2jERHWFwcQ1Fkjg",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Carmen Ku",
      "author_url": "https://www.google.com/maps/contrib/108638082748923610697/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXmc06TphN2bJnTc8CfQbbrCEsACzn5AY7vFCfrK44hQHYUELoX=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "We were previously at Small Wonder BM since my daughter was 15 months, then transferred to Small Wonder Dundee at around 24 months. The school had been very helpful during the transition and it did not take long for my daughter to adjust. The environment is nurturing and teachers are committed. My daughter has picked up many life skills and can independently do many things for her age which we are grateful to the teachers for. The school is also committed to communicating with parents on a daily basis and engaging us in different activities and events.\n\nTeacher Saranya has also been instrumental in helping my daughter become potty trained at school and helping her to open up and speak up although she previously was hesitant/shy. A very committed and hardworking teacher who although busy, never fails to provide timely updates of daily class activities by uploading photos onto the school app. Thank you!",
      "time": 1739948768,
      "translated": false
    },
    {
      "author_name": "Tricia Tan",
      "author_url": "https://www.google.com/maps/contrib/106109474173957891871/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK1ywtnRoG1T0vFaRJqcEg0IpypWyV35XmuXybRqkQojfBnsg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "A big thank you to 刘老师(Dundee) for being such a wonderful teacher! She creates a warm and supportive environment, always taking the time to explain things and help our child understand situations better.\n\nChinese lessons are so much fun with games and songs, making learning Mandarin enjoyable and engaging. We've seen such a boost in our child’s confidence!\n\nWe really appreciate all the care and effort 刘老师 puts in.",
      "time": 1740358668,
      "translated": false
    },
    {
      "author_name": "Andrea Tan",
      "author_url": "https://www.google.com/maps/contrib/109918542572522338112/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJKuC6ZzbjNaKtYGjnk90-LekhsrfDz5VVizqzdOLa1sTDPHg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "We enrolled our son in Small Wonders Queenstown Preschool this January, and while he has been facing some difficulties adjusting, the experience has been very positive so far. The teachers—especially his form teacher Ms. Saranya, Chinese teacher Li Lao Shi, and principal Ms. Fiona—have been incredibly patient, understanding, and supportive throughout the process.\n\nI also appreciate how the school keeps parents updated on their children’s activities through the app, which gives us insight into what they are learning and doing daily. The curriculum seems well-structured, and the overall environment feels nurturing. We are hopeful that our son will settle in soon and thrive in this great school!",
      "time": 1737644326,
      "translated": false
    },
    {
      "author_name": "Chee Chong Teo",
      "author_url": "https://www.google.com/maps/contrib/115622167200226816192/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUM-vhOof0QfEGp6dtmSMZRxe0thBRozwIRKh-u749M7uuAXBA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "We enrolled our boy for infant care when he was 15 months old. Initially the separation anxiety was very bad for him he would cry and not want to be carried by the teachers in the morning into the classroom. However in just a short 1-2 weeks time, our boy was enjoying school and very willingly allow the teachers to carry him. This shows that the he really likes the teachers. Special shoutout to teacher Cherry Ong for always sharing with us what our boy have been doing in school, answering our questions promptly and loving our boy (giving us suggestions on what to do when he doesn’t want to drink milk, etc.). Would highly recommend any parent who needs to send their child to infant care to consider this place!",
      "time": 1740032962,
      "translated": false
    },
    {
      "author_name": "Rebecca Teo",
      "author_url": "https://www.google.com/maps/contrib/114820383452144136971/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI9jTr8w9vswzBz6PLYRKLFvCqu8f8uOZHziSi0WbcHZsBwLvw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Enrolled our twins at Small Wonder@ Dundee since last year July when they were in playgroup. They’ve grown a lot and have gotten more independent and teachers are always attentive to them and gives us timely updates.\n\nTr Joyce and Zhou Laoshi from their PG and now with Tr Saranya and Li Laoshi in their N1 class. Tr Saranya gave us nice updates on their first day of transitioning them to full day. Although the preschool is a little small, the teachers are warm and caring which makes for a very positive experience. Thanks also to Principal Fiona for always being there at pick ups and drop offs and knowing every child by name 🧡",
      "time": 1739956973,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "school",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4076396536763801885",
  "user_ratings_total": 13,
  "vicinity": "1 Dundee Road, #01-01 Queens Peak"
}