{
  "formatted_address": "Bishan Street 22, #B1-274, Singapore 570243",
  "geometry": {
    "location": {
      "lat": 1.3610719,
      "lng": 103.8445401
    },
    "viewport": {
      "northeast": {
        "lat": 1.362517930291502,
        "lng": 103.8459726302915
      },
      "southwest": {
        "lat": 1.359819969708498,
        "lng": 103.8432746697085
      }
    }
  },
  "name": "SmartLab Education Private School",
  "place_id": "ChIJ6_ShXAoX2jERGjyWrkXW3JI",
  "rating": 5,
  "reviews": [
    {
      "author_name": "BeepBeepLettuce",
      "author_url": "https://www.google.com/maps/contrib/107385007380800005011/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVIH5yTkljokoGX_M7pVQ0E_u1MAgIDV2pQL0rhqy8swvKDljI=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "As a private student doing A-levels in 2024 with the BCME (Biology, Chemistry, Maths, Economics) combination, my experience at SmartLab has been excellent. The teachers are highly knowledgeable and dedicated, providing clear explanations across all subjects.\n\nBiology lessons are well-structured, and the teacher ensures that complex concepts are easily understood. Chemistry is taught with great clarity, making even the most challenging topics more approachable. The Maths lessons are equally well-organised, with personalised support whenever I need help to grasp difficult topics. In Economics, the lessons are engaging and cover all key concepts thoroughly, helping me develop a strong understanding of the subject.\n\nSmartLab also offers valuable resources like past year papers for exam practice and a dedicated study room for quiet, focused revision. The teachers are always available for extra help, and the well-planned lessons ensure I’m prepared for my exams.\n\nOne of the standout features is the ability to message teachers with any questions I have, and I always receive prompt and helpful responses. Overall, SmartLab has provided the perfect environment for success in my A-levels, and I would highly recommend it to anyone looking for a supportive and effective learning environment.",
      "time": 1742821283,
      "translated": false
    },
    {
      "author_name": "fun",
      "author_url": "https://www.google.com/maps/contrib/105073330542817009563/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVXYqdIPOvDGdu4p7VCo99v48x0Xdf3zquKKdnJLuaHmM3WV_o=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Mr. Collin was an incredibly enthusiastic and dedicated GP teacher. His passion made lessons very engaging and insightful. Beyond academics, he was genuinely cared for our well-being, always checking in on us and creating a supportive classroom environment. He is always willing to give feedback to any extra work as soon as possible. His commitment and teaching methods enabled me to excel in GP.\n\nMr Tony was highly efficient and meticulous in his teaching. He provided his own comprehensive notes, held extra classes near exam periods, and always made up for missed lessons. He was always willing to answer our questions and continuously encouraged us to improve.",
      "time": 1742381246,
      "translated": false
    },
    {
      "author_name": "Annalisa Goh",
      "author_url": "https://www.google.com/maps/contrib/107682639525432950550/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLkm-B5u36nKku9WjKHdaIvyxX3mXc2PFQMUKXLbPUhn07W1ZuV=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I attended this tuition center during my A Level year. Teachers are friendly and always available for consultations, responding promptly to raised questions. Additionally, Mr Collin is an exceptional teacher whose engaging teaching style makes learning enjoyable, motivating students to enjoy the beauty of encapsulating the right words. He creates a positive classroom environment where everyone feels encouraged to participate. Not to mention Mr Tony, who is an outstanding educator with extensive knowledge and expertise. His deep understanding of the curriculum, honed over many years of experience, allows him to teach with confidence and clarity. Thank you.",
      "time": 1741243048,
      "translated": false
    },
    {
      "author_name": "Cheng Bai",
      "author_url": "https://www.google.com/maps/contrib/115426318483525003902/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVU9OPWnhqUKUA-CsCy8RbPrgsGUesq49XvyLVuCmd6xiJkM8PD=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Smart Lab Education at Bishan Place is an outstanding learning center that truly goes above and beyond in helping students excel. The structured lessons, engaging teaching methods, and supportive environment make it an ideal place for academic growth.\n\nA special shoutout to Mr. Lenny, the Math teacher, whose patience and dedication are remarkable! He breaks down complex concepts into easy-to-understand steps, making math enjoyable and much less intimidating. His clear explanations, step-by-step guidance, and willingness to go the extra mile have helped me build confidence and improve significantly.\n\nIf you’re looking for a top-notch tuition center with passionate educators, Smart Lab Education is the place to be. Highly recommended!",
      "time": 1741850148,
      "translated": false
    },
    {
      "author_name": "Kashi C",
      "author_url": "https://www.google.com/maps/contrib/104161321176812963911/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIquLG1aCfTVaAN81l2n1o75fybj0j4mNt9ZDRNtfj1FnhVOA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I enrolled in Smartlab in 2024 as a private A level student as a polytechnic student. The classes were comprehensive and the teachers were readily available to help out with any questions, even staying back after hours for additional consults.\n\nI was most impressed by the lessons in GP and Chemistry, which were taught by Mr Colin and Mr Tony respectively. They both provided meticulously curated lesson plans and handouts that were comprehensive yet challenging.",
      "time": 1741789726,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10582568819183991834",
  "user_ratings_total": 91,
  "vicinity": "Bishan Street 22, #B1-274"
}