{
  "formatted_address": "Blk 27 Bendemeer Rd, #01-663, Singapore 330027",
  "geometry": {
    "location": {
      "lat": 1.3188651,
      "lng": 103.8628326
    },
    "viewport": {
      "northeast": {
        "lat": 1.319946730291502,
        "lng": 103.8644624302915
      },
      "southwest": {
        "lat": 1.317248769708498,
        "lng": 103.8617644697085
      }
    }
  },
  "name": "Snip Avenue - Bendemeer 27",
  "place_id": "ChIJEcznL9IZ2jER_CdDO4moMNY",
  "rating": 3.1,
  "reviews": [
    {
      "author_name": "H Bby",
      "author_url": "https://www.google.com/maps/contrib/105302922443033366621/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJp2tGaddoeHt4SVgf-vWGSkvu7iuTSadMy1bgolcC5HVlQKTc=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "7 months ago",
      "text": "This lady right here gave a horrible/ugly and the worst haircut to my 3 year old son. It was jagged and looked like a curtain undone bangs. Went here just now at about 7.25pm today at (29/06/2024, Sunday) Not only did she gave a terrible service, but she also gave the worst black face and grumpy tone. Doesnt matter about the price but atleast she could have made an effort to salvage my son’s hair after the first attempt of ugly cut that she has done to my son, we did speak to her to correct the edges of my son’s hair however she insisted saying that she couldnt do anything anymore. And she never even try making an effort to do anything about it. Totally ignorant. Seemed to me like she just wanted to end the cut faster. Ended up, we went to the opposite site of a nearby salon to get my son’s hair retouched again. Please Beware to all people out there, visit this salon at your own risk!  As for me,I have learnt the hard way, we definitely wont be visiting this place ever again.",
      "time": 1727611216,
      "translated": false
    },
    {
      "author_name": "J",
      "author_url": "https://www.google.com/maps/contrib/111131667618345957071/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJerRPZthM1Fpub4Wy_nReI7Qd2XjN527Qz2ltcm2us98ag5A=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Complaint Review: Snip Avenue Ruined My Hair – Avoid This Salon At All Cost!\n\nI had an absolutely terrible experience at Snip Avenue, and I strongly advise others to think twice before going there. The hairdresser completely ruined my hair, showing a lack of skill, care, and professionalism. He was rough with his hands and extremely unskilful with the hair equipment.\n\nThe staff at the counter seemed rushed and careless, barely listening to what I wanted. Despite expressing my concerns, they insisted everything was fine and pretended that they understood what I needed.\n\nTo make matters worse, they refused to take responsibility and demanded me to pay for this subpar service, since the damage done was irreversible.\n\nIf you value your hair, time, and money, I’d strongly recommend going elsewhere. Horrible experience, unprofessional service, and zero accountability.",
      "time": 1740909570,
      "translated": false
    },
    {
      "author_name": "rina phua",
      "author_url": "https://www.google.com/maps/contrib/103421313161064880741/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVY00rva0tZQDngoQE4xPuGtBcJnFr-c5x5_htPBBZYILTjARF_=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 years ago",
      "text": "To be running a hair salon business would means to hire professional skilled hair stylists to man the outlets. Imagine stepping into a hair salon and ended up getting your hair cut into a state of madness, how would one feel? If anyone is looking for a decent hair cut, please avoid this place at all cost. To be honest, one will return because of the skilled and professional services that had been rendered previously. However all it takes is just one unprofessional person to kill the initial acclamation earned. Photo speaks louder than words. We are not balding customers stepping in to ask for a bob style. If you are not skilled enough to meet the expectations of the customers, do not blame the customer for the nature of their hair. Auntie in Boon Keng branch proclaimed loudly the problem lies in the nature of rebonded hair without a word of apology and yet reciprocated with a lousy attitude. If you think that the price that we are paying is too low to be asking for a decent hair cut, you could have informed us to top up and we are more glad to do that. This photo will show what is the difference in professional and unprofessional can resulted in. First 3 photo showed the work from Snip Avenue Bendemeer. Last 3 photos showed the rectified work of another stylist from another salon. Shame on u! FYI, package was paid and this is how the after sales is like. Good riddance!",
      "time": 1652154553,
      "translated": false
    },
    {
      "author_name": "Chrys",
      "author_url": "https://www.google.com/maps/contrib/109596880481083119455/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW_S8t9qccFl_nYbV4versHiGaB6gOOOq66QFSdBEUwp6YYtuZm=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Rude staff who almost shouted across the salon informing you of long waiting time... Seems like they are always short-handed... I just wanna get rid of the voucher I bought to support my previous stylish from Bedok outlet which closed down shortly... Understand their frustration but expect a nicer tone especially when u are in service industry...",
      "time": 1743244130,
      "translated": false
    },
    {
      "author_name": "Evelyn Sando",
      "author_url": "https://www.google.com/maps/contrib/100336735344610851685/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV29-A-sA3q84sjQiEcr40WaJLtPHmfvXuUWxyJQy3Tc0WQnfoW=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "5 years ago",
      "text": "I am giving this place 3 star just because their service is quite okay and friendly. This will be quite long review.\nThose who wants to get a haircut, sure go ahead.. But if you want to do hair dye or highlight, you may want to reconsider your choice.\nI asked for the stylist to do the Ash lavender /pink style as per the picture I attached from Google.. She told me that is red not pink, so I asked her to do something similar to that picture. She told me they will get it dark color then after few wash it will become lighter. So okay, I agreed and told her I trusted her. Bad decision!!!\nAfter waited for 5 hours to get my hair done, I got shocked of my life that I got NEON PINK! You can see the picture as well.. I wanted to cry cause this is not what I expected and I have my prewedding shoot in 2 weeks time!!! I don't even dare to ask them to redo the color cause I don't even know what it will become next. I told them this is too bright and keen comparing to the picture, yet they say this is nicer (the neon pink. Of course cause they did this? Damn)\nWill I go back to this place?\nYes and No.\nYes for the haircut as they cut my hair quite decent style.\nHECK NO for coloring my hair.\nI spent total 5 hours, with one bubble tea and $210 for this.",
      "time": 1579694008,
      "translated": false
    }
  ],
  "types": [
    "beauty_salon",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15434021230356932604",
  "user_ratings_total": 191,
  "vicinity": "Blk 27 Bendemeer Road, #01-663"
}