{
  "formatted_address": "28 Dunlop St, Singapore 209356",
  "geometry": {
    "location": {
      "lat": 1.3044918,
      "lng": 103.8540374
    },
    "viewport": {
      "northeast": {
        "lat": 1.305842230291502,
        "lng": 103.8553877302915
      },
      "southwest": {
        "lat": 1.303144269708498,
        "lng": 103.8526897697085
      }
    }
  },
  "name": "Snooze Inn @Dunlop Street",
  "place_id": "ChIJjVRspLkZ2jER3lcJ6RxaEGo",
  "rating": 3.2,
  "reviews": [
    {
      "author_name": "Christopher Chong",
      "author_url": "https://www.google.com/maps/contrib/107064094776222661569/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjURM3yZ5xljsrVf7XTqmE_1txm7QQygtxzpJErbnnWy4FRk4wI_=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 2,
      "relative_time_description": "10 months ago",
      "text": "(+)'s:\n- good customer service - staff were always responsive via email, attentive at front desk, and the managing boss is always in attendance\n- location is walking distance to Little India, MRT and buses\n- rooms have air conditioning\n- cheap\n- luggage can be held on check-in and check-out\n- keyed lockers are available at minimum cost - $2 deposit/$1 rental\n\n(-)'s:\n- the other reviews already describe the ambience of this place well - in all honesty, I feel that this place has given up its expectation of being a reputable accommodation, and accepted that its place in the ecosystem is as a halfway house for migrant workers, or as a homeless shelter. These reviews appear to have said similar for years, thus my conclusion.\n- there is a laissez-faire attitude to ground rules in this place (management don't set firmly, and there's no enforcement) and the overall design has much to be desired. Many areas have fallen into disrepair. Don't come with expectations of comfort or a relaxed stay. This is not the place.\n- the dorms are verging on overcrowded (8 pax dorm). The rotating door of travellers has led to disrepair, and clearly some pest problems - bed bugs, cockroaches, mice all evident. The corridors are stacked with disused bedding, furniture - havens for bed bugs, termites to nest and significant fire hazards. Clean it up. The linen had black markings (bed bugs). Wet, damp, dirty or sweaty clothing hangs from beds leading to room hygiene issues.\n- surely there are some amenities that the hostel can afford to provide at no added cost like soap or shampoo dispensers in the shower? Just small improvements that could lead to a much better ambience and guest behaviours.\n- the demographic of tenants is generally long-term stay migrant workers from the subcontinent. There is little respect for sleep, other travellers or local culture - phone calls and chit-chat in the room take place at all hours. It is what it is, get comfortable. I cannot recommend this place for female travellers.\n- dorm rooms will remain unlocked, secure keyed lockers are the main security for personal items\n- acknowledging that there is a dearth of low-cost accommodation options for travellers in Singapore, this place fills a role - but some reflective self-assessment is overdue as to whether it meets an adequate level of hospitality standards.",
      "time": 1720950843,
      "translated": false
    },
    {
      "author_name": "Citra Yst",
      "author_url": "https://www.google.com/maps/contrib/102428101894360014735/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVJmbdKkO3Du0k8uB02GqmoHTBankgBOeVhUTf5Pm15dfCQGZUbuA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "a year ago",
      "text": "I'm not going back to this place. I stayed at this hostel for a night to attend taylor swift concert. But the room is far from what I expected. They put me in a room filled with old man, while I'm the only woman there. It was damp, dark and smelly. I'm too scared to sleep or take a shower that I had to leave the property at 7 am. The only good point is it was in a good location, close to the mrt and bus shelter.",
      "time": 1710398884,
      "translated": false
    },
    {
      "author_name": "Liyana Nawi",
      "author_url": "https://www.google.com/maps/contrib/117607543313610473112/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSlGNnQy18mnrqMcCx8OEzJ9ggGVeHf8TEWvbJuW_PaImS2JZS=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "2 years ago",
      "text": "Stayed at 4 beds female only dorm. Bad room ambience (compared to other dorm I stayed before at different dorm-style accommodation, this room was very messy with clothes, towels etc hung everywhere). Other occupants were very friendly tho.\n\nAll staffs were very friendly, the receptionist let me check-in early, they communicated well whenever I had enquiries. Location is good too. Surrounded by beautiful shophouses, convenience store is 2 minutes walk, nearby MRT station is 5 minutes walk.",
      "time": 1678538544,
      "translated": false
    },
    {
      "author_name": "diani dilia",
      "author_url": "https://www.google.com/maps/contrib/110972229198168999567/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX3bjjsOfEcBDFhgyuFgBSwkMRfJwcGVvLup2wJpv5_C1O-pZFt=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "The worst place I visited. There is a lot of animal waste and stuffy. It was so dirty. I never going back.",
      "time": 1745702695,
      "translated": false
    },
    {
      "author_name": "George Trantas",
      "author_url": "https://www.google.com/maps/contrib/115950901663902701968/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXYVzCQYINta5FEVsnj8zYsawh7aGwux89nzsjtuQqiZmtv1mIAvA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "It was an awful experience. Although we already knew that it is a hostel, the rooms are more like a storage room, without any window, without space to have a shower (although we booked a private family room with toilet) without towels. And we paid 103€ for a night!! It's very close to metro thought.",
      "time": 1697977222,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7642707647863019486",
  "user_ratings_total": 102,
  "vicinity": "28 Dunlop Street"
}