{
  "formatted_address": "21 Jurong Town Hall Rd, Singapore 609433",
  "geometry": {
    "location": {
      "lat": 1.3351884,
      "lng": 103.7351693
    },
    "viewport": {
      "northeast": {
        "lat": 1.336495480291502,
        "lng": 103.7366831302915
      },
      "southwest": {
        "lat": 1.333797519708498,
        "lng": 103.7339851697085
      }
    }
  },
  "name": "Snow City Singapore",
  "place_id": "ChIJQWNsjwQQ2jERH0aHr25wehw",
  "rating": 3.4,
  "reviews": [
    {
      "author_name": "Charles Mercier",
      "author_url": "https://www.google.com/maps/contrib/100589274327429700438/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVip2EwC6Y6GwTYPVJCcJIDSQiojPURybixac0MY36RzwtW57E=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 2,
      "relative_time_description": "4 months ago",
      "text": "Disappointing Experience with Ridiculous Photography Policy\n\nWhile the design and activities at Snow City are enjoyable, the no personal photography policy completely ruined the experience for me. Visitors are prohibited from using their phones or cameras to capture memories, which feels absurd given we come here precisely to make those memories. Instead, you’re forced into a photography setup that feels like a scam.\n\nPhotographers are stationed everywhere and stop you the moment you take out your phone. The picture prices are outrageous: $88 for two printed photos or $100 for digital copies. We were told we’ll get 45 pictures. In reality, there are only about 8-10 unique pictures, with the rest being duplicates in different templates. To make matters worse, picture prices are not displayed in any obvious manner. Is this even legal in Singapore?\n\nThe ticketing system also seems flawed. There are options for 1-hour or 2-hour tickets, but no one checks how long you stay. Just buy the 1-hour ticket since it’s cheaper.\n\nOn the positive side, the facility’s design is nice, the activities are enjoyable, and the boots and jackets provided are warm and comfortable. Rental gloves were decent too. However, the largest ice slide isn’t accessible for kids under 7, which is understandable as it’s pretty fast.\n\nUltimately, my biggest frustration is really with the photo policy. I wouldn’t mind paying an extra $5 on the entrance fee if it meant I could take my own pictures freely. Instead, I spent the whole time sneaking around to capture moments. This ruined what could have been a fun family outing.",
      "time": 1735457233,
      "translated": false
    },
    {
      "author_name": "Isaac Sam",
      "author_url": "https://www.google.com/maps/contrib/108426703400532001032/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUW-13Wh8cKYmW9wqhB8JlLi0QuC1DVXDaFHN2kPvjkIM_rCN3f=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "3 months ago",
      "text": "Snow City Singapore is a decent attempt at bringing winter to the tropics, but it falls short in terms of attractions and overall experience. The facility is quite small, and there isn’t much to do beyond sliding down the snow slope a few times and taking some pictures. The exhibits and activities feel limited, making it more of a one-time visit rather than a place you’d return to.\n\nThat said, I’ll give them credit for being the coldest place in Singapore, which is a novelty in itself. If you’re looking for a brief escape from the heat or introducing kids to snow for the first time, it might be worth a short visit. Otherwise, don’t expect a full-fledged winter wonderland experience.",
      "time": 1738736459,
      "translated": false
    },
    {
      "author_name": "Peter Yeo",
      "author_url": "https://www.google.com/maps/contrib/110903267602730882054/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWJEJ8r_CjcCa6oeBPvcMhFCtph6LQh66K5KaB3Kve_NvDJDNjD=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "2 weeks ago",
      "text": "Snow city is a tiny store that “replicates” the feeling of being in a place with snow. Temperature inside is a balmy -4°C. The price of the ticket includes shoes and winter jacket. You’ll have to rent pants and gloves if you didn’t pack them. My kids who have never been to a cold country loves it because it is respite from a very hot country. The icy slide is fun and the ice luge looks thrilling if your kids are above 1.2m tall. The bumper cars are a waste of time. If you’ve been to a snowy city in real life, this is utterly disappointing. The snow doesn’t pack for snowball fights. There are 2 slides. One for kids below 1.2m which my kids love but it’s short and one that is pretty high up for kids above 1.2m. My kids didn’t try that because they are not at the minimum height. It’s quite pricey, I paid about $80 for 1 adult and 2 kids, with rental of pants and mittens. They don’t allow you to take your own photos which is why I only have this one taken outside. The vending machine for hot drinks need servicing or an upgrade. I got a hot chocolate that was bitter and sour. The staff tries to be nice and helpful which is, well, nice. To get the photos, you’ll need to pay upwards of $70. Which I kinda regret now because I have nothing to remember this day by. Tl;dr: expensive, small, limited activity in snow but good escape from the heat",
      "time": 1746116515,
      "translated": false
    },
    {
      "author_name": "The Genesis Family",
      "author_url": "https://www.google.com/maps/contrib/114071894759795666732/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV0Le3y0ttLVVohNXZgTsRjbUf2BAA5wWQzzDoJtqRO29-i6Mc=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Snow City offers a unique and refreshing escape from Singapore's heat with real snow and sub-zero temperatures. Enjoy thrilling rides like the Glacier Luge, play in the Snow Village, and marvel at intricate ice sculptures in the Ice Hotel Gallery. While be prepared for the cold and timed sessions, it's a fun experience for all ages. A memorable and \"cool\" outing in a tropical climate.",
      "time": 1743827827,
      "translated": false
    },
    {
      "author_name": "Xiuyun Lim",
      "author_url": "https://www.google.com/maps/contrib/115496490373679864640/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXBS0G0O5HpA_CdHMOZpUzh0VijXRE53F6HtP0rYbXYkf3GF4A=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "6 months ago",
      "text": "No phones allowed in the venue, all photos taken by photographer (which you have to purchase at $88 for all soft copies) appeared blur and convenient. We were told there were 45 photos but upon closer look, there were only 15 photos taken of us with photo borders added onto the same photo to make up the number! Total scam!\n\nCome here for the experience ( totally recommend the drinks vending machine outside the vicinity) but give the photo service a miss.",
      "time": 1731993182,
      "translated": false
    }
  ],
  "types": [
    "tourist_attraction",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2052076200914273823",
  "user_ratings_total": 2146,
  "vicinity": "21 Jurong Town Hall Road"
}