{
  "formatted_address": "1 Sarkies Rd, Singapore 258130",
  "geometry": {
    "location": {
      "lat": 1.3141126,
      "lng": 103.8370897
    },
    "viewport": {
      "northeast": {
        "lat": 1.315517630291502,
        "lng": 103.8383924802915
      },
      "southwest": {
        "lat": 1.312819669708498,
        "lng": 103.8356945197085
      }
    }
  },
  "name": "SO France Café​",
  "place_id": "ChIJMxOrDlgZ2jER1tYED35JiBE",
  "rating": 3.9,
  "reviews": [
    {
      "author_name": "Drew Esa",
      "author_url": "https://www.google.com/maps/contrib/100231074350729929090/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXbY-LlQwgScLqZ3KVkLeyGbC_z9xkRCYEx3j_ij_6uc9Sc2PIL=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "I can't say it's a perfect cheese buying experience, but overall, I enjoyed working with SO France. The cheeses are really good, as are the meat cuts. My wife and I ordered everything through the online store. However, there were a few mishaps during delivery.\nFirst, after confirming all the items and payment, it turned out that one item was out of stock. The guys promptly refunded the money for this position and also as a thank you for their patience put a piece of another cheese to try. And then there was a second mishap, when the courier brought not full order. I had to write to the seller. The courier came a second time, brought a meat cut and again as an apology we saw a small bonus - two homemade yogurts.\nI don't know whether to be sad for the wasted time of the weekend waiting for deliveries, or happy that the seller was so decent.",
      "time": 1735477841,
      "translated": false
    },
    {
      "author_name": "Meep eats",
      "author_url": "https://www.google.com/maps/contrib/115187061216276056878/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVr_B5sphtLOs1leSUNqo3YNcoKORnDFBqwBluJOejcUWT-OhQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "I'm so glad to have found this place in the neighborhood! Here's why.\n\n☕️Coffee is well roasted, dark and robust in the typical French style, brewed at the perfect temperature, smooth, great crema even for a long black.\n\n🍴The selection on their menu is just perfect for most brunch cravings. The way they prepare their food is simple, correct, no frills and just delicious, and not distracted by the latest trends. Simply correct. We had the complète gallette and the bangers and mash, but there were so many other things we wanted to try!!!\n\n🕯Ambiance is somewhat limited by the location, but I think they've done a wonderful job in this context. I'm thankful for the number of tables they were able to put in this small space and how they were still able to bring out the key elements of their branding.\n\n🛒 Bonus points for the épicerie, just like in their other branches. Love.\n\nAdmittedly I do have a bit of bias towards So France, as I am also a supporter of their Duo and Claymore restaurants, but I really think their cafe here stays true to their overall philosophy of getting things right, which says a lot for me.",
      "time": 1717303437,
      "translated": false
    },
    {
      "author_name": "Ada Tam",
      "author_url": "https://www.google.com/maps/contrib/106862868439101958743/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIHPKjA9AqayHvPMOqONBGLdoxfXrHz8jDY6UIlSgTcVqQUrw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "10 months ago",
      "text": "Came here for lunch at around 1pm, almost no more tables. It's self-service style. Just order from the cashier and take your own food.\n\nTook a slice of quiche, one vegetarian Galette and one croque. Food portion is not big but very pricey as a self-served cafe... Food is very average, can get better French food elsewhere with similar price... Quiche tasted more like frittata, can only taste the egg... Salad looks very sad and not fresh... The cheese on Galette was not even melted...",
      "time": 1721547952,
      "translated": false
    },
    {
      "author_name": "HealthcAIre Kim",
      "author_url": "https://www.google.com/maps/contrib/101154220359165719571/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXOiK0fgCq2g7gcyw7y6tTP9LstK3__9pXQlVpEJlRxIZXqqpvchg=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "2 years ago",
      "text": "So France, Sarnies Road: Nobody does bakes and crepes like the French. Absolutely in love with the other 2 SoFrance outlets with the bold splashes of red, white blues. The smaller bistro at Alliance Francaise is packed with patrons close to lunch. It’s a lot smaller with a select retail range but just as classy with the options. Salmon quiche and any form of quiche or bakes are a must. I vote them as having the best canele in Singapore hands down. Oui! #eatstylishtravelstylish",
      "time": 1684643541,
      "translated": false
    },
    {
      "author_name": "Lea Ang",
      "author_url": "https://www.google.com/maps/contrib/103438719171853510808/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXX2Mta9C5bVIuiFPU26VwgJ9T3OUehg_QhWf2Zrps7ces-YoqDZQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Onion soup was really good and we enjoyed the barramundi pasta! This is the 2nd time I've had the pasta. There wasn't any overpowering seasoning so everything tasted fresh and natural, just like coming home to a nice hot meal prepared by a loved one. Café staff are friendly and lovely as usual! Love the ambience too :)",
      "time": 1740188410,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1263340501244106454",
  "user_ratings_total": 42,
  "vicinity": "1 Sarkies Road"
}