{
  "formatted_address": "7 Tampines Street 92, Singapore 528888",
  "geometry": {
    "location": {
      "lat": 1.344633,
      "lng": 103.943348
    },
    "viewport": {
      "northeast": {
        "lat": 1.345863230291502,
        "lng": 103.9447914802915
      },
      "southwest": {
        "lat": 1.343165269708498,
        "lng": 103.9420935197085
      }
    }
  },
  "name": "Soka Preschool",
  "place_id": "ChIJf7BIwmw92jER5hxAkQDVk_E",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Jefferson Han",
      "author_url": "https://www.google.com/maps/contrib/108575237221333397352/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKZTwcu_BZBmFH8HDnQeA7iOhfQ6R4kBH1x-OK4NL7M2HuqwQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "My daughter has been in Soka Preschool since she was N2. She attended another preschool prior to Soka Preschool. Switching to Soka Preschool was the best decision ever, and in my daughter's own words, \"the teachers are kinder and the children are more well-behaved\".  The teachers are very sincere and watched over the well-being of every child, including being sensitive to my daughter's emotional well-being.\n\nWhen my daughter shared with me the values taught by the school, I was impressed, and inspired too. Academically, my daughter had fun learning phonics and chinese, as well as P1 preparation such as being independent, learning how to use money to buy food during school outings and handling their own trays.\n\nWould absolutely recommend this school, and enrolling my younger son in Soka Preschool as well in future.",
      "time": 1732327751,
      "translated": false
    },
    {
      "author_name": "Qian Ru, Yvonne Goh",
      "author_url": "https://www.google.com/maps/contrib/107658992605036932778/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL02yhHv1BtUV-EJwuO2o9u5S6XiCBNvoH7rLfwIxr3Om_LEg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Education is the best gift that we as parents can give our child - not material gifts\n\nHere at Soka Preschool, I genuinely feel that the teachers and principals are all committed to nurturing the students to become the best treasures for the future as confident global citizens 🌎\n\nFrom news article sharing where students are empowered to stand in front of the class to discuss current affairs, social and environmental issues, to conducting experiments to learn science, and even pulling off an “independence camp” where kids go for excursions in public buses, order their own food with cash, prepare their own breakfast, the curriculum is intentional, thoughtful and meaningful.\n\nGiving the child an appreciation of what lies beyond our shores (language and cultural diversities) is a first step to becoming ready for the world and Soka Preschool is intentional about providing this awareness\n\nI am always impressed by my child’s sharing of what she learnt in school - for example, she is able to tell me about solar system /  planets in mandarin, share about how the respiratory system works, how to say “hello” in various languages and knows what the seven continents are.\n\nIt’s not about regurgitating information that impresses me, but the fact that she was excited and able to share, I think this shows that she genuinely enjoyed and understood what she learnt.\n\nThank you Soka Preschool ❤️❤️❤️",
      "time": 1732355193,
      "translated": false
    },
    {
      "author_name": "Albert New",
      "author_url": "https://www.google.com/maps/contrib/110335040019268741973/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJd00qgGMkxmqstKjcDxgjp5eEMkgJhnrwUBBCMECQnmHla11zR=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My kids went to this school! Very embracing culture, very motivated teachers and nice environment! Thanks 🙏👏🙏👍💪",
      "time": 1694166023,
      "translated": false
    },
    {
      "author_name": "Josephine Sim",
      "author_url": "https://www.google.com/maps/contrib/115337164388785989199/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU58wLTgcrQk0CcFDiKr9e6QdPLQID1wiLAOhYuG-xQX_UONncQIg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "A wonderful preschool environment, with huge spacious classrooms and hall. All my kids enjoy their time in the school. The teachers are all passionate, dedicated and positive to each and every child. Curriculum is complete and lots of activities and fun through their learning journey!",
      "time": 1615467556,
      "translated": false
    },
    {
      "author_name": "Eugene Teo",
      "author_url": "https://www.google.com/maps/contrib/103788337059661578865/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWO1tQm_hx50UApgFRIaCC4QekF5a5y_KuHNHdKhS3YZi_NgLvK=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "7 years ago",
      "text": "Thanks to the quality education here I am now in a very good dream secondary school. Wonderful place with supportive teachers and sufficient infrastructure. Good old memories where I used to play in the sheltered play ground area.",
      "time": 1517313244,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17407491183130713318",
  "user_ratings_total": 17,
  "vicinity": "7 Tampines Street 92"
}