{
  "formatted_address": "Medini Iskandar, Lot 5, Jalan Medini Utara 4, Medini, 79200 Iskandar Puteri, Johor, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.4263685,
      "lng": 103.6350295
    },
    "viewport": {
      "northeast": {
        "lat": 1.427715680291502,
        "lng": 103.6363470302915
      },
      "southwest": {
        "lat": 1.425017719708498,
        "lng": 103.6336490697085
      }
    }
  },
  "name": "Somerset Medini Iskandar Puteri",
  "place_id": "ChIJT2Zpv4kL2jERgYgTQKBkMcI",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Dzianti Yanti",
      "author_url": "https://www.google.com/maps/contrib/111619959577128502832/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXxwVdgVAOqtO5HSw2GwqaCGQz0YHsaRDHnuvk92ESrn0fnceNp=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We had a wonderful stay at Somerset Medini! It's just a 6-minute walk to Legoland, which was super convenient for our trip. I booked the Studio Executive with a Legoland view, and it was absolutely beautiful especially during sunset. Although the balcony was locked for safety reasons, I appreciated the thoughtful precaution from hotel management.\n\nThe location is great, right between Legoland and Gleneagles Hospital, with nearby food options and Ben’s Supermarket just around the corner.\n\nIf you're booking the Studio Executive, do note that the room has only one air conditioner. It was a bit slow to cool down at first. The hotel engineer explained that the air conditioning is motion-sensor-based, so it turns off when there's no one in the room, even if the key card is inserted. It took almost 45 minutes for the room to reach a comfortable temperature.\n\nAs for breakfast, it was very basic. We only went once and decided to explore other options for the rest of our stay.\n\nA big shoutout to Nora at the front desk, she was incredibly helpful and provided great recommendations for cafes, dinner spots, and things to do in Johor.\n\nAll in all, we had a great night's stay and would definitely recommend Somerset Medini to others.",
      "time": 1745032827,
      "translated": false
    },
    {
      "author_name": "Apple Oh",
      "author_url": "https://www.google.com/maps/contrib/105504135263991451797/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJqtRpGDTRtqadcgzbHQ5I2OJyINV5CS_fQqYfyvx0vG92guw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "We were served by well trained Nik on Sat & Mon mornings & would like to commend her for providing excellent service on check in/out process, room & breakfast arrangements.\nStaff at restaurant was proactive & friendly. Breakfast spread was quite comprehensive & satisfying. Enough to fill our stomachs before starting our Legoland adventure.\nApartment provided was clean, spacious & well equipped. Beds were big & comfy; black out curtains to ensure we slept well. No housekeeping required since only stayed 2 nights. Would be good if shower heads were adjustable as they were fixed quite low. Aircon was cold enough. Comfortable stay walking distance to Legoland & Medini Mall. Parking available at small fee.",
      "time": 1742450527,
      "translated": false
    },
    {
      "author_name": "Jeannie Koh",
      "author_url": "https://www.google.com/maps/contrib/101960274797057785659/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIi_-Qp89SOWOMV5IH8JDSSTh4gIIRhND6ZeoAQ0RckVyO6Nw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Pleasant stay at this place. Fully furnished with all the necessities that one may need. Clean unit. Friendly service with a smile every time I see a staff. Truly thankful for accommodating my early check-in and late check-out request, makes it easier for my planning as I brought my elderly mum along. Location is good and reachable by Bus CW7L.",
      "time": 1738222731,
      "translated": false
    },
    {
      "author_name": "Zuhrirahimi Ramli",
      "author_url": "https://www.google.com/maps/contrib/105082905557936548427/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIrSBaZvGeHmqR0iu2KQKp8JCuQPqijKTaibsxt-fczEm7f8g=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Fast and easy check in ; access cards already prepared when we arrived, no other filling in forms, very friendly counter staff. The 3 bedroom apartment is very spacious,  well equipped kitchen you can make small meals at, washing machine with given detergent. Down stairs there's a 7-11 and mini market. And Mall of Medini and Legoland is about 100m walk. No in room dining though",
      "time": 1743467493,
      "translated": false
    },
    {
      "author_name": "Jason Koh",
      "author_url": "https://www.google.com/maps/contrib/101427859454066584926/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXrjBGd2AHJW8jAEGAy_Uc6ZmPFvfW3ejdsOAF5eJo44ZJZeiWT=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 3,
      "relative_time_description": "a week ago",
      "text": "Other than the room price being good given its size, there were many things that was bad. The free wifi was so bad that probably even a small boutique hotel might be faster. Even after switching to ASR member wifi its still equally bad so im not sure whats the point. The rooms have dead corners that we can see packs of dust and the bed that we had was very noisy as well.\n\nI would recommend for the value of money and close to Legoland but this place has many more areas to improve.",
      "time": 1746856300,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13993076156649408641",
  "user_ratings_total": 1430,
  "vicinity": "Medini Iskandar, Lot 5, Jalan Medini Utara 4, Medini, Iskandar Puteri"
}