{
  "formatted_address": "60 Yishun Ave 4, #02-09, Singapore 769027",
  "geometry": {
    "location": {
      "lat": 1.423965,
      "lng": 103.8408203
    },
    "viewport": {
      "northeast": {
        "lat": 1.425265080291502,
        "lng": 103.8420722802915
      },
      "southwest": {
        "lat": 1.422567119708498,
        "lng": 103.8393743197085
      }
    }
  },
  "name": "Sonic Bowl @ SAFRA Yishun",
  "place_id": "ChIJq6qqwmsU2jERJ-XIVCE0mZs",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Joe D'Mango",
      "author_url": "https://www.google.com/maps/contrib/103344826793927451058/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWFxLbF2n6JS7H8fxi8G0vsqpo8--Fea2UVaIAz3k2MnTDrCkei=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "2 weeks ago",
      "text": "Bowling Lanes: The lanes can be a bit hit-or-miss—sometimes they’re good, but other times, issues arise. Your ball might not return and could get stuck, the pin setter may fail to set all the pins properly, or worse, your ball could end up with a deep gouge.\nIf you want to bowl on a freshly oiled lane, aim to play 1–2 hours after they open; otherwise, you'll be bowling on a very dry surface. Unlike other bowling centers that consistently oil their lanes in the evening, this one seems to skimp on oil. That’s why, if you’re bowling in the evening, it’s best to bring a medium/light oil lane ball.\nLocation and Environment: It is conveniently located near a bus stop but far from the MRT. There are a few restaurants nearby, so you can grab a meal after bowling. The pro shop inside the bowling center offers equipment, and the overall ambiance is pleasant.\nStaff: The staff are friendly and very accommodating.",
      "time": 1746574736,
      "translated": false
    },
    {
      "author_name": "Rae Gus",
      "author_url": "https://www.google.com/maps/contrib/100148417347763009882/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUka69abz9Jt-F2pyn62wo2DgIEr_Q5JN2_GS9UrRO6BLOwZRyj=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "10 months ago",
      "text": "First time here. Good lanes. Well maintained and oiled. Doesn't give the hollow-thud sound which helps minimised sound disruptions. Would come back again with a pleasant gesture i hope.\n\nCoz unfortunately my first visit was not so welcoming. Staff didn't accede to my request for 2 separate lanes when there were no crowd at all. See pic. Saying that they expected a big turn out which turned out to be less than expected -_-\n\nThen I realised there will be coaching in the afternoon. Could that be the reason they contained the lanes, maybe. Oh well..\n\nThere are bowling shop, cafe, darts & 2 pool tables. Some comfy couches and high table stools for spectators or diners..",
      "time": 1719992030,
      "translated": false
    },
    {
      "author_name": "Hamzah Rafi",
      "author_url": "https://www.google.com/maps/contrib/114498186242334419287/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWaK3IEgUnJgbULni1iDCeufGoaEQhY3Df4z_ooI_-KgwuMHyvi=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Lady in glasses and guy told us that we should have called before bringing a cake, bowling place didnt bother picking up the phone. Still charged as $2 per person for bringing outside food, the funny part is that the people on another table were drinking beer maybe coz they were white people, the irony.\n\nI get it its \"your\" cafe thats why no one buying their stuff coz its so bloody expensive.\n\nLanes are dry and light oil, cant even reset the pins, 0 kiosk at all. Counter staff need to brush up their professionalism, called 3-5 times and never bothered to pick up. So people who goes there for the first time doesn't know how things are there. Don't even bother coming, they act like they own this place, customer service is worst than how they treat you in the army.\n\nSurprised the bowling place is recognised for its discrimination, should just shift the entire bowling centre back to the US.",
      "time": 1744974173,
      "translated": false
    },
    {
      "author_name": "40_CS",
      "author_url": "https://www.google.com/maps/contrib/113480902884666184939/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXrHNpOva_ZINrsgvAu1gPZSbFggXQRtl-AADSGGJxYLW4Aqacp=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 2,
      "relative_time_description": "6 months ago",
      "text": "2 November 2024\n\nReally bad customer service from full time staff\n\nThere is this short haired aunt wearing spectacles lady who is really rude.\n\nWe had only 1 game left and decided to ask if we can just extend it just for a game. The part timer (kudos to him) was really helpful and is willing to extend for us but then this lady budge in and told my friends in a rude manner that we had to pay if we want to continue playing.\n\nAlthough it is not wrong, she can politely tell us instead of being rude about it. We’re only 1 game short to a full round.\n\nAfter us, she also talked really rudely, at some point it sounds like shouting, to a Malay family who is trying to understand how the PAssion discounts work till they have to tell her to calm down.\n\nThanks to her, our day is ruined but kudos to the male part timer wearing spectacles for trying his best to accommodate for us. Would definitely rate this place a 5 stars but the lady has to ruin it all…",
      "time": 1730554445,
      "translated": false
    },
    {
      "author_name": "Stephen Curry30",
      "author_url": "https://www.google.com/maps/contrib/116273573825927264013/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI9xyr_dyvG6iwe6-kBR_D3aCnD6Ku8zlsohiB4EE3BwHMkzg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "A bowling alley that prides itself on charging a premium far beyond other options like Hometeam NS. Clearly, you’re paying for something—but it’s certainly not good service.\n\nThe highlight? Being told by the ever-so-charming staff that, despite the lanes being pretty empty during off-peak hours, bowlers have no say in which lane they want to play. A first for me, and not in a good way.\n\nAnd the cherry on top? They tried to charge me by the hour without informing me upfront, then generously advised me to ‘bowl faster’ to get my money’s worth. Truly revolutionary customer service.\n\nMight be time to consider some much-needed staff retraining—just a thought.”",
      "time": 1734678238,
      "translated": false
    }
  ],
  "types": [
    "bowling_alley",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11212050065076577575",
  "user_ratings_total": 675,
  "vicinity": "60 Yishun Avenue 4, #02-09"
}