{
  "formatted_address": "4 Defu Lane 10, Singapore 539185",
  "geometry": {
    "location": {
      "lat": 1.3595747,
      "lng": 103.895053
    },
    "viewport": {
      "northeast": {
        "lat": 1.360870080291502,
        "lng": 103.8965516802915
      },
      "southwest": {
        "lat": 1.358172119708498,
        "lng": 103.8938537197085
      }
    }
  },
  "name": "Soon Lee Fish Porridge Seafood Soup",
  "place_id": "ChIJceb9xMsX2jERbTXp7rEuZVE",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Alvin Chan",
      "author_url": "https://www.google.com/maps/contrib/111046250399001491357/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX88oBpS83wTmbGeQSAqMLfnQxO01Wf8uSRHxVnJh_ORLrDS7COlA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "Stumble upon Soon Lee when finding ‘comfort food’.\nMade a trip down to Defu which is an industrial area but you will not be disappointed.\n\nFish head & pomfret was fresh and very generous with the pieces. Soup was flavorful.\n\nBeware of lunch crowd though.",
      "time": 1736977306,
      "translated": false
    },
    {
      "author_name": "Touristmouse",
      "author_url": "https://www.google.com/maps/contrib/110409011587721664076/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVQwdnnLVXAyDc72dXSDd23W5Gz3eSWS0b1idu6OY0BJjmLShxezg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "I travelled all the way to Defu Lane on a Saturday and even though lunch has passed, there was a queue. Thankfully, it moved quickly.\n\nThe menu offers a few types of fish. As expected with Traditional Teochew fish soup, their carbs are limited to rice or rice vermicelli. As this was my first visit,\nI played it safe and ordered the batang fish in a big portion ($8) with rice vermicelli included.\n\nThe light broth itself is surprisingly flavourful. A couple of lettuce pieces add a refreshing touch, but the real winner is the fish. Incredibly fresh, thickly cut, and perfectly marinated, the texture is delightful. I never thought I'd enjoy rice vermicelli with fish soup, but Soon Lee changed my mind! The rice vermicelli soaked up the flavor of the broth beautifully.\n\nMy only minor complaint is that they sell out of bitter gourd early, which would've been a nice addition. On a brighter note, I heard they recently opened new branches! I just hope they can maintain the same high quality across all locations.\n\nUpdate: Several months passed and this OG remains my favourite fish soup in 2024.",
      "time": 1727703155,
      "translated": false
    },
    {
      "author_name": "Jacob TAN",
      "author_url": "https://www.google.com/maps/contrib/114080558508206655685/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUv7ChYSn_mkLArSNaLDWMUf1ZDQof9r4wk1hpAqCrkFj2Y3mn2=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "9 months ago",
      "text": "Soon Lee fish soup now has many outlets. This stall has been here for the longest time. It used to have very long queue but nowadays, the queue is shorter. Probably because there are many outlets or that the current set of people running the stall are much younger and faster. The taste of the soup is not as tasty as before. However, the batang fish is very fresh and the fried fish are crispy and tasty.\nI like that this stall has both the chilli and garlic/ bean paste sauce.\nWill try the steam teochew style fish the next time.\nService is fast.",
      "time": 1724384899,
      "translated": false
    },
    {
      "author_name": "Yi Ling",
      "author_url": "https://www.google.com/maps/contrib/115707001285123682601/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUlkcK6FpBb-Q_EER2W7ON8uPix2iL97NAPchaAE0TxCULNloBN=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My parents, who are fish lovers, are obsessed with their fish soup!\n\nI was thinking of gate keeping this place because of its already very big crowd base early in the morning. Pictures taken here are at 10 am, and you can see the long queue already.\n\nService wise, they require a better queue and ordering system because everyone is scattered, and some people started getting upset because others before them got their food when it was a mistake order given. 🥲\n\nFish is extremely tender and fatty. The cuts are thick, and the fish oils are still very fragrant. Fish roe is also fatty and soft. Fish head is a must order for fish lovers! The soup is sweet with the aroma of fish and garnished with garlic chips and spring onion! Otah is a dollar and a nice addition as well!! 😊",
      "time": 1689994880,
      "translated": false
    },
    {
      "author_name": "Ivan Teh",
      "author_url": "https://www.google.com/maps/contrib/114332345573544911646/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV5w6w1Nz613H-FTdYMJdrdrsR43y5bcInG5AtU7Oxf59DHDoeK=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Fish Soup (SGD $8.50) @ Soon Lee Fish Soup.\n.\nEstablished in 1990, this hidden find is 'cheap and good', beloved by taxi drivers and labourers for their fresh ingredients and large hearty portions. No surprise they draw long queues during meal times.\n.\nThe soup is clear and non-greasy, yet robust with a gentle sweet savoury flavour. Garnished with crisp lettuce and fried shallots which lend vegetal savoury sweet salty flavour.\n.\nThe large boneless fillets of mackerel fish, both fresh and fried, are chunky tender flaky in texture, with lovely sweet savoury flavour, very clean-tasting and fresh. Really quite addictive.\n.\nThey also offer optional add-ons, including bitter gourd, fish roe, and more. I like adding some of the chopped bird's eye chili / chili padi for added salty spicy kick.",
      "time": 1714490918,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5865145431472289133",
  "user_ratings_total": 227,
  "vicinity": "4 Defu Lane 10, Singapore"
}