{
  "formatted_address": "101 Thomson Rd, #B1 - 10 United Square Shopping Mall, Singapore 307591",
  "geometry": {
    "location": {
      "lat": 1.3171474,
      "lng": 103.8435716
    },
    "viewport": {
      "northeast": {
        "lat": 1.318498030291502,
        "lng": 103.8451155302915
      },
      "southwest": {
        "lat": 1.315800069708498,
        "lng": 103.8424175697085
      }
    }
  },
  "name": "Soup Restaurant",
  "place_id": "ChIJswRqCegZ2jERkzvdDnu8ero",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Jamie Lee",
      "author_url": "https://www.google.com/maps/contrib/116578151662681547933/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWVhaATjXEVv3_Fwl0gXm_frtRbE4gBwhnYeiZmLc1Hv0GTBNs=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "First time at this branch today (weekday) for lunch. Were told the serving may take longer than usual around 20min and we acknowledged. However we took almost 1 hour to finish the lunch, the last veggies took almost 40min to serve us. The overall long waiting was unpleasant despite there’s no crowd.\n\nHowever the foods and serving waiters were good so will not under rate them",
      "time": 1741687782,
      "translated": false
    },
    {
      "author_name": "Florence Leow",
      "author_url": "https://www.google.com/maps/contrib/102656561598060120185/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWWAO5NDzda0lWfeRJhWD1zQtDlUm5XL-zVuqnQGNv9Rilxc3M7=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "🟫 I've been here to this Soup Restaurant at United Square several times over the years. It was a friend who took me here years ago to try the food.\n\n🟧 The dishes are always scrumptious and well-executed. It's like homecooked comfort food.  I am sharing throwback food photos and recent pictures too.\n\n🟨 My family members have dined here before too, as we live nearby in Toa Payoh and Novena areas.\n\n✳️ I must say the prices are reasonably priced and service is attentive and efficient. 🔷️ Taste wise, the Samsui ginger chicken is always delicious and I like their braised tofu too.\n\n🟦 The Soup Restaurant ( at United Square) was previously all brown in colour. They had renovated it recently to all white. 🟧 It's a restaurant that serves consistently good food, so I recommend it.",
      "time": 1732676867,
      "translated": false
    },
    {
      "author_name": "Tony Gui",
      "author_url": "https://www.google.com/maps/contrib/102919339340423609938/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWHDXkzvexEfPdADljAY13kCcQme6UUSvhEZFmBkSNU0XZb8mM8LA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "We just celebrated my mother-in-law’s birthday at Soup Restaurant today 28 Sep'24 (Saturday) at the United Square, and had a wonderful time. Our reservation was at 6.30pm, and we were being promptly ushered to our room.\n\nThe food was delicious as usual, but what truly made the evening special was the impeccable service provided by Ms. Zoe.\n\nMs. Zoe was attentive, friendly, and went above and beyond to ensure that our entire family had a memorable experience. She was thoughtful in every aspect of her service and even surprised my mother-in-law with birthday buns, making the celebration feel extra special. Her warmth and professionalism truly stood out.\n\nWe are so grateful for her dedication and personal touch, and we sincerely hope that her efforts are recognized by the management team. Thank you, Ms. Zoe, for making our dining experience unforgettable! 😄 👍",
      "time": 1727531326,
      "translated": false
    },
    {
      "author_name": "Hrmgr",
      "author_url": "https://www.google.com/maps/contrib/113770174448938389729/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLqnb6aXPKqLBnCIKwaSt7YY6gBBZLl0tX7UWSIc8mx4QGnGg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "3 months ago",
      "text": "Thought of giving ownself a treat for CNY and ordered few dishes but could not say enjoyed the food. Sambal Kangkong ended with a bitter taste as the sambal was over fried though presentation was still good. Claypot Tofu had nothing except deep Fried egg tofu topped with a thick sauce. Sauce is sweet with minced garlic I guessed. Taste ok at first but the bitterness from the garlic emitted after a while. The Fish Maw soup is also a let down for a soup restaurant. A piece of this fish Maw with half Bok Choi. You can tell it was not a double boiled soup as the Bok Choi was still green yet the fish maw still not soft inside. My only enjoyment was the Sweet and Sour Pork which was cooked to standard. Nevertheless service was good. Another part that I won't understand is the Jasmine Rice is not cooked to the supposing softness in Singapore for most restaurants. The Rice is on the hard side while Jasmine or Homali Rice is supposed to be soft. The texture tasted like those Thai white rice which depicted the purpose of choosing the Jasmine rice. $80 for 1 pax for the 4 dishes let you pondered the pricing.",
      "time": 1738137368,
      "translated": false
    },
    {
      "author_name": "Christy Lo",
      "author_url": "https://www.google.com/maps/contrib/113263378276882410978/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVF-KT2ro2kRFHhCrozQorE_H_K7jH7Ph5DlmzMUvjQl6EM4aI=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "As a loyal patron of Soup Restaurant in United Square, visiting at least twice a week, I can confidently say that our family's experiences are consistently delightful. The sour pork fried rice and egg yolk fried rice never disappoints.\n\nJia Yi and Alice’s attentiveness, friendliness, and efficiency ensure that our family always feels well cared for. Over time, we've developed a warm rapport with the regular staff, making each visit feel like a homecoming.",
      "time": 1724042927,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13437259674929675155",
  "user_ratings_total": 368,
  "vicinity": "101 Thomson Road, #B1 - 10 United Square Shopping Mall"
}