{
  "formatted_address": "1 Tessensohn Rd, #01 09, Singapore 217701",
  "geometry": {
    "location": {
      "lat": 1.3165887,
      "lng": 103.8577167
    },
    "viewport": {
      "northeast": {
        "lat": 1.317983730291502,
        "lng": 103.8590233302915
      },
      "southwest": {
        "lat": 1.315285769708498,
        "lng": 103.8563253697085
      }
    }
  },
  "name": "Sourdough & Brew by Baking with Gina (@bakingwithgina)",
  "place_id": "ChIJ8bdWS_oR2jER2ejUFYtvK-Q",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Sera // IG: diningwithsera",
      "author_url": "https://www.google.com/maps/contrib/118301436723641326928/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX9NCc6stGTNIHPixhaC27p8dOFlcSoDAsI6AA2DU2i2sTIPw0=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "This cosy café-kitchen serving everything from sourdough bakes (sweet/savoury bagels, cookies, waffles) to freshly-brewed coffee & matcha — all lovingly prepared from scratch.\n\nHad a chat with the owners, who, on top of running this impressive café (imagine waking up at 2-3AM to start prepping), are also loving parents to 3 kids. Mad respect. I also thought it was really cute that they incorporated their son’s doodles into their logo!\n\nWe had their iced matcha latte with oatly milk ($9 + $1). Made with Niko Neko (yes, the one that everyone knows & loves), our cup of matcha was smooth, rich and not grainy. We opted for this drink to be mildly sweetened. Probably one of the better matchas I had.\n\nmanaged to try their hojicha latte with Oatly Milk ($8 + $1) and went for the non-sweetened version which was toasty, nutty, & so dreamy. Had to close my eyes to fully enjoy the flavour of this 🥺\n\nMadeleines are $3.80 for a pair. This was buttery sweetness without being overwhelming, crisp edges & exterior. Will definitely be back for this !!\n\nAlso tried their eggcelent waffle (such a cute name btw). Crafted with French buttered oats & wholesome ingredients. The waffle was fluffy & not too sweet, pairing perfectly with scrambled eggs that were cooked just right & seasoned well.\n\nBeefy Tom ($14) is a soft, chewy pomodoro sourdough bagelwich packed with beef pastrami, gouda cheese, cream cheese, & tomato. We had this and it was decent, though I preferred their other menu items.\n\nThis is definitely a place worth visiting, whether it’s for a chill solo date or cosy catch up with loved ones :)",
      "time": 1744899466,
      "translated": false
    },
    {
      "author_name": "niko h",
      "author_url": "https://www.google.com/maps/contrib/111400150275683464211/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLIS4YrVZOFaIMe6mtyir4r8-fxyJ_3PRDhQh-AYFTsSd6McHk=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Tried the Raspberry Matcha with Oatmilk (S$10.50) and it was one of the richest matcha lattes I’ve had in Singapore. The unsweetened Niko Neko matcha balanced beautifully with the sweet and tangy raspberry jam, such a unique combo that really works! Price is a lil steep, but tbh I’d say it’s worth the price. I also noticed they had sourdough bagels and loaves. The bagel shelf was completely empty when I got there, so they must be popular!",
      "time": 1745129237,
      "translated": false
    },
    {
      "author_name": "Yan",
      "author_url": "https://www.google.com/maps/contrib/117928612654810910499/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJb3bBq5Z2TtAt39staBQyjzkpMnNyRd58Ga2-hEjHWJY2dnw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "A small, cozy spot with delicious bagels! While there's definitely potential to elevate the fillings with more creative ingredients and sauces, the sourdough bagel itself was excellent. The drinks were full-flavored—not watered down at all—and it was clear the owners take real pride in what they serve, even taking the time to ask for feedback. The atmosphere was very warm and welcoming.",
      "time": 1746780675,
      "translated": false
    },
    {
      "author_name": "Charlotte Ho",
      "author_url": "https://www.google.com/maps/contrib/107836848857076810060/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUEzE4xkfqCz2XqzMDRs5rU2R4yoMsKjwfssh9e1HAOcIrKZmUl=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Small, cozy café. This is my second year enjoying their amazing pineapple tarts—perfectly balanced with buttery French pastry and tangy pineapple that melts in your mouth. I also tried their Egg Tom Bomb bagel, which was delicious with its perfectly toasted texture. The hot dark chocolate drink was rich and not overly sweet, making it the perfect comforting beverage. Consistently excellent quality and flavors. Highly recommend for anyone looking for a satisfying treat or light meal. For those driving, you can park your car at the roadside parking (few slots available) or behind Race Course Road.",
      "time": 1737623782,
      "translated": false
    },
    {
      "author_name": "Elnathan Ng (Crest_ss)",
      "author_url": "https://www.google.com/maps/contrib/100054940938785706229/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ2gRg9bLzOR4JwK2PwbZHH7zDCRiEg6-fKjwqhZBErSJweAA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Loved this blueberry sourdough bagelwich! Fluffy eggs, ham, cheese, and tomato in a soft yet chewy, slightly sweet bagel. It’s usually served with wholemeal, but the blueberry twist was a nice surprise. Paired perfectly with their iced vanilla latte too!",
      "time": 1746613375,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "bakery",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16441357507803539673",
  "user_ratings_total": 127,
  "vicinity": "1 Tessensohn Road, #01 09"
}