{
  "formatted_address": "10 Bayfront Avenue, Hotel, Tower 2 Level 57, Marina Bay Sands, Singapore 018956",
  "geometry": {
    "location": {
      "lat": 1.2833034,
      "lng": 103.8605846
    },
    "viewport": {
      "northeast": {
        "lat": 1.284153180291502,
        "lng": 103.8616356802915
      },
      "southwest": {
        "lat": 1.281455219708498,
        "lng": 103.8589377197085
      }
    }
  },
  "name": "Spago Dining Room",
  "place_id": "ChIJ8dGY8gYZ2jERVd0Lk3OwpIs",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Qin Lin Tan",
      "author_url": "https://www.google.com/maps/contrib/111632239506158383639/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXfNpZzr5elf_Tv0u50bnptP3iaTV67T4uwrSnx6k4EDFJwZI-N=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Celebrated my friend’s birthday at Spago and had a wonderful experience! We initially sat outdoors but was promptly moved indoors when it started pouring. Thankfully, the staff made the transition seamless.\n\nWe received exceptional service by Dana. She was warm, attentive, and made us feel truly welcome.\n\nFood wise, we each had the set lunch, which was great value for money. Every dish was well-executed and delicious. We had the sea-bream tartare and tomato tripe for appetiser, salmon and octopus for mains, panna cotta and tea for dessert.\n\nHighly recommend for a special occasion or just a lovely lunch with a view! We will definitely be back.",
      "time": 1745055142,
      "translated": false
    },
    {
      "author_name": "ReversedPi (JacxT)",
      "author_url": "https://www.google.com/maps/contrib/107482772624922927196/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWL3s4qWMqtdM5lIBzgrEQKuZgOg5mCFZWV6AMF7WMwkc5FfULt=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "To be very honest, we really expected more from a starred restaurant. The service was not satisfactory, and the food was not that fantastic.\nWorthy food recommendations: Agnolotti with porcini mushrooms and USDA Striploin.\n\nLet’s go through the service together shall we?\n1) phone reservation was hell, they started reading their t&c word by word on the phone during the first call. They called multiple times during weekdays working hours to “hunt” for the deposit; we were well within the 24 hours grace limit.\n2) we said we had a reservation (at the restaurant concierge) but we got transfered to the bar/alfresco area before getting redirected back to the restaurant (we had a wheelchair diner, mind you, so we had TWO detours with the wheelchair alr at this point)\n3) during the call we specifically mentioned that we had a diner with wheelchair, but when we reached, they did not prepare the ramp beforehand (yes there are two steps and a blue wooden door to reach the dining hall) and we had to wait outside the outdoor porch for a good 10-15mins. After we pushed the wheelchair up by ourselves no one opened the (dumb) blue door for us. For what the door you may ask? No idea\n4) when we were sat, there was no one to recommend and explain the course menu (they only provided course menu, and we had to ask if there is a separate ala carte menu before it was offered to us). No one explained the dishes in detail during serving as well - i really feel this was a shame on their service side\n5) during the service, the waitress was waiting for us to finish our appetiser before serving the mains, but we couldnt really finish one of the appetisers (we shared our dishes); but no one came to ask if we would like our mains to be served soon\n- our whole dining experience took almost 3 hrs\n6) when paying, they did not offer the parking coupon (maybe they didnt think we drove?) - but i think as a service they should ask every single paying customer.\n\nPS: don’t bother with their desserts.",
      "time": 1745733880,
      "translated": false
    },
    {
      "author_name": "Jane Tan",
      "author_url": "https://www.google.com/maps/contrib/114091783467620400092/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJB0hFtYvZxuFlBg7CPew3kTLEs-VhIXDoJO4pM5fqwyzPecw=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "5 months ago",
      "text": "Dining at Spago is always a pleasure, and after several visits, it is clear why this place continues to shine. The food is consistently excellent, with a menu that never disappoints except for the desserts. Having tried almost every dessert on the menu, I can confirm none are on par with the quality of the other savoury dishes. It feels very underwhelming compared to the restaurant’s overall high standards.\n\nThe flexibility with the seating arrangement is a plus —whether indoors with the elegant ambiance or outdoors by the pool, the backdrop is the perfect complement to the refined dining experience.\n\nService is another highlight. The staff makes an effort to engage in small talk, adding a warm and personal touch.\n\nSpago remains one of my top choices for a nice meal due to its ambiance, service, and exceptional food offerings—worth visiting again and again. But if you are not going for the set meal, you can probably skip dessert.",
      "time": 1732587029,
      "translated": false
    },
    {
      "author_name": "Randy Ngatimin",
      "author_url": "https://www.google.com/maps/contrib/107076346774947547605/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVrOmYt44zEI0vlSVryLVsPyEVrlKk31zGK-ZI7_7zT3kTGzErV=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Wonderful experience dining here at Spago. Good view and good service. Food is great too. The cod is nicely cooked, steak is made well too. The salted caramel soufflé is also not too sweet; light dessert to end the meal. Great place to celebrate a special occasion.",
      "time": 1739374221,
      "translated": false
    },
    {
      "author_name": "Shuyan Lin",
      "author_url": "https://www.google.com/maps/contrib/108690005246261390198/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWSgQ4UQ9dy-7ZCiwaYsrkMPn7gF9_4KneHJNd2zCy9YufnfF0=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We had the 3 course lunch set. Loved the buratta starter and quail main. Very well executed and flavourful! We topped up for the Kaiserschmarrn which was humongous but really tasty.\n\nShout out to Joan and Sheila for the excellent service :)",
      "time": 1743605301,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10062361477887286613",
  "user_ratings_total": 1927,
  "vicinity": "10 Bayfront Avenue, Hotel, Tower 2 Level 57, Marina Bay Sands"
}