{
  "formatted_address": "450 Clementi Ave 3, #02-293, Singapore 120450",
  "geometry": {
    "location": {
      "lat": 1.3135577,
      "lng": 103.7654405
    },
    "viewport": {
      "northeast": {
        "lat": 1.314870030291502,
        "lng": 103.7667086802915
      },
      "southwest": {
        "lat": 1.312172069708498,
        "lng": 103.7640107197085
      }
    }
  },
  "name": "Special Learners",
  "place_id": "ChIJnYdcUYEa2jERv4GSfzW9c6Y",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Claudine Chew",
      "author_url": "https://www.google.com/maps/contrib/109028865007118182253/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWo__18KnnasepRLIS5sazACdDdUC1u7lUzSzWyt7JCoH0-oGP3Lw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "It's been a fruitful year for our boy at SL, which is a wonderful community of great teachers, amazing friends & lovely aunties. Always felt welcome from the beginning & constantly inspired by the patience & love from the teachers & aunties. Forever grateful that he is surrounded by such great vibes at school everyday. Love the monthly learning themes & daily photo updates.\n\nWe've been to many outings like swimming, movie, visiting friend's home, supermarket shopping, Bouncy Paradise, Singapore River Cruise, Bird Paradise & Halloween Trick or Treating. It's always a joy to be able to join them as a parent & witness how they are never afraid to bring the children out despite the struggles.\n\nHe has also enjoyed parties at school like pajama movie, festival celebrations & birthday celebrations and had regular barber visits. There was also a pet dog & cat invited for interaction with the children, which our pet dog was also invited & she also had a great time playing with them.\n\nHe has progressed so much on sensory, self regulation & ADLs like dressing & toileting. He has also improved so much on his handwriting, cutting & academic skills.\n\nForever grateful to Sherwin & Thet for creating this SL family, which we are so proud to have been a part of & will always have a special place in our hearts!\n\nAll the best to you, I'm sure you will continue to help many more children to reach their full potential!",
      "time": 1733974364,
      "translated": false
    },
    {
      "author_name": "Gary Wethington",
      "author_url": "https://www.google.com/maps/contrib/100552308008517273888/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLtD5_jjK1BqxTOlx1_R6T9oCf5sBtF52XRs4BMVj5JK-B4-g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "My Daughter was having issues learning to read at age 6 and 7. Mr. Sherwin and his staff were able to help her and identify a visual perception issue and my daughter was able to get past this and can now read very well. They really care and do the best anyone can to help kids. Just an amazing group of people. Anyone with a child that has any issues with learning or progressing should get their help!",
      "time": 1719896591,
      "translated": false
    },
    {
      "author_name": "Gowri shankar",
      "author_url": "https://www.google.com/maps/contrib/108616896147945795720/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVIkhy6LryVTwBsGFsbETTzYk77lVf4N5bmpZYQ8nKKxVID4oYe=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Our kid is going to this center for past 6 months, we notice progressive changes in her behavior. Teachers are very friendly and they listen to our concerns and comments. They also help to setup individual goal for children based on parents priority and work towards that. The monthly progress report is detailed enough.\nMr. Sherwin is a trust worthy person to whom you can have comfortable and worry free consulting for your child's future.\nThanks to every teachers working here.",
      "time": 1659680673,
      "translated": false
    },
    {
      "author_name": "Anu Mary Abraham",
      "author_url": "https://www.google.com/maps/contrib/114831266084837159065/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIjZaL82ik4swatuRqB0-RZvFEiSXmWkwUadqOtMn8RyUBI0g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "I have been sending my son to Special Learners for two years now . The kind of improvements my son  has been showing ever since has been tremendous. The Teachers- Teacher Sherwin , Teacher Thet and Teacher Jerlyn are so supportive and encourages the kids to bring out the best in their students. They also have great student- teacher ratio that ensures kids get individual attention and focus. My son had lots of sensory issues previously and now with regular OT and behaviour therapies in the centre he doesn’t have any such issues . I would definitely recommend this place for parents who are looking for an early intervention program with affordable fees. .",
      "time": 1619604631,
      "translated": false
    },
    {
      "author_name": "aye thin",
      "author_url": "https://www.google.com/maps/contrib/110340158790717115113/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIu7bruwUoEHKvooZdBdtMNPV-5OrAGZ6EfHM3Ayb-ELyoqcw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Thank you teachers\nAfter 3 months in SL,my son is excited for school in the every morning and cooperative with the preparations every day. He get used to his routines and aware of his daily tasks.\n\nLess screen time and prefer playing in physical .Significantly improved eye contact and slept well at night which help in good attention span.\nHis favorite color is red nowadays and we are very happy with improvement.\n\nAs working parents ,we spend little time with our kids and teacher's training are very important for our developing little one for their future.\n\nSL's teachers are super patient and caring from hearts for their students with love and professional. Thanks a lot to all the teachers for hard work to our children.💕💕💕",
      "time": 1669084175,
      "translated": false
    }
  ],
  "types": [
    "health",
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11994138270088987071",
  "user_ratings_total": 19,
  "vicinity": "450 Clementi Avenue 3, #02-293"
}