{
  "formatted_address": "Blk 71 Ayer Rajah Crescent, #05-14, Singapore 139951",
  "geometry": {
    "location": {
      "lat": 1.2965255,
      "lng": 103.7872127
    },
    "viewport": {
      "northeast": {
        "lat": 1.297810030291502,
        "lng": 103.7884518802915
      },
      "southwest": {
        "lat": 1.295112069708498,
        "lng": 103.7857539197085
      }
    }
  },
  "name": "Speedoc (Singapore)",
  "place_id": "ChIJAV_xOhIZ2jERxN3SW4BgcLg",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Brandon Ong hui yu",
      "author_url": "https://www.google.com/maps/contrib/102464533673812460178/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVKVGNtQd0kYo_P9s3KZfd2GWlnimSMHCT5qtLP_rf1aOdpfd-U=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Booked appointment online via website on 7 april was informed that no doctors available on that day itself and scheduled appointment for 2pm on 8 april. Was patiently waiting for team doctors to come and made a call at 2.15 pm to double check if they are still coming. They told me appointment was cancelled and not by me but by a random person with the wrong phone number",
      "time": 1744093368,
      "translated": false
    },
    {
      "author_name": "Claire Chaw",
      "author_url": "https://www.google.com/maps/contrib/114522722856102563174/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVAoJidleI05kj80Eg1UB7DjAjKmSqraPCfJSvOKqc25twB77YL=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "Was recommended Speedoc by my friend to be part of my baby's vaccination journey, it's been all good until my baby's 15 months vaccination, their service that provided was unacceptable!\n\nTheir telemarketer called in 5 Feb 2025, 2 days in advance to ensure the appointment assigned is confirmed. I've told them my baby is still unfit for the vaccination and he is having some medication, is there any ways we could reschedule? Thankfully, they changed to 13 Feb 2025 at 4pm. However, during this period, I have been observing my baby's condition and went to GP, as he is not getting well.\n\nBased on their protocol, they called in 2 days in advance to double confirm of the appointment. Similar situation, I've told the telemarketer that my baby is still unwell. He told me no problem, ask me to observe, if still unwell, I could call in 1 day in advance. I told him I am unable to commit to that, he said okay, how about you call in early in the morning on the actual day itself to reschedule, since your appointment is at 4pm. I said okay, and I've followed as how he advised me!\n\nGuess what! They want to charge us for the penalty of $290 or $296 of last minute cancellation! Ask me to email in and it will takes about 2 to 3 working days for them to get back! And, they still want me to continue for the vaccination alongside with my baby's unfit condition! This is their SOP \"Standard of Procedures\" and it can't be change without any discussion!\n\nAs a parents, we are extremely upset, as they are not the one who has to pull thru late night or wake up in the middle of the night to comfort our baby's fighting against the combination of current sickness + vaccination with difficulties of sleeping.\n\nCalled in to their customer service again, and I was being on hold for 29mins, I was not being attended to, nor any update if the vaccination is still on-going or it will be reschedule!\n\nSomewhat similar cases like previous parents feedback;\n\n1) They have no respect for the parent's schedule. They change your schedule without prior notice and we are unable to do anything about it. Every time i call in, they will say they cannot do anything about it. If we chose to reschedule or cancel, we will have to bear the penalty.\n\nThe concept of having the doctor come to your home to vaccinate your baby is great. However, not respecting the time of the parents is just plain unacceptable. We agreed to this service to save time and hassle. This, thus far, has wasted more time and effort for me. Will I recommend it? Absolutely not, unless you have ALOT of time for them to play around.",
      "time": 1739462446,
      "translated": false
    },
    {
      "author_name": "Bea",
      "author_url": "https://www.google.com/maps/contrib/107935604829784291558/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL-hOitM8xkprj3n3eSfP4ugzb8puBIDBjKMOXEVF0U2GRpAQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "I don’t feel that paying over $30 for my teleconsult was justified, as I was expecting medication to be delivered to my doorstep. However, I found out that I’m actually paying this amount just to collect my medication from Guardian. There was no prior notice indicating that there would be no delivery over the weekends. To make matters worse, I later discovered that Guardian itself offers teleconsultations at half the price I paid. I assumed the app would charge me the Guardian rate, especially since I had to go there to collect the medication. This entire experience has been inconvenient and not what I expected from Speedoc. Other healthcare providers manage weekend medication deliveries, so I’m surprised Speedoc doesn’t offer this. It’s especially frustrating when you’re feeling unwell and trying to go through a teleconsult.",
      "time": 1743852005,
      "translated": false
    },
    {
      "author_name": "Forest Trade",
      "author_url": "https://www.google.com/maps/contrib/104045686686606273825/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWICv3mvxzbkwPk6LZKhswU-G5s95bP6AvbBD55QG8CrJMIqUY=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Sick, trying to use tele consult for convenience, still expect me to go guardian pharmacy to self collect medication.\n\nMight as well visit GP.\n\nTele consult is for the convenience, not even asking for MC but trying to get medication delivered home while resting.\n\nPay more than GP for consultation (excluding “self collection of medication”, yet ask you to self collect medication at the nearest guardian pharmacy.",
      "time": 1743855151,
      "translated": false
    },
    {
      "author_name": "Li Bai",
      "author_url": "https://www.google.com/maps/contrib/103464773232613874174/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLpFhxs-vcGaWrbAdSk4kHApOXvyWafVNVXR090gGNLDzENlw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "This baby vaccination  has not been a good\nexperience for us.\n\n1) They have no respect for the parent's schedule. They change your schedule without prior notice and we are unable to do anything about it. Every time i call in, they will say they cannot do anything about it. If we chose to reschedule or cancel, we will have to bear the penalty.\n\n2) I called in once and told them I am unable to accommodate their last minute change and the staff actually told me to bring my baby to poly clinic instead as it is free.\n\nThe concept of having the doctor come to your home to vaccinate your baby is great. However,  not respecting the time of the parents is just plain unacceptable. We agreed to this service to save time and hassle. This, thus far, has wasted more time and effort for me. Will I recommend it? Absolutely not, unless you have ALOT of time for them to play around.\n\n(PS: i am not talking about 1 or 2 times change in schedule, of the 5 schedules thus far, none were fixed)",
      "time": 1731376663,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13290228604782960068",
  "user_ratings_total": 409,
  "vicinity": "Blk 71 Ayer Rajah Crescent, #05-14"
}