{
  "formatted_address": "60 Yishun Ave 4, #01-07 SAFRA, Singapore 769027",
  "geometry": {
    "location": {
      "lat": 1.4242354,
      "lng": 103.8409184
    },
    "viewport": {
      "northeast": {
        "lat": 1.425446980291502,
        "lng": 103.8420948802915
      },
      "southwest": {
        "lat": 1.422749019708498,
        "lng": 103.8393969197085
      }
    }
  },
  "name": "Springleaf Prata Place",
  "place_id": "ChIJ5UqDl5IV2jERuFu6K4QX3DY",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Muhamad Riduan Borhan",
      "author_url": "https://www.google.com/maps/contrib/114320686772846690938/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW92SmH5njUU6X3aVVVZUtNNRv4T47qvg1RUi4AT65pEvO_L1hNGQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "Located at Safra Yishun. Aircon. Order at counter pay and they sent to table. Price is reasonable for aircon restaurant. Food tasty and fast ready",
      "time": 1746958114,
      "translated": false
    },
    {
      "author_name": "Gareth Ng",
      "author_url": "https://www.google.com/maps/contrib/116856983748220430710/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUh1-u_Qq_EoSuJ12rh9HAlOix4lN6QM2I0IU3bIdYetiUAP5cS=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Prata is decent, curry is awesome. The pratas here are the crispy kind, so if you're looking for chewy succulent kinds, you might want to try elsewhere. They have decent muturbak too, worth a try.\n\nThere seems to be a prata buffet here that's reasonably priced, but you'd need to make a reservation in advance it seems.",
      "time": 1743598815,
      "translated": false
    },
    {
      "author_name": "LLY",
      "author_url": "https://www.google.com/maps/contrib/109532822556061355724/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLCsWr6lb8sXxmMyj4HLAYfI7REKL68viFU3bQnq2DfrS9OTw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "4 weeks ago",
      "text": "Wow, this is actually quite bad. Personally the WORST briyanni I have ever eater in my life, including Singapore, Malaysia and India.\n\nCurry was dilute like the water coming out of your mouth after rinsing. Tasteless and no depth, flavor.  Rice equally poor.  I asked for berry little rice and yet they have this huge amount.   Luckily chicken size was decent but a little dry.  For a SAFRA restaurant this reminds me of my army days in the 80’s…alongside famous rubber bands and half cooked shitty food.",
      "time": 1745218657,
      "translated": false
    },
    {
      "author_name": "Great Grace",
      "author_url": "https://www.google.com/maps/contrib/108396709575936374920/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXUQawWDrOwhf8XTJEddWNb16I9fFYcIAgVgNPmPasQ0ESXxl6T=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "The service from both Sasi and Lingam was excellent and professional. Sasi took the initiative to inform me that they needed some time to prepare the new Chicken briyani set and follow up on the request when the set was ready to order. Such proactiveness is rare and professional. They were not rigid and always have a listening ear to listen to the customer’s request and flexible to take in special requests. They went the extra mile to serve the customers. The cutleries were sanitised but I was still concerned. And they sanitised my fork and spoon in boiling water just to give me a peace of mind and went the extra mile. They even gave me a complimentary plate of Indo Malay keropok crackers. The new Chicken briyani set was excellent and as I hated chic breast, they gave me drumstick and thigh instead. So generous of them. The only thing is the briyani rice is too hard and dry that it was difficult to swallow and needed lots of gravy and teh tarik (that came with the set) to soften the rice and help to swallow. Cooking the rice longer and with more water might help to soften the rice to make it easier to swallow. The generous and excellent service and servings from the two staff more than compensate for this which could easily be solved. But such exceptional service is rare in the industry as compared to the nearby Eatzi gourmet at SAFRA Yishun that offer terrible stingy service and servings. Both are Halal but more Muslim and non Muslim preferred eating at Springleaf than at the Eatzi restaurant (Eatzi JP Pepperdine group service standards and culinary standards has really dropped)\nThank you to Springleaf and excellent staff Sasi and Lingam.",
      "time": 1739169147,
      "translated": false
    },
    {
      "author_name": "AT TY",
      "author_url": "https://www.google.com/maps/contrib/103512925166570672371/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUX9EHRH1hQ0cutzQOZrId_fsJ-QQa4o6oBJdvCcczk783_7U0Q=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "They have dropped their standards when it comes to food and service. Food portion has reduced by at least 25%. Food quality is becoming worst.\n\nAn incident also happened when the Indian lady at the cashier shortchanged me and I had to go back to ask for the correct change.\n\nThe establishment needs to have some corrective changes",
      "time": 1738210454,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3953060429361208248",
  "user_ratings_total": 532,
  "vicinity": "60 Yishun Avenue 4, #01-07 SAFRA, Singapore"
}