{
  "formatted_address": "100 Depot Rd, Singapore 109670",
  "geometry": {
    "location": {
      "lat": 1.2813098,
      "lng": 103.8139223
    },
    "viewport": {
      "northeast": {
        "lat": 1.282635980291502,
        "lng": 103.8154119802915
      },
      "southwest": {
        "lat": 1.279938019708498,
        "lng": 103.8127140197085
      }
    }
  },
  "name": "Sri Ruthra Kaliamman Temple",
  "place_id": "ChIJ0WqP69Ab2jERJtx-lWnhYT4",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "N. Ram Senthil",
      "author_url": "https://www.google.com/maps/contrib/104744551656574016436/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWpID2U1f5uJHXTPzKVpQfCn3J9Im4CySfmRoL4ufly_2mG_ncI=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Singapore is heaven on earth where all races live in unison under the magical spell of Almighty God. Singapore history is amazing how it has emerged from British colony to modern smart city without loosing the Asian Culture Heritage. The Tamils who contributed for Singapore growth is rooted deeply on worshiping Goddess supreme Mother who has incarnates in various forms. Kali is the form of divine Mother who intercedes in the devotees life to bestow best gifts for righteous people. Ruthira Kaliamman founded by humble labourers who were doing brick works in JLN Bukit Merah now emerged as a spiritual community emanating divine aura in Depot Road vicinity. It is a must visit place for those who would like to experience the divine within our hearts. The temple band team Natheswaram player Vinod will mend our mind to steadfast in spritual path through his tunes. Best time to visit during closing prayers at 8:30 PM to 9:00 PM and rest assured Vinodh will make us spell bound with his music emanating the vibration of Ustadh Bismillah Khan’s Shenoy Ragas. Yaman is called Kalyani and Vinodh plays Hindustani version of Hamir Kalyani to melt our hearts to surrender to Almighty. Om Sakthi. Ranga Ranga Ranga.",
      "time": 1732331132,
      "translated": false
    },
    {
      "author_name": "T greensake",
      "author_url": "https://www.google.com/maps/contrib/102107525471936198024/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIZnv83PGhDQQ8QIfnt_ARJLi3OI_jhuI8AaxZ0AVYFHu9tcQ=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "13/8/2024\nWas outside taking pictures of this beautiful temple.",
      "time": 1726040315,
      "translated": false
    },
    {
      "author_name": "Gopalasetti Krishna Chaitanya",
      "author_url": "https://www.google.com/maps/contrib/114720051518587221808/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVxUvHUEWvuSoau4ReEIDKIHMa1QlLPAeeONjZKGJRlWgnAtrpI=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Here's a brief history of the temple:\n\nThe Sri Ruthra Kaliamman Temple was established in 1995 by a group of devotees who wanted to create a sacred space for worship and community gathering.\n\nThe temple is dedicated to Goddess Kaliamman, a fierce and powerful deity revered by Hindus. The temple's name \"Ruthra\" refers to the fierce aspect of Goddess Kali.\n\nOver the years, the temple has grown in popularity, attracting devotees from all over Singapore. The temple has also become a hub for cultural and community activities, hosting various events and festivals throughout the year.\n\nIn 2015, the temple underwent a major renovation, which added new facilities and improved the overall infrastructure.\n\nToday, the Sri Ruthra Kaliamman Temple remains a beloved place of worship and community gathering, serving the spiritual needs of Hindus in Singapore.\n\nPlease note that the information provided is based on available sources and might not be exhaustive. If you need more specific or detailed information, I recommend contacting the temple directly or visiting their website.\n\nThank you 🙏😊\n\nGKC7113",
      "time": 1733198951,
      "translated": false
    },
    {
      "author_name": "PixieTalebyPriya",
      "author_url": "https://www.google.com/maps/contrib/105342081094786090850/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWjGRYvTmA8Tt2eGahkMT94ZRnjVDe1jMTwdWEJV6U8TeKD_r0X=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "The Location and the ambious are so divine. It has quite all the deities including, Ganesha, BalaMurugar, RudhraKaliamman, Shivan, Ambhigai, Muneeswaran, Anjaneyar...All the Priests are very professional and treats you very well. Mostly everyday they offer prasadham there. Before Covid-19 there used to be Kunkuma Archai done for Sri Rudrakaliamman very Friday evening done by a priest along with a group of ladies. In addition to that they conduct lot of events periodically...This temple is very close to my heart.",
      "time": 1619071162,
      "translated": false
    },
    {
      "author_name": "Zubin Shroff",
      "author_url": "https://www.google.com/maps/contrib/101849609594338272546/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVBZ86boHovob2GrSHTzNxOlKX___PXfKNgWvfH1kcmNT8jDPxqWA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "An absolutely wonderful experience visiting this temple. Wonderful ambience and vibrations. One of the cleanest and most well kept. All the goddesses are worshiped here. The Prasadam was amazing too!",
      "time": 1730440676,
      "translated": false
    }
  ],
  "types": [
    "hindu_temple",
    "place_of_worship",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4495121746688400422",
  "user_ratings_total": 331,
  "vicinity": "100 Depot Road"
}