{
  "formatted_address": "5 Sorby Adams Dr, Singapore 357691",
  "geometry": {
    "location": {
      "lat": 1.333255,
      "lng": 103.8631819
    },
    "viewport": {
      "northeast": {
        "lat": 1.334714880291502,
        "lng": 103.8645251802915
      },
      "southwest": {
        "lat": 1.332016919708498,
        "lng": 103.8618272197085
      }
    }
  },
  "name": "St Andrew's Junior College",
  "place_id": "ChIJuxPYdnkX2jERGZ5cvcNOvJs",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Y",
      "author_url": "https://www.google.com/maps/contrib/104628136616123955754/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVF22mDWypc0oh5GsQ9tcBpx-fWCucXuHRgqE-adeNYKMvc0PE=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "A girl from this school lied about SA, and students from other schools she doesn’t even know. Very odd students.",
      "time": 1741266210,
      "translated": false
    },
    {
      "author_name": "ignatius lee",
      "author_url": "https://www.google.com/maps/contrib/115700277006575756719/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXSJ1H9NiabMImtY0i7Jvbtvfr5eZKzZ95AC3UgaLn_CKut5Ox78A=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "2 years ago",
      "text": "SAJC Prata Stall\nService:\nIf there was one word to describe the uncle, it would be 'chad'. The uncle was such a chad i love it. What i really appreciate about the uncle is that he did not felt frustrated when he was told to prepare 12 pratas. Other prata uncles would immediately give us the stone and angry face and prepare the prata with 0 Love. In terms of the time taken to prepare, i was pretty shocked and satisfied to see that 12 pratas were prepared in a short span of 10 minutes. Other than that, it was also quite nice to see the uncle preparing fresh prata on the actual prata grill thing (not sure what its called) as previous prata makers in my primary and secondary school used frying pans to prepare frozen prata 💀. However, it was displeasing to know that the uncle used his hands to collect money and make prata as well (According to Natasha) big ew man. Overall i am pretty pleased with the service as a whole.\n\nOverall Service is rated a 8/10\nSide note: The service would have been 10/10 if the uncle did not use his hands to collect money and make prata.\n\nTaste\n(Drinks)\nMy milo tasted like milo, pretty standard cant go wrong. Yude’s teh beng is abit on the sweeter side but it tastes not bad\n\nOverall rating for drinks: 8/10\n\n(Food)\nAll 6 of us ordered one plain prata and one egg prata. To start, the plain prata tasted like average plain prata, pretty standard. However, the egg prata was honestly the bomb. Compared to my previous experience in Al-Hussain, there egg prata here had a larger proportion of egg and it honestly tastes bussin. Very satisfied with the prata. However, i was greatly disappointed by the curry. If there was one word i would use to describe the curry, it would be TRAGIC. It looked and tasted bland. When i first dipped my prata into the curry, i felt all of india crying. Although 9 hours have passed since i ate the tragic curry, i could still feel it lingering in my tastebuds and it is a very horrible feeling.\nOverall rating for the food: 6/10\n(The curry was really a major L factor)\n\nPrice\nThe plain prata costed $1, which is pretty standard and the egg prata costs $1.40. Though it may seem that the egg prata is a tad bit pricey, it really isnt. The egg prata had a good amount of egg inside and that makes the $1.40 worth paying.\n\nOverall rating for price: 8/10\n\nAtmosphere/Amenities\nThe atmosphere is pretty nice as well. It was pretty breezy which made eating fresh and hot prata feel amazing. I also love the fact that there are not one but at least 10 sinks here so that a big group of friends like us can all wash hands together like one family unbroken. There are also many seats here which means that it is quite easy to get a seat.\n\nOverall rating for Atmosphere/Amenities: 8/10\n\nFinal Rating: 6.5/10\n\nWould not come here again as there is always thai omelette. However, if the homies and bro asks me and yude to eat prata i would not mind",
      "time": 1658755897,
      "translated": false
    },
    {
      "author_name": "hansen khornelius",
      "author_url": "https://www.google.com/maps/contrib/102759748170724864067/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXSqDMs0UwITDihYqaiaermnfRVn3vOQYJDXEX3tDcowyK-iow=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "3 years ago",
      "text": "A great school especially people who are seeking to join many external activities such as seminars and competitions. For the time I and enrolled in this school, it is a great experience although my year is a covid year, but the school community is always helping us to improve in our academic and non-academic achievements. The school also provide their students with many facilities to be used at their free time. One example is the fitness corner that is very useful for me personally since I am in canoeing CCA, and I need to workout several times a week. Another facility that I like is the library, it has a lot of books that is updated termly, so that they have the newest books, and we can borrow them. The library also has a lot of tables and chairs for us to study and chill in our breaks. The school also has a bookstore that sell pens, pencil, notebooks, foolscap paper, and many more. The school canteen is also great with eight stalls that we can choose from. There are mix rice, Indian food, malay food, and chicken rice stall, and thai food. The food is great and affordable for students.",
      "time": 1623206321,
      "translated": false
    },
    {
      "author_name": "harry e. tomlinson",
      "author_url": "https://www.google.com/maps/contrib/105794649854349081776/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU2hI6UqHqUhQ8v97Lqvb_JTSbAllcrEyELa6j4OmbbieoZFSU=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "great school and students. especially priyanka from r11 who got 'em oratory skills and puts the p in empathy and made a wholesome community. she's a real g ‼️ and as for school, she'll help improve. VOTE PRIYANKA FROM R11",
      "time": 1646502884,
      "translated": false
    },
    {
      "author_name": "Anita Tan",
      "author_url": "https://www.google.com/maps/contrib/108652551243759696552/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJtGXOepO6CIEbq1WAL2hb9HrYYFn5XhVdJAG-vQP2iln2xYA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 2,
      "relative_time_description": "5 years ago",
      "text": "A low key community outreach was put up by SAJC at Potong Pasir on 8/6/2019 morning. Some students persuaded me to write something on how the community in PP can be improved. When I dropped by the tent, the handful of students I met did not about know such writing was on n some did not know which stall to direct me. In the end I managed to find the stall n I penned my thoughts on how the students can assist the elderly n seniors in the community. Some snacks were given out at the game stalls n I exchanged for healthier ones. A male student told me that different game stalls gave different prizes hence implying that I should stick to what I was given. Just a small feedback for future school outreach - set up info counter to answer queries n give directions, in-charge to be more organised n ready the moment their stalls are set up, bag healthier snacks or purposeful prizes, exercise greater effort to promote outreach events!",
      "time": 1559985863,
      "translated": false
    }
  ],
  "types": [
    "university",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11221930974102986265",
  "user_ratings_total": 78,
  "vicinity": "5 Sorby Adams Drive, Singapore"
}