{
  "formatted_address": "231 Mountbatten Rd, #01-01 Blk B, Singapore 397999",
  "geometry": {
    "location": {
      "lat": 1.3080848,
      "lng": 103.880837
    },
    "viewport": {
      "northeast": {
        "lat": 1.309508580291502,
        "lng": 103.8821976302915
      },
      "southwest": {
        "lat": 1.306810619708498,
        "lng": 103.8794996697085
      }
    }
  },
  "name": "St Gerard's Preschool",
  "place_id": "ChIJm28JDTgY2jERBFh__0EbO3c",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Irene Tan",
      "author_url": "https://www.google.com/maps/contrib/105158049455089065479/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIrFF8387_A2yoOAc5uQo-BlI32PK462w76eNlGwmjQNIqPEQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "St. Gerard's Preschool has been a great experience for my child! The teachers are kind, patient, and caring, always helping the children learn and grow.\n\nThe curriculum is well-balanced, with both learning and play. My child has become more confident and curious through fun activities.\n\nThe playground is amazing—a safe and fun place where kids can run, play, and make friends. My child loves outdoor playtime!\n\nThe school is warm and welcoming, just like a second home. I highly recommend St. Gerard’s Preschool to parents looking for a loving and supportive place for their little ones!",
      "time": 1743489400,
      "translated": false
    },
    {
      "author_name": "Weihan Huang",
      "author_url": "https://www.google.com/maps/contrib/113145056045919616899/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUv1Ze5YOL39_p_ET-T4mgNTpkbgnQNTjME6SNnBsogplvJelAv=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Liked the teachers and culture there. Friendly teachers and because if the small class size, teachers can have more individual attention to each child.\n\nGenerally very responsive. My children have adapted well there. There are detailed writeups with pictures for some of the key activities our children has engaged in.\n\nUpdates are regular, but hope for more curriculum updates so that we can follow up with what our children is learning in school.",
      "time": 1744123178,
      "translated": false
    },
    {
      "author_name": "The Brown Girl Music",
      "author_url": "https://www.google.com/maps/contrib/115665919801614921406/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWM5h6_Ls76tniBNYNFHrvBaK4tcRGqmh09PgH_ZXo9A1dJSzAt=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "This is one of the best school that my kid went to and absolutely thrived. She was struggling with speech and language delays and picked up everything so fast here because of great efforts of the teachers and the very warm and  involved management. They not only understand and give unconditional love to the kids but also habdhold the parents and provide guidance.\n\nEveryday my daughter would get up saying she wants to go to St Gerrard and every night she would sleep telling me - \"Mommy tomorrow I have a school day\" :)",
      "time": 1719310583,
      "translated": false
    },
    {
      "author_name": "SHAS and SARS V2",
      "author_url": "https://www.google.com/maps/contrib/108817158661276780931/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUpUhYGu3kr-RX6JDFRhX0wsO6l29VG3Xn1UPf16F109HuvO4f7=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 years ago",
      "text": "Dear parents when I came to singapore in 2013 and my Son was not able to communicate freely and make friends I was shell shocked . Me and my Wife had a very rough and tough time going to different schools and he was having some issue of speech delay and communication . We had horror nights seeing our son alone and mentally very disturbed .\nWe were not ourselves sure what was the issue\nTried so many schools but no one willing to give admissions to our Son as advised by kkh\nHospital. But there was light in the tunnel and among the 35 schools listed it was only st Gerard who helped us . Some school fees were like house rent of 2.5-3000 sgd which we could have never been able to afford . There were rejections from all over the place and finally this school welcomed us without any obligation after contacting .\nMs vasugi Raman called us after we took appointments and it was a blessing forever . A very experienced doctor with a wide range of\nEvery day for two years wake up 5 am my Son went 40 kms from Jurong to Mountbatten and returned 5 pm . Very hard life for a 2.5 year old boy .the school did miracles for us .\n\nThe Son is now going proper  international school and is prefect for the class and among TOP 5 students in class academically\nthe school taught him to control emotions behaviour self confidence and skill of communication.\nTeachers are highly patient and knowledgeable and I would rate as the best motor / locomotive/ sensual skills  for a child that can be imparted through training and thousand of man hours involved\nMy Son was scared of heights and they brought the confidence to scale heights / Cycling / arts / mental games logical reasoning and aptitude .\nNot a joke but people who read this review and think something not right with them ( even adults) can go for therapy .\n\nBelow is the picture of decathlon “the school develops from a empty Small cycle to a pro cyclist as shown in last picture.”\nThis is the way st Gerard’s work\n\nThe best part is school provides you the progress of your child every fortnight and weekly updates can be seen for progress via a link . parent one to one meetings with Teachers\nAnd the guidance for way forward.\n2 years of continuous hardwork of my Wife and school Teachers and finally we were relieved as we thought one time that we need to hide ourselves among this world and very depressing\n\nAlways remember in life that u meet people for a reason and if something good happens it become memory to cherish with .this was one of the blessings in disguise .\n\nI would say everyone that your world is ur family including kids and once they lose the path u will always curse yourself for not getting the right intervention and I am sure st Gerard school will help you with best possible therapies they are equipped for .\nRemember a truth child looks very nice to you only 30 mins once ur back from office after that u get impatient.its very difficult thing to have patience and control kids as they have the mind of there own\n\nI would again thank principal ms vasugi for her tireless determination and hardwork and noble charity for the kids which is unmeasurable .\nGod bless you and please continue to help the needy children and I am sure almighty will be with you always .\n\nRegards daddy Puneet",
      "time": 1556910105,
      "translated": false
    },
    {
      "author_name": "Ree Na",
      "author_url": "https://www.google.com/maps/contrib/108676940743436975187/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJGHBak1_vfjxtncEWZhOE_0QFxaY0g8sIHRlTHHlmDzEnLnQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "St Gerard’s provides a very nurturing and supportive environment for our young ones to blossom.\nIt offers a comprehensive pre-school curriculum including Chinese language that is supported by a team of experienced occupational, speech and educational psychologists who are ready to step in to advise on appropriate interventions. 1-1 therapy is also available at extra cost together with a school readiness programme targeted at the Singapore mainstream primary school curriculum. The therapy services here are targeted and reinforce one another. Compared with my experiences with other standalone private therapy providers, I felt that the therapy sessions offered by St Gerard’s were of a higher standard, more co-ordinated and responsive to any changes in the child’s progress given the day to day interaction with their teachers.\n\nAs a parent, I was very happy and satisfied with my boy’s progress in St Gerard’s. Academically, he made much progress in terms of his language and numeracy skills. Socially, he was also encouraged to interact with peers and make good friends. As a smaller school not linked to major preschool franchises, there was a family environment with enthusiastic teachers who looked out for him and would share on his progress with me even at chance meetings.  He has grown to be a happy and confident boy.\n\nWith school bus services available to ferry him to and from school, St Gerard’s was a comprehensive and convenient solution for me.",
      "time": 1624158337,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8591490684412712964",
  "user_ratings_total": 17,
  "vicinity": "231 Mountbatten Road, #01-01 Blk B"
}