{
  "formatted_address": "136 Sophia Rd, Singapore 228197",
  "geometry": {
    "location": {
      "lat": 1.3036964,
      "lng": 103.8456853
    },
    "viewport": {
      "northeast": {
        "lat": 1.305200330291502,
        "lng": 103.8473362302915
      },
      "southwest": {
        "lat": 1.302502369708498,
        "lng": 103.8446382697085
      }
    }
  },
  "name": "St Margaret's School (Primary)",
  "place_id": "ChIJeRJ4bb4Z2jER4193i8GbelU",
  "rating": 3.9,
  "reviews": [
    {
      "author_name": "Mel",
      "author_url": "https://www.google.com/maps/contrib/117829893971635899827/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIwgxdVNw5MzykZ4jkA_txlQ1OGLTxObDxsW8wEtrzjbdV-yA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "Assigning a Chinese spelling test with just four nights of preparation, strategically scheduled on the same day as a Mathematics Weighted Assessment — it’s truly heartwarming to witness such thoughtful planning, clearly designed to stretch young minds (and their parents) to the brink. A masterclass in building resilience through stress, no doubt.\n\nAnd let’s not forget the use of disciplinary approaches such as confiscation as a means of education. What a remarkable way to instil the very values St. Margaret’s School (Primary) holds dear — LIGHT: Lifelong Learning, Integrity, Graciousness, Humility, and Tenacity.\n\nThe teacher behind these enlightening experiences? Mdm Ngoh :)",
      "time": 1745508352,
      "translated": false
    },
    {
      "author_name": "James S",
      "author_url": "https://www.google.com/maps/contrib/106501009835413180306/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUCc9fI5fwtS9VrKVvToKVTe-47AkqvVEqAgkVsVssUiu8My3F2=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "The 2025 principal and teachers like to make weird rules. Cannot wear jacket when raining or cold. Cannot wave goodbye to your parents during drop off because it will slow down your parents by miliseconds. Cannot wave to your friend when waiting at drop off area in the morning. What kind of rules are these? Are these people making up these rules fit to be educator? Seems like people who misuse their authority, uptight, and illogical.",
      "time": 1744110990,
      "translated": false
    },
    {
      "author_name": "Preethi Dharani",
      "author_url": "https://www.google.com/maps/contrib/117944157729207297108/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX4E89p77SZxTZ9_NHNbc4fpCrDZicNBkwBB6wLe8kUEdhLvXE=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "My daughter joined this school in P3, her transition from an international school to local school was very smooth. Teachers especially Ms Nadine and Ms Tan made it easy for my daughter to settle in new environment effortlessly. My daughter says all her teachers are kind and helpful, never she complained about anything wrong about school, not sure why the negative reviews.",
      "time": 1729843224,
      "translated": false
    },
    {
      "author_name": "Faith Koh",
      "author_url": "https://www.google.com/maps/contrib/110750355636169001228/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJHNnca3OUAgKH9Qxur0jK_rCh1_-3J_35yYFM5K8D_ovk_9A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I’m a student and teachers are great and there is a lot of character building and values taught while teachers enthusiastically support after school support although they still need to mark worksheets and have their own life and children. Teachers are nice and concerned for students well being.",
      "time": 1730115849,
      "translated": false
    },
    {
      "author_name": "YT Lee",
      "author_url": "https://www.google.com/maps/contrib/112956605571306880896/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKy9FKhT-pHTxt_7EEZJIqAu4DGl5WvBJE-labq00Kw27I-Ow=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "The school there is awesome! All the teachers there are so kind hearted, caring, sweet, and wonderful! Whenever my kid comes back from supplementary class she always says that the teachers bought them snacks every week! The teachers even used their own money to buy their students snacks instead of starving them. Also, the canteen food there is really affordable. I don't understand why all of the reviews are saying that they are bad. Even I myself have been treated nicely when i was there. The students are all very polite when I went to the parent teacher conference. To all the people who think it is bad I think that you should go there yourself and experience it! The students are wonderful and the environment is pleasant for kids to study in. They teach a lot but they don't give too much homework to the students. Personally I think this school is amazing and wonderful. The principal there is extremely kind and nice and will always help if you ask. The teachers there are really kindhearted and the teach well! I hope that more parents will allow their kids to go there. The students always practice the school motto and the values. The school motto is charity patience and devotion the school values are lifelong learning, integrity, graciousness, humility, and tenacity.  From what I have experienced at my time when I studies in the school all the students were really diligent and helpful. When I was primary one and did not know my way to class an upper primary students helped me to get to my class  Until now, my daughter has said that the students there are really helpful and nice to her. I hope more people will believe me as I am really telling the truth!",
      "time": 1721897643,
      "translated": false
    }
  ],
  "types": [
    "primary_school",
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6159406695953424355",
  "user_ratings_total": 72,
  "vicinity": "136 Sophia Road"
}