{
  "formatted_address": "Marina Bay Financial Centre (Tower 1, 8 Marina Blvd, #01 - 01, Singapore 018981",
  "geometry": {
    "location": {
      "lat": 1.2803356,
      "lng": 103.8542013
    },
    "viewport": {
      "northeast": {
        "lat": 1.281793580291502,
        "lng": 103.8556522802915
      },
      "southwest": {
        "lat": 1.279095619708498,
        "lng": 103.8529543197085
      }
    }
  },
  "name": "Standard Chartered Marina Bay Financial Centre Branch",
  "place_id": "ChIJ3eSQzw8Z2jERe9nUJt2OgfM",
  "rating": 2.2,
  "reviews": [
    {
      "author_name": "sa 123",
      "author_url": "https://www.google.com/maps/contrib/116096497059592868798/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKUTiTOhgxJkoj1idn9q4MbvTTCEmle3MXSurbkNh4xp2E7QA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 2,
      "relative_time_description": "2 weeks ago",
      "text": "They don't waive annual fees. So cancelled the card.\nTheir term deposit rates are lower than other banks.\nTheir remittances fees are so high they provide no info on how much can be transferred. No ability to check or change limit. It's guesswork keep lowering the limit till it works!\nThey have poor customer service\nTheir RMs change so often.\nApp has limited features.\nOnline banking also doesn't work for remittances locally.  Message pops up that must go down to the branch!\nWill see if that works or some other excuse.",
      "time": 1746149480,
      "translated": false
    },
    {
      "author_name": "Linn C",
      "author_url": "https://www.google.com/maps/contrib/110607570955856391135/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWlKw9P9JAA4mvXI2PEbMLwN-MzKv9iZMt64ys4X6vhyZNhpYM=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Customer service hotline line is like a dead line. Had called for more than 2 weeks but the answer was always call volume is high. Even if I waited for  20-30 mins\n, call could never get through to a staff. Gave up and have to resort to sending email to them via their online banking. You do get a response but need to wait for the turnaround for the email. And worst of all, you need to check back by logging in the banking account as there was no prompt (like to your personal email) to inform you that they had replied. So you need to keep logging in the banking account to check. So with the back and forth exchange of email, a problem that can be resolved within a call needed to take more than 2 weeks to resolve. And they still charged me a prorated fee due to their delayed handling. As I do not want to waste my time having to go through another round of conversation via email and waiting, I just  paid the fee. Please have some respect for your customers, customers’ time are also precious and if the bank is cutting cost on customer service area, do not penalise customers for your inefficiency.",
      "time": 1741144778,
      "translated": false
    },
    {
      "author_name": "Lim Johnson",
      "author_url": "https://www.google.com/maps/contrib/116193778717538394234/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJWCESFBUhcFm0L9bEvSdrMF_mo-nPTVduDjjNs4SWohxZB4Q=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "Zero customer service!! Zero! Called their so called hotline several times, waited long hours but could not get someone to talk to me. Thier online customer service chat are like Bots, keep asking same stupid questions of my credit card details. The problem is, I did not even received their credit card! Kept sending me late charges SMS/emails even when I did not rcvd/activate their damn card! This could have affected my credit rating for non payment for nothing! Is there anyone from SCB that could reach out to me??!!",
      "time": 1737427744,
      "translated": false
    },
    {
      "author_name": "Nic T",
      "author_url": "https://www.google.com/maps/contrib/100540616461703222758/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKxwlaLqOvs0wkmKOTERuUQCGqSWsvSbhXvyEa5cOOYs_UIaVQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Jesline was a super helpful staff. She was patient, kind and was quick to diagnose the issue and offer a solution. Faciltiies of the branch is also very well maintained and service is quick and efficient. The ratings of this branch don’t do it justice",
      "time": 1743485584,
      "translated": false
    },
    {
      "author_name": "Yan",
      "author_url": "https://www.google.com/maps/contrib/101032374870381024135/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJpqLhTjwcZ6zbCgqSvYW-cwkpF2DkUGXebc-USoAQ1dOjGZg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "Yes. Just experience same as others. I think something is wrong with the bank. Is it shortage of funds?\nMy credit card got blocked. i needed to know what happen since hacking is so common nowadays. I’ve tried calling for 5 times there’s no option to speak to operator. So I went down to the Nex branch.\nThe guy name Jia Rong served me. He tried to find out and told me he needed to confirm with backend. He told me my card was blocked due to outstanding. However it can be seen that my outstanding is not due and I did not exceed the limit. He replied that’s what it is. Due to outstanding. I will need to clear it then can use.\nI asked him how to contact backend. He gave me the same number that I’ve called 5 times. I’ve explained to him that this number can’t get anyone. I tried calling together with him.\nWhen it comes to the verification part, it used to be verified using mobile app. But suddenly there’s a sms OTP. (Jia Rong was on his laptop typing all long while I was calling). After entering the sms OTP, it changed to a ring tone which there wasn’t before.\nThen a guy Alan picked up my call. I’ve expected the person to say the same as I suspected the staff Jia Rong had given him a heads up. In this case, I’ve informed Alan that I will be recording our conversation. I asked Alan what is the reason SC blocked my card? At first he said due to the outstanding. I’ve to clear and apply for reinstatement of the card.  But after I mentioned I’ll be recording our conversation, he said he’s going to check again.\nHe returned after a while saying that it’s due to I did not update my financial/income status. I’ve not received any notice for updating and SC just blocked the card?\nHe further informed me that wait for bank to mail me the notice. After I’ve updated, the bank will consider to unblock or not.\n\nIf I was not at the bank in person, I would have suspected this is some scam.\n\nI think SC is doing so to reduce number of small accounts like me?\n\nThe change in customer service hotline process is a sign that they only receive calls from selected accounts.\n\nIf SC has approved your waiver and yet charge you or they charge you late but you paid on time, please inform MAS.",
      "time": 1736090787,
      "translated": false
    }
  ],
  "types": [
    "bank",
    "finance",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17546462703702563195",
  "user_ratings_total": 82,
  "vicinity": "Marina Bay Financial Centre (Tower 1, 8 Marina Boulevard, #01 - 01"
}