{
  "formatted_address": "750A Chai Chee Rd, #01-03, Singapore 469001",
  "geometry": {
    "location": {
      "lat": 1.3234183,
      "lng": 103.9209786
    },
    "viewport": {
      "northeast": {
        "lat": 1.324832480291502,
        "lng": 103.9221884302915
      },
      "southwest": {
        "lat": 1.322134519708498,
        "lng": 103.9194904697085
      }
    }
  },
  "name": "Start Young - Unique Kids Pool Party Birthday Celebration Host (Kids Party, School Excursion)",
  "place_id": "ChIJwzSOvLYT2jERy13ydvgpXYc",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Pauline Ochura",
      "author_url": "https://www.google.com/maps/contrib/118255907716613351389/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLdNIwYS_i5_TenH5lJ4iqyq6UowaUGqCBaoFYBkzWYgZeQ1A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "My daughter just celebrated her 3rd birthday with a pool party at their Chai Chee location and everyone had such a blast!! From start to end, our party host Mee Ling and her team made sure that everyone felt welcomed and had what they needed. The faciliatators and team lead Ethan got everyone warmed up and hyped up in the pool while ensuring safety of the kids. Facilities were clean and complete with plenty of shower cubicles, and there was sufficient space for us to host 30adults and 15children comfortably. Most importantly, my daughter and her friends thoroughly enjoyed themselves in the pool with the awesome slide and many floats / toys! There was a professional photographer as well to capture all the moments. Communications with Christina throughout the planning process was also smooth and professional. Really highly recommend for a memorable and organized party!",
      "time": 1745340644,
      "translated": false
    },
    {
      "author_name": "Niki Shah",
      "author_url": "https://www.google.com/maps/contrib/111507786912227547381/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV40M3YXGiwKzCg3RAEQCrMmnYmHlQf9nGtJJRoIAeZqzajYh1dQw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Hi!! Start Young Play\n\nThank you so much once again for the fantastic pool party! The kids truly had a blast, and it was such a joy to see everything come together so smoothly.\n\nA big shoutout to your entire team — the event was beautifully organized from start to finish.\nSpecial thanks to *Zinnie* , our amazing party host, who was there throughout — from the decorations to the wrap-up. Her support and cooperation made everything feel smooth and stress-free.\n\nAnd of course, heartfelt appreciation to *Abinaya* , our personal facilitator, for guiding and supporting the group with such warmth and attentiveness. Both of them truly made my daughter’s birthday extra memorable for all of us.\n\nWe really appreciate all the positive energy and effort.. Keep growing ✌🏻",
      "time": 1745045437,
      "translated": false
    },
    {
      "author_name": "Cheryl Goh",
      "author_url": "https://www.google.com/maps/contrib/113440266319260183348/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIs2JFdjyHTZRzOYAHU0cHuX9BSjYMozg9fqYPW5kskN48aIw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Looking for a fuss free pool party? This is the best place to come, rain or shine! My daughter celebrated her birthday party here- you can choose from a variety of pool packages. We had exclusive use of the 0.9m deep pool for around 2 hours. The pool set up had inflatable slides, boats and all sorts of fun water play gear. Most importantly, there were 4 facilitators in the pool to ensure safety and to coordinate water activities. There were also additional staff to help with set up, cake cutting and making sure all the guests were attended to. We all had a whale of a time ;) Plenty of shower stalls to bathe and change after. Highly recommend!!!",
      "time": 1743500554,
      "translated": false
    },
    {
      "author_name": "Leonora Quah",
      "author_url": "https://www.google.com/maps/contrib/115995771077239773302/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUanDCHWENP7c42RYa4RNuK9-0uK5sgmC2iQUxEOfeM5dc3WHNB=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "The planning and execution of the party by Christina and her team was seamless from start to end. They really managed to make party planning stress-free + went above and beyond to make our party experience a fantastic one.\n\nLogistics\nThey package included food and photography. What really made a difference was that they went an extra mile to help us serve guests, paste our party banner, display and cut the birthday cake. These are the little things that we noticed that really made us feel like they genuinely wanted everyone to have a good time!\n\nActual Event\nThe party facilitator Mee Ling, and the pool hosts / life guards - Ethan and Chris, together with their team, not only ensured that the kids remained in a safe space, but they also engaged them with water games and fun play! They also encouraged the kids to play together as a group which was really nice.\n\nVenue\nThere were proper lockers, shower stalls and toilets for kids to use to wash up after the pool activities. The pool is indoors so you don't need to worry if it rains!\n\nThe pool is spacious and big enough for a group of 20-30 kids to play. For those who were not in the pool, it can feel a bit humid standing around watching the kids. The good thing is, there are designated seating areas and they had fans and air coolers near the entrance where guests can wait. The venue was also near a shopping area so adults could technically drop off kids and go for a coffee elsewhere.\n\nPost Party\nIt was raining quite heavily and even though the party hosts were considered off duty already, they helped us load our car and also sheltered some guests to their cars!\n\nPhotos and Videos were delivered about 1-2 weeks after the party. This is an acceptable time line and frankly, a bonus keepsake to remind us of what a great time we had.\n\nWill def recommend them to our friends!",
      "time": 1745808447,
      "translated": false
    },
    {
      "author_name": "sylvia sia",
      "author_url": "https://www.google.com/maps/contrib/113722765739038511306/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLhvEljg8u9hwTR6Ofv8t84WAwgMjYGtmL7HQMKDBC2_Otc0g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "We had so much fun last Sunday in their heated pool! The kids can walk through the obstacles and slide down into the pool! They can also play in the pool with so many water toys as well as floats. Their facilitators will be there too to look after the kids and play with them too! Worth going during this holiday!",
      "time": 1702638078,
      "translated": false
    }
  ],
  "types": [
    "amusement_park",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9753998515078585803",
  "user_ratings_total": 60,
  "vicinity": "750A Chai Chee Road, #01-03"
}