{
  "formatted_address": "#B2 - 38 - 36, Singapore 018984",
  "geometry": {
    "location": {
      "lat": 1.2806652,
      "lng": 103.854004
    },
    "viewport": {
      "northeast": {
        "lat": 1.281988380291502,
        "lng": 103.8553576302915
      },
      "southwest": {
        "lat": 1.279290419708498,
        "lng": 103.8526596697085
      }
    }
  },
  "name": "Starbucks Marina Bay Link Mall",
  "place_id": "ChIJweIayQ8Z2jERCRv42JI7ycM",
  "rating": 3.8,
  "reviews": [
    {
      "author_name": "socheata vann",
      "author_url": "https://www.google.com/maps/contrib/101122045264006016158/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWPK0eUyyF1QtPmc96M_oTgFR3uFhuGG7kEiRxxeVUfOMzt-b4=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "ate it, the top tasted was brown and overcooked for waffles but i was hungry so i ate it that was until it started tasting burnt. i flipped over and huh?\n\nother than that amazing location, drinks tasted good, service was meh nth special. it wasnt crowded she didnt ask for my initial/name.",
      "time": 1743925842,
      "translated": false
    },
    {
      "author_name": "Corporate",
      "author_url": "https://www.google.com/maps/contrib/101045854250094449082/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU5BJT8hDqKYsQomjJ94x-23Grhv3ZpQemItYm7it9r-yDhVOWhtg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "They discontinued green tea latte for marcha latte, didn’t ask for the sweetness level taste so bitter. The staff seems to rush even when there’s no one else. Told for take away, written down as dine in.",
      "time": 1712734843,
      "translated": false
    },
    {
      "author_name": "Muhammad Mohsin",
      "author_url": "https://www.google.com/maps/contrib/116214133834088278645/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV6TMF9F9vZ7rj4_a4enknbp6YyBEOEuLh8HIsr4PyIwkGB_snR=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "I had ordered a cappuccino for my birthday drink and honestly it has to be the worst drink I have ever had from Starbucks , might as well call it a glass of milk with a drop of coffee.\n\nActually upon reading the review I wanna highlight one more experience which I wish I photographed which was ordering the nitro cold brew which was as indicated by the picture below exactly 1/3 or more foam then the the actual coffee.",
      "time": 1742476401,
      "translated": false
    },
    {
      "author_name": "Doppelgriff Ganger",
      "author_url": "https://www.google.com/maps/contrib/100675484031426420345/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUUXDvRQjlrBiCC1XzKL_WRs6U4zc-Bm9dfGq2bw20xbvAro6vd=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 2,
      "relative_time_description": "10 months ago",
      "text": "I don’t know if this franchise is short handed. Service is quite bad. Takes a while to order. I would order using the app but nitro cold brew is not available on it. First time I ordered nitro cold brew, I only got 2/3 of coffee with 1/3 of foam… can’t believe I paid over $7 for so much foam. Went back again, this time they ran out of gas, they didn’t bother giving me an update.. took all 3 staff to sort out the swap of the nitrogen tank and setting it up. Other outlets would usually inform that they have to change tanks and I would have to wait for a while but here they didn’t even bother.. just went about making other coffees while I waited there like an idiot.\n\nService needs improving. It’s in an office building it is expected that traffic will be heavy in the morning. At least there was a bit more coffee this round as the foam was only slightly below the logo\n\nNitro cold brew is the only reason I drink Starbucks so it’s a huge turn off when I end up getting more foam than coffee.",
      "time": 1720150247,
      "translated": false
    },
    {
      "author_name": "Chris H",
      "author_url": "https://www.google.com/maps/contrib/104453563498846032433/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVU42gd6qKFFk-piCVm6EudPR9y4e9CqzQgulRq2-ROPcyOR9C9=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "7 months ago",
      "text": "If you had bad experience here, please make sure you also write their management team. Today was my first time ordering from my phone in Singapore. This was the worst Starbucks pickup experience I've had in different locations around the world. I felt humiliated, bullied, and upset after encountered with a South Asian female employee at the Marina Bay Link Mall branch. Her name was Minni according to her coworker. I had no conflicts with anyone there. When my order was ready, I just asked her where my order was and she didn't answer first but gave me a very nasty look. Instead of handing me the drink, she turned her head to the side and motioned for me to follow her eyes to the other side of the counter. Then I walked to that side, thought my drinks were in the paper bag over there. In other Starbucks locations, staff would either point out where the orders are with hands, or hand them over directly to the customers, making sure everything was OK. Even though she knew exactly my drinks were, she didn't try to help, or give me the order. But she just stood there, trying to give me a hard time on purpose, and scolded me in an impatient and aggressive tone, \"It's not there! Don't you see?!\" Her voice even scared another customer who was in the queue behind me. He even tried to comfort me afterwards. She made me feel like it was wrong for the customer to buy coffee from Starbucks and that the customers trouble her too much to make her work, otherwise she could just chill and made small talks with others on the side. In my opinion, as an employee who interacts directly with customers and works in a retail store, she should be working to ensure everyone has a good shopping experience. There is no excuse for treating customers in such an unprofessional, negative and aggressive manner. Her behavior also harms the reputation and brand image of Starbucks, which is committed to providing an excellent customer experience and not making customers feel attacked, frustrated or traumatized. In my opinion, if employees like this have anger issues and are unwilling to serve customers in a positive manner, they should leave the industry.",
      "time": 1728615591,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "store",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14107872809606191881",
  "user_ratings_total": 115,
  "vicinity": "#B2 - 38 - 36"
}