{
  "formatted_address": "38 Irrawaddy Rd, #01-14 Mount Elizabeth Novena Hospital, Singapore 329563",
  "geometry": {
    "location": {
      "lat": 1.3221073,
      "lng": 103.8440917
    },
    "viewport": {
      "northeast": {
        "lat": 1.323459930291502,
        "lng": 103.8456212302915
      },
      "southwest": {
        "lat": 1.320761969708498,
        "lng": 103.8429232697085
      }
    }
  },
  "name": "Starbucks Mt Elizabeth Novena Hospital",
  "place_id": "ChIJYf67HZMZ2jERfgm7KvwVCYg",
  "rating": 3.5,
  "reviews": [
    {
      "author_name": "Kevin G",
      "author_url": "https://www.google.com/maps/contrib/107684922467773822165/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIK-ys3xitbTgZfN8DvhdcU3nc90LugKe-VUInO0e9IfSjOuQ=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 3,
      "relative_time_description": "7 months ago",
      "text": "Typical Starbucks offering, usually very busy because it’s on the 1st floor of mount Elizabeth hospital.\nOnly standout is the huge mural along the wall which is very colourful",
      "time": 1727413896,
      "translated": false
    },
    {
      "author_name": "Mohana Devi",
      "author_url": "https://www.google.com/maps/contrib/109599876201948052467/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKtTGgrb5Ugqpl2GTbQF2nSqMsvUZWCcTgYGL7O_h29XHWRNQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "I visited this Starbucks outlet on Saturday, April 5, and was disappointed with the experience. There were two staff members working at the time. I usually order a White Chocolate Mocha Frappuccino, and at every other Starbucks I’ve been to, it’s consistently served with a light brown (beige) color. However, at this location, the drink was completely white and tasted much sweeter than usual—almost like pure white chocolate without the mocha\n\nI politely pointed this out to the staff and even showed them reference pictures from previous purchases and online. I suggested they try a spoonful to understand the difference, but unfortunately, they were dismissive and asked unrelated questions. One of them even questioned whether I had tried this drink in Singapore, which felt quite disrespectful (the way she asked).\n\nEventually, I asked for a refund, but after some internal discussion, one of the staff members remade the drink—albeit in a visibly frustrated manner, banging items as she worked. The second version of the drink was finally what I’m used to and expected.\n\nWhile I appreciate that the issue was eventually resolved, the overall service experience was not up to the standard I associate with Starbucks. I hope this feedback can help improve service and consistency in the future.",
      "time": 1743910655,
      "translated": false
    },
    {
      "author_name": "Drew Esa",
      "author_url": "https://www.google.com/maps/contrib/100231074350729929090/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXbY-LlQwgScLqZ3KVkLeyGbC_z9xkRCYEx3j_ij_6uc9Sc2PIL=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "Nothing surprises me in Singapore anymore😉 Even the hospitals here look so that patients are not scared. You walk into Mount Elizabeth Novena Hospital like a hotel with a lobby and a bar. Except instead of a bar, it's a chain Starbacks. It's a great idea when a hospital is a place where people go for a coffee, a snack and a chat, not for diagnostics or операцию✌️ And Starbucks is as good as ever, it's the best chain coffee shop in the world with excellent quality drinks and food.",
      "time": 1719984833,
      "translated": false
    },
    {
      "author_name": "Angel Samson",
      "author_url": "https://www.google.com/maps/contrib/117742169369034595192/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJjPWmoB1W-rumZCyxfeZ6xYhcOVs-jNPWSdsri3H-76eEWpbw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "I feel that Starbucks serves customers differently based on who they are. I placed a mobile order using the app, selecting Grande and applying a free size-up voucher, assuming it would upgrade to Venti. I didn’t know I had to select Venti first before applying the voucher, as I’ve only used the app twice.\n\nWhen I arrived, I was given a Grande drink, and when I asked if I could cancel the voucher to use it next time, the manager claimed I had ordered a Tall, which was completely false. I clearly paid for a Grande and expected the size-up to Venti, as I don’t think the app even allows upgrading from Tall.\n\nAs I was explaining my concerns, I noticed a barista looking at me while asking her colleague what the problem was—as if I had done something wrong. The service was very slow, and I would understand if they were busy, but they weren’t even rushing. What made it worse was that I saw another customer having their drink changed, and the barista thanked them nicely, but when my drink was handed to me, she didn’t say anything.\n\nTo top it off, they intentionally gave me a Frappuccino lid for a non-Frappuccino drink, which makes no sense since they should know what lid goes with what drink. On top of that, the drink tasted completely different from what I had the day before.\n\nIt’s frustrating to pay for something and not even get basic service or consistency. This experience felt biased, unprofessional, and disrespectful.",
      "time": 1741827265,
      "translated": false
    },
    {
      "author_name": "DR DAVY GOH",
      "author_url": "https://www.google.com/maps/contrib/100178836333366849641/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXgw59O9S7vDEVVAfvnlh8FjGqH7dJNCO1Ny29_mPQYDa7ZKqnxOg=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Surprisingly it was one of the busy Starbucks. With the patients and visitors, not forgetting the staffs of the hospital, during peak hours.\nCan be very busy.\n\nService was good- their standard service.\nAnd the food was good too.\nThe staff did her part to ask if I wanted jam or butter to go with my food.\n\nOverall experience was good.",
      "time": 1636964900,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9802390236741437822",
  "user_ratings_total": 110,
  "vicinity": "38 Irrawaddy Road, #01-14 Mount Elizabeth Novena Hospital"
}