{
  "formatted_address": "1 Tanjong Pagar Plz, #02-01A, Singapore 082001",
  "geometry": {
    "location": {
      "lat": 1.2763027,
      "lng": 103.8429508
    },
    "viewport": {
      "northeast": {
        "lat": 1.277263980291502,
        "lng": 103.8442445302915
      },
      "southwest": {
        "lat": 1.274566019708498,
        "lng": 103.8415465697085
      }
    }
  },
  "name": "Star Learners @ Tanjong Pagar | Preschool & Childcare",
  "place_id": "ChIJefWRjmwZ2jERKyDyIbQTREc",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Shirley Ong",
      "author_url": "https://www.google.com/maps/contrib/115110672321922236576/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJZfVsP5PT9ROlNQ5ztBqn07DH9DmQ-OtJ5xvcryxhP75nDMQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "My boy attended Star Learners@Tanjong Pagar since he was about 8 months; from Infant class until N1 now. It has been a positive experience so far and my boy enjoys going to school and interacting with his friends and teachers. Teachers are caring and friendly and would often share with us during pick up or drop off some interesting points in their interaction with our boy. Recently the school unfortunately encountered flooding issue (emergency!) and students had to be diverted to 2 other schools whilst renovations were ongoing. The teachers and principal were not deterred and still remain positive amidst all the logistic chaos they had to experience daily. Well done! As such experiences are not common (infact i think none experienced before). They were open to feedback and trying out suggestion offered by parents; thanks for that!\nI also clearly remember one of the recent excursion for a theatre show and it was pouring very heavily. The pickup bus arrangements were chaotic as there were many other children from various Star Learners centre attending as well. Ms Ana braved the rain and working with her colleagues from other centres, created an “entourage” all holding umbrellas so that our dear children will not get wet while they board the bus. As a result, needless to say all of them were drenched, all for our children. Thank you so much for that! Deep appreciation!",
      "time": 1747366037,
      "translated": false
    },
    {
      "author_name": "Karen Ho",
      "author_url": "https://www.google.com/maps/contrib/105231803012799702980/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJPYr5CGbOq1ZRBRQjcmxu4bBrrUi0VjQ0LoDFDnz_VyfDm-Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We have been extremely impressed with Star  Learners Tanjong Pagar (SLTP) and the holistic care they provide. From the moment we enrolled our girl since infant class at 3 months old, the staff has been incredibly welcoming and supportive. From infant class Tr Elfie, Auntie Chong (Ahyi), Tr Ara & Liao Laoshi to Ms Ana, SLTP has been nurturing and passionate about fostering an enjoyable, positive and engaging environment for the children.\n\nWe particularly appreciate how the center emphasizes on literature-based programmes with activities that stimulate creativity, learning, and social skills, while having fun! 🤩\n\nMy girl looks forward to going SLTP every day, and we feel confident knowing she is in such capable, loving hands. Even after starting P1 this year, she requests visit to SLTP. I highly recommend SLTP to any parent looking for quality childcare.\n\nThank you for all the heart work SLTP educators!! 💕",
      "time": 1743313464,
      "translated": false
    },
    {
      "author_name": "NJQJ",
      "author_url": "https://www.google.com/maps/contrib/112273540679603082612/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIaVUuobdTsx4PRQ5n51_nqzcJGF86UpTR0a7kkgRFYuU8TNg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "My kids truly enjoyed their time there, made great friends, and always looked forward to going to school.\n\nThe teachers create a fun and nurturing environment for the kids. They are also very responsive to parents, always providing prompt updates and addressing my concerns quickly.\n\nI also appreciate the school’s balance between academics and activities. And the school often plan event and activites that engage the parents and kids for bonding. The variety of programs/ activities/ performances keep learning fun and engaging while ensuring a strong educational foundation.",
      "time": 1743127792,
      "translated": false
    },
    {
      "author_name": "Hxns",
      "author_url": "https://www.google.com/maps/contrib/112945052759716409938/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUrRP7sv1ZPX0QMY5vC72w3zD-kZHdjrq-1iM4cz99wF1tCunc-=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "We recently had to withdraw our daughter, Hana, from Tanjong Pagar Star Learners’ Infant Care due to relocating, and leaving this wonderful school was truly bittersweet for us. From the very first day, the teachers and staff welcomed us with open arms, making us feel like part of a big, loving family. 💕\n\nThe level of care, warmth, and dedication they showed to Hana was beyond what we could have hoped for. Every day, we saw her thriving—happy, engaged, and well cared for. The teachers always took the time to update us on her progress, sharing little moments that truly reassured us she was in the best hands. Their patience, attentiveness, and genuine love for the babies in their care shone through in everything they did.\n\nWe are especially grateful for the nurturing environment they created, where Hana could explore, learn, and develop at her own pace. The structured yet loving approach to infant care gave us so much confidence as parents. It wasn’t just about routine and education; it was about emotional connection, comfort, and security—something that made all the difference for us.✨\n\nThough we are sad to leave, we will always be grateful for the time Hana spent here. If you are looking for a safe, warm, and exceptional infant care program, Tanjong Pagar Star Learners is truly a gem. Thank you to all the amazing teachers and staff for giving Hana such a wonderful start! We will always remember you fondly. Savouring every precious moments Hana has with her TPSL family ❤️\n\n— Hana’s mommy & daddy",
      "time": 1739436791,
      "translated": false
    },
    {
      "author_name": "Geroldine Tio",
      "author_url": "https://www.google.com/maps/contrib/117233967187721324558/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLeVfJ1swQ3cRS5lnw1lr0VU-ViUS2F6NnunUmLs0t5AqRJ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "This is really the best childcare I send my daughter to..  Due to work we shift her to another outlet and it really make me regret moving her.. Thank you Tanjong Pagar Teachers for letting her grow up in this fantastic place.. Especially her class Teacher Ara and Liao LaoShi for taking so good care and grooming her so well for the past few years!! Thank you Ms Anastasia whom is the principal of this outlet to be so hands on..",
      "time": 1743130051,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5135251139493765163",
  "user_ratings_total": 12,
  "vicinity": "1 Tanjong Pagar Plaza, #02-01A"
}