{
  "formatted_address": "229 Choa Chu Kang Central, #01-139, Singapore 680229",
  "geometry": {
    "location": {
      "lat": 1.3806908,
      "lng": 103.7464306
    },
    "viewport": {
      "northeast": {
        "lat": 1.382094330291502,
        "lng": 103.7478037802915
      },
      "southwest": {
        "lat": 1.379396369708498,
        "lng": 103.7451058197085
      }
    }
  },
  "name": "Star Learners @ Choa Chu Kang Central | Preschool & Childcare",
  "place_id": "ChIJD1bL38UR2jER1xfv_ojJ34U",
  "rating": 3.8,
  "reviews": [
    {
      "author_name": "Hay",
      "author_url": "https://www.google.com/maps/contrib/115699089606462689293/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK2Bi1hC18ASz__dHNZjv58GmIqxllsKrujgaqtDw_OQc6K6Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Great school highly recommendable!\n\nMy Son is currently schooling in this centre and he’s having a great time over there. I always have my son coming back hoke sharing all the fun he’s experiencing there and the new knowledge he learnt.\n\nI can see significant improvement in his languages and communication skills.\n\nI also feel that the new principal is professional and approachable. She also give good recommendations on the enrichment classes which my son need.\n\nOverall, i trust that i have made the right choice putting my son in this centre.\n\nDefinitely will recommend to all my friends!",
      "time": 1743261171,
      "translated": false
    },
    {
      "author_name": "Jasreel Tan",
      "author_url": "https://www.google.com/maps/contrib/104171487033555144936/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocISlkyrtdnj41SeIE7aXBDhfjxl2C8qFnypVUDqaR9imVcJOA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "My girl had been enjoying herself going to school. Teachers are patient enough to guide her despite my girl is a long sleeper. Teachers are also actively updating of her progress in school which times we as a parents dont know also. Well done star learners cck central! Extreme compliments to Teacher Dawn and 佘老师 for taking good care of her during her N1. And of course thankyou to all the teachers and principals !\n\nWell done star learners!",
      "time": 1744366338,
      "translated": false
    },
    {
      "author_name": "Shulaiha Sapani",
      "author_url": "https://www.google.com/maps/contrib/108841617641386046414/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIhqMHY79Lons8NcPD0uwyyKwK7Hq2ryZAVX42kt3r3dalSmPg=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "We’ve had a positive experience with CCK Central as my children genuinely enjoy their time at the center and have had no trouble making friends.\n\nI’ve also noticed significant improvement in their holistic development—whether it’s in language, motor skills, or socio-emotional growth. The curriculum and activities appear well-rounded and effective. My children enjoy reading and we make trips to the library more often than public playgrounds!\n\nOne of the standout features is the variety of field trips they organize. These trips offer great experiential learning opportunities for the kids, although the cost can add up if you have more than one child enrolled.\n\nThe home-school partnership is another big plus. Communication with the teachers and administration is seamless, thanks to the use of WhatsApp. Updates and announcements are shared promptly, making it convenient for busy parents to stay informed.\n\nThe teachers and Laoshis are nurturing and approachable. They often take time to share updates on children’s progress during dismissal, keeping parents in the loop about their development and daily activities.\n\nOverall, if you live nearby, I highly recommend enrolling your children here. The nurturing environment, focus on development, and strong communication channels make it a great choice for young learners.",
      "time": 1737361636,
      "translated": false
    },
    {
      "author_name": "June",
      "author_url": "https://www.google.com/maps/contrib/105169174857655588987/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXBLfXBzDCtAkvpFz1SnbMXjrgJSoSspWfNoYDn6aBAdMdPyzqspA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "My children are very happy in this school. They will speak fondly of their teachers and school activities. The teachers are attentive and provide regular updates.\n\nWould recommend this school to anyone’s who’s keen.",
      "time": 1742293062,
      "translated": false
    },
    {
      "author_name": "Jeralyn Chong",
      "author_url": "https://www.google.com/maps/contrib/108127074976345105183/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVMaNLoje1ylyChhkinviTtU13t2shvoKiM-j3voQc9hbecIPk=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Sent my child to Star Learns at CCK Central as we had to move house amidst his last year of pre-school journey. My child enjoys going to school and the teachers made him feel very welcomed.\n\nParents are constantly keep up to date with information via WhatsApp as well as the Star Learners app. My child was able to adapt to the environment quickly with the help of the teachers and friends.\n\nThanks for making pre-school such an enjoyable place for my son. :)",
      "time": 1670557099,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9646650517080709079",
  "user_ratings_total": 14,
  "vicinity": "229 Choa Chu Kang Central, #01-139"
}