{
  "formatted_address": "1 Lower Kent Ridge Rd, #03-12, Singapore 119082",
  "geometry": {
    "location": {
      "lat": 1.2934893,
      "lng": 103.7848453
    },
    "viewport": {
      "northeast": {
        "lat": 1.294976880291502,
        "lng": 103.7860886802915
      },
      "southwest": {
        "lat": 1.292278919708498,
        "lng": 103.7833907197085
      }
    }
  },
  "name": "Starbucks One@KentRidge",
  "place_id": "ChIJZdXmRUUa2jERYFUi5gKpXOc",
  "rating": 3.9,
  "reviews": [
    {
      "author_name": "Sheryl Lee",
      "author_url": "https://www.google.com/maps/contrib/113908698447245905938/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVs4JOvc4Tf-KsEM4ESQ4wDGEdGNjC19kkhDbtAlNyoc4DWnwZl=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 2,
      "relative_time_description": "4 weeks ago",
      "text": "Visited on 20 Apr at about 12:10pm. There were 3 staff members present at the counter, one lady who was busy counting the cash in the cash register, and another short (~162cm tall) bespectacled Chinese male who was standing around not doing anything, and lastly a tall Malay male whose name tag spelled Chris if I remember correctly. This Chinese male who was not busy with anything, I did not manage to catch his name, as he did not have his name tag on. I approached the counter and only after a few seconds later, I happened to make eye contact with him, signaling that I want to place an order, but he simply glanced away after that brief eye contact. He was just standing around, not doing anything in particular, just staying beside the Chinese lady who was counting the cash. They simply ignored me, and I was shocked as this is not the usual experience you'd expect in a Starbucks. None of the staff members acknowledged me, that was until the taller Malay male came over and took my order. He was in a white tshirt, had the apron on but no name tag at all. He also had some sort of white cast on one his hands, can't recall which one was it.",
      "time": 1745315267,
      "translated": false
    },
    {
      "author_name": "Constance Y",
      "author_url": "https://www.google.com/maps/contrib/114828186394594090722/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL0j8nYx4lndjZOsHkS0cwqPveMyXcOOvkXRwVeHnZXugztIg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "I went to Starbucks One@Kent Ridge to inquire about the ShopBack 50% promotion before placing my order. There were two staff members at the counter, a male and a female but both seemed uninformed about the promotion. The male staff member repeatedly claimed it was only the standard 3% ShopBack cashback which I was already aware of, while the female staff asked if I had a Starbucks card which was irrelevant for redeeming the promotion. I tried to explain that it was a special offer available today till 15/12 but they seemed dismissive and acted like I was mistaken. It was frustrating because they sounded like they were denying me the promotion. The cafe was not busy and there was no one in the queue. I would have appreciated it if they had taken the time to verify the promotion and gotten back to me, rather than providing irrelevant information.\n\nAfter showing them the ShopBack QR code, they finally processed the voucher, but in the end, they made the wrong drink for me. While they did apologize, the overall experience was disappointing. I visit this store regularly and don’t think I deserve this kind of poor service. It’s a stark contrast to the morning staff who are much friendlier and more accommodating.",
      "time": 1733741248,
      "translated": false
    },
    {
      "author_name": "chiranjeet narayan dev",
      "author_url": "https://www.google.com/maps/contrib/110590788353072024046/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU7yioJK1eEi1aQZxW1dYX3OA7EUUeCRkFhA9GysPiF2Mt_vmGZ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I recently had the pleasure of visiting the Starbucks outlet near the National University Hospital, and I must say, it was an exceptional experience! As someone who is working in the Hospital, I often find myself in need of a comforting cup of coffee to brighten my day, and this Starbucks has become my go-to spot.\n\nFirst and foremost, the location is incredibly convenient. Situated just a short walk from the hospital entrance, it’s an ideal stop for patients, visitors, and staff alike. Whether you’re looking for a quick caffeine fix before an early morning appointment or a cozy place to unwind after a long day, this Starbucks offers the perfect atmosphere.\n\nUpon entering, I was greeted by a warm and inviting ambiance. The layout is spacious and well-designed, with comfortable seating arrangements that encourage both socializing and quiet reflection. There are plenty of tables for those who want to catch up on work or read a book while enjoying their beverage. The natural light streaming in from the large windows creates a pleasant environment that enhances the overall experience.\n\nNow, let’s talk about the coffee! As expected from Starbucks, the menu is extensive, featuring everything from classic espresso drinks to seasonal specialties. I ordered a caramel macchiato, and it was absolutely delicious—perfectly balanced with just the right amount of sweetness. The baristas were friendly and efficient, taking the time to ensure my order was made just how I liked it. It’s evident that they take pride in their work and genuinely care about customer satisfaction.\n\nAdditionally, I was pleasantly surprised by the range of pastries and snacks available. I tried the laksa croissant bowl which was moist and flavorful—a delightful complement to my coffee. It’s great to see such variety, catering to different tastes and dietary preferences.\n\nOverall, my experience at this Starbucks has been nothing short of fantastic. The combination of excellent service, quality beverages, and a welcoming atmosphere makes it a standout location. I highly recommend this outlet to anyone visiting the National University Hospital or simply looking for a great coffee spot in the area. I will definitely be returning more often than not!",
      "time": 1730018161,
      "translated": false
    },
    {
      "author_name": "roott7",
      "author_url": "https://www.google.com/maps/contrib/109036445073858125887/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV9qvoOHAGS9X1q9OjdaBw6u5lSYyVfZmZAwD87G3TkqHvtDSlZ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "The service and the staff attitude at starbucks Kent Ridge really need impromenent twice the indian man barista serve me a drink which not even full. Tall Americano isn't that cheap and it dieluted most of the time. Starbucks should reduce more for the  coffee and please emphasis on the customer queue . I have to wait for 1 drink at least 15 minutes if it's long queue.\n\nWhat is heck Starbucks Management doing ?\n\nno changes for two years please be extra cautious with the staff name RITZ . she is moody and no basic courtesy . no even say sorry or thank you. For the past three months i went to the store  not a single word of thank you or any greeting  . twice i ask tall americano she give me venti americano and i repeat twice to her !!! even her colleague her advise her to be courteous . she have this attitude \"I don't care .!!!\"",
      "time": 1659674344,
      "translated": false
    },
    {
      "author_name": "Christabelle Ng",
      "author_url": "https://www.google.com/maps/contrib/105416452188097391151/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLbwlFd6lmJiJbm-ShqTRBYZx61g1JN0wQnZl8KFJMK8C_zRw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Syaf served me well and very friendly very cheerful. Made me feel welcomed. Will definitely come again and look for her.",
      "time": 1736330636,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16671385750534772064",
  "user_ratings_total": 137,
  "vicinity": "1 Lower Kent Ridge Road, #03-12, Singapore"
}