{
  "formatted_address": "Blk 258 Bukit Panjang Ring Rd, #01-52, Singapore 670258",
  "geometry": {
    "location": {
      "lat": 1.3780272,
      "lng": 103.7731523
    },
    "viewport": {
      "northeast": {
        "lat": 1.379375730291502,
        "lng": 103.7744663802915
      },
      "southwest": {
        "lat": 1.376677769708498,
        "lng": 103.7717684197085
      }
    }
  },
  "name": "Stepping Stones Learning Centre (Bukit Panjang)",
  "place_id": "ChIJZS3SpWAR2jER6yf3ZmS0DuY",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Saengrat Phannipha",
      "author_url": "https://www.google.com/maps/contrib/112378745899302103636/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIq0rdgEK3ioHWa7JZwACR7c85P4P2JctqjQGyxCInSJUZ7eg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Highly recommended for everyone to put their kids at the steppingstone Center, both of my kids can do well in Science and mathematics in school after few sessions of tuition, the teachers from tuition gives them the best guide and prepares before the exam.",
      "time": 1734397288,
      "translated": false
    },
    {
      "author_name": "Anja",
      "author_url": "https://www.google.com/maps/contrib/113845207652747536805/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU7Hifj_v6MLz32zaWkMnYJrxOkKmqCQwUOe8IajeAlfEFQLdTO=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "My son has been going to Stepping Stones Learning Centre for 2 years now (P5 and P6) and his academic performance has improved tremendously. For PSLE this year he managed to score AL1 for Math and his English has also improved by 3 achievement levels!!! We are overall very satisfied with his progress and couldn't be happier.\nThe teachers are very patient and kind and always make sure the children understand their study material. Special thanks to Adam and Ben for the support and guidance given over the past 2 years!",
      "time": 1732938179,
      "translated": false
    },
    {
      "author_name": "Vernice Chua",
      "author_url": "https://www.google.com/maps/contrib/118005826163675012356/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLa1ZcBcBKpNFHnhmZze_IXQDGeEGKVJ8fGBz3mPUbL91oDiQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I would like to begin my thanking Mr Wong sincerely for his unwavering support he has for his students and immense effort he puts into his lessons. He never fails to plan and carry out engaging lessons no matter how tired he may be. I have been with Mr Wong’s English tuition for close to 8 years, since p3 to sec4, and I can see that the passion and love he has for his students is always unlimited. Being at stepping stones has allowed me to gain many skills other than just improving my english as Mr Wong’s classes have allowed me to voice out my answers and opinions thus giving me more confidence to speak out and helping me especially in my oral. Moreover, Mr Wong is a tech savvy teacher and uses google classroom and other applications in his lessons that make it extremely easy for me to look at my notes when revising for my exams. All in all, stepping stones has been a place full of memories for me and has accompanied me on my fruitful journey through both PSLE and O level and I would truly like to thank everyone at stepping stones, especially Mr Wong!!!",
      "time": 1737094138,
      "translated": false
    },
    {
      "author_name": "Hunny Castro",
      "author_url": "https://www.google.com/maps/contrib/106567765946880666151/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKnU6AqlrufH_fmcRvCWsL17Fuk9JxxX2lWcz9P3G8ZdGaVNg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "My friend recommended Stepping Stones to me when my son was in P5 as I knew we needed help to prepare him for his PSLE, esp in Maths. We are so thankful and happy to have made the decision to enrol him in their Maths and Science tuition programs. The teachers are very helpful and supportive. My son was able to get into the Secondary school of his choice under the Normal Academic stream, but starting next year 2025, he will be going to both Science and Math Express stream in Sec 3! Thanks to the guidance of Teacher Adam and Teacher Bing Yao, my son had confidence to go into the express stream. Really appreciate their dedication, support and the encouragement that they give to my son. They even go the extra mile to help their students improve and do better.They give extended tuition time if the students need more time to understand concepts, and sometimes even require the students to attend extra sessions at no extra cost. Who does that?! 😆 Thank you Teachers at Stepping Stones for your care and concern, and unwavering support to your students! 😊 More power to all of you.",
      "time": 1731774039,
      "translated": false
    },
    {
      "author_name": "Faith Elizabeth",
      "author_url": "https://www.google.com/maps/contrib/111096673513321686409/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXZA199vc5XTtnNF44kp9u5MQEJoAqzOgJCA3bKHVeAp7GArRhdBg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "My son started Math tuition at the Stepping Stones in Primary 3 when he was struggling and nearly failed his exams. After enrolling him here, his grades began to improve, and he has consistently scored well since then. In Primary 5, his Science grades dropped below the class average, so we decided to enroll him in Science tuition at Stepping Stones as well. Gradually, he started to improve in that subject too. He went from an AL3 during the prelims to achieving an AL1 in the PSLE. Both subjects flourished under the guidance of Tr. Adam and Tr. Ben, and we are truly grateful for their support and guidance!\n\nI must say that the quality of teachers here matches that of prestigious and expensive tuition centers yet at a affordable price. In fact, this center is a hidden gem. I’m glad that the results speak for themselves. Thank you, Stepping Stones!",
      "time": 1732967314,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16577385621714577387",
  "user_ratings_total": 79,
  "vicinity": "Blk 258 Bukit Panjang Ring Road, #01-52"
}