{
  "formatted_address": "2 Jln Lokam, #01-51/52 Kensington Square, Singapore 537846",
  "geometry": {
    "location": {
      "lat": 1.3454052,
      "lng": 103.882168
    },
    "viewport": {
      "northeast": {
        "lat": 1.346829130291502,
        "lng": 103.8838671302915
      },
      "southwest": {
        "lat": 1.344131169708498,
        "lng": 103.8811691697085
      }
    }
  },
  "name": "Stray Cafe",
  "place_id": "ChIJKzYoLBkX2jERLwgu2q3nqfY",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "MH Tham",
      "author_url": "https://www.google.com/maps/contrib/112376174358198242550/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXJ4tOLbvkkJYRe2LZw4PmTrCsbezMPVke50H01b6T0gSd095fp=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "My dog absolutely loves it here, as he gets to roam freely within the cages while both him and us can enjoy our meals peacefully. It’s one of the rare spots in Singapore that truly lives up to its pet-friendly label.\n\nThe waitstaff are incredibly warm and genuinely adore dogs, which adds to the welcoming atmosphere. There is also a delightful selection of food bowls for the doggos, ensuring your pet feels just as spoilt for choice as you do.\n\nWhile the food for humans could use some improvement, the cafe’s focus on creating a safe and enjoyable space for pets and strong cause for stray dogs more than make up for it.",
      "time": 1736939175,
      "translated": false
    },
    {
      "author_name": "DAVID LAU",
      "author_url": "https://www.google.com/maps/contrib/107253887286127312210/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU3fCpu4YZbHRg1orahsMqFe_fmcw_B9gbG8ZXM8PDaypVP2StN=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I recently had the pleasure of dining at Stray Cafe, and I can't recommend this pet-friendly restaurant enough! The atmosphere is warm and welcoming, making it the perfect spot for both humans and their furry companions.\n\nThe staff is incredibly friendly and attentive, ensuring that both my pet and I felt right at home. The menu offers a delicious selection of food and drinks, and I was impressed by the quality of everything I tried. It’s great to see a place that truly values the bond between pets and their owners.\n\nWhat I love most about Stray Cafe is how they accommodate pets. There are comfortable seating areas where pets are allowed, and even special treats for them! It’s a delightful experience to enjoy a meal while having my pet by my side.\n\nIf you're looking for a place in Singapore where you can enjoy great food and bring your pet along, Stray Cafe is definitely the place to go. I will be returning soon!",
      "time": 1738740990,
      "translated": false
    },
    {
      "author_name": "charis low",
      "author_url": "https://www.google.com/maps/contrib/107946012912065776536/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIzo_QrVQSrFDBeygn37fJht59UaSSYwrsAi25UMIfOohEOBA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "This is the best pet cafe I've been to. A true pet cafe where your pets are free to walk around inside the cafe and sit on the chair with humans. Food is freshly prepared with great taste and big portion, very warm and friendly staffs, cafe is spacious and clean. Love the idea of having cage enclosed dining areas where you can let your pets roam freely  as you dine.",
      "time": 1742638938,
      "translated": false
    },
    {
      "author_name": "Yew Min Li",
      "author_url": "https://www.google.com/maps/contrib/108215900410927114704/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWuF7FtJHEwPaBBrlHain2J8lrXi_l2lz62K8Boy2YyK3Vmb9gV=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Visited after lunch time at about 3pm with no reservations and 6 of us were quickly being seated. Not a difficult cafe to find because it is located by the roadside. Realised that some of the food/drinks we spend, the cafe will donate meat to the stray dogs, which was quite meaningful.",
      "time": 1739845560,
      "translated": false
    },
    {
      "author_name": "Douglas Yeo Zhi Xiang",
      "author_url": "https://www.google.com/maps/contrib/108711429598100837883/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIz6o1anCfwHS8WChuThiHtsDsfo8oXbdqoQRlJu5JD8NRhPg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "One of the best dog cafe I’ve been at in terms of having the idea of segregating the areas so that both humans and pets have the comfort of eating without much worry. Been to a few dogs cafe in Singapore but always had trouble enjoying the food while making sure dogs are safe. Staff are also well trained when opening the gate. As someone who volunteered at the shelter, the whole eating in a caged environment gave customers the experience of being a shelter dog and the fences are actually the kind that’s used in shelters. V heartwarming initiative from the owner to also display pictures of shelter dogs - will visit often to support hope more cafes does the same concept of segregating 10/10 experience. Thank you",
      "time": 1731936803,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17773992138270181423",
  "user_ratings_total": 132,
  "vicinity": "2 Jalan Lokam, #01-51/52 Kensington Square"
}