{
  "formatted_address": "#01-35 Kallang Wave Mall, 1 Stadium Pl, Singapore 397628",
  "geometry": {
    "location": {
      "lat": 1.3033569,
      "lng": 103.8727124
    },
    "viewport": {
      "northeast": {
        "lat": 1.305180580291502,
        "lng": 103.8737622302915
      },
      "southwest": {
        "lat": 1.302482619708498,
        "lng": 103.8710642697085
      }
    }
  },
  "name": "Suki-Ya (All you can eat shabu shabu)",
  "place_id": "ChIJw-lr8UsY2jERHhdpnNoWmRo",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "jayden",
      "author_url": "https://www.google.com/maps/contrib/105743541374316989018/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLwULvJdQDmvny72TJa5YalPplbiH7oOpP8fRxWfUiYNkgQ6pmd=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "3 weeks ago",
      "text": "Standard and variety of food has improved over the years, remember having only raw food usually 2yrs back. Had not been eating sukiya for some time and decided to eat again and was surprised that they also do serve cooked food now and desserts.\nTheir lunch and dinner cold dishes also differs, dinner time they do have sushi too.\nThe cook food curry rice is not bad, definitely more worth it than before with the added cook dishes, the takoyaki is also not bad.",
      "time": 1745907705,
      "translated": false
    },
    {
      "author_name": "Joshua Wong",
      "author_url": "https://www.google.com/maps/contrib/107244780137289771541/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKAa4l2VvuWc_liCsqks7_fkOioTSW01q4e-BJ3IDb7dpY1=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "in the last week",
      "text": "On a rainy night, hotpot is always in mind. Went to this Suki-ya outlet as they still accept reservation on the eve of Christmas.\n\nI last visited this chain of restaurant many years ago, and they still maintain the food and service standards. As I am not that hungry, I opted for the normal buffet menu. The beef short plate is still nice though not the premium menu wagyu buffet. The vegetable and meat/fishballs selection are sufficient to keep your stomach full and fulfilling. I opted for the sukiyaki soup and the more simple shabu-shabu soup; both are quite flavorful.\n\nThe hotpot night ended with a small selection of fruits and ice-cream (I love the Thai milk tea flavour).\n\nExcellent service by Sharon, Andrew and Robin, they are very attentive to our needs and requests. Will be back again to try their premium buffet menu.",
      "time": 1747353407,
      "translated": false
    },
    {
      "author_name": "James Allworth",
      "author_url": "https://www.google.com/maps/contrib/109762420782407605052/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWn5eeGnmCsmXpBjrhVmRJ9mReeauGffQvCTLgYLW3zPzDSZ8ho=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 2,
      "relative_time_description": "4 months ago",
      "text": "There is no way this place is worthy of its 4.7 rating. Be warned!\n\nWe got two of the premium offerings. It’s not premium. You can taste the quality and it’s not at all good. The beef has more fat than actual meat (see photos).\n\nNot just that, the staff slow walked it. We had to ask three times for the meat to be served before they actually brought it..\n\nWe wanted to get fruit at the end of the meal. Well… that’s a no too! before the closing time they ran out of all of it. What’s worse though — they didn’t tell us it was closing time. Instead they just let it quietly slip by so they don’t have to provide more food.\n\nThe service is average. The food is average. And I left the whole experience feeling like their intent is to deceive customers out of what they paid for.",
      "time": 1736519990,
      "translated": false
    },
    {
      "author_name": "D Gabriel S",
      "author_url": "https://www.google.com/maps/contrib/113363179875294304181/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX1rZNNI6-t9KPk_RCcvtG5CrIzmSwnjaYNnypYq9CMNhyYCbE=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Had a wonderful dinner over the weekend at Sukiya. What made the experience great was the service of Robin who was warm and comforting just like the delicious soup. Such a friendly presence even when they were busy. I also saw him interacting with a young boy and his father in another table. He genuinely cares about people. Such a rare sight in this robotic world nowadays.\n\nHe was ably supported by Andrew and Raymond.\n\nWill definitely come back soon.",
      "time": 1736744276,
      "translated": false
    },
    {
      "author_name": "joelle chua",
      "author_url": "https://www.google.com/maps/contrib/114408295441639386492/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKi0j2hyCSmfBeROuknIZbWJPpu5pZbThHUorGBqOpYq6DAlQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Sharon who is in charge of the restaurant,  is very observant and attentive to every customers needs. She provides excellent service!!! Even asked us if we want toothpick and she keep coming back to our table to check on our soup and needs.\nReally excellent service for a buffet restaurant👏👏👏 This company should be proud to have such a good restaurant manager.",
      "time": 1733910659,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1916588244605671198",
  "user_ratings_total": 2214,
  "vicinity": "#01-35 Kallang Wave Mall, 1 Stadium Place"
}