{
  "formatted_address": "3 Muscat St, Singapore 198833",
  "geometry": {
    "location": {
      "lat": 1.3022854,
      "lng": 103.8589636
    },
    "viewport": {
      "northeast": {
        "lat": 1.303646730291502,
        "lng": 103.8603808802915
      },
      "southwest": {
        "lat": 1.300948769708498,
        "lng": 103.8576829197085
      }
    }
  },
  "name": "Sultan Mosque",
  "place_id": "ChIJb6xq2bAZ2jERE1P6sVKtofw",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Rubel Miah",
      "author_url": "https://www.google.com/maps/contrib/116138818580292249191/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWRSS3AXhJCVQdDDG0DxEPIhBYiONkp6Ca240RCQ7w21_u2jdPm=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Last month, I had the chance to visit the iconic Sultan Mosque in Singapore. The architecture is absolutely stunning, the golden domes, detailed design, and peaceful atmosphere make it a must-visit. I was especially moved by the history behind the mosque, especially how the base of the dome is made with glass bottles donated by the local Muslim community. A beautiful place rich in culture, spirituality, and unity.\n\nHighly recommended for anyone visiting Kampong Glam!",
      "time": 1746102931,
      "translated": false
    },
    {
      "author_name": "adam collins",
      "author_url": "https://www.google.com/maps/contrib/115059893489521037095/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUq5Gqak9S7lAp6FQfv-NoCoyJel0xDjcF9LwE9Aic8dAo2R-g=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "No tickets necessary and experiencing the humbling of a Muslim religion. The Sultan Mosque is an iconic architectural landmark, and is the impressive focal point for Singapore’s Muslim community. You can come here and get a small glimpse into the Muslim faith, or, if are Muslim, take prayer here as well. Even today, the iconic Mosque is an active point or all Muslim people of faith.",
      "time": 1746404190,
      "translated": false
    },
    {
      "author_name": "M. Zulfikar Firdaus",
      "author_url": "https://www.google.com/maps/contrib/110310996987595235658/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXMfwzKTsikaLB3v_CMbJpgT8Ob_GRWCs4ln0wGgaYAuiT2b87V=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "This stunning mosque, with its grand golden domes and intricate architecture, is not only a visual masterpiece but also a place that offers comfortable and spiritually uplifting experience, making it a perfect spot for reflection and relaxation.\nMust-Go place for Muslim if you visiting Singapore",
      "time": 1747270510,
      "translated": false
    },
    {
      "author_name": "Vijay devara",
      "author_url": "https://www.google.com/maps/contrib/104966255889525177171/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUpDJc7-Hm3HV6TsfwVhTH6jq5Yq6ZHA1Ejw1SuW8ig-cgwv5eDyg=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "The Sultan Mosque area market, nestled in the heart of Kampong Glam, is an absolute gem for anyone visiting Singapore. The market streets surrounding the iconic Sultan Mosque are vibrant, culturally rich, and full of life. Whether you’re a history buff, a foodie, or a shopping enthusiast, there’s something here for everyone.\n\nAtmosphere:\nThe area is incredibly atmospheric—beautifully preserved shophouses, colorful street art, and a distinct Middle Eastern influence that sets it apart from the rest of Singapore. Walking through the alleys around Haji Lane and Arab Street feels like stepping into a different world.\n\nShopping:\nLocal vendors and small boutiques sell everything from handwoven Persian carpets, Turkish lamps, and Arabic perfumes to trendy local fashion and handcrafted accessories. It’s the perfect place to pick up unique souvenirs or statement home decor items. Prices range from affordable to upscale, depending on what you’re looking for.\n\nFood:\nThe food scene is outstanding. There are traditional halal eateries offering authentic Malay, Arab, Turkish, and Indian dishes. Try the murtabak at Zam Zam or the nasi padang at Warong Nasi Pariaman. There are also modern cafes and dessert spots like Rich & Good Cake Shop (famous for their Swiss rolls) or the Instagrammable cafes along Bussorah Street and Haji Lane.\n\nCultural Experience:\nThe Sultan Mosque itself is a stunning landmark—open to visitors, it offers a peaceful break and a chance to learn about Islam and the history of Singapore’s Muslim community. The call to prayer echoing in the area adds to the spiritual and cultural depth of the place.\n\nAccessibility:\nIt’s conveniently located near Bugis MRT Station and within walking distance of major city areas. The streets are pedestrian-friendly, though it can get a little crowded during weekends and evenings.\n\nOverall:\nThe Sultan Mosque area market is a must-visit if you’re in Singapore. It’s a beautiful blend of heritage, culture, shopping, and food that offers a truly memorable experience. Highly recommended for tourists and locals alike.",
      "time": 1747299251,
      "translated": false
    },
    {
      "author_name": "Manabu",
      "author_url": "https://www.google.com/maps/contrib/107141457789630468548/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU0Og1eNJO5FA4m1ayQpr6RYYINnEn8xy9-gqp_oZ1gYFfFCdyo=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Although I'm not Muslim and I didn't enter, I saw several ethnicities/people and enjoyed around the mosk.\nThere are many restaurants, cafes, and artistic wall paints around here.\nI bet you'll enjoy the atmosphere here.\nIt looked like the anniversary festival of Kampong Glam was held, and there was crowded by many people.",
      "time": 1741965012,
      "translated": false
    }
  ],
  "types": [
    "mosque",
    "tourist_attraction",
    "place_of_worship",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=18204021739493151507",
  "user_ratings_total": 12196,
  "vicinity": "3 Muscat Street"
}