{
  "formatted_address": "1 Cuscaden Rd, Level 3, Singapore 249715",
  "geometry": {
    "location": {
      "lat": 1.3047183,
      "lng": 103.8246565
    },
    "viewport": {
      "northeast": {
        "lat": 1.305928330291502,
        "lng": 103.8261002302915
      },
      "southwest": {
        "lat": 1.303230369708498,
        "lng": 103.8234022697085
      }
    }
  },
  "name": "Summer Palace",
  "place_id": "ChIJPTigtosZ2jERrLUm0plK7bY",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Jowe Chu",
      "author_url": "https://www.google.com/maps/contrib/103686986101125387388/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX92zAsJNO2K3ot9Xnb2nZv23EnBfnFSN55GTuHc3o-7TcOT8E=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "Beautiful experience. Had the dim sum set menu. The dim sum is delicate and perfectly seasoned. The Peking duck is divine, thin crispy skin with a layer of fat, wrapped in perfect skin… absolutely perfect. The grouper thick fish broth is delicate and has the freshest fish I’ve ever tasted. The prawn with crispy rice is served with a chili crab style sauce … v creative and perfect. The fish noodles and Canadian lobsters were such a perfect pairing with flavorful broth. Dessert was a medley of pastry and fungus soup with apricots.\n\nI was so full and satisfied I could hardly walk. 😄😄\n\nI’ll find every reason to dine at summer palace again!",
      "time": 1745325622,
      "translated": false
    },
    {
      "author_name": "Catherine Tan",
      "author_url": "https://www.google.com/maps/contrib/107940738886750131191/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXSz5NRDYMQVTt3rRe_1VkrA3PnAWRFklnqLLMwpZYNLScGYYze=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Visited on 26 January 2025 and had an overall pleasant dining experience. Most of the dishes were well-executed, but the seafood fried rice was drier than expected due to an excessive amount of fried rice crisps, which overpowered the dish.\n\nThe barbecue platter, while flavorful, felt pricey at $68. Given the cost, I expected a more substantial portion or a standout element that would justify the price.\n\nThat said, the service was excellent, with attentive and professional staff who enhanced the overall experience. The ambience was also top-notch, making it a comfortable and elegant place to enjoy a meal.\n\nDespite the minor disappointments, I would still recommend Summer Palace for its quality offerings and exceptional service. However, I might opt for other dishes next time.",
      "time": 1738572119,
      "translated": false
    },
    {
      "author_name": "Sophia Un",
      "author_url": "https://www.google.com/maps/contrib/112681789285265695765/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLWWS59T7QogJ--5GshXRRcPxDgodXUXRVkfBFFn1MnqwasPA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Great Chinese food! Love the set menu. The service was top notch, manager Marcus and his staffs were very friendly and knowledgeable. Highly recommended",
      "time": 1746850597,
      "translated": false
    },
    {
      "author_name": "Eve L",
      "author_url": "https://www.google.com/maps/contrib/104657386364620273686/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKbUEEIDHRdrjCToCHikt9mkrThnEPfS_PH-QXMm9Cb8tgV1w=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Amazing food at Summer Palace. One of the better Peking Ducks I’ve tasted. Newly renovated, very modern and posh setting.\n\nA special shoutout to Jeremy for his very warm & kind service to my family. He was prompt in all our requests, our tea cups were never empty and was always seen wearing a friendly smile.\n\nIt was my brother’s birthday, so they presented longevity buns as a thoughtful gesture.\n\nP.S. I’ve already made another booking to come back here next month for a birthday lunch!",
      "time": 1740501029,
      "translated": false
    },
    {
      "author_name": "Manggo Dennis",
      "author_url": "https://www.google.com/maps/contrib/106922719154752432927/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV5S-8yKUMbOd8KvQ7Ej9Z7Z1pw4G8a0zcV5bvLcTAE0pdMZeNE=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "It was my first time dining here, as we gathered to bid farewell to a colleague. The restaurant has an upscale and elegant atmosphere, making it a perfect choice for special occasions.\n\nThe food truly lived up to expectations, with some standout dishes that left a lasting impression. I especially enjoyed the 蟹黄馒头 (crab roe buns)—they were perfectly crafted with a rich, flavorful filling encased in a soft, fluffy bun. Another highlight was the 北京烤鸭 (Peking duck), which was beautifully roasted with crispy skin and tender, juicy meat, served with all the traditional accompaniments.\n\nThe service was impeccable, with attentive staff ensuring we had everything we needed throughout the meal. My colleagues and I left feeling satisfied and happy, both with the delicious food and the excellent dining experience. I’d highly recommend this place for anyone looking to celebrate in style or enjoy a luxurious meal.",
      "time": 1735021970,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13181273708899513772",
  "user_ratings_total": 519,
  "vicinity": "1 Cuscaden Road, Level 3"
}