{
  "formatted_address": "173 Bencoolen St, Singapore 189642",
  "geometry": {
    "location": {
      "lat": 1.3016207,
      "lng": 103.8523367
    },
    "viewport": {
      "northeast": {
        "lat": 1.302899730291502,
        "lng": 103.8537662302915
      },
      "southwest": {
        "lat": 1.300201769708498,
        "lng": 103.8510682697085
      }
    }
  },
  "name": "Summer View Hotel",
  "place_id": "ChIJkaiCvrsZ2jER5wWScU4X87E",
  "rating": 3.9,
  "reviews": [
    {
      "author_name": "Damcho Tshering",
      "author_url": "https://www.google.com/maps/contrib/116833702802756994837/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXqAtUeVY73zAnBEAZtTJxBvT3mTV1Ne6VTUywQT8HYHtiVsix-=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "Had a wonderful stay at Summer View Hotel. The rooms were very clean, and the customer service was excellent. It's a family-friendly hotel with a welcoming atmosphere. Great location and amenities at a reasonable price. Highly recommend for anyone visiting Singapore. Will definitely stay again on our next visit!",
      "time": 1747300702,
      "translated": false
    },
    {
      "author_name": "Eleni Tzampatzopoulou",
      "author_url": "https://www.google.com/maps/contrib/103076366154732309471/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJQbVM8ed3-IXB2fICTMrztXfol8aQXD4ZhRo25YbcsDQM3wzQ4=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "We had a lovely stay at Summer view hotel with staff extremely friendly and helpful and the cleaning crew on top of everything room-related on a daily basis. The location of the hotel is fantastic, close to Bugis and other malls, close to markets and nice places to go out in the night. There's a bus stop and taxi stop right outside, but it's also close to other landmarks within walking distance.",
      "time": 1746292593,
      "translated": false
    },
    {
      "author_name": "Clarissa Lee",
      "author_url": "https://www.google.com/maps/contrib/106243171585144611141/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXoucjwOH5YwXYWMLoIMuIrfZBsxGnTdi6GYgdQ-Ta4wySm70yBFw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "I booked a superior triple room and one of us can't join us, hence I called hotel up to see if we can change to a twin room instead. Hotel refers us to Agoda. It was near 3 rounds of phone calls and 4 rounds of emails on day before check-in to sort this out. Basically the hotel staff has to wait for the Manager to decide. They cannot refund and let us rebook, cannot allow Agoda to change the room for us, initially wanted us to top up if we are going for deluxe twin room instead of superior twin room. I have to request for a complimentary upgrade for a deluxe twin room since they don't refund difference, cancel or change for us. Eventually we got a deluxe twin room with a side bed. The room is no frills, TV image is not clear, electric socket near bed is not working. Room is clean and spacious for the price paid, bed is comfortable, near to food, convenience store and train station. If you asked if I will book or recommend this hotel, I will say there are better customer service hotel within the vicinity and unlikely to come back to this.",
      "time": 1742949665,
      "translated": false
    },
    {
      "author_name": "Nanatsu Yoru (NanatsuYoru)",
      "author_url": "https://www.google.com/maps/contrib/103490525571158012025/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKbqjag00DCEY77nQ6so_wFrDD6-pF5hjfXAOTr9pCxfte1-A=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Pros: The location is superb, right in the middle of Bugis and a very short walk to Rochor and Bugis station, with Dhoby Ghaut also a walk-able distance. There is plenty to do in the immediate vicinity, including plenty of hawker stores, markets and eateries. The lobby is well kept, and the staff are courteous. The air conditioning in the room worked well, and the value cannot be understated. Will definitely consider this hotel again.\n\nCons: The rooms are fairly dated, and the attached cafe is not good value at all, though there are good options close to the property. Facilities are fairly basic, but adequate.",
      "time": 1743418065,
      "translated": false
    },
    {
      "author_name": "Eirene",
      "author_url": "https://www.google.com/maps/contrib/111666821721122073502/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJrfqEHndqR0XdHJM_WI6_jUTANxdZ-vLL4QkVjK8Aqsyjchg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "My stay at Summer View Hotel was exceptional, marked by warm hospitality, seamless check-in, and consistently friendly staff❤️\n\nThe larger room I booked was bright, elegantly decorated, and offered a comfortable ambiance with a pleasant street view.\n\nThe housekeeping team maintained impeccable cleanliness, and minor issues with the TV and air conditioning were promptly and professionally resolved by the technicians.\n\nThoughtful touches like snacks, drinks, and instant noodles added a delightful personal touch to the experience.\n\nThe hotel’s location in a quiet neighborhood, surrounded by art schools and eateries, provided a peaceful yet convenient stay.\n\nNearby MRT stations (Bencoolen and Rochor) made travel easy, and affordable food courts and hawker stalls offered a variety of local cuisine.\n\n🐦A quirky note: bus stops opposite the hotel are shaded by trees filled with birds in the evenings, so standing under the shelter or walking quickly is advised to avoid droppings😂!\n\nOverall, Summer View Hotel exceeded expectations as a 3-star hotel, offering comfort, convenience, and thoughtful service. I highly recommend it for a pleasant and hassle-free stay👍❤️",
      "time": 1740192353,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12822618189734217191",
  "user_ratings_total": 1086,
  "vicinity": "173 Bencoolen Street"
}