{
  "formatted_address": "70 Buangkok View, Singapore 534190",
  "geometry": {
    "location": {
      "lat": 1.3802538,
      "lng": 103.8852666
    },
    "viewport": {
      "northeast": {
        "lat": 1.381483630291502,
        "lng": 103.8865823802915
      },
      "southwest": {
        "lat": 1.378785669708498,
        "lng": 103.8838844197085
      }
    }
  },
  "name": "Sunlove Abode For Intellectually-Infirmed Ltd",
  "place_id": "ChIJ09ecKUIW2jERByfLqZCLP2Q",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "Alexander Jameouson Tan (Toshiro)",
      "author_url": "https://www.google.com/maps/contrib/111355600554595546754/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV2Akvllpw3E9om4iZ3gbBUg9DRx3N6aZvdfxX8CRiosDTNqv4r=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "I had a deeply concerning experience with the staff member named Carlman cafino nicoyco during my time at Sunlove Nursing Home. I observed inappropriate behavior towards new female staff members, including pressuring them for inappropriate actions. Furthermore, during visits, I noticed him making unwelcome advances towards female visitors, invading their personal space, and attempting to obtain their contact information without consent. Such behavior is entirely unacceptable and goes against the standards of professionalism and care that one would expect from a nursing home. Immediate action should be taken to address these issues and ensure the safety and well-being of residents, staff, and visitors.",
      "time": 1694692940,
      "translated": false
    },
    {
      "author_name": "Puver C",
      "author_url": "https://www.google.com/maps/contrib/107794707729069038111/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLnQmrOXqVQ-iaKkrq8cONq6b-ShF0gzYDyHmdnGWqqKZ82Kw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "This home does good work and cares well for its residents. Let's all appreciate the work they do",
      "time": 1737592953,
      "translated": false
    },
    {
      "author_name": "Aiza Tan",
      "author_url": "https://www.google.com/maps/contrib/108911593902462293848/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJDR4VUf-HPlyvYvy74u2oDGMY1Z_hh9EAbakUrRMDhkBfW8w=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "During my stay at Sunlove Nursing Home, I encountered disconcerting behavior exhibited by an individual on the staff roster, who goes by the name of Carlman. I personally witnessed instances of inappropriate conduct directed towards recently employed female staff members. This included the exertion of undue pressure for actions that are unequivocally considered unacceptable within a professional healthcare setting.\n\nFurthermore, during visitation hours, I observed Mr. Carlman engaging in unwelcome advances towards female visitors. This behavior involved an invasion of their personal space and attempts to solicit their contact information without their explicit consent. Such actions stand in stark contrast to the established norms of professionalism and care that one rightfully expects from a nursing home facility.\n\nIn light of these observations, it is my strong belief that immediate and thorough action is imperative to address these matters. Such actions are necessary to safeguard the welfare and security of the residents, staff, and visiting individuals associated with Sunlove Nursing Home.",
      "time": 1694695163,
      "translated": false
    },
    {
      "author_name": "megan",
      "author_url": "https://www.google.com/maps/contrib/115355322259642598082/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUd4_tSEjPF-BayoCdN1tdkBS44VQHjS7qIYdeKd4sUDJCyprsy=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "my friend had an absolutely terrible experience at Sunlove Nursing Home, largely due to the staff member EN Carlman. His behavior was appalling – he was consistently rude and disrespectful. I observed him blatantly checking out girls and attempting to give them his phone number, which is completely inappropriate and unprofessional. My stay was completely ruined by his behavior.",
      "time": 1691504692,
      "translated": false
    },
    {
      "author_name": "Briann",
      "author_url": "https://www.google.com/maps/contrib/114532045913553500048/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXtU3HKh0iVxqYvkI63EeVb9nSBp5kVUj5r2UkCuR4EqbdGt5Y=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "My recent relative experience at sunlove nursing home was nothing short of infuriating, all thanks to the abysmal performance of an enrolled nurse named Carlman cafino nicoyco. To put it bluntly, he is the epitome of incompetence and indifference, and his presence only added to the already distressing environment.\n\nIt's mind-boggling how someone like Carlman cafino nicoyco even made it into the healthcare profession. His lack of care and compassion towards the elderly residents was evident in every interaction. I witnessed him treating them like inconveniences rather than human beings deserving of respect and dignity.\n\nNot only did Carlman cafino nicoyco lack basic empathy, but he also seemed utterly clueless about his responsibilities. Residents were left waiting endlessly for their medications, while he meandered around as if their well-being was of no concern to him. It's infuriating to see someone so careless and unprofessional in a position that requires attentiveness and diligence.\n\nCommunication? Forget about it! Carlman cafino nicoyco couldn't be bothered to keep families informed about their loved ones' conditions or care plans. It was like pulling teeth just to get a simple update. This level of neglect and disregard is simply unacceptable.\n\nI can't fathom how a nursing home could employ someone like Carlman cafino nicoyco, who clearly has no passion for the work he does. He tarnishes the reputation of the entire facility with his laziness and callous attitude.\n\nWhile there were other staff members who tried to make up for Carlman cafino nicoyco shortcomings, it was evident that his negative influence permeated throughout the environment. The fact that this individual is entrusted with the care of vulnerable residents is infuriating and disheartening.\n\nsunlove nursing home needs to take serious action to rectify this situation immediately. The well-being of its residents should be the top priority, and that means weeding out careless and apathetic employees like Carlman cafino nicoyco. It's time for management to step up and ensure that only dedicated and compassionate individuals are entrusted with the care of our loved ones.\n\nIn conclusion, my relatives experience with Carlman cafino nicoyco at sunlove nursing homewas nothing short of a nightmare. I strongly urge others to think twice before considering this facility for their loved ones' care. They deserve better than to be subjected to the negligence and indifference of someone like Carlman cafino nicoyco.",
      "time": 1691504193,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7223645780765779719",
  "user_ratings_total": 29,
  "vicinity": "70 Buangkok View, Singapore"
}