{
  "formatted_address": "3 Mount Elizabeth, #06-08 Medical Centre, Singapore 228510",
  "geometry": {
    "location": {
      "lat": 1.3045777,
      "lng": 103.835462
    },
    "viewport": {
      "northeast": {
        "lat": 1.305783430291502,
        "lng": 103.8367685802915
      },
      "southwest": {
        "lat": 1.303085469708498,
        "lng": 103.8340706197085
      }
    }
  },
  "name": "Surgery Centre For Children: Paediatric Clinic",
  "place_id": "ChIJEW8RUpIZ2jERem8pf_JPXQ4",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Budiman Salleh",
      "author_url": "https://www.google.com/maps/contrib/107970700937773908606/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXdwOOjyo-kdsMZ4R87aDiXoL1OXgFBBGpgzfIsIXZ0rIBJAIAh=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "We went to Dr. Chui at the Surgery Centre for Children for my 9-year-old child's surgery and it was the best decision. I cannot recommend him highly enough.\n\nFrom the moment we arrived for consultation, the staff was welcoming and attentive, which immediately put my son and me at ease. Dr. Chui was exceptional in his approach, taking the time to explain the procedure in a way that my son could understand. He was patient, thorough, and genuinely caring, answering all of our questions and addressing our concerns with compassion and clarity.\n\nThe surgery itself, I thought, went remarkably smoothly, and Dr. Chui's expertise was evident. The precision and skills made for a quick recovery, allowing my son to get back to his usual activities quickly. Post-operative care instructions were clear and easy to follow, making the transition back to home seamless. The admin assistant from the Clinic was very helpful!\n\nWhat stood out the most was how Dr. Chui and his team treated us. They were patient, attentive and clear throughout their communication. This made us, confident and calmer as parents. Their professionalism and kindness made a potentially stressful experience much more manageable.\n\nIf you are looking for a skilled and compassionate surgeon for your child, I highly recommend Dr. Chui. Thank you, Dr. Chui and the team from Surgery Centre For Children, for your excellent care!",
      "time": 1733573003,
      "translated": false
    },
    {
      "author_name": "Chelle Algarme",
      "author_url": "https://www.google.com/maps/contrib/112583508181489369467/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV7DrwICGJRhUlBlNi0MC6cV5iocUzMzbPpDO5ER_BUHHtmrVQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Best decision ever! Dr. Chiu was very gentle, reassuring and you can see  his passion on what he is doing… he really take time to explain to me everything that i needed to know.. usually to see a doctor for my son is super chaotic but our appointment with him is smooth and less scary because he tend to play with his patients and make them comfortable. 5 start is not enough..superb team especially nurse Sarah..",
      "time": 1729605640,
      "translated": false
    },
    {
      "author_name": "Ganesh-Meenu Vedantham",
      "author_url": "https://www.google.com/maps/contrib/104298569652823510977/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJyD_5bxuJW7DFGjhngUznt209lpPx8DqWNiNM-YlbLMn5rHg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Fantastic team here. We visited Dr Chan when my daughter had stomach pain and they were fantastic. Dr Chan patiently explained to my daughter how it all works and what was going on. He answered all my questions patiently and told us next steps. I also give kudos to Ms Evelyn at the front desk whose follow up and assistance is highly commendable. She made sure we had everything before we left and made multiple calls to make sure we had the reports. Highly impressed with the entire service!",
      "time": 1630728525,
      "translated": false
    },
    {
      "author_name": "Fiona Gao",
      "author_url": "https://www.google.com/maps/contrib/116741120976012788481/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLbmyjBAgUJEiytSGETClHeha0NugQHHRQjYvt08NoW35okAA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Our 3-week-old baby was admitted to A&E and Dr Chui Chan Hon was assigned to our case. From the start, Dr Chui was reassuring and great at explaining the possible hypotheses for his condition, and diagnostics that would be required. He was very experienced and all the procedures were carried out efficiently. Baby even slept through one of the procedures, so it wasn’t too uncomfortable I guess. His nurse Sara was also great at explaining the after care require at home in detail, step by step. Throughout the whole process, we felt that we were in very good hands, and would recommend Dr Chui to anyone seeking an experienced, knowledgeable, and reassuring Pediatric Surgeon for their tiny one. We’ve heard from other medical staff that Dr Chui is highly regarded in the region, and it’s easy to see why!",
      "time": 1658460346,
      "translated": false
    },
    {
      "author_name": "Farishte and `jamsheed Ghaswalla",
      "author_url": "https://www.google.com/maps/contrib/103401163222703284599/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLk5Ss8APYMmKX0IWxX037ykOZJSECQam06vsOyMuVlooVM=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Please don’t think twice !! This is a really superb team. The doctor took time to explain the situation satisfy our every question and more. Made my baby girl feel extremely comfortable before and after the surgery. And I can’t emphasize more on the most amazing nursing staff. They turned what was the most scariest experience for our family into amazing and happy memories. What an amazing Doctor and nurse team …. Thank you - The Ghaswalla’s",
      "time": 1627117961,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1035071392299183994",
  "user_ratings_total": 11,
  "vicinity": "3 Mount Elizabeth, #06-08 Medical Centre"
}