{
  "formatted_address": "205 Hougang St 21, #02-18 Heartland Mall, Singapore 530205",
  "geometry": {
    "location": {
      "lat": 1.3595679,
      "lng": 103.8852131
    },
    "viewport": {
      "northeast": {
        "lat": 1.360721130291502,
        "lng": 103.8865569302915
      },
      "southwest": {
        "lat": 1.358023169708498,
        "lng": 103.8838589697085
      }
    }
  },
  "name": "Sushi Express - Heartland Mall",
  "place_id": "ChIJ81W8-bMX2jERmSx35HwzXPc",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Ah Y",
      "author_url": "https://www.google.com/maps/contrib/108442592234717052856/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKaltiYb4rNoXEI-_FYvNt1N1fKM7NtRGgwBbRvQgig_9WE1w=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Disappointing Experience at Sushi Express Kovan – Poor Service & Lack of Variety!\n\nI just dined at Sushi Express Kovan during dinner hours, expecting an enjoyable and seamless experience. However, the visit turned out to be quite disappointing due to multiple service and operational issues.\n\nFirstly, the sushi conveyor belt had the same limited selection of dishes rotating repeatedly, with little to no variety. It became frustrating to see the same items pass by without any new additions, making the dining experience monotonous. Even after waiting for an extended period, there was no improvement in the selection.\n\nSecondly, we placed orders for specific sushi items, but they never arrived. Despite following up, there was no clear communication or resolution. This was especially frustrating as we had been looking forward to those dishes.\n\nThe lack of staff was another major issue. During peak dinner hours, there was only one server, one cook, and one manager handling the entire restaurant. With such an understaffed team, service was extremely slow, and it was difficult to get assistance when needed.",
      "time": 1743242628,
      "translated": false
    },
    {
      "author_name": "elaine toh",
      "author_url": "https://www.google.com/maps/contrib/112505973612756553289/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLJhbt49amid_rk1_hReWC7sYhN_14aj7GMeidUiBQoGnLjfg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I come here occassionally and always a pleasant time. I find the food quality in this branch better than the other branches i have visited. I also order platters from this branch for home parties. Understaff - yes , but the staff who service the branch a long time are not rude. They can get busy and there can be impatient customers. Also agree that the variety on conveyor belts on some days (esp dinners) can be limited. Will usually ask for my specific orders through servers. It comes to me from conveyor belt and can take time. Most of the time reasonable response time.",
      "time": 1744177306,
      "translated": false
    },
    {
      "author_name": "teq lo",
      "author_url": "https://www.google.com/maps/contrib/102351149815922003189/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIQQHzpHNprduTGQHMlRRtYQulrnO-xz7-b9VJ8P2guLbaLJQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "This is the worst sushi express I ever go to. We were sitting at the end and the air con is not working.. Hot like mad. Then the variety is so limited and have to keep asking the staff to add the variety. There is a time limit but yet we have to wait for the item to come. The kitchen should have observe what are lacking and refill.",
      "time": 1747052449,
      "translated": false
    },
    {
      "author_name": "J G",
      "author_url": "https://www.google.com/maps/contrib/103689009046237488530/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW-rClnkWcDlFm8lDOa_Oftxj03lRkz5ykbLwgXzN9Ami3byraL=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Been buying take out from this outlet cos of the August promotion. Enjoyed their salmon bowl, especially with its seaweed & tamago. Salmon sashimi is fresh. One of the few places that has abalone slices & also tastes well with the mayo sauce. Most importantly, the staff Sandali knows her work well. She was the one who highlighted to me at the beginning of August when I first bought the take out of the promotion. Most of the subsequent visits was glad to be served by her too.\n\nUpdate: On-going promo for Sept. Got served by Mr Ang today, service was prompt, efficient & seamless. Our favourite outlet so far.",
      "time": 1727287177,
      "translated": false
    },
    {
      "author_name": "Xin Hao",
      "author_url": "https://www.google.com/maps/contrib/101038177603319548234/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU6c44XsILjRE2Islw02Z6jqIpGV_4urvZ0lGOy57c-ErkANHqe=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "3 years ago",
      "text": "Simple quick fix for your sushi cravings within the heartlands. Very affordable plates @$1.50 each. Range is decent. Good enough for that price. Comes with free flow hot Japanese green tea. Service is quick although the seating time limit is capped at 40minutes. Belt’s variety and options are topped up pretty quickly as well. Quality has definitely improved over the years.",
      "time": 1648372966,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17824178036727557273",
  "user_ratings_total": 592,
  "vicinity": "205 Hougang Street 21, #02-18 Heartland Mall"
}