{
  "formatted_address": "5 Ontario Ave, Singapore 576193",
  "geometry": {
    "location": {
      "lat": 1.3568346,
      "lng": 103.8283736
    },
    "viewport": {
      "northeast": {
        "lat": 1.358151830291502,
        "lng": 103.8297446802915
      },
      "southwest": {
        "lat": 1.355453869708498,
        "lng": 103.8270467197085
      }
    }
  },
  "name": "Susucre",
  "place_id": "ChIJpQWWKRIY2jERmVgVkNuhuiE",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "genevieve",
      "author_url": "https://www.google.com/maps/contrib/117792779864572253188/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ2izOzJ3r066e0_4lV6FiCtvwwNwOl3dXyQvkNSkE2CFA5lg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I’ve grown up eating sugee cake, but nothing has ever come close to the one from Susucre. One bite and I was instantly transported back to my childhood—those beautiful Eurasian weddings where we’d get a precious slice of sugee cake wrapped in foil to take home. That feeling, that taste, that nostalgia… Susucre captured it perfectly, and somehow made it even better.\n\nTheir sugee cake is honestly out of this world. Rich, buttery, and so perfectly balanced—it’s the kind of cake that makes you pause mid-bite and just smile. And trust me, once you’ve tried it, you’ll find yourself craving more.\n\nWhat makes the experience even more special is Jasmin, the amazing soul behind it all. She’s warm, genuine, and pours her heart into every creation. I’m so grateful to have found her—and this gem of a cake.\n\nIf you’ve never had Susucre’s sugee cake, please do yourself a favour. It’s not just a dessert. It’s a memory, a hug, and a little bit of magic all in one.",
      "time": 1742720652,
      "translated": false
    },
    {
      "author_name": "Marita Vavoulioti",
      "author_url": "https://www.google.com/maps/contrib/116483289152974683184/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW1C4m-qWZfG-e7yOi09nDhxxM1pc2kPIDwsYEp6BqGjw4jWI4=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "‎Susucre Cakes have made the birthday of my family a special occasion! The owner really looks after the details in terms of taste and design and provide valuable insights while being flexible with any requirements. Thank you so much 😊 i strongly recommend for custom cakes birthdays",
      "time": 1722044021,
      "translated": false
    },
    {
      "author_name": "Zee J.",
      "author_url": "https://www.google.com/maps/contrib/109804992964581552173/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ0nhVyG8gRV2Y-ekfvPNw__dwN-HoEhG9uhb3SKm1dOpkEHw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Susucre accepted a 3-tiered wedding cake order with a VERY tight timeline. The service was stellar and Jasmin patiently answered our many questions. We loved the outcome (my hurried photo doesn’t do it justice) plus the lemon lavender cake was delish!",
      "time": 1654299713,
      "translated": false
    },
    {
      "author_name": "Abigail Eats",
      "author_url": "https://www.google.com/maps/contrib/115460934006959049602/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVH96w8C9wpqhVYuxa2T9K-J0YEAO3UpO9YWc-22rsQNoKgI4kG=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "7 years ago",
      "text": "Annina and the team crafted us the loveliest three tiered wedding cake, pulling together our chosen colour theme and flowers in such an elegant and artistic way. We had both hand-painted watercolour flowers, and utterly life-like ones sculpted out of fondant on our cake, which looked utterly spectacular. Working with them was a breeze, and the cake arrived in perfect condition at the time we specified.",
      "time": 1504096332,
      "translated": false
    },
    {
      "author_name": "Actar Raikit",
      "author_url": "https://www.google.com/maps/contrib/105007914261045127140/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWYbT0oFu8dxCF0eX4rQYvpO6Ld1Kz-KpSzLlg6ASxBz5e_T0k=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "As an anime fan, I was looking for a cake shop to craft my custom birthday cake based on the Madoka Magica anime series and went with Susucre. Thankfully, I decided to trust my gut and ignore the other reviews as Susucre surpassed all expectations.\n\nNot only was it exactly what I asked for, they went above and beyond, making the orbs and panel lines on the shield pop out, using candy beads to recreate the gems and adding metallic luster dust to the fondant. To top it off, the cake was delicious! The raspberry flavor went together with the chocolate very nicely and wasn't too overpowering.\n\nThe cake went over great with my guests and I have received a ton of comments on both YouTube and Facebook on the cake. I have since posted pictures of my cake to Reddit and it has garnered nothing but awe. One of the users mentioned that it looked \"like a 3D render\" and another said that it looks so good that \"even non-anime fans would appreciate it\".\n\nI feel so bad for cutting it and eating it because it looks so good. As a fan, I honestly want to have this on display in my collection permanently. I mean, from the top, doesn't it look like a replica/cosplay prop? This is the first time in my life where I'm confronted with a situation where can't have my cake and eat it... literally.\n\nAll in all, thank you for making my birthday just that much more special! I will definitely return next year for another cake if I can come up with a design worthy of being brought to life by these guys.",
      "time": 1562391053,
      "translated": false
    }
  ],
  "types": [
    "bakery",
    "store",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2430432913307031705",
  "user_ratings_total": 37,
  "vicinity": "5 Ontario Avenue"
}