{
  "formatted_address": "41 Namly Ave, #03-00 SIMM Management House, Singapore 267616",
  "geometry": {
    "location": {
      "lat": 1.3259884,
      "lng": 103.7999822
    },
    "viewport": {
      "northeast": {
        "lat": 1.327109230291502,
        "lng": 103.8013086302915
      },
      "southwest": {
        "lat": 1.324411269708498,
        "lng": 103.7986106697085
      }
    }
  },
  "name": "Table at 7",
  "place_id": "ChIJz7Bd3Owb2jERZ3tVwG5C0M8",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Meng Hui Ong",
      "author_url": "https://www.google.com/maps/contrib/111469324414915340095/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVfVc2rqbClc93z183wbhBP7HPlhd8sJWtItJHU_w7_pzitSGvcYg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "2 weeks ago",
      "text": "A hidden gem for Indonesian style food! It’s very rare that I give a 5 star review of food but this place deserves it.\n\nChef owner Eugenia Ong guided me through the entire restaurant, private dining room etc.\nChef Eugenia is very passionate about the quality of the ingredients in her food and she uses the best of the best.\n\nStarted with the usual fried prawn crackers which were not oily. The sambal was the wow factor. Well balanced, not too spicy nor salty. The umami sambal is obviously made fresh daily with subtle notes of blachan and chillies.\nDip the crackers into the sambal and enjoy.\n\nPork and chicken satay were cooked Indonesian style with some kechap manis type sauce lightly drizzled on top.  Iberico pork is used and it was “melt in your mouth” tender. Chicken satay was also tender and juicy. Homemade achar complemented the dish perfectly.\n\nThe Prawn Mee Soup was a winner. One of the best ever. Chef revealed that lobster heads, dried scallops were added to add richness and flavour in the stock.\nThe stock was thick and hearty loaded with flavour of prawns and pork. Spinach is used instead of the usual kangkong. Iberico pork and prawns added more flavour.\nLiberal topping of fried pork lard added another layer of flavour!\nPresentation was special as it came in a lidded bowl on a trivet with a small tea candle lit under it. This ensures a delicious warm bowl while eating through the layers of ingredients.\n\nThe winner is the beef rendang which came with the Nasi Kunyit birthday dish. Beef was super juicy and tender. Rendang is cooked in the traditional manner using roasted shredded coconuts which gives it a depth of flavour. The best beef rendang I’ve tasted.\n\nExcellent food. What a gem of a place!",
      "time": 1746065244,
      "translated": false
    },
    {
      "author_name": "Teck Boon",
      "author_url": "https://www.google.com/maps/contrib/105978834231481267643/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUhhjSvd8WvJhcPJ0N_s5uXl9BwSoDYFYdYkSjIFzqcBjIwg3BhqA=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "Food and service are both pretty good but there’s a couple of things to take note of. Food can take quite a while to be ready if the restaurant is full. After we were served our starters, it took another 50mins before the main courses were ready. Everything we ordered was really nicely prepared and was good, but please give the desserts a miss. It was more of an after thought on a otherwise very good menu.",
      "time": 1746803675,
      "translated": false
    },
    {
      "author_name": "Suet Ming Yeong",
      "author_url": "https://www.google.com/maps/contrib/115390546721708590722/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUhVjaogIZAuAZeOM3YFlPL5MLUTn1a4ppMBOZdq5IXUA2ZFwM=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I had the ikan pepes - cod grilled in banana leaf, coconut salad and roasted garlic rice - for my main. The fish was fresh and sweet, and infused with grill aroma. The tomato-based sambal was refreshing. The roasted garlic rice was like an \"umami bomb\"... like chicken-rice rice on steroids!\nI was also impressed with the banana crumble with kaya and gula java.\nWe will be back for more!\nAlmost fullhouse tonight despite the stormy weather. Reservations are a good idea.\n1 slight downside was that there were many young children dining with families this evening. (Saturday, on a long weekend). Therefore there was a fair amount of squealing and kids running around. I guess this is a family-friendly, kid-friendly place, and not so much a quiet grown-up romantic candlelight dining place.",
      "time": 1745068863,
      "translated": false
    },
    {
      "author_name": "Kevin Ang",
      "author_url": "https://www.google.com/maps/contrib/111247294128726535324/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXSJgnV3SbZgFuJfz2QlgITx0UpxOCgc5NIVuH0Ui5cqlVslLuX=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Five stars all round for this establishment. Good food, good service and good atmosphere. Can be considered to be off the beaten track in location. Food wise the mix of Indonesian and western flavours is exquisite.",
      "time": 1733644972,
      "translated": false
    },
    {
      "author_name": "D.Teo",
      "author_url": "https://www.google.com/maps/contrib/108079742156627501393/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV6YNBVyqNHrsyZ19_TS2-ZnNMAUn5A9te2FNO27-Kt1OCcf-pXug=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Was on leave and came here for a nice quiet lunch. Service was attentive and restaurant setting peaceful.\n\nFood was great too, had the 2 x 3-course set lunch. Really value for money. Will be back again!",
      "time": 1731406114,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14974541804447562599",
  "user_ratings_total": 122,
  "vicinity": "41 Namly Avenue, #03-00 SIMM Management House"
}