{
  "formatted_address": "SD-01-1, Pusat Komersial Visi Medini, 2, Persiaran Medini, Bandar Medini Iskandar, 79250 Iskandar Puteri, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.4171584,
      "lng": 103.6218498
    },
    "viewport": {
      "northeast": {
        "lat": 1.418498080291502,
        "lng": 103.6232267802915
      },
      "southwest": {
        "lat": 1.415800119708498,
        "lng": 103.6205288197085
      }
    }
  },
  "name": "Tadika Xaris Medini",
  "place_id": "ChIJE7pif5EL2jERc4qnsweE3gw",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Li Jing",
      "author_url": "https://www.google.com/maps/contrib/116956592642030374940/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW24WfTh7qTu9T4u83YlKvbBQ_tDS9KOQh5NR97BHPdInKnoy0zbg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "We are glad to have our son in Xaris Medini. The teachers and Staffs there are very friendly and helpful. My son enjoys staying and studying there, he is looking forward to go to school every day. Furthermore,  my son did learn things and make improvements there, in terms of counting, reading, speaking, physical activities and social interactions. He makes friends over there and I will recommend Xaris Medini to my colleagues and friends. Thanks and keep up the good works.",
      "time": 1695123768,
      "translated": false
    },
    {
      "author_name": "S Cho",
      "author_url": "https://www.google.com/maps/contrib/101178527378776946558/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJK43EuSpeXwmrq29mTULsPHQDpTFoATiycgQQ9L1r88wfLwg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "As a parent, finding the right daycare for your child is a monumental decision, and I am so grateful to have discovered Tadika Xaris Medini. The teachers at XM are not just educators, but they are genuine caregivers who exude warmth and professionalism. It's evident that they have a genuine passion for nurturing and educating young minds. The classrooms are well-organized, and the play areas are thoughtfully designed.  The teachers are approachable and open to communication. The daily activities and curriculum are not only educational but also fun. Thank you XM for providing such a remarkable start to my child's educational journey!",
      "time": 1694485951,
      "translated": false
    },
    {
      "author_name": "Soke Ting Ng",
      "author_url": "https://www.google.com/maps/contrib/116532736014964322436/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKwboNcPS-RhzmGew0Ae-ukOah_yYDSC0iRS6lv5IfUzJnrWA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My husband and I are so very pleased that we found Tadika Xaris Medini for our daughter. Tadika Xaris Medini is a wonderful learning environment for children to learn as the Montessori method is a more natural way for them to learn. The activities are very broad, making the experience fun and educational as well. When you walk into Tadika Xaris Medini, can see that it's very open, it's inviting, and extremely interactive. The curriculm at Tadika Xaris is much more focused on the individual child. My daughter is excited to go to school and becoming more social and educated each day. The teachers are so warm and loving. I highly recommend Tadika Xaris Medini for anyone looking for the perfect place for your child to start pre-school!",
      "time": 1695882330,
      "translated": false
    },
    {
      "author_name": "bingyu chen",
      "author_url": "https://www.google.com/maps/contrib/104575946391964549083/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWq4fzHuxXVwSSZq9A2rfQTcJJV3rhzj_euGg3Ek9owFzp8vDs=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Teachers are always kind and patient. My children love to go to school and love his friend in the shool. Every night he share with me what happened in school. The teachers often share with me what happened with my kid also. The teachers are very nice with each kid as I know. The school cultivates children’s independent character through daily exercises. I am also very satisfied with the school environment. There are two aunties in the school who are very good to the children and very patient. I am very grateful to the school for being very patient with my child.",
      "time": 1694867622,
      "translated": false
    },
    {
      "author_name": "Sharon Kaur",
      "author_url": "https://www.google.com/maps/contrib/106223769402128581332/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJqNTuAcQagd_QTazZ5uSKEsCocnRg5MnDX74zQIFBgE5glDA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "This school is truly a GEM, I love love this school! My daughter's first school and I am so glad we found & made the right choice. I am so grateful for the positive experience we have with Ms Hong & her team, who are all so loving, supportive & patient. School environment is welcoming and clean, we can see how our daughter has flourished from time to time, and would be surprised at her new words & songs at home, including good habits such as cleaning up. To all parents who want their kids to be taught with lots of love and care, this is the place to be!",
      "time": 1696212635,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=927323741898639987",
  "user_ratings_total": 19,
  "vicinity": "Pusat Komersial Visi Medini, SD-01-1, 2, Persiaran Medini, Bandar Medini Iskandar, Iskandar Puteri"
}