{
  "formatted_address": "UNIT 7, Jln Niaga Aspira 1/2, GERBANG NUSAJAYA, 79200 Iskandar Puteri, Johor Johor bahru, Kampung Tiram, 79200 Johor, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.4197463,
      "lng": 103.5939765
    },
    "viewport": {
      "northeast": {
        "lat": 1.421110030291502,
        "lng": 103.5952975802915
      },
      "southwest": {
        "lat": 1.418412069708498,
        "lng": 103.5925996197085
      }
    }
  },
  "name": "TAKANO BISTRO JB",
  "place_id": "ChIJI9orrw4L2jERLh4B49bTA84",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Selvagnanam Monesha",
      "author_url": "https://www.google.com/maps/contrib/107570982339557952657/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUcAZSvMXfag9sIXcU5W8eUx_IrIUBLSfKMPK2cESdbqEr5LychAw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "I heard that Takano ventured an outlet in Johor and I have to try it. Well the food was amazingly done. We tried Mutton, chicken satti sorry, chicken kicap satti sorru and sardine satti sorru. Everything has its own unique tastes. Not usual where all satti sorru will taste similar but here, it wasn’t the case. The Kallu (palm wine) was worth to try. The environment was cozy and new.  The only is that the staffs are too shy, I guess. They might need someone who can speak up loudly and clearly to guide them. Definitely recommend for those who’s staying near Gelang Patah.",
      "time": 1737801571,
      "translated": false
    },
    {
      "author_name": "RAVINA SANTHY A/P SUBRAMANIAM",
      "author_url": "https://www.google.com/maps/contrib/101161820893938234722/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWNIoLPG3FsmnKkMJqTsr5GzegSIwYlY5uF-3ZbhTnJ4CNLrcs=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Came here after seeing good reviews and food was delicious…. Ordered satti sorru and also this man tau bun with curry, spectacular they definitely live up to the hype. Highly recommend, not to mention we had extra 10% discount for Valentine’s Day\nUpdated review.\nWe had to wait an extremely long time, and the service was disappointing. The staff member mentioned that only she and the chef were working, so the food would take a while, but she didn’t even give an estimated wait time. This lack of communication was frustrating. On top of that, the air conditioning wasn’t turned on, and her excuse was that she was alone, which makes no sense. To make things worse, the dish I wanted wasn’t even available.\nPrior to my visit, I came across a particularly negative review but chose to overlook it, assuming it might have been an isolated experience. However, upon arriving, I found the service to be exactly as described, if not worse. The inefficiency, lack of attentiveness, and overall disorganization made for an incredibly frustrating experience.\n\nA word of caution to anyone arriving on an empty stomach and a short temper please prepare for a test of patience. If you have high blood pressure, I strongly advise bringing your medication, as the level of frustration this establishment induces may lead to unnecessary health concerns. Consider this a fair warning.\n\nI’ve given honest reviews before when the service was good, but I did not expect such a poor experience. Take this feedback as you will.",
      "time": 1740291390,
      "translated": false
    },
    {
      "author_name": "r vish",
      "author_url": "https://www.google.com/maps/contrib/109967128682925532708/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJOojrw_FlWjM3_m0_SYz9Cm5AAyPQR-k5-8pjRdJvSJHTt6Eo=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "had dinner here , ordered nasi ganja set 2pax  and masala chicken satti soru . satti soru really awesome . for me the food was really nice compared to outside restaurants. very important thing the staff here very well mannered .i love their hospitality . if you guys face any issues in food taste feel free to call and let them know .they immediately change over as per your taste bud .",
      "time": 1746632866,
      "translated": false
    },
    {
      "author_name": "Sha Abby",
      "author_url": "https://www.google.com/maps/contrib/101600913844252056193/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXP310qG40EBXNm0Dx7jqPOr93iwABbz7csIeo8VZsTNEfYJ_A=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "I went to try and support Takano Bistro in JB on 1/3/2025 ,Saturday but unfortunately, my experience was extremely disappointing. I ordered the *Masala Chicken Satti Sooru* and *Kicap Mutton Satti Sooru*, but both dishes were tasteless and had a peculiar aftertaste. Additionally, the *Egg Podimas* came with anchovies that were not properly fried, making it unpleasant to eat. The *fried chicken* was another letdown—it lacked seasoning and was completely bland.\n\nWhen I brought up these issues to the staff, I was told they could not refry the dish because they were “too busy,” even though the restaurant was not at full capacity. The response I received was dismissive, with staff insisting that “this is how the food is” and blaming the poor quality on a high volume of orders. If that’s the case, perhaps there should be limitations on the number of orders they accept to ensure food quality isn’t compromised.\n\nOverall, I was really hoping for a good experience, but the food and service left much to be desired. I hope the management takes feedback seriously and improves both the food quality and customer service moving forward. Thanks ✌🏽",
      "time": 1740920143,
      "translated": false
    },
    {
      "author_name": "Thana Kutty",
      "author_url": "https://www.google.com/maps/contrib/102248612041844674482/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLId9QZwgr3ALpOpGe4v8hqcZYr9gfuVB5xLjLAMRrD8BTnCA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Dine in with 6 pax. Chicken black pepper was damn hot and spicy. It's become my favourite as well. Besides that chicken and mutton satti sorru was nice as well. Couldn't take pic as hungry tummy didn't allow for that. Overall the service was okay and highly recommend.",
      "time": 1738165553,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14844941716628250158",
  "user_ratings_total": 32,
  "vicinity": "UNIT 7, Jln Niaga Aspira 1/2, GERBANG NUSAJAYA, 79200 Iskandar Puteri, Johor Johor bahru, Johor"
}