{
  "formatted_address": "1 Tanjong Pagar Plz, #01-19, Singapore 082001",
  "geometry": {
    "location": {
      "lat": 1.2753937,
      "lng": 103.8423792
    },
    "viewport": {
      "northeast": {
        "lat": 1.276766480291502,
        "lng": 103.8440578302915
      },
      "southwest": {
        "lat": 1.274068519708498,
        "lng": 103.8413598697085
      }
    }
  },
  "name": "Talent Arts Frame Makers",
  "place_id": "ChIJZVV0h2wZ2jER5qFRrsZo73k",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Dan P",
      "author_url": "https://www.google.com/maps/contrib/104969645521365816042/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWB64xoUW8FLM2-i8lud6zxN4LTGkmNh-XhOk5R8eFWRDRFGWfq=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "So, I began collecting Japanese Woodblock Print Artworks during lockdown; turning my long-term interest in them into somewhat of a shorter-term obsession. I collected 13 pieces in all; 6 war triptychs detailing famous battles and stalwart samurai, 4 iconic locations bathed in autumn glow or heavy fall of snow, 2 geisha scenes involving the fictional prince Genji and lastly the cheapest, and perhaps my favourite, a patina-layered triptych showcasing the rescue of Ben-no Naishi…\n\nAnd then I ran out of wall space.\n\nI’ve recently acquired two more pieces both depicting Fuji in snow (I have only one piece of Fuji, also snow), and both of these are gifts - and quite naturally I returned to my favourite framer to prepare them for gifting!\n\nWhen I first visited Talent Arts back in 2021I wasn’t quite sure what to expect., as they didn’t have any woodblock prints framed at the time, and triptych’s need space to “live and move”, whilst the smaller pieces need space to “breathe and focus”.\n\nWhat I have come to know from the team is they are meticulous, dedicated and deliver top-notch high quality workmanship in all their frames. They have a really solid understanding on art and how the frame can make or break that work, and they also build that necessary space for the art to come alive. They are fun and friendly to talk to also, and can help guide you in your framing decision-making.\n\nI haven’t let any other framer anywhere near my pieces, since the first one completed back in 2021. It’s my impression that they are the best framer of artworks in Singapore. Whether you have Japanese woodblock prints like me, or your own personal photography, paintings or pop-culture posters I would recommend the Talent Arts team to cover all your framing needs.\n\nThanks guys for giving the art the love it deserves. Now everyone who visits gets to enjoy the pieces!",
      "time": 1725812834,
      "translated": false
    },
    {
      "author_name": "Jeremy Chow",
      "author_url": "https://www.google.com/maps/contrib/104463804113978762007/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVRCQH7AiaZemAg3ZhjaLCY36JUg5OWTt_4X7jo84XzPP2mWCUASw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Very professional service and work . I enjoy the advice from the boss and his team. Highly recommend for jersey framing",
      "time": 1742297399,
      "translated": false
    },
    {
      "author_name": "Firdaus Farid",
      "author_url": "https://www.google.com/maps/contrib/100560458679042123315/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVriWbkkCBMOT3YZLVyciloso0e6YtaWeS5YDpQjGSks9SHk2zh=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Had a fantastic purchase experience from moment I enter the gallery to when I hang up the artwork. Choosing frames, border and background were less intimidating and you know these guys are masters at their trade.\n\nI was properly advised on the material they’ll use since this will be placed in my toilet.\n\nThank you so much for delivering such a beautiful piece. I’ll recommend you guys and I’ll be back!",
      "time": 1697865066,
      "translated": false
    },
    {
      "author_name": "Xin Hao",
      "author_url": "https://www.google.com/maps/contrib/101038177603319548234/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU6c44XsILjRE2Islw02Z6jqIpGV_4urvZ0lGOy57c-ErkANHqe=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Framed my beloved autographed football jersey with Magnum and team at Talent Arts. Decided to go with them right from the beginning within the first visit due to the professionalism and knowledge. The family business has been around since the 50s, with all years of skill and exquisite craftsmanship passed down over the years. Magnum takes time to run through the pros and cons of certain framing choices in detail, ensuring full transparency. Pricing is also reasonable given the level of quality and service. The cost breakdown is also fully transparent - choice of frame, design, additional add-ons etc.\n\nMany other framing shops could have offered a much lower price for jersey framing but do take note of how they execute it. Most of them use staples and tapes which will damage your jersey. At Talent Arts, they use nickel free pins and mount the jersey on acid free foam core to protect the jersey.\n\nWendy was also extremely helpful throughout the process and explaining tips to care for my frame. Thank you team! Will be back with my other jerseys for sure :)",
      "time": 1659794436,
      "translated": false
    },
    {
      "author_name": "Imran Khan",
      "author_url": "https://www.google.com/maps/contrib/115063994977723380724/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJSdU_UdxzGne42IMBcBVJ8J0JG4Wb0eKa8TtQYVGt9gP8nfw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Thank you so much for the amazing work on my jersey Magnum and team. Love it and looking forward to bringing more jerseys to Frame your way.",
      "time": 1745727696,
      "translated": false
    }
  ],
  "types": [
    "art_gallery",
    "store",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8786356600560525798",
  "user_ratings_total": 122,
  "vicinity": "1 Tanjong Pagar Plaza, #01-19"
}