{
  "formatted_address": "212 Hougang St 21, #01-349, Singapore 530212",
  "geometry": {
    "location": {
      "lat": 1.359941,
      "lng": 103.8883009
    },
    "viewport": {
      "northeast": {
        "lat": 1.361021980291502,
        "lng": 103.8896986802915
      },
      "southwest": {
        "lat": 1.358324019708498,
        "lng": 103.8870007197085
      }
    }
  },
  "name": "TAM CHIAK Kopitiam (Kovan)",
  "place_id": "ChIJQ8mqsBsX2jERMySZ1cNxE2c",
  "rating": 3.4,
  "reviews": [
    {
      "author_name": "Ruth S.",
      "author_url": "https://www.google.com/maps/contrib/106574761937631836642/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ2lNeD-QCqUm6ftTlkA2gmOZxSSLZ4OQLu30Dz-QY72w3Zag=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "Was visiting a bookshop nearby and saw this coffee shop! The environment is so chic and clean! Love the variety of food selections and in the end decided to eat sth that usually can't be found in other hawker. The scrambled egg is well seasoned and cooked to a good runny-yet-not-raw state. The chicken cutlet is well marinated and super tasty. The prawns are fresh and had a good bouncy texture. Will come back again!",
      "time": 1719050030,
      "translated": false
    },
    {
      "author_name": "Eve C",
      "author_url": "https://www.google.com/maps/contrib/109756518746414930822/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUQU3wOFRLMgNb3VcKY8wCYgWAjbktK7DbOQ0RgmSSo7MlZ8AJrJQ=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "8 months ago",
      "text": "Raved place when it opened. I only visited now to avoid crowd but surprisingly on a Sat lunch time there is no crowd and place is not crowded.\n\nCurated stores. Not a lot but good variety. The kolo mee tasted good, the Bakery shop sells good quality bakes, the Dan Lao is good too. Chicken rice so so. The bak chor mee is nice but a bit ex for $6 esp when portion is so small. To be fair quality of the bak chor mee is good though and comes with a perfectly cooked onsen egg. the rest we didn't try.",
      "time": 1726361081,
      "translated": false
    },
    {
      "author_name": "Retronala",
      "author_url": "https://www.google.com/maps/contrib/112518296548968952078/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJoyuVnMI78ICkRpbzMqUtCZRsqlqIZ-YjcUk5ZXr9zuxFiW6mW=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "Tried the laksa Yong Tau Foo in the night. Laksa was nice!!! Great flavour !!!\n\nGreat price too! $6 min order and it's enough for one big guy! 😄\nClean environment.\n\nAt night, left nasi lemak and yong tau foo.",
      "time": 1731515845,
      "translated": false
    },
    {
      "author_name": "Jessica Tan",
      "author_url": "https://www.google.com/maps/contrib/115490864146392448368/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWQRUxBkR96Id4nZgTrPMdK5Ob_62o3AicmCXKSIS6i5-sHiPcC=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 2,
      "relative_time_description": "a year ago",
      "text": "This is all hype and hence disappointment is great.\n\nRoast chicken - this is really subpar compared to the above average ones in Singapore - it’s dry and  the rice to be is key to the experience is more salty then flavorful.\n\nTaliwang Nasi Lemak - for a Michelin graded outfit - it’s bad - sorry Crave is better! The fried wing was dry with a thick batter and a tumeric aftertaste that was done at best half hearted - they need to reconsider their expansion - stick to one outlet and do it well instead of  having a couple uninterested ladies to prep and serve Michelin awarded Nasi lemak just don’t cut it - as each ingredients need to be freshly fried as you cannot let the fried accompaniments sitting around for a long time. The begedel was really not nice as the potato was not well seasoned and it felt greasy.  The fried egg looked like those that were fried in huge batches - I seriously don’t expect this low standard from a Michelin starred outfit.\n\nChef de Pasta - who puts green onions in aglio Alio! It’s a weird pairing - stick to basic and so it well instead of trying too hard and ends up lending to Italian fried noodles a weird green onion taste.  The French fries were the best items we had for dinner tonight.\n\nDanlao-  cannot be more disappointed- the eggs were not as silky as some other less hyped joints I have tried - and the rice wasn’t seasoned or at least drizzle some sauce as just egg on plain cooked rice - actually washed out whatever taste the eggs had.",
      "time": 1710508038,
      "translated": false
    },
    {
      "author_name": "tuckmeng us",
      "author_url": "https://www.google.com/maps/contrib/106145644399813759272/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKzCbqa363yEsz6tb3XPeNQku-V6w1RCtouEcyuIrZy1PbYPw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Update on 27 Apr: the Kolo Mee stall is gone and so is the chicken rice stall. Goes to show how tough is the business of F&B. Unless the kopitiam bosses brings in more good stalls, this may be the beginning of a decline in footfall...\nI'm hoping that a good Thai/jap/Korean stall appears soon.\n---------\n\nThis place is one of my daily drivers. All stalls are competent. I like to mix and match between the stalls; chicken rice with hakka pork is a great combination for a carnivorous meal. If the chicken rice stall provides ginger for the white chicken rice and not just the roast chicken rice it would be perfect. No longer contented to just try from one stall at one setting.",
      "time": 1745761080,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "store",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7427405296380224563",
  "user_ratings_total": 511,
  "vicinity": "212 Hougang Street 21, #01-349"
}