{
  "formatted_address": "Yung An Rd, Singapore",
  "geometry": {
    "location": {
      "lat": 1.3362677,
      "lng": 103.7190964
    },
    "viewport": {
      "northeast": {
        "lat": 1.337634730291502,
        "lng": 103.7206483802915
      },
      "southwest": {
        "lat": 1.334936769708498,
        "lng": 103.7179504197085
      }
    }
  },
  "name": "Taman Jurong Oasis",
  "place_id": "ChIJ-T14KQAP2jERl5n56ZPEgI0",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Sri Janakiraman",
      "author_url": "https://www.google.com/maps/contrib/113162979134168222186/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVX5GGeKy0QPuOLVBW0iDWBcDoyrIY3d-l2a_4BbG4D8FzsEsNQ4Q=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Taman Jurong Oasis is a wonderful new addition to the Taman Jurong neighborhood, located conveniently close to Taman Jurong Greens Park and Taman Jurong Shopping Center. This beautifully landscaped park offers a peaceful retreat where visitors can relax, exercise, or simply enjoy nature.\n\nThe park features well-paved walking trails that are perfect for leisurely strolls or brisk morning jogs. The lush greenery and thoughtfully placed benches along the paths provide plenty of spots to sit back and soak in the tranquil surroundings. For families, Taman Jurong Oasis includes a spacious playground equipped with swings, slides, and climbing structures that kids will love.\n\nOne of the standout features of the park is its central pond, which attracts various birds, adding to the natural charm of the space. There’s also a picnic area that is ideal for gatherings with friends and family. With its clean facilities and scenic views, the park offers a refreshing escape from the urban environment.\n\nBeing so close to Taman Jurong Shopping Center, visitors can easily grab a bite or do some shopping after their park visit. Overall, Taman Jurong Oasis is a fantastic spot for relaxation and recreation, making it a must-visit for anyone in the area.",
      "time": 1728924642,
      "translated": false
    }
  ],
  "types": [
    "park",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10196365695931488663",
  "user_ratings_total": 1,
  "vicinity": "Yung An Road"
}