{
  "formatted_address": "1000 ECP, #01-02 Marine Cove, Singapore 449876",
  "geometry": {
    "location": {
      "lat": 1.3012805,
      "lng": 103.9129102
    },
    "viewport": {
      "northeast": {
        "lat": 1.302515780291502,
        "lng": 103.9141777802915
      },
      "southwest": {
        "lat": 1.299817819708498,
        "lng": 103.9114798197085
      }
    }
  },
  "name": "Tash Tish Tosh",
  "place_id": "ChIJLQA5McEZ2jERfGpn1qDrZtI",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Syed FadIzil Syed Ibrahim",
      "author_url": "https://www.google.com/maps/contrib/114605761429027457736/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKw9yGzpw6PIr3S19tjPbbfwlhmqvL5Q9cSIdIefVbkcr0Cbw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "There are lots of different varieties of food and drinks to choose from and free ice creams provided. (Can take as much as you want! Nice ambience, you can dine inside or outdoors. Nice surroundings and the beach just a short walking distance away. Overall, good food. There is also prayer room for customers. Recommended!",
      "time": 1739196425,
      "translated": false
    },
    {
      "author_name": "quarrie quarrie",
      "author_url": "https://www.google.com/maps/contrib/106797244035859143156/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWPtsb6Nb0lc7bgkpEHqesor63IDOOMAiu9e_9etovB4P8jJlDz=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Great food, great location and very friendly staff. Excellent menu, highly recommend the mutton ribs and briyani rice.\nWe had a small birthday celebration with 25 friends and family members. We booked two long tables and pre ordered the food from the menu the previous day. When our guests arrived the food was served with out delay and we just ordered drinks. The service was smooth, food was fresh and all of it gave a wholesome experience. Highly recommend the restaurant.",
      "time": 1744528447,
      "translated": false
    },
    {
      "author_name": "Lady Nur",
      "author_url": "https://www.google.com/maps/contrib/101926150252317929080/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK3fXfwDebyW7CAYCUCwchd8wYqyGOMNy2qBce09woF50ZiFw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "We had a fantabulous service (as always) at this outlet. Hence decided to have a surprise bday dinner over here. They accommodated to outdoor dining, which was initially set to indoor to give us more comfort.\nWith kids , it’s better to have it outdoors - for easy access to the outdoor ECP playground.\nThe mini library was great as well, kids enjoyed a breather from outdoor play here! Do take note, it converts to prayer place during prayer times.\n\nThe free icecream for every customer is a nice tough, the cookies and cream is sedap!\n\nClean toilets (albeit a bit dark).\n\nThe food is to the point, pizza was also good!",
      "time": 1741085864,
      "translated": false
    },
    {
      "author_name": "Ritz Bitz",
      "author_url": "https://www.google.com/maps/contrib/110358387947738376597/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWr6UENZg0cxGhN1U87AuSbn2HENPBqLKGdifAqUP79pqcCUbQE=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "3 months ago",
      "text": "Located in the busy Marine Cove, this outlet has always done well in terms of customer traffic. I found the food to be decently yummy although every single dish was too salty. The stand out dish was the mini tulang. Service was poor. While I understand this is not a five star hotel, the staff AND management shd understand that with tulang there will be a need for additional serviettes or replacement of serving plates. The cashier at the counter informed me yes I could pay with Grab. But after I reloaded my Grab wallet with a couple of hundred to pay the bill it turned out Grab could not be used. NOT a major complaint but it shows the staff are not well trained. The  decor is also quite horrid with the terrible things hanging down from the ceiling making the place look dark and cramped. This adding to the musky air permeating the whole place makes for a very dingy atmosphere. I recommend dabao instead of eating in - your dining experience will be far superior at home.",
      "time": 1738491571,
      "translated": false
    },
    {
      "author_name": "mohd muzzy",
      "author_url": "https://www.google.com/maps/contrib/104650637331448668253/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWaXrwLc_YTvPH6vDEm_Amim5a720FrRZKyemk-TeMwDwfgfJ7X=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "a week ago",
      "text": "I have a strong Fnb background and have a very deep understanding of operations.\n\nNo doubt it is a extremely difficult job to run successful service every single time.\n\nThe problems in this place start fron the top.\nThe owners.\n\nNot the staff.\nStaff are ok.\nThey are trying their best to do well within the rubbish tools the owners have armed them with.\n\nTraining\nSystem\nCoordination.\nSynergy between kitchen and Front of house.\n\nIf the owners wish to turn this into just a money making enterprise, they do it at the backs of the hardworking staff and the money from their customers.\n\nI dont see any firm commitment from owners in this particular outlet.\n\nIf u wanna upscale...\nU make sure\nUr staff, ur training. Ur systems, ur kitchen FO synergy is tiptop.\n\nThe food is very good\nBut\nThis are the key areas the owners can improve on.\n\nI am very impressed by the staff trying their best to do their best.\nI give the staff stars.\nEspecially the main guy, he is pulling the strings in a crazy service now.\nBlack tshirt indian guy with cap.\nAlso the middle aged malay abang, skinny and slightly short.\nHe is soooo good.\nSo sincere, so hardworking.\nI wld rate him highly and offer him and the indian guy a position if i had the pleasure of running an FnB operations.\n\nI will give T3 a chance always because their food is very good.\n\nBut owners.\n\nPlease.\nOwners.... Please help ur staff.\nDont burden them with a crazy big menu.\nIf gordon ramsay was here, he wld shut down operations for that service\n\nI understand operating an FnB operation in any country is not easy especially here in singapore.\n\nYour challenge is to formulate solutions to maximise efficiency and smooth running of operations.",
      "time": 1746885559,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15161064271613749884",
  "user_ratings_total": 424,
  "vicinity": "1000 East Coast Parkway, #01-02 Marine Cove"
}