{
  "formatted_address": "1 Cuscaden Rd, Lobby Level, Singapore 249715",
  "geometry": {
    "location": {
      "lat": 1.3046549,
      "lng": 103.8249313
    },
    "viewport": {
      "northeast": {
        "lat": 1.305888180291502,
        "lng": 103.8263491302915
      },
      "southwest": {
        "lat": 1.303190219708498,
        "lng": 103.8236511697085
      }
    }
  },
  "name": "Tea Lounge",
  "place_id": "ChIJWSKZsIsZ2jER2D36xTngNME",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Kelley Lim",
      "author_url": "https://www.google.com/maps/contrib/106772937498732776624/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUBZQZvED2gqa_qdPif1BTFt7F0giQkM1YR53ecWhn8A5DtIicz=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "We brought the children for a high tea buffet at the Tea Lounge, and it was an overall enjoyable experience. The pastries and cakes offered a nice balance of sweet and savory options. We also loved the unexpected treats like kuay pie ti, macaroons, and banana chocolate cake. A particularly thoughtful touch was the complimentary birthday cake for our celebration – such a sweet gesture!\n\nWhile we thoroughly enjoyed the dining experience, there were a few areas that could be improved. It took around 20-25 minutes for the pastries to be prepared. We understand there were other patrons, but considering we were one of the earlier groups to arrive and place our orders, we felt the waiting time could be reduced, especially since most pastries were already prepared beforehand.\n\nAdditionally, the tea selection was great, but the time taken to order and receive the tea was quite long. The restaurant was only half occupied at the time, so we believe there may be opportunities to streamline service to ensure guests' needs are more promptly met.\n\nWe also noticed that the hot chocolate for kids is not refillable. It would be wonderful if the restaurant could offer more refillable, kid-friendly drink options to enhance the experience for families.\n\nOverall, the experience was memorable for the kids, and we hope to see a more diversified and kid-friendly pastry selection on future visits. We believe these small improvements would elevate the dining experience even further.",
      "time": 1742647768,
      "translated": false
    },
    {
      "author_name": "Tan Yian Hau",
      "author_url": "https://www.google.com/maps/contrib/113575983265648319418/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL-h3XxAXrr-VgA9fb9rFAz6RrzXZwPfp6PO1VuHRIupgEz7w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "A fine splendid time at Tea Lounge.  Unique, well selected adequate spread of food accompanied by a standard of quality.  Varied selection of tea and beverages truly brought out the essence of \"High Tea\".\n\nA nice surprise with a little cake for a birthday occasion, but the cherry on top and and delightful experience owes to the friendly and attentive service of joyful Tammy.",
      "time": 1744460796,
      "translated": false
    },
    {
      "author_name": "Madeleine Tan",
      "author_url": "https://www.google.com/maps/contrib/114071385496499747851/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUAgR287noiTpgpd1wGwOWahc5F8SvvM-ffSJGEqVmJgbTgO0oq=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "The service was great, attentive and friendly which made for a lovely experience. As for the food, it was visually pleasing, but the taste didn’t quite make it. While the spread wasn’t extensive, it still has some variety of offerings, but some of the breads were on the drier side which we wouldn’t go for a second round. The Asian-inspired dishes and desserts were decent though nothing really wowed us. However, the standout was the Char Siew, served right at our table. It was better than what you’d find at most Chinese restaurants. We also really appreciated the tea selection, with a diverse range of flavors that kept things interesting.",
      "time": 1742193854,
      "translated": false
    },
    {
      "author_name": "Florence Leow",
      "author_url": "https://www.google.com/maps/contrib/102656561598060120185/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWWAO5NDzda0lWfeRJhWD1zQtDlUm5XL-zVuqnQGNv9Rilxc3M7=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "🟦Came here a few years ago to have high tea at the Tea Lounge ( when it was still Regent Hotel). A good friend had treated me to high tea.\n\n🟨The food was superb and service was attentive, polite and friendly. 🔵Even though the high tea price is astronomical, but the sheer wide range of savoury and sweet treats is worth every dollar you pay..\n\n💮🌸I highly recommend this if you want a solid quality high tea session.",
      "time": 1732232704,
      "translated": false
    },
    {
      "author_name": "Kristen Chen",
      "author_url": "https://www.google.com/maps/contrib/102024033867851188465/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXkPQdnNFVD8tptLHbUTpY5iwTG-uLcqPPfUOje7g2xIJmE2-Qy=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "The chocolate banana cake was phenomenal. This glittery tea made with 3 types of black tea, infused with pomegranate and edible gold dust was aromatic and delicious as it was beautiful. All in all a lovely high tea experience.",
      "time": 1742883644,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13921998886848314840",
  "user_ratings_total": 250,
  "vicinity": "1 Cuscaden Road, Lobby Level"
}