{
  "formatted_address": "No. 56/58 Lor 25A Geylang, Singapore 388248",
  "geometry": {
    "location": {
      "lat": 1.3154189,
      "lng": 103.883278
    },
    "viewport": {
      "northeast": {
        "lat": 1.316783280291502,
        "lng": 103.8845413802915
      },
      "southwest": {
        "lat": 1.314085319708498,
        "lng": 103.8818434197085
      }
    }
  },
  "name": "Teik Kee 德記 (Lor 25A Geylang)",
  "place_id": "ChIJ1cyPGjsY2jERKNOKTs0PG08",
  "rating": 3.4,
  "reviews": [
    {
      "author_name": "Dharmananda Lukito",
      "author_url": "https://www.google.com/maps/contrib/113075109519575171175/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXAY7r4ODYvEuSDh54z4z0krp2_QJjsD7si8cgQM3QtGteq0a4b=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "The food is good, portion is quite big and the taste is never dissapoint me.\nThis is not my first time eat here, so many times instead as my wife always at Amithaba Budhist Centre at nearby Lorong 25A,\nThe food quantity sometimes varies between who do the food and is it at peak hour or not. But overall i gave this 5 star because the steady quality and food portions.",
      "time": 1723728779,
      "translated": false
    },
    {
      "author_name": "Xiao Yu",
      "author_url": "https://www.google.com/maps/contrib/107010386444596482390/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ3aEZP2Vu76chenXmhJT7SYzeJpfQLn8T_2q7EhH3WzKKU187I=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "After so many complain about the bigger size staff usually in black top, wondering did the boss take customer feedback into consideration? He was too aggressive and rude. Talk to him nicely, he shout and you and seems he couldnt have patience to listen to orders. If u r not happy working, why don’t you just pack your bags and quit. Food is nice but for such attitude, not worth to come back a second time",
      "time": 1745763141,
      "translated": false
    },
    {
      "author_name": "George W (Oreo the Cat)",
      "author_url": "https://www.google.com/maps/contrib/113159097227833060752/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWDnk0FMtnxL8-GszGNHY0ZM8Xk5j3S7QDJH2Z2m8WUH-MZrU2R=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "LATEST UPDATE: Came back to eat here again after my bad experience n this time I’m very satisfied. Excellent as before — I had roast duck with roast pork n char siew with rice, $8 only; everything delicious n good portion. My faith is restored.👍👍👍👍👍\n\nUPDATE: Two months ago I raved about Teik Kee’s roast pork, duck meat n char siew (see below review). Unfortunately I had the worst experience recently with the same dish. The char siew was so chewy that it had to be swallowed whole even after much chewing. The duck meat was dry, hard n tough. They were inedible. I took a few bites n gave up. For the meat to be so tough n so chewy, something must be badly wrong. This stall shouldn’t spoil its reputation by serving such bad meat. Better to discard the meat than sell them to save cost.\n\nThe chubby guy should also not be so grouchy when customers asked questions from the front of the stall instead of from the side; new customers wouldn’t know the side is where they should make their orders or enquiries. It doesn’t hurt to reply to customers who talk to you from the front n then tell them to order from the side. We know it’s a tough line to be in and we don’t even expect common courtesy; but we certainly don’t want to have to put up with a grouchy glare.\n\nThe above is feedback for Teik Kee. I have not changed my earlier 5 stars rating.\n\n* * * * *\n\nAll thumbs up for Teik Kee at Food Loft, Lor 35A Geylang. I’ve been coming here for my roast pork, duck and char siew rice ever since I stopped here for dinner a month ago. For someone very particular about the taste of this dish, I can say it’s among the few I love. The meat portion is more than generous, the taste is among the best I’ve had, the price at $7.50 for the 3-meat combination I had is great value for money. Highly recommended. Trust me.👍👍👍👍👍",
      "time": 1687443473,
      "translated": false
    },
    {
      "author_name": "Jay Chong Yen Jye (iamJayChong)",
      "author_url": "https://www.google.com/maps/contrib/110879689491163143205/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXbvhoOVCA5D10IPsSTgALVMJi_93dybwKhCob8kQ2w4GRYd28Ghw=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Affordable, tasty, fast. Just good enough for your simple needs. Duck rice is good. \"cha xiu\" is quite good too.\n\nOnly thing is car parking is tricky at night.\n\nPeople are friendly and seats are sufficient so far.",
      "time": 1648909268,
      "translated": false
    },
    {
      "author_name": "Rob X",
      "author_url": "https://www.google.com/maps/contrib/110346031595934583076/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocILhzjiJpeeur-gEnQi7qum2pF6UsxW5WTvG0uzPlMymdECbg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "For me,the food (amount,price and taste) is great. Service wise can tell the staff is very tired and maybe not used to customer service necessarily. Most important the food is good. I recommend the combo rice with the 3 meats( pork, roast chicken and char siew).",
      "time": 1734011801,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "restaurant",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5700167127827927848",
  "user_ratings_total": 89,
  "vicinity": "No. 56/58 Lorong 25A Geylang"
}