{
  "formatted_address": "737 Pasir Ris Drive 10, Singapore 510737",
  "geometry": {
    "location": {
      "lat": 1.3796521,
      "lng": 103.936945
    },
    "viewport": {
      "northeast": {
        "lat": 1.380979730291502,
        "lng": 103.9383405302915
      },
      "southwest": {
        "lat": 1.378281769708498,
        "lng": 103.9356425697085
      }
    }
  },
  "name": "That Chef Couple Private Dining",
  "place_id": "ChIJO4HCIcQ92jERY8I6x4dgOos",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Adrian Koh",
      "author_url": "https://www.google.com/maps/contrib/112406855299738923618/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXnIXUFgMI-GQ9B8HytCRTeMyi1XMJ_Kvrrg3yFMEJKT2OPC6jtFA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I'd like to extend my warmest appreciation to the incredibly talented Chef Lynette and Chef Jedidiah! Their professionalism and expertise in their craft are truly impressive.\n\nI must say, executing Korean-inspired cuisine in a fine dining setting is no easy feat, but they've managed to pull it off with flair. Their dedication and passion for their work are evident in every dish they create.\n\nGreat job, Lynette and Jedidiah! Keep up the fantastic work!",
      "time": 1740896697,
      "translated": false
    },
    {
      "author_name": "Xin",
      "author_url": "https://www.google.com/maps/contrib/108901915052431124843/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVyENMQZwWskWWekUrvVm0J1h9q1LBHvDg0hWOagbvm9E_5hnpwCQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "We had the 3 course dinner for my partner's birthday at That Chefs Couple on Saturday and everything was scrumptious. My partner and I are pretty picky eaters and I did not expect to enjoy some of the flavours (celery soup, Pea & dill puree) as much as I did, but every dish's flavour went so well together and harmoniously I put aside my bias against those ingredients.\n\nThe halibut/scallop dish was fantastic and both seafood was super well cooked and paired with the miso infused butter was a match made in heaven\n\nHighly recommend if you're looking for a private dining experience! Chef Jedidiah was very friendly as well and the service was really good",
      "time": 1738028875,
      "translated": false
    },
    {
      "author_name": "M S",
      "author_url": "https://www.google.com/maps/contrib/114134774994389420234/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL3V5Fxechv3dSfgDD1GZ3qCVoNgA7dTl2Euhnlo5p02miEezc=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We had the absolute pleasure of having Chef Jedidiah and his wife, Chef Lynette, cook for my husband's 30th birthday, and it was an unforgettable experience! From start to finish, their attention to detail and culinary expertise blew us away. I was initially concerned about how the food will turn out since it’s Omakase style and we didn’t know the menu beforehand. We were delightfully surprised as the menu was perfectly curated, starting with a rich, flavorful tomato bacon bisque, followed by a vibrant burrata with pesto. The squid ink aglio olio with gambas prawns was a beautifully executed dish that left us all wanting more.\n\nBut the true standout was the pan-seared ribeye with cognac miso cream. My husband is a big fan of steak, and this dish was an absolute showstopper. The flavors were perfectly balanced, and it was cooked to perfection—my husband was beyond thrilled. Chef Jedidiah truly captured all the flavors my husband loves and brought them to life in the most spectacular way. I also love how we managed to interact with them during the entire experience and learned a lot of culinary tips too!\n\nThe entire dinner was nothing short of magical. Both Jedidiah and Lynette were professional, personable, and made us feel so comfortable in our own home. I cannot recommend them highly enough and this is worth every penny in my opinion. If you're looking for a truly private and personalized dining experience, you won’t regret booking Chef Jedidiah and Chef Lynette. They truly made my husband's birthday a day to remember!!",
      "time": 1742974805,
      "translated": false
    },
    {
      "author_name": "Neo Robyn",
      "author_url": "https://www.google.com/maps/contrib/103380490559573435700/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJXI7rYpUAg5DowpaETLLtSS2SNhF8Hol2Y8CD78jo9TIg3hQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Enjoyed the interesting curation of the various dishes - it was fun for our taste buds and definitely a wonderful experience to remember by. Thank you to That Chef Couple for the warm service and very thoughtful meal. Definitely trying their food again for new surprises!! 😋",
      "time": 1745114543,
      "translated": false
    },
    {
      "author_name": "Elijah Wong",
      "author_url": "https://www.google.com/maps/contrib/101311376414661967943/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLzHlJyRPTbDuPXKnmrIjcuB5tiLtdQAFzbhS7O6fTm9CG6hA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "We spent a beautiful Valentine’s Dinner at their house, which was so cosy and it gave us the quiet space to share! (We requested for a quiet dinner evening, which Jedidiah and Lynnette respected and created such a quiet space for us!)\n\nThe food was spectacular, and every dish was crafted with care and intentionality, and they also explained to us each dish as they served the dish to us.\n\nThank you so much for hosting us and giving us a beautiful evening!",
      "time": 1739674327,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10032437256200569443",
  "user_ratings_total": 41,
  "vicinity": "737 Pasir Ris Drive 10"
}