{
  "formatted_address": "297C Compassvale St, #01-01 Compassvale Green, Singapore 543297",
  "geometry": {
    "location": {
      "lat": 1.3946607,
      "lng": 103.9013746
    },
    "viewport": {
      "northeast": {
        "lat": 1.395911480291502,
        "lng": 103.9026587802915
      },
      "southwest": {
        "lat": 1.393213519708498,
        "lng": 103.8999608197085
      }
    }
  },
  "name": "That Coffee Place",
  "place_id": "ChIJ0fnLcg8W2jERROLuk2bLTZ8",
  "rating": 3.4,
  "reviews": [
    {
      "author_name": "oXRYSTALo Ong",
      "author_url": "https://www.google.com/maps/contrib/114556064085815871377/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSTtKcF9FYMbh-XNbDu8f7Whl3gi-ZY6T8pFPOm3v9Y98Ws7jL=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "That Coffee Place is a cozy little cafe tucked away in the heart of Compassvale. It's easy to miss if you're not looking for it, but once you find it, you'll be glad you did.\n\nThe cafe itself is small and intimate, with a warm and inviting atmosphere. The staff are friendly and welcoming. The menu is small but well-curated, with a focus on high-quality ingredients and classic coffee shop fare.\n\nI tried their Egg Sauce Hor Fun and Donkey went for the San Lou Hor Fun. While not the best we've had, the dishes were still tasty and satisfying. I suggested having dinner here as Donkey had never tried this place before, and I felt it was a good spot for us to eat and discuss our upcoming tour trip.\n\nOverall, I highly recommend That Coffee Place to anyone looking for a relaxed and comfortable setting. It's a perfect spot to catch up with friends, read a book, or simply enjoy a quiet moment to yourself.\n\nHere are some things I particularly liked:\n\n• The atmosphere: The cafe has a cozy and inviting atmosphere, perfect for relaxing and enjoying a good cup of coffee.\n\n• The staff: The staff are friendly and welcoming.\n\nIf you're looking for a great coffee shop in Compassvale, That Coffee Place is definitely worth checking out.\n\nRating:\n\n• Food: 3.5/5 (Tasty, but not the best we've had)\n\n• Service: 4/5 (Friendly and welcoming)\n\n• Atmosphere: 4.5/5 (Cozy and inviting)\n\nOverall: 4/5",
      "time": 1730999400,
      "translated": false
    },
    {
      "author_name": "Doraemon",
      "author_url": "https://www.google.com/maps/contrib/112665277904119154671/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX2VSCcaT9axvOwx2nD8XD3PgZ8V5VFnv420aocMSfLa6GlcEmN=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "Kitty and I were on the hunt for a cozy coffee shop in Compassvale, and we stumbled upon That Coffee Place. It's a bit hidden, but once you find it, it's a real gem.\n\nThe place is small and intimate, with a warm and welcoming atmosphere. It's exactly the kind of place you want to curl up in with a good book and a cup of coffee.  The staff are incredibly friendly and make you feel right at home.\n\nI went for the San Lou Hor Fun, and Kitty had the Egg Sauce Hor Fun.  While neither of us thought it was the best we've ever had, it was still tasty and satisfying.\n\nThe best part was the cozy atmosphere.  We were able to relax and chat about our upcoming tour trip without feeling rushed or pressured. It was a great spot to catch up and make plans.\n\nIf you're looking for a quiet, comfortable coffee shop in Compassvale, That Coffee Place is definitely worth a visit. It's perfect for catching up with friends, reading a book, or just enjoying a quiet moment to yourself.",
      "time": 1731171349,
      "translated": false
    },
    {
      "author_name": "Eric Chng",
      "author_url": "https://www.google.com/maps/contrib/100480067989326525096/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXb2_4eB8ZzltBnNDVwtu0lltMVAqeg_NnnkyxyofL3_qsfWoOJ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "Very affordable prices considering it's air conditioned. Nice respite from the heat outside. As a bonus they accept CDC vouchers too!\n\nFood is not too bad, had the hor fun which was average. Coffee is usually on point. Some of the staff tends to scold each other though, which can be quite unpleasant.",
      "time": 1716015898,
      "translated": false
    },
    {
      "author_name": "Aik Tuck Chua",
      "author_url": "https://www.google.com/maps/contrib/113022934938223680340/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLkbzFJS8aOq7r-338cdF-cEQCEZM5AG7mKqKgbftUS4Mb1CQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 2,
      "relative_time_description": "2 months ago",
      "text": "I dine here regularly because it is convenient and because I have low standards. My opinion is that most foods in Singapore are at least pretty alright, nothing too disappointing. The only exception is this place where sometimes I’m quite appalled at the lack of care and/or proficiency with food. Once I ordered chicken noodles everyday because I’m convinced the consistency is abysmal. True enough, the 3 days of chicken noodles all looked like they were from different stores. One had red sauce, one is almost like a soup, and one is super dry. I would still continue to patronise and support this place (and I do eat from here quite a fair bit), but this is one place I warn my friends and grab drivers to stay away.\n\n* new: squid has crumbs inside. Tastes very fishy. Had to go gargle my mouth midway",
      "time": 1742560380,
      "translated": false
    },
    {
      "author_name": "Joyce Tan",
      "author_url": "https://www.google.com/maps/contrib/114496602586700071685/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIrzpd_bOKg1f2M2S7ITZRmoEfclUBwFBeIhK8krZiGZnQ84A=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "So damn bloody salty. This is drenched , soaking in soya sauce. The plate also full of sauce. I feel my kidney is already failing from this. the cooks here have no quality control.\n\nSuggesting the restaurant to perhaps not offer so many variety of dishes to save costs on ingredients AND should just focus on a few star dishes that taste edible for a human being.\nRemove all those dishes that taste bad. Get feedback from customers.",
      "time": 1713949656,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "store",
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11479054666666271300",
  "user_ratings_total": 749,
  "vicinity": "297C Compassvale Street, #01-01 Compassvale Green"
}