{
  "formatted_address": "246 Upper Thomson Rd, #246 M 246, Singapore 574370",
  "geometry": {
    "location": {
      "lat": 1.3538519,
      "lng": 103.8342736
    },
    "viewport": {
      "northeast": {
        "lat": 1.355132830291502,
        "lng": 103.8355633802915
      },
      "southwest": {
        "lat": 1.352434869708498,
        "lng": 103.8328654197085
      }
    }
  },
  "name": "The Roti Prata House",
  "place_id": "ChIJP8IIvzoX2jERvnJIgFgZoCs",
  "rating": 3.8,
  "reviews": [
    {
      "author_name": "Benjamin Poh",
      "author_url": "https://www.google.com/maps/contrib/109524452974755304905/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU8ybc7VrF9h-bl4RP1jGTyU8wjEJXsVNi-1aS-rBeL0mhlqYN8=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "Prata was dry and crispy but lacks flavour and freshness. Honey Chicken briyani was edible but chicken seems not freshly cooked and its dry and hard to chew.\n\nStaff was very unhappy after given feedback and questioned why we complain with a fierce response.\n\nDont really understand the crowd. Perhaps this place sells well because they used to serve delicious food for a long time in the past.",
      "time": 1747109325,
      "translated": false
    },
    {
      "author_name": "Scarlett",
      "author_url": "https://www.google.com/maps/contrib/111549039692792548269/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJcoMGiJpEI_PVrDLOz0hDFxUaDwMEOJ4Ea4bobZbDNBKJXceoB=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "3 weeks ago",
      "text": "I revisited this place after a long time. Sadly, The crispy plain prata was not what I remembered. It is very doughy and thick now. Not nice anymore. The chicken long John was ok. On a good note, Teh tarik was good. The staffs very very prompt and quick in cleaning the table and serving food. Curry smells amazing",
      "time": 1745651491,
      "translated": false
    },
    {
      "author_name": "Xeo Lye",
      "author_url": "https://www.google.com/maps/contrib/104351304175099299369/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX-MCsxwtp4zJ8b1G-C3Eg4h-HtcQJcP69FeaJ2fI_J4puHU6oPcQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 3,
      "relative_time_description": "3 weeks ago",
      "text": "Tried the cheese pineapple prata at The Prata House. The portion is generous — that’s a plus — but the taste didn’t quite hit the mark. The pineapple was overpowering, drowning out any hint of cheese. They also sprinkle sugar on all their pratas, making them too sweet for my liking. The prata itself was too thick to get that nice crispy texture. As for the fish curry, it didn’t taste like the usual fish curry you’d find elsewhere — something felt off.",
      "time": 1745716325,
      "translated": false
    },
    {
      "author_name": "Maximillion L",
      "author_url": "https://www.google.com/maps/contrib/113602150716736834542/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJgDRjGLnCRRlFYSIoxpDG-f6x-A0fyJLFsTDzejMwPGAQjuQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "The roti was crispy and fluffy!?\n\nYou must have been hiding under the rock if you think the food here is good. We ordered three items, the crispy roti prata was nether crispy nor tasty, so chewy and doughy, the mee goreng was also a joke, bland with a slight taste of saltiness. The mutton soup was too salty. All three items look extremely unappetising, the bread looks so old even the pigeons won’t eat them!.We told the waiter teh tarik kurang kurang manis it still come out extremely sweet!\n\nI really regret taking a Grab here after our drinking night. The roti was so awful they should rename to The Chew & Spew Roti Prata House.",
      "time": 1743097025,
      "translated": false
    },
    {
      "author_name": "Stan Lee",
      "author_url": "https://www.google.com/maps/contrib/116229477112147925508/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU43vGEAC0qr_M2Onblh3UiKEOoYJYCI-MW8jI_7V54f2xnyNGt=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "The Roti Prata House is a popular dining spot known for its delicious and versatile roti prata, a traditional South Asian flatbread. Located in Singapore, this eatery has gained a reputation for serving a wide variety of prata dishes that cater to diverse tastes. From classic plain prata to innovative options like egg prata, cheese prata, and even sweet versions like banana or chocolate prata, the menu offers something for everyone.\n\nThe Roti Prata House is not just about the food; it’s an experience. The open kitchen allows diners to watch skilled chefs expertly flip and stretch the dough, creating the perfect crispy yet fluffy texture. The aroma of freshly cooked prata fills the air, enhancing the overall dining experience.\n\nApart from prata, the restaurant also serves other Indian and Malay dishes such as curry, mutton dishes, and teh tarik (pulled tea), making it a great place for a hearty meal. Affordable prices and generous portions make it a favorite among locals and tourists alike. Whether it’s a late-night snack or a full meal, The Roti Prata House is a must-visit for anyone craving authentic and flavorful South Asian cuisine.",
      "time": 1740026564,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3143540407804654270",
  "user_ratings_total": 3523,
  "vicinity": "246 Upper Thomson Road, #246 M 246, Singapore"
}