{
  "formatted_address": "Mt Alvernia Medical Centre D, 820 Thomson Rd, #07-61, Singapore 574623",
  "geometry": {
    "location": {
      "lat": 1.341934,
      "lng": 103.8378186
    },
    "viewport": {
      "northeast": {
        "lat": 1.343283530291502,
        "lng": 103.8391835802915
      },
      "southwest": {
        "lat": 1.340585569708498,
        "lng": 103.8364856197085
      }
    }
  },
  "name": "The Skin Specialists & Laser Clinic",
  "place_id": "ChIJnZIxx0YX2jERfVv0-SyF8NI",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Valeria Gonzalez Duarte",
      "author_url": "https://www.google.com/maps/contrib/109408749649319127933/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJf9TlvNcxEFSlTybRgs1UClR3SfahGDCMKz8vhvgdVJC7kCQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Dr Mark Tang is an excellent and caring professional. He is not stingy with his time and will take the time to explain things in detail. You can tell he’s passionate about his field and his patients. The prices are fair and there’s never any semblance of hard-selling (as it can happen sometimes in dermatology practices). He has taken my concerns seriously and with compassion, and I always feel heard and well cared for during my visits. Thank you for providing me with so much reassurance, Dr Tang!",
      "time": 1731292436,
      "translated": false
    },
    {
      "author_name": "Rachel Lim",
      "author_url": "https://www.google.com/maps/contrib/101767889771597111451/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJcH_DxvQUxrLqkhdjcE8gvGB0cSUo3G41T9hKFBcHyNlrAVw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Dr Mark tang is the savior of my skin countless of times. Everytime I ruin my skin with 'tiktok recommended' skincare 😔, I will always look for him to salvage it. Kind, reassuring and patient, he is what you are looking for in a dermatologist! Thank you Dr tang!",
      "time": 1743163665,
      "translated": false
    },
    {
      "author_name": "Kai X",
      "author_url": "https://www.google.com/maps/contrib/100144385587534695501/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV1Ipod3Yl8Tr5zLBEdk1-LwTsG6EvQZ6JPVOXDjgzrGGlJihY5qA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Dr Mark is a deeply compassionate and knowledgable dermatologist. His practice is patient-centric and even though his clinic is very busy, he takes the time to actually explain the mechanisms behind skin conditions and treatments, doing so in a way that is easy to understand.\n\nIt is one thing to be an expert in a discipline, but it is another thing to be able to explain complex conditions in a way that is easy for a layperson to grasp. If I had someone like Dr Mark as a teacher, I think I might have been inspired to go into science or medicine!\n\nDr Mark is also transparent when it comes to the medicines he prescribes, and when he wanted to prescribe a rather expensive cream for my eczema, he made sure to run it by me first, explaining its benefits and giving me a choice without pressuring me to take it. I really appreciated this as specialist visits can be quite expensive. (I ended up opting for the medicine, and I am glad that I did so because it was extremely effective in treating my eczema and the price tag was well worth it.)\n\nThe nurses at the Skin Specialists & Laser Clinic are so kind and compassionate too. I recently had a cyst removal surgery which was more painful than expected, but they were extremely patient, caring, and reassuring throughout the process.\n\nDuring my surgery Dr Colin also helped to administer my anaesthesia, and during this process he was also very reassuring when I expressed my fear and anxiety regarding the procedure.\n\nMy experience at the Skin Specialists & Laser Clinic and with their staff has been overwhelmingly positive. I will definitely go back for any future skin related concerns, and would recommend Dr Mark and Dr Colin to my loved ones.",
      "time": 1726064794,
      "translated": false
    },
    {
      "author_name": "Kayla Toh",
      "author_url": "https://www.google.com/maps/contrib/116498830735359001151/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJzmGdHoNJEp9YH59qhlDp-zRAjucukIwdPWSoDyrfZ8sfyow=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "Dr Mark is an experienced doctor who explained my son's skin condition thoroughly and personally guided us the steps for the treatment. Truly appreciated his care and patience towards my young son too.\n\nThe clinic nurses are also helpful and efficient; I was impressed at how quickly they dispensed the medications!\n\nOverall a great experience. Thank you Dr Tang and all staff.",
      "time": 1724249580,
      "translated": false
    },
    {
      "author_name": "Trip “TWyling” Advisor",
      "author_url": "https://www.google.com/maps/contrib/115509167924425067266/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUZfzDYehZhHFXDhkT4S1oOduTqaDLdseejZgg74NAoVe-06CY=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "6 months ago",
      "text": "Receptionist - hangs up on you to have her lunch. Even as I told her to enjoy her lunch and she made no effort to confirm my appointment with the Doctor. If you're 5mins late be prepared to have your appointment time taken over by emergency appointments without warning. This equated to a 45mins wait 50mins past your appointment time. They will not inform you of what's happening and said receptionist will keep repeating your mistake to you. I totally understand emergency appointments but my partner and I rescheduled work meetings to see a doctor here. We could have been informed even upon arrival but I guess reception was just too rude to do anything besides complain at me.",
      "time": 1729732775,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15199795170594020221",
  "user_ratings_total": 49,
  "vicinity": "Mt Alvernia Medical Centre D, 820 Thomson Road, #07-61"
}