{
  "formatted_address": "69 Joo Chiat Terrace, Singapore 427231",
  "geometry": {
    "location": {
      "lat": 1.3146307,
      "lng": 103.9009827
    },
    "viewport": {
      "northeast": {
        "lat": 1.315926930291502,
        "lng": 103.9023632802915
      },
      "southwest": {
        "lat": 1.313228969708498,
        "lng": 103.8996653197085
      }
    }
  },
  "name": "The Intan",
  "place_id": "ChIJ4UVXsxEY2jERZ3a6nVN3LqI",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "ADRIAN LOW",
      "author_url": "https://www.google.com/maps/contrib/106715709619784304382/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI2VtKl5e97czCSZnkun5TQQlf6h7J3SkvPs2cnFNBvhx1vfuA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "A Culinary and Cultural Masterpiece!\n\nDining at The Intan Peranakan isn’t just a meal, it’s an unforgettable journey into the heart of Peranakan heritage. Alvin, the passionate curator and host, welcomes guests into his extraordinary home museum, a treasure trove of over 40 years’ worth of meticulously preserved Peranakan artifacts. Every corner tells a story, and every dish served is a testament to tradition.\n\nWhat truly sets The Intan apart is Alvin himself. His warmth, knowledge, and storytelling turn the afternoon into an immersive cultural experience, making you feel like family in his home turned museum.\n\nIf you crave more than just a restaurant, or if you want to taste, see, and feel the soul of Peranakan culture then this is the place. A rare gem where heritage, hospitality, and heavenly food collide. Thank you, Alvin, for an unforgettable experience. I’ll be back and I’ll bring everyone I know!",
      "time": 1740209940,
      "translated": false
    },
    {
      "author_name": "John Zacharias",
      "author_url": "https://www.google.com/maps/contrib/100783705068006874991/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXjGWk80nyYQVFXEebbhHlc8GDOIa6pHj814Lo3lUQLBjUvP0ULVg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "My fiance chose this museum to visit based on reviews. To be honest my expectations were low. By the end of our visit I was thrilled to have been a guest in Alvin's home museum. We got very lucky and did a walk in. I recommend buying tickets online ahead of time as Alvin keeps a busy schedule. From start to finish I learned more about Singapore culture through Alvin than anywhere else. He is incredibly knowledgeable and happy to answer any questions. Oh and at the end he will serve you the best tea you will ever have.",
      "time": 1740136443,
      "translated": false
    },
    {
      "author_name": "Janet Ooi",
      "author_url": "https://www.google.com/maps/contrib/117769215204817941796/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVOfdaPuiM6UIe_G8LTEtP6PkVUnSnUdF2maPLUMvDPeI16IXw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "I visited The Intan yesterday and was absolutely blown away. From the outside, the house appears modest, but the moment you step in, you’re transported into a completely different world.\n\nThe owner, Alvin Yapp, is a phenomenal storyteller. Even as a Peranakan myself, I learned so much more about our culture just by listening to him share his knowledge and passion.\n\nHis vast collection of Peranakan fabrics, shoes, and artifacts is truly mind-blowing. Every corner of the home reflects love, history, and dedication to preserving the heritage.\n\nI highly recommend The Intan to anyone who wants to understand not just Singapore’s cultural tapestry, but the rich and intricate beauty of the Peranakan culture.",
      "time": 1746280925,
      "translated": false
    },
    {
      "author_name": "Karin Sinniger",
      "author_url": "https://www.google.com/maps/contrib/106170802873168889917/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXCJ253ep_eDzv0XbobEKttG3p--t4FiVLml2D1k07KuX3EdXzK=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "A uniquely personal tour of Peranakan history.\n\nWe did the afternoon tea experience after having visited the Peranakan Museum and found both experiences complemented each other well.\n\nEach item has a story. Some families even wanted Alvin to have photos of themselves and their loved ones because he would take care of them better than their families.\n\nThe tea and cakes were good too! A. Hour well spent.",
      "time": 1725233276,
      "translated": false
    },
    {
      "author_name": "Isabella Tan",
      "author_url": "https://www.google.com/maps/contrib/113398650842009150847/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLeB30oTqyTP4m2CQZHTrBK7QKF5hcljKff0ZdSQ-FLZSr6=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "As an educator stepping into the house so filled with heritage & culture, it is just so amazing! Hearing the stories of how it came about is totally mind-blowing. I enjoyed listening to Alvin’s story of how he decided to collect the different Peranakan artefacts; to remind him of his heritage. It started as his personal collection to now sharing it with a larger audience. Definitely worth the visit.",
      "time": 1688780340,
      "translated": false
    }
  ],
  "types": [
    "museum",
    "tourist_attraction",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11686409284085249639",
  "user_ratings_total": 389,
  "vicinity": "69 Joo Chiat Terrace"
}