{
  "formatted_address": "475 Pasir Ris Drive 6, Singapore 510475",
  "geometry": {
    "location": {
      "lat": 1.3751425,
      "lng": 103.9572993
    },
    "viewport": {
      "northeast": {
        "lat": 1.376437330291502,
        "lng": 103.9586076302915
      },
      "southwest": {
        "lat": 1.373739369708498,
        "lng": 103.9559096697085
      }
    }
  },
  "name": "The Happy Pianist: Start Piano Lessons In Singapore",
  "place_id": "ChIJHzA8rbM92jERQ-GsByhYFM8",
  "rating": 5,
  "reviews": [
    {
      "author_name": "EN",
      "author_url": "https://www.google.com/maps/contrib/106831042072697117440/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKJGRQMlfOCo5wbzZY2Q_A6o3hdKHfy_Tq5Pm-Vw8JIn0nD=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I am very thankful and blessed that I met and found Ms Doreen through The Happy Pianist in the year of 2023. Mark have been very nice, helpful and patience to answer my enquires and gave me advise and knowledge of learning music when I wanted to pick both piano and singing at the same time. Unlike other agents, he indeed have the knowledge of music and giving good advise to ensure parents get the right choice of teachers. My both girls have been with Ms Doreen since then and it’s 2 years now.\n\nMs Doreen a piano teacher who not only have a high qualification in music area, she is also a teacher who have a very high passion in music and teach deep from her heart with the care for her students. Her level of music knowledges and her level of patience to her students is one of the rare one that I have ever seen and impressed.\nHere’s what my children replied about what they likes about her teaching and lesson when I asked them. Both of my girls like and enjoys her lesson because she is very patience. when she needs her students to move aside and she play for them to see she will request them to sit another side politely unlike her previous teacher. They likes how she makes the lesson fun like while doing recording, get to dress up during festival. 😊\n\nI am glad that my elder girl pick up the interest in music again after several times of changing of piano teacher. And younger one improves her skills gradually. I see their progress improved and their knowledge of music expanded under Ms Doreen generous sharing with her students about different types of music instruments and music composers story.\n\nShe teaches base on the child learning abilities and uses different approach to help her students absorb instead of teaching just for teaching. Aside from that, instead of she keep teaching exam pieces and Working towards grades only, she will also teach my children other songs that they are interested to pick up. She also will give them opportunities for performance like Christmas and competitions to participate in order for them to have the opportunity to expose to  perform on stage to gain experience, boost confidence and shine on stage to share their love in music with their love one. This allows them to have motivation to achieve more. Just in short 2 years my girls have achieved a numbers of certifications, trophies and medals. These have helped them boost their confidence level. Especially my younger child looking forward to achieve more trophies and medals. 🙂\n\nI highly recommend Ms Doreen for who wanted to kick start their learning journey. Finding a good teacher/ mentor is a very important starting point in order to see your learning process and enjoying music learning.\n\nThank you Ms Doreen for bringing so much music joy to my both children.\n\nMabel’s and Mavis’s Mum",
      "time": 1743124894,
      "translated": false
    },
    {
      "author_name": "Janice Tung",
      "author_url": "https://www.google.com/maps/contrib/114332344365414171875/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKZuHam-ocB_wZKkYtVFfOrKfJ9TjUeLmvZzGZvvlqKantf4A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Very prompt service and good recommendations according to your needs. I am thankful for The Happy Pianist's recommendation. Teacher Violet is extremely good, and uses fantastic tools to capture my young daughter's attention. She is patient and has a way with kids. I love that she is very passionate about the instrument and teaching, and she is also very dedicated. My daughter has managed to pick up quickly on the piano with her. She enjoys lessons and is even happy to play it everyday.",
      "time": 1743073582,
      "translated": false
    },
    {
      "author_name": "Chow Sandie Mei Ling",
      "author_url": "https://www.google.com/maps/contrib/108569191239410553097/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIBQW2GqaV4eEOr9xxBIuSy_cQ3IkgSmTJS8HN40e0dm8LUhA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Sharing pics and videos to my students' Xmas recital 2024. A Big Thk u to this batch of students for practising hard and making  their very first recital a complete success!! Bravossimo 👍👏👏 of course, not forgetting dear parents who have been playing such a supportive role in their learning journey with me. Thank you❤️🤗",
      "time": 1736341829,
      "translated": false
    },
    {
      "author_name": "Rini Ong",
      "author_url": "https://www.google.com/maps/contrib/113409138975094650381/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSU_nifxuZEAhkNepqkQ9jCoBTtvaYZaqOit7IP_GDOlf70xkU=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "My 4 years old expressed interest in Violin and Piano, after a few trial lessons,  Piano was clearly the winner. I am so glad to have engaged in The Happy Pianist, who helped me to source for qualified Piano teachers around my area. I had the option of sending my kid to the Piano teacher's house or to have her teach at my place. Since we live nearby, it makes timing very convenient. I live in sengkang so most popular music schools would have taken us quite abit of commuting time.\n\nThe best part we gain from engaging in The Happy Pianist is that my kid really, really loves her Piano lesson and her teacher, Ms Soo! Really happy to see her progress in her interest ^^",
      "time": 1742004787,
      "translated": false
    },
    {
      "author_name": "hiveyhive",
      "author_url": "https://www.google.com/maps/contrib/107330486522302231548/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXq-oLPE4t5OdZ0-gZuGJ_9VSO96SE6rXUFjZVp--4fJdI7KBnt=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Ms. Violet Ang is a wonderful piano teacher—patient, kind, and encouraging. She makes learning enjoyable while helping Ellery progress steadily. Her dedication and love for music shine through in every lesson. Highly recommended!",
      "time": 1739874095,
      "translated": false
    }
  ],
  "types": [
    "moving_company",
    "point_of_interest",
    "school",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14921648394336002371",
  "user_ratings_total": 142,
  "vicinity": "475 Pasir Ris Drive 6"
}