{
  "formatted_address": "111 Jalan Kembangan, Singapore 419149",
  "geometry": {
    "location": {
      "lat": 1.3253615,
      "lng": 103.913179
    },
    "viewport": {
      "northeast": {
        "lat": 1.326763630291502,
        "lng": 103.9145350802915
      },
      "southwest": {
        "lat": 1.324065669708498,
        "lng": 103.9118371197085
      }
    }
  },
  "name": "THE STRAITS WALDORF SCHOOL PRIVATE LIMITED",
  "place_id": "ChIJ7XCKtFUZ2jERksDbFsUCBF8",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Dr.David Lim",
      "author_url": "https://www.google.com/maps/contrib/109817578618445550571/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUqiw864AOBolrJPgHih5_yCHhKOrxh6Y35Il2bOez2Oh_ODL4=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "We’re having a wonderful experience @ Straits Waldorf! It’s amazing to see how much our child has grown in such a nurturing, inspiring environment.\n\nThe teachers care deeply and are truly dedicated to each student’s growth. They take the time to build meaningful relationships with the kids, which creates a safe & positive space for learning.\n\nThe small class sizes are also a huge benefit. The community feel at the school is palpable, and it really feels like a family environment.\n\nAnother major highlight is the emphasis on outdoor activities and nature-based learning. Whether it’s exploring the school’s beautiful grounds or taking part in seasonal festivals and hands-on projects, the children are encouraged to connect with nature in meaningful ways.\n\nOverall, the holistic education @ Straits Waldorf is exceptional. The school provides not only a solid academic foundation but also focuses on emotional & social development in a supportive, balanced way. We are incredibly grateful for everything this school has provided for our child, and we look forward to many more years in this wonderful community.",
      "time": 1739420606,
      "translated": false
    },
    {
      "author_name": "Sharath M.V",
      "author_url": "https://www.google.com/maps/contrib/113125463511453665299/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLKJwKkoTQl_dJpN9QjegtHwjamsHkJoHPqxutiRYe9DesK=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "We are extremely lucky to have found the Straits Waldorf School!\n\nIn a fast moving world where technology and speed of information is central to every aspect of human life , the entire team in this Waldorf school puts our children at the heart of everything they do, allowing them the childhood they deserve. The school’s curriculum is based on the educational philosophy of Mr Rudolf Steiner, where children learn about the natural world through stories. The education is authentic and holistic, and here children’s childhood is protected to ensure they develop into strong, thoughtful and highly creative individuals.\n\nOur daughter, aged 7, has been going to the same school the last 3 years, loves her school and looks forward to all wonderful things they do everyday.\n\nShe enjoys her academic learning, painting, knitting, form drawing, drama, cooking, language, bike rides, music, community gardening, Eurythmy etc. to name a few. She is full of smiles when she brings back wonderful artefacts that is unique only to Waldorf schools.\n\nMs Viknes, the founder of the school, continues to do phenomenal work, even though tough choices have to be made, she and her fantastic team do their utmost best everyday to bring the best learning experience for the children.\n\nIf you are looking for an international school for your kids, where they will be allowed to be free individuals, while learning to become creative, empathetic and independent human beings, the Straits Waldorf School is the one for you.",
      "time": 1741664878,
      "translated": false
    },
    {
      "author_name": "Suchitra Menon",
      "author_url": "https://www.google.com/maps/contrib/105815087337547215723/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIXSZVh6EsyqS1bwXQ_AtxkYfn1o8TPysoAEhBGFWj4Ts_gmZP6=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "When we relocated from Bangalore to Singapore in 2023, finding a school that aligned with the core principles of our son’s previous school, where learning by observation and respect for the environment were central, was a priority. Straits Waldord made this transition seamless. Here the focus was on observation based learning and creativity, also ensuring a stress free atmosphere for children. Thank you to all the teachers and facilitators at Straits Waldorf for a great experience.",
      "time": 1733904991,
      "translated": false
    },
    {
      "author_name": "Carole Lin",
      "author_url": "https://www.google.com/maps/contrib/114316365450584599872/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIKMmwjbomvTTKnPUw9WTFrBXwQhlXC696Ab9z-AocmQbyGrw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "There’s this calm joyful energy the moment we enter the school.\nThis is our 4th year with Straits Waldorf.\nMy child loves going to school everyday and doesn’t want to miss a single day!\nThankful for the supportive and loving family from the school.",
      "time": 1739280923,
      "translated": false
    },
    {
      "author_name": "Katie Kingman",
      "author_url": "https://www.google.com/maps/contrib/108892841856369718734/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWM9crmzMXNWKLZ03uXDPHGr17R69RIEHLTRdXpb8EsfgmhyGwS=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "A biking distance from our house, it’s the only primary school in Singapore offering the Waldorf curriculum. Elements of thinking, feeling and doing are considered in every lesson to support the unfolding of the whole child. With loving guidance of a team of teachers, our sons have discovered a sympathetic interest in the world, self-confidence and an abiding moral purpose.\n\nStudents enjoy comprehensive language arts, maths, science, social studies, lessons in Mandarin, vocal and instrumental music, speech and drama, movement and sports, painting, drawing, modelling and handwork. Rockwell especially loves the bi-weekly bike rides to East Coast Park, singing, numeracy and learning cursive. Atlas’ favourites include watercolours, form drawing, capoeira and writing.\n\nBeing a parent at The Straits Waldorf School is a chance to find community among thoughtful, caring parents. Community life is filled with student performances, holiday celebrations, festivals and an adult education programme. For families still in search of an inspiring school, we highly recommend ours!",
      "time": 1731994691,
      "translated": false
    }
  ],
  "types": [
    "primary_school",
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6846600379025309842",
  "user_ratings_total": 9,
  "vicinity": "111 Jalan Kembangan"
}