{
  "formatted_address": "3 Gateway Dr, #04-25 Westgate, Singapore 608532",
  "geometry": {
    "location": {
      "lat": 1.3343779,
      "lng": 103.7425984
    },
    "viewport": {
      "northeast": {
        "lat": 1.335846830291502,
        "lng": 103.7439425802915
      },
      "southwest": {
        "lat": 1.333148869708498,
        "lng": 103.7412446197085
      }
    }
  },
  "name": "The Clinic Group @ Westgate",
  "place_id": "ChIJ24PmMAER2jERA1VGcF9YbBM",
  "rating": 3.5,
  "reviews": [
    {
      "author_name": "Tristan Lee",
      "author_url": "https://www.google.com/maps/contrib/104725236480064534694/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX2iw9hSddqk8DhNIFzUnAy7OoxK6oKdr9qognY75q6LVpDry3m=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "4 weeks ago",
      "text": "Booked on 1 Apr, for 21 Apr (i stand corrected), clinic just told us doctor on urgent leave on our date that we set aside.\n\nWasted our time, not coming back.\n\n(Update: after our annoyance they called and tell us at noon that doctor cancelling his urgent leave, but we already informed our office that we are going back to work)\n\nAnnoyance x 2\n\nThanks for yr reply, its not one sided now that u guys have replied.",
      "time": 1745225986,
      "translated": false
    },
    {
      "author_name": "Andy",
      "author_url": "https://www.google.com/maps/contrib/108373296007701463522/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKWYEyjMstEZ_QcbRbC3lNBGj6g6TacT6li2NNAyq8zE0L4Fw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Dr Woo at The Clinic @ Westgate is a great GP doctor who really cares about the patient. He is always patiently hearing, diagnosis and provides careful consultation on my every visit.\nHe is always providing professional advice in his patient Best interests.\nThere is one tine when i had a serious skin allergy issue and I went to a nearby GP doctor twice and even went to A&E. All of the doctors didn't solve the issue and suffered for a long time, until i went to see Dr Woo at The Clinic at Westgate. He careful examined my serious skin allergy issue and prescribed me a medication that after taking really stopped the terrible itch and solved my skin allergy problem.\nI truly feel that he is a great doctor and recommend Dr Woo to anyone who wants a doctor that really help patients .Thumbs up.",
      "time": 1731396818,
      "translated": false
    },
    {
      "author_name": "Tavence Kang",
      "author_url": "https://www.google.com/maps/contrib/106278397341545227729/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU1XzzzqOPzoOS4iMwtpvlOonfUw1UyPW-O8XH8E0Elm9y7ejhH=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Ridiculously expensive clinic! Common cold, standard meds, cold meds, cough meds, diflam... Most of the stuff we can get OTC, and it cost $120??\n\nDiflam - $17.92\nLyzozyme - $9.40\nDextromethophan - $10\nCough syrup - $12.86\nChloropheniramine - $6\nLevocetirzine antihistamine - $18.30\n\nThese meds are mostly available in pharmacies. For a fraction of the cost but the prices are increased cos this chain mostly gets paid by insurance! This is exactly what happened to other countries. Tell your HR to remove this clinic from their list!!",
      "time": 1741834921,
      "translated": false
    },
    {
      "author_name": "Julian C",
      "author_url": "https://www.google.com/maps/contrib/115036796282656178294/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIXWE58pUkKQHmXDBEJQZPaKLPJdOdOT1kVEphTAknIWSCswMA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "10 months ago",
      "text": "Visited in Jan. First and last time. The doc (who is no longer there) was fine, but desk staff was cold and rude. Non-smiling, looked unhappy working, and just glared at me when I entered. An email I sent in Jan was also never responded to until I wrote back in May. Unpleasant reception and high physician turnover is all the reason I need to change my provider.\n\nEdit:  \"We did indeed attempt to reach out to you in January via phone calls, and we responded promptly through out and including your subsequent email in May.\"\n\nIt is interesting that you left out the part where I had emailed a question on January 19 and never got a reply to it. I only got a reply from your clinic after sending a follow-up email on May 16. Accuracy and transparency is a two-way street.",
      "time": 1720740819,
      "translated": false
    },
    {
      "author_name": "Jan Jan",
      "author_url": "https://www.google.com/maps/contrib/109356990511581507588/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK4NXU19X1J0j8FPhzgzhKqTQOTbg4RTAJitiLCxTIi9Iiujw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "I recently had an unfortunate experience at a clinic that left me quite disappointed. The overall atmosphere was disheartening, with a distinct lack of customer service. The receptionist and the doctor both exhibited unprofessional behavior, which greatly impacted my visit.\n\nUpon entering the clinic, I was met with a receptionist who seemed disinterested and unhelpful. Her attitude was far from welcoming, and it felt like I was a bother rather than a patient seeking medical attention. Her sour demeanor was quite off-putting.\n\nThe doctor I saw wasn't any better in terms of attitude. He appeared distant and unfriendly, making me feel uncomfortable discussing my health concern. I was hoping for a doctor who would be approachable and understanding, but unfortunately, that was not the case here. His lack of empathy was evident, and it was disheartening to receive medical care from someone who seemed disengaged.\n\nOne notable limitation of this clinic was that patients were only allowed to discuss one health issue per visit. This policy felt restrictive, as it didn't allow for comprehensive care. When I attempted to mention another concern I had, I was immediately questioned about which specific ailment I was there to address. This approach seemed counterproductive to providing holistic healthcare and left me feeling unheard.\n\nIn conclusion, my visit to this clinic was quite disheartening due to the poor customer service provided by both the receptionist and the doctor. The unwelcoming attitudes and lack of friendliness greatly overshadowed any potential medical expertise that might have been present. This experience left me feeling frustrated and disappointed, and I can confidently say that this was the most disappointing clinic I've ever visited.",
      "time": 1691972233,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "hospital",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1399590751134176515",
  "user_ratings_total": 25,
  "vicinity": "3 Gateway Drive, #04-25 Westgate"
}