{
  "formatted_address": "80 Marine Parade Rd, #19-01, Singapore 449269",
  "geometry": {
    "location": {
      "lat": 1.3014702,
      "lng": 103.9051552
    },
    "viewport": {
      "northeast": {
        "lat": 1.302993880291502,
        "lng": 103.9067486302915
      },
      "southwest": {
        "lat": 1.300295919708498,
        "lng": 103.9040506697085
      }
    }
  },
  "name": "The Music Scientist Pte Ltd",
  "place_id": "ChIJYfqWdwAZ2jERPB7ta9HcK7Y",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "elizabeth chng",
      "author_url": "https://www.google.com/maps/contrib/112214277170725243325/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLQepyMTQ0ADlxQ5Wep4kn5cHpxrXVRbdLSKKJdTo3fDmxCJw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Highly recommend classes from Music Scientist if you're looking for music classes for your kid. Enjoyed all their self written songs , according to very relatable themes ranging from insects, pets, trains, cook and bake, beach , sea creatures and many more! Each lesson incorporates percussion alongside music and movement as well as creative storyboard with self created props. Classes are very engaging especially with Teacher Nicholas. My girl has been listening to their songs almost daily ever since we started attending their classes. They are prompt on WhatsApp whenever I enquire about schedule/lesson options for make up classes. Thank you Music Scientist!",
      "time": 1743507627,
      "translated": false
    },
    {
      "author_name": "Clayton Chua",
      "author_url": "https://www.google.com/maps/contrib/110645412175387064265/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX4-QUiw8v_7QwAVAljRZXS-xJBACoVQbkMg1lywJR4QKIe7NPk=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "⭐⭐⭐⭐⭐\n\nMy child has gained so much from the program at The Music Scientist! Week after week, my child eagerly looks forward to the classes. Even as a toddler, much is learnt — from dinosaurs and insects to sea creatures. The possibilities are endless, and The Music Scientist takes my child on a delightful journey of exploration and discovery.\n\nThe curriculum is excellent, but what truly sets this program apart is the exceptional care and attention the teachers provide. They are always thoughtful and meticulous in their approach, creating a nurturing environment where my child feels supported and encouraged. The constant praise and positive reinforcement have helped build my child’s confidence and sense of security.\n\nIt has truly been a fantastic experience, and I wholeheartedly recommend this program to others! ❤️",
      "time": 1743510956,
      "translated": false
    },
    {
      "author_name": "Jemie Lim",
      "author_url": "https://www.google.com/maps/contrib/111668842269723250528/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWHTZ3TOD7qEZHEHvk-Nb_y5r624BsuJgn5Xz-csNMAQhNwkALJ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "My little one has been so excited for her weekly music class! She’s even chosen to skip a wedding invite just to attend her music class – that’s how much she loves it! It’s truly heartwarming to see how much she’s learned, from focus and listening to following instructions, all thanks to the Music Scientist Center. Her favorite teacher is Teacher Nicholas, and I highly recommend this program to any parents considering a class for their child! Don’t hesitate to book a trial – it’s a great opportunity for them to explore and grow! Genuine review!",
      "time": 1742469318,
      "translated": false
    },
    {
      "author_name": "Sleek Lab 51",
      "author_url": "https://www.google.com/maps/contrib/115581123758155324739/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKipfrkZGvDUIw8hwjkseqWjv-EFAhIN3nJDV29wuEJpqTMLQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "The music scientist has been awesome in helping my kids develop musicality, fine and gross motor skills and for my older son, letter and number recognition. They have great and enjoyable themes like sports & play, music around the world and more which my kids enjoy thoroughly and every class has a myriad of activities for them to partake in. I am impressed by the commitment and passion of the teachers and the fact that majority of their songs are created on their own so it’s entirely unique. It’s so catchy that my kids request for the songs to be played at home on weekdays too. Highly recommend for all parents for high quality learning through play.",
      "time": 1742707772,
      "translated": false
    },
    {
      "author_name": "Mei Ng",
      "author_url": "https://www.google.com/maps/contrib/106680953261891951860/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK2DnAgDEZ7w9NSdjer0zq2jG4QcY3257XX3OHzW5sI2gZzNQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Highly recommend The Music Scientist. The teachers especially Teacher Nicholas is fun and engaging. The original songs and creative activities in class are very enjoyable that even my son is very disappointed that he has outgrown their classes!",
      "time": 1742437401,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13126828330918420028",
  "user_ratings_total": 13,
  "vicinity": "80 Marine Parade Road, #19-01"
}