{
  "formatted_address": "20 Eastwood Rd, #01-14B, Singapore 486442",
  "geometry": {
    "location": {
      "lat": 1.321592,
      "lng": 103.9554587
    },
    "viewport": {
      "northeast": {
        "lat": 1.323029030291502,
        "lng": 103.9569564302915
      },
      "southwest": {
        "lat": 1.320331069708498,
        "lng": 103.9542584697085
      }
    }
  },
  "name": "The Runway Cafe & Bar",
  "place_id": "ChIJK6K9OAUj2jERAaOW4cqi81k",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Jeremy Ng",
      "author_url": "https://www.google.com/maps/contrib/115967722716449750669/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWaChVPCdFFdYZ_3mwI4dAfoMkxQfL5iAOFtxYmneUjlSBsj9kP=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Nice decorative cafe in the East. Came to try it out from a great deal via eatigo.\n\nThe Prosciutto pizza and ribs were decent. The pizza bar did feel quite doughy & unauthentic. There is room for improvement for the food. However the risotto is something I would not order again.\n\nService & atmosphere were great. 5 stars because of the amazing voucher deals. Hope to see things get better!",
      "time": 1707498163,
      "translated": false
    },
    {
      "author_name": "sparklin77",
      "author_url": "https://www.google.com/maps/contrib/106476442644471738654/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVWcy86Wkt-M6ZQ0UnK8KLbuDk8HXBoLOHf0imUsOCgeHBLnMQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "The cafe has a nice ambience with the kdrama soundtrack playing in the background. The service was prompt and food portion is good - quite full 3/4 thru the food. The carbonara looks simple and normal but its taste is creamy and flavourful. Definitely tastes better than it looks. The fries are freshly fried hence they are very aromatic and crispy. The lamb rack is not bad too. The meat is tender and chewy. The Big Cheese (Burger) and Fish & Fries were ok, nothing much to rave about but I must say the food is served fresh. The food price is more on the higher side like minimally $20plus. So a bit expensive, with eatigo discount, the costing is more comparable with other western food cafes.",
      "time": 1714965892,
      "translated": false
    },
    {
      "author_name": "Wei Liang Sim",
      "author_url": "https://www.google.com/maps/contrib/101094637348562766818/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIy6QHNoG7yQLpZfpbJ-Fb6xAyty0jjXOF3H0faOwNygDRcyg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "11 months ago",
      "text": "Overall a great experience, just some confusing marketing choices. As you can see, the place is nicely outfitted, and crockery and cutlery are classy for what's essentially a pub.\n\nOf the dishes ordered, I'd say the fish and fries stood out more than the rest. Service is very attentive and fast, and it's surprisingly quiet on weekends.\n\nThat's where the confusing part comes in: essentially using Eatigo to bring customers with discounts, whereas walk-ins might be turned away by the uneven pricing. For instance, $20+ for mee and $120+ for PORK tomahawk is definitely steep for the locale (June 2024).\n\nAfter 50% discount, it's actually quite reasonable though. IMHO, they should reprice for the neighbour crowd instead. Certainly above average pub grub, and the drinks are decently priced. 👍",
      "time": 1717321138,
      "translated": false
    },
    {
      "author_name": "Angie Tulip",
      "author_url": "https://www.google.com/maps/contrib/100377898629583010379/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVQpo4_VvLiBdiCu5p_c7xE-8Qzc4jlDJYazaJQqkZC0FIzNxOE=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Update on 9/3/24:\n\nCame back for dinner this round and tired the lamb shank and sambal stingray. The food didn’t disappoint again! Was initially worried the stingray would be dry as we saw it was a thick slab at one end. Turned out to be very moist and tender! Nice service by the owners too.\n\nHubby found this gem on Eatigo website and we tried it for the first time today. Ordered the escargots, calamari and lamb rack to share. The calamari was really crispy on the outside and springy fresh on the inside. Love the lamb rack too - tender and very well seasoned. The fries are indeed one of the best we have eaten. The crisp was very different from the other DIY fries we had and the inside was so soft and fluffy! Service was great (as you can read from the rest of the reviews). A good find by hubby and we would be back again to try the other items.",
      "time": 1709990650,
      "translated": false
    },
    {
      "author_name": "Mike Webberley",
      "author_url": "https://www.google.com/maps/contrib/112729986401584037671/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUo7aJvTk99hToCA39ZgpmgBF8I84GS9zroL4FKAkzzSwsmuWs=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "We had a very nice evening here, it was convenient for us staying near Changi. We were welcomed as soon as we walked in (always a good sign). The food was very good, the atmosphere very relaxing and the staff charming. I started with mussels followed by the ‘chicken chop’ and my wife had the signature burger which looked impressive and my wife thought was delicious. The fries were crispy and the dipping sauces savoury. We had a bottle of Sauvignon Blanc and a pint of Guinness both of which were good. All in all a very pleasant evening and we will definitely be going back next time we are in the vicinity. Thank you to Grace and ‘Ganesh’ and the other waiter (whose name we unfortunately didn’t catch) for making our evening so enjoyable.",
      "time": 1705211822,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6481703280968114945",
  "user_ratings_total": 86,
  "vicinity": "20 Eastwood Road, #01-14B"
}