{
  "formatted_address": "1 Irving Pl, #01-31 Commerze @ Irving, Singapore 369546",
  "geometry": {
    "location": {
      "lat": 1.336096,
      "lng": 103.8860577
    },
    "viewport": {
      "northeast": {
        "lat": 1.337367030291502,
        "lng": 103.8875945302915
      },
      "southwest": {
        "lat": 1.334669069708498,
        "lng": 103.8848965697085
      }
    }
  },
  "name": "The Boneless Kitchen - Korean Vegetarian and Vegan Cuisine",
  "place_id": "ChIJMcWSBZIX2jERpH5WSHHxJdc",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Mimi",
      "author_url": "https://www.google.com/maps/contrib/109462850966186375914/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUpYe4WgtmKI417ieXzrlkeT-gj6-2nXTY9QRugUbnjcJJvX452_g=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "First time at a all vegetarian Korean restaurant, they don't have these where I come from so its a treat to be able to browse through a full menu of things I can eat! Today we tried the perilla guksu, jjajangmeon, and the perilla gimbap. All were delicious but the star was the perilla guksu! Light and comforting, noodles were perfect texture. Highly recommended. I believe its a family run business, daughter behind the counter not as helpful as the rest of the family. Overall enjoyable experience.",
      "time": 1744872627,
      "translated": false
    },
    {
      "author_name": "Kinga",
      "author_url": "https://www.google.com/maps/contrib/104951619761291738827/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV7BKOMYWrrJlGCx2FCT1tH06jUHiRGRRYOkYl00PEuvzx-VtJFRg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "The service was very attentive and kind. The food was very delicious. We shared a bunch of dishes and all were very flavourful. We also enjoyed the iced peach green tea that came without sugar (sometimes it’s difficult to find sugar free options in Singapore). We will be back! :)",
      "time": 1740121467,
      "translated": false
    },
    {
      "author_name": "GG K",
      "author_url": "https://www.google.com/maps/contrib/113182488876013163119/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJFHYPU6LcVzIMoSpThTDTStOqFYRiAlEmNoAPCaEDEixj2eg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Though there are only vegetarian options, the food here is quite authentic for Korean cuisine. I'd say that there isn't anything special about this place that sets it apart from typical Korean restaurants or vegetarian restaurants though. Prices are acceptable for the quality and quantity offered. We ordered the soontofu stew (which came with rice), kimchi pancake, and fried mushrooms.\n\nThe soontofu stew was not bad, though not comparable with the one I've had at the specialty soontofu restaurant. I felt that the kimchi taste could be a bit stronger and the tofu didn't fully absorb all the flavour. The kimchi pancake was better than average, it was quite tasty and went well with the dipping sauce. As for the fried mushrooms, it was highly recommended from the reviews, but I personally don't think there's anything special about it and would skip it. There are also side dishes here, which are alright, I'd only consider refilling the potato (yes, they are refillable!).\n\nThe environment here was kind of hot, it would be nice if their aircon could be colder. This place is usually quite popular, so do make reservations especially if you're visiting on a weekend.\n\nOverall, I probably wouldn't go out of my way to come back again, because it wasn't very impressionable. However, if I'm picking a place to hangout with vegetarian friends, this place would be quite high on the list.",
      "time": 1742837948,
      "translated": false
    },
    {
      "author_name": "Super Fragrance",
      "author_url": "https://www.google.com/maps/contrib/105892392413528737906/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWqSHV5zr7c3YSKUDcYJTQPmMJX6sgB719ANkni_d0p9uj2OS23=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "5 months ago",
      "text": "Ordered their tofu stew for $15. Price is net.\n\n2 of the 3 sides were good only the white radish tasted a bit off. At first the stew tasted okay but as i had more the oiliness got to me in a good way that it is actually tasty. Overall not something i will travel for but definitely good comfort food if you are nearby.\n\nI would say reservation is recommended.",
      "time": 1732518165,
      "translated": false
    },
    {
      "author_name": "Cheow Mong Chan",
      "author_url": "https://www.google.com/maps/contrib/116936834742186304043/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKEmIsX0YsUvhL1b7WmH0tkfqVat8kc_cCcYVbD-sDQ4KIlxg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Have been here several times in the past but didn't realise that i haven't done any posts of this. Google maps state last time i visited was in 2021.\nWas pleasantly surprised that they had the place renovated. Now more spacious and slightly brighter lighting.\n\nFood is still very tasty and ingredients fresh. Taste like authentic korean, well done!\nPrefer noodle in black bean sauce compared to the other, kimchi pancake can pass. Other dishes can order without regrets. Service is very good too. cleared empty plates fast.",
      "time": 1737256934,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15503062761140027044",
  "user_ratings_total": 1363,
  "vicinity": "1 Irving Place, #01-31 Commerze @ Irving"
}