{
  "formatted_address": "5 Stadium Walk, #01 36/37, Singapore 397693",
  "geometry": {
    "location": {
      "lat": 1.3021918,
      "lng": 103.876502
    },
    "viewport": {
      "northeast": {
        "lat": 1.303405080291502,
        "lng": 103.8779239302915
      },
      "southwest": {
        "lat": 1.300707119708498,
        "lng": 103.8752259697085
      }
    }
  },
  "name": "The Orange Lantern Gourmet Kitchen Authentic Vietnamese Restaurant",
  "place_id": "ChIJZ7TjRQAZ2jERuy8u_OCcOBE",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Rennie Lee",
      "author_url": "https://www.google.com/maps/contrib/104896149882118051128/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWlI9ttj92m3GJKTZ-eyIJbVH2ebrFhZEfbM4MRxj7R0ET5_Hjv=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "The food was just ok compared to the reviews. We got Pho which had light broth, and overcooked noodles. Portion was quite small. The sauces at the self-serve condiments counter didnt taste fresh ;(",
      "time": 1743694451,
      "translated": false
    },
    {
      "author_name": "Wesley Wong",
      "author_url": "https://www.google.com/maps/contrib/107433449088212182977/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLUoYBeMQ_z33NHa0ApQs6jkdbm2dVWs2A_BFN-7vHzZwwP_IWY=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 3,
      "relative_time_description": "5 months ago",
      "text": "The Vietnamese restaurant located in Kallang Leisure Park offers a pleasant spot to enjoy a bowl of Vietnamese pho. The set meal, includes a main dish paired with a drink and side dish. The drink stands out for its balanced sweetness, making it a refreshing accompaniment to the meal. While the pho soup is decent, with a light and comforting broth, it doesn’t quite match the depth of flavor found in more traditional establishments.",
      "time": 1734143425,
      "translated": false
    },
    {
      "author_name": "Joey Ace",
      "author_url": "https://www.google.com/maps/contrib/108895826050429661748/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJdyX1JnEiMCNVuoMPwwvQPZUjM_LiG4zINzWdRlA6rZJqlPA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Very positive experience from multiple visits. It serves quite a good Vietnam food at reasonable price that will not burn a whole in your pocket. I particularly like their hotpot due to generous portions of vegetables and flavourful soup. Their condiments are very interesting with addition of fried garlic which I find pairs so well with their food. Their service and staff members are very attentive and kind to us to the extend of switching their TV show to one that my son likes. And did that again at our next visit even though we did not ask for it. I'm v touched by their personal touch and gesture.\nWould like to highly recommend such a team of restaurant staff who truly does their best to help customers.",
      "time": 1725263652,
      "translated": false
    },
    {
      "author_name": "Martin Chan",
      "author_url": "https://www.google.com/maps/contrib/109128816127264362444/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV5kheV8MgA5Zgkr56T-r_mU6Dp56tXLjmpizFg_f9lbnNUE_0=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Place was clean and I loved the colorful lanterns. There was just one person taking our orders and serving but didn’t wait long for food to be served, unlike what some reviewers said. The set meal was good value as it included free spring rolls and ice lemon grass tea. I ordered the grilled meat with noodles and really enjoyed it. The sauce was very refreshing. My daughter felt the beef pho lacked flavor but I tasted it and thought it was fine. My son liked the grilled chicken with rice that he ordered. We tried the stir fried noodles but won’t be ordering that again in future as it was quite plain. Perhaps it was meant to be mixed with the bean and chili sauces. All in all I am happy to return there for lunch.",
      "time": 1712770636,
      "translated": false
    },
    {
      "author_name": "Another Big Bite",
      "author_url": "https://www.google.com/maps/contrib/100408883882614888601/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocII0G0w0-a59vQO8qRvKYltFgYDX-cSJIbWBEEvwh_sNeMcoQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "10 months ago",
      "text": "We ordered the good value deal lunch set.  Good portion servings of choice of main with 2 spring rolls & a refreshing cold lemongrass drink. The beef noodles clear soup was flavorful with all the lovely condiments. Beef will be better if cooking time is shorter. The Grilled Chicken and Fried Spring Rolls with Rice Vermicelli is a dry noodle dish. It was delicious with tangy sauce mixed into the noodles.  Very appetizing. I like the many spicy & tasty sauces at the corner counter that we helped ourselves with. The spacious and comfortable setting made our lunch an enjoyable one. A satisfactory lunch. Recommend to try.",
      "time": 1721225589,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1240914187458064315",
  "user_ratings_total": 184,
  "vicinity": "5 Stadium Walk, #01 36/37, Singapore"
}