{
  "formatted_address": "6A Napier Rd, #08-19 Gleneagles Medical Centre, Singapore 258499",
  "geometry": {
    "location": {
      "lat": 1.3076931,
      "lng": 103.8199087
    },
    "viewport": {
      "northeast": {
        "lat": 1.309100580291502,
        "lng": 103.8212167302915
      },
      "southwest": {
        "lat": 1.306402619708498,
        "lng": 103.8185187697085
      }
    }
  },
  "name": "The Obstetrics & Gynaecology Centre by SMG (Gleneagles)",
  "place_id": "ChIJfbbAIyAa2jERJr9WZwiGnMM",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Winnie Zhou",
      "author_url": "https://www.google.com/maps/contrib/110079612312549619758/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWsCSleGnq-A46nZWTIPqyZDfHz9bPIeOWipA-UWCpvfv1bFD9D=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Dr. Watt is the most friendly and informative ob I’ve ever met so far. Through out my pregnancy and delivery, she and her clinic staff gave us all the support we needed and made sure everything we worried about was clearly clarified and settled down. I will definitely go to her again in the future and I wish allllllll the best to those amazing people! 🥰🥰",
      "time": 1705670381,
      "translated": false
    },
    {
      "author_name": "Ariana MM",
      "author_url": "https://www.google.com/maps/contrib/110034985393774943817/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUN0qU3p7X0OHAKbAfuV7suXrzIIHLzZl07VBBgnPZRYcz5wSOP=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Have been with Dr Watt and team in my whole pregnancy and delivery journey and really happy! Calm and friendly environment by the Doctor and nurses. Delivery with Dr Watt could not have been better - thank you so much for everything! Definitely would recommend to others!",
      "time": 1700021383,
      "translated": false
    },
    {
      "author_name": "First name Last name",
      "author_url": "https://www.google.com/maps/contrib/102685572705083385505/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJzgDJozx0ni5LL6RrissqR6DmNZkgAEoKfG9yowqq3sA6WDw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "It is by sheer random luck (google search while I happened to be standing below Gleneagles) that I ended up with Dr Watt as my OB. I saw a number of OBs and Dr Watt’s very evidence based approach and kindness was just what I needed and made it easy to entrust our care to her.\n\nShe has been so steady, reliable, direct and kind. Her advice and recommendations are provided objectively based on the prevailing body of evidence yet always tinged with optimism. As first time parents, her guidance has been invaluable in walking us through this journey and I am grateful for her patience which I have tried many times with endless questions and worries.\n\nThe nurses, Shu Mei and Bee Yeng, and Dr Watt clearly work very well and efficiently together which makes them a great team. In particular, Shu Mei is especially caring to heavily pregnant women and so nice to talk to and Bee Yeng is on top of your queries and they are well relayed to Dr Watt for your continuum of care. Having a great front desk supported by nurses also makes this clinic stand out, on top of having an excellent doctor.",
      "time": 1717293799,
      "translated": false
    },
    {
      "author_name": "Coy Koi",
      "author_url": "https://www.google.com/maps/contrib/113100884273670593530/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVOhmW7RVENrS1Mn-0SUmZdgiS8fY_SWRMZyatxONEOm587wfTUnA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Dr Watt is a fantastic doctor who truly cares for her patients' health and well-being. She patiently, thoroughly and clearly explains the diagnosis and treatment options, gives me plenty of time to ask questions and digest the information, and puts my mind at ease with her warm, caring and reassuring bedside manner. I did a clinical procedure and a day surgery with her and can honestly say Dr Watt is one of the best doctors I've ever met. She is a rare gem of a medical expert who also has high EQ, and shows the utmost care for her patients' physical health as well as mental/emotional well-being & ease of mind. Her staff is also very well-trained, professional, friendly and courteous. They are able to explain processes/procedures/rationale clearly and consistently, and they follow up with patients before surgeries etc. Highly recommended!!",
      "time": 1634798061,
      "translated": false
    },
    {
      "author_name": "Jade Lee",
      "author_url": "https://www.google.com/maps/contrib/105331977061809985702/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ7jnrhPPNcoQLvvT61JbgVGu4PcpQ-8DHY4jC4LroxQkivRQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Dr Watt is the best!!! Dr Watt is very kind, sweet, loving and caring to me throughout my both pregnancies. I felt very safe, comfortable and confident with her care. Dr Watt explained very well and performed detail check up during each visit and she is very gentle! Shu Mei and Bee Yeng are very helpful and friendly as well! Love Dr Watt and her staffs! Thank you very much!!!",
      "time": 1667958344,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14095288304414408486",
  "user_ratings_total": 26,
  "vicinity": "6A Napier Road, #08-19 Gleneagles Medical Centre"
}