{
  "formatted_address": "1 Pasir Ris Close Downtown East, E!Avenue, #02-335, Singapore 519599",
  "geometry": {
    "location": {
      "lat": 1.3777669,
      "lng": 103.9549013
    },
    "viewport": {
      "northeast": {
        "lat": 1.379081480291502,
        "lng": 103.9563902302915
      },
      "southwest": {
        "lat": 1.376383519708498,
        "lng": 103.9536922697085
      }
    }
  },
  "name": "The Basil Inn",
  "place_id": "ChIJHeeu2LU92jER_wRx0F5kVo0",
  "rating": 3.8,
  "reviews": [
    {
      "author_name": "Alvin Lim",
      "author_url": "https://www.google.com/maps/contrib/118302592391028803090/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjURMF3PiO47_loldhYfYHmBFfmXZidC6KIimgaroOE5-iatqg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Basil Inn at Downtown East offers a delightful taste of Thailand with its flavorful and aromatic dishes. The menu features classic favorites like Pad Thai, Tom Yum Soup, and Green Curry, all prepared with fresh ingredients and authentic spices. The portions are generous, and the prices are reasonable, making it a great spot for a satisfying meal. While the ambiance is casual and cozy, the service is friendly and efficient. Some standout dishes include the crispy Pandan Chicken and the rich Massaman Curry. However, during peak hours, the place can get quite crowded. Overall, Basil Inn is a solid choice for Thai food lovers looking for tasty and affordable meals in the Downtown East area.",
      "time": 1744502209,
      "translated": false
    },
    {
      "author_name": "RKE T",
      "author_url": "https://www.google.com/maps/contrib/117425395407717241435/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIxxa_pyhIRMzPY_7fXainBF8vfh3_fCnbBhj-IGVrmbdW61w=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Today I heard a chef said that people wrote reviews when they wanted to complain but are usually lazier to review a good experience. There’s some truth in that for me so I decided to finally write about one of my favourite restaurants.\n\nOur family has been coming here for years for their Thai style steamed sea bass (Pla Neung Manow). The fish is consistently fresh and gravy is to die for. Standard to me is higher than most restaurants and on par with hotel banquet dinner. I always end up eating more rice than I should with this dish. You can have a great meal just with plain White rice with the steamed fish. The Thai style crab omelette (Khai Jiao Poo) is also very fluffy and delicious. Spicy Kang Kong (Phad Pak Boong) is also a regular order as is Moo Ping. I think the flavours here are on point and consistent. Not sure about the rice dishes as we hardly order those. Try the Thai style steamed fish, (order more plain white rice) you will not regret it. Hope the chef maintains the consistent standard and not change.\n\nBy the way aircon is a bit cold so you may want to sit outside if you’re afraid of cold.\n\n(Read about bad service from their staff but personally never encountered any rudeness or bad service in all my years patronising them. However if you’re the type who expects nicey smile and attentive service from the serving staff, this is not the place for you. Personally I dislike / hate too much attention / fake smile from service staff - yes hate American style “service” culture with / in expectation of the big tip. Just serve me good food. Period.)",
      "time": 1743856942,
      "translated": false
    },
    {
      "author_name": "Poh Choo Chong",
      "author_url": "https://www.google.com/maps/contrib/114187241293186252971/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLexRgIp4cLDEepiNAs10O8iDpDCDfvtdeZw8qFp19JlUDc0g=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "We ate here this evening and contrary to the reviews, we enjoyed our meals. I think the price is okay for a Singapore restaurant. Our prawn and squid dish had 5 small prawns and enough squid - is it expensive for $19, yea a bit. But the other 2 dishes were reasonably priced imo. Food was fresh for us.",
      "time": 1742123404,
      "translated": false
    },
    {
      "author_name": "Trevor Paulo",
      "author_url": "https://www.google.com/maps/contrib/103068517903929760932/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUyLgCMMdNjY-FTeWMUsbfNgYIjnH1gR3FUdfzFSHYZtiTD3P4a=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I love coming here over the last 12 years seeing Basil Inn go through its various iterations. This cosy neighbourhood restaurant has been a mainstay and it's always so reassuring to eat here. I recently got married and brought my Thai wife to eat here and she gave it a seal of approval! Goes to show how much love has been put into their meals. My favourites have always been the beef noodles and mango sticky rice. They recently added grilled pork neck to their specials menu and it was really delicious as well.",
      "time": 1742291132,
      "translated": false
    },
    {
      "author_name": "Liyana L",
      "author_url": "https://www.google.com/maps/contrib/114246289462574472150/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUvZh3RUliOgHw8VOUZC11sYrMXeh1uKN0sPrJmZzyqGC3Orlc=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Basil chicken was full of wok hei, it was delicious, especially after a hard day of work. The olive fried rice was delicious too, topped with a crispy fried egg with a runny yolk. The green curry chicken paled in comparison with these two strong contenders for dinner. Overall, a really enjoyable meal.",
      "time": 1741274823,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10184437965731726591",
  "user_ratings_total": 373,
  "vicinity": "1 Pasir Ris Close Downtown East, E!Avenue, #02-335"
}