{
  "formatted_address": "9 Yio Chu Kang Rd, #01-55, Space@Kovan 545523",
  "geometry": {
    "location": {
      "lat": 1.3544052,
      "lng": 103.8771684
    },
    "viewport": {
      "northeast": {
        "lat": 1.356124830291502,
        "lng": 103.8783826802915
      },
      "southwest": {
        "lat": 1.353426869708498,
        "lng": 103.8756847197085
      }
    }
  },
  "name": "The Local Cafe - Space@Kovan",
  "place_id": "ChIJuZr8aAAX2jERARdlzNsY2t8",
  "rating": 4,
  "reviews": [
    {
      "author_name": "William",
      "author_url": "https://www.google.com/maps/contrib/114916696399917166666/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXV_vUR46-oyVC4JRXT2u_AvNmJZDTEdPq3YiL_hdy2AOSC2vQQ5Q=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "Food is alright. Service is good. The place is a simple cafe and a convenience store, so I just picked a canned drink from the chiller.\n\nThe teriyaki chicken can be improved I think. The chicken is okay, quite tender but the sauce is a bit off. Not quite what I expected for teriyaki sauce.\n\nLocation is quite secluded. I only come here because I was gonna collect my print job from across the road",
      "time": 1734955021,
      "translated": false
    },
    {
      "author_name": "Samson Ng",
      "author_url": "https://www.google.com/maps/contrib/111896812755264351912/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLpRHiacrpblEp4SwV4tqDJREBS6KLwqZLpWXuNoR65_f0L=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "Disappointing experience at this cafe. Ordered the peanut butter toast, but the bread was as hard as a stone, making it almost inedible. The Teh C tasted like a plain tea bag steeped in water, very bland and lacking flavor.\n\nDespite being the only customer, I still had to wait 20 minutes for a simple tea and toast. The staff seemed confused even though there was only one order to manage. I had to remind them multiple times about my order, which was frustrating. the service and food were poor. Definitely not a place I would visit again.",
      "time": 1734138821,
      "translated": false
    },
    {
      "author_name": "Denis",
      "author_url": "https://www.google.com/maps/contrib/107269275231105198912/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXGcb2XjZu3-SFeDVPGJrkwVnEF4Uv62jV2ZynRo-y070N2TgazBA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I enjoyed the YTF but the soup was abit too salty for me.\n\nI tried their sweet and sour chicken with rice dish and it tasted like marmite chicken instead.\n\nTheir coffee and Kaya toast with bread is not bad.\n\nTheir teriyaki chicken with rice dish is abit too sweet.",
      "time": 1731147933,
      "translated": false
    },
    {
      "author_name": "esther",
      "author_url": "https://www.google.com/maps/contrib/110008794713315648988/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKVAwWIAsQ_nNJnp1QCHHewZzhv6mBOqCuJTymzkg_AsERugQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "macaroni soup and soy milk were fine, but what's bad about this place is that the 2 staff members who were working today genuinely seemed uninterested.\n\nwhen taking my order, staff sighed super loudly in front of me, despite me being polite throughout the whole ordering process. when i was paying, staff did not say anything and just pushed the pos machine towards me. after passing me the receipts and buzzer, did not reciprocate even though i said thank you. her service attitude was just horrible.\n\nupon collecting my food, the soy milk that i ordered was not there, so i asked the other staff do i have to come back again for the soy milk later, and she immediately shot me a confused look and said \"you can get it there\". no instructions and directions were given as to where i can get my soy milk when i was ordering, and after multiple times of me trying to look for the soy milk, the staff then came out of the cashier unwillingly to get it for me.\n\nnot someone who usually leaves negative reviews or just google review in general, but this experience was just horrendous.",
      "time": 1740800391,
      "translated": false
    },
    {
      "author_name": "W S",
      "author_url": "https://www.google.com/maps/contrib/107445954498243492844/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKvTqgCZ_6hO4Uw4C8Ais_MxpwfWrHWCo0klJaI4TacjK52RQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "10 months ago",
      "text": "Service crew couldn't take orders efficiently. Ordering alone took 10mins because service crew doesn't seem to know their menu very well.\n\nIt's a small place, with zero customers when we entered. We had to wait 20 minutes for the food to be served even though the place was empty.\n\nThe chicken cutlet that comes with the nasi lemak was cold.\n\nThe luncheon meat egg bun was cold.\n\nThe macaroni soup was tasteless.\nIt was weird with milk in it.\n\nFood were presented with the cutleries in the food. Canteen style?\n\nTea tasted bland, like a watered down version of instant tea.\n\nThis is a cosy little place, but with horrible food.\n\nThe only food acceptable was the regular coffeeshop yam pau.\n\nI understand F&B is a tough business to run, but it will be even tougher with mediocre service and sub par offerings.",
      "time": 1720924974,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16130232347686934273",
  "user_ratings_total": 70,
  "vicinity": "9 Yio Chu Kang Road, #01-55, Space@Kovan"
}