{
  "formatted_address": "115A E Coast Rd, Singapore 428804",
  "geometry": {
    "location": {
      "lat": 1.3058071,
      "lng": 103.9045241
    },
    "viewport": {
      "northeast": {
        "lat": 1.307115330291502,
        "lng": 103.9058448302915
      },
      "southwest": {
        "lat": 1.304417369708498,
        "lng": 103.9031468697085
      }
    }
  },
  "name": "The Hidden Story - Speakeasy Bar hidden within a steakhouse",
  "place_id": "ChIJUUvasykZ2jERb6IV-4iYmHE",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "C Gan",
      "author_url": "https://www.google.com/maps/contrib/103699630654870532747/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKShBX-rFAtML-dk4o9EfT9TgMSvXLRpi3SLlffEiD6z8y6ig=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Love this hidden bar through a \"freezer door\" at Stirling Steaks. The ambience was cozy with comfortable sofas that you could sit down all night long without your butts hurting, and we had fun interacting with the friendly bartender who plied us with a couple of freebie drinks. Time flew back so quickly as my friend and I were sitting in the bar chatting away with our drinks. We had some bar bites - the Angus steak cubes were good, the Mexican chicken mid-wings were even better! The offerings were reasonably priced and there was no cheap watered down drinks, which is an absolute plus. Totally recommend. Am already thinking of going to the place again.",
      "time": 1726386895,
      "translated": false
    },
    {
      "author_name": "Julia Low",
      "author_url": "https://www.google.com/maps/contrib/116360636909081420398/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXr0dK7sFoREDpJtf8XN_asMZqtdXWPelVpLk7QyPBDC1c7T7Y=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Our evening at The Hidden Story was elevated to an extraordinary experience, thanks to the exceptional service and artistry of Patricia. From the moment we approached the bar, her warm demeanor and evident passion for her craft shone through, setting the stage for a memorable night.\n\nPatricia introduced us to two of the bar’s signature cocktails: Kueh Syrup (which she created) and the Peranakan Enclave. She told a story through every pour and garnish, making us feel as though we were part of the cocktail’s journey.\n\n🥥 Kueh Syrup: A cocktail inspired by the Nyonya kueh salat. Its multiple layers of green and blue mirrored the vibrant hues of the traditional dessert, and it's flavour also delivered in every way. The moment the lemon was added, it transformed the drink, revealing savory undertones making it a layered, thought-provoking drink.\n\n🍹Peranakan Enclave: A sweet, tangy masterpiece. This tropical lychee-forward gimlet is balanced with a citrusy zing, delivering a refreshing punch in every sip.\n\nIf you find yourself there, let Patricia guide your cocktail adventure. Her passion and expertise will make your visit unforgettable, one exquisite drink at a time.",
      "time": 1739457567,
      "translated": false
    },
    {
      "author_name": "Elaine Tan",
      "author_url": "https://www.google.com/maps/contrib/114783749584551407325/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKzXm9eqRGvSaErTkbSnHsYeJLsVRk8M5lOv0i8nApw0AT79A=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "Loved the cool vibe and the comfy sofas there.. Great place for catching with friends over drinks when you go early eg 6pm when they play jazz music. Food is reasonably priced.  Some pretty interesting craft beers here also to try if you just want something different! I would go again..",
      "time": 1719588719,
      "translated": false
    },
    {
      "author_name": "Dennis N",
      "author_url": "https://www.google.com/maps/contrib/104988888938292694772/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXU2FLb831GgBoJcO_sMX-8SzpyE5mrYJw6MVKrhpzrhB95_Td1=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Bro, best hospitality in SG. I don’t think I can ever not come back to such a place. 10/10! The drinks are actually well made and customers here are treated with respect and grace. YOU WILL LOVE IT HERE, JUST COME ⭐️⭐️⭐️⭐️⭐️",
      "time": 1729091820,
      "translated": false
    },
    {
      "author_name": "CP",
      "author_url": "https://www.google.com/maps/contrib/113861923464679544218/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX12jQdPullVvmdJ_F9lzja7BzbsejtQ6gORrDzIGMNfBvWRpEM=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "I came to know the term speakeasy only recently and I started googling for speakeasy bars near me, and this place came out. It’s quite interesting to have to get through a door that looks like an industrial fridge door. I have been to Stirling Steaks but I would not have knew there is a bar on level 2 through this door inside the restaurant. The bartender is very creative with the drinks and friendly. I have not been to other speakeasy bars to comment much but it is quite a relaxing place to have a drink or two in the evening especially if you are in the vicinity.",
      "time": 1716009370,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8185460036841349743",
  "user_ratings_total": 87,
  "vicinity": "115A East Coast Road"
}