{
  "formatted_address": "2 Pandan Valley, Singapore 597626",
  "geometry": {
    "location": {
      "lat": 1.3204771,
      "lng": 103.7790003
    },
    "viewport": {
      "northeast": {
        "lat": 1.321919430291502,
        "lng": 103.7803276302915
      },
      "southwest": {
        "lat": 1.319221469708498,
        "lng": 103.7776296697085
      }
    }
  },
  "name": "The Learning Boutique",
  "place_id": "ChIJVVVVXXwa2jERRDInQOLFg-4",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Sreedharan Sajikumar",
      "author_url": "https://www.google.com/maps/contrib/114317183875056757297/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLIoTS2T3fC8iTlrtqNHHc93VSMETtgAMexiolrxs8Snyn8yg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "9 months ago",
      "text": "Two of my children attended this center at 2 Pandan Valley for nearly a year. The initial two terms were satisfactory, but the quality of professional training declined over time. We recently left the center because the training was not worth the fee paid, and the school started offering similar extracurricular activities. My main feedback for future applicants is as follows:\n\nThe main teacher would give worksheets to the students and then spend time in the reception area on the telephone, demonstrating a lack of professionalism.\nNo feedback about the children’s performance was provided; parents had to actively seek this information.\nBe cautious about the terms and conditions of the contract you sign. They did not provide us with a copy of the contract, so it is important to take a photo of the signed form. When I requested the return of the deposit, they informed me that I should have given notice one month in advance, which I was not aware of or might have overlooked. I requested a copy of the contract for confirmation but did not receive one.\nMany worksheets are now available on the internet, and with tools like ChatGPT, parents can effectively train their children without paying high fees to such centers.\nFinally, I want to acknowledge that Teacher Emily and Chloe are very nice and effective teachers.",
      "time": 1724301931,
      "translated": false
    },
    {
      "author_name": "Siddharth Thirumalai V.",
      "author_url": "https://www.google.com/maps/contrib/106351014103367134599/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUbErxcR_-Sfnl0pJjOIW6Z6x52JsH1MOrT0DFEEdhLbPQGySujtw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Overall not a good experience with the Pandan Valley centre - my child's score actually dropped 2 levels after going to this centre. Nowhere as good as some of the other schools out there - in terms of follow-ups, teaching materials, teaching quality. Would NOT recommend.",
      "time": 1700629673,
      "translated": false
    },
    {
      "author_name": "Ng Tze Ching",
      "author_url": "https://www.google.com/maps/contrib/108462940798680754976/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWqX0fxe_nkPjHCzRli3b3hO0m5CpS--Lhu5C-l6OhDZMECKANM=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Mrs Heng is very friendly and strives her best to help us in every way she can. During her lessons, not only can I concentrate and learn new things,  but I also get to have lots of fun and make new friends. Highly recommended tuition center if you are looking for a tuition center to improve your children's academics and learning mindset.",
      "time": 1629513125,
      "translated": false
    },
    {
      "author_name": "charlotte",
      "author_url": "https://www.google.com/maps/contrib/106204391729477409230/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKE97WKeX7hYuhUo74nOVbEx6lcEARMDNbp9-qJeeudiAhXYCo=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "The Learning Boutique is a very fun filled place with a relaxing environment for students. It is a place where students can make new friends while learning to improve their subjects. The teachers here are all very kind and understanding while teaching us and making sure we understand everything that is being taught. The facilities are very good as well and very comfortable, suitable for learning. I have had a lot of fun here in Learning Boutique since I was in P3 and the staff here are all very friendly so you will never find yourself in an awkward situation. Not only can you study here, you can also make long lasting friends that will help you with your journey in the Learning Boutique. The work here is never too much and there are also workshops conducted for those who think they need extra lessons. In short, The Learning Boutique provides a suitable, comfortable learning environment while helping students learn, make friends and fall in love with learning more through their teachers passion for the subjects.",
      "time": 1629514098,
      "translated": false
    },
    {
      "author_name": "delia ng",
      "author_url": "https://www.google.com/maps/contrib/107573499864124324148/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKsCsYUym1N5akMpCzBQwoMatLsF-_8D9_m0xTN0qB6XLpn3g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Mrs Heng is a wonderful teacher that communicates very well with her students. She helped me find joy in learning English and always helps her students whenever they are facing any difficulties :)",
      "time": 1629513642,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17186798178505536068",
  "user_ratings_total": 16,
  "vicinity": "2 Pandan Valley, Singapore"
}