{
  "formatted_address": "InterContinental Singapore, 80 Middle Rd, Singapore 188966",
  "geometry": {
    "location": {
      "lat": 1.2984419,
      "lng": 103.8551579
    },
    "viewport": {
      "northeast": {
        "lat": 1.299502030291502,
        "lng": 103.8563857302915
      },
      "southwest": {
        "lat": 1.296804069708498,
        "lng": 103.8536877697085
      }
    }
  },
  "name": "The Lobby Lounge",
  "place_id": "ChIJ2SsDzKgZ2jERAz2eiKMnwyc",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Master Ji-Ning",
      "author_url": "https://www.google.com/maps/contrib/113014652293741710718/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjULZzOmDfKU1O62D8MIWy3Pd9nyJYE-iv6foHg03nHPIwh8QutY=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "If you’re looking for a whimsical yet elegant high tea experience in Singapore, The Lobby Lounge at Bugis delivers something truly special. The moment the afternoon tea set arrived, I was blown away! It looked like a miniature enchanted forest served in a wooden tray, complete with moss, wooden platforms, and playful details like ladybird chocolates and egg-shaped cups nestled in a bird’s nest. The presentation was absolutely stunning and clearly crafted with artistry and intention.\n\nEach bite felt like a small masterpiece. The scones were perfectly golden and fluffy, with both plain and raisin options accompanied by rich butter. Savoury selections like the caramelised onion tart and layered potato bites were flavourful and had great textural contrast—crispy, smooth, and creamy all at once. The sweet treats were equally delightful: the red velvet mushroom-shaped mousse was both playful and rich, and the macaron was light yet satisfying. The level of detail in every component showed that the chef took real pride in plating and flavour development.\n\nTo top it all off, I had a cold mocha that was so good—smooth, chilled, and the perfect balance of coffee and chocolate. It complemented the high tea set beautifully without overpowering the delicate flavours.\n\nOverall, The Lobby Lounge offers more than just a meal; it’s a full sensory experience. With refined flavours, unique textures, and a fairytale-worthy presentation, this is a spot I’d absolutely return to for a special treat or a memorable afternoon.",
      "time": 1744017942,
      "translated": false
    },
    {
      "author_name": "Sheryl Biangco (Ladylyrehs)",
      "author_url": "https://www.google.com/maps/contrib/116710997281166261580/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUmfoYdCsaqwmkNU3hS6QvjhjVgGch8TYkSoZlk8JjcAnuLYwPSSA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Brought my mom to The Lobby Lounge for a high tea treat 🫖 and what an experience it was! The Golden Nectar Afternoon Tea was such a luxurious yet relaxing way to spend the afternoon. The space itself was gorgeous ✨ super elegant, spacious seating that made us feel comfortable.\n\nWhat stood out most to us was how the whole tea set was infused with the natural richness of Comvita’s premium New Zealand Mānuka and Gourmet Honeys. It added this subtle, golden sweetness that made each bite feel extra special.\n\nOur top savoury picks? Definitely the Foie Gras and Duck Rillettes on Brioche so rich and perfectly balanced. My mom love the Quiche Lorraine warm, cheesy, with a lovely touch of multifloral honey.\n\nOn the sweet side, we LOVED the Chrysanthemum Honey Pavlova topped with the prettiest meringue honeycomb and chocolate butterfly. And the Pistachio Mānuka Honey Choux Puff? Dreamy\n\nHighly recommended",
      "time": 1745643075,
      "translated": false
    },
    {
      "author_name": "Grace Foo",
      "author_url": "https://www.google.com/maps/contrib/109206033493811714320/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK0-hqHIvpwB638w-6xTrn4A9BjvjURFYOGwbA52vR4VtsqqQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Celebrated my friend's birthday with the high-tea set. Extremely impressed by the service standards, ambience and food quality!\nAppreciate that we were allowed to mix vegetarian and non vegetarian sets to cater to our dining requirements. Was lucky to be assisted by Mr John and Mr Jason who attended to us with excellence and attentiveness. Price is steep, but for the quality of food and service, it is very worth it! Definitely will be back!!",
      "time": 1746080757,
      "translated": false
    },
    {
      "author_name": "Rhian Tan",
      "author_url": "https://www.google.com/maps/contrib/111841763291533864817/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIxsDBgic-41VMQZTnnxsUnGVFOKJ5kh7_fZtOmtFbxQ2ONLw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Went for their afternoon high tea. Lovely atmosphere, high ceilings gave it a posh setting. I wish their coffee was free slow, it was so delicious 😋 Preferred their range of savory options as their desserts tended to be too sweet for me and my mum’s palette. Pastries were also a tad dry. Pleasantly surprised by the birthday cake slice, was not expecting it at all!",
      "time": 1745989543,
      "translated": false
    },
    {
      "author_name": "Jill Lim",
      "author_url": "https://www.google.com/maps/contrib/113047015886526031327/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJq1McKbdcBtPsXqAb90FiTpv94nUdoI2ZbEMXtAjUvETxk6Q=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "The sweets and savory items from the honey themed high tea were delightfully delicious! We enjoyed the slow and easy Thursday afternoon, no crowd at all. Staff were attentive and friendly. Highly recommended!",
      "time": 1746763836,
      "translated": false
    }
  ],
  "types": [
    "night_club",
    "bar",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2865177371262991619",
  "user_ratings_total": 264,
  "vicinity": "InterContinental Singapore, 80 Middle Road, Singapore"
}