{
  "formatted_address": "673 Bukit Timah Rd, Singapore 269735",
  "geometry": {
    "location": {
      "lat": 1.326464,
      "lng": 103.8034823
    },
    "viewport": {
      "northeast": {
        "lat": 1.327867880291502,
        "lng": 103.8048739802915
      },
      "southwest": {
        "lat": 1.325169919708498,
        "lng": 103.8021760197085
      }
    }
  },
  "name": "The Chinese High School Clock Tower",
  "place_id": "ChIJH0HEiaAQ2jERGqZDNd_Uutc",
  "rating": 2.6,
  "reviews": [
    {
      "author_name": "Cherie Tan",
      "author_url": "https://www.google.com/maps/contrib/112085407218224455106/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIzQ3_4diVwDxPX3lu8__UPbuw0Cl7XZ5zBqNsKfLDoILJSLA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "10 months ago",
      "text": "!SCAMMER ALERT ALERT!\nA China guy called my company on 3 July 2024, asking to talk to a sales person. He called himself Teacher Lee (李老师), claiming to be a teacher from Chinese High School.\nWant to deal with us. He is asking me to add him another hp. to do WhatsApp. Want to meet up at Chinese High School today.\nAfter the conversion, confirm meet up afternoon.\nThis morning, 4 July 2024 called me again.\nAsking me the favor to help him look for the paint. (Dufa extrem)\nSo I'm just calling the vendor, did you supply this paint. The vendor telling me that this few days a lot of ppl asking this paint. The vendor telling me that be careful, this is the scam.\nPlease take note.",
      "time": 1720062371,
      "translated": false
    },
    {
      "author_name": "NH W",
      "author_url": "https://www.google.com/maps/contrib/102671124191522202558/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKPUoPJGrPHJPBJCH6py0XvG1yEEemz2yHCEEa2iqO3BQP2-g=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "10 months ago",
      "text": "Scam Alert!\nSomeone impersonating as Hwa Chong's teacher (claimed himself as 李老师) called us and said that he needs us to provide a quote.\nHe insisted that he wants to talk to boss for numerous times and asked us to send WhatsApp to his number as he is using his wife number to call us.\nUpon checking with HCI's staff, we then realised it is a scam and we immediately came to this page thinking to warn the people here. It was then we realised a lot of us get these calls. Beware peeps.",
      "time": 1720413125,
      "translated": false
    },
    {
      "author_name": "W.Y Tan",
      "author_url": "https://www.google.com/maps/contrib/116437549555667700841/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKQJK_elLdOnsH8olfFjfJ1AnnnCvl1F5eh55hMkyMWYVwJCw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "Yesterday afternoon recd call from Mr Tan who is a Chinese teacher in Chinese High School who said he wanted some renovation work to be in the classroom and made an appointment today for the discussion for the work in the afternoon. But feeling some incorrect way for the school to ask a teacher to organize such matter i request the caller to furnish his full name and the department he is attached and he gave his name as Tan Kian Min ( translation from chinese) which he forwarded  but without mentioning his position and dept. he is attched to and subsequently call whether will be held this afternoon. I told him this not the properly for the school to call for any work to be done and told him to email his requirements and drawing and story ended. This man's given number 90050106. Wish to inform all to be highly alert and not fall into the scam.",
      "time": 1720496697,
      "translated": false
    },
    {
      "author_name": "Aven Tng",
      "author_url": "https://www.google.com/maps/contrib/118429484192180136967/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIIcbs77OgqmQMcN8vT63SJ2fMZbxzPttRBD5TkgkaWXo0ElA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "10 months ago",
      "text": "! BEWARE, SCAMMER ALERT !\nSome China guy called my company on 2 July 2024, asking to talk to a sales person. China guy call himself Teacher Chen (陈老师), claiming to be a teacher from Chinese High School. Called me with 3 different numbers that are unavailable when I call back. Then ask me to use WhatsApp and start calling and calling. But my practice is to converse via text/voice messages only, I don't accept calls and I've WhatsApp call auto reject app. Then I think he got tired of calling and stopped. So today 3 July 2024, I texted him asking him what items he need, but I think he deleted or block my number already. Display pic gone, message sent out as 1 tick. I do not know what he is up to, but I do sense that he's definitely not a genuine customer/person of what he claims to be.",
      "time": 1719968685,
      "translated": false
    },
    {
      "author_name": "Ashley Choo",
      "author_url": "https://www.google.com/maps/contrib/111031096568077285994/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWM6SCzoK_YVXnAGtQmgUZdTPJj3FTME-5cE3HT5TtJuoombJSu=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "10 months ago",
      "text": "My colleague received a damn strange call from a  李老师 who kept asking to speak to the 老板 and only the  老板。 When pressed, he said he's a procurement officer for Hwa Chong and needs to buy 70 king sized bed frames for his teachers, which is a really really odd enquiry. He insisted on communicating through WhatsApp and even arranged to meet at the school next week. I don't know how the scam works but it's super suspicious. After reading everybody's comments here, suffice to say, we better just drop this lead and block all communication with this person!",
      "time": 1720174452,
      "translated": false
    }
  ],
  "types": [
    "secondary_school",
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15544971118959109658",
  "user_ratings_total": 17,
  "vicinity": "673 Bukit Timah Road, Singapore"
}