{
  "formatted_address": "7 Buckley Rd, Singapore 309763",
  "geometry": {
    "location": {
      "lat": 1.3173877,
      "lng": 103.840322
    },
    "viewport": {
      "northeast": {
        "lat": 1.318727330291502,
        "lng": 103.8417002802915
      },
      "southwest": {
        "lat": 1.316029369708498,
        "lng": 103.8390023197085
      }
    }
  },
  "name": "The Schoolhouse Buckley",
  "place_id": "ChIJ____D-YZ2jER58MO1_2KpNc",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Lil Tseng",
      "author_url": "https://www.google.com/maps/contrib/101734669809328066804/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ8oc2At4gtRTi9uFLNGdpil3W3JkD0gF3oFD4-FC-ag0rCvw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "During our relocation to Singapore, one of the most important things for us to get settled was choosing the most ideal school for our then 2.5-year-old daughter.  My husband and I did countless hours of research, and I personally visited 13 different schools, and sat down with 13 different principals to understand the learning tools/ structure, and core values of each school.  It wasn't until I met Natalie from Pat's Buckley that my husband and I both knew we had found the right school.\n\nNatalie was professional, personable, caring, welcoming, and very engaging.   We were also very pleased with the tour provided by Miss Gen at the time. I'm especially pleased that both Natalie and Miss Gen are receptive to parental feedback. It's so easy to see that they are dedicated in the improvement of the school's learning environment.\n\nMy child’s transition to a new school in a new country was made easier under the guidance of her teachers miss Jae and Liu Laoshi.  She participated in a variety of activities and events and enjoyed both her teachers and classmates.  Liu Laoshi has a vibrant personality, always smiling and ready to assist.    Miss Jae is extremely caring, kind, and helpful.  She is also genuinely concerned about my child’s well-being in school and always takes her time to keep me updated whenever I see her during school pick up and drop off.   My child continued to grow over the years under the patient care and guidance of Miss Jae, Miss Kristie, Guo Laoshi, and Xu Laoshi. It's especially heartwarming to see my child constantly singing and dancing to the songs that she's learnt at school from her music lessons with Miss Eunice.\n\nFast forward a few years, my older child has graduated, and my younger child is now also attending Pat’s and loving school under the care of her teachers Miss Tina and Sun Laoshi. Every day my child is always happy to go to school and full of smiles when I pick her up.  As a parent, I feel extremely grateful to be part of an institution where the leadership team and the teachers focus on the well-rounded development of a child.\n\nThe current Principal Miss Gen’s warm and compassionate demeanor radiates throughout the entire school, creating an environment of kindness and respect. The teachers are equally amazing. They are passionate about teaching and care deeply about the well-being and development of every child. Their creativity and enthusiasm shine through in every activity and lesson. They have a genuine love for their students, and it shows in the way they interact with them.\n\nMy family loves seeing the high level of care from the teachers, and we are grateful for the new and close friendships we've also created with some of the parents.\n\nI cannot thank the staff at Pat’s Schoolhouse Buckley enough for the incredible care, love, and education they have provided for my two kids.   Not only have they learned academic skills, but they have also developed social and emotional skills that will serve well in life.\n\nI highly recommend Pat’s Buckley to any parent looking for a safe, nurturing, and high-quality preschool. The principal and teachers are truly exceptional, and we are so grateful for the positive impact they have had on our family.",
      "time": 1676732557,
      "translated": false
    },
    {
      "author_name": "huiee c",
      "author_url": "https://www.google.com/maps/contrib/116439426769135740539/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLFcxJEqh-h4wTVykieF3lVLON_BmNCe3qHcrSlzLNfGnZJmw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Our journey with The Schoolhouse Buckley has been nothing short of amazing. On weekdays, children spend more waking hours in their preschools than they do at home, more time with their teachers than their parents, hence being able to leave them in great care and with people you trust is vital. With The Schoolhouse Buckey, I've never had to worry. The teachers genuinely care for the children, and have become dear friends over the years. They know the quirks and interests of every child, not just the ones in their classes, and my children enjoy going to school daily. Academic wise, the school has done a great job in building a strong foundation for my children and has truly been a great stepping stone to formal education. I will forever be grateful towards the Buckley team ❤️",
      "time": 1714459152,
      "translated": false
    },
    {
      "author_name": "Hani Palupi Nicolai",
      "author_url": "https://www.google.com/maps/contrib/105662613982323805665/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXzjYgclLmxYZtjjkK_x0z6FoHQycIcvyJkdqpL64_L5xs2BexOvA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I enrolled my daughter at Schoolhouse Buckley, and it didn't take her long to settle in. The teachers are very helpful, and all the children seem happy every day. The positive vibe in the school is contagious. The school keeps us updated on any health-related issues. My daughter has become more independent, and she always looks forward to going to school. Ms. Yuan and Ms. Yasmin, my daughter's class teachers, are very helpful and caring.",
      "time": 1715665128,
      "translated": false
    },
    {
      "author_name": "YQ L",
      "author_url": "https://www.google.com/maps/contrib/101677554887198362627/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKbqQG_crwghgXEygyiV-ARBaUw6EHGKabYKB02iSzlx1OCXQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Teachers are very professional, dedicated, and careful with kids' development and daily lives.\nThe curriculum is meticulously designed and comprehensively delivered by teachers, encompassing various subjects such as Chinese, English, Numeracy, music, sports, and more. Each term is enriched with unique themes, supported by various materials and outings.\nVarious events are organised, including participation from parents. And supporting materials are provided for parents to do some activities with kids at home. The communication between teachers and parents is very smooth. We are well informed of happenings.\nThe outdoor playground, including water play and a sand pit, is spacious and lovely.\nSchool also pays a lot of attention to hygiene and safety, which is appreciated.",
      "time": 1715332258,
      "translated": false
    },
    {
      "author_name": "Wei Ming Leong",
      "author_url": "https://www.google.com/maps/contrib/114070409705323520272/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXUR6BnSMrySK47uqoUA6UjspYG_fJeP9TD_XxTY4ChbURlbxA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Amazing team of Teachers, led by the center's superb Principal! Our son loves going to school and it's very comforting to know that he is always in good hands when we drop him off.\n\nThe center is also housed in a fantastic building with ample outdoor space for the kids to play and learn, which is extremely rare nowadays in the childcare space.",
      "time": 1714380193,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15538697437174481895",
  "user_ratings_total": 18,
  "vicinity": "7 Buckley Road"
}