{
  "formatted_address": "5 Stadium Walk #01-09 Leisure Park Kallang, Singapore 397693",
  "geometry": {
    "location": {
      "lat": 1.3027137,
      "lng": 103.8765233
    },
    "viewport": {
      "northeast": {
        "lat": 1.304134230291502,
        "lng": 103.8780818302915
      },
      "southwest": {
        "lat": 1.301436269708498,
        "lng": 103.8753838697085
      }
    }
  },
  "name": "The Coffee Bean and Tea Leaf - Leisure Park Kallang",
  "place_id": "ChIJgQUi_k4Y2jERiYJiGDbk1ys",
  "rating": 3.9,
  "reviews": [
    {
      "author_name": "Ed",
      "author_url": "https://www.google.com/maps/contrib/110321516361820759584/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLeUPqsscOXWrJSG80o_maRrJ_2PXE4EJMQyYosrxGezBRppA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "10 months ago",
      "text": "Had a mixed experience. While the manager's service was commendable and they were very helpful, the rest of the staff seemed unmotivated and inattentive. Several times, I found myself waiting at the cashier for someone to take my order, but the staff ignored me. This significantly detracted from the overall experience. It's unfortunate because the store has potential, but the staff's attitude needs improvement.\n\nFood was good tasty.",
      "time": 1721034675,
      "translated": false
    },
    {
      "author_name": "Artem Moshnin",
      "author_url": "https://www.google.com/maps/contrib/114186673531048387843/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWvlti1ntxFtbwjSEgoSkij50Ksz-3FUWFhWwG5K3k15xyJo1u7=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "This coffee bean was amazing, in its drinks, service, and atmosphere. It was cozy and well-lit, which made it very comfortable to drink and chill there. I ordered the new ice-blended choco Oreo crunch, which was made super fast as well. It tasted very tasty and had a good balance of sweetness of the chocolate and Oreo. I would recommend it to any Oreo lover, or anyone looking to try a new sweet delight. One thing though, the price was a little steep for a regular sized drink ($8~). Other than that it’s a great place for drinks and other small foods.",
      "time": 1693577305,
      "translated": false
    },
    {
      "author_name": "Georgina Lo",
      "author_url": "https://www.google.com/maps/contrib/111013906496809048140/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL7yXdqkKrzbGy9jjbI6YXKnOG9qxXKI9EceZTUfQwJ7d5K=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Visited the place on 25 Aug (Sun). The young Chinese boy in the store was busy clearing the trays left over by customers. He signal to me to give him a minute while doing so. He quickly cleared and not forgetting his hygiene, he washes his hand before coming back to attend to my orders. He is super efficient. He even remembered my regular order despite not visiting for a few weeks. Customers started pouring in slowly & he handles them efficiently. Without stopping at all, he still wipes the tables clean in the midst of all these. Hope Coffeebean mgt can put up a sticker on every table to remind customers to clear their own tray to ease the staff workload. I’m very impressed with this young gentleman on duty that day. Pls keep up the good work. 👍🏻👍🏻👍🏻",
      "time": 1724574537,
      "translated": false
    },
    {
      "author_name": "Gabriel Sim",
      "author_url": "https://www.google.com/maps/contrib/102460637738780465290/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX5G9OeIqRfK9Cocv1648Sh3w2nRmLPVXF_bHKmoxWQgLkJj1vu=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "9 months ago",
      "text": "Have been patronising this branch almost every weekend for more than 2 years as my kid is having her enrichment class at Leisure park. One of the better cafe in Leisure park in terms of cleanliness and ambience (bright and spacious). Purpose of this comment will be a message to the person in charge of CBTL’s breakfast menu. Your current breakfast offering is no better than a fast food restaurant. I get more food by dissecting a subway sub. The quality and portion is getting from bad to worse over the years. With the recent price increase to the menu, I am expecting more from CBTL for a breakfast platter worth 16.20 (attached pic, both set cost 16.20). Suggest you could add another piece of ham or one more slice of bread or some baked beans to make it a more hearty meal. That would make customer less shortchanged too. Please bring back the hash browns to your breakfast platter, the canned fruits bites sucks.",
      "time": 1724033602,
      "translated": false
    },
    {
      "author_name": "웬케빈",
      "author_url": "https://www.google.com/maps/contrib/107458777477246149283/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVY-8pKjo0VqBWfyO8AotzjR1tk6SQqcgvK20Mda3UoqHoo588=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "9 months ago",
      "text": "The Coffee Bean & Tea Leaf is a delightful spot for brunch enthusiasts and coffee aficionados alike. Their menu boasts an impressive array of brunch options that cater to diverse palates, from hearty breakfast platters to light and fluffy pancakes. Each dish is thoughtfully prepared with fresh ingredients, ensuring a satisfying meal every time.\n\nOf course, the highlight remains their freshly brewed coffee and tea selections. The rich aroma of their expertly roasted coffee beans fills the air, promising a robust cup that's perfect for kickstarting your day. Tea lovers will also appreciate the extensive variety of high-quality teas available, each offering unique flavours and aromas.\n\nThe ambience at The Coffee Bean & Tea Leaf is warm and inviting, making it an ideal place to relax or catch up with friends over a delicious brunch. Whether you're there for the food or just need your caffeine fix, this café consistently delivers on quality and taste. Highly recommended!",
      "time": 1722262016,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3159244584612168329",
  "user_ratings_total": 157,
  "vicinity": "5 Stadium Walk #01-09 Leisure Park Kallang"
}