{
  "formatted_address": "6A Shenton Wy, #02-09/10 Downtown Gallery, Singapore 068815",
  "geometry": {
    "location": {
      "lat": 1.2765284,
      "lng": 103.8481015
    },
    "viewport": {
      "northeast": {
        "lat": 1.277798080291502,
        "lng": 103.8495794802915
      },
      "southwest": {
        "lat": 1.275100119708498,
        "lng": 103.8468815197085
      }
    }
  },
  "name": "The Centre for Inner Studies in Singapore Ltd",
  "place_id": "ChIJZe_CbrwZ2jERLE2BIkr9URM",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Hari Krishnan",
      "author_url": "https://www.google.com/maps/contrib/102451828092381088537/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXwM_QuYDjGk2reuxYAFJZeMf1KJD7UWsh9cfdqf0ojM1XCCkng=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "Best place transform our life. Here you can heal your body and mind....😇",
      "time": 1747355304,
      "translated": false
    },
    {
      "author_name": "SILING GAN",
      "author_url": "https://www.google.com/maps/contrib/108219636979900947980/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWZWOsaNk7B0B4-US7iybvl8F2w5dI_f73Xqg2nbpF872SkVvTf=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "The most important education, the best gift I had given to myself! Really with deep deep gratitude for who I am and my life and my family life today. Can’t imagine what my life and all connected would be if there weren’t Pranic Healing education for me.\n\nAnyone who is reading this, this is a sign for u to start this life changing work. Dun  think or assess or look further; u are divinely guided here. Just being with Basic Pranic Healing course following by Soul Realisation class, u will rise above current situation, out of your box and ready for greater work in this life! All the best!!  Love, Silin Gan.",
      "time": 1695719724,
      "translated": false
    },
    {
      "author_name": "Julie Lim",
      "author_url": "https://www.google.com/maps/contrib/101405064169315967745/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUvKjkz0Z5cTB6Y2XT3dcy-BRThzITihGrm71OP_N2oBRnpanX6Jg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I have insomnia for more than 15 years. I have tried many types of herbs or supplements. None of it helps. Even if there is one rare type that helps, after 3 months or so the effects wear off. I will suffer from insomnia again. Its a torture every night whenever I try to sleep. Everyday whenever I wake up no matter how many cups of coffee I drink my mental is very tired and I cannot concentrate on my work for too long. Just by Twin Heart meditation for about 2-3 months, I have cure my insomnia. Till date I do not have this problem again. Twin Heart meditation is my life saver!",
      "time": 1696292188,
      "translated": false
    },
    {
      "author_name": "Wyman Loke",
      "author_url": "https://www.google.com/maps/contrib/105435497576477986727/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUzmdPGDBCQ6VrT2S3wUjlU-0qwiRBWuA6_NhxkL-mwnAHh5qES=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My mother, 88 years old, had difficulty in breathing and was awarded to A&E. She was in constant pain and was gasping for breath. We suspected it was pneumonia. Through CT scan, doctor has found her entire left lungs filled with cancer cells, spreading to right part of the lungs. The cancer cells has also spread to her heart and spine.\n\nDoctor has notified that she was diagnosed with stage 4 lung cancer and doctor told us to bring her home for her remaining days. She was only able to take liquid food and was not able to walk.\n\nUpon discharge from the hospital she was given pain medication and morphine to manage the pain.\n\nWe did not want her to suffer for her remaining days and have reached out to Centre for Inner Studies to include Pranic Healing to help alleviate her sufferings.\n\nArjun the trainer from Centre of Inner Studies did regular daily healings for her.\n\nWe saw drastic improvement within a week. Breathing has been normalise, her appetite was very good and have resumed having solid food. She wasn’t in pain. She seems more peaceful and happier too. Her heart rate dropped significantly from 110 to 93 and she is able to stand up to walk.\n\nWe are very grateful to GMCKS teachings and Arjun for taking up this healing for my mother.\n\nThank you for this priceless healing Arjun, Center for Inner Studies and GMCKS. 🙏🏻",
      "time": 1695729174,
      "translated": false
    },
    {
      "author_name": "Just Lim",
      "author_url": "https://www.google.com/maps/contrib/104681040035909833415/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI6jqXXwi3GZS7CbvEEKtoS0LWmtDFU1uv8kppv4rRMXn2KhQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "2 years ago",
      "text": "A holistic healing centre that conducts meditation n pranic healing , pranic healing is a method taught by their late Grand Master Choa Kok Sui , a Filipino Engineer turned holistic Energy Healer.\nMost of the  professional practitioners here are quite well versed in body scanning , scanning for blockages in the body as they have received extensive training especially in this area.\nBody scanning is not something that can be taught overnight but the the student himself needs to experience it himself and picking up the skill thru prolong period of going thru trail and error.\nThis is something like Japanese Candle Light Charting method used for monitoring stock/forex market. After going thru the course , most students will know the basic concept of Japanese Candle Light Charting Method but unable to grasp how to  really put it into practical usage when doing trading .In a nutshell , it is about the art of interpreting .",
      "time": 1676831277,
      "translated": false
    }
  ],
  "types": [
    "school",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1392172254682500396",
  "user_ratings_total": 18,
  "vicinity": "6A Shenton Way, #02-09/10 Downtown Gallery"
}