{
  "formatted_address": "9 King Albert Park, #01-05, Singapore 598332",
  "geometry": {
    "location": {
      "lat": 1.3368811,
      "lng": 103.7789486
    },
    "viewport": {
      "northeast": {
        "lat": 1.338346680291502,
        "lng": 103.7806418302915
      },
      "southwest": {
        "lat": 1.335648719708498,
        "lng": 103.7779438697085
      }
    }
  },
  "name": "The M Plot Cafe",
  "place_id": "ChIJmWNd0f4R2jERpGkBJxWICwg",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Angela Hoi",
      "author_url": "https://www.google.com/maps/contrib/114900279388550722444/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU_FaVh7VPTJEt7QYALniArqw4zgdVuxowJ2VFNT2s-Nxb-Ls5O=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "7 months ago",
      "text": "Spotted The M Plot Cafe while waiting for my dogs to be groomed in the same mall. Unfortunately, our first impression wasn’t great—the person behind the counter, a lady with cropped hair, didn’t make us feel particularly welcome.\n\nAfter placing our order, we went upstairs, but only a counter table, a very low coffee table, or a tiny round table were available—the larger tables were reserved. There wasn’t any staff around to ask, so we took one of the reserved seats. When someone finally showed up to serve our coffee and dessert, we were told to move as they had reservations. After a bit of back and forth, they let us use one of the reserved tables because the reservation wasn’t due until 12:30. It was a bit of an unnecessary hassle that could’ve been avoided with better management.\n\nDespite the awkward seating situation, the food and desserts were very good. A staff member in a white cap who attended to us later was much more hospitable and even greeted us when we left. I’ll probably return, hoping for a smoother experience next time.",
      "time": 1728102204,
      "translated": false
    },
    {
      "author_name": "Michelle Teo",
      "author_url": "https://www.google.com/maps/contrib/110216679839647007207/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJr5NV_lm00CRNc8BRaZ5_L27OWLMF9gRqfoNiu0Rm5XfmFzg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "The giant macaron was so expensive for $12.50 (via grab) and not that gigantic. But taste wise was really amazing! Not sure how often I'll eat it though given the price range.\n\nBig breakfast was nice and super filling - could easily fill two people. Liked the scrambled eggs (seems to be one of the best in the area surprisingly, from what I've tried) and sauteed mushrooms but the baked beans tasted weird. Would go for the lighter platter without baked beans and grilled tomato next time.",
      "time": 1742791603,
      "translated": false
    },
    {
      "author_name": "Maegala Kanakham",
      "author_url": "https://www.google.com/maps/contrib/103470412403061630732/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLVo3eK6i1UaN5QOv8UP1Ni1dpH2eaMW3vgDlA_c_OKYkCc=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "Loved the ambience and the food was good too! But the service! I'm all about the service fr. When I stepped into the cafe, the staff(short hair, female) was the  total opposite of hospitable. Not sure what's she gg thru. Was told abruptly tt I have to order the food first before gg up. I'm totally okay with tt. But the tone! Girl just got to chill abit yaw. But heres the thg..I saw another customer bringing the menu up and then he went back down to order. Talk about double standard! So hurt. Lol. Then another lady customer wanted to shift to the sofa seat but she told her she can't cos it's reserved. I mean I totally understand the cafe policy cos there might be another large group tt might come later. But she could have handled it more professionally and tell the customer to chg if another large grp comes in later. I mean just be easy going. Being flexible ain't gonna hurt you right. In the no one came ! And the table was unused! Pity the lady. Yikes. The food was good. But don't thk I will come back agn if the same person is working. No hard feeling for the staff. But just work on the customer skills abit ah. It might make another person's life better for that day lol.",
      "time": 1735550532,
      "translated": false
    },
    {
      "author_name": "Carmen Ho",
      "author_url": "https://www.google.com/maps/contrib/108620217219350283740/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUxWqKVvpbhyNHNKYAB9a3h5ye7wQ-wUAiqqQxNMebnEMSMM5_2=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Quiet little cafe, but one of the BEST iced lattes I’ve ever had!❤️ Also tried the dutch baby pancakes with eggs and sausage, and the eggs benedict. Food was really made with quality ingredients, and not over oily or salty, which I really appreciate🥰 Will definitely return for the coffee, and gotta try their desserts in future too😆",
      "time": 1724511000,
      "translated": false
    },
    {
      "author_name": "S Tan",
      "author_url": "https://www.google.com/maps/contrib/113006509068406510021/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIn-vXvijl7Tpzwu0GYGRZMupb-xu80_TpqxlPUkYZ1o-hBjg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "MUST GO!! Visited for brunch and had both versions of the dutch baby pancakes (savoury and sweet).\nThe pancakes were very well made, with the characteristic crisp border and a soft, fluffy centre.\nThe savoury version came with two fried eggs runny centres; delicious sausage, and salad which helped cut through the richness. Loved the generous cracked black pepper on top which helped enhance the flavours too.\nThe sweet version is NOT TO BE MISSED. The bananas were nicely bruléed on top; the greek yoghurt added a nice sour note; and what really brought everything together was the squeeze of lemon.\nIt was a busy morning on a Saturday but staff were cheerful, attentive, and efficient.\nLots of other items on the menu, bakes and cakes worth a repeat visit for.",
      "time": 1717244992,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=579706601477335460",
  "user_ratings_total": 173,
  "vicinity": "9 King Albert Park, #01-05"
}