{
  "formatted_address": "415 Bukit Batok West Ave 4, Block 415 Block 415, Singapore 650415",
  "geometry": {
    "location": {
      "lat": 1.3631716,
      "lng": 103.7467616
    },
    "viewport": {
      "northeast": {
        "lat": 1.364492430291502,
        "lng": 103.7482598802915
      },
      "southwest": {
        "lat": 1.361794469708498,
        "lng": 103.7455619197085
      }
    }
  },
  "name": "The Moral Childcare Centre",
  "place_id": "ChIJJZiUlzQQ2jER-Nhxa1T2ZeA",
  "rating": 3.8,
  "reviews": [
    {
      "author_name": "Ryna Shazrina",
      "author_url": "https://www.google.com/maps/contrib/109589482806357921341/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLtogS7QlF0M3EjNBR-BTmB5XvBKc4SjRupaHPfRqsfZYh-bQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "A centre full of dedicated teachers that’s strive for the best of the children. Teachers give prompt replies and ensure strong partnership with parents. I can see how much my Son has improved & excited to go to school each day. Totally recommended it!",
      "time": 1726405109,
      "translated": false
    },
    {
      "author_name": "CHUA CHEW HA",
      "author_url": "https://www.google.com/maps/contrib/112155348352238840388/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJfaSf4PfSR4wEjonPRbubhttusqXSqTQmkPoZekymK9Gagrw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "My daughter this year in K2, I am satisfied with her class teachers -teachers Wang & Angeline. both teachers run their own duties well in guide my daughter in her educational even discipline. Her English & Chinese improve a lot. Again, thanks both teachers for their effort   in coordinate with us (parent) to make my kid grow.",
      "time": 1724741107,
      "translated": false
    },
    {
      "author_name": "Julia Tay",
      "author_url": "https://www.google.com/maps/contrib/112713739035195099824/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXZW1LURIWoyH6DdUd1LzDbtsdi2nl5ulOBnOS6ErDiC6CWsCUx=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "a year ago",
      "text": "Long overdue review of the school. My son was there when he was 5mo till 17mo (July'23). Teachers there were quite dedicated towards the kids and we could see how much love they had towards the kids. However, the management could have managed things better there.\n\nFor prospective parents who are planning to enrol your kids there, please think twice before you place your kids there. Do check multiple times with the school principal on whether there is a transition pathway for your kid to the different stages- from IFC to PG, N1, N2, K1, and K2. It will also be good to request for a school tour to understand more about their space planning and facilities available.\n\nMs Vimala would also be inconsistent and forgetful with her words. Before our son joined the school, we were told that we could inform 2-3mo in advance if we wanted to continue on to PG.\n\nMs Vimala told us that our son would have a slot in PG when I called in to check 5 months before he was due for promotion, while at the same time also wanted to request to reserve a slot for my unborn 2nd child for IFC.\n\nSubsequently, after 2 weeks, I went down to the school to request for a tour for PG side. We were informed that there was no slot available for him in PG and he would have to be on the waitlist. We were advised to find another school despite indicating our interest for him to continue on to PG at least 4 to 5months in advance before he was due for promotion to PG.\n\nImagine how horrifying it is to discover that your child cannot be auto promoted to the next level as the principal prioritises new intake of students. (FYI the IFC side has 16 slots whereas PG side has 12 slots so each time round, there will be at least 4 students who will be unable to get promoted to PG and would have to source for another CC to attend!) It's definitely stressful to have to go around checking the other schools in the vicinity on whether there is available spot for PG.\n\nThankfully we managed to secure a spot in another school for him to transit to in PG.\n\nTLDR; check on criteria for promotion to next level, request for a school tour to view the facilities and understand how their operations are. Always have a backup childcare plan for your child just in case words are twisted and they end up not having anywhere to go to.",
      "time": 1715094519,
      "translated": false
    },
    {
      "author_name": "Kashmalene Channel",
      "author_url": "https://www.google.com/maps/contrib/118155123700389276225/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXGQ7OlPCW-AuZmCwrDsC7kA8JLil2rlnkRQKppQn7F5kVDa40=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "Best choice of school. Teachers are very dedicated and very caring with the children. I can see my son enjoys going to school and  I can see improvement in his eating habits and language. Highly recommend!",
      "time": 1721780568,
      "translated": false
    },
    {
      "author_name": "Robin kang",
      "author_url": "https://www.google.com/maps/contrib/114267961450982352543/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIv7P6eVO4FAVcsv9bpVylHcVqdXrGLX_oshplcyONQ5KNP9Q=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "9 months ago",
      "text": "2021 :review Have very bad experience with this school.If they cant handle yr child they will ask you to leave.\n\n2024 :Three years after my initial review, I’m writing this follow-up to show that the advice given to me back then was completely wrong. My child missed N1 due to COVID and was enrolled directly into N2 in 2021. Before starting N2, the principal assured us that everything would be fine and that my son would do well, even without attending N1. Understandably, my child cried a bit initially due to the unfamiliar environment, but after less than a month, we started to see significant improvement, especially after the first two weeks.\n\nHowever, despite this progress, we were unexpectedly called to the school and told that our child needed to attend a special school. We were asked to make the switch immediately, with no prior notice. Thankfully, we didn’t follow their advice to send him to a special school. Instead, we transferred him to another childcare center, and today, I’m proud to say that my son has graduated from K2 and is now moving on to primary 1.After 3 years i still cant get over i still feel the school should apologize .",
      "time": 1723771415,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16169600879583942904",
  "user_ratings_total": 12,
  "vicinity": "415 Bukit Batok West Avenue 4, Block 415 Block 415"
}