{
  "formatted_address": "10 Choa Chu Kang Rd, Post Office, Singapore 689379",
  "geometry": {
    "location": {
      "lat": 1.3793677,
      "lng": 103.7591311
    },
    "viewport": {
      "northeast": {
        "lat": 1.380572230291502,
        "lng": 103.7605374302915
      },
      "southwest": {
        "lat": 1.377874269708498,
        "lng": 103.7578394697085
      }
    }
  },
  "name": "The Orange Tree Preschool (Choa Chu Kang)",
  "place_id": "ChIJVVVVBbwR2jERWtlCBJtrLm8",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Huijun Zeng",
      "author_url": "https://www.google.com/maps/contrib/107417657743229176583/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVMQz8g608gqW-QfB91TcVQYuq60G8WDkyLorH02udD489P2my_=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My child had attended Orange Tree Preschool since PG to K2 and I would very much recommend this preschool to anyone! The school's environment is conducive and definitely safe for the kids. It has outdoor playground and mini swimming pool within the compound for the kids to have fun without worrying about their safety to cross roads or be in the open public area. Teachers and staff are also attentive and caring. They will call the parents timely if anything arises. Parents are also well informed of any events. The teachers are skilled in teaching and coaching the kids to build their foundation in reading and writing, which really helped a lot for the kids to transit to primary school. Kudos to the Principal, teachers and staff of Orange Tree Preshool (Choa Chu Kang)!",
      "time": 1707219129,
      "translated": false
    },
    {
      "author_name": "Wang Miao",
      "author_url": "https://www.google.com/maps/contrib/100484778627494842719/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK3APHE-JG9tMsk3C4kzw9K1EUjTMkOU_eUtJAe58Nk7xTinw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "It was an academy school who really teach children fundamentals. The teachers and principal are nice and professional. Environment is neat and clean, food is also not bad, overall it’s recommended.\nMy elder kid graduated from the school and miss the school so much whenever mentioning about his kindergarten. Younger kid is in good progress, I can see the smile and happiness that motivation for daily attending. I am happy and lucky to make right choice of school for them.",
      "time": 1705222691,
      "translated": false
    },
    {
      "author_name": "Yi Hui Lee",
      "author_url": "https://www.google.com/maps/contrib/106403050555383074054/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKJkw2zytbk59Vydv5O0bzQp6lt9EMtVu92vmBA6G4VREU18A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My kid has been in the OTP since N1 and I would highly recommend this preschool! The principal and all the teachers are very professional and they truly care for the kids. My kid is learning very well and he really enjoys his time in the school. The facilities of the school are well maintained with its own private pool and outdoor compound. The school environment is also very conducive and clean. Kudos to all the staff in the school!",
      "time": 1699083829,
      "translated": false
    },
    {
      "author_name": "Jamie Ng",
      "author_url": "https://www.google.com/maps/contrib/102945952867340386714/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW_BB04dQaZt4J_FIEONy17ouU-rmcBi4DB5UqVmMj8Eqqj7eQ9=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I have a wonderful 9 years of having my 2 kids at the Orange Tree CCK Preschool.  Teachers here have been very responsive and responsible. The environment is clean and has its own independent facilities within the compund, like plaground and pool. The school has very structured academic curriculums and interesting activities for the student. As parents, we were well informed about the child's learning progress and growth. Overall, the school has taught my 2 kids really well. Both my kids have no problem coping in primary school, be it academically or socially.",
      "time": 1705047325,
      "translated": false
    },
    {
      "author_name": "Leng Leng",
      "author_url": "https://www.google.com/maps/contrib/112203385731226241755/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIGP9yKGJbseAT6w-WI27xhjBRPQ08yBPNjavyO3ydzL38pKQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "School environment like the classrooms, toilet shower areas are all very clean, bright, neat and conducive for effective learning. Curriculums and activities are all well planed in place in developing the kid in all areas. External lessons like art ,speech and drama, robotics are available too.\nTeachers are all very committed and responsible, caring, patient and kind. Very Fast and responsive too. Most of the teachers had been with the school for many years and maintained very good relationship with the parents.\nMiss Hema, the principal had been there for more than 10 years. She is the best that I have ever known. Very committed to providing the best to kids, planed and managed the whole school with the well being of kids as her top priority. Friendly and caring to everyone. And she can remember every single kid names and their parents!\nOverall, excellent preschool experience for both of my kids! Very blessed and glad that both of my kids were with the school for 4 marvelous years of their childhoods.",
      "time": 1701224672,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8011459100674283866",
  "user_ratings_total": 33,
  "vicinity": "10 Choa Chu Kang Road, Post Office"
}