{
  "formatted_address": "500 Upper Bukit Timah Rd, Singapore 678106",
  "geometry": {
    "location": {
      "lat": 1.3624092,
      "lng": 103.7678955
    },
    "viewport": {
      "northeast": {
        "lat": 1.363775880291502,
        "lng": 103.7691821802915
      },
      "southwest": {
        "lat": 1.361077919708498,
        "lng": 103.7664842197085
      }
    }
  },
  "name": "The Salvation Army William Booth Corps",
  "place_id": "ChIJn3djC1MQ2jERJQ4dFDDdSik",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Dominique Chang",
      "author_url": "https://www.google.com/maps/contrib/117933184179375526894/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWcqdTxg5ozMs_jI2jxN4o4fL0X49aAgtwZK5N8HEUsWHkG9RMw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Absolutely disappointed and pissed by the staff who in charge the furniture resale dept. And the warehouse fork lift operator, as in they are the manager there, and being so rude to donor. I have asked and provided photo of item for donation via email, they said ok but subject to review. If mattresses are not acceptable as a donation, pls remove it and tell us no mattress is acceptable, new or used. So regretted to bring the mattress down, I can just contact TC for free bulky item disposal. Don't think I'm just wanna dispose the item for free, TC also offer free service, without needing me to arrange the logistics.",
      "time": 1742527939,
      "translated": false
    },
    {
      "author_name": "Ice Qu",
      "author_url": "https://www.google.com/maps/contrib/112472682452415767759/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXCNYlHWu16DpWlTwNKe41agOLE-eo_Mnb4Vv2MC9fR64AXEsA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "7 years ago",
      "text": "Woke up and just felt like visiting this second hand store. Glad I did! Took Downtown Line and exited Hillview MRT and voilà! It's right there.  Entered the store and was very surprised at how organized and clean it was. They had everything from lovely dresses to blue jeans to jewelry,  shoes, household goods and more. What a fun place to browse!  I found several pairs of shoes in like new condition but had to narrow it down. When I got to the register the cashier explained that today was buy one get one free on the shoes. My lucky day! Next time I visit this shop I will have to bring a bigger bag, I decided. Lots of bargains here...especially if you are into crafts or repurposing items like I am. Love this place!",
      "time": 1510720113,
      "translated": false
    },
    {
      "author_name": "Wanling Tan",
      "author_url": "https://www.google.com/maps/contrib/100541281281828647606/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLFrrwkQHfdwX8NM-o88wmEP5wLjIy4HQcaP2naDH7gOttmVQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "5 years ago",
      "text": "Praisehaven Mega Family Store is open daily (Mon to Thur is 11am to 7pm , Fri to Sun is 11am to 8pm). Wide range of products to shop at their basement 1 & 2.Many good buys and join them as a Friends of The Salvation Army and enjoy 10% *",
      "time": 1571473489,
      "translated": false
    },
    {
      "author_name": "Olivia Tay",
      "author_url": "https://www.google.com/maps/contrib/116810561586427937011/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUtLVxDuh_LkoSgizFR8LLFHyvhfgk2ni9ddJAcTBwemzo56ovJ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Quite convenient for donation as you just have to drop things at the point. It is right next to bus stop and mrt station so the location is quite friendly for those who do not have a car.",
      "time": 1645547873,
      "translated": false
    },
    {
      "author_name": "Elle x",
      "author_url": "https://www.google.com/maps/contrib/109566784578582319383/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXnO45yxhLK1jw5OT4l0nRUeFlaY1aYl1lCi0jrI4vA29GI36w=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "10 months ago",
      "text": "Been coming here for years, donate a lot of preloved clothes and pick up new ones, feel its for a good cause and better for the environment, To my surprise, i came here today and items are priced more expensive than brand new items if u were to buy from retailers. tacky trench coats priced at 100$ a piece, old laminated wood bedside table with the side peeling off priced at 40, sony headphones priced over 300$+ which is the price if u were to buy brand new ones in store w warrenties. It blows my mind at these prices and i dont believe they will be able to clear any items at this kind of pricing, no rational person would buy old as-is condition items which are prices more than new ones. Makes me suspicious on how they are able to keep the store running, salvation army is a respectable brand and relies on donors and community for a good cause, it seems that the management is abusing the donations from christians, as there is hard to believe they are able to support the staff and overheads with their charity shop by pricing generous donated items ridiculously , yet are using money from donations to run the place. Disappointing how this place changed and i believe they should be questioned or audited by their headquarters from London for ruining the brand name as a charity.",
      "time": 1721397583,
      "translated": false
    }
  ],
  "types": [
    "church",
    "place_of_worship",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2975433702397251109",
  "user_ratings_total": 164,
  "vicinity": "500 Upper Bukit Timah Road"
}