{
  "formatted_address": "1 Unity St, Singapore 237983",
  "geometry": {
    "location": {
      "lat": 1.291608,
      "lng": 103.8422954
    },
    "viewport": {
      "northeast": {
        "lat": 1.292767780291502,
        "lng": 103.8437125802915
      },
      "southwest": {
        "lat": 1.290069819708498,
        "lng": 103.8410146197085
      }
    }
  },
  "name": "The Robertson House by The Crest Collection",
  "place_id": "ChIJg8XNAJ8Z2jERq2zsjewGbZc",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Oswaldo Ravelo",
      "author_url": "https://www.google.com/maps/contrib/110262913994834048941/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXCVbZ_CahVIeD-nYN58uym0-VEnXyA2ulBdtGK9nh9PRPuG6xt=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "a week ago",
      "text": "I've spent 10 days in the hotel and everything was good so far, friendly staff and good service overall but today the manager of the restaurant charged me more than twice the price for exactly the same items I've been having the whole week. When I made him aware that I've been paying less for exactly the same things he didn't listen and became a bit rude. I'm still in the hotel for a couple of days more but definitely I won't recommend the restaurant. Actually, I'm coming so frequently to Singapore and don't know if I'll use this hotel again.",
      "time": 1746890587,
      "translated": false
    },
    {
      "author_name": "Perry Dina",
      "author_url": "https://www.google.com/maps/contrib/116029868943637244401/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWDcJRQlK5R4fBZH1wimcKxlll8ywq9ah0-B0NsgwQ98Jg7fJ0=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "a week ago",
      "text": "3 stars at best!! Giving it 2 because the rooms itself are super dated! Not sure how it’s a 5 star hotel!! The lobby and entrance looks renovated and more of an upscale hotel until you take the elevator to the rooms. When you get to the floor, you get a musty/mildewy scent (probably due to the old outdated carpets. Walking into our room felt very moist as the temperate of the rooms automatically change to a moderate temperature when no one is inside the room. It was not refreshing to come back to your hotel after waking in the heat. The rooms were dusty (probably from the old carpet and old furniture) and triggered my allergies. Towels and sheets were at least clean. Wouldn’t recommend staying here if you want a true 5 star hotel.",
      "time": 1747118865,
      "translated": false
    },
    {
      "author_name": "Chen Peilin",
      "author_url": "https://www.google.com/maps/contrib/115313777265009860682/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVVID6wNHPH-bY0afVrbD0SlDrUkfKlZPU2NoDkvuyZRQ92ObxI=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Unacceptable Service and Inflexible Booking Policy\n\nOver the past few days, I have attempted to contact the hotel on more than 10 separate occasions, only to be met with unanswered calls. The front-of-house team has been entirely unresponsive, making it an incredibly tedious and frustrating process just to reach out for assistance. This lack of basic communication is unacceptable.\n\nIn addition to the poor reception service, I needed to amend my reservation due to changes in travel plans.  However, I was refused any flexibility to change my stay dates, which is both surprising and disappointing. I have never encountered a hotel, especially one claiming to be 5-star, that was unwilling to accommodate reasonable changes.\n\nI have also come across similar feedback from other guests during my stay, which only confirms that my experience is not an isolated case. Again, it does not reflect the standard expected of a 5-star establishment.\n\nI expected a much higher level of professionalism and customer care from your hotel especially when its part of Ascott group.\n\nThis is my returning stay and I’m utterly disappointed. If you’re considering to stay in a 5-star hotel in SG, please avoid this one. There are better options.",
      "time": 1744890593,
      "translated": false
    },
    {
      "author_name": "Nick Qi",
      "author_url": "https://www.google.com/maps/contrib/106798497620017022302/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWKV3S_krYS55WvMcPxf3eTeX5kJQfvh2vOWnrbcF1xdI5xvLHbnw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "A five-star hotel looks slightly dated outside but reasonably renovated inside.\n\nThe premise is located away from busy parts of the city but good for pillow time due to the relative quietness. Some reviews mentioned the noise from the pool but we stayed on the other side of the building so no ideas about that. There's Fort Canning MRT station 5 minutes walk away.\n\nThe staff at the front desk was helpful and friendly. The buffet breakfast was great with a full range of freshly prepared western and Asian food, helps starting the day with a happy tummy.\n\nThe room we stayed in was clean and neat. Not high-tech but good enough. The bed was quite comfortable, or perhaps I was just so tired from all day activities.\n\nWe had a busy schedule so we didn't get to enjoy the common facilities but the pool looked nice with a quick peek.",
      "time": 1742033268,
      "translated": false
    },
    {
      "author_name": "Dr Tinashe Dune",
      "author_url": "https://www.google.com/maps/contrib/109998846162530715839/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWd-NgDovE7CJkOEG83xXV1ET4w4RwExm7ea6z_ASpiRs3kzLnSWA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We had a truly luxurious stay, made extra special by the exceptional service of Xiao Li, the housekeeper on the 6th floor. She went above and beyond every single day to ensure our comfort, treating us with such warmth and care—it genuinely felt like being looked after by family. Every detail in our room was perfect, thanks to her attention and kindness. All the staff were wonderful, professional, and welcoming, creating an overall five-star experience from start to finish. We couldn’t have asked for a better stay and would gladly return. Thank you for making us feel so at home!",
      "time": 1742676409,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10911385085251710123",
  "user_ratings_total": 2071,
  "vicinity": "1 Unity Street"
}