{
  "formatted_address": "19 Rochdale Rd, Singapore 535834",
  "geometry": {
    "location": {
      "lat": 1.3435679,
      "lng": 103.883638
    },
    "viewport": {
      "northeast": {
        "lat": 1.344927730291502,
        "lng": 103.8850103302915
      },
      "southwest": {
        "lat": 1.342229769708498,
        "lng": 103.8823123697085
      }
    }
  },
  "name": "The Granary Catering Co.",
  "place_id": "ChIJaSp_BhQZ2jERsiYuMW2a9s4",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Geraldine Chang",
      "author_url": "https://www.google.com/maps/contrib/102758261201139124117/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWkwMJLhyVz1ZD6A-8RLk5ZbwfG7J3y-7wBnbEqYZQEvyJTAvA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I ordered the CNY set for my family. The food came on time with self heating trays that kept it warm throughout. Portions and taste were great. I would definitely order again for another gathering and try their other menus.",
      "time": 1738247310,
      "translated": false
    },
    {
      "author_name": "Paik Choo Tan",
      "author_url": "https://www.google.com/maps/contrib/103174007757508743199/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJoieOGlJn9huNt9Fev3lWDAfzDcHKwOY1PiZ4dpALRFb13HQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "The spread was sumptuous! All guests enjoyed the food. It came puncture and food was warm. A special shout out to the duck which was my favourite. Would definitely try other dishes next time!",
      "time": 1738249962,
      "translated": false
    },
    {
      "author_name": "Cheryl Oon",
      "author_url": "https://www.google.com/maps/contrib/105897527939474349328/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKBwO9R3P082rCY4P5rZiBbe83vcqWfOoxH6NdElp38saYNsg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Had the pleasure of working with The Granary Catering Co. for Checkpoint Theatre’s Secondary: The Musical Gala event on 21st April at Victoria Theatre, and we couldn’t be more thrilled with their service. From start to finish, the experience was nothing short of exceptional.\n\nFrom our initial consultation, Kelvin Chin from the Granary Catering Co. impressed us with his professionalism and attention to detail. He took the time to understand our needs and preferences, even helping to curate a high tea catering menu in our early planning stage. The planning process was seamless, and their team was always available to answer questions and provide updates.\n\nThe food was the highlight of the evening. Ultimately, we opted for their Greek menu which was nothing short of spectacular. The Granary Catering Co. delivered an exquisite array of authentic Greek dishes that catered to all dietary preferences, including vegetarian, vegan, and gluten-free options. Furthermore, they are all halal-friendly. Each dish was a culinary masterpiece, beautifully presented and bursting with flavour. Our guests raved about the Moussaka and the Fudgy Brownie for dessert.\n\nThe service was excellent — from delivery and setup to tear down. Kelvin and his colleague were courteous, attentive, efficient and professional throughout. The presentation of the food was elegant and every detail, from the table settings to the serving platters, was executed flawlessly.\n\nThe Granary Catering Co. made our Gala a memorable event. Their dedication to quality and excellence was evident in every aspect of their service. We received numerous compliments from our guests about the outstanding catering, and we couldn’t agree more. Highly recommend The Granary Catering Co. for any event. They are true professionals who are passionate about what they do, and it shows. Thank you to the entire team for making our Gala an unforgettable evening!",
      "time": 1715842482,
      "translated": false
    },
    {
      "author_name": "Achmad Firdaus",
      "author_url": "https://www.google.com/maps/contrib/118161072305646191048/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWyumy8bG8iA1tkpMS4igF8hmnGZMzubMTny7_fm4rTZw8GYhzO=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "We recently hosted our annual Appreciation Event for our community of mental health professionals at Tipo Pizzeria e Trattoria, with the support of Granary Catering, and it was an absolute delight from start to finish! The venue provided the perfect ambience for our gathering, combining a cozy atmosphere with modern elegance.\n\nKelvin was outstanding! He went above and beyond to ensure that every detail of our event was taken care of, from initial planning to execution. His professionalism and dedication truly made the entire process seamless and stress-free.\n\nThe catering, managed by Shaf, was exceptional. The food was not only delicious but also beautifully presented. Shaff and his team ensured that dietary preferences were accommodated with grace and efficiency, including labels that accounted for dietary preferences for ease of reference, earning praise from all our attendees.\n\nSpecial thanks to Ashylar and Fayyadh, the outlet managers, for their warm hospitality and assistance prior to and throughout the event. Their attentiveness and willingness to assist with our requests contributed significantly to the success of our gathering.\n\nOverall, Tipo Pizzeria e Trattoria exceeded our expectations in every way possible. We highly recommend them for any event or dining experience. Thank you to the entire team for making our event memorable and enjoyable!",
      "time": 1714260785,
      "translated": false
    },
    {
      "author_name": "Fleur Ong",
      "author_url": "https://www.google.com/maps/contrib/114573983336719195833/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjURISL_KSBOVh4QmlucRDDSb8bx-LEmJG3LcgpHhQK1oA2y9Ipn=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "Have had Granary catering for corporate events a couple of times and it never fails! Delicious, presentable and generous portions! The menu is also unique compared to the usual catering groups. Highly recommended!",
      "time": 1718108426,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "store",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14913277009851197106",
  "user_ratings_total": 43,
  "vicinity": "19 Rochdale Road"
}