{
  "formatted_address": "594 Serangoon Rd, Singapore 218208",
  "geometry": {
    "location": {
      "lat": 1.3152911,
      "lng": 103.8583038
    },
    "viewport": {
      "northeast": {
        "lat": 1.316672230291502,
        "lng": 103.8596143302915
      },
      "southwest": {
        "lat": 1.313974269708498,
        "lng": 103.8569163697085
      }
    }
  },
  "name": "The Fabulous Baker Boy",
  "place_id": "ChIJcaoTyaEZ2jERJ2YQqLbL6JU",
  "rating": 4,
  "reviews": [
    {
      "author_name": "AKG",
      "author_url": "https://www.google.com/maps/contrib/106185190001451251984/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW70zv5HnSXuiLiobcg_rDUngc-fqS4XUOJKcWw-jF3InYVXyCu=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "3 months ago",
      "text": "Checked out the café back when it was near Arab St (Aliwal Arts Centre) – their cake was decent, but now they’ve moved to 594 Serangoon, prices have gone up. Inflation hits cakes too, I guess 😅\n\nLaksa pasta?\nNot bad at $28 before ++\nI expected a Michelin experience, not just “pretty okay.”\nAlso, the portion seems to have gone on a diet compared to the photos from their Aliwal days.\n\nIf you’re in the area + super craving something sweet, the cake might be worth a try—but at $13++ per slice tho!!!\n\nTotal damaged: S$35 per pax, with only 1 main course.",
      "time": 1738501703,
      "translated": false
    },
    {
      "author_name": "Pat Grennan",
      "author_url": "https://www.google.com/maps/contrib/108510899957031097547/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLeWBFCW9h9jF_X824WRgLX8mk5GEUnYlPW_yOuVwqyixoMjw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Glad to see The Fabulous Baker Boy is re emerging. Ordered a couple of Christmas Fruit Cakes for pick up. Prompt simple ordering process and smoothly arranged pick up a couple of days later. A very tasty fruity Christmas cake that reminds me of Christmas cakes growing up in Ireland. Tastes of wholesome fresh ingredients and just the right level of sweetness. Be sure to watch out for the new Collaboration at Serangoon coming up in January. Juwanda is as the name suggests a fabulous baker boy full of passion tor his trade.",
      "time": 1733833664,
      "translated": false
    },
    {
      "author_name": "Evangelina Wee",
      "author_url": "https://www.google.com/maps/contrib/107809316949324743698/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU3XNUJB7f5Oxk94WlQbeMIy2OyjJZwFHxddm-hn9Y0KCF3uQ9y=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "This new iteration of TFFB has a distinctly Swedish flair and there’s lots to love about it. From lighter fare like smoked salmon on brioche (and other fancy options to heartier dishes like Swedish meatballs (eat your heart out, IKEA!), there’s really something for everyone. For lovers of the fabulous cakes, yes, these are still available, thank goodness! Finally, do not miss the selection of cocktails at v reasonable prices. Definitely will return!",
      "time": 1736501007,
      "translated": false
    },
    {
      "author_name": "Matthew Lee",
      "author_url": "https://www.google.com/maps/contrib/109397825257995094119/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIixaYVl0wJURE1BHYld5TXrWto_XXPpGQMy1A8MucbvABWdg=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "Heard this place is closing down soon so am here for the final memories.\nAm quite surprised it's very quiet when news came out saying they are going to close and it's not packed. Not sure why while I was eating and a few customers walked in they didn't really accept those customers. Not sure if the place was booked for an event.\nStaff here quite chill, they made me order at the cashier then said I could choose to pay upon ordering or after the meal. While I was waiting for my meal they told me they ran out of chicken whether I was okay to substitute it with chicken strips I said OK but eventually there was still a pretty decent chicken.\nI came here with a few options in mind but ended up ordering the waffles and chicken. I guess I made the right choice as I enjoyed it a lot. The waffles was hot and super crispy and a big chunk of well marinated chicken served on top.  I guess the side dish of the apple coleslaw was the surprise because it tasted so good. They didn't give extra maple syrup though I wished for more but was okay to have what was given to keep it less sweet.\nThe hibiscus apple slush was also very refreshing and big cup I couldn't finish on the spot so I took it out and finished along the way.\nA little disappointed didn't have chance to try their popular cakes, seems like there wasn't any available at the time of ordering, only cupcakes and slices of pound cakes.\nCome have a try before it closes (hopefully not for good and if they can find another spot elsewhere)",
      "time": 1701514758,
      "translated": false
    },
    {
      "author_name": "Lip Boon Lim",
      "author_url": "https://www.google.com/maps/contrib/100557206163515458182/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIVqJ7tHNJY_jhAqSVlZcQjDvPKfjBP_Ybb-bX20qjEtmme0w=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "2 years ago",
      "text": "The food and drinks are ok, but the vibe of the place is slightly off..  service felt indifferent and transactional. Overall, the place felt somewhat soul-less, for the lack of a better word.\n\nBtw laksa pesto pasta is very spicy, do avoid if you can take spicy food, the qr core e-menu neglected to mention that.\n\nThe sourdough bread is fine, do give it a go.",
      "time": 1682762285,
      "translated": false
    }
  ],
  "types": [
    "bakery",
    "store",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10802107691612268071",
  "user_ratings_total": 768,
  "vicinity": "594 Serangoon Road, Singapore"
}