{
  "formatted_address": "391 Orchard Rd, #01-02 Takashimaya S. C., Ngee Ann City, Singapore 238872",
  "geometry": {
    "location": {
      "lat": 1.3023641,
      "lng": 103.8345257
    },
    "viewport": {
      "northeast": {
        "lat": 1.303723430291502,
        "lng": 103.8358439302915
      },
      "southwest": {
        "lat": 1.301025469708498,
        "lng": 103.8331459697085
      }
    }
  },
  "name": "The Hour Glass Takashimaya - Official Rolex & Patek Philippe Retailer",
  "place_id": "ChIJHXFAbZIZ2jERGB7OUuQaztk",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Mike Chua",
      "author_url": "https://www.google.com/maps/contrib/106637402151004464748/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKVurBLAPz4PHMGBzwQXfA8EeuSBHJ-SCSOrNBkH56ewv7g4Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I recently had the pleasure of visiting Hourglass @ Takashimaya outlet was blown away by the exceptional service provided by Arthur Ng.\n\nArthur's knowledge of the watches was unparalleled, and his passion for horology was evident throughout our interaction. He took the time to understand my preferences and offered personalized recommendations, helping me find the perfect timepiece.\n\nWhat impressed me most was Arthur's attention to detail and his willingness to go the extra mile to ensure I was satisfied. He patiently answered all my questions, and his professionalism and courtesy made the entire experience a pleasure.\n\nI highly recommend Hourglass to anyone seeking a genuine and hassle-free watch-buying experience. Arthur's exceptional service has earned my loyalty, and I will definitely be returning.\n\nSpecial thanks to Arthur for his outstanding service!\"",
      "time": 1743407519,
      "translated": false
    },
    {
      "author_name": "Deanna Lee",
      "author_url": "https://www.google.com/maps/contrib/103118669163108947434/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXAEbK7t63GqGIVWOlBweZULHopz8we3LT1iowtUKeDEJECQRI=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I recently collected my long-awaited timepiece, and the experience was nothing short of exceptional. From start to finish, Fancy, who had been assisting me for weeks leading up to the collection, demonstrated unparalleled professionalism. She was incredibly accommodating to my schedule, courteous, and maintained excellent follow-through throughout the process.\n\nDuring the collection, her attention to detail stood out as she thoroughly explained the care instructions for my watch and guided me on my watch journey, even sparking my interest in exploring other pieces. Her friendly and affirming demeanor made the experience even more memorable.\n\nI also noticed the seamless teamwork and collaboration among the staff, who supported each other to ensure the purchasing process was smooth for every client.\n\nThe newly renovated space added to the overall experience with its aesthetically pleasing ambiance, making the visit even more enjoyable.\n\nKudos to Fancy and the entire Hourglass team for their outstanding service and dedication. I look forward to returning in the future!",
      "time": 1735477227,
      "translated": false
    },
    {
      "author_name": "Janice Chang",
      "author_url": "https://www.google.com/maps/contrib/117507888851045337326/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKb_bneccrnDbtnbuFLipBwBuM-hrEKqENYp7WTHpbvfUmH5w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "A very special thanks to Sarah for going the way to help me achieved one of my long awaited watch! My previous SA that attends to me has left the company , Sarah took over in assisting me. Words can’t express how I feel towards her. She really knows her stuff , knowledgeable and patience explaining details to me in professional way. My first Rolex from Hour Glass, hope to have more dealings with her. Pleasant experience here, exceptional service from Sarah. Greatly appreciate it, thank you once again Sarah!",
      "time": 1743320071,
      "translated": false
    },
    {
      "author_name": "Lillian Mui",
      "author_url": "https://www.google.com/maps/contrib/113041957135149268084/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLJywiT7d8VRsaROK0WGXkiJGe7yVqy5mY632vrdQIa1dZVHw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Wow we had an unforgettable experience at the Hour Glass at Taka. We contacted Thomas through the recommendation of a relative to help source a submariner date Rolex watch as a wedding gift for my son. Thomas was very helpful and professional. He asked us to first register interest first and invited us to the shop to view other watches. Couple of days later he shared good news. Rest is history. We are happy customers 😊🙏",
      "time": 1746268191,
      "translated": false
    },
    {
      "author_name": "Valerie Sim",
      "author_url": "https://www.google.com/maps/contrib/110108891119175198798/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVItSAQbXxAr43Z_a4fFUJ_jQeSWnbbdHQr4bjeCp2Hr3YTNwz_vg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I walked into Hourglass and was served by Kelvin, who was super friendly. I expressed my interest in a watch, and he offered me this piece. I immediately knew it was exactly what I wanted, and I managed to get my first dream watch from Rolex.\n\nThe service at the Taka store is absolutely amazing! Kelvin’s colleague, Raymond, has also been extremely helpful. I definitely recommend this outlet—be sure to reach out to Kelvin and Raymond!",
      "time": 1742644299,
      "translated": false
    }
  ],
  "types": [
    "store",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15694511319376862744",
  "user_ratings_total": 3460,
  "vicinity": "391 Orchard Road, #01-02 Takashimaya S. C., Ngee Ann City"
}