{
  "formatted_address": "1230 Upper Thomson Rd, Springleaf Nature Park, Singapore 787129",
  "geometry": {
    "location": {
      "lat": 1.4011635,
      "lng": 103.817596
    },
    "viewport": {
      "northeast": {
        "lat": 1.402626130291502,
        "lng": 103.8189527802915
      },
      "southwest": {
        "lat": 1.399928169708498,
        "lng": 103.8162548197085
      }
    }
  },
  "name": "The Lowe'f Shack ~ Artisanal Bakery @ Springleaf Nature Park la!!",
  "place_id": "ChIJ4_0NPRwZ2jER0oLsztaYpfY",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "LY",
      "author_url": "https://www.google.com/maps/contrib/110641421392640308427/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJKLdjXLQYoudovwia7bBq1vwx6kBHzDFTxs3I5orwe1E_raw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "5 months ago",
      "text": "1 Sep 24: Food was not bad. Ambience was serene.\n\nCoffee was abit bitter for me. Pomegranate Kombucha $7 was 👍. Portobello burger $15 and Cheese burger $18 was alright. Avo Toastie with pickle salad + scrambled eggs $19 pretty standard and portion was abit small.\n\nIf you sit nearer to the mist fans, you'll get some mist flying towards you when the wind blows. If it's your first time here, please remember to clear the dishes after finishing your meal.",
      "time": 1734535170,
      "translated": false
    },
    {
      "author_name": "K T",
      "author_url": "https://www.google.com/maps/contrib/112266821855972232932/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLVKDfAyIq4BHCxoO6NUr0r3l_zUOCmsGfWCrvGQmuoEFX8ig=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "10 months ago",
      "text": "Lovely place in the park. Feels like a picnic. There is a part where u can sit on the floor on a picnic mat even!\n\nbrioche bun in the food morning burger was super soft and fluffy, not oily and heavy.\n\nWish that there the burger do not have spicy mayo sauce and that there is more seats.\n\nWould definitely visit again.",
      "time": 1721452296,
      "translated": false
    },
    {
      "author_name": "Kelvin Chye",
      "author_url": "https://www.google.com/maps/contrib/117999709976505884094/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVbsb_XIGXOmHBUY0JITaak-MPWSnqYjAPvsQHiA5Iw1z3750Bk=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 1,
      "relative_time_description": "7 months ago",
      "text": "I would consider this place as very pricey especially considering its non aircon setting, uncomfortable seating, having to self service in collecting food and returning plates. Food wise, they do have some interesting choices, taste not bad, though quite limited.\nAn interesting observation is seeing there are quite a few idling service staff just standing around the serving counter doing almost nothing (other than those preparing food in the kitchen), since we have to quite self service ourselves anyway. Also other than a couple low couches, the other seats are all tall stools, and somehow immediately after leaving, I had a bad backache (I'm not the only one in my group that dine there that felt uncomfortable). Anyway curiosity satisfied, don't think I'll visit again.",
      "time": 1729409708,
      "translated": false
    },
    {
      "author_name": "Melissa Leong",
      "author_url": "https://www.google.com/maps/contrib/113345730471940578660/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWI4LfgSU945Lf5cnsPQ5Md2F6lYSYhIoiYeV-TJ6QwaJ50Osd1=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "Situated at the breezy and green environment,  only outdoor seating. Coffee wasn’t bitter and the house-made kombuchas we had were tasty. The food portions were just right, enough to feed us and left space for cake. The julius cake recommended to us was soft and not too sweet, won over a non-chocolate person like myself. The register wasn’t working well today so the owner/staff was a bit flustered but food and drinks were still being delivered speedily. Too bad we missed the breakfast timing else I would have tried the good morning burger.",
      "time": 1712738580,
      "translated": false
    },
    {
      "author_name": "TheSoloDiner",
      "author_url": "https://www.google.com/maps/contrib/113783246177205272344/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXEHYa61vGusHcX48TBk8FEq_nSd4XJg06hY2IMGl6TPs0Y3DJH=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "8 months ago",
      "text": "Breakfast Burger with Smoked Salmon @ Lowe’f Shack\n\nDespite being located near the stretch of upper thomson with loads of food places, this place is rather isolated from that. Being placed very close to a park, a decently large parking lot is available along with resting benches and toilets. It feels like a rest point. Very chill mood, if slightly hot.\n\nThe Breakfast Burger was delicious, the bread was sweet and fluffy, and the eggs were smooth and creamy. paired with the caramelized onions, sambal mayo and smoked salmon, it’s a filling and sumptous start to your day.\n\nThe madelines were also great, heated after ordering, it had a slightly crispy crust and was custard-sweet. The coffee was also really good, I got the Galaxy cold brew. The scent wakes you up immediately and had nice caramel notes. They all paired up really well.\n\nHowever the location is abit out of the way if you’re not driving, and your enjoyment of the place largely depends on the weather. It’s great if you plan a jog around the nearby park and grab a meal after, though the price is fair for the quality it’s not something you can probably have often, the location also makes it hard to encourage travelling all the way here for a meal if you’re not searching for good food and you don’t stay close by. Otherwise a nice place!\n\n8/10",
      "time": 1725602606,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "bakery",
    "restaurant",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17772779552849560274",
  "user_ratings_total": 598,
  "vicinity": "1230 Upper Thomson Road, Springleaf Nature Park"
}