{
  "formatted_address": "333A Orchard Rd, #04-24 / 25, Singapore 238897",
  "geometry": {
    "location": {
      "lat": 1.3020903,
      "lng": 103.8363317
    },
    "viewport": {
      "northeast": {
        "lat": 1.303595580291502,
        "lng": 103.8377696302915
      },
      "southwest": {
        "lat": 1.300897619708498,
        "lng": 103.8350716697085
      }
    }
  },
  "name": "The EyeClinic by Dr Cheryl Lee",
  "place_id": "ChIJCZCpc5EZ2jERWWVN6mGA7vg",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Joycelin Khoo",
      "author_url": "https://www.google.com/maps/contrib/115900016135650166302/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXKEc3xhJ-X4vllvFU9X7spEEJsmHrFvj83MX9b0rLTb0GWyPh_=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I recently underwent an ICL procedure with Dr. Cheryl Lee and am thrilled with the results. Waking up to crystal clear vision without glasses feels surreal.\n\nFrom the first consultation, Dr. Cheryl and her team were professional, patient and incredibly reassuring - explaining the entire process in detail and addressing all my concerns so I could make an informed decision. There was no hard selling and cost wise, it is reasonable and in line with market rates.\n\nIt's a bonus knowing that Dr. Cheryl is one of the leading ICL experts and that I am in safe hands. Multiple scans and measurements (quick and pain free ones!) were taken prior to surgery to ensure the best possible outcome. The surgery itself was super smooth and efficient and there was no discomfort at all.\n\nNo more:\n- Bringing an extra pair of glasses when you go on holiday\n- Walking around blind and trying to feel for your glasses because you forgot where you left them\n- Having your glasses fog up or slip off during a workout\n- Swimming \"blind\"\n\nDefinitely recommend this to anyone considering vision correction. Dr. Cheryl will have you singing that Johnny Nash song -  \"I can see clearly now...\"",
      "time": 1744879444,
      "translated": false
    },
    {
      "author_name": "#MTマリナ",
      "author_url": "https://www.google.com/maps/contrib/117256589245364060453/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWiWQkz64cOJDvzpC0QEoSi80v_m5PP2bH4pjowryav0jivHPhD=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I had my ICL surgery with Dr. Cheryl Lee last year, as well as several sessions for dry eyes, and I couldn’t be happier with my experience. After visiting multiple clinics, Dr. Lee stood out as the best choice for me. She is genuinely caring, takes the time to listen, and is incredibly knowledgeable. Her enthusiasm and ability to put patients at ease made me feel comfortable throughout the process.\nWhile her check-ups might seem quick, her expertise in ICL surgery is undeniable. She’s always ready to explain the procedure in detail and answer any questions.\n\nI’ve struggled with poor eyesight since I was young and had seen countless doctors and surgeons over the years. After extensive research, I chose Dr. Lee, and it was the best decision I could have made. The surgery itself was painless and smooth, and it has truly changed my life.\nDr. Lee’s staff is highly professional, and many have been with her for years, which speaks to the excellent care and continuity she offers. She’s also the only ophthalmologist I’ve met who genuinely addresses dry eye issues—a condition that many other doctors tend to overlook.\nWhile Dr. Lee’s services are on the higher end price-wise, the quality of care and life-changing results make it more than worth it. I wholeheartedly recommend Dr. Cheryl Lee to anyone considering vision correction.",
      "time": 1734801640,
      "translated": false
    },
    {
      "author_name": "Jason Chan",
      "author_url": "https://www.google.com/maps/contrib/100407412685225942720/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLemoz_RJz10JkbM95hC7cTr5RCk6IfWYOU6yHLnz5CH9SC5I4=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "I underwent ICL surgery by Dr Cheryl last year (2024) which went very smoothly with no complications. As my myopia was quite severe at close to 1,000 degrees, being able to function without glasses or contact lenses was life-changing.\n\nAnyone with high myopia should strongly consider ICL surgery by Dr Cheryl.",
      "time": 1746510229,
      "translated": false
    },
    {
      "author_name": "angela low",
      "author_url": "https://www.google.com/maps/contrib/105240522000640599746/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLNuj4fPQSzoNgj7kP78BVThbSqXrRYaL-fOrb3X4paQ1mzZA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Did my ICL surgery with Dr Lee last year and no regrets! Dr Lee is very knowledgeable in her field and has a knack for putting her patients at ease. I was very nervous during the surgery however her constant reassurances made the whole process a lot easier for me. Her team was also very patient and accommodating throughout my whole ICL process. It feels amazing to be able to see perfectly without needing to look for glasses in the morning. I would definitely recommend coming here!",
      "time": 1737353298,
      "translated": false
    },
    {
      "author_name": "Justin Ang",
      "author_url": "https://www.google.com/maps/contrib/106264077262071235782/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKqcmD0ZkkGtFWSLRqoZVPkDAXa8CdlbKyFzkOVX3fJ2I1Pdg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I had done LASIK in my early 30s and now my short-sightedness has become worse. I decided to do ICL instead as it allows reversal and re-corrections in future. I just did my ICL about a month ago and the experience was seamless and smooth. Dr Cheryl knows her stuff very well and will not influence  you to provide the expensive treatments, but only what you really needed. The surgery only took about 5-10mins per eye and her skills were smooth and steady. No pain at all, only some eye pressure which is normal.\nIn addition to that, her staff were also very patient, professional and helpful in ensuring that I get the right degree of lens required, especially when I am also suffering from long-sightedness and want to choose a degree that it is enough for me to see far but do not compromise too much on my near vision. Her staff are also been accommodating and able to help find the best time slot to meet up with Dr Cheryl, especially when we need to have 3 follow-up sessions. They will also ensure to remind and confirm the appointment a few days before.\nIn fact, my wife has also done her ICL with her. We were both very glad that we had our vision corrected before our ski trip. Thanks Dr Cheryl and team!",
      "time": 1741100926,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17937415523894388057",
  "user_ratings_total": 277,
  "vicinity": "333A Orchard Road, #04-24 / 25"
}