{
  "formatted_address": "332-338 Tanjong Katong Rd, Singapore 437107",
  "geometry": {
    "location": {
      "lat": 1.303932,
      "lng": 103.896439
    },
    "viewport": {
      "northeast": {
        "lat": 1.305302980291502,
        "lng": 103.8978521802915
      },
      "southwest": {
        "lat": 1.302605019708498,
        "lng": 103.8951542197085
      }
    }
  },
  "name": "The Ice Bath Club - East Coast",
  "place_id": "ChIJ8W3Hq_QZ2jERFtw_lOdJaF8",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Win Tai",
      "author_url": "https://www.google.com/maps/contrib/114240320617932935405/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLf9e3v6vEX2fL1PgwBfCs37p7DECmX3xrUdI0BzXppos2inw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "The entire staffing crew at east coast is exceptional. The service quality is as good if not better than Singapore airlines. The kitchen crew is amazing they are professional chefs and can whip up great food. Waiting for the launch of their new sour dough by kobashi. I was lucky to try their sample one day. The\nchef knew exactly how to make it crispy on the outside and soft inside..  the coffee is great too just right after a dip in cold plunge for breakfast",
      "time": 1747191111,
      "translated": false
    },
    {
      "author_name": "Sheila Yang",
      "author_url": "https://www.google.com/maps/contrib/100780439323296365746/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJOf7LGPV1eywfxaUFH7tH01ui2oyHEchj6RGxGbQ9U16lSwg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "The sauna facilities were what first attracted me to sign up for a membership. After being a daily user for two months, I feel it’s time to write a review — I’ve benefited so much from both the sauna and the café.\n\nThe sauna is impressive, and their maintenance and hospitality are top-notch. Joanne from customer service, along with Hemilia and her team, are always ensuring guests' comfort. As pioneers of a traditional sauna club-like experience, they truly take care of everything: clean towels, well-maintained facilities, proper sanitization, and warm hospitality — things that are hard to replace. Being there daily, I also witnessed how quickly and attentively they troubleshoot any issues.\n\nThe café is another highlight. Coffee is always hot, consistent, and excellent. Their large printed menu (no QR code needed!) is a nice touch. The space has a coworking-style vibe, often filled with working adults during the day, with power plugs and Wi-Fi available on request. They also have an impressive book library corner filled with growth mindset books, perfectly matching the café’s warm and motivating atmosphere. Families with prams and children are welcome too, with a cozy toys and books corner.\n\nAccessibility is another plus. It’s conveniently located near the Central Area, and they offer a bicycle stand inside the café for secure parking (plus extra space outside). There's even a welcoming bench out front where you can take calls. While a small ramp at the entrance would be a helpful improvement, it’s a minor thing overall.\n\nTheir membership pricing is affordable considering the health benefits and exceptional hospitality. They’ve built a lovely community of both locals and expatriates. Early weekday mornings are peaceful if you want quiet time, while evenings are lively and social. The space is curated at night with warm, dimmed lighting for a truly relaxing atmosphere.\n\nWhile the events and club programmes offered so far have been somewhat repetitive during the short time I’ve been frequenting the club, I’m excited to see more variety, vibrancy, and new club partnerships in the future. I’ll be looking out for more of their community offerings to complement this wonderful space.",
      "time": 1745992095,
      "translated": false
    },
    {
      "author_name": "Claire",
      "author_url": "https://www.google.com/maps/contrib/111598834832249485186/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVXHTfnk68gFSpRGpyrzV8exNw39TVho_peVXJYMh3PykEGlAKj=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "Great experience at the Ice Bath Club!! Aziz gave us a great introduction & not only did he standout for his exceptional customer service but also for his invaluable knowledge! He taught us effective breathing techniques and the perfect routine to make the most of our experience. His friendly guidance makes every visit enjoyable. If you’re looking to elevate your wellness journey, I highly encourage you to check out this place —you won’t regret it!",
      "time": 1747485186,
      "translated": false
    },
    {
      "author_name": "Patty Lazatin",
      "author_url": "https://www.google.com/maps/contrib/100130186866666263740/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVlluR0HrXZoeg-fOlqbYQtkH96gQOfQLThcCo_4Nr0JbjBa028=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "First time to come and honestly a great introduction to ice baths. Staff is incredibly friendly and approachable without being too in your face. The prompts around area help newbies figure out what to do on their own. But lots of folks to talk to as well. Amenities are great. Their coffees great too! Will definitely be back.",
      "time": 1738208318,
      "translated": false
    },
    {
      "author_name": "Hey Me",
      "author_url": "https://www.google.com/maps/contrib/111658838500438841765/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWtUiol_VmIxHOcypxutvwCrhNfreo3u9qxHcusN1Z0DUOr1Ao=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "This place has become my go-to a few times a week— nothing better after a tough workout! I always finish off with their Nutzman smoothie (seriously, it’s amazing), followed by a dip in the cold pool. The lounge music and chilled vibes make it feel more like a mini getaway😀. Highly recommend it for anyone who trains hard and wants to recover smarter!",
      "time": 1735440742,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "health",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6874826090154548246",
  "user_ratings_total": 131,
  "vicinity": "332-338 Tanjong Katong Road"
}