{
  "formatted_address": "29 Tanglin Rd, Singapore 247911",
  "geometry": {
    "location": {
      "lat": 1.306006,
      "lng": 103.8260475
    },
    "viewport": {
      "northeast": {
        "lat": 1.306897880291502,
        "lng": 103.8277286302915
      },
      "southwest": {
        "lat": 1.304199919708498,
        "lng": 103.8250306697085
      }
    }
  },
  "name": "The St. Regis Singapore",
  "place_id": "ChIJb9RocosZ2jERYG-hayjKLIo",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Johan Agus Sadikin",
      "author_url": "https://www.google.com/maps/contrib/116698553892032365347/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK27n5LrYdLFF9R3bmrghX4QbX709305PxPe-9mlFG7a3e8Ug=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "One premium hotel in Orchard Singapore which is owned by Marriott group. The room is amazingly big and spacious. The breakfast is also good in this hotel. Although the variety is not so many, but the taste of the food is perfect. Room service is also very nice. The location of this hotel is at the edge of the Orchard shopping area, but it is still reachable by walking. Overall, 5/5 is my review for this hotel.",
      "time": 1747061692,
      "translated": false
    },
    {
      "author_name": "Datuk David Chong",
      "author_url": "https://www.google.com/maps/contrib/117670813392867762263/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWQelY99GX1_EPLjwKegHOnmu7rLrDBG_m_ulWg2OCkH8BIyn2DYw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "2 weeks ago",
      "text": "This is our go-to Marriott property in Singapore, having stayed here numerous times over the years. As an Ambassador Elite we were upgraded to the Nate King Cole Suite which while spacious does look and feel a bit dated, like the entire hotel. It remains our hotel of choice because of the spaciousness of the rooms. While there is no lounge, elites are offered 2 complimentary drinks at the Astor Bar in the evenings with some finger food.",
      "time": 1746437150,
      "translated": false
    },
    {
      "author_name": "ARTYOS",
      "author_url": "https://www.google.com/maps/contrib/115103328030608721581/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVZWNVEqL3J8k-IWILU4mCUEwE7evQRzSnd20ZHdpsw50NMbauC=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "I recently stayed at the newly renovated St. Regis Singapore, and the refreshed guest rooms truly feel like a brand-new luxury hotel—elegant, sophisticated, and thoughtfully updated.\n\nWhile the main lobby is still under renovation, which makes check-in and check-out slightly less convenient at the moment, I believe the transformation will soon be complete, and I’m looking forward to seeing the finished space.\n\nOne of the highlights of my stay was the access to the spa facilities. In-house guests can enjoy 45-minute sessions in the steam room, sauna, and jacuzzi. Even in that short time, the experience was refreshing and revitalizing.\n\nI look forward to revisiting once the hotel is fully reopened to enjoy the complete St. Regis experience. A beautiful stay overall.",
      "time": 1745592899,
      "translated": false
    },
    {
      "author_name": "Linus Y L Ang",
      "author_url": "https://www.google.com/maps/contrib/110507591095731693668/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWdq_ltMK9NCktkfqy7Bolsn2-D_TkKMBnLkQ-CjkFiAcaLaykf=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "This was our second stay at The St. Regis Singapore as a family, and once again, the experience exceeded our expectations. From the moment we arrived, we were warmly welcomed and made to feel truly valued—not just as guests, but as returning members of the Bonvoy family.\n\nThe service throughout our stay was impeccable. Every staff member we encountered was courteous, attentive, and went the extra mile to ensure our comfort. What stood out most was how genuine the team was in their hospitality. Our children were especially well taken care of, with thoughtful touches that made them feel just as special as the adults.\n\nWe also experienced a minor hiccup during our stay, but the way the hotel handled it was nothing short of exemplary. The service recovery was swift, sincere, and handled with the hallmark professionalism and grace that St. Regis is known for. It’s in these moments that the true caliber of a hotel shines through, and St. Regis absolutely delivered.\n\nAs a Bonvoy member, I was truly touched by the level of recognition and appreciation shown. It’s this kind of consistency and excellence that keeps us coming back.\n\nThank you once again to the entire team at The St. Regis Singapore. We left with full hearts and look forward to our next visit.",
      "time": 1743043364,
      "translated": false
    },
    {
      "author_name": "Tyler Conrad",
      "author_url": "https://www.google.com/maps/contrib/105099388518125223310/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWF2StasmEbwhp5O2nLHEKduuOMiuuTDzDpO8YCGtl9Bzn_WAa6=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Gorgeous property just off of Orchard Road! My wife and I were upgraded to a slightly nicer room based on my Marriott Platinum status and enjoyed complimentary breakfast which was excellent. The highlight for us was the fresh juice bar. Special thanks to all of the friendly staff that made our stay memorable!",
      "time": 1746395871,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9956555151162568544",
  "user_ratings_total": 3784,
  "vicinity": "29 Tanglin Road"
}