{
  "formatted_address": "1-23, Sunway Citrine Hub, Sunway City, 79250 Iskandar Puteri, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.3915243,
      "lng": 103.6387015
    },
    "viewport": {
      "northeast": {
        "lat": 1.392910130291502,
        "lng": 103.6400231802915
      },
      "southwest": {
        "lat": 1.390212169708498,
        "lng": 103.6373252197085
      }
    }
  },
  "name": "The Warung Kita",
  "place_id": "ChIJUfYxC1cP2jERlDzeTithYCU",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Denis",
      "author_url": "https://www.google.com/maps/contrib/107269275231105198912/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXGcb2XjZu3-SFeDVPGJrkwVnEF4Uv62jV2ZynRo-y070N2TgazBA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Lovely space for lunch 😄😋\n\nWe tried Ayam Rendang, beef and kuey teow for lunch!\n\nSyrup Drinks are ABIT sweet for me but the service and food comes pretty fast.\n\n5 of us we visited about 12noon and food came in about 8 mins after we ordered",
      "time": 1743653697,
      "translated": false
    },
    {
      "author_name": "Sally Lee",
      "author_url": "https://www.google.com/maps/contrib/106215866297684705142/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLkT-RHPgkH9-LhfOBAzt_sMXv6Yy4Vaob6AIGZAy6w1QKdQg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "It was our first time here, and we were impressed by the beautiful view and the comfortable outdoor seating. The service was excellent as well.\n\nWe visited for lunch and ordered the Kambing rendang, Ayam Rendang, and Korean Cheese Noodles. We enjoyed all the dishes, though the lamb was a bit tough. However, the flavors were delicious!",
      "time": 1742624548,
      "translated": false
    },
    {
      "author_name": "Intan Syafira Rostam",
      "author_url": "https://www.google.com/maps/contrib/106383280795331501799/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKSbhPjEXZMWzo0u8060PqiTD8ZSep2FIjiidxYVj3edtS_TQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "2 weeks ago",
      "text": "We decided to visit this restaurant after seeing their paid collaboration with a KOL on TikTok. The place itself is undeniably pretty—cozy interior, aesthetic setup—so we were a little surprised to see how quiet it was when we walked in.\n\nWe ordered a Spaghetti Carbonara for me, and my husband went for the Fried Chicken Chop with Truffle Fries. For drinks, we had Orange Juice and Apple Asam Boi. It took around 15–20 minutes just for the drinks to arrive, even though the restaurant wasn’t busy.\n\nWhen the drinks came, my husband’s orange juice tasted like watered-down Tropicana Twister—like it had been diluted two or three times. Not ideal.\n\nThe food came out in parts. My Carbonara arrived first. It was okay—nothing special, just decent comfort food. But my husband had to wait another 20–30 minutes for his meal, which unfortunately came burnt. The lighting inside was dim, but even the camera picked up how charred the food looked. The truffle fries were overly oily and lacked the flavor we’ve come to expect from similar dishes elsewhere.\n\nOur bill came to RM77 for two. For the tastewise, wait time, and overall experience, we left feeling disappointed. Unfortunately, we won’t be returning.",
      "time": 1746144951,
      "translated": false
    },
    {
      "author_name": "Paddlegood",
      "author_url": "https://www.google.com/maps/contrib/106974524144368081671/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJzw1Dyqx3elD3_5CYiXQE1P0r4aSg3138e2_aN9Dd8q1XA3A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We love this place, we always bring our guests here- buffet or ala carte. The food never disappoint, be it western or local. Dishes were prepared with care with beautiful plating. Surprisingly, even a simple dish like carbonara exceeds our expectations. Shiny, creamy, al dente well seasoned pasta. One of the best place to have assam pedas too. Service people are excellent, attentive to our needs. Beautiful aesthetic insta-worthy decor, nice music, kid-friendly, ample carpark, clean. Menu does not have overwhelming variety but they keep updating their menu which is refreshing! Drinks here are good too! Would love to gatekeep, but here’s the review.",
      "time": 1743759742,
      "translated": false
    },
    {
      "author_name": "fearrow",
      "author_url": "https://www.google.com/maps/contrib/114871863174076338408/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVSsmj67LApWPmJRJZNc0nx_gV3wfz3yCm77xsfTz0ktDosZFE=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "Brought my family to The Warung Kita for breakfast, and it turned out to be a great start to the day! They offer a breakfast buffet at RM24, but it’s not your typical self-service style. Instead, you order your dishes, and they’re freshly prepared and served to your table—a nice touch that keeps the experience more personal.\n\nThe food? Simply delicious, especially the sambal, which really stood out. Every bite was packed with flavor, and I couldn’t resist ordering more after every dish. Let’s just say my wife wasn’t too amused by my endless stream of orders—she gave me that look. Hahaha!\n\nThe in-laws were happy, which is always a win. They enjoyed the food and the overall atmosphere. It’s safe to say this place has earned a spot on our “must revisit” list.",
      "time": 1735025710,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2693259415802231956",
  "user_ratings_total": 492,
  "vicinity": "1-23, Sunway Citrine Hub, Sunway City, Iskandar Puteri"
}