{
  "formatted_address": "246C Upper Thomson Rd, Singapore 574370",
  "geometry": {
    "location": {
      "lat": 1.3537016,
      "lng": 103.8344417
    },
    "viewport": {
      "northeast": {
        "lat": 1.355002080291502,
        "lng": 103.8357450302915
      },
      "southwest": {
        "lat": 1.352304119708498,
        "lng": 103.8330470697085
      }
    }
  },
  "name": "Think Teach Academy (Thomson)",
  "place_id": "ChIJt3HxvjoX2jEReZOICCWXnas",
  "rating": 5,
  "reviews": [
    {
      "author_name": "SH Leow",
      "author_url": "https://www.google.com/maps/contrib/107170460885076639251/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJlLW5WH16spLFQwZZ0zfTYGk2NhXUGZWvMxvr188eGrqyMXg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I would like to express my sincere appreciation for the outstanding effort Ms. Fiona has put into helping my daughter improve her math skills. Under her guidance, my daughter’s math grade has risen significantly, achieving an AL2 in her PSLE – a tremendous accomplishment that we are truly grateful for.\n\nMs. Fiona's teaching style is both thorough and encouraging, making complex concepts more accessible and ensuring that my daughter built confidence in her abilities. Her patience and tailored approach to my daughter's learning needs have been instrumental in this improvement. Beyond just the curriculum, Ms. Fiona instilled a sense of discipline and a proactive attitude towards learning that was crucial in this academic success.\n\nWe are thrilled with the progress my daughter has made and couldn't have asked for a better educator to help her reach her full potential. I am confident that Ms. Fiona’s dedication and expertise played a vital role in my daughter's PSLE results, and I will highly recommend Think Teach Academy to anyone seeking quality education.",
      "time": 1733026357,
      "translated": false
    },
    {
      "author_name": "Le Thi Dieu Ha Windy",
      "author_url": "https://www.google.com/maps/contrib/107507425250096616957/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIxvxjUwUCjuJpT5-lY8MVRCjgFqVYy8a6AI5UPlvGtEOJ8AQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "My daughter was with TA for 2 years. I would like to send my appreciation to teacher Dawn and teacher Nicole who helped her alot for PSLE exam preparation. She took the online course due to far distance of our house from physical center. Today i received her result for AL4 science and AL1 in Maths, i am delighted and feel thankful for her teachers’ support. I hope TA will open center near our house so that my younger can get  benefit from the course too. Wish TA all the best and please help more students in this stressful process.",
      "time": 1732123384,
      "translated": false
    },
    {
      "author_name": "Felicia Go",
      "author_url": "https://www.google.com/maps/contrib/105878012979643016775/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK344gSpCaGLnGCvRfk8dwUOnjhPijODSCRCtASU_WJNJkKsw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I highly recommend Teacher Dawn as a tuition teacher. Over the past two years, she has been incredibly dedicated, patient, and effective in helping my child improve his understanding of the science subject. The center materials is useful and up to date, and follow PSLE standard. Teacher Dawn always gives supportive learning environment that makes complex concepts easier to grasp. If you’re looking for a knowledgeable and compassionate teacher, I’m confident you’ll benefit greatly from her expertise!",
      "time": 1732092265,
      "translated": false
    },
    {
      "author_name": "lee teng teng",
      "author_url": "https://www.google.com/maps/contrib/115911769178446459490/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXYjWU_W6Q84YfHKuXCZe2SdyVXllIqOXu8tRo3tENwho2gxRvC1w=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "My girl took Mastery Writing class in P5 and P6 under Tr Algene to improve her composition as I felt her school was not teaching her much on composition writing. She enjoyed Tr Algene's lessons very much. What we like about TTA approach is there is no copying of compositions, no memorizing of phrases. All my girl did was to attend the weekly lessons and somehow all the storylines and phrases were ingrained inside her. She scored well for her school composition papers in those 2 years. I think this course has helped pulled up her English PSLE grade. Thank you TTA and Tr Algene. They are also very helpful in answering any grammar questions I have.",
      "time": 1732110884,
      "translated": false
    },
    {
      "author_name": "Fel R",
      "author_url": "https://www.google.com/maps/contrib/115059273464789239334/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLHFCbrguqkbv8ABLlFDMElmcu2YJNblSO4htragUnLRC04iw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "My daughter needed a boost to help with her creative writing for PSLE last year.  I signed her up for an online PSLE Creative Writing intense course with Teacher Algene a few weeks before her paper.  Teacher Algene / Think Teach's methodology of teaching Creative Writing and getting the kids to think about adapting a topic to different storylines was very helpful.  It made a big difference to my daughter's confidence level  for her Paper 1 - a huge bonus that the storyline / content which Teacher Algene went through was similar to the PSLE topic! Thank you Think Teach!",
      "time": 1720505096,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12366206337142002553",
  "user_ratings_total": 24,
  "vicinity": "246C Upper Thomson Road, Singapore"
}