{
  "formatted_address": "11 Bidadari Park Drive, Mall, #02-03/05/06/07 The Woodleigh, Singapore 367803",
  "geometry": {
    "location": {
      "lat": 1.3379191,
      "lng": 103.87233
    },
    "viewport": {
      "northeast": {
        "lat": 1.339264930291502,
        "lng": 103.8737103302915
      },
      "southwest": {
        "lat": 1.336566969708498,
        "lng": 103.8710123697085
      }
    }
  },
  "name": "Thomson Specialists (Woodleigh) - Day Surgery",
  "place_id": "ChIJD91KtXgX2jERa5tluHxOfLE",
  "rating": 3,
  "reviews": [
    {
      "author_name": "Sue Than",
      "author_url": "https://www.google.com/maps/contrib/102803749258385660902/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUDGp8QpYUcvg3uNFI9OtkL4NgG8kH3kv8ort5rnQ7tI9pqbi4G=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "We're so happy with Dr. Don Pek and the team at Thomson Medical! My mom’s cataract surgey was 100% cover by Prudential insurance! We didn’t have to pay anything, and the staff explain everything very clearly. It was super easy for us to decide with the surgery.\nMy mom only speaks hokkien, and she was very scare of surgey. But dr.pek and the staff were so kind & patient with her. They took their time to explain everything so she could understand. They didn’t rush her and made sure she felt comfortable before anything start.\nAt first, we only came for an eye check-up because my mom was seeing blurry. We just want to see if she had cataracts. But after dr.pek explain everything to us, we felt safe and decide to do the surgery on the same day. He was very nice and answered all our questions, especially the risks coz we were concern.\nThe surgery was super smooth! My mom said it didn’t hurt at all! The staff took great care of her before and after the surgery. They kept checking on her to make sure she was okay.\nNow, my mom can see so much better! Was always considering Thomson Medical for small and major surgies. They are so kind and helpful! Thank you team again.",
      "time": 1739259572,
      "translated": false
    },
    {
      "author_name": "L W",
      "author_url": "https://www.google.com/maps/contrib/107930613877050622471/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUxyPkOQv-yUWOAiJFSbxDCXIgYpIg_QGr8eiRO9pJG_v3f9fP8=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "in the last week",
      "text": "Did my cataract op at this clinic and experience at the clinic was good. However, their customer service ends after the surgery. Payment was made on surgery day and weeks after insurance co pay out to the clinic, no refund was done. Multiple attempts to contact them were unresponsive and I was also asked to directly email to their finance person to follow up instead. Not sure when I will get my money back. My first bad op experience, not recommended.",
      "time": 1747786350,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12789183339401943915",
  "user_ratings_total": 2,
  "vicinity": "11 Bidadari Park Drive, Mall, #02-03/05/06/07 The Woodleigh"
}