{
  "formatted_address": "8 Sinaran Dr, #06-04 Novena Specialist Center, Singapore 307470",
  "geometry": {
    "location": {
      "lat": 1.3203778,
      "lng": 103.8448841
    },
    "viewport": {
      "northeast": {
        "lat": 1.321469030291502,
        "lng": 103.8461689802915
      },
      "southwest": {
        "lat": 1.318771069708498,
        "lng": 103.8434710197085
      }
    }
  },
  "name": "Thomson Specialist Skin Centre - Dermatologist, Acne, Eczema, Psoriasis, Skin Cancer, Hive, Hair Loss, Scalp Issues, STIs",
  "place_id": "ChIJxcv_ZucZ2jER_4nHjMq32Lo",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Wynn Lau",
      "author_url": "https://www.google.com/maps/contrib/102828294140703144504/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU_Ba2B4ImXbL94a8glmtwFQLcV1O91iCxHGZltgp1YRHYZy5NIzA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I’ve had nothing but an amazing experience with Dr. Tan and their team. From the moment I walked in, the staff was warm, professional, and efficient. Dr. Tan took the time to really listen to my concerns, explain the treatment options clearly, and made me feel completely at ease. Their knowledge, attention to detail, and genuine care made a huge difference in my skin. I’ve seen incredible improvements and finally feel confident again. Highly recommend to anyone looking for a skilled and compassionate dermatologist!",
      "time": 1744705097,
      "translated": false
    },
    {
      "author_name": "Jing Yi Tee",
      "author_url": "https://www.google.com/maps/contrib/106338800926625453909/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKELbzw761Kf-s9k0RZ_PV637inP5gh_HAcDB8uPGeea8-BWQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Dr. Tan Hiok Hee and his nursing team demonstrate both exceptional professionalism and remarkable patience when caring for their patients. Their expertise in treating skin conditions is clear. I first became a patient of Dr. Tan's during my teenage years at the National Skin Centre. More recently, I recommended him to my best friend, whose severe bacterial skin infection he successfully treated. Now, even my daughters trust his guidance for their skincare needs.",
      "time": 1745029651,
      "translated": false
    },
    {
      "author_name": "Yuki Jes",
      "author_url": "https://www.google.com/maps/contrib/114969292093167306209/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKEm1dPLRVJJfqOKaCVLp-ImNa1bmqwg0AggpzZ37znqcz5gg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Dr Tan is an experience and excellent doctor.   my mum's skin allergy problems and my niece eczema issues have been significantly improved.   Thank you for Dr Tan patience and providing the best advice and treatment.\n\nHis clinic staffs were friendly, helpful and welcoming and of great help during appointments reschedule.  Thank you for their staffs nurse assistance during my elderly mum visits.\n\nI highly recommend anyone who has skin problem/issue to visit Dr Tan.",
      "time": 1741410372,
      "translated": false
    },
    {
      "author_name": "Mimax",
      "author_url": "https://www.google.com/maps/contrib/112688895168867225357/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVqkmG60U3Z-YgSOJs1bRelyjUNZ102F2qocPao8duJb6xStCEn=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "I brought my daughter here for her acne problem. Dr Tan is very detailed and professional. He explained all the treatment options to us, and suggested the best based on our lifestyle and preference. He is not pushy as all. My daughter's acne was cleared after 2 weeks of treatment.",
      "time": 1745924815,
      "translated": false
    },
    {
      "author_name": "Kaylyn Chen",
      "author_url": "https://www.google.com/maps/contrib/104904620872858952242/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKUFH83lFUgQCGu_9ujfNAZ1D9YFIY91t06G_5xfqGo3IMDpg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "I went to Thomson Skin Specialist after reading Google reviews. The doctor here was really disappointing. I had a small inflamed pimple on my hand that required surgery to remove on the same day. During the consultation, the doctor barely spoke with me and said it wasn't a big issue. After the procedure, I was told to return for a follow-up in a week, and the doctor said it was healing well! But the wound wasn't fully healed because it had only been a week, and I trusted the doctor’s words. After two or three months, the wound started to darken and harden! I kept observing it for a while and then went back to consult the doctor again. He told me it needed to be re-excised and that a bigger hole had to be made for it to heal. The wound was now larger than before the procedure, and it itched and hurt! Do I really need to go through this pain again? It’s ridiculous! The first time, he made a deep incision, and now he wants to cut again? The pimple was less than 1.5 cm, but after the procedure, it became 2 cm. This has been the worst experience!",
      "time": 1742983345,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13463713166597261823",
  "user_ratings_total": 65,
  "vicinity": "8 Sinaran Drive, #06-04 Novena Specialist Center"
}