{
  "formatted_address": "Paragon Medical Centre, 290 Orchard Rd, #19-01, Singapore 238859",
  "geometry": {
    "location": {
      "lat": 1.3043067,
      "lng": 103.8356995
    },
    "viewport": {
      "northeast": {
        "lat": 1.305599930291502,
        "lng": 103.8373689302915
      },
      "southwest": {
        "lat": 1.302901969708498,
        "lng": 103.8346709697085
      }
    }
  },
  "name": "Thomson Women's Clinic/Specialists (Paragon) - Female Gynae, Pregnancy, Health Screening, Fibroid, Cyst, Family Planning",
  "place_id": "ChIJoavrZ-cZ2jERxEEN2hwptXE",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Huaile Liong",
      "author_url": "https://www.google.com/maps/contrib/111607222080285228835/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKhUej5LbZu9AZxxmnpHlkykNpPX5VWCSPrgYIlhfu2eJaK=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Dr. Sharon and her assistant, Nina, have been with my wife and me since week 5 of her pregnancy until our baby turned 3 months old, and we couldn’t be more grateful for their care.\n\nThroughout the journey, they were incredibly patient, supportive, and always available to address any concerns we had. There was a small complication during the pregnancy, but Dr. Sharon’s professionalism and clear guidance reassured us every step of the way.\n\nWe genuinely looked forward to every appointment—not just because of their expertise, but also because of their warmth and kindness. Their welcoming and friendly nature made each visit a positive and comforting experience.\n\nAs a husband and a first-time father, I deeply appreciate the support and reassurance they provided, not just to my wife but to me as well. We highly recommend Dr. Sharon and her team to anyone looking for a compassionate and professional team!",
      "time": 1740194145,
      "translated": false
    },
    {
      "author_name": "choi Irene",
      "author_url": "https://www.google.com/maps/contrib/109277789641489782959/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKBxTZFDrM0D4xlULKDlahrHmUjwZdz3Zw5xkClrqt1BkieHg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "I had a consultation with Dr. Sharon, and I was truly impressed by how kind and attentive she was. She took the time to listen to all my concerns, and explained everything in a clear and reassuring way.\n\nI visited the clinic feeling quite anxious after receiving a note about inflammation from my health screening, but thanks to Dr. Sharon, I felt completely at ease.\n\nThe nurses were also very friendly and warm, the atmosphere of the clinic is very welcoming.\n\nI also learned that the clinic has recently been renovated so that not only general consultations and health screenings, but even operations can now be done in the same place. Definitely worth checking out!",
      "time": 1745227752,
      "translated": false
    },
    {
      "author_name": "Nur Iffah",
      "author_url": "https://www.google.com/maps/contrib/112475902499952978237/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV9ezLDhul4saSJ0Lg_2q52PWw06T6p0GoEaaV-ewDzSmAgNr4=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Staffs are very informative and friendly.\nCleanliness is exceptional.\nThe doctors guides you through your plan and listens to your needs and explain all the medical terms in depth so we can be on par with the plans.\nWould recommend for those who are trying",
      "time": 1740107216,
      "translated": false
    },
    {
      "author_name": "Lynette Chang",
      "author_url": "https://www.google.com/maps/contrib/110444346176135606059/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWjLEVXVAW6NXBV_Kikd2TtzRvmavX1vZZ-YAduDKdgvt-XW4Q77w=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Thank you Dr. Sharon, Cynthia and Nina for creating such a safe space during our consults together throughout my pregnancy, and for being so assuring through it all. Thank you for patiently addressing this first time mum’s questions, and slotting me in at the last minute when I needed to check on the little one for a peace of mind – each consult didn’t feel rushed but rather, filled with genuine care for the couple and our little one.\n\nDr. Sharon’s genuine passion for OB/GYN and kids truly shines through and we are thankful to have met such a kind and caring medical team 💛 we’ll definitely miss our time together now that the pregnancy journey has ended but we hope this isn’t goodbye!",
      "time": 1746893268,
      "translated": false
    },
    {
      "author_name": "chun chun li",
      "author_url": "https://www.google.com/maps/contrib/101727986463206202551/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI3wRDpZQPpmmydp5Y6yTLUKQt63L0cLR4hUy6sDn5OuaglNA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "It’s my first visit at Thomson Specialist clinic. The environment is clean, calm, and welcoming. The staff were friendly and professional. Dr Sharon Foo was incredibly caring and attentive. She took the time to listen, clearly explained everything, and provided thoughtful advice on the next steps for my treatment. It really helped ease my anxiety and made me feel comfortable throughout the consultation. Highly recommended!",
      "time": 1744707721,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "hospital",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8193500300964610500",
  "user_ratings_total": 145,
  "vicinity": "Paragon Medical Centre, 290 Orchard Road, #19-01"
}