{
  "formatted_address": "100G Pasir Panjang Road, #04-07, Interlocal Centre, Singapore 118523",
  "geometry": {
    "location": {
      "lat": 1.2777491,
      "lng": 103.7965947
    },
    "viewport": {
      "northeast": {
        "lat": 1.279155530291502,
        "lng": 103.7977318802915
      },
      "southwest": {
        "lat": 1.276457569708498,
        "lng": 103.7950339197085
      }
    }
  },
  "name": "Tinydot Photography",
  "place_id": "ChIJg8SaUHoZ2jERdDJHMR-1kmM",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Jasmine K",
      "author_url": "https://www.google.com/maps/contrib/106606615939332868248/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ4K6ViB3s4kxpS0wDeXjRom8WOEOhB46PjIoOV4I9dNdS_kg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "Tim is a photographer such full of adventurous n creative ideas. His works are definitely on point. My husband & I engaged Tim for both our PWS & AD. We enjoyed his crazy ideas of photography. He is efficient & send us the photos very promptly. Highly highly recommend Tim's service!",
      "time": 1605009601,
      "translated": false
    },
    {
      "author_name": "Pranav Moolwaney",
      "author_url": "https://www.google.com/maps/contrib/113893693540030235459/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIJ2YxUJwCcB5oThvgyhrP9XA7k7xDQ-SnrJQ2FghY39OY8LRAc=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "Tim (Timothy Sim) is an incredibly talented and professional photographer. He is completely vested in the projects his undertakes and is completely focused on the couple he is working with. His work surpassed many other professional photographers we had shortlisted for our solemnization and wedding shoots.\n\nWe do believe that his speciality is natural shots. He's got a very good eye for the special moments that are about to happen and he captured all those moments really well. We could see him running around making sure not one single moment was missed and everyone at our solemnization was included in his photographs. He was also excellent in giving us directions for some portraits and poses that we did before and after our solemnization as well.\n\nAll in all we were very pleased with the outcome and would highly recommend hiring Tim for your wedding and/or family shoots :)",
      "time": 1593967066,
      "translated": false
    },
    {
      "author_name": "Joshua Loh",
      "author_url": "https://www.google.com/maps/contrib/108279494183134618852/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJIoyJH4ac2icSVczJZYvgCOPRbPHXT4NIVLEXtMj1yh2drTg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "We visited Tinydot whilst hunting for a wedding photographer and were immediately impressed by Tim (nearly signed with him on the spot)! With his background of having shot so many weddings, he could predict the flow of service (we had a Christian wedding in a church) as well as the flow of the banquet and was able to estimate the time needed on both days etc! And unlike some other infamous studios, there was no hardselling involved!\n\nHe was really great on both the day of the church wedding as well as the banquet lunch the following day, always exuding an air of calm whilst patiently arranging/organizing the guests to frame the group photos! The photo edits were really quick and the shots just look amazing!\n\nHe also showed us his destination pre-wedding photos which looked absolutely stunning; if not for us already signing a package including a pre-wedding shoot (which was really good as well) we would definitely have signed Tim instead.\n\nWill highly recommend him to our friends and family getting married in the future.",
      "time": 1576394374,
      "translated": false
    },
    {
      "author_name": "Claudine Kwok",
      "author_url": "https://www.google.com/maps/contrib/105592766975463849463/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWMb_2DlyK-QkWdY4w2LHWAwKqDRGwZAhQ3qtxyq6UQpU-WF97l=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "We dealt with Tim, and he was really sweet and took great photos for our Solemnisation. The candid shots were on the money and very artistic. He knows how to find the right angles to make you look good! He was quick and provided first look photos within same day- impressive ! Highly recommended.",
      "time": 1593966840,
      "translated": false
    },
    {
      "author_name": "Leona",
      "author_url": "https://www.google.com/maps/contrib/101136806895453119073/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLrwW_jYGWjXaDNTHVEWDUMa99J81PQj0ecwAu63ri44fX0CA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "Yu Hsin who was our actual day wedding photographer is very professional. He has been very efficient and accommodating before, during and after the wedding! He and our AD videographer (Sam from SimpleMotion) worked very well together and we appreciated the seamless communication between both of them which gave us one less thing to worry about on that day!\nWe had a lot of compliments from our guests on that day for their professionalism!\nIt took him less than a week to send us some photos of which he edited first and the rest of the photos were sent to us 2 months later which we found it to be really efficient considering the fact that he took so many photos! The photos were nicely edited and our families and friends love the photos as much as we did :)\n\nWe highly recommend TinyDot!",
      "time": 1567569482,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7174996301929984628",
  "user_ratings_total": 8,
  "vicinity": "100G Pasir Panjang Road, #04-07, Interlocal Centre"
}