{
  "formatted_address": "31 Tampines Street 34, Singapore 529237",
  "geometry": {
    "location": {
      "lat": 1.3550422,
      "lng": 103.9594946
    },
    "viewport": {
      "northeast": {
        "lat": 1.356266430291502,
        "lng": 103.9608544302915
      },
      "southwest": {
        "lat": 1.353568469708498,
        "lng": 103.9581564697085
      }
    }
  },
  "name": "tjpianolessons",
  "place_id": "ChIJl6lui-Y92jER2YeqzGbPMbY",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Woo Wei Shan",
      "author_url": "https://www.google.com/maps/contrib/103375791546057906555/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL73MNvQFEWEW-_5cGFX5W4BJLLPPsbSMqV-nHAB-flh89bkg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Teacher Joshua has been teaching myself and my son piano for the past few months. In this short period of time, he has shown himself to be a passionate and engaging teacher to kick start our music journey.\n\nTeacher Joshua possesses a good combination of patience, creativity, and expertise tailored specifically for young beginners, like my five-year-old son. His teaching style is both structured and flexible, allowing my son to progress at his own pace while ensuring he grasps fundamental skills. I appreciate how he balances technical instruction with fostering his natural curiosity and love for music.  As with any young toddler with ever-changing attention span and energy levels, my son is no exception. Teacher Joshua is however, able to effectively redirect his focus, keeping him engaged and excited about each lesson.\n\nAs an adult learner myself under Teacher Joshua learning alongside my son, he brings a wealth of experience and expertise to each lesson. His patient and encouraging demeanor put me at ease, creating a supportive environment where I feel comfortable exploring and expanding my musical abilities. His teaching approach is refreshingly flexible, allowing me to learn at my own pace while still challenging me to reach new heights. He seamlessly blends technical instruction with creative exploration, ensuring a musical education that resonates with my interests and goals. With Teacher Joshua‘s guidance, the joy of music knows no age limits, and I am grateful to have him as my mentor on this fulfilling musical adventure.",
      "time": 1711509864,
      "translated": false
    },
    {
      "author_name": "Amy T",
      "author_url": "https://www.google.com/maps/contrib/102470902450528443674/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLc3v1V-EWsoXdZDVJGKYZsQMSbhJ5xzfTUInlXuqMlVvoudg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I have been taking piano lessons from Joshua Lim for over a year as an adult learner, and I couldn't be happier with the progress I've made and the experience I've had. Joshua truly understands the unique expectations and goals of adult learners like myself.\n\nOne of the things that sets Joshua apart as a piano coach is his ability to tailor the lessons to my specific needs and aspirations. Instead of forcing me into a rigid foundation-based curriculum, he takes the time to understand what I want to achieve with my piano playing. Whether it's learning to play a particular song, mastering a specific technique, or simply playing for personal enjoyment, Joshua always finds the shortest and most understandable approach to help me reach my goals.\n\nFor example, when I expressed my desire to play a favorite piece of music, Joshua didn't just focus on the theory and technique alone. He made sure to incorporate that piece into our lessons, breaking it down into manageable parts and teaching me the skills I needed to play it effectively. This personalized approach not only kept me motivated but also made the learning process enjoyable and highly effective.\n\nJoshua's patience, encouragement, and positive attitude have been instrumental in my progress. He has a knack for making complex concepts easy to understand, and his teaching style is both engaging and enjoyable. He is always ready to answer my questions and provide additional resources to help me improve.\n\nIn addition to his teaching abilities, Joshua is a passionate and talented pianist himself. His love for music is contagious, and he constantly inspires me to explore and appreciate the world of piano playing.\n\nOverall, I highly recommend Joshua Lim as a piano coach for adult learners. His understanding, flexibility, and dedication to helping his students achieve their goals make him an exceptional teacher. If you're looking for a supportive and effective mentor on your piano journey, Joshua is the right choice. I feel fortunate to have found him as my piano coach, and I'm excited to continue learning and growing under his guidance.",
      "time": 1698816721,
      "translated": false
    },
    {
      "author_name": "leylih wong",
      "author_url": "https://www.google.com/maps/contrib/106512608631595569243/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIb5RKSFESs3SKKjDppfhtm4rFDrTWw8huYkocziIFh_5AoRw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Teacher Joshua (TJ) is a very patient and passionate piano teacher. My son always looks forward to attending his lessons. Unlike other commercial music schools, TJ focuses more on music appreciation and how music can heal, motivate, and bring humans together. I am very glad that my son's piano playing skill is improving progressively under a stress free environment. TJ makes extra effort in recording every session and send the audios to the parents. From there, we know how and what we can help our children in their daily practices. TJ is the best piano teacher I have encountered. Hope my son will continue to enjoy playing piano and persevere in this interest throughout his life.",
      "time": 1699058719,
      "translated": false
    },
    {
      "author_name": "Monisha Celestina",
      "author_url": "https://www.google.com/maps/contrib/106899507518199653081/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX3LXgj8Vxdz82hPWOXNZqTyhM7uQ75sbGx9oll-NDtItfVrBI=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "TJ is a wonderful piano teacher. He is an inspiring teacher who teaches with great passion. He is really patient with me and I feel comfortable asking questions freely whenever I have doubts. He is very friendly and can explain concepts and techniques in a way that is easy to understand. Every lesson has been so enjoyable and productive that I always look forward to the next one!",
      "time": 1700142318,
      "translated": false
    },
    {
      "author_name": "Ly Yeow",
      "author_url": "https://www.google.com/maps/contrib/115027775695462562611/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJRihB2zk517E_wC6HHQ21xoTcNNpweHK1b63Q9pPThSOLN=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I started learning piano again after 20 years. As an adult learner, having an encouraging teacher who inspires, and caters to my learning needs is important. I was not keen to read notes and wanted to play by ear, TJ incorporated the theory aspect of things, including chords learning to help support this. After almost 2-3 months of learning, I am able to transcribe a song by myself and play it after much practice. The process of problem solving while transcribing, figuring out the style and different ways to play made it so enjoyable.\n\nTJ is a very patient teacher, highly encouraging and have an infectious love for music. I am lucky to be able to find a teacher like him, and look forward to the growth in my piano journey under his guidance.\n\nThank you TJ! (:",
      "time": 1705894432,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13128502429189048281",
  "user_ratings_total": 11,
  "vicinity": "31 Tampines Street 34"
}