{
  "formatted_address": "101 Thomson Rd, #07-01/#07-02/#10-03 United Square, Singapore 307591",
  "geometry": {
    "location": {
      "lat": 1.3175161,
      "lng": 103.8431831
    },
    "viewport": {
      "northeast": {
        "lat": 1.318764280291502,
        "lng": 103.8448404302915
      },
      "southwest": {
        "lat": 1.316066319708498,
        "lng": 103.8421424697085
      }
    }
  },
  "name": "TLC Speech Clinic",
  "place_id": "ChIJn8c54ecZ2jERXgGbyaL564c",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Elizabeth Toh",
      "author_url": "https://www.google.com/maps/contrib/100131082989667417491/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ-m5JoGLRZniyQKtfFQsHtEcfCh5qYaApesEAKXUG_ZSL6iw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Teacher Mandy is an exceptional educator who goes above and beyond for her students. My son attended her School Readiness Programme for over a year, and her dedication has been truly remarkable.\n\nHer 3-hour sessions are structured to mimic a real primary school environment, complete with schoolwork periods and recess - preparing children perfectly for their transition to Primary 1.\n\nThe most impressive moment was how she handled my son's anxiety about taking the school bus. When I mentioned he was resistant to single-deck buses (because he wanted double-deck buses) and having emotional meltdowns, Teacher Mandy didn't just listen - she took immediate action. By the next class, she had prepared a custom social story to help him understand and cope by validating his needs, explanations and options. Her intervention was gentle, professional, and effective.\n\nWhile I'm sad our partnership is ending now that my son has started Primary 1, I'm immensely grateful for her support during this transition period.\n\nHighly recommended for parents seeking a compassionate and strategic approach to school readiness!",
      "time": 1738372860,
      "translated": false
    },
    {
      "author_name": "Georgia Chan",
      "author_url": "https://www.google.com/maps/contrib/115244756986228597297/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI8RqLULmEWPgaXN9e4L-UNOpox_Gwz_4Ra0_1UfvKI3wOSlQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "I am so happy to have found TLC Speech Therapy Clinic for my child. It is truly a one-stop solution for anyone seeking comprehensive therapy services. From speech and occupational therapy to educational therapy and early intervention, they cover all aspects of a child’s development. The staff is incredibly knowledgeable and supportive, providing personalized care that makes a real difference. I highly recommend TLC for their holistic approach and effective therapies that truly cater to each child's unique needs!",
      "time": 1727856896,
      "translated": false
    },
    {
      "author_name": "Cheong Jason",
      "author_url": "https://www.google.com/maps/contrib/102859862092441706123/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLp-HEh40-3vLVtBSt3KFlSkP-ZfZx1YxLHaGkX9UKpECEyvw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Thank you TLC teacher Grace ,Kiah, Mei ,Becky and all other teachers for enriching my kid to speak and perform better with TLC ‘s Early Intervention Programme (EIP) and also to let we parents to learn and understand our kid better on his weakness through your daily involvements with him . Although my kid's time with TLC was not very long ,i can see that it really gave my kid a much needed boost  to open up his 'golden' mouth and helping to build up his foundation of lifetime of learning.",
      "time": 1729492954,
      "translated": false
    },
    {
      "author_name": "Bee Gaik Fang",
      "author_url": "https://www.google.com/maps/contrib/106532197978525930396/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIICb0CHBE80ks_8kxwHZWyGF3jAQ-7DNzDNHhE0nWCas9ROw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "We would like to extend our heartfelt gratitude to Teacher Xian Hui for her exceptional guidance and support throughout our son’s speech therapy journey. Her expertise and dedication have been instrumental in his progress. We have witnessed how he progressed from using limited single words to constructing sentences, asking questions and demonstrating a growing ability to understand and comprehend language.\nIn addition, we greatly appreciate the positive and nurturing environment of the center, which has significantly contributed to our overall experience.\nWe highly recommend that any parents in need of speech therapy consider giving TLC Speech Clinic a try.",
      "time": 1716715929,
      "translated": false
    },
    {
      "author_name": "genevieve",
      "author_url": "https://www.google.com/maps/contrib/117792779864572253188/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ2izOzJ3r066e0_4lV6FiCtvwwNwOl3dXyQvkNSkE2CFA5lg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Having found TLC has been one of the greatest blessings for my daughter. We’ve been to so many places in the past 2.5 years and none of them match up.\nWhat I really love most about TLC is their careful selection of teachers. They have quality staff with years of experience.\n\nI started my daughter with ST and then added on the full day classes. The classes are so well planned and executed. They incorporate cookery, sensory play along with OT and ST seasons for the kids in the full day programme.\n\nHighly recommend TLC to anyone looking for quality services for their kid.",
      "time": 1693639443,
      "translated": false
    }
  ],
  "types": [
    "school",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9794196292209672542",
  "user_ratings_total": 55,
  "vicinity": "101 Thomson Road, #07-01/#07-02/#10-03 United Square"
}