{
  "formatted_address": "480 Lor 2 Toa Payoh, Singapore 319641",
  "geometry": {
    "location": {
      "lat": 1.3340647,
      "lng": 103.8464502
    },
    "viewport": {
      "northeast": {
        "lat": 1.335365730291502,
        "lng": 103.8479943302915
      },
      "southwest": {
        "lat": 1.332667769708498,
        "lng": 103.8452963697085
      }
    }
  },
  "name": "Toa Payoh Methodist Preschool",
  "place_id": "ChIJG-sfo2cX2jERUpvHwsGQNy0",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Jewel Baldevarona-LLEGO",
      "author_url": "https://www.google.com/maps/contrib/114671557746299263454/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVKQOdU1NcJQsH9OFG-LOkg2IpEuqj6kjpCvJo7ELWrrl8BMYo=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "We appreciate the teachers and faculties of Toa Payoh Methodist preschool.\nAs busy parents, we are truly thankful that our 2 girls enjoy school, the activities with classmates, the learnings and the company of the ever supportive teachers! They are very accomodating to answer our queries and concerns about our children.They accept our feedback and always assist the girls in whatever requirement they needed at school.\nThe learnings are not only academic but TPMP also help inculcate good values and faith to the children so they will grow hollistically as a person.\nThank you Miss Janice, and to all the teacher and staff of Toa Payoh Methodist Preschool.\nKeep up the good work!🫶🏼",
      "time": 1700736864,
      "translated": false
    },
    {
      "author_name": "Bernadette B",
      "author_url": "https://www.google.com/maps/contrib/103744184393300181372/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWfSNK_dbWhnUIucoMPW8aG1j7moHTGPREGgUoollqcKsoOOFA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My daughter started at Methodist when she was 3, N1 and then i moved my K1 son to Methodist. Both of kids are very happy and I am amazed that they are learning a lot in terms of academics for a half day preschool and more importantly values and good manners at this age. Love the Teachers and Principal too. So thankful for everyone.",
      "time": 1709856883,
      "translated": false
    },
    {
      "author_name": "sneha sundar rajan",
      "author_url": "https://www.google.com/maps/contrib/111414202351442433436/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUwGVZR3ghaCC94haP77holOp_B1VGSxHoQIryjU1d55tH9Qnji=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Toa Payoh Methodist church preschool is an excellent school which suits my son’s needs perfectly. The teachers are kind and friendly. Children are looked after well and communication with parents is great aswell. My son who joined quite recently was able to settle in quickly and start enjoying school almost immediately. Certainly wishing the school the very best and very thankful to the staff and teachers!",
      "time": 1695785001,
      "translated": false
    },
    {
      "author_name": "Aixue Yuan",
      "author_url": "https://www.google.com/maps/contrib/115691655158721857723/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLCYu7XnJdWvelJhWAvxa1N6qfyYXJrtefyQ5x_ik4tlFkwRw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "It has been a joy to have Mina attend Toa Payoh Methodist Preschool, where the warmth and kindness of the staff have created a nurturing environment for her to grow and flourish. The dedication and friendliness of every educator, especially Yang Laoshi and Teacher Ming Loi, have left a lasting impression on our family.\n\nThe Principal Mrs. Raj's commitment to fostering a welcoming and supportive community is evident in every interaction. She leads by example, showing great kindness and a positive spirit that permeates throughout the school. It's leaders like her who not only solve problems but also inspire trust and respect in the entire school community.\n\nThe school's commitment to not just academic excellence but also to the emotional and social well-being of the children is commendable. The inclusive atmosphere and the individual attention given to each child are what make this preschool stand out.\n\nWe are deeply grateful for the love and care Mina received, which has been instrumental in her development during her formative years. We believe the values and lessons she has learned here will guide her well into the future.\n\nWe wish the Toa Payoh Methodist Preschool continued success in its mission to provide a solid foundation for lifelong learning. Your work truly makes a difference in the lives of the children and their families.",
      "time": 1704987305,
      "translated": false
    },
    {
      "author_name": "roopa bs",
      "author_url": "https://www.google.com/maps/contrib/108894226283525672456/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV0zmDGmmkGK3cpiBuRp27h8i0TXMe1zku_ZP5x8MrA2i6GuQU=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My son is November born and learnt to talk very late. I joined him in Toa Payoh Methodist preschool when he was 2.5 years old after the principal took a detailed school tour and explained almost everything for nearly 2 hours.\nHis teachers and care takers were very helpful as my son had never left me and stayed for this long earlier. The teacher, Tr.Serena would update me on daily basis about his stay in school. Slowly he started loving to go to school, and started telling me bye happily!\nHe learnt to talk so well.. every sentence would have a please before and we were very happy about him progressing so well.\nHe enjoyed the show and tell shows and participated actively in all the art projects at home so he can show his friends and teachers.\nThe principal Ms.Janice is very sweet and took extreme good care when he fell sick until I arrived to school.\nI had to quit after N1 as we shifted house and he still misses his school and says he wants to go to Toa Payoh Methodist school.\nSpecial thanks to teacher Serena, Lee lai shui and Ms.Judy for making his school the most favourite place.They made sure that he is happy at all times in school. The way teachers would welcome him\nEveryday with excitement would always give me very good vibes!\nI would recommend everyone to consider this fantastic preschool for all the good reasons it has to offer!\nThank you ",
      "time": 1701224344,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3258232017296792402",
  "user_ratings_total": 11,
  "vicinity": "480 Lorong 2 Toa Payoh, Singapore"
}