{
  "formatted_address": "1 Maju Ave, #01-01 myVillage, Singapore 556679",
  "geometry": {
    "location": {
      "lat": 1.364842,
      "lng": 103.8654006
    },
    "viewport": {
      "northeast": {
        "lat": 1.366205730291502,
        "lng": 103.8668092802915
      },
      "southwest": {
        "lat": 1.363507769708498,
        "lng": 103.8641113197085
      }
    }
  },
  "name": "Toast Box (myVillage)",
  "place_id": "ChIJVTNQyv8W2jERUzVSacr7BMg",
  "rating": 3.5,
  "reviews": [
    {
      "author_name": "N K",
      "author_url": "https://www.google.com/maps/contrib/112575356827178743362/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUES1ntC2601ypXXuHj_acR_eY1wezxiJvxaxkFOE5ljRPWk5oL=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "Yet another underwhelming Toast Box outlet — much like the one at GENEO. This one easily earns a flat zero stars.\n\nThe store claims to close at 8:30 PM on Google, yet by 7:30 PM, tables and chairs were already packed away, and staff were actively turning customers away despite still being “open.” It’s nothing short of disgraceful. This eagerness to shut down early reveals sheer complacency and a blatant disregard for customers.\n\nI checked the other reviews, and the consistent complaints about poor service at this location only reinforce my experience. At a time when genuine, hardworking retailers are struggling to stay afloat, it’s worth reconsidering support for businesses that clearly don’t value their patrons.\n\nToast Box appears to have outgrown its ability to maintain even the most basic standards — a sad, telling sign of a brand in decline. What an absolute shame.",
      "time": 1747148804,
      "translated": false
    },
    {
      "author_name": "JLow Jellyfish",
      "author_url": "https://www.google.com/maps/contrib/109597327390368121486/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUNUlmR-Pk6LIYl-ovVdRAihzABsszh45YRo5KSTDnMtEBGpApX=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "Had a Hainanese Pork Chop upon recommendation, pork chop was tender n has a good crunch batter except the gravy was way too sweet and not exactly a traditional Hainanese pork chop in flavour.\nCredit goes to their Teh C, it has always been on point, with the right balance of infused tea n evaporated milk.\n\nWhat puts me off was the crockery.. the plate was chipped almost all round… and it’s melamine !😱\nThey should take pride in the crockeries that they served their food on; to complete the whole dining experience.",
      "time": 1735037662,
      "translated": false
    },
    {
      "author_name": "Lydia W",
      "author_url": "https://www.google.com/maps/contrib/114298584666245829355/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU1-6P5vgVhgaU5vpT22CaAPTbpNqu0g9KeLG0ZOHAmFTqZsLc=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "This is the fried mee siam set meal ($12). Toastbox has generally good food and decent drinks. I've tried their prawn noodles, mee siam and braised pork rice sets and they are all good. $2+ for a tiny slice of cake is a bit much though.",
      "time": 1735379614,
      "translated": false
    },
    {
      "author_name": "MC",
      "author_url": "https://www.google.com/maps/contrib/109575198764859455286/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKDqYQ8N4LCXUoys_iwwYQE962Ttxejhs9_Oe0Db9ydHcqEKg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "8 months ago",
      "text": "Wanted to dine in. Cashier conveniently keyed in order w/o even asking. Look at the receipt - it showed dine in but staff insisted it was meant for takeaway. The place wasn't even filled why chase customer way? Bad service, made mistake and not apologetic at all, not that food is great, this shall be my last.",
      "time": 1724913079,
      "translated": false
    },
    {
      "author_name": "T",
      "author_url": "https://www.google.com/maps/contrib/110832038367150083087/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLiJ1eedRXS2LfI80MVyMiX_slHINfL7FOUft4X1j6V120nUg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 2,
      "relative_time_description": "2 months ago",
      "text": "The food portions are inconsistent – the last curry chix dish I had only consisted of two tiny pieces of tao pok (half the size of the usual) with the three mid-joints and two pcs of potato. Usually it's three of each.\n\nAside from food, while it is good (and important) to see staff happy at work, there has to be boundaries and attention to customers' needs. Staff are seated at indoor tables even when the place is busy. And they are chatting loudly (almost shouting) across customers to their colleagues behind the counter for prolonged periods. At one point, they discussed their shifts. The female staff at the table said the male staff behind the counter had the same shifts as her for the week. The male staff said it's so he can see her. She blushed, laughed loudly and looked around to see which customers heard. Everyone would have heard given the decibel level. It went on for a while.\n\nIt's all good and well for them to have their banter, but shouting across customers is annoying and taking up space when it's busy is not right, especially when customers ask if they could sit there and the staff's mood changes for the worse. This has gone on for months now. Perhaps Mgt could explain to them that they should free up space when it's full house? And when they're joking around, perhaps keep the volume down?",
      "time": 1741328746,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14412921554261390675",
  "user_ratings_total": 133,
  "vicinity": "1 Maju Avenue, #01-01 myVillage, Singapore"
}