{
  "formatted_address": "1014 Upper Serangoon Rd, Singapore 534752",
  "geometry": {
    "location": {
      "lat": 1.362751,
      "lng": 103.888158
    },
    "viewport": {
      "northeast": {
        "lat": 1.364086530291502,
        "lng": 103.8894615802915
      },
      "southwest": {
        "lat": 1.361388569708498,
        "lng": 103.8867636197085
      }
    }
  },
  "name": "Today Restaurant 日日茶室",
  "place_id": "ChIJJ50QdAAX2jERasSCst7R-Ek",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "Tommy Lim",
      "author_url": "https://www.google.com/maps/contrib/115774852283121417440/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV_pYKfvDDmKILoiI1EhIcS_e7HRJ9zSqCiLFQD9QiimE_KZYwzvw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Stumbled in because the decor caught our eye, and to our delight, we found a First Street Fish Soup stall—one of our favourites! Ordered the chicken rice and it was pretty solid: fragrant, nicely textured rice, and both roast and steamed chicken were delicious.\n\nWe shared a fish soup too, and it lived up to expectations. The drinks stall deserves a mention—homemade lemon tea, kopi, and even the French toast were excellent.\n\nOnly regret was not getting to try the fried prawn noodles (starts at 5:30pm). Will definitely be back if we’re in the area!",
      "time": 1744389657,
      "translated": false
    },
    {
      "author_name": "Ed T",
      "author_url": "https://www.google.com/maps/contrib/118071263998897226945/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWIrQYAmVORMNRO2b3Gb_68BTGtqh_aGOEm86GujExxiXAykom2=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "3 weeks ago",
      "text": "Almost 5 stars for food.\n\nThe kampong chicken was nice.  Not dry, not tough.  Very juicy and tender Infact.\n\nWhat brought it down was the Curry Fish Head.\n\nCurry felt watered down, fish could have been fresher.\n\nVery affordable and decent meal.\n\nPro tip - park at Stars of Kovan and walk over.  Don’t bother with the road side parking.",
      "time": 1745670828,
      "translated": false
    },
    {
      "author_name": "Alex Chew",
      "author_url": "https://www.google.com/maps/contrib/107696607377855745700/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWvq0U2HywBn-3cMQYhzv6CdooCVr0kfAoETo71O5YLrho0ufNI9Q=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "3 weeks ago",
      "text": "The food is great, I would return if\n- carpark was more convenient\n- the atmosphere is not so warm. Somehow it’s ultra hot, maybe cos it’s corner shop with concrete road all around\n- the queue is too faster and chicken chopping is too. Everyone wastes time with ordering. The cashier also helps with vege and tauge cooking.\n- the tables are more comfortable. Almost half the tables are 5cm away from a step, next to the road. Prepare for accident\n\nHonestly it’s just chicken rice. Just eat elsewhere.",
      "time": 1745742227,
      "translated": false
    },
    {
      "author_name": "Xin Hao",
      "author_url": "https://www.google.com/maps/contrib/101038177603319548234/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU6c44XsILjRE2Islw02Z6jqIpGV_4urvZ0lGOy57c-ErkANHqe=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Newly opened within 10minutes of walking distance from Kovan MRT. Used to be a regular coffee shop till they rebranded start of this year. Today Kampung Chicken Rice is the signature here - really authentic and fresh throughout the day. You can opt for a quarter, half, or whole chicken depending on how many dining companions you’re with. I found that half a chicken was just enough to feed about three to four pax. The rice is also incredibly fragrant ; portions just about right. This is a gem of a chicken rice within Kovan I would safely say. The Zi Char dishes can also be ordered from the Chicken Rice stall - not that an extensive menu as compared to your regular zi char stalls but sufficient I would say. Tried their claypot toufu and sambal kangkong - amazingly good. Sambal kangkong is one of the best I have tried around this area - good wokhey and not as salty or oily at all. Prices are also very reasonable!\n\nOther stalls include First Street Teochew and First Street Fried Prawn Noodles - both also reasonably popular amongst the crowd, especially the Hokkien Mee, which took about 25-30minutes to be served. Place is well ventilated and seats are aplenty. There is also a couple of western and breakfast option at the drinks stall which is very wallet friendly, but I have not personally tried it nonetheless. Washroom is also relatively clean.",
      "time": 1743246658,
      "translated": false
    },
    {
      "author_name": "Leong Hana",
      "author_url": "https://www.google.com/maps/contrib/106005766557622260473/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI6A1tEFk67r7ZAiCcKYcqt3doXXrLZ9fRxWhhXnZ7NTSJ47g=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Tried their kampung roast chicken and zichar, consistent n affordable. But sometimes zichar garlic kai lan portion shrunk, maybe ran outta veg that night? 😅 Kopi n teh r decent. Price wise they are reasonable, like $5.80 for chicken rice, $1.50 for teh/kopi, $8 for a plate of kailan and $7.50 for chicken cutlet with rice.\nTheir hokkien mee ($6, $8 & $10) got improvement in terms of taste, ate in Feb, wok hei is rather lacking, (see pic with prawn = 1st try). Then March, their hokkien mee \"zup\" tastes thicker with abit of wok hei, saltier for sure. Jus make sure to tell the cashier to go easy on e chilli. Coz I told her chilli abit..she went on to put alot. When I said stop she jus piak one more scoop! Best to separate e chilli out coz it really makes the dish way too salty. Appreciate the opening hours till late. I stay ard the area, after evening jog still got zichar available.",
      "time": 1742558993,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "store",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5330240913400841322",
  "user_ratings_total": 32,
  "vicinity": "1014 Upper Serangoon Road"
}