{
  "formatted_address": "462 Crawford Ln, #01-63, Singapore 190462",
  "geometry": {
    "location": {
      "lat": 1.3045738,
      "lng": 103.860772
    },
    "viewport": {
      "northeast": {
        "lat": 1.305855330291502,
        "lng": 103.8622720302915
      },
      "southwest": {
        "lat": 1.303157369708498,
        "lng": 103.8595740697085
      }
    }
  },
  "name": "Tolido's Espresso Nook",
  "place_id": "ChIJn21OvQQQ2jERkuv0_a1tY7I",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Zackery Goh",
      "author_url": "https://www.google.com/maps/contrib/109405400403426765330/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUGQsp237p9vNHb-uS9FyMoz0Z-zK6zy1GCgCTEXQuCxwKVbMg-=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Tolido's Espresso Nook is a hidden gem for brunch enthusiasts. The cozy atmosphere, complete with rustic decor and comfortable seating, sets the stage for a delightful dining experience.\n\nMenu Highlights\nThe brunch menu offers a variety of options, from classic dishes to unique creations. The **avocado toast** is a standout, perfectly ripe avocados on artisanal bread, topped with poached eggs and a sprinkle of chili flakes for a bit of heat. The **French toast** is another must-try, generously dusted with powdered sugar and served with fresh berries and maple syrup.\n\nFor those looking for something heartier, the **breakfast burrito** is packed with flavor, combining scrambled eggs, cheese, and your choice of protein wrapped in a warm tortilla. Don’t forget to pair your meal with their specialty coffee; the espresso is rich and aromatic.\n\nService\nThe staff is friendly and attentive without being intrusive. They are knowledgeable about the menu and quick to offer recommendations. The service is efficient, making it a great spot even if you’re in a hurry.\n\nAtmosphere\nThe vibe is relaxed and welcoming, with plenty of natural light pouring in. It’s an ideal place for catching up with friends or enjoying a quiet moment with a book.\n\nOverall, Tolido's Espresso Nook delivers a fantastic brunch experience. With its delicious menu, attentive service, and charming atmosphere, it's a spot worth visiting. Whether you're a coffee aficionado or just in for a hearty meal, Tolido's is sure to impress.",
      "time": 1740900540,
      "translated": false
    },
    {
      "author_name": "Melissa Eisner",
      "author_url": "https://www.google.com/maps/contrib/117316308946167178763/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocInzITBbs1kXHipsTJdwwrMde7hDOKObbB0vpNxOQgGNOJiyWnr=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Was super craving a simple and yummy breakfast … so I hit up my list on Google Maps and chose @tolidosnook. This place has had awesome reviews and have wanted to go for a while.\n\nLet’s start with the coffee - it was so well balanced. I got an oat milk iced latte and it hit the spot on this warm Singapore day. My friend ordered the peppermint mocha, and it was as Goldilocks says … just right. Not too sweet, no overpowering peppermint taste. Yum!\n\nOn to the food. If you’re a basic breakfast babe like myself, the classic eggs were great. Creamy and full of flavor, nice chicken sausage, crispy bacon and tasty baked beans that were not too sweet. If you like the kind of breakfast you don’t make at home, go for the shakshouka- rich in flavor, smoky, nice amount of sausage.\n\nWaitstaff was helpful and great with service. I think this place will make the rotation!",
      "time": 1738638956,
      "translated": false
    },
    {
      "author_name": "Y KN",
      "author_url": "https://www.google.com/maps/contrib/118061546935452017131/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJtEnavTeXcc3PQKuklHSzj6JWyHbKK0sMpBJwGWXC-w6qeJQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We enjoyed the breakfast menu, with plenty of tasty options. The outdoor seating area was perfect for dining with my dog, and the staff were friendly and welcoming. One suggestion for improvement: adding online payment would make the experience even smoother.",
      "time": 1744455451,
      "translated": false
    },
    {
      "author_name": "Din Neo",
      "author_url": "https://www.google.com/maps/contrib/118373032430651076576/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUXXJfp9aRBbSHd-uQv8wSc-D_46zQ6aAxbB3dvOXnJ_eIYRxE1Vg=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Nice place to have your meal and coffee. The coffee tastes great. They have decaf coffee there. The Egg Benedict was deliciously done! The ambience is good. The place is crowded. The staff were helpful and friendly. Highly recommended!",
      "time": 1732004617,
      "translated": false
    },
    {
      "author_name": "CT",
      "author_url": "https://www.google.com/maps/contrib/114311926943524656933/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWaWeECQwZEIX0FtJoynFFDuoSDt_TGvZtoCXYdBByGewRSkseL=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Reached on a Saturday morning at about 11am. Waited for half an hour for seat.\n\nInteresting menu with some special dishes. Ordered the rosti and tom yum scrambled toast. Flavourful and absolutely amazing to our liking. Thumbs up and I'll be back again for sure.",
      "time": 1736576360,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "restaurant",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12854238355502984082",
  "user_ratings_total": 2403,
  "vicinity": "462 Crawford Lane, #01-63"
}