{
  "formatted_address": "25 Changi South Street 1, Singapore 486059",
  "geometry": {
    "location": {
      "lat": 1.3390407,
      "lng": 103.9715492
    },
    "viewport": {
      "northeast": {
        "lat": 1.340265580291502,
        "lng": 103.9730069302915
      },
      "southwest": {
        "lat": 1.337567619708498,
        "lng": 103.9703089697085
      }
    }
  },
  "name": "Toll Global Express",
  "place_id": "ChIJR9gRSds82jERWI-9SYcHRY0",
  "rating": 1,
  "reviews": [
    {
      "author_name": "Leslie Kok",
      "author_url": "https://www.google.com/maps/contrib/111554509381322873698/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVktY9jPpRXiMHImhfUuaP2WessHiXKiyhlYb-y8lkM_mJshoU=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "9 years ago",
      "text": "I am very unimpressed with the service.\n\nThe first attempt for delivery was on the 1st but as I wasn't given prior warning as to when the package will arrive, no one was home when it was delivered. I received a SMS on the 2nd asking me to reschedule.\n\nI rescheduled it for the 3rd between 9am-1pm (as they only do 4 hour blocks). I rushed back from my morning errands to be home by 9am and waited till 1pm. No sign of the delivery.\n\nI called customer service and after checking with the delivery person, she told me he had a lot of deliveries and couldn't make it in time. I have wasted 4 hours waiting for the package. I told her the package must be delivered at night as I will be out in the day. She called back later and said it will be delivered between 6-10pm, I told her I can only make it from 7pm onwards. She said she will check and let me know. After a while, I got an SMS saying that my package will be delivered between 6-10pm. Obviously my request for 7-10pm window was not even granted, after I rescheduled my whole morning to wait for this delivery.\n\nI rushed home by 6pm so I would not missed the delivery. And once again, no sign of the delivery.\nSo basically I wasted 8 hours yesterday waiting for the package to show up.\n\nThis is extremely unprofessional and unacceptable for a service company.\n\nI did not receive any phone calls explaining why my package wasn't sent last night. I  just called the customer service in the morning and am now waiting for the supervisor to call me back.\n\nI am VERY UNIMPRESSED with your poor service.",
      "time": 1457056028,
      "translated": false
    },
    {
      "author_name": "Shyam Senthil Durairaj",
      "author_url": "https://www.google.com/maps/contrib/105715794545530828680/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXxxMpri-rvT1gvN6Dc-q2Sk9U5JUlGwibjMJlSV8jCtYrnaZg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "9 years ago",
      "text": "cheapest way to ship your goods but once there is a problem there wont be any response from anyone. if shipment stuck somewhere there will be no one to call and inform you unless you check yourself. my shipment was to India ( Mumbai) and ended up in Delhi(India) . unable to clear customs due to high value. I came to know things after 10 days only. now dpex want me to pay the both to and fro cost to bring back shipment to Singapore also want to pay GST for the shipment. I have to talk to Customs regards GST and they simply say have to pay only. don't want even try . I don't want to indicate people name here. totally screwed up. if you have high value goods better don't ship with Dpex .\nThanks",
      "time": 1458012478,
      "translated": false
    },
    {
      "author_name": "Cameron McKinnon",
      "author_url": "https://www.google.com/maps/contrib/106826325368733680156/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUeXdcD6Vx1VFni9IaKrcCd7mfUPERrPENWcBk5OSALoFrMitM9MA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "9 years ago",
      "text": "Rubbish service - fake updates from couriers suggesting the delivery address is incorrect when they haven't even attended.\nLazy, cheap and Nasty service.",
      "time": 1461673135,
      "translated": false
    }
  ],
  "types": [
    "storage",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10179550810380013400",
  "user_ratings_total": 3,
  "vicinity": "25 Changi South Street 1"
}