{
  "formatted_address": "273, #01-06 Thomson Rd, Novena Gardens, Singapore 307644",
  "geometry": {
    "location": {
      "lat": 1.3204959,
      "lng": 103.8420255
    },
    "viewport": {
      "northeast": {
        "lat": 1.321783630291502,
        "lng": 103.8434368302915
      },
      "southwest": {
        "lat": 1.319085669708498,
        "lng": 103.8407388697085
      }
    }
  },
  "name": "Tomahawk - Contemporary Steakhouse (Novena)",
  "place_id": "ChIJtRszQjsZ2jERwA56K_Iu1AE",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Caleb Tupili",
      "author_url": "https://www.google.com/maps/contrib/111842457023917348717/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWma7LlhzrwImvzZEt__jVzj8GZlNX5Z_YFNJvSmc7drwQ7M5k=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "From the moment we stepped in, the experience was thoughtfully curated. Chef John and Dom led the evening with finesse, striking a great balance between passion and precision.\n\nTheir knowledge of the ingredients, cooking techniques, and even the forging of their own knives was nothing short of remarkable. It’s rare to witness such attention to detail from the kitchen to the table. Upon request, they graciously allowed us to torch our own steak as well!\n\nBeyond the food, the team’s consideration extended to our shy pet, who was treated with such care that even he felt at ease.\n\nMy family and I throughly enjoyed what was a thoughtfully layered experience. From the behind-the-scenes craft to the final bite, each element came together beautifully.",
      "time": 1743168949,
      "translated": false
    },
    {
      "author_name": "Bernard Wee",
      "author_url": "https://www.google.com/maps/contrib/103730359775833140836/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVsqQcbu_iTx1BebtcDNQ6TPpBIHG1b3te8aXiPMABityJB9sk8=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "**⭐⭐⭐⭐⭐ An Exceptional & Pet-Friendly Fine Dining Experience at Tomahawk (Novena)!**\n\nOur family and Norwegian guest had an absolutely wonderful evening at **Tomahawk Contemporary Steakhouse (Novena)**, and we must extend our deepest gratitude to **Mr. John Chan and his outstanding team** for their impeccable hospitality. From the moment we arrived, we were treated with such warmth and professionalism that we all felt truly valued as guests.\n\nWhat makes Tomahawk truly special is not just their **superbly crafted steaks** (cooked to absolute perfection!) but also their **rare pet-friendly indoor fine dining** policy. Our beloved dog **Teddy** received the same thoughtful attention as we did - the team kindly provided fresh water and made sure he was as comfortable as we were. This level of consideration for four-legged guests is remarkable and shows Tomahawk's genuine commitment to exceptional service.\n\nThe sophisticated yet welcoming ambience, flawless service, and attention to detail created a memorable dining experience that impressed both our international guest and our entire family. We will certainly return and enthusiastically recommend Tomahawk to anyone seeking **top-tier cuisine with outstanding pet-friendly hospitality**.\n\n**With sincere appreciation,**\nWee Family\n& Teddy the Dog 🐾\n\n*P.S. Our Norwegian companion was particularly impressed by both the food and service - a testament to your world-class standards!*",
      "time": 1743513363,
      "translated": false
    },
    {
      "author_name": "chanel ariel",
      "author_url": "https://www.google.com/maps/contrib/102217209036642929537/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXDHCsKLShCDSs1wfPi5VEXfQKaEQbAroptHMTO5TM0YyM1JaZK=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "We went for the fact that the dogs can sit indoors for the AC. We looked through the menu and the prices were quite high. No matter. We got a steak and a lamb leg. That itself would have amounted $100 for just that but it’s okay we got a bottle of wine so we can slowly eat and savour. The order came late, which is also okay for me. But when the food came its was so small!! 3 pieces of lamb chop and a tiny steak. I asked if I could change the sides of the steak to fries because I wanted the fries with a $7 upgrade of bottarga, Parmesan and cured egg yolk but I had to order Ala Carte. Which as you might have predict I am okay with. So I ordered the fries with the $7 upgrade but! regular fries with a tiny amount of Parmesan shavings came\n\nSee pics. (Lamb chop I ate one piece already but total 3 pieces)\n\nTaste was great but portions were abominable. First time also last time. Aircon also very warm.",
      "time": 1746860595,
      "translated": false
    },
    {
      "author_name": "Ad.",
      "author_url": "https://www.google.com/maps/contrib/117516444540929250850/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWPgTheMUk9UasX-l2OjVKCyPCYaqIULmAnNdhKkLK_DBbKrTwb=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 2,
      "relative_time_description": "4 months ago",
      "text": "Disappointing Experience - Not worth what we paid for.\n\nVisited for a special dining experience but left feeling utterly let down. We spent nearly $1,000 for two people, expecting a better-tier food and service, but neither lived up to the hype. It was a very expensive and disappointing meal.\n\nThe much-touted 2.1kg wagyu tomahawk was strongly recommended by the chef-owner, John. While we figured we could save leftovers for lunch the next day, the overall experience didn’t make it worth the effort. While the meat was tender and juicy, the sweet \"secret ingredient\" completely overshadowed the natural flavour of the wagyu. It became overly rich, and I could barely enjoy the meatier portions after trying the edges and fats.\n\nWe also had to wait a really long time for the main course, which only added to the frustration.\n\nOne positive note: John suggested avoiding the Amarone wine due to its sweet hints, which would have clashed with the beef. It was a good suggestion, and we appreciated that moment of thoughtfulness. However, his overall service left much to be desired. His defensive attitude toward feedback and visible displeasure over simple preferences, like how we wanted to handle our wine, made the atmosphere uncomfortable.\n\nTo add to the disappointment, the side dishes were over $15, but ridiculously small—KFC coleslaw feels generous in comparison. While the ambiencee was nice, it couldn’t save an underwhelming meal paired with poor service. The serviceby the servers are much more worthy.\n\nOverall, the food experience didn’t justify the cost, and I wouldn’t recommend it. Feels like it was priced fpr the story of the knife, the beef flaming show instead of the meal. Noticed a lot of reviews mentioned the same thing, do hope they would improve in due time.",
      "time": 1735097626,
      "translated": false
    },
    {
      "author_name": "Teng Rick",
      "author_url": "https://www.google.com/maps/contrib/116737889472551585990/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV1V77nlYt8aMK3iK618pZvs9KK3AeyOzLYLMghm0f_V-nMvjwkXQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Excellent food and especially the service by Irene! The tomahawk rib eye we had was perfect. Bread and prawns were super yummy. Will definitely come again.",
      "time": 1738934964,
      "translated": false
    }
  ],
  "types": [
    "meal_delivery",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=131781906746969792",
  "user_ratings_total": 639,
  "vicinity": "273, #01-06 Thomson Road, Novena Gardens"
}