{
  "formatted_address": "30 Beach Rd, Singapore 189763",
  "geometry": {
    "location": {
      "lat": 1.2945955,
      "lng": 103.8559552
    },
    "viewport": {
      "northeast": {
        "lat": 1.295980980291502,
        "lng": 103.8574692802915
      },
      "southwest": {
        "lat": 1.293283019708497,
        "lng": 103.8547713197085
      }
    }
  },
  "name": "Tonic",
  "place_id": "ChIJWQVa9qUZ2jER0F1nv-tzUDE",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Rochelle (OchieBon)",
      "author_url": "https://www.google.com/maps/contrib/107572074312956587143/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXRv2Mhfbx5uxClrVa-UX2v2pyzq8O-UnomlBru_jove_QOFBsxNQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Late night cravings here at Tonic and we simply love the food quality and choices! Esp the cheesecake and satay! Plus their coffee!! Love the ambience too and very relaxing in their lounge area. The staff super nice and friendly too! Maya and Kendy both with superb customer service and they explained/ showed to me the different gins that's available in their bar. You can get diff gins from diff countries and its on their menu just select the country u wud like to taste the gin (based on where it originates) and u will see the difference! Amazing! thanks again dear! we will be back again",
      "time": 1734376655,
      "translated": false
    },
    {
      "author_name": "Bull Dogg",
      "author_url": "https://www.google.com/maps/contrib/104694583236609319710/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWPDhDhY38FQfDhYLMi6MA4U3VwZvbvpCarmd7Bbm8wGRRpVVAB=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "This is the JW Marriott South Beach main hotel bar. It is very small in comparison with other hotel bars. That aside, it features a grand gin selection and good cocktails, albeit from a very short list of cocktails. We tried the Madame Negroni, the Gin Sling, and the Citadelle with Elderflower Tonic. All three cocktails were very well prepared and well-tasting.\nThe bar also features typical bar food, which we didn’t try this time.\nAll in all a very good experience and we will come back.",
      "time": 1728890959,
      "translated": false
    },
    {
      "author_name": "Christian Howard",
      "author_url": "https://www.google.com/maps/contrib/100572659296839460447/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWAoYAmK4Iyaf7hDfNbLkZva0OCB428Jsj9YMWW8FXpjW4nN7y5=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Tonic is a charming place with excellent service and surprisingly good food, nestled within the JW Marriott lobby. Every hotel should have a bar that opens at 8am - highly recommended!",
      "time": 1745629206,
      "translated": false
    },
    {
      "author_name": "HealthcAIre Kim",
      "author_url": "https://www.google.com/maps/contrib/101154220359165719571/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXOiK0fgCq2g7gcyw7y6tTP9LstK3__9pXQlVpEJlRxIZXqqpvchg=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Tonic, JW Marriott Hotel South Beach: Tucked in a small corner of the swanky JW Marriott Hotel is Tonic. No stranger to the JW, Marriott, I’m surprised I missed this. The small cosy den popped up on my radar when I did an event venue viewing. Everything drips with Mod-Luxe sophistication in the hotel. ou feel like a VIP upon entry and wear the VIP badge as long as you’re under the roof.Tonic matches the feel, in its small, intimate way. I had a drink on the house by the lovely Sin Mun of events team. If gin is your game, you’re in heaven. After all, what’s Tonic without Gin? There’s a large archive of gin bottles from around the world on display. A shelf of whiskey pales in brown comparison to it. There is grand bottle of  Remy Martin Louis that watches over the room. Take your pick of gin and the bartender matches it with the right tonic. As far as sinful morning guzzings go, I had my first gin at 11 am. Shannen, the sweet lovely bartender on internship is merry company. Download your tales as a solo or lonely traveller to the bartender. The scene is set for a “Lost in Translation” moment. I swopped stories with Shannen and was tickled by the sheer volume she has of guests who tipple in the morning. The interior is exquisite - more like a comfy living room you reluctantly depart when your gin is up. #eatstylishtravelstylish",
      "time": 1727949943,
      "translated": false
    },
    {
      "author_name": "Steve Sabu",
      "author_url": "https://www.google.com/maps/contrib/105984007420388624740/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVxlGY0fFp19hoyoQ8JoVc7T2DXCkZYCrbCHprmK73WclqRbl2F0g=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Discovering Tonic at the JW Marriott is like stumbling upon a hidden treasure. Nestled within the hotel, the journey to find this gem adds to the allure. A word of advice: Google Maps might lead you astray; the entrance is through the JW Marriott lobby, not the South Beach building off Beach St.\n\nOnce found, Tonic unveils an enchanting atmosphere, reminiscent of a secret library, with shelves adorned with countless books. The aesthetic sets the stage for an intimate experience, perfect for those seeking a unique and cozy ambiance.\n\nThe gin options are nothing short of excellent, and the cocktails, crafted with fresh ingredients, are a testament to Tonic's commitment to quality. The gin and tonic, a masterpiece in itself, stands out as one of the best ever tasted.\n\nService at Tonic is a seamless blend of attentiveness and expertise. With only a few seats, the setting is intimate, making it an ideal spot to kick off the evening with a couple of expertly crafted drinks. Tonic is more than a bar; it's a carefully curated experience, a rendezvous for those who appreciate the finer things in life. Cheers to uncovering this hidden oasis!",
      "time": 1703177897,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3553467562361052624",
  "user_ratings_total": 48,
  "vicinity": "30 Beach Road, Singapore"
}