{
  "formatted_address": "27 Bendemeer Rd, #02-659, Singapore 330027",
  "geometry": {
    "location": {
      "lat": 1.318852,
      "lng": 103.8629652
    },
    "viewport": {
      "northeast": {
        "lat": 1.320055580291502,
        "lng": 103.8641749302915
      },
      "southwest": {
        "lat": 1.317357619708498,
        "lng": 103.8614769697085
      }
    }
  },
  "name": "Top Faith Agency for Live In Caregivers",
  "place_id": "ChIJaWc2wJwX2jERDNtB29lVf9M",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "CH Tan",
      "author_url": "https://www.google.com/maps/contrib/105532323825192635636/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVM2nZq68ZjYBZf_VVBDMN8iS5XRWKsaeRpiA-2zqhWUqcXBMfj=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Joshua-Top Faith is an excellent Live in Caregivers agency. We are returned customers and will continue to spread the good name of Top Faith. Joshua has been very helpful and strive all out to assist us despite in a very complex situation and challenging case. A trustworthy agency as we know he has tried his best effort to assist all his clients. Thank you",
      "time": 1728511948,
      "translated": false
    },
    {
      "author_name": "HELENA Tan",
      "author_url": "https://www.google.com/maps/contrib/100450822973023115620/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocItve0oum_gm-3WUh_zNujZecyvfDO2mMXL2tQJ2Zm7lBFF0g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "Joshua is very professional and prompt in his response and paperwork which made our hiring process super fast and fuss free.  We also appreciate his after sales support when we need to consult him on how to handle our previous helper exit and managing the new care giver.  I also introduced Top Faith to my cousin for my uncle's care giving requirement.  T Q Joshua",
      "time": 1723875107,
      "translated": false
    },
    {
      "author_name": "Fiona Goh",
      "author_url": "https://www.google.com/maps/contrib/117259396069650839201/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXukzETCbW-RV0Ia8vIsbJhWIXvGtvc6kfavW6gZK35jXbVwYdx=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Subject: Heartfelt Thanks for Your Outstanding Service\n\nDear Mr. Joshua,\n\nI wanted to take a moment to express my deepest gratitude for the exceptional service you have provided during what has been an incredibly challenging time for my family and me. After my late father suffered a stroke and battled cancer, those were undoubtedly some of the most stressful periods in my life. However, thanks to your dedication, much of that stress was alleviated.\n\nYour prompt responsiveness to all my inquiries and your ongoing support for my helper have been invaluable. She has shared with me how much she appreciates the care and reassurance she receives through your periodic check-ins on her wellbeing. It’s a great comfort to know that both she and I could rely on you for help and guidance throughout this journey.\n\nI am very grateful to have been introduced to you by a hospital professional, and I could not have asked for better support during such a critical time. Your kindness, professionalism, and attention to detail truly made a difference.\n\nThank you once again for everything you’ve done.\n\nWarm regards,\n\nMs Goh",
      "time": 1731762260,
      "translated": false
    },
    {
      "author_name": "Sim Jeff",
      "author_url": "https://www.google.com/maps/contrib/111041495901293529890/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW7YLw-mMP0pqH8qtUXEMCo2TjPWw1dkPeWWiFxa7ofZpq7d2I=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Top Faith Agency has been efficient,  prompt and reliable in providing us a Caregiver to help to look after my brother.  Communicating with Joshua has always been pleasant with his friendly and helpful attitude. We are happy with his good service and wish him the best in his profession.",
      "time": 1696676853,
      "translated": false
    },
    {
      "author_name": "Shirl L.",
      "author_url": "https://www.google.com/maps/contrib/103840029137762365973/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJB7O7pl-Vn2S4eSgJBjCVG6piwfd-4bBBt_M5chQrnCe9PQA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Top Faith Caregiver Agency - Excellent Professionalism!\nAfter 3 bad experiences with helpers, I was losing hope until I chanced upon Top Faith Caregivers Agency while searching on Google. Mr Joshua called me the moment he received my message. I explained my situation and past experiences I encountered, and shared with him the possible challenges the helper might face with my mother. He asked quite a few questions about my mother's condition and informed me he has a ready caregiver to offer. I interviewed the caregiver on video call at that instance and was very impressed when Joshua suggested to bring the caregiver to meet my mother. It was an excellent gesture as I felt it's important that both caregiver and patient has to like and be comfortable with each other.\nIt's been 2 and a half months since the caregiver came to our house and she's brought so much joy to our family. With the bonus that she speaks mandarin, she's able to hold conversation with my parents and my mother's health condition has improved tremendously since she started caring for her. She's very encouraging when getting my mother to exercise and she genuinely cares for my parents. I'm very grateful towards Mr Joshua for being so understanding of the challenges I faced and also thankful that he's so professional in training the caregiver, in the result that she possesses the right attitude in caring for the elderly.\nI highly recommend Top Faith and I sincerely thank Mr Joshua for his professionalism and recommendation. God bless",
      "time": 1683084948,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15239994058219838220",
  "user_ratings_total": 35,
  "vicinity": "27 Bendemeer Road, #02-659"
}