{
  "formatted_address": "16 Jln Tenteram, Singapore 321016",
  "geometry": {
    "location": {
      "lat": 1.3281864,
      "lng": 103.8594003
    },
    "viewport": {
      "northeast": {
        "lat": 1.329587280291502,
        "lng": 103.8607317302915
      },
      "southwest": {
        "lat": 1.326889319708498,
        "lng": 103.8580337697085
      }
    }
  },
  "name": "Traveluxis Pte. Ltd.",
  "place_id": "ChIJy3ipkLkZ2jERR-1Dhc54aXU",
  "rating": 5,
  "reviews": [
    {
      "author_name": "SUKUMAR R",
      "author_url": "https://www.google.com/maps/contrib/104833413741577167005/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXaN-tkaebZrrIyVtLEkCuk1w1nycQ8cRVld5MZIVdX9n21iKRTOQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "I visited Maldives on my way to USA for 15 days. I stayed at Adhaaran resorts at Meedhuparu island. Island is very small but with all facilities. Those who enjoy water sports will have wonderful time here. The travel arrangements made by this agent along with the resorts people are well synchronized. No where we felt uncomfortable.",
      "time": 1630157433,
      "translated": false
    },
    {
      "author_name": "KB chevva",
      "author_url": "https://www.google.com/maps/contrib/116629451588751217575/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUE7MSdtL0V3Afzddtng5KVDJnoY2VTZ6hLCXpF279rGw2ABbYq=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "I stayed in Maldives for 15days, I booked my travel through Traveluxis. Due to some bad weather conditions in Male they didn’t dropped flight on time we went back Kerala airport and fly back to male ( almost 5hrs delayed). But I informed Traveluxis ppl they are very helpful in all my journey, they changed things accordingly without any issues to the customer. You can book your plan with out any issues and Enjoy your Trip. Thank you 🙏🏻 YESH for the help all time. I irritated with my question he used to reply and attend my call very responsibly whenever I do.\n\nThanks\nKanna",
      "time": 1630765891,
      "translated": false
    },
    {
      "author_name": "Sharath",
      "author_url": "https://www.google.com/maps/contrib/112693871283543839602/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWLClNnn0qWrj2J6VAfcdAVzSocal3IWSIke-EUZpmJ_a-t5kBQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "We had a very good experience working with Mr. Yesh, he has been very helpful, and responsive thought the travel and stay at Maldives on a private package. If we get another chance to travel, then we would definitely want him to be our travel agent. I would definitely recommend working with him to book your travels, to make it as easy, reliable and hassle free.",
      "time": 1628784926,
      "translated": false
    },
    {
      "author_name": "Saurabh Sharma",
      "author_url": "https://www.google.com/maps/contrib/104699804789325064519/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWeVBAVmmv8H3wYd2ssJIhxCk-BTIU2JRr-mXILdg600_GRaE6m=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "I recently booked travel package for Maldives with Yeshwant. Where should I start ? Yeshwant is the most humble guy in tour planning industry I came across.\nHis patience to understand the needs and criticality of time is remarkable. I was very reluctant to book a travel package with an individual whom I have never met but got reference from telegram/whatsapp group only. But all praises of him which were mentioned in group were 100% to the mark. He helped me get a pretty decent package for 4 adults for 16 days 15 nights in maldives in a very short notice(I asked him to provide me a package which would commence within 48 hours). His skills in terms of getting a great deal for customer were impeccable. Also since I am in USA and I was planning the trip for my parents in India, Yeshwant was always available round the clock, I never felt that he is not reachable. He ensured how things are going on at every check point. I would highly highly recommend Yeshwant to anyone who is looking for any travel booking. Building trust and transferring lacs of rupees to an individual a/c is a very tough task but Yeshwant built it so strongly that I wasn’t hesitant to provide him the business from my side. Great job done Yeshwant, keep it up like this always and you shall prosper !",
      "time": 1634279486,
      "translated": false
    },
    {
      "author_name": "Sunil Rathod",
      "author_url": "https://www.google.com/maps/contrib/111503422138290946741/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUBx7qXrsoKw9h79NeB2wIE9iSFVuyxdmL0imUa9TIXlYG0RmN_=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Mr. Yesh helped me book resort in Maldives. He was very responsive to my questions and helped me throughout my stay in Maldives till I checked out from the resort. He was quick and efficient. Also, provided information about travel even though I just booked the resort. He is humble and reliable. Thank you Mr. Yesh for helping with the bookings.",
      "time": 1630162115,
      "translated": false
    }
  ],
  "types": [
    "tourist_attraction",
    "amusement_park",
    "travel_agency",
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8460426203386604871",
  "user_ratings_total": 16,
  "vicinity": "16 Jalan Tenteram, Singapore"
}