{
  "formatted_address": "19A Dover Cres, #01-01, Singapore 131019",
  "geometry": {
    "location": {
      "lat": 1.3075128,
      "lng": 103.7842704
    },
    "viewport": {
      "northeast": {
        "lat": 1.308899080291502,
        "lng": 103.7855627802915
      },
      "southwest": {
        "lat": 1.306201119708498,
        "lng": 103.7828648197085
      }
    }
  },
  "name": "Trinity Medical Clinic",
  "place_id": "ChIJK8Z_XgYb2jERtkZDobcvD_0",
  "rating": 3.6,
  "reviews": [
    {
      "author_name": "Roderick Low",
      "author_url": "https://www.google.com/maps/contrib/112672292349616659347/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW1qvOFRw56KCJS5BijJL_Mzx4aOQQt9G28CGooOOe5BLKn4OMa=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "My sister fell seriously ill, and the old doctor prescribed an antibiotic that did absolutely nothing. By Day 3, her fever skyrocketed to 39.9°C, yet when she returned to the clinic seeking urgent help, she was dismissed and told to continue with Panadol and the ineffective antibiotic.\n\nTo make matters worse, the rude counter staff had the audacity to scold my sister’s husband for bringing her back before completing the course of antibiotics—despite her deteriorating condition! This level of arrogance and negligence is absolutely unacceptable.\n\nUltimately, my sister was admitted to the hospital and diagnosed with pneumonia. Had she continued following this clinic’s reckless advice, the consequences could have been life-threatening. The only competent person in that entire clinic was the substitute doctor who later treated my sister.\n\nIf you value your life or that of your loved ones, stay far away from this clinic. This is not healthcare; it is sheer incompetence wrapped in arrogance.",
      "time": 1741697245,
      "translated": false
    },
    {
      "author_name": "Rick Chan",
      "author_url": "https://www.google.com/maps/contrib/111359020626301498474/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXT8Kwl0AszXfzAa4jdff9PjAPwKdD5fZ9BPRBq692rF-X4DesoUQ=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "4 months ago",
      "text": "I had my poor hearing checked at a polyclinic and was given a appt to return for syringing weeks later. I went to this clinic instead to get it done sooner. The resident Dr. here examined and said my ear canal was clear.  Nevertheless she did the syringing just to convince me. When nothing came out, I said that I don't feel the water flushing inside my ear at all. I paid and left disappointed. Eventually i had syringing done at the polyclinic and a big chunk was flushed out and my hearing recovered.  What does that say about her practice?",
      "time": 1736752887,
      "translated": false
    },
    {
      "author_name": "K C",
      "author_url": "https://www.google.com/maps/contrib/102472870700376727609/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX1UplgyUk6jV6m8wrgLOapPSZyyrp2pNCVWfZEXJy_K_YCsqU=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "10 months ago",
      "text": "I regret to report an extremely unsatisfactory experience with this old female Dr. During my recent visit with my young kid, she displayed unprofessional behavior by scolding them without justification. Additionally, the diagnosis provided was incorrect, and several important aspects of the examination were neglected. For your peace of mind and well-being, I advise against visiting this clinic. I believe she needs some help to manager her temper!",
      "time": 1721042750,
      "translated": false
    },
    {
      "author_name": "GY Sun",
      "author_url": "https://www.google.com/maps/contrib/104693190246661130011/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIYayUEUaxNNJYBRe3VGPzhCJmhDcTbWmZVih5rA6ubCxZQWw=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "3 years ago",
      "text": "Been there several times. The receptionist is kind and friendly. There is a male doctor who is also very nice. However, there is this ‘incredible’ doctor, an old lady, who is extremely impatient, indifferent and bad-tempered. I’ve seen her twice and each time I felt very very frustrated. To be fair, she doesn’t charge unnecessarily. But her attitude, which is the worst of all the doctors I’ve seen so far, make it really hard for me to say any good words about her. I went to see a doctor, not to be talked off. Very unpleasant experience!!! I won’t see her anymore.",
      "time": 1648801523,
      "translated": false
    },
    {
      "author_name": "Caleb Khoo",
      "author_url": "https://www.google.com/maps/contrib/106649026967376158767/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXVSrHCXFcvJI7N5itNWcIzeo7jJpNDxATWy0dpIN_gL8gk_Ue_8w=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "10 months ago",
      "text": "\"If I could give zero stars, I would. I brought my young daughter in for a visit, and the old female doctor there kept scolding her without any valid reason. Moreover, she provided an incorrect diagnosis and didn't thoroughly check many important aspects. I strongly recommend going to the opposite Cornerstone clinic instead; it's much better. Save yourself the trouble and avoid this clinic. You'll regret going there.\"",
      "time": 1720966024,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=18234845881977489078",
  "user_ratings_total": 22,
  "vicinity": "19A Dover Crescent, #01-01"
}