{
  "formatted_address": "Persiaran Puteri Selatan, Puteri Harbour, 79000 Iskandar Puteri, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.4189268,
      "lng": 103.6563296
    },
    "viewport": {
      "northeast": {
        "lat": 1.420280030291502,
        "lng": 103.6576327302915
      },
      "southwest": {
        "lat": 1.417582069708498,
        "lng": 103.6549347697085
      }
    }
  },
  "name": "Trinidad Suites Johor, Trademark Collection by Wyndham",
  "place_id": "ChIJx0lyjA8N2jERV1jLL_9W0-I",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "johnny banderas",
      "author_url": "https://www.google.com/maps/contrib/114192146955161198489/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU-cKsHbQN-ketAEVp9wnDS40Bgn63Br28k_yOB-xsdsaw8wx8=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I recently had a one-night stay in a studio that I booked, and it was such a great experience! I reserved two rooms for about 5 people . The location was perfect! Staff were friendly at the front desk, making everything easy for me, and I loved that\n\nI did run into a little situation with an early check-in fee of 100 ringgit since I arrived at noon which i rejected.. Just a tip: if you get there early, it's best to wait until at least 1:30 PM to check in unless the room is ready. If it is, they charge that fee, but I think it's worth it for the convenience!\n\nOverall, I can't say enough good things about my stay. I've been there more than ten times because it's just that good! The staff is fantastic, and the amenities are great, too—there’s even a washing machine and a dryer in the rooms. The pricing is perfect, and the coffee shops nearby and some fantastic Arabic food options are just across the road.\n\nIt’s my go-to place whenever I’m looking for a spot to stay, especially when I plan to enjoy some delicious food during my visits to Malaysia. I can’t wait to go back!",
      "time": 1731998658,
      "translated": false
    },
    {
      "author_name": "georgette red",
      "author_url": "https://www.google.com/maps/contrib/114869531710940009285/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX_L7mnlUilWTLokmc-1yUJiWGfn9tShgCsndhVMgmVHlFNqA4=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "location, rooms, and service are all perfect. staff are very accommodating and kind, however, one day, after a day out i had come back to the hotel with my door left open, the cleaning staff had fixed up my room but left the door unlocked. overall an enjoyable stay but i was concerned for the safety of my belongings.",
      "time": 1738210871,
      "translated": false
    },
    {
      "author_name": "a a",
      "author_url": "https://www.google.com/maps/contrib/103399075199148507835/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU6OXv2O45aAdpkwyz2YYwBHApe_z_s9B08YXlPXAnOcMSN2AyK=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Staying in the private suite unit, been longing to complain regarding the security guys at the carpark very very ill- mannered!! Once/twice i forgotten to bring my card and 2 of them whine at me and even raise voice to me talking in their language as if they are unhappy. Totally feel like renting a shop houses, please train your foreign security man to have some manners, you only sit down without doing any work and you make it an issue when i only asked to open the carpark door?? Even the management implement this access card issue but you dont have to treat residents like this. So far the hotel reception is very2 helpful and nice and i really appreciate their help when in need",
      "time": 1742828391,
      "translated": false
    },
    {
      "author_name": "Khairur Azhan",
      "author_url": "https://www.google.com/maps/contrib/102777914819410859351/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUljOr5H3nqercDiMgkOTocbrHbcNFvVA21WnD2dY4UfWozveuD=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 3,
      "relative_time_description": "7 months ago",
      "text": "- Very clean studio room.\n- Strong water pressure in the bathroom.\n- No room slippers/toothbrush provided, may be the hotel will provide if asked (which I didn't).\n- Very pleasant hotel reception staff & very smooth check-in experience.\n- The hotel asked for MYR100 deposit (if pay by cash, it can be refunded upon checkout, if pay by credit card, refund will be in a few days).\n- Plenty of basement parking.",
      "time": 1729437878,
      "translated": false
    },
    {
      "author_name": "Fine Japan Sg",
      "author_url": "https://www.google.com/maps/contrib/116416788352626754328/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLMlWe59SJMBnSmdDs88dZJ0rt5h9iaRYILZjYu0_6zY0v-MA=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "5 months ago",
      "text": "Went to stay for 2 nights on a studio room. The room cleanliness was ok , bed and pillows are decent too. Staff are very friendly and helpful. Everything was good until the 2nd night when we back from outside , and we are not able to access the room through key card , apparently there door has some faulty and no technician was around. The staff asked if we are planning to go out again or just stay in room ? We felt extremely uncomfortable and scary to stay in broken door room, so my boyfriend asking if there is room available to change. 20 mins later the staff came back and said we can shift to another room exact same type at level 1. We are totally fine , after shifting everything to new room , we realize the amenities differences with what we had in our original room. It come with a super small non smart TV without any channel which is really unpleasing as we lost the only in room entertainment which we both enjoyed every night in our staycation. So my boyfriend call to check with front desk and the front desk claimed that all their amenities are the same , the one we had in our original room was the unique one ! What ?! We got forced to change the room because of their door faulty and they gave us a worse room compare to what we originally had. The entire stay has totally become too disappointing and I don’t think I will ever visit again",
      "time": 1733731392,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16344503126676166743",
  "user_ratings_total": 443,
  "vicinity": "Persiaran Puteri Selatan, Puteri Harbour, Iskandar Puteri"
}