{
  "formatted_address": "Persiaran Puteri Selatan, Puteri Harbour, 79000 Iskandar Puteri, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.418845,
      "lng": 103.656547
    },
    "viewport": {
      "northeast": {
        "lat": 1.420208480291502,
        "lng": 103.6577386302915
      },
      "southwest": {
        "lat": 1.417510519708498,
        "lng": 103.6550406697085
      }
    }
  },
  "name": "Trinidad Suites Puteri Harbour Iskandar Puteri",
  "place_id": "ChIJ_59VUxQM2jER9G-eQwUsPDQ",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Mohd Najib Abdul Rahim",
      "author_url": "https://www.google.com/maps/contrib/110896738956331947313/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKsNg1n-5AKxidqtwsqbcuM6m2KpwuYxhYiM2mn5eEizPYK8Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "The host were very helpful. Large unit with 3 comfortable bed. Near to restaurant,quiet location. Ample parking space.",
      "time": 1746241994,
      "translated": false
    },
    {
      "author_name": "Ismail Azlina",
      "author_url": "https://www.google.com/maps/contrib/106862012656752737878/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXQRySp1KKpGgu9TDoiuEmJt5o5HAGzmyVUMep54rn5WG1brgQl=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 2,
      "relative_time_description": "3 weeks ago",
      "text": "This hotel is spacious but unfortunately I had hell during my 5D4N stay. Changed room 3 times. Air conditioning in the room has bad odor. The other room, air conditioning wasn’t working, on the first night, the door is alarming for entire night and day. No one seem to fix it up.\nBreakfast- poor. Given the same hotel stars, Ibis and Holiday Inn Express have got better food.\nThe front desk employee can’t even give a General Manager’s name of the hotel with his or her email address to file a complaint. Been asking for two days and he doesn’t even know the name of their GM 🙄. Or maybe this hotel doesn’t have a GM. Poor hotel even though a 4 star. Not recommended for business travel.",
      "time": 1745718857,
      "translated": false
    },
    {
      "author_name": "EFong Edmund",
      "author_url": "https://www.google.com/maps/contrib/111016230883418123708/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLsnF61cWBHcqdR87Nm-PbshHKnueELQDuZkYp07_3lS_zhfA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "Very poor service from house keeping asked to replace battery for aircon control 4 times no response and asked reception staff to help also no response very disappointed even after 5 hours after check in no response. How to claim 4 star hotel with no services rendered",
      "time": 1746975681,
      "translated": false
    },
    {
      "author_name": "Winnie Choy Wing Yin",
      "author_url": "https://www.google.com/maps/contrib/105960531570158040612/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUDqzPMai3JQpWMKEOCAcs8G2HBJtXtcd4PV2kOz2UunfUmTz0=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 3,
      "relative_time_description": "4 months ago",
      "text": "I've just stay 2 nights in Trinidad Suites, even the things was kinda changed but there was something I would like to review:\n1. Room : The room was spacious and cozy, it feels like you are at your own home. There's a refrigerator, microwave and cooking stove provided. However there's some basic amenities are didn't provided, no dental kit, shower cap & slippers. Cooking utensils are provide upon request but we don't really need it as we not cooking. The only thing is there's no table cloth for us to wipe the bar table, we are only using tissues to wipe it up. The only thing that make us happy is the room comes with balcony. I was request for high floor but they only give me on the 1st floor and I can understand that it's subject to room availability.\n2. Service : The hotel staff was friendly and yet helpful. They allow us to check in without waiting until 3pm as I was coming all the way from KL after my night shift finished and was so tired. The only thing was quite dissatisfied is there's no concierge or bellman for helping out with the luggage during check in and check out, we have to carry our luggage by ourselves. The parking was free of charge for the hotel guest, we no need to be hassle and worrying about parking validation or flat rate. There's also got breakfast and lunch in the hotel but we not really need it as we prefer to eat outside.\n3. Location : The location was so so as it was near to Legoland and Mall of Medini. But the surrounding in Puteri Harbour was look like a rundown compare with the environment when I was been there 8 years ago. Beside of the hotel was Hello Kitty Town & Thomas Town but was shut down already. Most of the shop lot nearby was closed due to COVID-19 pandemic and lack of tourist attractions. There's less choice of the restaurant nearby, we have to go to Eco Botanic or JB city centre for finding the food. The place also near to Malaysia - Singapore border in Tuas, just 20 minutes drive. From the swimming pool, you can see the beautiful view of Puteri Harbor and Straits of Johor.\n\nOverall I have an amazing and smooth stay, I only give 7/10 due to the environment surrounding the hotel area was not so good. Will I come back? Maybe if the surrounding was have improvement and get more attractions.",
      "time": 1736000122,
      "translated": false
    },
    {
      "author_name": "Coco Carreon",
      "author_url": "https://www.google.com/maps/contrib/111348145633037342999/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIOLxhKpqcc624kAHYx74TUABWIZAewiqjrgXBzDIaZ5Iny7g=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "We enjoyed our long weekend stay here at Trinidad. It's a beautiful and modern hotel. Loved the room - clean, spacious and comfortable that gives great sleep. Beautiful infinity pool overlooking a picturesque view of the yacht club and Straits of Johor. The hotel staff is very friendly and warm, made our short stay feel really special. It also offers a great location - you can go down at night to enjoy the pubs and great restaurants around as well as enjoy walking around the clean, lovely surrounding parks. Will definitely stay here again when we are back in Johor.",
      "time": 1718611491,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3763931789695807476",
  "user_ratings_total": 1068,
  "vicinity": "Persiaran Puteri Selatan, Puteri Harbour, Iskandar Puteri"
}