{
  "formatted_address": "60A, Jalan Eko Botani 3/2, Taman Eko Botani, 79100 Iskandar Puteri, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.4396163,
      "lng": 103.6196199
    },
    "viewport": {
      "northeast": {
        "lat": 1.441048630291502,
        "lng": 103.6210296302915
      },
      "southwest": {
        "lat": 1.438350669708498,
        "lng": 103.6183316697085
      }
    }
  },
  "name": "TSC White Salon | Eco Botanic | JB Hair & Nail Salon",
  "place_id": "ChIJYeJr7M0L2jER7LtjyzT5_dQ",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Nora Nora",
      "author_url": "https://www.google.com/maps/contrib/114545061071114417995/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV03dnjB_ejOucrUmydp5ZSUDPguwgZhdGuNm9J3EaFtuDhkpo=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Wonderful experienced. I don't feel awkward or nervous. The staffs and stylist Oscar are professional and good,they help me to pick the suitable hair colour for me. The scalp treatment really helps a lot. My scalp so extra clean now. No hardselling, and you're free to ask anything from them. Recommended for you all to try experience it yourself! Worth the time and moneyyy. Good job TSC",
      "time": 1743233106,
      "translated": false
    },
    {
      "author_name": "Tasha",
      "author_url": "https://www.google.com/maps/contrib/115687957004691570694/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUIEgrF8rO70wcpgx_wTO74wirgM0T6ZRN8LFrYr1WIi1to1avN=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "I had a wonderful experience at this salon! The staff were incredibly attentive and meticulous throughout my visit. From the moment I stepped in, I felt well taken care of. My hair and nails turned out beautifully — you can really tell they take pride in their work and pay close attention to detail. Highly recommended if you’re looking for quality service and a relaxing atmosphere!",
      "time": 1746765881,
      "translated": false
    },
    {
      "author_name": "Melody Chan",
      "author_url": "https://www.google.com/maps/contrib/114782213923158129777/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIoXDHIFyHbuA13xN9q6ZJwgTT6_mmg6pCJgG1yitcWxbdQpg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Highly recommended. The staff were patient in explaining and discussing the hair colour I wanted to achieve. They were attentive to details and determined to ensure customer’s satisfaction. Their service was superb — from serving tea to welcome massage and they provide excellent head massage during the hair wash. They were very thorough and professional in what they do. Place was clean and comfortable. All are well mannered, pleasant and efficient in their work and as a team. Will definitely come back here again!",
      "time": 1744633628,
      "translated": false
    },
    {
      "author_name": "Philip Min",
      "author_url": "https://www.google.com/maps/contrib/117856055083791338800/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXi40d8uq4g1mdJaWlrXPiqOifFCtD7CnAS_5Fq7IQ5lpGEmP34=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "It is a very comfortable environment and hair stylist Jason very patience explained to me my hair condition and how to take it daily. Highly recommend this place for everyone.",
      "time": 1746416336,
      "translated": false
    },
    {
      "author_name": "WM",
      "author_url": "https://www.google.com/maps/contrib/109123060858334739092/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWxnWuK6crV8B70_WJ29KKAFr1pKiD5cx78G7KLHHhCXDkyW86SiA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "The salon had clean and minimalist interiors, and was very comfortable. I was first warmly greeted by the receptionist Pei Xin, and then the senior stylist Oscar came out immediately to meet me to discuss my requirements and understand what I want to do. Once we agreed on what to do, he didn't insist or hard-sell when I declined the hair treatment suggestion.\n\nThen, the assistant (girl with tattoo on the back of her arm, I didn't manage to get her name) started with a welcome massage and checked in with me all the time if everything is OK and if I am always comfortable. Then she and another assistant started with the hair dye process. I thought it was particularly thoughtful of them to cover my face with a shield to prevent splatters from getting into my eyes, in addition to the usual ear covers. Once done, I was pleasantly surprised that there was a hand massage.\n\nAfter waiting for a while for the colour to sit, the hair wash was my favourite part and I almost fell asleep because it was so comfortable and relaxing. Then my hair was dried and Oscar came back to trim my hair. Even though I am fussy (I always believe it's no big issue because hair will always grow back), I felt the results were not great as the colour came out different and the haircut was just ok, not great.\n\nHappy with the great service nonetheless  For a cut and colouring, it cost RM410 for my hair length. It may seem pricey but again, it was well worth it as the staff provided excellent service and made me feel like a VIP. Everything they did was explained, and they also made sure to check in with me all the time if everything is going well. Location wise is just a few steps away from Tasixi. Overall, still happy even though the end result was not that great.",
      "time": 1739535020,
      "translated": false
    }
  ],
  "types": [
    "beauty_salon",
    "hair_care",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15347697110294445036",
  "user_ratings_total": 1313,
  "vicinity": "60A, Jalan Eko Botani 3/2, Taman Eko Botani, Iskandar Puteri"
}