{
  "formatted_address": "231 Jln Kayu, S 799455",
  "geometry": {
    "location": {
      "lat": 1.3960271,
      "lng": 103.8728947
    },
    "viewport": {
      "northeast": {
        "lat": 1.397279130291502,
        "lng": 103.8743119302915
      },
      "southwest": {
        "lat": 1.394581169708498,
        "lng": 103.8716139697085
      }
    }
  },
  "name": "TSquared Eats Meal Prep",
  "place_id": "ChIJA6ZFF9MZ2jERJiYgiVcmvfE",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Sarah Siregar",
      "author_url": "https://www.google.com/maps/contrib/117359208357227853984/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXuqEVQOX5omrNtCJerDZOmK_LSWjFvZX1btQf_CnttOL4t-SY=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "In an effort to lose unwanted fat and weight, I tried a few healthy meal prep companies. Unfortunately, they always fell short of my expectations. Inconsistent portion size, dry meat, bland taste or way too much sauce used - they were not worth the money spent. I stopped ordering deliveries,... until I found TSquared Eats.\n\nTSquared Eats uses premium ingredients, the meals taste absolutely delicious, the portions are generous, and the meats..... oh they are tender and juicy!! I have ordered a few rounds of their Balanced meals and it really helps fast-track my fat and weight loss progress!\n\nKudos to Utso and the team! Keep up the great work!\n\nPS: Their deliveries are always on-time, too :)",
      "time": 1739020634,
      "translated": false
    },
    {
      "author_name": "Shi Jia Leng",
      "author_url": "https://www.google.com/maps/contrib/100671219240370435929/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW_DWYr1HmuJah50iV-u-KS5fibpelmVIZ651wB345S5Hxh0ayYqw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "First time trying out Tsquared Eats. Highly recommended. My plan is the sculpt with estimate 350 calories a meal. I love how they have different types of protein, vegetables and carbs and how they are making individual meals taste delicious. Healthy and tasty! Delivery everyday on time.",
      "time": 1737654802,
      "translated": false
    },
    {
      "author_name": "Tazin Hossain",
      "author_url": "https://www.google.com/maps/contrib/104155661214100120642/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJmq8dDJHV1dMXnXTyWDJoeDYj4MV0dGcd4XsmaP9Ys9OCnRw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "I just wanted to express my heartfelt appreciation for your incredible service and delicious food. Every order has been a delight, and I truly love the taste and quality you consistently deliver. Thank you for making every meal feel special!Thanks again💓",
      "time": 1745478520,
      "translated": false
    },
    {
      "author_name": "Dev Shanker",
      "author_url": "https://www.google.com/maps/contrib/100403588068649806913/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKDooW8yjYdX7pWm2FhHo2ZvPHJ4yIy-oet9sBbySnUpu1DzA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "I adopted a lacto-vegetarian diet four years ago and it was certainly a challenge for me in meeting my daily calorie intake and obtaining the necessary nutrients, especially in the past one year when my focus shifted to improving my physical fitness. While chinese vegetarian food are more accessible in most neighbourhood hawker centres and are also usually pocket-friendly, their foods are mostly high in carbs and there aren't that many healthy options for proteins or healthy fats. I became increasingly concerned about my diet, since the vegetarian food that we buy outside are usually laden with MSG, salt and oil and mock soy meat and are aimed at \"replicating\" the flavour of meat dishes, and very little priority goes to the nutritional profile.\n\nMy woes came to an end after a search online led me to the plant-based menu offered by T-squared eats meal prep service. I have been a subscriber since August 2024. I find the cost reasonable and justified given the generous serving size of the meals. The foods prepared are tasty, nutritious and wholesome, thanks to the culinary expertise of the head chef and co-founder Mr Sid as well as the team of nutritionists. No more meal prep monotony, since the menu offered by T-squared eats boasts of a wide and impressive array of different cuisines which changes every week. I always look forward to checking out their menu and ordering my meals every two weeks. A big thumbs up to the customer service representatives who have been very helpful and timely in responding to my queries (even on occasions when I had to contact them after hours or on weekends). This shows the team's unwavering commitment to their clients and their high standards of professionalism. The team also does its best to accommodate specific dietary restrictions or preferences of its customers, where possible. The Quorn meat that is commonly found in NTUC supermarkets contains egg white. As I exclude eggs from my diet, I have been told by the customer service representative that the Quorn meat, if used in the meals that I order, is from the vegan line of the brand. It also puts me at ease to see that my ordered meals are labelled as 'lacto-veg' and allergens (if any) are clearly indicated on the container. I also learned from the customer service team that the plant-based menu is prepared in a separate kitchen so this avoids the possibility of mix-ups with meat dishes. I have shared some photos of the meals from the plant-based menu that I enjoyed, in this review. My sincere and heartfelt thanks to T-squared eats for being part of my fitness journey and ongoing transformation. I am a satisfied customer!",
      "time": 1729120060,
      "translated": false
    },
    {
      "author_name": "Cassandra Lim",
      "author_url": "https://www.google.com/maps/contrib/105003262611144522287/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJCJwJ4eL2opB2lKjhPkBKQUmofUHRzJrMkgnvUxJLu79WZSQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "the standard drop is crazy. sure they deliver on time, sure food is healthy. when we first ordered it was delicious. now they sneak in horrendously bland boiled vegestables and barely seasoned meat. they can do better as they have in the past. will be looking elsewhere for better options",
      "time": 1743577698,
      "translated": false
    }
  ],
  "types": [
    "meal_delivery",
    "store",
    "health",
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17419121091143542310",
  "user_ratings_total": 98,
  "vicinity": "231 Jalan Kayu, S"
}