{
  "formatted_address": "1 Stadium Pl, #01-35, Singapore 397638",
  "geometry": {
    "location": {
      "lat": 1.3034378,
      "lng": 103.872618
    },
    "viewport": {
      "northeast": {
        "lat": 1.305258880291502,
        "lng": 103.8737127302915
      },
      "southwest": {
        "lat": 1.302560919708498,
        "lng": 103.8710147697085
      }
    }
  },
  "name": "Typhoon Cafe (Kallang Wave Mall)",
  "place_id": "ChIJZZ7n9ksY2jER94zTfjSs-I0",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Bee lay Chua",
      "author_url": "https://www.google.com/maps/contrib/110116416726001685500/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLyO4dkbRe17fBAU-fc_qoevMdBK9Mr3phm72FXpBhYA3x6lA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "My lovely daughter brought me to this Typhoon cafe for Mother’s Day. The desserts definitely lived up to its name! I thought it would be mediocre dessert place despite its hype around it, but it definitely blew my expectations out of the water! The ambiance was amazing, the manager that served us, Sharon, was extremely friendly and helpful! Amazing customer service and great food! The other dishes were also very solid on top of the desserts! We left the restaurant absolutely satisfied! :)\n10/10 would recommend! Would definitely come again!",
      "time": 1746776311,
      "translated": false
    },
    {
      "author_name": "CELINE Ang",
      "author_url": "https://www.google.com/maps/contrib/103178793637738388785/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX4uQwEfU5Bd4UsRBx0tSi0ZZWX0Ds1GOY02wxlMKvL8Oj9SWI8=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "The desserts were visually appealing and tasted good overall. The cake, while rich and satisfying, was slightly too sweet for my liking. The fluffy pancakes were delightful with a perfect balance of textures, complemented well by the ice cream and fruit. Despite the sweetness, the experience was enjoyable. A special mention to Sharon for her good service she was attentive, friendly, and made the visit even more pleasant. Highly recommended for those with a sweet tooth and an appreciation for great service.",
      "time": 1737274589,
      "translated": false
    },
    {
      "author_name": "Aurélie B",
      "author_url": "https://www.google.com/maps/contrib/103676378224869889358/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLI66gnz8zZ6v99Z58RW-YaFDzOy-vMSP-vcQ2-ZojtzfU_YQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Amazing signature soufflé 🤩 Very yummy ! Try it, you will not be disappointed ! I have a sweet tooth and clearly enjoyed every bite of it! I also recommend their pear tea. I have tried their chocolate waffle but preferred their signature souffle. Staff is super nice and friendly. I do recommend this place 100%.",
      "time": 1741865699,
      "translated": false
    },
    {
      "author_name": "Lim Shiliang",
      "author_url": "https://www.google.com/maps/contrib/117673096590851240173/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIruVQMoOZkNA2a0Txp6EVOywM1YLqAt1ajYEWe2dTHJ7kMDA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Was looking for dinner place & chanced upon the Typhoon Cafe . Was immediately greeted by a very friendly & smiley lady , Sharon. She's very attentive and makes sure she greets every customer with a very positive attitude. Definitely the kind of staff any restaurant would want to have , hands down",
      "time": 1745497804,
      "translated": false
    },
    {
      "author_name": "Happy Bird",
      "author_url": "https://www.google.com/maps/contrib/108716533290322327726/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVFUYN1zBdnhezGS3qKnZtkHSHSiRCGdNoWqwtp1WX5jPujslv2=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 2,
      "relative_time_description": "2 weeks ago",
      "text": "First off, let's get one thing out of the way, the food here was outstanding. Perhaps even better than some of the best restaurant foods we've had in Taipei. The souffle pancake, the pork rice and crispy chicken rice were real standout dishes. The trouble was the staff. The female staff was impatient and short with us. The male one was simply crude, uncouth and repeatedly slammed our dishes and cutlery on the table like we weren't even there. They appeared frustrated and perhaps overwhelmed by the crowds and decided it was best to vent it out on us, their paying customers. Here's a word of advice, if you feel overworked, unappreciated, unnoticed by your superiors, TAKE IT UP WITH THEM, NOT your paying customers. Do not behave as though you are doing us a favour by serving us. It is after all your job, a job you chose by your own free will. We on the other hand, as paying customers are in fact doing you and your restaurant a favour by patronising your establishment. There are many many other eateries at Kallang Wave we could have easily dined at and would likely have if not for your eatery's participation in the Kris+ promotional campaign. The staff's attitude is unfortunately the reason why we will not be returning to this branch. For those who are brave enough to venture to this eatery, we suggest that you go during off peak hours or run the risk of facing their collective wrath. And to the 2 restaurant employees who were unable to contain their frustrations, there are other jobs in this country that wouldn't test your patience and delicate sensitive nature. Try those instead and spare future customers your childish tantrums.",
      "time": 1746278258,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10230115895038151927",
  "user_ratings_total": 2169,
  "vicinity": "1 Stadium Place, #01-35"
}