{
  "formatted_address": "129 Kim Tian Rd, #01-127, Singapore 160129",
  "geometry": {
    "location": {
      "lat": 1.2813008,
      "lng": 103.8285752
    },
    "viewport": {
      "northeast": {
        "lat": 1.282534830291502,
        "lng": 103.8300057802915
      },
      "southwest": {
        "lat": 1.279836869708498,
        "lng": 103.8273078197085
      }
    }
  },
  "name": "U Mart Kim Tian",
  "place_id": "ChIJnap81p8Z2jERacbPef2mNWA",
  "rating": 1.7,
  "reviews": [
    {
      "author_name": "Honey Cookies",
      "author_url": "https://www.google.com/maps/contrib/100960938526696310741/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVWLpbtpcoqeCK6GCmghAmA3G3-I1p3_AlcoviSqILuqm2BGFU=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "The staff member who served me, an older lady with white and black hair (appearing to be in her mid-50s), was extremely rude throughout the interaction. When I informed her that I was there to collect my parcel, she responded with an unfriendly attitude. Despite providing her with the pin number loudly and repeating it several times, she still appeared to misunderstand. Instead of addressing the issue professionally, she scolded me and said, \"Can you talk louder?\" in an uncalled-for tone.\n\nThis experience was frustrating and has left a negative impression.\n\nI kindly request that the boss could look into this matter and take appropriate steps to address the staff member’s behavior. I hope necessary actions will be taken to improve customer service standards to prevent such incidents in the future.",
      "time": 1734164468,
      "translated": false
    },
    {
      "author_name": "Joyce Ong",
      "author_url": "https://www.google.com/maps/contrib/110200455987536373484/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU9A6RmaH-XG1NmuUZ5IQIR4T0Eveb9L598UFZic0MObLNZ1CGw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Just a little minimart that also does parcel collection. Might have to wait a little bit if there are other customers in the minimart but that's perfectly fine. If you're here to collect your Shopee parcels, have your PIN number ready (in the WhatsApp message from Shopee)",
      "time": 1702197296,
      "translated": false
    },
    {
      "author_name": "Low Ying Ting, Nicholas",
      "author_url": "https://www.google.com/maps/contrib/100567483172026414334/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK2VVqO0TbN_f3GaePYSq8diZnj5iy-p4KJH7i3pwFnF4Ysgeea=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "7 months ago",
      "text": "Visited just now(at approx 9:20pm on 11 October friday 2024) and unfortunately had problems paying with the dbs app. Told the cashier, but she(short haired woman in her approx 50s) was extremely rude and proceeded to scold me for no reason and also blame me and my phone. Asked for another mode of payment and she didn't even try to come up with a solution. Only showed her black face towards a customer that came in peace. Not only I didn't leave with my drink, I also left extremely mad. Would rate 0 stars if i could. The cashier definitely has some deep seated problems that need to be corrected by her boss. With how this business also being known to scam people, you SHOULD NOT VISIT OR SUPPORT THEIR BUSINESS IF POSSIBLE. Businesses like these need to learn the HARD way.",
      "time": 1728674778,
      "translated": false
    },
    {
      "author_name": "Jonathan Low",
      "author_url": "https://www.google.com/maps/contrib/118089955976794576817/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ_FjFpEbWXN71ne3rRjwaCYV6SikyOK208ic9Ep1_ufLUqjg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "I would suggest not to come here to drop off and/ collect your online purchases. The staff treats online drop off/ pick up like 3rd class citizens.  The vibe you get there is something you won't want when you step out of the unit. Even if you were to buy things and collect your parcels at the same time they'd tell you to queue to pay up then rejoin the queue again for pick up.\n\nWhile collecting your parcels they expect you to tell them parcel size, S,M,L or XL.  I witness them telling off people when buyers tell them they are not sure of the package sizes, I mean for goodness sake how can you pick parcels by judging the sizes instead of having a proper inventory system. Don't include pickup and drop off when you got no space catered for it!\n\nOnline says they accept small and large parcels, when you try to drop a larger item they'll tell you they don't accept due to space constraints.  If so then please jolly well update your requirements and not expect people to bring their parcels there to drop off only to be told they cannot drop parcels there due to space constraints.  If you'd have stated properly then there won't be such issues at the first place.",
      "time": 1708438512,
      "translated": false
    },
    {
      "author_name": "kai-romi -",
      "author_url": "https://www.google.com/maps/contrib/115236779171648389874/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLNnirQV80hip316p7sJmJQYbBUuNXtnDY0fkP-PiPzxeuG4U0=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Would give 0 stars if i could. Told the lady at the counter that I have 5 parcels to collect, gave her the 1st pin & it says unable to find (this happens when parcels are packed tgt, so only 1 of the pin works) then she proceeded to said \"NEXT CUSTOMER\". I then said I have 5 parcel and she got annoyed with me & took another pin that works & threw my parcels on the floor when she came back. Thankfully, there was this other worker, a guy, who was helpful. Please think twice before going if you dont want to have your day ruined.",
      "time": 1704508953,
      "translated": false
    }
  ],
  "types": [
    "convenience_store",
    "store",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6932630809007343209",
  "user_ratings_total": 15,
  "vicinity": "129 Kim Tian Road, #01-127"
}