{
  "formatted_address": "865 Mountbatten Rd, # 01-22/23/24/25, Singapore 437844",
  "geometry": {
    "location": {
      "lat": 1.3037611,
      "lng": 103.9008959
    },
    "viewport": {
      "northeast": {
        "lat": 1.305103930291502,
        "lng": 103.9024132302915
      },
      "southwest": {
        "lat": 1.302405969708498,
        "lng": 103.8997152697085
      }
    }
  },
  "name": "United Channel | Maid Services | General Cleaning | Aircon Cleaning | Carpet Cleaning | Plumbing | Painting | Handyman",
  "place_id": "ChIJV1VVlW0Y2jERDxxYtUGkUA0",
  "rating": 4,
  "reviews": [
    {
      "author_name": "MChen",
      "author_url": "https://www.google.com/maps/contrib/105024865601663567719/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI0jDokbK10aAZNkbZ1GT_T-PLhLVnY8qB0Y_m6m4q_M2ZMXg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I recently engaged the Professional Cleaning service from United Channel through Ms Mandy. She sent 3 staff to do the cleaning over 5 hours and they did an excellent job. The staff worked diligently and they did the cleaning thoroughly. I am very impressed with the results. Thank you Ms Mandy!",
      "time": 1742222700,
      "translated": false
    },
    {
      "author_name": "Lynn Tay",
      "author_url": "https://www.google.com/maps/contrib/109369517345952463861/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJkPpklOA0knUol8TCo80vtWRH6y_3XaFRUZD8LPpuVuyTCGQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "I gave a 1 star rating because I feedback the issues to the staff and he never respond at all.\nThe helper cleaned the windows but the glass became dirtier then before. I have to cleaned the windows myself n I noticed the water is dirty. I concluded she cleaned the windows without changing the bucket of water.  Wonder company allow this kind of standard?\nI didn't want to feedback until I see my kotchen's blinds. Speechless.\nI have used their helper a few times. This is a very unpleasant experience.  It got worst when the staff don't respond to my feedback. It shows that they are not interested to make it better.\nAll I want is to let them be aware and train their staff better. Being home for 4hrs for cleaning service and end up with a feeling that the house was dirtier is not a good feeling.\n1st n 2nd picture is after the cleaner cleaned my windows n kitchen blinds.\n3rd picture is the window after I cleaned it.",
      "time": 1737350609,
      "translated": false
    },
    {
      "author_name": "J. Lok",
      "author_url": "https://www.google.com/maps/contrib/110463967361341826119/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIFfail2Gbo7ktWfHThE7PahnxxNLl5ACifkphJ3bLHqmW2MQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "My wife and I recently hired a part time cleaner with this maid agency. The helper assigned to us was really good. Not only she was efficient, she can speak a bit of English, so we didn't have any issue in communication. Overall, we are very satisfied with the service.",
      "time": 1742988755,
      "translated": false
    },
    {
      "author_name": "Eza Zulaiha",
      "author_url": "https://www.google.com/maps/contrib/102177615752459162335/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIjnnLIY8nstk4Iis4rIIPqJEccpmwWhEdTbfpnLrjHuAMPM58=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "This wasn’t my first time engaging their cleaning services — my first experience was back in 2023. Even then, the service was already below expectations. Despite that, I decided to give them a second chance. I booked a 4-hour session at $87 per day and engaged their services for two consecutive days.\n\nOn the first day, staff member Ching arrived with an unpleasant attitude. When my mum spoke to her, she didn’t even acknowledge until my mum had to raise her voice and call her out on it. Her work ethic was poor; she only cleaned visible areas or what she considered dirty. It was just surface cleaning — no thorough effort or attention to detail, and she made no attempt to clean harder-to-reach spots or dust off difficult areas.\n\nOn the second day, staff member Win was more pleasant in attitude but still displayed poor work ethic. She dropped my belongings multiple times while cleaning. I asked her to clean the entire kitchen and replace my cabinet liners. However, since I didn’t have enough liners, she skipped cleaning certain cabinets and drawers altogether, rather than going the extra mile to clean those areas anyway.\n\nWill I ever booked again? No. Will I ever recommend anyone to engaged your service? Absolutely not. There's other company who does better job than this and alot more reasonable price that provides their own cleaning tools/solutions.",
      "time": 1742984289,
      "translated": false
    },
    {
      "author_name": "Nicolas LESNISSE",
      "author_url": "https://www.google.com/maps/contrib/118207907532504380067/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJyuDbgs5jnd8MuR3wR25MkuIiUDR6bImXk-VhAkkYwAcfTpw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "I am extremely disappointed with this cleaning company. After scheduling a confirmed first session, it never took place. Despite multiple follow-ups, I received no response from Sharon. Appointments were either canceled or misunderstood, and even regular sessions had discrepancies in pricing compared to what was advertised on the United Channel website. Messages went unanswered, and no clarification was provided on the pricing. This reflects a clear lack of professionalism. I highly recommend avoiding this company and supporting more reliable services.\n---\nFollowing your response on 08/03/2025 stating, \"We have checked our system, but we are unable to locate your record,\" I am editing my review to add this second part and include screenshots as evidence. These images clearly show our exchanges, the lack of response, and the discrepancy between the quoted price and the one displayed on your website.\n\nIf your intention was to suggest that I was never a customer and that this situation never occurred, I believe these screenshots provide proof to the contrary.",
      "time": 1741489207,
      "translated": false
    }
  ],
  "types": [
    "laundry",
    "general_contractor",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=959447322752195599",
  "user_ratings_total": 328,
  "vicinity": "865 Mountbatten Road, # 01-22/23/24/25"
}