{
  "formatted_address": "1 Jurong West Central 2, #01-16C, Singapore 648886",
  "geometry": {
    "location": {
      "lat": 1.3395577,
      "lng": 103.707066
    },
    "viewport": {
      "northeast": {
        "lat": 1.341259580291502,
        "lng": 103.7080106302915
      },
      "southwest": {
        "lat": 1.338561619708498,
        "lng": 103.7053126697085
      }
    }
  },
  "name": "UOB Branch - Jurong Point Branch",
  "place_id": "ChIJ1x8A6OwP2jERXLgyYPoWNNk",
  "rating": 2.1,
  "reviews": [
    {
      "author_name": "Cheryl S",
      "author_url": "https://www.google.com/maps/contrib/105222867469512313155/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW5n5r4eCys5xpVgMjH3VP6OAvxhf5wO4RPTcBMQNSfuG4IFgQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "Horrible waiting times. Happy to wait if given realistic expectations of time but no. Also other people are possibly doing services that can be done from the app, I am locked out of my own app and the only way I can do this is to visit a branch. Can we have a queue different from regular services vs a simple unlock?",
      "time": 1746608895,
      "translated": false
    },
    {
      "author_name": "Connie wong",
      "author_url": "https://www.google.com/maps/contrib/105372013465879989585/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXBN9TMBp6xf-gYceOnl3GYN1QeWufH2XSK78N3F6tE7jhMpNfj=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "I am very disappointed with the service I have received. My credit card was approved in March 2025, and despite repeated requests and follow-ups over the past two months, I have yet to receive it. I have contacted UOB several times to report this issue and request a replacement card, but without success. Even after filing a report, the promised follow-up did not occur. A visit to a branch in person was also unproductive. I am concerned about the reliability of UOB given this experience, especially since my debit card deliveries to the same address have never had this issue. Therefore, I believe this is a mistake on the bank's part.",
      "time": 1747103631,
      "translated": false
    },
    {
      "author_name": "Sharina Bynes",
      "author_url": "https://www.google.com/maps/contrib/112455686131891152322/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWgGz3ZHyAUqlWg8pPBbno-zKwagdXFDvZONVs78eCzaOorMIdf=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Avoid at all cost unless you like to wait. Happy to share the time stamp on my queue number. Have been waiting for more than 1.5hours …to simply just get a cashiers order!\n\nAnd I’m still waiting! Asked the concierge if it’s normal and they said yes and the other young chap can still “blame” me and say I can get the queue number online? How would I know???\n\nZero customer service. RIDICULOUS WAITING TIME. Feel like fainting here…",
      "time": 1712307436,
      "translated": false
    },
    {
      "author_name": "Adelene Chua",
      "author_url": "https://www.google.com/maps/contrib/109353830475109083061/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKrqbtOWJ2KtoX_DFvwMsVVY6DdgFarLjjoWsIcgHgXUwyJog=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "We booked for Cny new notes to be collected between 3pm-4pm. When we reach the bank at 3pm,  we are shock to learn the waiting time is 2-3hours . By the time we got our turn is 545pm.\nLast few years we do not have this problem at UOB Northpoint.\nThis year we have appointment in west side so we choose UOB at point , this is a BIG mistake .\nStaff there are friendly but a lot people are so angry and even scolded the counter .\nHope the management of UOB will look into this as is unfair to those who book online with allocated time slot and also the poor staff.",
      "time": 1737022319,
      "translated": false
    },
    {
      "author_name": "l y",
      "author_url": "https://www.google.com/maps/contrib/113308630214571024321/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKcaM3sutbQIJ7sq-AfmXS4HxuAOkXUppS5fNZqGO86Lk6Smg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "Opened UOB account at Jurong point recently.\n\nFirstly, we went down to the branch to open a UOB stash account. Was informed that we will receive a letter in 3-5 working days that will inform us to come down to make UOB debit card.\n\nAfter waiting a couple of weeks, we did not receive any letter. So we decided to go down to check. Ended up they said our account was open but it’s a UOB one account not a stash account.\n\nNvm, we proceeded to do our internet banking and debit cards. Was told to put in our initial deposit asap. And was also informed that we are able to change the username given to us when we login for the first time.\n\nSo we went home, and tried to do just that. Login for the first time, and realised we can’t change our username. Contacted the email customer support and was told it was permanent that we have to deactivate our account to make a new username. 🤣\n\nNext, we did our initial deposit a day after opening. However, at the end of the month, we were charged a service charge of $5 for not maintaining daily average. Which somehow started counting last month.\n\nFun fact is we have yet to even been issued an e-statement for the current month or any months before. So it’s funny how they would charge us. The bank teller at the counter told us we would not be charged any service charge so early on but we have to transfer the minimum balance asap. Which we did.\nI had to call in to get a waiver. On a new account that is barely one month old. Thankfully we got a waiver, however even the customer service advised me to make sure I maintain my daily average which is impossible considering we are charged for the days before we even got our account officially open. 😂\n\nUOB Jurong point need to do something about their SOP or systems. Because they don’t seem to be on the same page.\n\nRecommendations: just do your account online it seems to be more efficient and clear as compared to the people there.",
      "time": 1735706708,
      "translated": false
    }
  ],
  "types": [
    "bank",
    "finance",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15651159869630888028",
  "user_ratings_total": 172,
  "vicinity": "1 Jurong West Central 2, #01-16C, Singapore"
}