{
  "formatted_address": "No. 83 Punggol Central, #01-01 Waterway Point, Singapore 828761",
  "geometry": {
    "location": {
      "lat": 1.4058035,
      "lng": 103.9024211
    },
    "viewport": {
      "northeast": {
        "lat": 1.40809895,
        "lng": 103.9034037802915
      },
      "southwest": {
        "lat": 1.40503835,
        "lng": 103.9007058197085
      }
    }
  },
  "name": "UOB Branch - Waterway Point Branch",
  "place_id": "ChIJAXIEQuMV2jERd24L2YclZJA",
  "rating": 2.2,
  "reviews": [
    {
      "author_name": "Suborna Suborna",
      "author_url": "https://www.google.com/maps/contrib/100325630942107360108/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJF1sVhmUeUCIUTRD3GzdfB6dUAq9w3EyTf-nYnaRXop4euvQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "A heartfelt thank you to the entire team for their incredible support and effort in helping me open my account! Your professionalism, patience, and dedication made the process smooth and hassle-free. It’s clear that you all go above and beyond to ensure a positive experience, and I truly appreciate it. Thank you for your hard work and for making me feel valued as a customer. You’re all amazing! 🙌😊",
      "time": 1741607958,
      "translated": false
    },
    {
      "author_name": "Momo Ko",
      "author_url": "https://www.google.com/maps/contrib/113109656238594715854/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI9Uauy7PRD_OMH0ilM7Ae87k2M8gey6jD8lPxuC3qX1HTZHQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Was served by Serene Shen today afternoon while taking my queue number. She smiled brightly, listened to my issue with patience and served us wholeheartedly. Definitely hope to be served and to see such beautiful lady when I need to settle my bank related in the future again. Thank you for making our day brighter to ensure we solved our problem with shorter service timing! :)",
      "time": 1739334231,
      "translated": false
    },
    {
      "author_name": "Altynai Isaeva",
      "author_url": "https://www.google.com/maps/contrib/113765484381793411903/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWuYPV8CU0rfyAMrFL0Kr7t6Lpq1EDAiHi0Dqd1w2UCf3j9i2Qr=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "3 months ago",
      "text": "I was given a Q number to be approached at Quick Serve counter and I was told waiting time would be 1 hour. I said its fine, will walk around in the mall first. But I've been waiting for almost 2 hours and my number wasn't called at all. The Quick serve counter is not quick at all. When I approached to staff, he couldn't help me at all. Did not even try to listen to me saying \"everyday its like this, everyday is the same\". What kind of service is this at all??? I was really devastated waiting for ages, when I had other errands to run. I was so disappointed.",
      "time": 1737961929,
      "translated": false
    },
    {
      "author_name": "Puay Guan Ng",
      "author_url": "https://www.google.com/maps/contrib/112799387158769243849/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKHkb1if1_u4wP3_OqIfZIJJbFEKtn_ZvwVfiIsDeM6VZBCFg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "This is perhaps one of the worst branch I ever experienced. Just to update mobile contact in order to use I- banking I was turned down twice because firstly no passport ( passport under renewal ) and  today even with new passport as required, they ask me for my old passport . I told them I don’t have it as I was not told to bring . They don’t advise in the front line to inform customer what take the required document needed and wasted customer time queuing and rejected due to missing item . This is very bad I requested to speak to the branch manager but came a female staff namely Ms Teo Sze Hwei who refused to answer me whether  if she is the manager in charge . She asked me about my problem and I told that  her I want to complain to the branch manager and she told me manager is engage and busy and unable to speak to me. She then passed me a complaint brochures and ask me to fill up and pass to her . I told her I would rather write email or call in to complain and she left and want to ask the manager out instead but I tried to call her twice but she openly ignored me in front with all other client .this is very bad artiste . Eventually ,The male manager is known as Mr Tan Poh Ting who came  out without a smile but instead a disgusted look when he spoke to me . I saw his unpleasant expression and it made me doesn’t feel like talking to him . He denied that he gave me disgusted gesture and offer to take to me in a room after he heard that I am going to HQ to complain his service attitude . We all know that this branch has very low working efficiency as already ally of complain of long waiting time but what shocked me most is the manager lousy attitude. This well explained why have such  lousy team in this branch .",
      "time": 1743169349,
      "translated": false
    },
    {
      "author_name": "Veronica Kang",
      "author_url": "https://www.google.com/maps/contrib/106475034642903628540/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUqrKQ-oY3sqBrIfa5IH9eR9YBmernRM_CxWc3p_zVnTHa0fyB6=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Ms Tee deserves the highest commendation for her professionalism, knowledge, patience and customer-centred service. She has initiative and is empathetic and highly efficient. She is calm in handling her staff and customers and what i like most of her is that she does not sound hurried/appear stressed even with a barrage of questions from me and the other customers I witnessed in this busy festive period! She made my visit (honestly we dread stepping into this very busy branch) a surprisingly pleasant one as my husband and I left for the first time, feeling satisfied. Ms Tee is a rare gem in this fast-paced banking industry turning impersonal with digital banking. She has restored our confidence in UOB and hope her colleagues will be inspired by the high standard of service she sets for herself and making UOB proud! We were pleased with Ms Jean and Ms Jocelyn at quick serve counter who were both efficient at trouble-shooting and very patient despite near closing time!",
      "time": 1734576547,
      "translated": false
    }
  ],
  "types": [
    "bank",
    "finance",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10404482304524906103",
  "user_ratings_total": 184,
  "vicinity": "No. 83 Punggol Central, #01-01 Waterway Point"
}