{
  "formatted_address": "67A Lor 27 Geylang, Singapore 388189",
  "geometry": {
    "location": {
      "lat": 1.3161054,
      "lng": 103.8837328
    },
    "viewport": {
      "northeast": {
        "lat": 1.317442180291502,
        "lng": 103.8851419302915
      },
      "southwest": {
        "lat": 1.314744219708498,
        "lng": 103.8824439697085
      }
    }
  },
  "name": "Urban Hostel @ Aljunied",
  "place_id": "ChIJlxFkODsY2jERv3Yvn4eHbl4",
  "rating": 3.2,
  "reviews": [
    {
      "author_name": "Kirstie Leigh Gutierrez",
      "author_url": "https://www.google.com/maps/contrib/100305446717242855446/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW4Ln2swXuY0606xA2sllYi2S8g5TgDqfc5UuiKdt0oYmO_9lxb=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Derrick was an incredibly accommodating host, going above and beyond to ensure our stay was seamless. He kindly granted all of our requests, including an early check-in at 7 AM and allowing us to leave our luggage before our departure flight. The room was clean, and perfect for family and/or friends. We also appreciated the detailed instructions for getting to the place, which made our arrival hassle-free. The location is just a short walk to the MRT station and close to a lot of hawker stalls. We truly enjoyed our time and highly recommend Derrick's place for anyone visiting Singapore soon.",
      "time": 1731836855,
      "translated": false
    },
    {
      "author_name": "Margareta Anindias",
      "author_url": "https://www.google.com/maps/contrib/101794032386657040074/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW6JHJX3bGDqrn_JWK-FxilolJNPVo_JGNvvFx_v_7j5nlzteA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "It was very nice stay here!! I booked for group of 11. The staff very helpful. They do provide amenities, towel, laundry, and kitchen utensil (minus fork). Hehe\nLocation very near the MRT Station! So you wont need to walk far! Its near alot of food stall, so you will easily find food and mini market. In my experience, i didnt find any bed bug though. Thank you",
      "time": 1726537190,
      "translated": false
    },
    {
      "author_name": "Yogesh G",
      "author_url": "https://www.google.com/maps/contrib/105013529274597612824/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXosN_p-3T8915pVpltfixYBJ1EuWR6WVk-Dklfi_zfygBL-Q1s=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Had booked a stay here. Had a transit from another hostel due to full occupancy there. It was around 9pm to check in here. The owner/ manager was very rude and shouted for no reason. Had a very unwelcome like feeling while checking in. Overall, there are much better places than this one.",
      "time": 1708458217,
      "translated": false
    },
    {
      "author_name": "Sisubalan Selvan",
      "author_url": "https://www.google.com/maps/contrib/105457991823949517042/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVuxy_4pRT_u9WVyyf-Ul3E2E7FR0RQgqyRnmC6exgmjrnC0xw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "4 years ago",
      "text": "It was an okay hostel. Well lit and a very good wifi. Air-conditioned and clean bed but other than that, the room was quite crampy and small. You can use locker you want to keep your valuable items. A very friendly owner and cheap hostel. Few mins walking to aljunied mrt station or bus stop. Near to many chinese eateries and bakery or fruit stalls. Few mins walk to atm and geocery store across the road.",
      "time": 1599073090,
      "translated": false
    },
    {
      "author_name": "Duc Huy Nguyen",
      "author_url": "https://www.google.com/maps/contrib/103411313343181585102/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUXCq1M2MwnzlCCXdnhKXolks63xwJqQdcFgiJlmfq90-piUS51=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 2,
      "relative_time_description": "8 years ago",
      "text": "The property has a good location. It places next to the Aljunied MRT station, only about 5 minutes walk. Some of the rooms have air conditioner, some (downstair) don't. My bed was a bit squeaky, it emitted some noise. My friends and I stayed for 4 nights but on the third evening (after a long day outside), we found they had moved our belongings out of the room (4 over 9 beds), they said they thought we had left. When they realized they were wrong, they tried to convinced us to move to a worse room (with only 2 beds for 4 people) instead of giving back our places. Some other guests were in that situation too (I observed 3 cases), late at night with beds taken, quite unacceptable. There were several bathrooms and restrooms around but they were not really clean, once i caught toilet tissues scattered on the floor. They also didn't have enough locker keys (only 7 available when we asked for 9). My locker was also not durable, I could pull the handle a bit strongly to open after it was locked. We checked out early on the fifth morning and the receptionist was not there but it was a good point that they returned the key deposit money after we left via bank transfer. Overall not as good as expected.",
      "time": 1495045435,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6804525103564420799",
  "user_ratings_total": 197,
  "vicinity": "67A Lorong 27 Geylang"
}