{
  "formatted_address": "160 Sin Ming Dr, #06-03 Sin Ming AutoCity, Singapore 575722",
  "geometry": {
    "location": {
      "lat": 1.3592045,
      "lng": 103.8392971
    },
    "viewport": {
      "northeast": {
        "lat": 1.360539830291502,
        "lng": 103.8406746802915
      },
      "southwest": {
        "lat": 1.357841869708498,
        "lng": 103.8379767197085
      }
    }
  },
  "name": "V-KOOL",
  "place_id": "ChIJ0SEljSQX2jERDzH8QdqVYdE",
  "rating": 2.5,
  "reviews": [
    {
      "author_name": "Gary Teo",
      "author_url": "https://www.google.com/maps/contrib/109834213726189579730/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLSBKe6txZFn5AxWmrlxhwZa0yAqXBccEU-4nVyB91tG-HpUg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "8 years ago",
      "text": "I got my vKool installed by vKool through my car dealer. After 3 weeks of drive, I first suspected that the car air-conditioner is not working well. After checking of the air-con during the servicing which is working fine, I when to vKool and was really surprise that the film they provide to \"agent' car is not display in their Sim Ming show room. A grade that they do not want anyone to see the result with the Infra Red lamp. If your agent is to provide you with vKool, please think twice as vKool will provide backyard tinting shop's grade. Any lower grade 3M or Huper Optic are better.",
      "time": 1490177985,
      "translated": false
    },
    {
      "author_name": "Tony Ho",
      "author_url": "https://www.google.com/maps/contrib/118107194548169906203/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWbXO6vvJZaTYhJ_M3pWiiw8Os9mbMUPIVPpIr_x4T3cUCXjcUvJg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "12 years ago",
      "text": "Had a rock hit my windscreen which caused a crater. Screen was changed and it was time to hunt for new solar film. After doing some research, I decided to give V-Kool a try. Went down to the place for a preliminary assessment, settled on the price, made sure my Garmin GPS and Nexus GPS can work through their metallic based film; booked an appointment and that was it.\n\nThe installation was superb and as fast as promised. I waited at their lounge. They had pretty decent pantry selections. Due to the metallic based film, they had to cut a hole near my ERP UI (which is not really visible from the inside). The interior was keep pretty clean. They offered to a free car wash which I kindly declined.\n\nOverall I am pretty glad with the workmanship. I would prefer the top sunshade part to be darker though. Didnt really like how the worker switch on my car and have no idea how to deal with my turbo timer when he tried to shut the engine off. Also saw him  fiddling with my stereo confusingly which happened to be Bluetooth to my phone media. I figured he was trying to do some checks before the car is returned to me.\n\nI opted for the top range X75 film. Not going to say too much BS about how it was better than the competing brand I used previously (which failed to give me the good vibe when I first called for enquiry). Just going to use a very practical way to sum the product up. Everytime when I get into the car and hold onto my steering wheel, it felt significantly cooler than before...",
      "time": 1343050122,
      "translated": false
    }
  ],
  "types": [
    "car_repair",
    "store",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15087504991310328079",
  "user_ratings_total": 2,
  "vicinity": "160 Sin Ming Drive, #06-03 Sin Ming AutoCity"
}