{
  "formatted_address": "2 Bayfront Ave, B2M-238 The Shoppes at Marina Bay Sands, Singapore 018972",
  "geometry": {
    "location": {
      "lat": 1.2832756,
      "lng": 103.8600801
    },
    "viewport": {
      "northeast": {
        "lat": 1.284611380291502,
        "lng": 103.8614182802915
      },
      "southwest": {
        "lat": 1.281913419708498,
        "lng": 103.8587203197085
      }
    }
  },
  "name": "Vacheron Constantin",
  "place_id": "ChIJRbr_DgUZ2jERSc2o_HMwVVE",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Jeff",
      "author_url": "https://www.google.com/maps/contrib/117496197995685866838/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ49nfQ659NJCRTbrPTGHxq1-EjSp7wciqN1UrPYzh2QHphiQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Had one of the best experience at Vacheron Constantin MBS this evening with Mr Win and Mr Jonathan. Visited the outlet couple of times over a month period and the service and professionalism was nothing short of amazing. I have been to different watch boutiques and owned multiple time pieces but VC left the deepest impression, by far.\n\nVC staffs was exceptionally knowledgeable, patient, and attentive throughout my visit. Their passion for watches and commitment to customer satisfaction really left a lasting impression.\n\nVC Singapore, you have a gem of a staff here. I wish your staffs all the best in their career and thank you once again for sharing your watch knowledge and allowing me to try on some of the amazing timepieces. I'll definitely be back again to purchase from VC soon.",
      "time": 1747123495,
      "translated": false
    },
    {
      "author_name": "George Tan",
      "author_url": "https://www.google.com/maps/contrib/113827107407258861967/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJVqyVkWCmN5BEdTpL-bAEYzOfDjyZa4Tk6XmNHqiFwIELQcg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Fantastic service from the staff and very professional. Especially Mr Win. He is knowledgeable and very friendly.\n\nWe had a great time at VC Boutique MBS. Thank you!",
      "time": 1730474337,
      "translated": false
    },
    {
      "author_name": "Zheng Yuen Wat",
      "author_url": "https://www.google.com/maps/contrib/100834674992182133915/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX6I5Ik5gZUx9wu8ED2p5CNcPfPnlDTlm_7OoJ3NHV9gZtkkR4=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "This is an update after collecting my watch. After a three-year quest, the momentous day finally arrived.\n\nFirstly, I must extend my deepest gratitude to Edwin for his unparalleled helpfulness and responsiveness. His knowledge of the products and willingness to assist me in finding the perfect timepiece was truly remarkable. Edwin's dedication to ensuring that every customer receives personalized attention is a testament to his commitment to excellence.\n\nVincent also deserves special recognition for his assistance during the deposit process. He made the transaction seamless and efficient, ensuring that I felt comfortable every step of the way. His professionalism and attention to detail were greatly appreciated.\n\nLastly, I cannot express enough thanks to Johnathan for his invaluable insights and advice during the watch collection process. His expertise and passion for horology shone through as he shared his knowledge with me, making the experience truly unforgettable. It was evident that Johnathan genuinely cared about ensuring that I was satisfied with my purchase, and for that, I am incredibly grateful.\n\nIn sum, my sojourn at the MBS boutique was nothing short of sublime. The triumvirate of excellence embodied by Edwin, Vincent, and Johnathan surpassed all expectations, culminating in the acquisition of the coveted Vacheron Constantin. As I depart, my heart brims with gratitude, knowing that I have not just acquired a watch, but embarked on a timeless journey of unparalleled craftsmanship and service. To the entire team, I offer my deepest thanks for crafting an experience that will forever linger in the annals of horological memory.",
      "time": 1714981479,
      "translated": false
    },
    {
      "author_name": "Hai Hoe, Damien Toh",
      "author_url": "https://www.google.com/maps/contrib/104196782164860276852/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU2XvdB7QunSzKxR5RvV6JaiYXznIEshIrL4NvMZqTPRUgG2vA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Stepped into the boutique on 30 April and was greeted by Edwin who was very polite and helpful. I asked about the possibility of putting my name in the queue for the 7900V Dual Time Black Dial and he promptly answered my query and asked me for my particulars in order to process my request. I tried on an exhibition piece too and spent about 30 mins in the boutique. Edwin made me felt very welcomed. Later in the afternoon, I received a WhatsApp from Ms Fiona Yang who confirmed that she will keep me posted once the watch is ready for collection. I’m excited and eager to start my first purchase with Vacheron Constantin MBS",
      "time": 1683191701,
      "translated": false
    },
    {
      "author_name": "Donald Ang",
      "author_url": "https://www.google.com/maps/contrib/107952379593923988431/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJuSLbl4eZZmvHHrq2Kod8J4JahuS7ZUs3BHa1YDIhFruqMMA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Boutique is very welcoming and was served by Zann. Purchased an Overseas self winding from her and service was excellent. After sales service is fantastic too. Thumbs up.",
      "time": 1628685943,
      "translated": false
    }
  ],
  "types": [
    "store",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5860643764810861897",
  "user_ratings_total": 48,
  "vicinity": "2 Bayfront Avenue, B2M-238 The Shoppes at Marina Bay Sands"
}