{
  "formatted_address": "190 Keng Lee Rd, #01-03 Level, Singapore 308409",
  "geometry": {
    "location": {
      "lat": 1.3138166,
      "lng": 103.8413601
    },
    "viewport": {
      "northeast": {
        "lat": 1.315129980291502,
        "lng": 103.8428335802915
      },
      "southwest": {
        "lat": 1.312432019708498,
        "lng": 103.8401356197085
      }
    }
  },
  "name": "Verandah Cafe",
  "place_id": "ChIJq5DdE88Z2jERV4DNu4-5xOU",
  "rating": 2.5,
  "reviews": [
    {
      "author_name": "Abu Hassan Abu Bakar",
      "author_url": "https://www.google.com/maps/contrib/115780716497812944044/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVWCYhf8Y9MdP7rmW2pCIgAhsoSJ9pNTNhlImJsFzc4FFaAGJ2g=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Great food, great taste, great service and great ambience. The $12 promotion for senior citizens also adds to the excellent rating. Only one thing to take note is to put the papadum separately (not inside the briyani pot) as it gets soggy. Thank you.",
      "time": 1727049316,
      "translated": false
    },
    {
      "author_name": "Teochew AlEx",
      "author_url": "https://www.google.com/maps/contrib/102191019603428217991/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJDdG1MJu7BGYuBSs0G1xvGDPICbvlBeNlrCLcsPY-W7XQwLw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "8 months ago",
      "text": "One lamb shank briyani within $20 is a steal in orchard area, esp when the test is good!",
      "time": 1725863803,
      "translated": false
    },
    {
      "author_name": "Fatimah Hamid",
      "author_url": "https://www.google.com/maps/contrib/113137987526437078794/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIsrL-nLTm-qKNUNiGW9gpUeRkWmTnUZrvDiuriB86k99eevA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "7 months ago",
      "text": "Kindly provide a contact number so that your ops team can liaise with me. Honestly, I would have given zero stars if I could.\n\nI visited this establishment for lunch this afternoon. Prior to my visit, I had called up yesterday to inquire about the menu, the promotions offered and I even made a reservation.\n\nUpon arrival, I found that the restaurant was basically empty, with only one other table occupied. We were shown to our table and given the menu to place our order. When we went to the counter to place our order, we were informed that basically half the menu items were not available as their kitchen was apparently not in operation yet. When I reconfirmed the validity of the promotion for seniors (set meal @ $12 nett), which was discussed to still be valid as of yesterday, I was instead informed that the promotion had ended a week ago. If I had known that half the menu items, along with the promotion for seniors, was unavailable, I would not have come to dine here in the first place.\n\nAdditionally, the fish head curry was said to have been sold out when it was not even 1pm (restaurant opened @ 11am) and the restaurant was visibly almost empty. Upon further probing, I was told that I should have reserved it one day ahead as they only sell one fish head a day.\n\nWhen the food arrived, we were informed that some of the items were sold out and they instead took the liberty to swap those items as per their own convenience. To be exact, I ordered 2 of the Ayam Gulai sets, which were supposed to come with sambal terung. However, I was not informed there was no sambal terung until my order reached the table and the staff shared that they substituted the sambal terung with sambal goreng instead, for one set. The second set did not even come with a substitute.\n\nThe canned drinks and mineral water that we ordered were also originally served with a mere straw and we had to request for glasses.\n\nAs I was unhappy with the poor service, the sales manager, I believe, Razali, came by to casually inform us that his colleague who was mending the counter, was new, and that he thus did not know quite a lot of things. I was rather appalled as I honestly feel that such an explanation was irrelevant and unprofessional. The shortcomings of this establishment should not have been solely pinned on the fact that his colleague was new.\n\nWe were given a small complimentary plate of assorted cakes as compensation for the unsatisfactory service rendered. However, even that was not plated neatly.\n\nConsidering that this restaurant is run by The Landmark Group, I find the service standards unacceptably low. I would not recommend this place to anyone. I would also highly recommend the management to reevaluate their operations.\n\nOverall, this was a very unpleasant experience. Nonetheless, I would like to place on record that the service staff, Pinky, did her best to serve us efficiently and professionally. I was pleased with her efforts.",
      "time": 1729653009,
      "translated": false
    },
    {
      "author_name": "E Y",
      "author_url": "https://www.google.com/maps/contrib/105075329874554901952/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJFPDRT-rdJtzhHrW4V85IShsQITqHl8ai-tGHjRAfC2kjWCg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "The experience was extremely disappointing. The owner/manager has very bad attitude. He was very condescending to me when I asked what’s available for snack and being first time there at the restaurant, I expected someone to be more understanding and explain the menu. He went on to suggest a couple of options that I took.\n\nWhen it’s time to pay, he made a mistake of forgetting to charge me for a drink but his body language made it look like it’s my fault when his stuff told him he forgot to charge me for the drink. After the drink was served, I realised there wasn’t a straw, so I went up to pay for the drink that he missed charging me. He came up to operate the cash machine so I had to ask him for a straw. Instead of just pointing to me where the straw is , he was dismissive and said they already provided a straw but they didn’t. Even his employees had to point out to him that they missed providing a straw.\n\nI will never go back again to this place. I feel bad for the employees (who seems nice) that have to report to that person who is supposedly running the place. If you want to be a King and act like everyone owe you something, don’t work in the service line and be such a prick.\n\nPlease go there at your own risk. Food and teh tarik was ok though.",
      "time": 1730279933,
      "translated": false
    },
    {
      "author_name": "Ryoo Lor",
      "author_url": "https://www.google.com/maps/contrib/103759160946113076499/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLg7q4Jl_3NZ5xuJZBjzfzibWwJ5WNED8eOQEJfmsqg8S7Llw=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "7 months ago",
      "text": "Slow service and plain tasting drinks. Got a lot of room for improvement especially in terms of service.",
      "time": 1727502457,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16556562157103054935",
  "user_ratings_total": 6,
  "vicinity": "190 Keng Lee Road, #01-03 Level"
}