{
  "formatted_address": "144 Upper Bukit Timah Rd, Beauty World Centre #02-01, Singapore 588177, Singapore 609961",
  "geometry": {
    "location": {
      "lat": 1.3423741,
      "lng": 103.7762593
    },
    "viewport": {
      "northeast": {
        "lat": 1.343521730291502,
        "lng": 103.7774519802915
      },
      "southwest": {
        "lat": 1.340823769708498,
        "lng": 103.7747540197085
      }
    }
  },
  "name": "Vocal Evolution",
  "place_id": "ChIJp-BSqMwb2jERnpaZlYnpvT0",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Wong Yu Ting",
      "author_url": "https://www.google.com/maps/contrib/106400545389923587628/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVqh3uLfpSCuLN9J12aWBPjk0zjYixf_EIIYJx8e2insGXLJWaZ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Have been briefly exposed to a bit of vocal training from different teachers over the past few years and what makes Kenogi stand out is how he integrates science into his lessons! Unlike other mainstream vocal coaches who usually point out flaws to students; fix their pitch and tell them how they want them to sound w/o properly teaching them how to execute, Kenogi was actually able to explain the science behind it and demonstrate how the correct sound should sound like. I really liked how he would check in with me how I feel after I managed to sing correctly with his exercises; it was really very helpful because it \"reminds\" my body what I should do to produce the correct sound! He is also very nice and encouraging and also made the effort to get to understand more about my singing background at the start of the lesson, which really added a personal touch to the lesson and I really appreciate it.\n\nI attended his vocal lesson together with another friend and I must say I'm really really impressed that it wasn't a one size fit all approach; the vocal exercises he selected for both of us were different as it targets the different problems that we have.\n\nDoesn't matter if you have learnt or never learnt singing before, you will benefit a lot from Kenogi trust me!",
      "time": 1698856241,
      "translated": false
    },
    {
      "author_name": "Jiaying Li",
      "author_url": "https://www.google.com/maps/contrib/102960133793443294497/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLWy6JTBdCsK9KIg2M1h3KyUQGjonn_me4S7vKINnCDkVbNKA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Kenogi is a responsible, experienced and super encouraging teacher.\n\nHe is able to help students apply vocal technique from vocal exercises to songs, and the improvement has been much more obvious compared to my previous lessons at other schools.\n\nI now have a better understanding of controlling my voice in different styles and the scientific logic behind it.\n\nWould highly recommend to those who want to learn singing!",
      "time": 1695943563,
      "translated": false
    },
    {
      "author_name": "Ler Shan Ang",
      "author_url": "https://www.google.com/maps/contrib/106757146462373676982/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIY3CCl8B-VqiXiXmcob1xy25RunOcgblU4xPxUEY1ewvbEtg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "I really enjoyed my first lesson with Kenogi!\n\nI was struggling with finding my mix voice for a really long time and my prior vocal training was not working for me - I was having trouble finding a stable voice to sing high notes without belting loudly or singing very softly in head voice.\n\nHowever, after just one lesson at Vocal Evolution, I could already see a big change from the way I used to sing.\n\nI no longer felt stuck or strained trying to hit high notes and I could transition from chest voice to head voice smoothly.\n\nI look forward to working on it more in the coming weeks!",
      "time": 1667707915,
      "translated": false
    },
    {
      "author_name": "Nastasia JT",
      "author_url": "https://www.google.com/maps/contrib/116831945506519345068/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWR9d2GPDiOaGhkLtW6HLpWQkbOhnK-A1ALVWElABnUo1FIy6tQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I'm really glad I went for the 80/20 class! And no regrets doing the demo. I had several take aways actually... I was squeezing my vocal chords the wrong way, I actually can sing high notes (now its how to make it sound nice) and how the vowels affect my ability to hold pitch. It was a really fruitful session with useful & practical tips that left me wanting to learn more. I would love to have sessions with Kenogi if it wasn't for my current commitments. I will definitely rmb VE and consider going for lessons if my schedule frees up.",
      "time": 1708822023,
      "translated": false
    },
    {
      "author_name": "Sreshya Kamakshi Vishwanathan",
      "author_url": "https://www.google.com/maps/contrib/104079353340927792151/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV49KxabbJU72wJs3L4HSv6N_RaQEcBdE8gzWKh82pgKyugLL56=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Thank you Kenogi for an amazing first vocal coaching experience! I’ve been singing for as long as I can remember and from just the first 10 minutes, Kenogi could identify my problem and identify an effective solution as well. Seemingly simple visualizations that he asked me to do (e.g. singing in a crying intonation) actually helped so much to achieve the kind of comfort and “letting go” of my voice that I’ve always struggled with at my chest range. He did not just tell me to do a certain thing and expect me to follow, but he prescribed an exercise to help me fix the root cause of my problem - not having a strong enough voice with sufficient control - and with this I can work on my voice much more effectively. All in all I was astonished by how familiar he was with all the terminology and technical things, but could translate it in the best way for me to learn and take in. Thank you so much for the amazing trial lesson!",
      "time": 1716204623,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4448968784041580190",
  "user_ratings_total": 32,
  "vicinity": "144 Upper Bukit Timah Rd, Beauty World Centre #02-01, Singapore 588177"
}