{
  "formatted_address": "50 East Coast Road #01-01 Roxy Square 1 Shopping Centre, Singapore 428769",
  "geometry": {
    "location": {
      "lat": 1.3048554,
      "lng": 103.9037737
    },
    "viewport": {
      "northeast": {
        "lat": 1.306325980291502,
        "lng": 103.9051239302915
      },
      "southwest": {
        "lat": 1.303628019708498,
        "lng": 103.9024259697085
      }
    }
  },
  "name": "Wahiro",
  "place_id": "ChIJd7tXI3IY2jERJHYDLdhf3Mc",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Rongjie Teo",
      "author_url": "https://www.google.com/maps/contrib/100506994383996559606/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIbuavSjvGX6_kcud5QurMdtxfsGH7bxl3dXyqvkKm9Dpc9Gw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Service is good, even on a busy Friday evening. Food is great and authentic, prices are reasonable. Staff understands their food and are able to give good recommendations.\nGreat experience overall! Good job!",
      "time": 1734096610,
      "translated": false
    },
    {
      "author_name": "Alan Goh",
      "author_url": "https://www.google.com/maps/contrib/105264614940348373247/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU1Ia2w4z51Ob3gJMxB9I4DOrrNbtPILPHnFADWDP7MZZFESs6EuA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "The service is warm, attentive, and professional, making every visit a pleasure. Their sashimi is exceptionally fresh and beautifully presented. Beyond the raw dishes, their cooked food is equally impressive – full of flavor, balanced, and comforting in that true Japanese way.",
      "time": 1746763835,
      "translated": false
    },
    {
      "author_name": "HuyenLy Nguyễn",
      "author_url": "https://www.google.com/maps/contrib/112662903049952941403/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV62SQfteFtJq_xsD-m8wE9gBRmTkWzUvN3vK-_KpKOvn0oatM=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "A cozy and somewhat hidden Japanese restaurant offering authentic cuisine and a more private dining experience. They also have a great selection of Japanese alcohol to complement your meal.\n\nA great spot for Japanese food lovers or a business lunch. However, their opening hours may not be the most convenient, and space is limited—so be sure to check the hours and make a reservation in advance.",
      "time": 1742616945,
      "translated": false
    },
    {
      "author_name": "Yong Chieh Gooi",
      "author_url": "https://www.google.com/maps/contrib/102109239090147851151/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUtoE3CJA6N8mVObYbOfUHoTZLOcE7ghn8D13nX8GVrquC6QBYnOA=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "2 years ago",
      "text": "I’ve walked past this shop countless times over the past years and have always told myself that I need to try it out but somehow I never got to do it.\n\nSo one day, I decided to try it out after the first option was full - walked past this place and just decided to walk in.\n\nI must say that I didn’t regret my choice. First of all, the food (especially the meal set) is very reasonably priced. The portions are huge - from the sashimi to the tempura that accompanied the main dish, to even the main dish itself. Even the same prices are rather reasonable too.\n\nThis is one of the rare places in Singapore where good food is priced reasonably and have reasonable portions too!!",
      "time": 1677585144,
      "translated": false
    },
    {
      "author_name": "Sook Han Lee",
      "author_url": "https://www.google.com/maps/contrib/105051599568576260383/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVBEzCb7LXyVbQl03Ygz5JLKKjRJLGx66XsAfXB9W6VE_g_U0om=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "I was slightly surprised when I was told that there are 2 sittings when I called to make a reservation for a Friday evening.\nThe place was full when I arrived at 7:30pm (first sitting is at 6pm), and bustling with activity.\nThere appeared to be many regulars among the guests, but everyone was treated in a friendly manner.\nThe staff are helpful and give good recommendations.\nHad Hirame sashimi. Thick slices so you can taste the fish, which was fresh.\nUnagi sushi - unagi was good (plump and juicy) but the rice was just so-so.\nCalifornia maki - presentation was slightly different than expected. The ingredients were good, and again the rice was a tad disappointing.\nKushiyaki - had 3 vegetable ones: gingko nuts, leek and mushroom. Pretty decent. I liked the gingko nuts the most.\nNabeyaki udon - chewy udon (good), the soup was rich and it was a generous serving.\nChawanmushi - prepared upon order. They had a lot of the Japanese fishcake (white with pink edges) sliced thinly, which I don't particularly like. The egg could have been smoother in texture, there might have been too much water or dashi added to it. Can skip.\nTempura was decent, ingredients were fresh. I've had better but this is ok - the battery wasn't overly thick.\nMorokyu - cucumber with moro miso. Can skip. The presentation made it slightly difficult to pick up with chopsticks and have miso on it. The quality of the ingredients was OK.\nNasu agedashi - interesting dish, I've not had it before. The eggplant didn't taste oily, the stock with radish and the other oshinko added to it gave the dish a good balance.\n\nThey have a wide range of sake from different prefecture of Japan.",
      "time": 1709385807,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14401491090496779812",
  "user_ratings_total": 314,
  "vicinity": "50 East Coast Road #01-01 Roxy Square 1 Shopping Centre"
}