{
  "formatted_address": "81 Choa Chu Kang Wy, Singapore 688263",
  "geometry": {
    "location": {
      "lat": 1.384205,
      "lng": 103.7365509
    },
    "viewport": {
      "northeast": {
        "lat": 1.385388730291502,
        "lng": 103.7380456302915
      },
      "southwest": {
        "lat": 1.382690769708498,
        "lng": 103.7353476697085
      }
    }
  },
  "name": "Warren Golfers' Terrace",
  "place_id": "ChIJcQ47LwYR2jERhxwk_UrTH6s",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Natalie Chan",
      "author_url": "https://www.google.com/maps/contrib/114468576215365693835/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKJUutDGKhfr7LE5GouQVT1OUZHrzYjWNFkQ_unvzQtu6oQoA=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "3 months ago",
      "text": "I’ve usually had a great experience at the Golders’ Terrace - the food and service is usually great. However, on my most recent visit, I had an issue with my order. I had ordered eggplant with potato and peppers, but received trio egg with nai bai. I understand mistakes happen, but it was a bit disappointing that the staff we brought up this issue to didn’t get back to us after promising that he’ll check; and the staff who took our order denied receiving eggplant as our order. And disappointingly we didn’t receive any follow up actions from the staff.\n\nAlso, while the dishes served were hot and tasty, our rice was cold.\n\nThat said, I’ve had plenty of positive experiences before, and the staff were otherwise accommodating to our requests, so I’m hoping this was just a one-off experience.",
      "time": 1738236141,
      "translated": false
    },
    {
      "author_name": "Tiffany Tan",
      "author_url": "https://www.google.com/maps/contrib/109556803824570152808/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKg0FT__tun8E60HiDxzBWJ9SlOztkE3o9owbEobC0qgZi0QQ=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "3 months ago",
      "text": "Always have had a good experience dining here with family, but unfortunately during my most recent visit it wasn’t as satisfactory due to seeing how the staffs were pushing around a clearing trolley with the dirty buckets to clear the tables when there was still many guests around. And it kind of ruined my appetite too. If anything, the hygiene standards could be looked into definitely. Other than that, the service and food was good as usual! :)",
      "time": 1739619819,
      "translated": false
    },
    {
      "author_name": "Maverick Png",
      "author_url": "https://www.google.com/maps/contrib/116605438155660548638/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUTLT2tE-TC1xpm2IRPsIzPrxSulyi5gk3bLyWKS0H2sX7HnOM=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Great selection of food with a splendid sunset view. The Warren Golfers' Terrace serves a selection of Western and Japanese cuisine as well as local hawker favourites. The portions served were quite generous. As the place is open to public dine-in, the menu has price for member or non-member.\nWe ordered curry chicken, beef hor fun, fried rice and fish&chips, and we were not disappointed at all. Of course, the sunset view is always so mesmerizing.",
      "time": 1662538337,
      "translated": false
    },
    {
      "author_name": "Anikaz Travel",
      "author_url": "https://www.google.com/maps/contrib/100371975357068365869/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVg3EK-inZ2u5gU2k1-mxQyJJOQCLww2VpVZRZUL9YcRnT4UqTw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "3 years ago",
      "text": "Vegetarian food availability: 3 stars.\nThere is vegetarian food available but in very limited quantity.\nAmazing place with delicious food. There is a nice ambience and a beautiful view of the golf course from above. The staff is efficient and very amiable. There is a separate vegetarian menu but it is limited. They have various cuisine such as western and local. They have good dishes and the quantity is huge . There prices are also reasonable and they have a discount if you are a member.\nHowever, they could broaden the vegetarian menu a little bit by adding few more dishes.\nI recommend the vegetarian charcoal burger, the pomelo and mango ice cream, the potato wedges and the banana split.\nOverall, a good place to hang out with friends and family.",
      "time": 1642657887,
      "translated": false
    },
    {
      "author_name": "Z Ong",
      "author_url": "https://www.google.com/maps/contrib/100995158974633407890/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW1xgmFxMVMMsfn6fUv_Eg0dR801XFWDUVnSx-hthHX-1B7p91m=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "The food was unexpectedly good. The charcoal burger bun was on the sweet side but goes well with the pattie and sauces. XO wings were great. They were crispy and definitely marinated for at least a day. Loved the Thai pork and the chilli sauce. Bitter gourd and beef hor fun were full of work-hey flavours. Meegoreng was on the sweeter side and comes with a few peeled prawn. Overall the food was seasoned well and nothing to complain about. Service was attentive and $25++ per bucket of beer was reasonable. Plus the nice view, totally would recommend.",
      "time": 1678551527,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12330806623791750279",
  "user_ratings_total": 73,
  "vicinity": "81 Choa Chu Kang Way"
}