{
  "formatted_address": "83 Punggol Central, Singapore 828761",
  "geometry": {
    "location": {
      "lat": 1.4064412,
      "lng": 103.9020846
    },
    "viewport": {
      "northeast": {
        "lat": 1.407385480291502,
        "lng": 103.9032012302915
      },
      "southwest": {
        "lat": 1.404687519708498,
        "lng": 103.9005032697085
      }
    }
  },
  "name": "Waterway Point",
  "place_id": "ChIJLTCPpuQV2jERYMYF_2uprDE",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Koh Huey Min",
      "author_url": "https://www.google.com/maps/contrib/108097352662396107986/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV0TKq1kjmuFTgGRBSwTgtwF2hDbMdSyDmUpQfJ9k_BnDLXVnCD=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Was there for a fun walk at the park connector.\nGood place to walk, as the exits are near. There’s easy access to rest stops for toilets and food.\nPcn connected to active sg facilities. Wall murals to learn about he history of the places.",
      "time": 1745715554,
      "translated": false
    },
    {
      "author_name": "DR. ALVIN TUNG",
      "author_url": "https://www.google.com/maps/contrib/104044951295366590832/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWknJaVHN6Obw1YH0CVUflDIRJBOrDqAuoZABytWY9qZ4_8Hvw=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "First time visiting Waterway point with relatives. The mall is fabulous! Lots of food choices and the extensive outdoor area by the river is very refreshing. Lots of families and kids playing while we are enjoying a snack.",
      "time": 1741951264,
      "translated": false
    },
    {
      "author_name": "oXRYSTALo Ong",
      "author_url": "https://www.google.com/maps/contrib/114556064085815871377/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSTtKcF9FYMbh-XNbDu8f7Whl3gi-ZY6T8pFPOm3v9Y98Ws7jL=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "7 months ago",
      "text": "Alright, folks, listen up! Waterway Point, a familiar landmark in Punggol, has been a go-to spot for me & Donkey since its opening. While I appreciate its convenient location, spacious layout, and outdoor promenade, there's one area where it could really shine: ladies' fashion.\n\nThe Good:\n\n• The Location: Situated within walking distance of Punggol MRT station and surrounded by residential areas, Waterway Point provides easy access for residents and visitors alike.\n\n• The Space: The mall's airy design and ample natural light create a pleasant shopping experience.\n\n• The Promenade: The waterfront promenade offers stunning views of the Punggol Waterway and provides a relaxing space for strolls, picnics, or simply enjoying the scenery.\n\n• Love Bonito: A Welcome Addition: The arrival of Love Bonito was a breath of fresh air for fashion-conscious shoppers like myself. It's a great addition to the mall's offerings.\n\nThe Quirks:\n\n• The Fashion Selection: While there are a few options, the selection of ladies' fashion stores is somewhat limited. I'd love to see more brands, especially those catering to different styles and budgets.\n\n• The Footwear Selection: The mall's footwear selection is also lacking. More stores focusing on ladies' fashion footwear would be a welcome addition.\n\n• The Dining Options:  The food court offers a decent selection.\n\n• The Unique Experiences: While Waterway Point offers a comfortable shopping experience, it lacks the unique attractions or experiences that would set it apart from other malls.\n\n• The Parking: Parking can be a challenge during peak hours, especially on weekends, due to the mall's popularity.\n\nDonkey’s Note: I like the promenade, but I wish there were more shops.\n\nMy Note: I agree! I’d love to see more fashion options at Waterway Point.\n\nRating:\n\n• Shopping: 3.5/5 (Good options, but limited in fashion)\n\n• Dining: 3.5/5 (Decent food court, but could be more diverse)\n\n• Atmosphere: 4/5 (Pleasant and spacious)\n\nOverall: 3.5/5\n\nOverall: Waterway Point has a lot to offer, but its potential for ladies' fashion remains untapped. With a wider selection of clothing and footwear stores, Waterway Point could become a true fashion destination for Punggol residents and beyond.",
      "time": 1729239947,
      "translated": false
    },
    {
      "author_name": "Alvin Lim",
      "author_url": "https://www.google.com/maps/contrib/118302592391028803090/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjURMF3PiO47_loldhYfYHmBFfmXZidC6KIimgaroOE5-iatqg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Punggol Waterway Point is a vibrant and family-friendly mall located near the scenic Punggol Waterway. It offers a great mix of retail stores, dining options, and entertainment, including popular brands like FairPrice Xtra, H&M, and a variety of restaurants. The mall’s open spaces and waterfront views add to its appeal, making it a pleasant place to shop and dine. Families appreciate the indoor playground (Pororo Park) and kid-friendly facilities, while the nearby waterway provides a relaxing stroll after shopping. However, it can get crowded on weekends, and some may find the retail selection slightly limited compared to larger malls. Overall, it’s a convenient and enjoyable neighborhood mall with a relaxed vibe.",
      "time": 1742998901,
      "translated": false
    },
    {
      "author_name": "MOHAMMAD SHAIFULLAH",
      "author_url": "https://www.google.com/maps/contrib/116536372130568450349/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUVUdScJcJ5PaFOPBIP4en1rYLbgVn2IJYYuvNPxjU72m5a1OS4=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Waterway Point in Singapore is a vibrant shopping mall located in Punggol, offering a variety of retail and dining options. Open daily from 10 AM to 10 PM, it houses popular brands like Uniqlo, H&M, and Adidas. Dining options include renowned eateries such as Din Tai Fung and Shake Shack. With scenic waterfront views, it combines leisure and shopping, making it a perfect destination for both locals and tourists. A great spot for fashion, food, and relaxation.",
      "time": 1731341117,
      "translated": false
    }
  ],
  "types": [
    "shopping_mall",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3579422085157865056",
  "user_ratings_total": 14436,
  "vicinity": "83 Punggol Central, Singapore"
}