{
  "formatted_address": "333A Orchard Rd, #03 - 01 / 02, Singapore 238897",
  "geometry": {
    "location": {
      "lat": 1.3019461,
      "lng": 103.8368734
    },
    "viewport": {
      "northeast": {
        "lat": 1.303398680291502,
        "lng": 103.8382789302915
      },
      "southwest": {
        "lat": 1.300700719708498,
        "lng": 103.8355809697085
      }
    }
  },
  "name": "Wild Honey Mandarin Gallery",
  "place_id": "ChIJSZujEpEZ2jERc0ez6ins24Y",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Winter Shu",
      "author_url": "https://www.google.com/maps/contrib/114706959143910116445/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKohW3tlL81oW7zHS9CLcGHIEIkyiPDTJian8bU-e4qyWFA5A=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Excellent food. Had the Tokyo breakfast with delectable pork belly and accompanied by comforting rooibus tea and waffles to end. Too bad the tea didn't come with the teabag, so couldn't request for a hot water refill. Ambience was neither uncomfortable nor extraordinary. Service staff were courteous and looked genuinely happy to serve. Just a suggestion for the staff not to always push for the most expensive seasonal specials when asked for recommendations.",
      "time": 1744876435,
      "translated": false
    },
    {
      "author_name": "Victoria Ng",
      "author_url": "https://www.google.com/maps/contrib/113256242126785660635/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW4wwny-Ad7OgjnkY6wz6Py2NQxmzz2st3wD0RHwDayPkyyyS4=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "I have always love coming to Wild Hiney to enjoy brunch or an early dinner. Love the ambience of it being like in a study room. With those lovely hugh arm chaurs and windows, it just spells out loud, HOME! Will always look forward to going back there soon. Service is awesome and do come around tea time like 3pm as it is really nice and quiet. Ordered Boulevard St Michel and French Earl Grey and I'm transported to the awesome streets of Paris!",
      "time": 1745637812,
      "translated": false
    },
    {
      "author_name": "Allen Lee",
      "author_url": "https://www.google.com/maps/contrib/110915621300857531177/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWIejHlPeXxmToJvJVsEI8af9XRlbmLHM0ZyvleE9TCorrpINg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "My recent birthday celebration at Wild Honey was nothing short of spectacular, and while the incredible food and stunning presentation deserve high praise, it was the exceptional service that truly elevated the experience. From the moment we were seated, we felt incredibly well taken care of.\n\nThe dishes were not only a feast for the eyes, with beautiful plating, but also an absolute delight for the palate. Each bite was bursting with flavor, and the portion sizes were so generous.\n\nHowever, the standout of the morning was undoubtedly our waiter, Danish. His attentiveness was remarkable. He consistently checked in on us without being intrusive, ensuring our water and coffee glasses were always full. He even went above and beyond by offering to help us capture some memorable birthday photos. Danish's warm and genuine demeanor truly made us feel like valued guests.\n\nThe care didn't end with our meal. The fact that the manager, Jocelyn, followed up via email to inquire about our experience speaks volumes about Wild Honey's commitment to customer satisfaction.\n\nWild Honey comes with my highest recommendation. If you're looking for a restaurant that combines exquisite food with unparalleled service, look no further. And if you have the pleasure of being served by Danish, you're in for a truly exceptional dining experience.",
      "time": 1746877976,
      "translated": false
    },
    {
      "author_name": "Felise Alena",
      "author_url": "https://www.google.com/maps/contrib/106682066403097125674/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUVyDHACilFVKpAp4Ua5u2feyTYSQBCQ--TwS7dzaxXUG2NMbOGVw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Been here a few times and decided to book a slot to bring my mum for her birthday brunch.  Most definitely recommend booking online as wait times can be long if you walk in.\n\nDidn’t get the names of the staff today but they were all detailed and warm, making us feel very comfortable. The hot chocolate is one of my favourite drinks here!\n\nFood is good as always and portions can be rather large. They even went the extra mile to prep a slice of birthday cake with a candle for my mum 💙 The servers take care of you, asking you how your meal is going every now and then ☺️\n\nThank you for giving us such an enjoyable meal experience 😊 I will be back again for sure.",
      "time": 1744789250,
      "translated": false
    },
    {
      "author_name": "Melvin Lim",
      "author_url": "https://www.google.com/maps/contrib/108538147964918099161/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWr6-HHWPfxZlMh9qUsmKXrBW1C00P7yUCUBrnn4HIH5kI6JctEiQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "Ambience is nice overlooking busy Orchard Road. Food is delicious and I absolutely love the Ruben sandwich. Coffee (Espresso and Macchiato) is well made. Wait staff is polite and attentive. What's not to like about this place?\n\nAn update from my last visit with my then friend. Now this friendship has blossom and I'm delighted that we are a couple now. We visited on Good Friday weekend for dinner. The staff again is very polite and professional, asking if we are celebrating anything.\n\nWe ordered from their Easter menu and they were delicious. We had the Madison Avenue Rosti and the Chesapeake Crab Cake Benedict. Their Paris Hot Chocolate is very good, my French Earl Grey came in a pot. I hope they will put these in their regular menu as well. They were oh so good..  There are just so many to try but we are stuff with what he have on hand. Next time..",
      "time": 1745216707,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9717620285757409139",
  "user_ratings_total": 1974,
  "vicinity": "333A Orchard Road, #03 - 01 / 02"
}