{
  "formatted_address": "221 Balestier Rd, Rocca Balestier, Singapore 329928",
  "geometry": {
    "location": {
      "lat": 1.3213733,
      "lng": 103.8527063
    },
    "viewport": {
      "northeast": {
        "lat": 1.322782680291502,
        "lng": 103.8539966802915
      },
      "southwest": {
        "lat": 1.320084719708498,
        "lng": 103.8512987197085
      }
    }
  },
  "name": "Wolfbay Bistro & Bar Pte. Ltd.",
  "place_id": "ChIJpR_--8AZ2jERC7CjXl2xWmk",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "MyBean&Kho.",
      "author_url": "https://www.google.com/maps/contrib/113488965293874123641/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXH1iX8fQOWzL8BZWAJVACpX2EkC8mXjdHjxIZHPwZOAbVJCmEU_g=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "In these surroundings in Singapore, beer is in average SGD 11 per glass. This place proposes a very worthy happy hour on weekdays until 7.30pm (1st photo) and for big beer lovers a beer buffet at certain times (2nd photo). Outside happy hours, their price is lower than other places.\nTheir seatings are outdoor seatings, not covered.\nSoft drinks and snacks are also very reasonably priced. A basket of peanuts is SGD 2.\nWaiters and boss are kind and efficient. On Friday evening, all tables are occupied.",
      "time": 1731919899,
      "translated": false
    },
    {
      "author_name": "Kim Jun Hong",
      "author_url": "https://www.google.com/maps/contrib/115322490341831324881/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVbbaPeY7qivr4pI3RZ8rnEW7jssq1iGZNjpkT9QqGoSzHQpESw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 2,
      "relative_time_description": "4 months ago",
      "text": "I’ve been to this place a couple of times, and their service is consistently good. Special shoutout to one of their Indian female servers—she’s obviously not Chinese but speaks perfectly and serves with a friendly attitude. Kudos to her!\n\nTheir Happy Hour offers are great, with mugs of beer priced at just $5 before 7 PM. Even after Happy Hour, the prices don’t vary much—perhaps $5 extra for a bucket of beer, which is still a steal.\n\nHowever, there is something i’m very disappointed with their policy. If you order multiple drinks before the happy hour (7pm) cutoff (e.g., 6 pints), they require all undrunk pints to be brought to your table as soon as happy hour ends. This happened to us, and it not only ruined the experience but also affected the quality and taste of the beer. It’s frustrating and feels unnecessarily rigid. I really hope they can reconsider and adopt a more flexible approach to avoid spoiling what could otherwise be an enjoyable experience.\n\nOther than that, the food is both tasty and affordable. My personal favorites are their Tater Tots and Fried Beancurd—definitely worth trying.\n\nThe ambience is lively and noisy, which might not be for everyone, but it fits the vibe of a casual drinking spot. Tables for two are usually available before 8 PM, but the place fills up quickly after that.\n\nOne downside is that they only offer outdoor seating, which can be inconvenient when it rains. On the plus side, though, smokers will love the freedom to smoke at their tables while enjoying their drinks.\n\nOverall, this is a great spot for a casual hangout or a pre-drink warm-up before heading elsewhere. I’ll definitely be visiting again soon (if they are more flexible)!",
      "time": 1734981265,
      "translated": false
    },
    {
      "author_name": "Ruth Go",
      "author_url": "https://www.google.com/maps/contrib/112369372959976661693/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV534RfNorJBVEQjq7I6QIZkjIYv4O9VvP7Hal-6ogkpVb4eXw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "10 months ago",
      "text": "Food is average. The flavour for the wings is not really there, need to lather with ketchup. The burger is like your neighbourhood burger, something to fill the stomach, i guess. Good chill spot though, offering tower drinks, wines, spirits.",
      "time": 1720191561,
      "translated": false
    },
    {
      "author_name": "Samantha Han",
      "author_url": "https://www.google.com/maps/contrib/100543882973615460981/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW0q_A5SHS8uwWfbRRBqB8XmU7_iBbCJgE_Yog5alFHHryv0wQh3g=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Note that the name has changed to WOLFBAY Bistro & Cafe instead of Wolfgang. The service provided by the young man and a slightly older woman is excellent. Price is very reasonable and food is good. Outdoor seating available. I was seated outdoor and no mosquitoes when I visited, that was good! Highly recommended for a relaxing time if you are living or working in that area.",
      "time": 1649345884,
      "translated": false
    },
    {
      "author_name": "Chia Zhenli",
      "author_url": "https://www.google.com/maps/contrib/113585729721705149423/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUhrOarJH5tXzUE-y_JJsGkQVlyML9cx-XGIE63FpHAHI6O_2NG=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Staff service is good. They serve you jug of beer in bucket of ice and they have music playing in the background and will direct you to washroom in the mall 👍",
      "time": 1732721080,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7591575136464252939",
  "user_ratings_total": 29,
  "vicinity": "221 Balestier Road, Rocca Balestier"
}