{
  "formatted_address": "170 Upper Bukit Timah Rd, Singapore 588179",
  "geometry": {
    "location": {
      "lat": 1.3431566,
      "lng": 103.775863
    },
    "viewport": {
      "northeast": {
        "lat": 1.344782280291502,
        "lng": 103.7773068302915
      },
      "southwest": {
        "lat": 1.342084319708498,
        "lng": 103.7746088697085
      }
    }
  },
  "name": "WorldMark Employment & Consultancy",
  "place_id": "ChIJyd5nY4oQ2jERUbB7nMjmies",
  "rating": 2.8,
  "reviews": [
    {
      "author_name": "Jess",
      "author_url": "https://www.google.com/maps/contrib/108496443753180319704/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK8SxPMa8IrVmC-USkm649DviPcqGgPSQbJCU8UnURZ4PltTA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "i have engaged worldmark agency to supply a domestic helper to me. The maid he supplied to is very good n very suitable\nI will strongly recommend Worldmark agency to my friends if they want honest and reliable maid service",
      "time": 1747138135,
      "translated": false
    },
    {
      "author_name": "Tong Seng Koh",
      "author_url": "https://www.google.com/maps/contrib/117499510933543021812/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXGUUbSAUC8mXPibb74TthQDItMVNec8zyFGnekCA6JbT112nt6=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Very prompt to source for a suitable maid for us.  We needed a Chinese speaking maid to take care of our mother in the hospital.  In time to complete the training before discharge.  A great relief to our family.",
      "time": 1744003022,
      "translated": false
    },
    {
      "author_name": "Grace Tan",
      "author_url": "https://www.google.com/maps/contrib/105586585518858992218/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocItcN-qfwtj3Ry66cQNhPq_j6mRpOqV9i77U-0NlxdewGfuwg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I always believe in really checking out agent myself instead of listening or just believe in what other people write good or not. So I tried out Worldmark Consultancy. Truly, mark lim the boss is very genuine and transparent. He does all the things lawfully and efficiently to get a maid for me. I will surely recommend WORLDMARK CONSULTANCY",
      "time": 1744095345,
      "translated": false
    },
    {
      "author_name": "Kek Hin Phua",
      "author_url": "https://www.google.com/maps/contrib/103819503691287959833/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIQkdGy3LXFK2AO6cJpOHxBwf28hkHgl3F0KS6XUqEZ4-P4qw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I recently engaged a maid from WORLDMARK CONSULTANCY owned by Mr Mark Lim. He is very honest n transparent to find a very suitable, dedicated and committed maid to meet my requirements. With this in mind, I would recommend WORLDMARK CONSULTANCY to any person who needs a maid who double up as care giver to the employer’s satisfaction.",
      "time": 1743751593,
      "translated": false
    },
    {
      "author_name": "Jamie Wong",
      "author_url": "https://www.google.com/maps/contrib/111412270367588406347/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIeX9hL6_AU81IdmAY8xyCDoLhZ0PGc0MDRe4hPwdwNQOVI3w=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "Worst nightmare ever! The agent who is also the boss is unprofessional, dishonest, not being transparent and conflict of interest. First time in my life where I have to raise my voice over someone!\nWe are supposed to hire a helper who is also this boss's SIL. (Yes, this is the biggest mistake that I have ever made!) I should have put a stop when I know that there is conflict of interest, but I decide to proceed by having some faith in this agent which eventually prove me wrong.\n\n- Everything process manually, in a very old school way. We were asked to sign on a printed unclear blank contracts which some clauses are barely readable. Agent claimed that printer is run out of the ink.\n- Meet up with the agent least 3-4 times throughout the entire process, at hawker/cafeteria. Not sure if there is an office. Based   on ACRA, registered office is at lucky plaza. However, the address which is hand-written manually on receipt is in Bukit Batok (suspect this is the home address).\n- Based on contract term, helper loan stated 2 months. 5 days before we pick up helper, agent called and said helper loan is 4 months instead and it needs to pay all in cash on the day we pick up.\n- There are a few additional requests written manually on the contract without being consult us at all. We only got to know it 2 days before picking up the helper. Obviously, those requests are in favor of the helper since she is his SIL. It is not about the requests but it's more of we are not even being inform/discuss before it is written on it.\n- Normally, it only takes 2 days for helper to complete all necessary training and do the thumbprint in MOM upon arrival. However, we were told that she needs more days (around 5 days), when we question, again there is no answer. you can tell that he's trying to cover up with all excuses. Worst is he still challenge you as if you are at fault.\n\nOf course there are a lot more of disagreements and unpleasure moments happened in between. I am the one who pay the agent fee however I do not get the service from the agent (imagine I have to log in MOM portal myself and fill in all required info and submit as individual application instead of authorize the agent to process). On top of that, this agent is acting in the interest of the helper instead of ME! I feel like I have conned by the agent, using me as stepping stone to bring his SIL to Singapore. Whoever that hire his SIL, I wish her luck.",
      "time": 1679376849,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16972350420015624273",
  "user_ratings_total": 9,
  "vicinity": "170 Upper Bukit Timah Road, Singapore"
}