{
  "formatted_address": "727 Clementi West Street 2, #01-232, Singapore 120727",
  "geometry": {
    "location": {
      "lat": 1.3041749,
      "lng": 103.7637237
    },
    "viewport": {
      "northeast": {
        "lat": 1.305788680291502,
        "lng": 103.7654244802915
      },
      "southwest": {
        "lat": 1.303090719708498,
        "lng": 103.7627265197085
      }
    }
  },
  "name": "Xin Mei Xiang Lor Mee",
  "place_id": "ChIJDcy0Y_ob2jER3ZTAqcky_dc",
  "rating": 3,
  "reviews": [
    {
      "author_name": "umake mehungry",
      "author_url": "https://www.google.com/maps/contrib/111406931807185833571/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU7xXdedN7uiieenG0ai83EG55YmxvC0-lvsAbSPXlae6fnH-U=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "There was a time when we would make the journey all the way to Old Airport Road, braving the famously long queues, just for a bowl of Xin Mei Xiang’s comforting traditional Lor Mee. With their recent expansions, I’m thrilled to see this nostalgic taste becoming more accessible. Just last weekend, I had the chance to visit their Clementi branch. Today, they have grown to six outlets, located in Balestier, Clementi West, Holland Drive, Bishan, Tampines, and, of course, their iconic stall at Old Airport Road.\n\nXin Mei Xiang Lor Mee’s Clementi Outlet\nIn addition to the classic Lor Mee we know and love, Xin Mei Xiang has introduced a range of creative variations. These braised noodles are now paired with an array of toppings such as chicken cutlet, fish flakes, pork belly, and even scallops. Beyond their popularity with locals, they’ve gained significant recognition, having been featured in the Michelin Guide and highlighted by various media outlets like Makansutra, Shin Min Daily News, CTrip, and Gourmet List.\n\nA quick glance at the menu was all it took to spot our favorites, and we made our decision swiftly as the queue was growing. Here's what we ordered: four different variations of Lor Mee.\n\nI’m quite accustomed to their signature bowl of traditional Lor Mee, which comes loaded with shredded fish, tender braised pork belly, crunchy bean sprouts, and a flavorful braised egg. All of this goodness is served over yellow noodles, perfectly soaking up the rich, gooey braised gravy.\n\nSignature Lor Mee 招牌卤面 - $6\n\nSavor the best of both worlds with a combination of fried and shredded fish paired with braised noodles. This is a great option for those who prefer a fishy twist to the traditional bowl of Lor Mee.\n\nDouble Fish Lor Mee 双鱼卤面 - $6\n\nThe  Lor Mee dish beautifully showcases two distinct types of fish: crispy fried and tender shredded fish, offering a delightful mix of textures and flavours. The rich, savoury braised gravy ties everything together, making it a satisfying meal for fish lovers.\n\nIf you’re craving something fried, go for the Chicken Cutlet Lor Mee. The cutlet is deep-fried to golden perfection, making it a delicious complement to the bowl of savoury noodles.\n\nChicken Cutlet Lor Mee 炸鸡扒卤面 - $5\n\nThe Chicken Cutlet Lor Mee offers a satisfying crunch with its perfectly golden, crispy cutlet. Drizzled with savoury gravy, it's an indulgent pairing that elevates the traditional Lor Mee experience.\n\nThe Scallop Lor Mee is a premium addition to the menu, standing out as the priciest option. It's a delightful twist on the traditional Lor Mee, featuring succulent scallops that elevate the dish to a more indulgent experience.\n\nXin Mei Xiang Scallop Lor Mee 新美香扇贝卤面 - $8.50\n\nEager to sample a bit of everything, we added extras like Ngoh Hiong, chicken cutlet, and shredded fish to enhance each of our individual servings.\n\nOverall, the taste was quite satisfying, bringing back nostalgic memories of our breakfast trips to Old Airport Road Food Centre.",
      "time": 1731460832,
      "translated": false
    },
    {
      "author_name": "Melody Ong-Goh",
      "author_url": "https://www.google.com/maps/contrib/106306459754694107032/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKSoYBmBLeolMJKWdvj3w3bftp8cw21fyflNSi4VgICOzmoNQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "I’ve heard really good stuff about the Xin Mei Xiang Old Airport Lor Mee and was surprised to know they have now expanded to 6 outlets. I brought my mum and sis with me recently to check out the Clementi West outlet and we had a sumptuous meal in a clean and peaceful environment.\n\nXin Mei Xiang have won many awards including being included in the Michelin Guide, Makansutra and People’s Choice Awards.\n\nCraving a bowl of flavorful Lor Mee that hits all the right notes? I love it with a generous amount of garlic, vinegar and chili for the full kick. We best enjoy the thick gravy with abundant ingredients and with a mix of yellow noodles and beehoon.\n\nWe tried the Signature, Crispy Fish and Braised Pork Lor Mee and I feel that the signature gave me the best of every bit. I hope to try the Hakka pork and scallop lor mee next time.",
      "time": 1735114737,
      "translated": false
    },
    {
      "author_name": "Willtravelforfood17",
      "author_url": "https://www.google.com/maps/contrib/107466929619544581756/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVM0vpSMoGt9ya536LbQlNKUiD1AhkFthIU5RhEqw7Gy8nNnhV-=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "Thicc and delicious lor mee on a rainy day at Xin Mei Xiang Zheng Zong Lor Mee really hit the spot! There are 5 outlets throughout Singapore now and they are also available on caterspot, foodline, foodpanda and GrabFood!\n\nWe tried their:\n\nSignature Lor Mee - broth consistency was just right, not too thick, not too thin. Noodles were springy and well cooked and we had a generous topping of fish flakes and pork in it.\n\nDouble fish lor mee - loved the big, well-cooked chunks of cod fish\n\nBraised pork lor mee - Pork was melt-in-the-mouth\n\nHakka fried pork belly - Really tasty, moreish and crunchy\n\nUncle at the stall was very friendly and provided really quick service! Will visit again!",
      "time": 1720760168,
      "translated": false
    },
    {
      "author_name": "Doris Tan",
      "author_url": "https://www.google.com/maps/contrib/114579856440038416867/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV742Jiqw8TrdBQwAkKVSYpBU2K9Us6ByXQUW2aux01SRpyLIod=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "5 months ago",
      "text": "Xin Mei Xiang Lor Mee\n\nHeard a lot about XMX Lor Mee at old airport road so try this at Clementi West/ West Coast area instead.\n\nPortion was big and suitable for carbs lovers.\n\nVery interesting texture as the big bunch of taugeh (beans spouts) are nearly raw.\n\nWe didn’t manage to see the scallop option on the menu so we ordered the Signature ($6/$8), double fish ($6/$8), braised pork ($5/$7) and chicken cutlet ($5/$7) versions.\n\nMight try the double fish Lor mee again in future as it includes fried fish which is a nice treat!\n\n📍727 Clementi West Street 2\n#01-232\nSingapore 120727\n\nAlso available on caterspot, foodline, foodpanda, and GrabFood",
      "time": 1733594996,
      "translated": false
    },
    {
      "author_name": "Clare",
      "author_url": "https://www.google.com/maps/contrib/114640054980054774653/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK7ifMaLR6gxzLDu_Q8PnBw_P_DW_ZU1a5V8aK7afQad6Lhbw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Food was GOOD! My parents loved it and couldn’t stop praising the generous toppings and hearty portions. There is no need to upsize! the regular portion is already super filling!",
      "time": 1735827383,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15563651728980088029",
  "user_ratings_total": 24,
  "vicinity": "727 Clementi West Street 2, #01-232, Singapore"
}