{
  "formatted_address": "277 Orchard Rd, #01-16, Singapore 238858",
  "geometry": {
    "location": {
      "lat": 1.3005813,
      "lng": 103.8391092
    },
    "viewport": {
      "northeast": {
        "lat": 1.301897130291502,
        "lng": 103.8403915802915
      },
      "southwest": {
        "lat": 1.299199169708498,
        "lng": 103.8376936197085
      }
    }
  },
  "name": "Yang Guo Fu Mala Tang 杨国福麻辣烫",
  "place_id": "ChIJGXjEql0Z2jERdkVlZa-srfk",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Jeanette",
      "author_url": "https://www.google.com/maps/contrib/106802533129560931521/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocICDSREhP3fXYxJ75e7z8CW3sVYpo2GU_-EkfElJ3tiQPmksw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "Be prepared for some waiting time as seating is limited even during off peak hours. They offer a variety of ingredients and soup bases to choose from, catering to different preferences. Their signature is the collagen pork broth soup, which is rich and flavorful. While the broth is enjoyable, it can feel a bit too rich and thick toward the end of the meal. There is a 10% discount for your next visit upon making payment at the counter.",
      "time": 1734854202,
      "translated": false
    },
    {
      "author_name": "Nathania Callista",
      "author_url": "https://www.google.com/maps/contrib/102199711526848937980/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWIZQNAnWyTkQCHozzyvd5H4YbMvdlNtnjlK1v9zfEK977iYIcw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "I’ve try several soup to compare and all is good, tasty ! The tomyum one so fresh with the lime and the broth also thick ! The chicken aroma so strong you can feel it so nice! Just the -1 things that not good is the veggie too much boiled so it’s mushy like overcooked. Overall worth to try!",
      "time": 1739241015,
      "translated": false
    },
    {
      "author_name": "Cayla Tan",
      "author_url": "https://www.google.com/maps/contrib/113251348641070023350/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKXdoxfgncnLdMVYQFLDGNdAsVxfAJf9BjeB2_exkt7DYbM3bi9=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "Overall disappointed with the mala here.\n\nThey don’t have normal mala tang, they are all flavoured (tom yum, beef, collagen). Additionally, the dry mala was not what we expected at all. The mala was not stir fried; everything was boiled and plain. The mala sauce was given at the side and for you to mix it in. While the spice was indeed nice and “ma,” the texture of the noodles and ingredients really ruined the entire taste. The noodles had gotten so soggy and mushy.. Really not your usual mala. Maybe some might like it (their ingredients are decent!), but i was disappointed and would not come back",
      "time": 1742775330,
      "translated": false
    },
    {
      "author_name": "Ken W",
      "author_url": "https://www.google.com/maps/contrib/111469334813473591346/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLXX2Y1kNRYis2r_TTVVtBs80K_YKXioZEQrawQUU0MzmAwONU=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "The beef broth was spicy even when I ordered 微辣, but it was perfect after I added the plain soup midway through.\n\nThe ingredients are fresh and tasty 👍",
      "time": 1739600930,
      "translated": false
    },
    {
      "author_name": "bethany",
      "author_url": "https://www.google.com/maps/contrib/110663196473450300405/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI5ebAPhDV-Hggb0N91v3e0tKwWJ8_0kGqj-Z51NWAp916VO3ew=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "food was okay. service was so horrendous\nmy friend and i decided to eat ygf around 1.30pm++ on a thursday afternoon. we wanted to sit at table with 4 seats by the window.\n\nright after the people sitting there left, the staff started cleaning up the tables and blatantly took out a huge “RESERVED” sign to put on the table even though we were waiting right in front of it??? huh??? so we decided to seperate the tables into two-seaters since we wanted the window seats.\n\nafter leaving our bottles on the table, we went to get our ingredients for our mala. however, the staff that put out the “RESERVED” sign on the table came out and scolded us harshly for it. in her words: “the tables are for 4 people and cannot be seperated. how will people sit if you seperate them??” then proceeded to move our bottles and dump them on some random table even though we followed her and wanted to move our bottles away ON OUR OWN.\n\napart from her rude behaviour, what made us even angrier was that there was NO QUEUE as it was a random weekday afternoon. there were so many empty tables around, what was she fussing about for?? plus one of the other staff on break was seating ALONE on a 4 seater table?? like the hypocrisy please???\n\nafter we got our food, we witnessed another 2 older ladies going up to sit at the 4 seater table… why did the staff not direct them to the many other EMPTY 2 SEAT TABLES THEN???\n\nthis was actually such a foul and ridiculous experience. please train your staff better. service staff are not supposed to show your freaking attitude and be rude because you think some younger customers look like pushovers.\nNEVER COMING BACK AGAIN",
      "time": 1744698163,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "meal_takeaway",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17991225955735389558",
  "user_ratings_total": 978,
  "vicinity": "277 Orchard Road, #01-16"
}