{
  "formatted_address": "2 Stadium Walk, #01-04, Singapore 397691",
  "geometry": {
    "location": {
      "lat": 1.2997484,
      "lng": 103.8746042
    },
    "viewport": {
      "northeast": {
        "lat": 1.301353280291502,
        "lng": 103.8762707302915
      },
      "southwest": {
        "lat": 1.298655319708498,
        "lng": 103.8735727697085
      }
    }
  },
  "name": "Yarana",
  "place_id": "ChIJma0igoIZ2jERVRxBPZWlFXI",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "George Kooi",
      "author_url": "https://www.google.com/maps/contrib/106492118759990606649/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVBlVJj5WDAXLQ_nI47Ekd1yKGZ5KGn8ROyStyPsUG28UH0i2S4=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "We came over to Yarana for dinner. This North Indian restaurant has been one of the go-to places when we have guests in town. The cosy environment, top notch Northern Indian food and assortment of drinks allow for proper dinner conversations.  They do have outdoor seatings, if preferred.\n\nWe got some of their favorites from the menu :\n- Yarana Buttet Chicken $23\n- Purani Dilli Ke Seekh Kebab (Grounded Lamb Kebab) $22\n- Palak Paneer $22\n- Chat Pe Charcha Platter $20 w golgappas, papdi chaat, aloo tikki\n- Garlic Naan $7\n- Rabri Mousse w Motichoor Ladoo $11\n- Whisky Sour $18\n- Masala Chai $5\n\nThe ambience is friendly and the culinary experience is excellent.\n\nTwo of my familiar favorite Indian dishes, Butter Chicken and Palek Paneer are done very well here.\n\nButter Chicken pieces tender and juicy. The rich creamy tomato-based gravy is blended well with butter and cream plus the spices to give that great taste.\n\nPalek Paneer is basically blended spinach puree with spices and their version is smooth and creamy with cottage cheese pieces inside. Note that this is the non-sweet paneer which suits us best.\n\nThe starting Chat Pe Charcha platter is pretty unique to me starting with golpappas which are crispy hollow puris to be eaten with spicy zesty water. The initial reaction can be that sourish squint but it’s really appetizing. The Aloo Tikkis (fried potato patty) and Papdi Chaat (fried wafer topped with potato, chickpeas and yogurt) are also very nice starter bites.\n\nThey even have a VIP lounge for more drinks after dinner.\n\nThe waiting staff Deepesh and Vijay also gave good service.",
      "time": 1746200464,
      "translated": false
    },
    {
      "author_name": "sa 123",
      "author_url": "https://www.google.com/maps/contrib/116096497059592868798/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKUTiTOhgxJkoj1idn9q4MbvTTCEmle3MXSurbkNh4xp2E7QA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Nice place to have a fun noisy dinner. Went to celebrate women's day. The usual indoor dining area had been booked for an event. The private event space was opened up for dining. There were two groups there, ours and another one. Once the other group  left at 9:30pm we had the space to ourselves, asked the staff if we could put on bollywood dance videos on the large TV screen and we danced for an hour. Left around 11pm.\nFood: yummy. We ordered only vegetarian food as more 50% of the group was vegetarian and Indian food is shared. The paneer tacos were great served on a two-tier assembly to accommodate all the ingredients (must give more salad and the toppings, only the paneer was sufficient) .  We had the starter platter with pani puris, sev puri, and some patties.\nMasala papad and masala peanuts to share, fried rice and some manchurian gravy. The long island cocktail I ordered was nice though I typically see it served in a tall glass but this was served in a short squat glass. But other than the portion it was well made. It's minutes from Tanjong Rhu MRT in the Kallang stadium complex. So plenty of parking too.",
      "time": 1743159706,
      "translated": false
    },
    {
      "author_name": "Adelyn Tan",
      "author_url": "https://www.google.com/maps/contrib/104415768088659362270/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUYntzI4_WJztMuy1ts2gKQriFsednNUYsT_88xIjiXKOGtiNBAmg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "YARANA – Flavours of Friendship 💕💕 If you're craving authentic North Indian Fine dinning cuisine that tastes just like home, YARANA is the place to be! Every bite here is crafted with love, fresh ingredients, and rich flavors that transport you straight to the heart of India.\n\n✨ What I Tried & Loved:\n\n✅️ Pani Puri Chat Pe Charcha ( My fav)  – A trio of golgappas, papdi chaat, and aloo tikki. The sauce blend? Absolutely divine and appetizing with its zesty lime flavour! This is a must-order for all Pani puri lovers.🩷\n\n✅️ Kanpuri Marinated Lamb Chops – so flavorful and well marinated into the meat that was just so tender and juicy. The Singapore-style chili sauce adds the perfect kick. An absolute delight!💕\n\n✅️ Tandoori Fish Tikka – These creamy buttery tandoori-marinated fish is best paired with aromatic rice..🐟🐟\n\n✅️ Beetroot Croquettes – A crispy, wholesome bite made with beetroot, carrot, and Indian spices. Perfect for veggie lovers!\n\n✅️ Purani Dilli Ke Mirchi Wala Paneer Tikka – Soft cottage cheese infused with house sauce. Cheese lovers, this one’s for you!🧀🧀\n\nFrom the warm hospitality to the bold, authentic flavors, YARANA truly brings the essence of North India to your plate. Even though we are chinese we should totally visit this restaurant I kid you not the food here is amazing thanks to the skills and heartfelt hospitality of Chef Priya Josep. Be sure to experience it yourself. 💕💕",
      "time": 1740156167,
      "translated": false
    },
    {
      "author_name": "Parul Aggarwal",
      "author_url": "https://www.google.com/maps/contrib/101964495594697801521/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVfnSyfcU2aU-vClm4DQ06Ti21RRd1Wov5mDyUhwlxr6ivOnqYuhA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "We recently dined at Yarana and really liked the food options, prompt service and atmosphere was also warm. We were served by a girl named Preet who was very attentive with a pleasant smile. Recommend this place for a fusion menu and good taste",
      "time": 1737774600,
      "translated": false
    },
    {
      "author_name": "Angeline Soh",
      "author_url": "https://www.google.com/maps/contrib/109979941846743924155/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjURBqtlaB8UpcU6z73cJV5AyO1xIabi8VsvAPBwmozcEOq0wAHbig=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Happen to try out Yarana Indian restaurant.\nVery nice & cosy place.\nBrought my family there to try out.\nI never tried a indian restaurant before, but really amazed by their food. Even my kids love it so much.\nAll thanks to their chef recommendation, choosen all the kids friendly food for our family. We really enjoys their food.\nThere naan paired with butter chicken & palak paneer is damn nice..\nWill come back again for more food.",
      "time": 1733992766,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "bar",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8220658755231095893",
  "user_ratings_total": 844,
  "vicinity": "2 Stadium Walk, #01-04"
}