{
  "formatted_address": "1220 ECP, #01-21 East Coast Lagoon Food Village, Singapore 468960",
  "geometry": {
    "location": {
      "lat": 1.307119,
      "lng": 103.9349427
    },
    "viewport": {
      "northeast": {
        "lat": 1.308588630291502,
        "lng": 103.9364963302915
      },
      "southwest": {
        "lat": 1.305890669708498,
        "lng": 103.9337983697085
      }
    }
  },
  "name": "Yen Kee Fried Delights",
  "place_id": "ChIJs2LKNwAj2jERSjs7WjqAE8w",
  "rating": 2,
  "reviews": [
    {
      "author_name": "Zi Cheng Wan",
      "author_url": "https://www.google.com/maps/contrib/106794507518868422207/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI_3dq0qAL9wTLex2KC5Wsshs03vfnWnCYJMSdFozdS0pC6Vg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 2,
      "relative_time_description": "11 months ago",
      "text": "I came here for Chun Hiang (春香）but somehow that stall was unexpectedly closed today, so I settled for this stall because according to Singaporean culture, long queue = good food.\n\nIt was proven to me today that this theory is a misconception that involves a certain amount of luck.\n\nThis is the first time I had to give a 2-star review for a Hokkien Mee stall. In fact, the Hokkien Mee alone deserved only 1 star. The saving grace was its Fried Oyster Omelette (Orh Luah) which had some detectable wok hei. What a rare occasion that none of the four dishes we ordered impressed me.\n\nMy family and I tried four dishes: Fried Hokkien Prawn Mee, Char Kway Teow, Orh Luah, and Fried Carrot Cake (black+white)\n\nFirstly, the Char Kway Teow. It was probably the most decent one out of the four we ordered. It was sweet as usual, and there was nothing much to rave about. However, I chewed into bitter, hard burnt bits. I couldn't decipher if those bits were cockle shells/ sand or charred leftovers from previous orders, but I did see the cook add ladles of blood water into the serving as he was adding in the cockles for the fry, supposedly to add more seafood taste? There was a sour aftertaste, probably from this blood water.\n\nSecondly, the Carrot Cake. It was seasoned with the usual soya and sweet sauces as one would expect, and thats pretty much about it. A single, flat flavour. What made it bad was the sambal that came with it - it was completely incompatible with the carrot cake. There is a weird, metallic, machine taste in the sambal. I ended up leaving spoonful alone on one side.\n\nThirdly, the Orh Luah. I had such a good first mouthful that I exclaimed to my wife that it was nice. But halfway into the plate, it started to feel gelak; it was way too oily. Again, it was dismal to have to find questionable burnt bits (see picture) in this dish too.\n\nLastly, what I came for, the Hokkien Mee. This Hokkien Mee had zero wok hei. Two ladles of broth was thrown into the fry shortly after the pre-fried portion of noodles were added into the wok - evidence of callous effort as a cook. The pre-fried noodles were stored in a this big, uncovered metal receptacle. While this practice is not uncommon and acceptable considering patron's demanding expectation on speed, I did find a strand of long hair in the serving. While we were all disgusted, we found comfort to infer that the hair did not come from the balding cooks, and hence, we were not quick to blame. Nonetheless, they should probably rethink about how their ingredients are stored while maximising efficiency. The only good thing in this dish were the crispy pieces of pork lard. Thank goodness they were not stale.\n\nService-wise, it was quick and efficient - so efficient that the uncle didnt even bother to check how much was sent to him via paynow. There was a certain amount of trust involved, and in turn, forging a certain familiarity and closeness with customers. But this may not be a wise move considering this era of scams and cheats.\n\nAll in all, I left disappointed and indignant; Disappointed, because at best, this reflects individual professional indifference on the part of the cooks to produce food of admissible quality; Indignant, because at worst, this tarnishes the reputation of Singapore as the destination that prides itself for the UNESCO world heritage label on its hawker culture. Being situated along ECP and just a few kilometres away from Changi Airport, this hawker centre is the first stop for many tourists who come after hearing so much about our hawker culture. I am ashamed that this is the quality of food that formed the prototype memory of the many tourists that have come and gone thinking that this is the best food that Singapore has to offer.",
      "time": 1716994699,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14705238196405091146",
  "user_ratings_total": 1,
  "vicinity": "1220 East Coast Parkway, #01-21 East Coast Lagoon Food Village"
}