{
  "formatted_address": "170 Upper Bukit Timah Rd, #11-03 Shopping Centre, Singapore 588179",
  "geometry": {
    "location": {
      "lat": 1.3431115,
      "lng": 103.7760782
    },
    "viewport": {
      "northeast": {
        "lat": 1.344366730291502,
        "lng": 103.7772793302915
      },
      "southwest": {
        "lat": 1.341668769708498,
        "lng": 103.7745813697085
      }
    }
  },
  "name": "YNLA Education Studio Pte Ltd",
  "place_id": "ChIJ3Z-d3Q8R2jERcULvALr3psw",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Bryan",
      "author_url": "https://www.google.com/maps/contrib/103756931109149639629/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKVQl4iY66Js1QhB1syAauKAr9N4utfDHrcrbBEu-RixhQxM16i=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I am truly grateful to have achieved my milestone on my N level results.\nWhat started off as a tryout with YNLA Education Studio became my second home where my pillar of support and strength came from.\n\nAlthough I know I have to work hard on my final year exam results, I lack the motivation and resources for those subjects I needed help with.\n\nI started off signing up for Math tuition classes with Ms Florence at YNLA Education. Under her coaching and endless support (even at night she never fails to reply me) I started to have more confidence in the subject. This assures me that YNLA Education is there to help and support my studies.\n\nWith this experience, I signed up for Chemisty and Bio with YNLA Education Studio.\nOn one of the class test , I got full marks for Chemistry. I can see the transformation in myself all thanks to Teacher Dexter and Teacher Wen Jun.\nI decided to sign up for History tuition too. The dedication of the teacher with my hard work paid off and I managed to do well in my N levels.\n\nI was so happy when exams are finally over. In Nov, I received a letter from MOE as I was one of the top 25% of the cohort.\nMy family was pleasantly surprised, including myself. However , the joy  did not just stop there.\nJust yesterday when we were all back to school to attend our graduation ceremony, my name ‘Bryan’ was called out to be one of the top students in my school.\nI was so shocked and my parents were so delighted with this early Christmas gift. I could not have achieved all these without the unceasing help from YNLA Education Studio and the Teacher’s unwavering support.\n\nI hope that by sharing my success story, it can create awareness among students who are struggling and who are in need of help to navigate their studies can find the solution just like me at this centre. The teachers can definitely direct them to the right resources that can help them  improve.",
      "time": 1734410411,
      "translated": false
    },
    {
      "author_name": "Cavin Chuang",
      "author_url": "https://www.google.com/maps/contrib/100739710137380626417/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW5xbCVDvR4oVYSikbUZNYvjFru9DvFQv3v-RcZCI_3oX6MmZk=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Teacher Dexter is one of the best science tutors any student can ask for. He uses funny and interesting analogy to help students better understand the topic. My marks went from failing throughout secondary school to a A2 in O levels.\nTeacher Sherman is a flexible teacher. At the start of every lesson he will ask if we have any questions from school or any doubts he can clarify before class starts. I was never strong in writing essays so I would request him to focus more on essay structure. It also helps that at the end of every lesson he will pass us an essay to bring home that he written himself so that we would get an example of a well written essay. My marks from almost failing English at the end of sec 3 improved to a 2 point in N levels.",
      "time": 1736655051,
      "translated": false
    },
    {
      "author_name": "Ng Sharon",
      "author_url": "https://www.google.com/maps/contrib/111091074972736571687/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU2BdcZ4fKrPtJOBVVR6QZP3bdcv2dDFPqt-2DRql27aC8MFsk=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Tutor Florence’s dedication and responsibility to her teaching has earned her well-deserved trust from many parents. She encourages my child and helps to build up her confidence in answering challenging questions.\n\nMy daughter started with YNLA in September 2023. Under Tutor Florence’s guidance, she scored A1 in her End of Year examination. She is overwhelmed with her achievement as their efforts pays off. Within less than 3 weeks of hard work, grades from B4 to A1 is a significant improvement. Most importantly, she enjoys Tutor Florence’s teaching and always look forward to her lessons.\n\nLastly, thank you YNLA Education Studio for providing the opportunity to allow my child to have an enjoyable learning journey. We are happy that we made a right choice!",
      "time": 1698063934,
      "translated": false
    },
    {
      "author_name": "Seah Yanni Christine",
      "author_url": "https://www.google.com/maps/contrib/104267265570804404966/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLRPJlC6Z8LHkoWkYPZNQlwesHp0sMVh5ZbCsalAH0oFOZ8Tg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I sent my children to YNLA for English and Math tution and they commented that YNLA 's tutors are patient and clear in their teachings. I have seen great improvements in not just their grades but interest in the subjects too. Good Job!",
      "time": 1709720554,
      "translated": false
    },
    {
      "author_name": "Eric Chua",
      "author_url": "https://www.google.com/maps/contrib/111746604830042747352/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVFFBbAzba583AZYnTgsNWIBJChCo8K7bf9Ob-rb8vst3z1ENgTdQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "If you are looking responsible and high quality tuition services YNLA Education Studio is definitely the right choice. My kid benefited from this center Secondary Maths tuition and Science Tuition services, I am very grateful and impressed by their tutor late night support towards my child unclear questions on chemistry which makes him more confident in preparing himself during the exam period, with this satisfied experience I hope this review will help YNLA Education Studio to serve more students who needs help and may seeking for the right tuition center! Even I may not be staying at Bukit Timah but that didn’t stop me from getting my kid to go to this tution center.",
      "time": 1697515190,
      "translated": false
    }
  ],
  "types": [
    "primary_school",
    "university",
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14746746408122925681",
  "user_ratings_total": 14,
  "vicinity": "170 Upper Bukit Timah Road, #11-03 Shopping Centre"
}