{
  "formatted_address": "258 Pasir Ris Street 21, #01-22 Loyang Point, Singapore 510258",
  "geometry": {
    "location": {
      "lat": 1.3669641,
      "lng": 103.9645341
    },
    "viewport": {
      "northeast": {
        "lat": 1.368381180291502,
        "lng": 103.9658309802915
      },
      "southwest": {
        "lat": 1.365683219708498,
        "lng": 103.9631330197085
      }
    }
  },
  "name": "Yoshinoya - Loyang Point",
  "place_id": "ChIJ-RiDXFQ82jER0nS7JSmz7Lw",
  "rating": 3.3,
  "reviews": [
    {
      "author_name": "Hamzah Alsagoff",
      "author_url": "https://www.google.com/maps/contrib/110350566909335567625/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX1bOjlsUPXrHZA8ZPzRxT4zglwH576OxFTryfjNIR0UcI84DLb=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Rejoice. That's the unanimous sentiment that our lil family felt upon hearing that Yoshinoya, the og chain akin to Japanese fast food here that is found conveniently in many locations, is now wonderfully halal. We could not wait to finally be able to tuck into what we've always wanted to try so easily available and from what we could see affordably priced too. When we learned there is one nearby we knew it called for a quick drive to for makan.\n\nOk there is no need to go over the different types of classic Japanese staples on the menu for I've listed a snapshot of the receipt with the description of what we ordered and ate. Suffice to say there are preferred choices for each of us. And plenty more. We were so excited and focused on the personalised combination to choose from – they have many mains with attractive add-ons, good selection of drink choices and sweet tempting desserts to please everyone – from their convenient kiosk for ordering that we didn't realise we were holding up another party behind but the helpful staff directed them to order from the counter instead. How wonderful the service the helpful efficient staff were.\n\nI decided to try their don and opted for the special Double Beef Negitama Gyudon as my baby girl pointed out that it has diced spring onion which she knew her dad would favour. I could not resist having an extra Onsen egg. And since I could complete it with a value for money set with an Udders mango sorbet it was pretty much a done deal. My tired son, after his full shift of internship serving, perked up and promptly ordered his favourite ramen while his mom opted for the Shoyu beef one. My daughter wanted to try their curry rice as she saw it had one with cheese and I told her to go for the slice of American Cheese cake since the Japanese milky rich style I know she'd like.\n\nTo put it simply we were not only satisfied with the authentic food but were all delighted with our choices. Being Asian and local we of course sampled each other's choices so in one sitting we now have tried all their main fares. And again unanimously, with a happy belly, we all agreed that we've just got another family goto favourite that makes it so convenient for us.\n\nThank you, Yoshinoya. We heart you.",
      "time": 1735576094,
      "translated": false
    },
    {
      "author_name": "David Moh",
      "author_url": "https://www.google.com/maps/contrib/112451213464084221858/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXyv5nMYQX3TgK9UIFly0fZV8mJ18d8bYquyc0Md9gcvTjLNSOp=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "This is a small but cosy Yoshinoya outlet. It plays upbeat Japanese pop song and has comfortable tables and chairs.\n\nIt serves a good variety of Japanese food from rice bowl, Japanese Curry to Ramen. Food comes in different serving sizes - Small, Regular and Large.\n\nThe place is not crowded when I visited ( weekday around 8pm) and has plenty of seats available. Serving rate is fast and I didn't have to wait long before getting my dinner. Recommended for people who wanted a quick bite.\n\nThe place is located on the Ground Floor of the Loyang Point Mall. The mall has a big rooftop parking.",
      "time": 1694089980,
      "translated": false
    },
    {
      "author_name": "Dick Tracy",
      "author_url": "https://www.google.com/maps/contrib/109603317740341555803/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKx1jgl1T5-zdStuVfZwA1mXEPKwhN27b0JEfkKLMxaLH75rg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Been here almost every Sunday for lunch since 2023.  Food decent.  However, the company had made a change since 2024 where only 1 person would handle everything:  The cook, the server, the dish washer, and what not.  With only 1 guy manning the shop, we could always hear dishes and cookwares being thrown around loudly without any regards.  The atmosphere and service have turned from bad to worst.  To the unhappy dude, get another job.",
      "time": 1741880830,
      "translated": false
    },
    {
      "author_name": "Mark Ong",
      "author_url": "https://www.google.com/maps/contrib/117348003086836979353/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIvezRouV81rsLGfywwk53Egtdx_vuiM1Tkwi0KUXyvb051jQ=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "4 years ago",
      "text": "I like this quiet store. Because it lack a high human traffic , food are prepared and present better.  The decor of this place is nice too. Nowadays they did away the outside dinning area which is a good thing. That area are usually hawk by teens not paying and seating there.  A good place to have a hot meal and move on.",
      "time": 1615785349,
      "translated": false
    },
    {
      "author_name": "Eunn",
      "author_url": "https://www.google.com/maps/contrib/113301582956145099986/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV_aeI57gVVbggaS0s7HryfsZ3km2u6RO61CjX6Y1ZmuM0BO34=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "Wondering if this is the standard portion of rice for takeaway order. 🤔",
      "time": 1745646063,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13613452762942239954",
  "user_ratings_total": 52,
  "vicinity": "258 Pasir Ris Street 21, #01-22 Loyang Point"
}