{
  "formatted_address": "682 Hougang St. 61, Singapore",
  "geometry": {
    "location": {
      "lat": 1.3745184,
      "lng": 103.8858772
    },
    "viewport": {
      "northeast": {
        "lat": 1.375991830291502,
        "lng": 103.8872393302915
      },
      "southwest": {
        "lat": 1.373293869708498,
        "lng": 103.8845413697085
      }
    }
  },
  "name": "Yuan Yummy",
  "place_id": "ChIJ8UpSMQAX2jERvEqAWS3E1i0",
  "rating": 2.7,
  "reviews": [
    {
      "author_name": "oXRYSTALo Ong",
      "author_url": "https://www.google.com/maps/contrib/114556064085815871377/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSTtKcF9FYMbh-XNbDu8f7Whl3gi-ZY6T8pFPOm3v9Y98Ws7jL=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 3,
      "relative_time_description": "3 months ago",
      "text": "Yuan Yummy: A Mixed Bag with Potential (3/5 Stars)\n\nRating:\n\n• Atmosphere: 3/5 (Typical food stall setting, nothing particularly noteworthy)\n\n• Food Quality: 3/5 (Bland black carrot cake, slightly lukewarm and lacking wow factor)\n\n• Service: 3/5 (Not applicable, as the focus is on the food)\n\n• Value: 3/5 (Average prices, but the disappointing carrot cake makes it seem less value for money)\n\nOverall: 3/5\n\nDonkey and I recently visited Yuan Yummy, a food stall specializing in stir-fried noodles. I was excited to try their carrot cake, a dish I usually enjoy. However, my experience with the carrot cake was a bit underwhelming.\n\nI opted for the black carrot cake with added chili, hoping for a flavorful and satisfying treat. Unfortunately, the carrot cake was a little too dense for my liking, and the flavor was bland. It was also only slightly lukewarm, even though it was freshly prepared. The portion size was okay, but overall, it lacked that \"wow factor\" I usually find in carrot cake.\n\nI even tried adding chili to the carrot cake, but there was no hint of chili flavor. It was just a bit disappointing overall.\n\nI'm intrigued by the other dishes on their menu, especially their Hokkien mee. Donkey and I will definitely be back to try it and update our review once we've had the opportunity to sample more of their offerings.\n\nFor now, we’re giving Yuan Yummy a 3-star rating, based on our experience with the carrot cake.",
      "time": 1738979934,
      "translated": false
    },
    {
      "author_name": "Doraemon",
      "author_url": "https://www.google.com/maps/contrib/112665277904119154671/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX2VSCcaT9axvOwx2nD8XD3PgZ8V5VFnv420aocMSfLa6GlcEmN=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 3,
      "relative_time_description": "3 months ago",
      "text": "I recently visited Yuan Yummy, a food stall specializing in stir-fried noodles.  I was excited to try their carrot cake, a dish I usually enjoy. However, my experience with the carrot cake was a bit underwhelming.\n\nI opted for the black carrot cake with added chili, hoping for a flavorful and satisfying treat. Unfortunately, the carrot cake was a little too dense for my liking, and the flavor was bland. It was also only slightly lukewarm, even though it was freshly prepared.  The portion size was okay, but overall, it lacked that \"wow factor\" I usually find in carrot cake.\n\nI even tried adding chili to the carrot cake, but there was no hint of chili flavor.  It was just a bit disappointing overall.\n\nI'm intrigued by the other dishes on their menu, especially their Hokkien mee.  I'll definitely be back to try it and update my review once I've had the opportunity to sample more of their offerings.\n\nFor now, I'm giving Yuan Yummy a 3-star rating, based on my experience with the carrot cake.",
      "time": 1738882873,
      "translated": false
    },
    {
      "author_name": "Lawkoh",
      "author_url": "https://www.google.com/maps/contrib/108052690301826511555/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKPLWQ5BgDc0SNvfu-CWghwmeTgibdKqz0fNSMJkUebcCbdyA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 2,
      "relative_time_description": "3 months ago",
      "text": "Fried Oyster.\nOyster overcooked.\nNot aromatic, probably small fire and keep stirring in circle.",
      "time": 1739679551,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "store",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3303043075776989884",
  "user_ratings_total": 3,
  "vicinity": "682 Hougang Street 61"
}