{
  "formatted_address": "103 Yuan Ching Rd, Singapore 618654",
  "geometry": {
    "location": {
      "lat": 1.34168,
      "lng": 103.7200992
    },
    "viewport": {
      "northeast": {
        "lat": 1.343232430291502,
        "lng": 103.7220901302915
      },
      "southwest": {
        "lat": 1.340534469708498,
        "lng": 103.7193921697085
      }
    }
  },
  "name": "Yuan Ching Secondary School",
  "place_id": "ChIJc7QP2OUP2jERWYOwC5RTKAQ",
  "rating": 3.8,
  "reviews": [
    {
      "author_name": "trestres97",
      "author_url": "https://www.google.com/maps/contrib/114342535437432505546/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK8Pc75qBuFqfYHGjBkL1zf1lU8_U6xCzH9b71_h-_yfDBFZw=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "2 months ago",
      "text": "Yuan Ching? Some of the teachers there are really just amazing like Mr Jeffrey Chen Mr Wong cs etc. but the reason I only give 3 stars is due to the lack of facilities theres like no elevator so all the old and not very agile teachers have a hard time getting to their classes and also During recess time there is really absolutely nothing else to do but overall it's like an average neighbourhood school nothing too good nothing too bad",
      "time": 1740899269,
      "translated": false
    },
    {
      "author_name": "葵aoi",
      "author_url": "https://www.google.com/maps/contrib/107886981172546631749/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVahH8trytF0-OcFWRaJjD7bDaHn9pUExHhCc5XcDSONgpNDF0=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "please don’t come this school the discipline master mr jana is so unreasonable we aren’t even allowed to wear hoodies even on a cold rainy day and there’s even rules about the type of jackets we can wear like must be bright coloured and plain with no printings etc. Mr jana also tends to give out detention even after being late once only despite the fact that you have a valid reason. Not only that we aren’t allowed to wear colour less lip balm or sunscreen in school because he assumes it’s “makeup” and he likes to send people home without giving chances cause of their hair and if you aren’t completely shaved he would send u home as well. Another factor is that the school loves to spend its budget on useless things such as some rotating door and a dragonboat lego display instead of building a lift, there was construction for lifts but it was stopped midway for no reason. the school also likes to use its budgets on their main cca dragonboat and they completely ignore the other ccas. they also promised us a sandwich vending machine however they installed a orange machine which is very expensive for a tiny cup. please do not come this school if u don’t mind starving till 12pm everyday because that’s our average recess time.",
      "time": 1737732996,
      "translated": false
    },
    {
      "author_name": "Ang Si Le (Ycss)",
      "author_url": "https://www.google.com/maps/contrib/105089948651357909582/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK8kE6ggN-8mWLad88UuPawJgz9cmcrKKs6EIFLQcmKFIPU_w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "The school is near the MRT so there isnt much worry if you want to come to this school from far away. Also when I went to the school's open house, the students there were more interactive with you compared to other schools. I chose this school as they had a variety of cca options that i liked so even if I couldn't get into the cca that i really wanted to join, there are other options that I am still interested in. The school is lively and has a water body and a park (Jurong Lake Gardens) near to it so I can stroll around after school to brighten my mood after a long and tiring day in school",
      "time": 1737297601,
      "translated": false
    },
    {
      "author_name": "LISHAN ANG",
      "author_url": "https://www.google.com/maps/contrib/107767467976917708728/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLByPjAz_ho8uXgkCM2HovOJa8T-VxcHzuf4gNCQqFUpF3E-Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "i love yuan ching. #yuanchingpride. in the town of jurong stands our yuan ching school. the students of our school the nation's future leaders. efforts tdy, rewards tmr. we love our ppl and we love our nation too. be strong be healthy be a man of character. learning and working comes with beginning and end. strive hard for progress. act as good pioneers whn u get success in life FORGET NOT YUAN CHING SCHOOL.",
      "time": 1736665149,
      "translated": false
    },
    {
      "author_name": "Literal Literacy",
      "author_url": "https://www.google.com/maps/contrib/104156644290372575372/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLCj2AwzaPNJteBTJ8_Mn67yZ1GpCsAzm_TIpvCIyi28MaUTA=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "6 months ago",
      "text": "Most of the teachers there are pretty good, respectful and kind. However the way this school handles it's finances is pretty weird. Spending money on a turnstile that no one ever uses. Promising to build an elevator but stopping construction midway. Many of us have also requested for the installment of a sandwich vending machine many times but that never happened(we got an orange juice vending machine instead). Canteen food is good tho.",
      "time": 1729772747,
      "translated": false
    }
  ],
  "types": [
    "secondary_school",
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=299581270536520537",
  "user_ratings_total": 71,
  "vicinity": "103 Yuan Ching Road"
}