{
  "formatted_address": "631 Bedok Reservoir Rd, #01-886, Singapore 470631",
  "geometry": {
    "location": {
      "lat": 1.3336143,
      "lng": 103.9151389
    },
    "viewport": {
      "northeast": {
        "lat": 1.335012530291502,
        "lng": 103.9162872302915
      },
      "southwest": {
        "lat": 1.332314569708498,
        "lng": 103.9135892697085
      }
    }
  },
  "name": "乐满园海鲜烧烤 Le Man Yuan Seafood",
  "place_id": "ChIJiwILSGQ92jERjX5M6BJiFaU",
  "rating": 3,
  "reviews": [
    {
      "author_name": "Raymond Seah",
      "author_url": "https://www.google.com/maps/contrib/113361663713818392653/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ8N7VjlwE-MWaI-EATg-S2ISAPAeBH8ZUUxIKP03wP9nSwaw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Decided to try the food at this stall as I was told that they are a well known cze czar. Ordered bbq sambal sting ray and was told to wait for 30min. After 1 hr, the food still not ready as there was only 1 guy preparing BBQ food. I added an order of Gong Gong as I still need to wait for the BBQ stingray.\nThe Gong Gong was served first without toothpick and dipping sauce. I had to go to the stall and asked for those. The first toothpick broke when i try to \"dig\" the gong gong meat out. It was overcooked and rubbery. I gave up after I couldn't pull the Gong Gong out from its shell. This is the first time in my life that I did not finish my Gong Gong.\nFinally, the long awaited sting ray arrived... again... too well cooked... or should I say over cooked and too dry... makes me wonder if I am eating fish floss. The sambal chilli was too sweet and its not the sweetness from caramelized onions.\nApparently this cze czar stall just started the day before.. and it is normal for many friends and relatives to come support. I can understand if you are busy and I need to wait for my food. I cannot accept poor service and lousy food. I asked twice for the sting ray and no one can tell me when it will be coming. After informing the lady at the counter that the food was overcooked, she merely turned to the guy preparing the stingray and say \"next time don't cook for so long\". I probably won't order food from this stall anymore.",
      "time": 1702254428,
      "translated": false
    },
    {
      "author_name": "Pok Ci En",
      "author_url": "https://www.google.com/maps/contrib/104827866665321755424/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWMwyv0f6zQR-Jxd-PL60pyakZePW8usPi3LVO3GzM6OudsjK0E=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "It is a new stall at a new kopitiam since the previous owner sold it. They are new to the neighbourhood. They offer a great variety of seafood which is different from the usual Tze char stall. Their sambal is SO FREAKING AMAZING. I ate the sambal on its own. The portion is abit small but the food is great.",
      "time": 1703754382,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11895521824115293837",
  "user_ratings_total": 2,
  "vicinity": "631 Bedok Reservoir Road, #01-886"
}