{
  "formatted_address": "200 Pandan Gardens, #01-08a PeopleUp Enrichment Hub, Singapore 609336",
  "geometry": {
    "location": {
      "lat": 1.3207653,
      "lng": 103.7468578
    },
    "viewport": {
      "northeast": {
        "lat": 1.322019130291502,
        "lng": 103.7481879802915
      },
      "southwest": {
        "lat": 1.319321169708498,
        "lng": 103.7454900197085
      }
    }
  },
  "name": "人乐坊 (Ren Le Fang) - Happy Coffee Place",
  "place_id": "ChIJB7vUO_cb2jERCABMd1T5kBA",
  "rating": 3.4,
  "reviews": [
    {
      "author_name": "Serene Ng",
      "author_url": "https://www.google.com/maps/contrib/113122419163846230487/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWWltsCBikUe1GJ504hcBcJUqyyJ9cSDj1pZOaAy7ynwDoCYire=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Tldr; dont patronise unless willing to wait 30mins for toast or 40mins for a pancake.\n\nOut of 6-ish tables only one was occupied, where their food has already been served.\nI was the next customer and after payment i received my drinks immediately.\nMy coffee was bad and tasted like overburnt beans.\nSoup options were not available, so was kaya butter toast. It was only 12+ at noon and i was left with other toast and pancakes option.\nSettled with peanut butter toast and ham and cheese pancake eventually.\nHowever the food took too darn long, new customers came and were also getting impatient waiting over 20mins on a single pancake. A couple eventually left without waiting for their food.\n\nHalf an hour later, the toast and eggs came, the taste was just mediocre and lukewarm.\nWas sitting inside and the smoke spread so heavily throughout the cafe so i had to change seating to outside.\nFinally after another 10mins i went inside to ask for the pancake, to which one of the staff just replied tonelessly 好了 (its ready) without an apology. Never bothered to look customer in the eye for interaction as well.\nPancake tastes normal, ham and egg and mayo in between a prata-like wrap.\n\nTrue that they were understaffed but counter lady was also very unprofessional and seemingly impolite. There were 2 staffs manning the cafe and occasionally the ladyboss comes walking in and helps with the drinks before leaving again.\nHopefully they can improve their speed or their hospitality as a customer serving FnB cafe.",
      "time": 1706937490,
      "translated": false
    },
    {
      "author_name": "Wei Tan",
      "author_url": "https://www.google.com/maps/contrib/113727367121706943852/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVxY51gp3r9ncqUcwJH2-IG98lq42KTHhnSk0m8LYkp0_8LrdH76g=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "4 years ago",
      "text": "Cosy little cafe offering local favourites like toasts and eggs, pancakes and noodles at affordable prices. I really like the iced coffee on my first visit, but I realised on my subsequent visits that the taste lacks consistency. I've also tried the kaya toast, pancake and kimchi ramen so far, and I would say they're pretty satisfying (wife has been inspired by the kimchi ramen and wants to re-create it at home). Definitely a lovely corner to chill out with a book or two, if you happen to be in the area.",
      "time": 1611219366,
      "translated": false
    },
    {
      "author_name": "CK C",
      "author_url": "https://www.google.com/maps/contrib/114345555265183607362/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ0m70NQj0bnpa391gSdR9Fgk6LU3yy-v_P_hMWOqmVM9s3nYJM=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "3 years ago",
      "text": "A small cafe consisting of two indoor tables and maybe six tables outside. Environment was neat and clean with some nostalgia feel to it. I like that old-school crockeries were used to serve our orders. Prices were reasonable. Food was OK. The teh siu dai was well brewed. The peanut butter toast tasted stale though. Also, the bread used was not the thick ones pictured in the menu.\n\nOverall, a good place for families, especially those with kids visiting PeopleUp.",
      "time": 1645335961,
      "translated": false
    },
    {
      "author_name": "David Ng",
      "author_url": "https://www.google.com/maps/contrib/115547539243934965836/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUtPBjFPi20lqRTANEWe_GwELzC_sdJ9rAPRqJTrr6A8hEEAeM-=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "Price are reasonable in this cafe. Nice Koka Noodle, I just love it and went to this cafe second time with my family. Thank you Shirley the lady boss. Best wishes for your success keep it up!",
      "time": 1614653303,
      "translated": false
    },
    {
      "author_name": "Kai",
      "author_url": "https://www.google.com/maps/contrib/113885595031869775639/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIL7y1xZBO8c8uBknpDk3qAsTte0lPNKbtUI1fpV7XCnYtU_w=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "2 years ago",
      "text": "Pricing is reasonable. Food is average, convenient for a meal after a family outing to the nearby Bouncy Paradise. Indoor seating area is small - 1 x 4 seater + 2 x 2 seater tables only. A few other tables outside in a sheltered area.\n\nNote that the serving of sides is quite small. $4.90 for a few pieces of onion rings…",
      "time": 1676784974,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "store",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1193728042427219976",
  "user_ratings_total": 22,
  "vicinity": "200 Pandan Gardens, #01-08a PeopleUp Enrichment Hub"
}