{
  "formatted_address": "35, Jalan Eko Botani 3/4, 79100 Gelang Patah, 79100 Johor Bahru, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.4380941,
      "lng": 103.6193144
    },
    "viewport": {
      "northeast": {
        "lat": 1.439479780291502,
        "lng": 103.6206168302915
      },
      "southwest": {
        "lat": 1.436781819708498,
        "lng": 103.6179188697085
      }
    }
  },
  "name": "小团圆砂锅菜Small Reunion Restaurant",
  "place_id": "ChIJB7GVKg4L2jER7ikrZgtAa0Y",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Vivian Eng",
      "author_url": "https://www.google.com/maps/contrib/114391499141226612365/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXjl3-b7OleBhheGf2wjBv7IHcnEdpuynCv0Py2uDbhC-L6rwJktA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "a week ago",
      "text": "Affordable Prices, Mixed Feelings on the Food\nThe prices here are definitely budget-friendly, and the portions were just right for two people.\n\nHere’s what we tried:\n-Spicy & Sour Shredded Potatoes\nUnfortunately, it lacked both the sourness and the spiciness you’d expect from this dish. However, the shredded potatoes were crisp and refreshing, which was a plus.\n\n-Country-Style Stir-Fried Pork\nThis dish had a nice wok aroma and tender pork, but it was very oily. The green peppers were soaked in oil, making it a bit heavy. That said, it paired well with rice.\n\n-Boiled Sliced Pork in Spicy Soup\nThe soup and meat were both quite salty. While the portion was generous and the pork tender, the overpowering saltiness made it hard to enjoy fully. It included bean sprouts, black ear mushrooms, enoki mushrooms, and pork slices.\n\n-Garlic Pork Slices\nAt this price, I wasn’t expecting a lot of meat, but the presentation was a bit misleading. Only 7–8 thin slices of pork were laid over a bed of cucumber, giving the illusion of a full bowl. The cucumber had absorbed a lot of chili oil, which made it less refreshing than expected.\n\n-Grilled Sausage\nThis was decent. It was juicy and flavorful, though be careful when biting into it—as it can be quite hot inside.\n\n-White Rice\nSurprisingly, this was my favorite. The rice was sticky and had a nice texture. We saw others helping themselves to refills the rice and were told it was free, we even double confirm with the staff is the rice for free refill and the staff replied us Ya/Yes. But we were charged in the end. It wasn’t a big deal, but a bit confusing.\n\nOverall for me, I think that If you’re curious to try something new or looking for Chinese food on a budget, this place is okay.\nBut for me, it’s a one-time visit. The food didn’t quite meet my expectations, but the price point may make it worthwhile for others.",
      "time": 1746845285,
      "translated": false
    },
    {
      "author_name": "Gator",
      "author_url": "https://www.google.com/maps/contrib/114331842318070680564/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUf5N0YPQocYYralVhzxgKqHfnlJgSiXhs54DUya0oFIumc-54QVA=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Nestled in Eco botanic, Small Reunion Restaurant is a delightful surprise for lovers of regional Chinese cuisine. Specializing in Dong Bei, Sichuan, and Hunan dishes, this week-old gem already shines with its comforting “home-cooked” ethos and warm, attentive service.\n\nThe menu is a flavorful tour of China’s diverse culinary regions. The claypot presentation isn’t just aesthetic; it locks in heat and aroma, making every bite feel like it’s straight from a family kitchen. True to their promise, flavors are rustic, hearty, and unmistakably authentic—no fussy twists, just honest, satisfying cooking.\n\nWhat elevates the meal is the genuinely friendly service. The staff (and possibly the owners) greet diners with enthusiasm, happily explaining dishes or recommending personal favorites. Their pride in the food is palpable, and the welcoming vibe makes you feel like a guest at a lively family gathering.\n\nPrice-wise, it’s a win. For a restaurant barely a week old, Small Reunion already feels like a neighborhood staple. If you’re craving regional Chinese flavors served with warmth and authenticity, this spot is worth seeking out. A delicious reminder that sometimes, the best meals do taste like home. 🥢🍲",
      "time": 1742772036,
      "translated": false
    },
    {
      "author_name": "YJ",
      "author_url": "https://www.google.com/maps/contrib/105526844030740982598/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXzwALozudaRoDOB8wnGzlxVF0wIZQP-R40gmNjGZMA7PbeyRrJzg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "2 weeks ago",
      "text": "Most dishes are good. But Guo Bao Rou (one of the most expensive in the menu) is disappointing. The pieces are small, more flour than meat and not easy to chew.\n\nWe asked specifically no chili because there are children. But they still put chili 😳",
      "time": 1746438811,
      "translated": false
    },
    {
      "author_name": "Herman T",
      "author_url": "https://www.google.com/maps/contrib/102628033235675268323/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUzjRQ3p6WtQ02APVaLPEHGX7aQFiRc9K08FoKNfPeBg8P_swPn=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Your simple China dishes serve in clay pots. Lovely calrose rice to pair with tasty dishes. Hit the spot and reasonably priced",
      "time": 1743684873,
      "translated": false
    },
    {
      "author_name": "Elizabeth Chong",
      "author_url": "https://www.google.com/maps/contrib/111747178271591407467/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUKlDGfeHjq2SmiKmJgHlFXya3zzvCrDQzNtUDSoI4ck4s-8Zq6vg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "The food was good and the environment was clean and bright. You can bring your friends or family for dinner. Downside was the parking is difficult to find here.",
      "time": 1746370360,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5074219822865918446",
  "user_ratings_total": 32,
  "vicinity": "35, Jalan Eko Botani 3/4, 79100 Gelang Patah, Johor Bahru"
}