{
  "formatted_address": "56 New Upper Changi Rd, Singapore",
  "geometry": {
    "location": {
      "lat": 1.3247011,
      "lng": 103.9406955
    },
    "viewport": {
      "northeast": {
        "lat": 1.326068330291502,
        "lng": 103.9421391802915
      },
      "southwest": {
        "lat": 1.323370369708498,
        "lng": 103.9394412197085
      }
    }
  },
  "name": "正香肉骨茶（葯材）Zheng Xiang Bak Kut Teh(Herbal)",
  "place_id": "ChIJbWzFcwAj2jERvl0_L7eXufw",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "johnnykuochung",
      "author_url": "https://www.google.com/maps/contrib/110803765536711118720/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUIozbWPxugGZODavXWfBzv6f1AhKvSbLwscJ8qwdTiYAac9DJ3=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "It was a long, busy day at Zheng ZiChar, and as the sun dipped below the horizon, the cool sea breeze carried the promise of a quiet evening. After finishing the usual Sunday floor washing, you decided it was time to reward yourself with something hearty and satisfying.\nZheng Xiang Bak Kut Teh was the first place that came to mind. The thought of their peppery broth and tender pork ribs made your stomach rumble as you headed over. The little eatery was bustling but still had that comforting vibe you loved.\nYou slid into a table and ordered the classic bak kut teh with a side of you tiao. The server smiled knowingly—it was clear you were here for the real deal. Within minutes, the steaming bowl of bak kut teh arrived, its fragrant aroma wafting up like a warm hug after a hard day.\nThe first sip of the broth was heaven. The robust flavors of white pepper and garlic hit just right, soothing your tired body. The pork ribs were fall-off-the-bone tender, each bite melting in your mouth. You dunked the crispy you tiao into the broth, letting it soak up the goodness before savoring every bite.\nAs you polished off the meal, the world seemed to slow down for a moment. It was just you, the satisfying flavors of bak kut teh, and the simple joy of treating yourself after a day’s hard work.\nWalking back home, the night felt peaceful. You couldn’t help but think, Some days end perfectly, with a bowl of bak kut teh.",
      "time": 1735237088,
      "translated": false
    },
    {
      "author_name": "Brandon Yeo",
      "author_url": "https://www.google.com/maps/contrib/105654128362934703471/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUzOafkdJEwmtEYkOX2Gs2eOcgHkoUYGyhWuxG1Sj14EblFGq3HCg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Nestled away in a quaint coffee shop, I found this pretty good BKT. The service was unexpectedly good with the staff being friendly and inviting. Never had I had BKT where the staff were smiling and happily taking orders. One up for the F&B industry!\n\nTheir BKT isn't the peppery style but towards the herbal side. Though I didn't find it overly herbal, in fact, it's mild. Those who don't like overly herbal flavours will like this. The you tiao was crispy and fresh, no oily after taste. Peanut and enoki mushroom as side were well prepared and not overly salty yet still preserving the savoury goodness.\n\nWill be back to try other dishes!",
      "time": 1733447094,
      "translated": false
    },
    {
      "author_name": "Tan SKfire",
      "author_url": "https://www.google.com/maps/contrib/108049864032731628827/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX5cLJ-RU07WdIfosxNkvwWm902ldQdKoChbRIAjiKh2x0SDfi0=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "For this year's Chinese New Year Reunion Dinner, I ordered a Bak Kut Teh Pencai, and it was absolutely exceptional! This dish was not only a feast for the eyes but also an indulgent treat for the taste buds.\n\nThe broth was incredibly rich and aromatic, packed with deep herbal flavors that perfectly complemented the premium ingredients. Every scoop revealed a generous mix of fish maw, prawns, pig intestines, pork ribs, abalone, and many more delicacies.\n\nThe pork ribs were tender and flavorful, falling off the bone effortlessly, infused with the herbal goodness of the broth.\n\nThe fish maw was silky and absorbed the broth beautifully, adding a luxurious texture.\n\nThe pig intestines were well-cleaned, springy, and had just the right chewiness.\n\nThe abalone was smooth and slightly chewy, adding an exquisite touch to the dish.\n\nThe prawns were fresh, succulent, and naturally sweet, enhancing the overall depth of flavors.\n\nEach ingredient soaked up the essence of the Bak Kut Teh broth, making every bite deeply satisfying. The portion was also generous, perfect for sharing with family.\n\nThis Bak Kut Teh Pencai was truly worth every penny, offering a hearty, flavorful, and festive experience. It’s a must-have for those who love comforting yet indulgent dishes, especially for special occasions like a Chinese New Year Reunion Dinner.\n\nRating: 5/5 – Highly Recommended!",
      "time": 1738056323,
      "translated": false
    },
    {
      "author_name": "Hans Sutanto",
      "author_url": "https://www.google.com/maps/contrib/107403022024229817965/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV4DiMD5EiyQ274nrhvC6enSS7FHnQzhTnSzKJblFryynrmlGGOvg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "the signature bak kut teh came with few pieces of tau kee, some slices of pork belly, pork intestine, meatballs, and pork ribs. happy to see quite a number of ingredients and the pork ribs fell of the bone quite easily! the soup is quite refreshing and not too salty, just personally prefer if it could be more herbal. service was great! very friendly and my food came fast",
      "time": 1726402998,
      "translated": false
    },
    {
      "author_name": "Joseph Goh",
      "author_url": "https://www.google.com/maps/contrib/111155777361466876982/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjViZ4fjdsolWcUUcxQwGfYKbdUwl8qvUpBmJ11DQ6JIGeAwukJwGQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I had a wonderful dining experience with the dry delicious Bak Kut Reh with frangrance yam  rice.  The staff were friendly and the price is reasonable.",
      "time": 1737118609,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=18210753381276802494",
  "user_ratings_total": 90,
  "vicinity": "56 New Upper Changi Road"
}