{
  "formatted_address": "Malaysia, Johor Darul Ta'zim, Iskandar Puteri, Jalan Medini Selatan 7, 80-01",
  "geometry": {
    "location": {
      "lat": 1.3951224,
      "lng": 103.6336409
    },
    "viewport": {
      "northeast": {
        "lat": 1.396436180291502,
        "lng": 103.6349595802915
      },
      "southwest": {
        "lat": 1.393738219708498,
        "lng": 103.6322616197085
      }
    }
  },
  "name": "爱情麻辣烫(AiqingMalatang)",
  "place_id": "ChIJgZJfPAAJ2jER2kN3mVi-Kp8",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Gator",
      "author_url": "https://www.google.com/maps/contrib/114331842318070680564/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUf5N0YPQocYYralVhzxgKqHfnlJgSiXhs54DUya0oFIumc-54QVA=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I stumbled upon this simple restaurant while searching for a dinner spot, and I’m so glad I did! This restaurant offers a fantastic Mala soup experience, and here’s why I highly recommend it:\n\n**Variety of Ingredients:**\nThe restaurant boasts a wide selection of fresh ingredients for customers to choose from. Whether you’re a meat lover, seafood enthusiast, or veggie fan, there’s something for everyone. The freshness of the ingredients really stood out and added to the overall quality of the meal.\n\n**Soup Bases:**\nThere are several soup bases to choose from, and I opted for the classic Mala broth. The broth was incredibly flavorful—spicy, aromatic, and deeply satisfying. It had the perfect balance of heat and richness, making every bite enjoyable.\n\n**Condiments Counter:**\nThe free condiments counter was well-stocked with a variety of sauces, fresh coriander, and chili. This allowed me to customize my dipping sauce to my liking, which added an extra layer of fun and personalization to the meal.\n\n**Ambience:**\nThe restaurant has a clean, comfortable, and inviting environment. The seating was spacious, and the overall atmosphere made for a relaxing dining experience. It’s a great place to enjoy a meal with friends or family.\n\n**Price:**\nConsidering the quality of the ingredients, the delicious broth, and the overall experience, the price was very reasonable. It felt like great value for money, especially for a satisfying Mala soup meal.\n\n**Overall Impression:**\nThe restaurant exceeded my expectations. From the fresh ingredients and flavorful broth to the well-stocked condiments counter and comfortable setting, everything was on point. It’s a must-visit for Mala soup lovers or anyone looking for a tasty and enjoyable dining experience.\n\n**Rating:** 5/5\n- Pros: Fresh ingredients, delicious Mala broth, well-stocked condiments counter, clean and comfortable environment, reasonable prices.\n- Cons: None worth mentioning—it was a fantastic experience overall!\n\nI’ll definitely be returning to this gem of a restaurant! Highly recommended!",
      "time": 1741196961,
      "translated": false
    },
    {
      "author_name": "Cheewee Kok",
      "author_url": "https://www.google.com/maps/contrib/104234572596322175340/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLhOItNQUhLXdMxBEYwRj1hgnQAgxd6eRlVe3EbobbaWJOueg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "13 Apr 2024\n\nThis shop just opened a few weeks ago. We continue to believe that  every new shop having one chance to impress us, 😄 and tried the foods in this store.\n\nFirst we did not see the price tags so we just selected a few ingredients for the mala ban (dry mala sauce and peanut taste in it). Once we tasted the food, we decided to go with another bowl and this time with bone broth. Also have peanut taste. Interesting favor.\n\nThe lady boss came to check on us for the taste of their food. During our conversation, she realized by herself that some people may be allergic to peanuts.\n\nMSG level ok.\n\nCan revisit.",
      "time": 1713103408,
      "translated": false
    },
    {
      "author_name": "Darren Ong",
      "author_url": "https://www.google.com/maps/contrib/110321280651827068559/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI09tmNFKMAdZgSAnVYY0PbrQzKdaub-aGepI3_KOs5jh6gng=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Good food here. Order tomato soup and a bone broth soup. Taste is awesome.",
      "time": 1734086390,
      "translated": false
    },
    {
      "author_name": "Zero Ling",
      "author_url": "https://www.google.com/maps/contrib/109772459766739637860/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX8shwx1nT1-oRIgGV0a-zPZ-h63uuOtno6M5ilmQ01L6GeTJRH=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I recently came here because of a friend who told me about this newly open restaurant. To be honest i was impressed by the variety of options available. Since i can’t handle spicy food, i opted for the tomato broth instead, and it did not disappoint me!! The soup was incredibly flavourful and exceeded my expectations. Haha i say until a bit over liao>",
      "time": 1732037523,
      "translated": false
    },
    {
      "author_name": "Bryan Soo",
      "author_url": "https://www.google.com/maps/contrib/100272587555869956465/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLN2jICwx9nmiNh33mlqYDDT_zLTupmlYOSMzA-ZffasBQDKA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "If you’re looking for a vibrant spot to enjoy delicious Chinese cuisine. This place serves customizable malatang with fresh ingredients and a flavorful broth that stands out. The cozy atmosphere and friendly staff make it even better. It’s perfect for spice lovers who want to tailor their meals just the way they like. Definitely worth a visit if you’re in the area!!!!",
      "time": 1732028934,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11469188688793519066",
  "user_ratings_total": 69,
  "vicinity": "80-01, sunway emerald boulevard, 88, Jalan Medini Selatan 7, Iskandar Puteri"
}