{
  "formatted_address": "Blk 377 Hougang St. 32, #02-04 Hougang Rivercourt, Singapore 530377",
  "geometry": {
    "location": {
      "lat": 1.3631982,
      "lng": 103.8953513
    },
    "viewport": {
      "northeast": {
        "lat": 1.364669930291502,
        "lng": 103.8963251802915
      },
      "southwest": {
        "lat": 1.361971969708498,
        "lng": 103.8936272197085
      }
    }
  },
  "name": "莆仙 Pu Xian Restaurant",
  "place_id": "ChIJf3_kfrAX2jERPyxegJC3-Cw",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Lance Tan",
      "author_url": "https://www.google.com/maps/contrib/103171518127946119222/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW0OBw6f6zkiX7OPZF1dQ6EmyXitFEUwUATLjXcNfTFpXJ1KVW1=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Excellent food with great service. We have been a patron here for almost 2-3 years now and have been returning customers. You might think that this restaurant is just a knockoff PuTian, but the quality of food and service here is pretty up there.\n\nThe lady manager of the place is always so hospitable and friendly to all the customers, introducing new dishes as well as recommendations.\n\nSo far whichever dishes that we have ordered are all tasty and of reasonable portion size. Definitely try their signature beehoon.\n\nI recommend coming with bigger groups to try more of their dishes. Excellent place for gatherings with family and friends.",
      "time": 1733067197,
      "translated": false
    },
    {
      "author_name": "Ed Chung",
      "author_url": "https://www.google.com/maps/contrib/105056380002360483849/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVOAtdnCdYYVvYq9qqi3MAykXria7DE4QQx7Zt0_SeyAI1fkls=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "Located on the 2nd floor of the mall, this Chinese restaurant offers quite an extensive spread of Putian themed dishes and diners could order ala carte from the menu, set meals or buffet. It was noon time, and we came by here for our lunch as we were nearby running errands.\n\nThe restaurant was almost full house when we arrived and we were ushered to the table near the main entrance since all the other tables were occupied. After a good 15min wait, we requested to change to anther table inside as diners were leaving.\n\nAmbience was cosy and relaxing with nice decor, we decided to go for the buffet. It was $39.90++ per pax, with a duration of 90mins (time started ticking when the first dish was served). There were 3 dishes that could only be ordered once, but all others can be ordered repeatedly, the main dishes and dimsum items.\n\nAnd wow, must say the food were actually quite good and yummy. As we have never heard of this restaurant before but the \"other one\" that's more well-known with a few outlets island, we were surprised of it's spread and quality. Most of the food were nicely prepped and cooked. We liked the fried rice vermicelli, deep fried/sweet and sour fish, lychee with pork, braised abalone, the soup of the day, deep fried yam with sugar, braised chicken feet etc, just to name a few. But we couldn't order all the dishes.\n\nAnd they also had a good spread of desserts, including the durian ice cream, yam paste with ginko nuts and black glutinous rice with coconut cream. They were really delicious and good, presentation was exquisite! Chinese tea, softdrinks and coffee etc were included in the spread as well.\n\nWe ordered quite a number of dishes and enjoyed the food! Staff were friendly, helpful and efficient too in serving and clearing the used plates and serving food frequency quite fast and so you do not waste time waiting. And trust me, 90mins is sufficient for you to taste the lovely dishes. Of course, if they can extend the time to 2hrs or unlimited timing, that would be perfect, since we always love to chit chat and eat leisurely and slowly instead of having to take note of the \"timing\".\n\nAnd you can use your CDC vouchers here too which we used to offset part of the bill.\n\nOverall, the food was really nice and we will revisit again!",
      "time": 1730396372,
      "translated": false
    },
    {
      "author_name": "SH Y",
      "author_url": "https://www.google.com/maps/contrib/117900533784023420929/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXkSgaDPVBaNpjzUIawS-jDXgf6FXWR4AxUpZD2Av_Camn_yjPg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I have come tried many times already and i felt this time in particular the cooking seems to have improved.  The food are tastier then i last remembered this round.\nThe portion of the dry dishes could have been just a little bit bigger would be good.",
      "time": 1740576441,
      "translated": false
    },
    {
      "author_name": "alice saw",
      "author_url": "https://www.google.com/maps/contrib/102372082760951891345/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXebHkx9Y8tGGRgcBBmHl17MOvczjsPz-N3ejwpys5CsZlXPNNxfg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Excellent food with great service. Given the service and food taste, is very worth and affordable i would say. staff is friendly and helpful. join membership got discount too.  celebrate my daugther birthday\nGood place for gatherings with family and friends. Definitely hidden gem. forgot to take pic but will go there eat again",
      "time": 1746003431,
      "translated": false
    },
    {
      "author_name": "Teck Kim Chia",
      "author_url": "https://www.google.com/maps/contrib/110414816528075437461/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLhAgyE5ddK8YklAEkxM1zZMObADbXofpF6TvPZpDFuflk-Qg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "Our second time here at this restaurant. Quality of food is consistent and still amazingly good.  Pleasant and comfortable environment. Ample parking available. Will strongly recommend this place.",
      "time": 1721971932,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3240541763149900863",
  "user_ratings_total": 207,
  "vicinity": "Blk 377 Hougang Street 32, #02-04 Hougang Rivercourt, Singapore"
}