{
  "formatted_address": "BLK 233 Lor 8 Toa Payoh, Singapore 310233",
  "geometry": {
    "location": {
      "lat": 1.3382932,
      "lng": 103.8584818
    },
    "viewport": {
      "northeast": {
        "lat": 1.339815980291502,
        "lng": 103.8599051802915
      },
      "southwest": {
        "lat": 1.337118019708498,
        "lng": 103.8572072197085
      }
    }
  },
  "name": "香满园菜馆 Xiang Man Yuan Caterer",
  "place_id": "ChIJQwLNlnAX2jER89dEfBY1s5I",
  "rating": 4,
  "reviews": [
    {
      "author_name": "HC L",
      "author_url": "https://www.google.com/maps/contrib/105381120259821237733/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL4AjoHyLWrgn0mQ9-z1eTIeRS1rdp--VFcDNRoBhx7ZLS0FL8=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "Decent zichar stall. Love the chilli crab sauce in the lala dish but the lala were overcooked. Also, the marmite chicken was overcooked in the hot plate and the chicken pieces were small and skinny. Omelette and vegetable were nice though.",
      "time": 1744696076,
      "translated": false
    },
    {
      "author_name": "Ronald Teo",
      "author_url": "https://www.google.com/maps/contrib/105898898872367423769/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJA_jHemaONqeKkOuEjjWo0_-rNYpKv0Iy-dXiq6iBWoFvt0Q=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 3,
      "relative_time_description": "a week ago",
      "text": "Disappointed when first order for family dinner yesterday evening. Taste salty and stream fish not fresh at all. Already feedback after finish dinner as steam red grouper was taste dried and seem freezer for sometime.\nHope owner never serve such a bad quality steam again.",
      "time": 1746844889,
      "translated": false
    },
    {
      "author_name": "Kai",
      "author_url": "https://www.google.com/maps/contrib/117612273412230021726/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWSex6s7k1HD9obN8HVe1uHqrKhYH4ZXI-qIMeNQiNfn7ptFe6Z=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Did not eat their zichar but I attended an event that was catered by Xiang Man Yuan Caterer. The whole table was very surprised by its quality and quantity of the dishes.\n\nWanna highlight the fish which is so fresh and sweet! The prawns are well fried and no shell which is a huge plus point! And the most mind blowing dish of all is the roast pig which is hardly seen nowadays! The skin is roasted to perfection! It is crispy and thin! Also and the meat was seasoned PERFECTLY!\nOnly thing is the broccoli was overcooked as it is not as crispy as it should be, and the abalone in it is a little rubbery and mild abalone taste too.\n\nOverall, Xiang Man Yuan Caterer offers authentic banquet dishes which we hardly see nowadays and I surely will engage them for any events that need food catering!",
      "time": 1708052887,
      "translated": false
    },
    {
      "author_name": "Sean Goh",
      "author_url": "https://www.google.com/maps/contrib/113608706305591448585/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKEaTeEStI-pfTIXqsvSF6l02FivQ-XBDO9hy5SPhzxdS9tTA=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "3 years ago",
      "text": "Initially wanted to try another Zhichar stall from another coffeeshop within the same row only to realise they are operating on Monday. Decided to try our luck over at the next coffeeshop. The zhichar stall seems very popular. noticed most of the table ordered from them.\n\nSince we were here for the first time, we asked for some recommendations. Ordered their sambal sweet potato leaves, prawn paste chicken, cereal squid, marmite pork ribs, signature beancurd and a fu rong omelette. The total meal was around SGD$60 plus if i didn't remember wrongly.  Food in general, was delicious. The beancurd, pork ribs and chicken wings were the outstanding dishes for me personally.  We ordered the small portion, but the serving is relatively generous.\n\nOverall, the dinning experience was not bad and i would recommend!",
      "time": 1649846281,
      "translated": false
    },
    {
      "author_name": "Jean Ng",
      "author_url": "https://www.google.com/maps/contrib/112256291913227771203/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWKVWzngR4m_kjOxwJMLdpkB5LE0sU5_iNtWf63MrFunA3Xwcs=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "2 years ago",
      "text": "1st time purchasing. I wanted to tabao from other Zichar stall, not realising it was closed. From far, I can see the signboard written 香满园 which attracted me. Give it a try and order 3 dishes recommended by the staff. My 3 years old son almost finished >50% of the Cai Pu Tofu. It was delicious. I ordered additional chilli crab, to my surprise, the price was reasonable $55.00, and crab was very fresh, sauce also belongs to sweeter side, spiciness bearable for my older children. Marmite Pork was well-liked by my 12yo son. Ordered all small portion for family of 5. Spent $80++. I'll return back again because of the reasonable price and good food. I'll try other dishes next time.",
      "time": 1682076840,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10570851121059125235",
  "user_ratings_total": 116,
  "vicinity": "BLK 233 Lorong 8 Toa Payoh"
}