{
  "formatted_address": "10 Telok Blangah Green, Singapore 109178",
  "geometry": {
    "location": {
      "lat": 1.278877,
      "lng": 103.813289
    },
    "viewport": {
      "northeast": {
        "lat": 1.279950630291502,
        "lng": 103.8144336302915
      },
      "southwest": {
        "lat": 1.277252669708498,
        "lng": 103.8117356697085
      }
    }
  },
  "name": "1918 Heritage Bar at The Alkaff Mansion",
  "place_id": "ChIJz34btVQb2jEREuA6ZVF5V9s",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Fabrianne Effendi",
      "author_url": "https://www.google.com/maps/contrib/102288012607265105790/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKEjmBdf4fGgdI6gCcjyiu5D2MF9YrOBsOIqSyJV50Vpip-Lg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Great service and food! Really loved the angus steak (nice smokey taste n spot-on medium rare) and hazelnut coffee chicken wings. Staff esp. Raj, were very friendly and attentive. Nice ambience and live music. Thank you for the complimentary cocktails on tap and birthday cake w shots :) Will come back again!",
      "time": 1743248830,
      "translated": false
    },
    {
      "author_name": "raw vegetables",
      "author_url": "https://www.google.com/maps/contrib/115260455208498746235/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUTdsGdOafDkXkn9Mks7rt5gmBvNc_ZtQ0Q4-FmDZzDbG5OG0Rk=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Amazing bar with great ambience and a fantastic live band that takes song requests! The service is excellent, and the food and drinks are not only delicious but beautifully presented. Perfect spot for a fun and memorable night out!",
      "time": 1742095563,
      "translated": false
    },
    {
      "author_name": "TH",
      "author_url": "https://www.google.com/maps/contrib/103154584418552202566/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUcWXMi9KN4Do-fo_oHM4mJgrWkGz1iCR9vYUbttdX4Ts5TZ0_PDg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "5 months ago",
      "text": "Came here on a recommendation on a weekday evening. Firstly, this place is really REALLY inaccessible without a car, we had to walk about 15 minutes uphill in a forest-y area from the nearest bus stop and by the time we got there we were a bit sweaty already.\n\nHowever, I have to say, the place was really cool, it is situated in a mansion and has a very classy 90s yet modern look to it. The exterior and interior was very well decorated and the music they were playing also suited the vibe, 5/5 atmosphere.\n\nThe service was also great, our waiter attended to us quickly. Seeing as everything was almost perfect, I thought the food was going to be amazing but I was disappointed. We ordered the Salted Egg Fries, Coffee Hazelnut Wings, Chilli Crab Pasta and Bak Kwa Pizza along with a happy hour deal of 2 cocktails, the Singapore Sling and Old Fashioned.\n\nStarting off with the good, the drinks were decent and decently priced as well, 25$ for 2 cocktails is reasonable. The Salted Egg Fries were very crispy but I thought there was too little salted egg sauce accompaniment with so many fries.\n\nNext, we have the mid, the Coffee Hazelnut Wings I had really high hopes for but they were just very mid tasting wings, sweet with a very very slight coffee flavour, decently tender and cooked well but nothing special at all. The Chilli Crab Pasta was also nothing special, I thought the chilli crab sauce was not thick enough and the pasta was not al dente but the whole soft shell crab served with it was delicious.\n\nLastly, we have the bad, the Bak Kwa pizza was BAD. It tasted like pork floss buns from local bakeries, did not taste like pizza at all. It was also very droopy and the flavours were not meant to be on a pizza in my opinion. The crust was also not crispy enough, too soft, making it taste even more like cheap pork floss buns from a local bakery. All that for about $60++ per person will be a decent price tag IF the food was good but alas, it wasn’t, maybe the other dishes were better, but with their name being “Heritage Bar” one would think their best dishes would probably be their Singapore-fusion ones.\n\nAll in all, I would say the food was mid to bad, drinks were okay, service was good and atmosphere was great. Probably would not be returning though.",
      "time": 1733412728,
      "translated": false
    },
    {
      "author_name": "Melvin Yo",
      "author_url": "https://www.google.com/maps/contrib/104893903998139722748/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXuQoGFn4aJaqJGiGbrVZ5YAOWhqJHaI3BFj3bmQHZmY8PES-ch5Q=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "The live band at the bar starts early at 7pm , which was great as we like to eat early. The food is fusion of traditional food like Kwei Pi Tee, spring rolls and cauliflowers.\n\nThe happy hour is also reasonable.",
      "time": 1737955044,
      "translated": false
    },
    {
      "author_name": "Dennis Sze",
      "author_url": "https://www.google.com/maps/contrib/108016987854209999256/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL4KQDC_id5YLj3FN7JbpSOYBFbuPEjSfnDHVRAyYXNd6Kfjw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Really love the Bak Kwa pizza, hazelnut coffee chic wings, laksa squid ink prawn rolls, satay and wagyu burger, they were done to perfection. Valencia was extremely guest-centric and Vera personable. Waiting time was short, food was piping hot.",
      "time": 1733663870,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15805234807777714194",
  "user_ratings_total": 648,
  "vicinity": "10 Telok Blangah Green"
}