{
  "formatted_address": "Blk 401 Hougang Ave 10, #01-1158 KPT Kopitiam, Singapore 530401",
  "geometry": {
    "location": {
      "lat": 1.3748593,
      "lng": 103.8972728
    },
    "viewport": {
      "northeast": {
        "lat": 1.376305980291502,
        "lng": 103.8987183302915
      },
      "southwest": {
        "lat": 1.373608019708498,
        "lng": 103.8960203697085
      }
    }
  },
  "name": "5dot7western",
  "place_id": "ChIJZ8zSZgAX2jERfkx9WCzCBnk",
  "rating": 4,
  "reviews": [
    {
      "author_name": "oXRYSTALo Ong",
      "author_url": "https://www.google.com/maps/contrib/114556064085815871377/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSTtKcF9FYMbh-XNbDu8f7Whl3gi-ZY6T8pFPOm3v9Y98Ws7jL=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "Donkey and I were feeling hungry after a good jog, so we headed to KPT Coffee Shop, a familiar spot known for its cozy vibes and decent coffee.We were pleasantly surprised to find a Western food stall tucked away within the coffee shop called \"5dot7western.\" I was intrigued by the menu, so I decided to order the SA Grilled Salmon with Mashed Potatoes—a classic choice that sounded comforting and delicious.\n\nWhat We Loved:\n\n• The Salmon & Mashed Potatoes: After waiting about 15-20 minutes (which was a little longer than we expected), our food arrived on a trusty vazel—a common sight in many food courts and cafes. But trust me, the wait was totally worth it!  The salmon was perfectly cooked—tender and slightly crispy on the outside—and rested beautifully on a bed of creamy, flavorful mashed potatoes. It was a feast for the eyes and our taste buds! Both the salmon and mashed potatoes were piping hot, which is always a bonus, especially after a workout. The combination of the savory salmon and the comforting mashed potatoes made for a truly satisfying meal.\n\nDonkey’s Take: The salmon was cooked just right!\n\nMy Take: I loved the mashed potatoes! They were so flavorful.\n\nWhat We Didn’t Love:\n\n• The Service: We had a bit of a letdown with the service. I felt like we were overlooked for a while, and it took a bit of time for someone to acknowledge our order. I think the hot weather might have been a factor, but it's always a bummer to feel ignored, especially when you're hungry and ready to eat!\n\nRating:\n\n• Food: 4/5 (Delicious and well-prepared)\n\n• Service: 3/5 (Could be improved)\n\n• Ambiance: 4/5 (Cozy and familiar)\n\nOverall:  4/5\n\nOur Verdict: Overall, \"5dot7western\" at KPT Coffee Shop is a solid option for Western food. They use good quality ingredients and know how to cook! The salmon and mashed potatoes are a real winner—the salmon is cooked perfectly, and the mashed potatoes are so creamy and comforting. While the service needs a little work, the food itself makes it worth a visit, especially if you're looking for a satisfying post-workout meal.",
      "time": 1730130961,
      "translated": false
    },
    {
      "author_name": "Doraemon",
      "author_url": "https://www.google.com/maps/contrib/112665277904119154671/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX2VSCcaT9axvOwx2nD8XD3PgZ8V5VFnv420aocMSfLa6GlcEmN=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 3,
      "relative_time_description": "6 months ago",
      "text": "After a satisfying jog, Kitty and I decided to refuel at KPT Coffee Shop, a familiar spot known for its cozy atmosphere and decent coffee. We were pleasantly surprised to discover \"5dot7western,\" a Western food stall tucked away within the coffee shop.  Intrigued by the menu, Kitty opted for the SA Grilled Salmon with Mashed Potatoes, a classic choice that promised a comforting and flavorful meal.\n\nThe dish arrived after a 15-20 minute wait, delivered via a vazel, a common practice in many food courts and cafes.  While the wait was a bit longer than expected, the food itself was well worth it.  The salmon, perfectly cooked with a delightful balance of tenderness and a slightly crispy exterior, was artfully placed atop a bed of creamy, flavorful mashed potatoes.  It was a visual delight and a tastebud treat!\n\nBoth the salmon and mashed potatoes were served hot, which is always a plus, especially after a workout.  The combination of the savory salmon and the comforting mashed potatoes made for a truly satisfying meal.\n\nHowever, the service was a bit of a letdown.  Kitty felt overlooked and had to wait a while before someone acknowledged her order.  While she attributed this to the hot weather, it's always a bit disheartening to feel ignored, especially when you're hungry and ready to enjoy a meal.\n\nOverall, \"5dot7western\" at KPT Coffee Shop offers a decent Western food option with a focus on quality ingredients and well-prepared dishes.  The salmon and mashed potato combination is a standout, with the salmon cooked to perfection and the mashed potatoes providing a creamy, comforting base.  While the service needs some improvement, the food itself makes it a worthwhile experience, especially if you're looking for a satisfying post-workout meal.",
      "time": 1730124762,
      "translated": false
    },
    {
      "author_name": "Grace Chan",
      "author_url": "https://www.google.com/maps/contrib/110883192894582779721/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWUe6XaxIhRXhrMZ5hmDNqJ2Fx6B4ocof18kaY5S3xOgPP4zbI=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "I felt very nostalgic when I came here as this was my usual dinner spot for 12 years when I took my ballet classes nearby. Owners Carmen & Shaun recommended us a few of their signature dishes such as Chicken Cordon Bleu, Seafood Risotto, Vongole & Whole Spring Chicken.\nVongole is a bit dry but can be cooked with more sauce in my opinion.\n5dot7’s fare overall is of a good standard. The wallet-friendly, cafe-quality Chicken Cordon Bleu, Seafood Risotto & Whole Spring Chicken here are definitely worth a try.",
      "time": 1717177704,
      "translated": false
    },
    {
      "author_name": "Aloysius Liew",
      "author_url": "https://www.google.com/maps/contrib/115744286338563154672/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVoMGHbxwL6VeHK77NgHaFBLdL2RYQGmLLspTFGXp1BC6kRMScu=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "Inside coffeeshop and this place usually crowded. The western food is good. Came here the third time for thw western food. Tried different item each time. Would recommend their Chicken Cordon Blue, Seafood Risotto, Pan Seared Salmon and Chicken chop.",
      "time": 1717932577,
      "translated": false
    },
    {
      "author_name": "Whitney Chng",
      "author_url": "https://www.google.com/maps/contrib/113756448091903465858/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWFe767onGCCnaSYR3B5w3RQgq837Ve6Pj5cfnIHLaTZ99-N3tKxQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Have been a frequent eater at this kopitiam so it was refreshing to see a different western take.\n\nSeafood risotto was yummy, am a tomato x cream lover so this was perfectly balanced for my tastebuds. The seafood didn’t have any weird smells so that’s great too.\n\nChicken chop was nicely charred, prefer the black pepper sauce it was spicy and salty in the right way. Coleslaw tasted fresh and well doused in the mayo.\n\nThe star of the meal was the fried chicken wing though. The batter isn’t too thick, just nice to enjoy with its fried skin. Marinated well, not too salty nor too bland.\n\nAll in all, the food tasted clean in a good way. Doesn’t make u feel oily or jelak after.\n\nWill come back again to try the Cordon Bleu ˙ᵕ˙",
      "time": 1711293992,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8720871224168500350",
  "user_ratings_total": 51,
  "vicinity": "Blk 401 Hougang Avenue 10, #01-1158 KPT Kopitiam"
}