{
  "formatted_address": "BLK 631 Ang Mo Kio Ave 4, #01-906, Singapore 560631",
  "geometry": {
    "location": {
      "lat": 1.3795219,
      "lng": 103.8401267
    },
    "viewport": {
      "northeast": {
        "lat": 1.380858080291502,
        "lng": 103.8413709302915
      },
      "southwest": {
        "lat": 1.378160119708498,
        "lng": 103.8386729697085
      }
    }
  },
  "name": "631 Teochew Fish Porridge Da Pai Dang",
  "place_id": "ChIJr9vWFDwX2jERAsiWM8KyaEY",
  "rating": 3.8,
  "reviews": [
    {
      "author_name": "Tan Wei Liang",
      "author_url": "https://www.google.com/maps/contrib/102725254698687540687/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ-GMosZmRp2EAuejHWn3oz1_7Mlj2OJ9KoG8qPLtuNMbaRFA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 2,
      "relative_time_description": "2 weeks ago",
      "text": "Ordered their 鱼片米粉 and is the most expensive one I ever seem - $12 for a small portion with minimal number of fish slices (4-5). Only upside is their fish is indeed fresh. Their soup is quite garlicky and I am a fan of garlic, so it suits my personal preference, but even so is just decent and nothing to rave about. Their service is pretty bad. I was clarifying with the female cashier/server regarding the fish options for the day and she talked to me in a nonchalant manner and barely looked at me. She wasn’t even busy at that point in time cause I was the only customer. When I confirmed with her the price I was supposed to pay and she didn’t even respond to me. I am utterly appalled by her service and attitude. Such food is definitely not worth the price and the attitude.",
      "time": 1746354704,
      "translated": false
    },
    {
      "author_name": "Char Loh",
      "author_url": "https://www.google.com/maps/contrib/114641327468767129714/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUhe7jaMR6Ocq6NC_eigRB-nNAQztHglfMTZilYQ-xaFiyrlLA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "IF ONLY I CAN GIVE ZERO 00000000 STARS! See photos for prove. I was literally eating vegs n rice. Husband too angry to swallow, straight away bought the 925 chicken rice(super yummy).\n\n*Gonna be a LONG post!\n\nI'm definitely not the 1st person to give such low review on them. Just search all the 1 star reviews. I usually write praises.. but wow, they really pissed us off max.\n\nI'm going to use all my accounts plus my friends account to review. This my honest review as a customer! I really Wana save everyone money n from getting so pissed off like us.\n\n1 star for the cashier, she still tried her best to explain when I ask to come take a look, I merely even touch my rice, n the fish is gone. But come on, this not the first time eating fish soup, no need to educate me on how U guys calculate what grams how much n all.\n\nToday 20th Dec 2024, my 2nd visit(1st visit was 2 years ago, experience was ok!  Tats y I return, But NOT TODAY!)\n\nPls guys, do not come. So many other fish stall, go support others!\n\nFrom the picture U can see, when we bought the 2nd expensive $25 king grouper for 2 person, + rice is abt $26+, I separated the vegs out coz only I eat that, the I scooped abt 3 pieces of fish with soup for each of us, then when I go for 2nd scoop, I was shocked, I scooped n scooped, only left another 3 pieces of fish. N their fish is pretty thin kind.\n\nWe couldn't let that go, our rice was just eaten 3 mouth. We ask the cashier to come see, n she tried to explain n left. ZERO customer service recovery, if she just say Mayb is calculated wrongly or something n topup a few more pieces for us, n Mayb we can just matches our rice n finish our lunch, we will close 1 eye.\n\nWe were so pissed off couldn't even continue the meal n went to get chicken rice to fill our stomach. I had a video, too bad only can post pictures here. Anyway I'll post on all my social media.\n\nWe still see quite a number of people order after us. but they are all ordering 1 person soup. I guess 1 person soup, they can't give 4 pieces, so no one complain yet.\n\nTo end off, JUST DO NO GO!",
      "time": 1734687182,
      "translated": false
    },
    {
      "author_name": "Brandon Yeo",
      "author_url": "https://www.google.com/maps/contrib/107293758897395549807/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUb5cJY0qa4NBEewYnetSv1cTKsm--pHPPRGfrkYFyNjw-rZTM=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "Total rip off.. I've ordered the $25 claypot grouper soup based on 2 pax and was given around 10+ pieces of thinly sliced fish.. never going back to this stall ever.. don't recommend anyone to patronise either.. there are better fish soup elsewhere.. felt so cheated..",
      "time": 1734667645,
      "translated": false
    },
    {
      "author_name": "Chee Sergi Junn Yeow",
      "author_url": "https://www.google.com/maps/contrib/113577747866543961404/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXfOWw2waShA6WPLwJwF8QBpBSdf5dqBVijDq6G0_TZZ2A_RcHBPQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "I don't like fish or any kind; period. But if it's the last thing available at any given day, this fish soup stall at 631; I gladly pay and eat. There are different types of fish available, very fresh, deboned and cleaned before cooking to serve. Each slice is of good size and not \"discounted\" like some stores. I actually dislike fish mainly because of the smell, fishy taste and usually have bones. But this store, nothing of that sort.\n\nEach serving is not exactly cheap. I paid 15.50$ for my fish soup with yam rice, fish roe. But for the quality and freshness as well as for a person who doesn't like fish, I am regular customer.\n\nThe yam rice is very fragrant, the soup is flavourful and each serving is filling for me. Good till the last drop. Nothing is left every time I eat here 😂.",
      "time": 1725099908,
      "translated": false
    },
    {
      "author_name": "Tan Mark",
      "author_url": "https://www.google.com/maps/contrib/104330535068986683571/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX1nB-KcrwNkPLUCi3hAU5W8hANVuRnZfjiwNnDpCsi1Q9-Tfh7=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "New gem 💎 + ❤️: Teochew Fish Soup !\n\nStall : Teochew Fish Soup\nCoffeeshop : XXX\n@ blk 631 Ang Mo Kio Ave 4\nS(560631)\n\nTake 5 🖐️ here for my early dinner ; initially ordered the Grouper Fish (Red) Soup @ $12.00 and Yam 🍠rice 🍚 @ $1.50.\n\nIt’s my 2nd time, had a very good dining experience on the 1st some years ago with a senior driving kaki…\n\nWas told that Grouper fish sold out and Seabass fish 🐟 👌… I am 👍 as I am famished … hungry 😋? …\n\nWhat’s so good 😊?\nYet another savoury, delightful experience especially with the soupy broth inside the Claypot that can keep the soupy warm and really made U sweat it out 😅 …\n\nWith the fried garlic 🧄 bits thrown in as condiment, light crunchy and enhanced it’s flavouring, devoid of MSG as my throw and tongue 👅 still looking good and show no signs of thirstiness …\n\nTeochew fish 🐟 and its soup always enticed me greatly and whenever I see one, shall go to observe other people eat first then I order …\n\nHighly recommended to savoury this stall Fish  🐠 🐟 and its repertoire of fish choices and including frying and porridge too ! Though a tad dearer but the Claypot has its usefulness and soupy broth based full of yummy residue of bits of sole fish 🐟 too and shallots and garlics condiment too …\n\nPreview the unedited video clips 🎥 and photos collage to whet your appetite !\n\nAre U Hungry 😋?\n\nCheers 🥂\n#AUHBMark\n#AUHFCFishSoup\n#AUHFCClaypot\n#AUHFCTeochewFood",
      "time": 1723543502,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5073501527391782914",
  "user_ratings_total": 442,
  "vicinity": "BLK 631 Ang Mo Kio Avenue 4, #01-906"
}