{
  "formatted_address": "20 Shaw Rd, #01-03, Singapore 367956",
  "geometry": {
    "location": {
      "lat": 1.336402,
      "lng": 103.8840897
    },
    "viewport": {
      "northeast": {
        "lat": 1.337678780291502,
        "lng": 103.8855765802915
      },
      "southwest": {
        "lat": 1.334980819708498,
        "lng": 103.8828786197085
      }
    }
  },
  "name": "7 Stars Furniture Trader",
  "place_id": "ChIJ9ZzgpY0X2jERg3g97446xkU",
  "rating": 2.7,
  "reviews": [
    {
      "author_name": "Eileen T",
      "author_url": "https://www.google.com/maps/contrib/104876104938672712649/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKY0tm4C40gl9BybH--lzqepgKowDwGmggpWhiNqt0YBUwNHw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "AVOID THIS BUSINESS AT ALL COSTS!\n\nOrdered an ikea bed from them via Carousell (Carousell ID: Ibu007). The bed was fully assembled on the photos advertised, with zero mentioned of any parts disassembled. When it was delivered, part of it was disassembled with screws missing.\n\nAfter trying to figure out how to assemble the bed for 30 minutes, we then realised they have only sent us HALF THE BED.\n\nWe contacted them to resolve this issue, no apologies offered. Have to chase them for 2 days to get the other half delivered. Honestly a nightmare dealing with them!",
      "time": 1659681153,
      "translated": false
    },
    {
      "author_name": "Abdullah Ahmad",
      "author_url": "https://www.google.com/maps/contrib/106427154135096943647/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVaePFxjk8ns0zNWTjdhpF1pe5Dfa_bnxp-q1o3upsouti1wr4=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 years ago",
      "text": "I came to buy a bed frame here and gave the height I wanted. The person in-charge assured me that it was the right measurements and made a quick measurement using her tape. We booked Lalamove because they couldnt send it that same day. When we got home, the measurements were a bit longer than she mentioned.\n\nWe called back and they said that if we wanted them to pick up the bed and exchange it, we’d need to pay for the delivery to and fro. And even then, it could only be done the following day.\n\nThe next day, my friend and I personally carried the bed frame because the place was 550m away from their warehouse. We wanted to exchange it to a shorter one, but they didnt have one any shorter. The shorter bed frame cost $80 while ours that we bought was $120. We wanted the shorter one and have them cut it and deliver it to us since it was close. They said they couldnt deliver, but they’ll give free plywood ($20) and cutting services ($20) but that it kinda seemed like they didnt want to give us back the money. So fine, we opted to have it cut but the person said her worker who cuts wasnt in the warehouse. Only the day after.\n\nWe came back the next day (three days in a row) and asked them to cut it. She said she wasnt working that day, and her one worker who cuts already left for delivery. Mind you, we agreed that we’d have it prepared by 3pm or 4pm. She told us to come back at 6pm.\n\nI said that this was ridiculous, and asked her to call back that one worker and have someone else cover for him since we had been negotiating for 3 days already. She finally told us to just come down and one of her workers will help us (even though before this, it seemed like there wasnt anyone who could help at all).\n\nThe only reason I needed it rushed was because it’s for an elderly person. It just seems that they were never straightforward and were reluctant to give us back the money.\n\nThis is just an honest experience and I hope that this was only my bad luck. Go ahead and see if they offer good deals with you.",
      "time": 1603269550,
      "translated": false
    },
    {
      "author_name": "TiJan Syafiq",
      "author_url": "https://www.google.com/maps/contrib/108983399626689388348/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUkI2njGU5If_VZoxf9i5uJa_zd4e2koPwlYAqh4bv2RY8a-vORJw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "8 years ago",
      "text": "Very bad service after years have passed and we were recommended by ex customers.\n\nThe used furniture condition was below expectations then the new items delivery was absolute nightmare as their delivery guys was extremely rude to my pregnant Wife, infact the were prc and don't have proper delivery schedule.\n\nSaid delivery in afternoon but till 10pm we waited and kept calling them, different random staff would answer and Speak in hostil manner.\n\nWe will filled a compliant to CASE for this errant Traders.\n\nWe would not speak ill of anyone but this incident might cause worse outcomes to other Low income families who have faced this kind of discrimination.",
      "time": 1486339114,
      "translated": false
    },
    {
      "author_name": "HM Tan",
      "author_url": "https://www.google.com/maps/contrib/110222327285323217009/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLmFx7KWELXxcuqsy6gLLOA6sDccLH6xoPDcmaY4P55EoDnag=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "8 years ago",
      "text": "Item was declare brand new.  When e mattress sent to me, there are alot of mould patches. Staff told me to bare with it,  just slp and cover it. Cos they cant afford to let the delivery man come to and fro for an exchange.\n\nWat ridiculous excuse is this???  Selling me a mouldy mattress? Make my trip down again to re-choose a okok mattress. Refuse to let me check cos they say eventually after 6mnths mattress will also go yellow.  What service is this!??\n\nBuy it at ur own risk if u are comfortable slping on a 10yrs old mattress. Check out their carousell user: furnitureguru. LIARS!!!",
      "time": 1489670958,
      "translated": false
    },
    {
      "author_name": "Isaac Z",
      "author_url": "https://www.google.com/maps/contrib/118009568848322272989/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLRh262Y08UBeZnY0PvZRFncHGe0dgatnWvdr05i-0c-ofjfZEe=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "False advertising. When ask about condition says is 8/10.\n\nIs 8/10 rusty, moldy, badly fixed, very dusty with rusty nails sticking out? When asked about the problems, will stop replying.\n\nEveryone please judge for yourself.",
      "time": 1656515587,
      "translated": false
    }
  ],
  "types": [
    "furniture_store",
    "home_goods_store",
    "store",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5027770419579287683",
  "user_ratings_total": 23,
  "vicinity": "20 Shaw Road, #01-03, Singapore"
}