{
  "formatted_address": "153 Joo Chiat Rd, Singapore 427431",
  "geometry": {
    "location": {
      "lat": 1.3128136,
      "lng": 103.9000521
    },
    "viewport": {
      "northeast": {
        "lat": 1.314157980291502,
        "lng": 103.9013946302915
      },
      "southwest": {
        "lat": 1.311460019708498,
        "lng": 103.8986966697085
      }
    }
  },
  "name": "808 Eating House",
  "place_id": "ChIJS-v8BsQZ2jERQ7pmW9dLB5A",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Nadine Iris Bongato",
      "author_url": "https://www.google.com/maps/contrib/114901529769688092087/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX2yZLSmVknOwO49ACmyUwAP4lsnBf6XZ1gCbkZmdTpImM_3MM=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I had a great dining experience. From chill vibe atmosphere, awesome & cool people and of course mouthwatering good food! Ordered duck fat financiers (ah so good), barramundi (yum!), and pandan panna cotta (refreshing). Pair it up with sparkling and white wine, coz it’s happy hour 1-for-1! I also got the chance to taste their baby corn & oyster mushroom salad (thank you!) which of course I also liked it. Overall dining experience - satisfied customer here! See you guys for brunch, I’m excited!\n\nAnd so I came back at 808 Eating House just to try their charred kaya toast. It didn’t disappoint and absolutely worth it! It was nicely presented that I don’t even want to eat! Anyway, I should go back again to have a proper brunch!",
      "time": 1744803420,
      "translated": false
    },
    {
      "author_name": "SF Lee",
      "author_url": "https://www.google.com/maps/contrib/111544111892346212869/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWmYKcbyD4K58FfLiMdu4JJWy0YVNAvr06aWbm_4-Cb35QgwzwL=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "unique and innovative brunch spot in Joo Chiat area. We started with their signature: duck fat financiers, the buttery and slightly crispy exterior of the financiers well paired with the creamy and umami duck liver mousse, charred Kaya toast: charred thick toast topped with the fresh and creamy sweet Kaya and grated coconut. I can smell the fresh Kaya and coconut accompanied by crispy side of the toast. It’s purely indulgent! The chicken curry rice with hom Mali rice is a must try. The Pandan fragrance and smooth silky texture from the rice on topped of the aromatic and generous amount of curry sauce with the crispy chicken thighs is another level. Kids will love this too. We also tried the Flower crab sandwich, 2pcs of thick toast were packed with sweet, fresh flower crabs and zingy creamy mayonnaise, another highlight is their coffee come from tiong hoe specialty coffee. it’s a really enjoyable experience. The restaurant was really fully booked during weekend thus it’s advisable to book in advance to avoid disappointment. Love the attentive and friendly service.",
      "time": 1744114019,
      "translated": false
    },
    {
      "author_name": "Patrick Goh",
      "author_url": "https://www.google.com/maps/contrib/104135618244306751649/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWQDN0tW8zgFSAvAiUuJFG3Bs-U_etgYPE6Zrpb4frLac24oo_N=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Cosy place. Great food. There as a family of 4. Except the mussels which were fairly generous in portion, the rest of the dishes were perfect a portion for my limited carbs family! Service was prompt and commendable. Ryan & buddy were great hosts! Talented young kitchen crew complete the dining experience!",
      "time": 1746797443,
      "translated": false
    },
    {
      "author_name": "Sing Lim",
      "author_url": "https://www.google.com/maps/contrib/104008302165754254960/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJaLMNcoxCSbAXiZS2aiXHiYNwDsOKpxUU6NCK2yBiB9MTjsg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Interesting place in Joo Chiat. I had seen good reviews and decided to give it a try as we were in the vicinity. The menu is not expansive. We were introduced to the signature dishes, and since it is our first time, we decided to give it a try, and we were not disappointed. We had a  starter, pork belly bao, this was really good, and Tom yam mussels, this was also on point. The team working in the kitchen looks young, and I am glad that we have this generation of young chefs who are very innovative.",
      "time": 1745056055,
      "translated": false
    },
    {
      "author_name": "Sel L",
      "author_url": "https://www.google.com/maps/contrib/116151875273523254798/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK-qxjz9mH3cQdlq_4Kt5j9pKrgr0iHDMvqWll4oRpvavpXyQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Very enjoyable dinner at 808 Eating House.\nI liked most of the dishes I ordered and my top few picks would be the Hom Mali rice , beef rendang, and salad from the starters.\nI didn’t quite understand the cold beehoon , chicken with chilli didn’t really stand out in any way for me. The desserts on the menu were both good.\nThere was an Indian waiter who I’d like to thank as I could tell he was sincere in his service and he put in effort in explaining the dishes to us when we asked. Sorry as we didn’t ask for his name. Very reasonable price point and I’m happy I went to give this place a try.\nI would return to try new dishes if there’s any in the future.",
      "time": 1745085110,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10378347254622108227",
  "user_ratings_total": 1102,
  "vicinity": "153 Joo Chiat Road"
}