{
  "formatted_address": "2 Paya Lebar Rd, #01-09 PLQ PARKSIDE below, Parkplace Residences, Singapore 409053",
  "geometry": {
    "location": {
      "lat": 1.3166581,
      "lng": 103.8929782
    },
    "viewport": {
      "northeast": {
        "lat": 1.317672630291502,
        "lng": 103.8940537802915
      },
      "southwest": {
        "lat": 1.314974669708498,
        "lng": 103.8913558197085
      }
    }
  },
  "name": "A Beautiful Day Café Tea Room + Cocktail Bar",
  "place_id": "ChIJM9AXO6k92jERGjNBvtcsgCQ",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Cassandra",
      "author_url": "https://www.google.com/maps/contrib/117012786490278517792/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJBshnIiSAokVQlgG0va79EVrHll9Wpl9LZTR105QmZg4Xo-84=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "I visited A Beautiful Room Café, a charming spot with a Victorian-inspired ambiance that instantly transports you to another era. The décor was absolutely lovely, with elegant touches that made the whole place feel so cozy and inviting. The staff were super friendly and engaging, making the experience all the more enjoyable.\n\nThe food came beautifully plated, and I must say, it tasted just as good as it looked. The flavors were on point, and the presentation really added to the overall experience. The seating was fairly comfortable, perfect for a relaxed afternoon.\n\nThat said, the only downside was the price—it was a bit on the higher side for the portion sizes. While the quality of the food and the vibes were great, it might not be the most budget-friendly option if you’re looking for a full meal. Still, if you’re in the mood for a delightful café experience with a touch of elegance, A Beautiful Room Café is definitely worth a visit.",
      "time": 1744020023,
      "translated": false
    },
    {
      "author_name": "YM Tan",
      "author_url": "https://www.google.com/maps/contrib/105649192512753518764/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW9jcXQiguRfOX5eQ-RFLvJYLaYBGSepLzJFfZj2G0gnLqs3CHKMw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Beautiful Day at PLQ delivers a refreshing dining experience with a seamless blend of modern flair and casual charm. The ambiance is bright and inviting, enhanced by ample natural light that adds to the relaxed vibe. The menu offers a variety of well-prepared dishes that cater to diverse tastes, each highlighting fresh ingredients and balanced flavors that left a positive impression. I found myself wanting to try every dish on the menu – the farmed salmon was especially delicious, with crispy skin that added a satisfying texture, and the tofu was nicely done, adding a comforting touch.\n\nA unique aspect of the experience was the tea presentation, served in a whisky-like style that adds a playful, sophisticated twist. This small detail reflects the restaurant’s dedication to creating memorable dining moments, even for the simplest items.\n\nService here is attentive yet unobtrusive, with staff genuinely focused on enhancing the customer experience through thoughtful touches and regular check-ins. Overall, Beautiful Day at PLQ is a delightful spot that lives up to its name, making any visit feel just a little more special.",
      "time": 1731215039,
      "translated": false
    },
    {
      "author_name": "Sebastian Oh",
      "author_url": "https://www.google.com/maps/contrib/114332392575036145416/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWnwgQHlJdwVNxqwkWHyr637E7IDFZGr7Tes3A7hGnsJXzdfCd2hw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "3 weeks ago",
      "text": "Never try never know.\nTo each his own taste buds.\nHas a nice cosy vibe.\nCoffee with sencha sounds interesting however flavour drown by milk.\nStrawberry oolong nice and refreshing.\nUnagi with mixed grain rice looked lovely. Strangely the unagi was rather rubbery to our liking.\nSourdough 4 cheese melt.\nWell as shared, never try never know. Lovely neighbourhood cafe with cosy vibes.\nBest wishes to success.",
      "time": 1745643978,
      "translated": false
    },
    {
      "author_name": "Ming Shen Tham",
      "author_url": "https://www.google.com/maps/contrib/116082735539712168059/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLGrMZ5UuB0fyolyPuJlKXs_jnFqr1bJiIw06AcP6YaQ8GAbQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Stepping into A Beautiful Day Café instantly gives off a classy and elegant vibe, thanks to its rustic furniture and dim lighting. The ambiance makes it feel like a cozy yet sophisticated spot, perfect for unwinding.\n\nOne thing I really liked was how the tea is served in a special glass bottle, adding an extra touch of elegance. It’s a small detail, but it definitely enhances the experience.\n\nInitially, I didn’t have high expectations for the food since the place looks more like a bar. However, I was pleasantly surprised—the Asian dishes were actually really tasty and well-executed, proving that this place isn’t just about drinks.\n\nAnother huge plus is that it’s pet-friendly, so if you have a furry friend, it’s a great spot to bring them along.\n\nOverall, it’s a lovely place to visit for both drinks and food, and I’d definitely come back!",
      "time": 1743353998,
      "translated": false
    },
    {
      "author_name": "Rochelle (OchieBon)",
      "author_url": "https://www.google.com/maps/contrib/107572074312956587143/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXRv2Mhfbx5uxClrVa-UX2v2pyzq8O-UnomlBru_jove_QOFBsxNQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "So love this pet friendly cafe place in Paya Lebar--love the vibe and the food plus warmth from the staff service was superb! Thanks to shevonne\niris & yi ting! By the way the place feels like u will be transported to some British afternoon tea spots ! The interior super dainty, sweet and fancy! love it! Thanks again! :) super thanks ! all the food was top notched quality too!",
      "time": 1741869907,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "bar",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2630151487505904410",
  "user_ratings_total": 272,
  "vicinity": "2 Paya Lebar Road, #01-09 PLQ PARKSIDE below, Parkplace Residences"
}