{
  "formatted_address": "151 Lorong Chuan, #01-22, Singapore 556741",
  "geometry": {
    "location": {
      "lat": 1.3513168,
      "lng": 103.8617111
    },
    "viewport": {
      "northeast": {
        "lat": 1.352833230291502,
        "lng": 103.8631239302915
      },
      "southwest": {
        "lat": 1.350135269708498,
        "lng": 103.8604259697085
      }
    }
  },
  "name": "ACE Signature @NTP+",
  "place_id": "ChIJ42Jx4hkX2jERQXt2K0e9rC8",
  "rating": 3.1,
  "reviews": [
    {
      "author_name": "Jelevi",
      "author_url": "https://www.google.com/maps/contrib/115372541972750307362/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIDp_Y54WOLrKaByAC9phpVL1EB5fx9X7n_O5zxxMIO4RGPaQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "I am writing to express my dissatisfaction with the service I received at your Ace Signature outlet at New Tech Park.\n\nOn my recent visit, I purchased some flowers and paid with a 50 SGD note, as it was the only cash I had on hand. Upon receiving the money, the cashier appeared visibly annoyed and started complaining while trying to give me change. The whole process was handled in a very impatient manner, and the cashier’s tone was rude and dismissive. When the change was finally given to me, it was clear that the cashier was still upset.\n\nI believe that customers deserve to be treated with respect and courtesy, regardless of the payment method. The experience left me feeling uncomfortable and dissatisfied with the level of service provided.",
      "time": 1742272483,
      "translated": false
    },
    {
      "author_name": "Cindy Y",
      "author_url": "https://www.google.com/maps/contrib/116610386619680586128/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL9Xws7TiiiNuPTU1JcRRThWm6aUDP-odsmz_J8C17Eoe2Aww=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Today, I went to the store to pick up my Shopee order. Knowing that Shopee pick-ups require staff assistance and must be collected before 5 PM, I first purchased a bag of frozen peas and queued to make payment. While paying, I informed the cashier that I also needed to collect my Shopee order. However, the cashier immediately told me that she could not assist me because there were other customers behind me. She then proceeded to ask the next customer, who said they did not want to wait either, so the cashier continued serving the other customers while ignoring my request.\n\nI do not understand why I, as a customer who was also queuing properly, was not given the opportunity to collect my Shopee order. The store has a notice stating that Shopee items must be collected before 5 PM. At 4:44 PM, I was already at the cashier, yet I was not assisted in retrieving my item. Instead, the staff prioritized serving other customers without considering my urgent need to pick up my order.\n\nI am sharing this unpleasant experience in the hope that ACE can improve its customer service and ensure that all customers receive fair and considerate treatment.",
      "time": 1740393630,
      "translated": false
    },
    {
      "author_name": "Christine Liao",
      "author_url": "https://www.google.com/maps/contrib/117849606110858492912/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWw_-bhS4buc6mYEkx_Sv3m_S4yLEzJwkaTs-CYPJzd9HnDdiE6ug=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "Blueberries were stated on offer for 3 at $6.95\nAnd after making payment, realised that the price was not reflected in my bill.\n\nWent to counter and was constantly said by cashier that I should check my items before paying. Then kept saying it’s very troublesome as she needs to do a report after the refund.\n\nShe kept nagging throughout the process.\n\nIt wasn’t a big deal but the whole experience sucks.",
      "time": 1734669226,
      "translated": false
    },
    {
      "author_name": "Mark Chan",
      "author_url": "https://www.google.com/maps/contrib/111707614341382396111/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJBXRued0MNy-jz1vEXKPxneyzxf4xSeqPnoWGFlTpcTcUf=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "Glad to have this opening in the area. Really lacking something like what Ace provides. Got all the basics covered, plus a decent fresh produce and butchery sections. It even had a sushi corner! Prices are reasonable as well. Parking is convenient with many lots in new tech park. Looking forward to when all the other shops around open as well.",
      "time": 1621347797,
      "translated": false
    },
    {
      "author_name": "sengster",
      "author_url": "https://www.google.com/maps/contrib/115909496863586094248/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWcbzDScQBNbPj1Bkl1T8u0aP5_jDPhQWcR9emUx1YwDMWU4Do=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "staff need some serious training…. observed one male cashier being very rude to a customer for no reason, telling them how to tap their paywave and holding on to items as if they want to steal it. vent your frustrations elsewhere and not on customers..",
      "time": 1730792886,
      "translated": false
    }
  ],
  "types": [
    "supermarket",
    "grocery_or_supermarket",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3435328729146358593",
  "user_ratings_total": 30,
  "vicinity": "151 Lorong Chuan, #01-22"
}