{
  "formatted_address": "21 Jurong Gateway Rd, #04-01 CPF Jurong Building, Singapore 608546",
  "geometry": {
    "location": {
      "lat": 1.3350845,
      "lng": 103.7398226
    },
    "viewport": {
      "northeast": {
        "lat": 1.336578280291502,
        "lng": 103.7412119802915
      },
      "southwest": {
        "lat": 1.333880319708498,
        "lng": 103.7385140197085
      }
    }
  },
  "name": "Achevas A-Level JC H2 Math Tuition (Jurong)",
  "place_id": "ChIJ29EKj7Yb2jERNEKcLqa3Z-0",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Srinidhi Dantu",
      "author_url": "https://www.google.com/maps/contrib/117714665059083671274/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV4S_Ygz7N1ShzxkyYeLnbRGAWA5etPjb6V-hRcIYxj_7NOhIks=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Mr Jack is a super devoted and an amazing teacher! Every lesson in Achevas was enriching with something new to learn. Mr Jack would tell us stories that explained his systematic approach to problem solving and tackling the exam paper. This made it really easy to retain information along side making class really entertaining! Mr Jack was extremely patient and always went the extra mile especially nearer to the exam period to guide me through harder questions. He always managed to break questions down and make them simple enough to comprehend! This is simply the best math tuition I've had! Thank you so much Mr Jack!!",
      "time": 1647325114,
      "translated": false
    },
    {
      "author_name": "Khai-Weing Hoi",
      "author_url": "https://www.google.com/maps/contrib/114522916616823343006/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKck0-9X2t7UQ8FHRxasoR5-LPmEDaiG6MfW0Pt3sCttMvQlw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Ms Janice was an exceptional Maths/Add. Maths teacher. Throughout my high school years, she would patiently explain concepts to me until I understood it completely. I never really enjoyed the subject until she started teaching me, and that was not just because of her clear explanations, but her passionate dedication in encouraging us too. She would leave positive quotes on her worksheets, link maths lessons to life and always make it a point to start of each lesson positively. She not only guided me to achieve A* for both Maths and Add. Maths, but made the subject fun and easy to grasp overall.\nI highly recommend her if you want to improve your Maths / get the highest grade possible. She is definitely a teacher who will assist you to her best abilities.",
      "time": 1673020064,
      "translated": false
    },
    {
      "author_name": "Samantha Goh",
      "author_url": "https://www.google.com/maps/contrib/114798476479772414145/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVJ9DSiTAt6kdEWmEuKrSzGJ_1PCHqLOC0bF3q9dcJ88IKrMcix-g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "Jack was really nice and often went out of his way to help his students. He even went as far as driving all the way to pass a book so that we can have more practice! His lessons are very detailed and his notes are very helpful in terms of understanding and doing quick recaps before exams! I like how we have online videos explaining the answer in each question in the exam papers. My math grade definitely improved and i highly recommend taking maths tuitions here:)",
      "time": 1584542324,
      "translated": false
    },
    {
      "author_name": "Caitlin Wee Fern",
      "author_url": "https://www.google.com/maps/contrib/108766466596186541989/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIOtZo3sBlq8fVRegdcldLKeU3dg1Uqq_mCb9sEtFX1jpkexA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "Jack was / is an amazing Math tutor —  he always made seemingly complex and daunting Math questions simple by bringing our attention back to the basics & was very effective in teaching us the foundations in H2 Math that would help us tackle any question. Jack was also very patient in clarifying any doubts we had, and his passion for the subject & knowledge acquisition was very inspiring! Thanks to Jack’s / Achevas’ topical summary sheets & video explanations which were clear & concise, I never had to watch my school’s videos, and this saved me a lot of time. Am glad to have been a student of Jack’s / Achevas :)",
      "time": 1584537631,
      "translated": false
    },
    {
      "author_name": "Yi Tian Loh",
      "author_url": "https://www.google.com/maps/contrib/103783636957708917769/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLyeqDpHAoKmotSiSCojTV72pSP2epStdhh3shvWN5eMBelmQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "There is a difference in teaching quality between teachers who teach to earn a living and those who teach because they are passionate about educating the next generation.\nI remember suggesting to Ms Janice that for someone of her calibre, she could easily find a higher-paying and less-demanding job than teaching. She responded resoundingly that she loves teaching; she would not change her occupation. From that moment, I started to admire her because she remained steadfast in a decision few would make.\nMs Janice is an excellent maths teacher too. She could always explain concepts, regardless of their difficulty, in an easily understood manner. Besides, she would show several methods of solving a problem when one would suffice. She would also go the extra mile to care for the well-being of every student and ensure that everyone is doing well academically, mentally and physically.\nAlthough Ms Janice may be stern in the classroom, she is actually very kind, friendly and caring. Getting to know her was one of best thing I gained from high school.\nLastly, if Ms Janice is your maths teacher, you are absoutely in safe hands :)",
      "time": 1674673263,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17106843633964565044",
  "user_ratings_total": 49,
  "vicinity": "21 Jurong Gateway Road, #04-01 CPF Jurong Building"
}