{
  "formatted_address": "10 Eunos Rd 8, #12 08 Singapore Post Centre, Singapore 408600",
  "geometry": {
    "location": {
      "lat": 1.3189418,
      "lng": 103.8944605
    },
    "viewport": {
      "northeast": {
        "lat": 1.320502080291502,
        "lng": 103.8957674802915
      },
      "southwest": {
        "lat": 1.317804119708498,
        "lng": 103.8930695197085
      }
    }
  },
  "name": "Achieve Group Recruitment Agency, Singapore",
  "place_id": "ChIJBarnKgwZ2jER91A5b52FHe0",
  "rating": 3.4,
  "reviews": [
    {
      "author_name": "Edwin Lian Jian Han",
      "author_url": "https://www.google.com/maps/contrib/106983670427015975441/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXUYHFEtrDuGU6iJDF9WSgatL3Y4FwdjT_h12tbQkFCEeBYrecc=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "I'd like to extend my sincere gratitude to Shahul for reaching out to me with a fantastic job opportunity. After being retrenched in November 2024 and experiencing little success in my job search and job interviews, Shahul contacted me via MyCareersFuture on March 21st. From that point, he diligently worked to secure me an interview with the company. Approximately two weeks later, I had the interview, and Shahul consistently followed up with me afterward to see how it went. About a week after the interview, I received the wonderful news that I was their first choice. Shahul also skillfully negotiated a competitive salary that met my expectations. Finally, within another week, all the necessary documents were prepared before my start date.\n\nOver the course of these four weeks, Shahul consistently impressed me with his professionalism and dedication. Without his proactive outreach regarding this opportunity, I would likely still be in the frustrating cycle of endlessly applying for jobs. Thank you, Shahul!",
      "time": 1745325617,
      "translated": false
    },
    {
      "author_name": "Jenny Chen",
      "author_url": "https://www.google.com/maps/contrib/104108156357976268219/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW4WVnvtizFO8UCxgr13NvdqvKt_0Zt71358xflMrrlO81izkBpJg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "Thank you, Rachel. I truly appreciate your time, support, and effort in understanding my career goals and work preferences. Your guidance in matching me with the right opportunities has been incredibly helpful, and I’m grateful for your assistance throughout the process.",
      "time": 1747361495,
      "translated": false
    },
    {
      "author_name": "Nur Erina",
      "author_url": "https://www.google.com/maps/contrib/117694631243662217663/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJuD8vM4vAdvrpfjepWwCOWs6erSCt6GEJR5nF72wUdVXPILQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Although I wasn't selected for the role Rachel initially contacted me about, I truly appreciated her professionalism throughout the process. She remained courteous, communicative, and has continued to keep an eye out for potential opportunities for me.",
      "time": 1746760685,
      "translated": false
    },
    {
      "author_name": "Hui Shan",
      "author_url": "https://www.google.com/maps/contrib/103070612768502513507/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK2E0opB0FH6-U99Xu-yRFnU8_ceyPTQyTkNQfYGfhu-CM6xg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "I had an extremely disappointing experience with Nura's handling of my employment case. From the start, I was given high hopes for a very competitive salary, only to be repeatedly asked to lower my expectations after each interview. Even after finalizing salary negotiations and accepting the offer, I was suddenly asked to sign additional forms that had never been disclosed earlier in the process.\n\nOne of these forms stated that I would have to pay them one month’s salary if I did not stay in the role for three months—something that was never mentioned before. When I raised my concerns, the recruiter’s response was dismissive and unprofessional, questioning why I was uncomfortable signing and even suggesting that I \"ignore\" the problematic clause and sign the rest. Such an approach is highly unprofessional, especially coming from someone with 15 years of experience in the industry.\n\nTransparency and integrity are crucial in recruitment, and my experience with this firm fell far short of those standards. I would not recommend working with them.",
      "time": 1742281345,
      "translated": false
    },
    {
      "author_name": "Angela Wang",
      "author_url": "https://www.google.com/maps/contrib/106694430610526864470/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKieFJArvTmPdkxYbK4m9SmjBn6_OVkMYLUicXhqEeMQ2_F4Co=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "My headhunter — Cesky has excelled in his recruitment with his efficiency of acquiring and sharp talent-spotting skills. His strategic approach streamlines hiring, ensuring top-quality placements and strong results!\nWould definitely recommend him for anyone looking for a position in any related company.",
      "time": 1739581642,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17085959472535916791",
  "user_ratings_total": 114,
  "vicinity": "10 Eunos Road 8, #12 08 Singapore Post Centre, Singapore"
}