{
  "formatted_address": "91 Jln Lekar, Singapore 698917",
  "geometry": {
    "location": {
      "lat": 1.3860463,
      "lng": 103.7246622
    },
    "viewport": {
      "northeast": {
        "lat": 1.387287930291502,
        "lng": 103.7261158802915
      },
      "southwest": {
        "lat": 1.384589969708498,
        "lng": 103.7234179197085
      }
    }
  },
  "name": "Acres Wildlife Rescue Centre",
  "place_id": "ChIJ7xxpjR4O2jERfD6Z1D4tOkk",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "learn with kit",
      "author_url": "https://www.google.com/maps/contrib/109477060624889286157/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXZq6zqzzCqMw6c0cjjDuHy2WC7-WNxCeO_bAitWLVw4kvptTg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "We discovered the presence of Acres Wildlife Rescue a decade ago when we rescued a bird on a pavement. The bird was concussed. We did not know how to handle the bird and was guided by Acres (place in safe box with holes)\n\nFast forward today, Acres has a whatsapp hotline. When we encounter situations, such as appearance of monkeys in our estate, Acres guided and educated us on what to do. It is not always necessary to \"remove\" the animals. We learn to let them take its nature's course.\n\nLast Sunday, our friend rescued a bat with injured wings. We informed Acres via whatsapp and they educated us on what to do. The bat was already secured in a carrier hence Acres advised that we can either send the bat in to their premises or arrange for Lalamove (expense paid bu rescuer). So I drove and sent the injured bat to Acres, they promptly took over. God bless their good hearts 💕\n\nAcres operate on a tight resource.\nThey have good resources to read via their Whatsapp catalog.\n\nWe can support Acres as members of public and also learn to live with animals in harmony. They are part of our community and ecosystem. ❤️",
      "time": 1742528258,
      "translated": false
    },
    {
      "author_name": "Lee Hui Ee Lhe",
      "author_url": "https://www.google.com/maps/contrib/100705203161948351705/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUWscKVX2bg_FPHKedt3zers5rRRmj6wYhiTMO8fub3V5BEAm4h=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I was amazed by the efficiency and professionalism of ACRES. On 6 April night (around 9:20pm), I found a baby bird under my block near the slope beside the handicap parking lot. It could only fly horizontally. There are cats and rats in my neighbourhood. It was too close to the road where many vehicles turn in for passengers to alight to head to my block. I brought it home we called ACRES for help. ACRES van happened to be nearby and came within 10 minutes. The young male staff asked if I had seen the parents of the bird around. I had no idea as I couldn't even tell what kind of bird it was. The guy could name the species immediately upon inspecting it. He said that they would come back with the baby bird tomorrow morning to try to find its parents and put it back into its nest with their tool. I was utterly impressed. Well done ACRES! I really didn't know what to do with it other than keeping it safe, away from the road and potential predators.",
      "time": 1744040032,
      "translated": false
    },
    {
      "author_name": "Tofu Buddies",
      "author_url": "https://www.google.com/maps/contrib/103823895289457569926/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVWWdBySIGcOC4beiH0I-C0eOy9OzGzWzuHwzRpCl_6uFNb6JE=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "i recently started volunteering at ACRES and i quite like it there. i mainly care for the birds and it is really nice to see the rescued birds recover well! i hope more people will volunteer at ACRES and enjoy it as well",
      "time": 1736841321,
      "translated": false
    },
    {
      "author_name": "Francis Kwang",
      "author_url": "https://www.google.com/maps/contrib/115353246724953608735/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJL9-DX4P5TBoML8dfwa2epnAadlYVKtpq2HVXcBHjxG-fOwuIT=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "First time here… a bit of drive from the KJE. Not much signage along the way but just follow the Google map.\n\nNot a fancy place like SPCA but can see the passion of the guy we met there. We dropped off a Pink Necked Green Pigeon fledgling that fell onto our car windscreen while we were driving.\n\nGreat to know there an animal-friendly place that helps these wildlife displaced by human and urban development. Kudos to the folks that works here!",
      "time": 1746961309,
      "translated": false
    },
    {
      "author_name": "A Fang",
      "author_url": "https://www.google.com/maps/contrib/113513491945569702036/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJJa5wtegHt1YRiBh73isywAg5Z5qy-iJgbN-zon8XuvFn7iw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "Found a fledgling dove that couldn’t fly and Acres came to take her away. Communicated with them via WhatsApp and they gave instructions about how to care for it (TLDR: cardboard box with ventilation holes, do not feed) and came to collect the bird a few hours later at 10:45pm (they were resolving another case). their dedication to our local wildlife is impressive.",
      "time": 1724389759,
      "translated": false
    }
  ],
  "types": [
    "park",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5276579661295992444",
  "user_ratings_total": 267,
  "vicinity": "91 Jalan Lekar"
}