{
  "formatted_address": "228 Geylang Rd, Singapore 389288",
  "geometry": {
    "location": {
      "lat": 1.3121277,
      "lng": 103.8772748
    },
    "viewport": {
      "northeast": {
        "lat": 1.313552630291502,
        "lng": 103.8786082302915
      },
      "southwest": {
        "lat": 1.310854669708498,
        "lng": 103.8759102697085
      }
    }
  },
  "name": "Agarwood World Gallery Singapore® 沉香静舍文化馆®",
  "place_id": "ChIJbWgItekZ2jER378micwDOi8",
  "rating": 5,
  "reviews": [
    {
      "author_name": "A Lin",
      "author_url": "https://www.google.com/maps/contrib/113676505359804669172/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIINPi32dKAtpJegbxhVvusRy4tJRmNHyYQyqOW3NDN4YiJ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Jeffrey is friendly and knowledgeable. The products he has in his shop came from various famed Agarwood regions and cater to wide range of customers with different Agarwood smell preferences.\nI have been collecting Agarwood for the last 20 years and have yet to find another shop of equal standing in Singapore, based on quality and quantity.\nThe prices don’t come cheap for the high end Kynam, but that is the way it is. There are some other shops/Feng Shui shops locally and in the region that are selling at much higher prices for products of much lousier qualities. Especially those that tried to package with Geomancy, luck and religion.\nThose who know Agarwood should be able to tell the difference immediately and recognize the quality of products in this shop.\nIf you are first time buyer or new to Agarwood, better start low and small and see more products before buying from anyone. Although I can give assurance that this shop has got good quality stuff relative to the price, it is recommended to always see and feel the products in person.",
      "time": 1745743921,
      "translated": false
    },
    {
      "author_name": "YL Wong",
      "author_url": "https://www.google.com/maps/contrib/109539518677498308181/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJY9alFKtOwvajCcMubDphh9hNwiWUmeE7v5pelCmcnqB8cKA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I dropped by this shop, after hearing so much good reviews online/ social media.\nDidn’t expect Jeffrey to be so friendly / accommodating… that answered a lot of my queries. He spent close to 90mins sharing / opening the world of diff types of Agarwood and incense. Jeffrey is indeed very knowledgeable.  Ended up buying one of his premium incense sticks for my prayers. I will be back!",
      "time": 1742429364,
      "translated": false
    },
    {
      "author_name": "Erra",
      "author_url": "https://www.google.com/maps/contrib/113419904348215939829/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJB7aH-CZ6mNGtdhbtd_ZWvprNCCMnPpSU2tAyMVkk__HAFfA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I would like to share my recent visit at Agarwood World Gallery.  I was impressed by the genuine agarwood collections. The gallery offers a wide range of authentic agarwood products, including high-grade agarwood incense and unique in-house items like the GeoAgar Essence, which is made from natural ingredients and has a distinct forest-like fragrance.\n\nThe founder, Mr Jeffrey, is knowledgeable and friendly, providing expert guidance without being pushy. He encourages me to check out the products on the shelves and pick what resonates with me personally.\n\nI highly recommend Agarwood World Gallery for its authentic products and excellent customer service. I am certain that you will enjoy the journey led by Mr Jeffrey and his Agarwood gallery.",
      "time": 1741079590,
      "translated": false
    },
    {
      "author_name": "Nurul Salleh",
      "author_url": "https://www.google.com/maps/contrib/105231584152092238303/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJnEagE3r5CItKK03rh5kwjG4nhFyh6EEE764WGbFrJ5Cyi7g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I had a very positive experience visiting Agarwood World Gallery. It was filled with wild-sourced and sustainable Agarwood. On our second visit, Jeffrey offered us vast wealth of knowledge on its uses and benefits. Jeffrey went above and beyond to let us experience Agarwood in the best way. I'm able to appreciate each unique notes thanks to Jeffrey.\n\nMy favourite has got to be the GeoAgar Essence which I absolutely have to enjoy every night before bed. We are visiting again this weekend 😁",
      "time": 1739268413,
      "translated": false
    },
    {
      "author_name": "Pu wen",
      "author_url": "https://www.google.com/maps/contrib/101964455533300749874/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKJbrJLQgvhsiMk2zJ7_uO55kNRbW94K5MRhp6punifMts9hg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "The owner of Agarwood World Gallery is an expert in the agarwood industry. This store has a lot of exclusive things that you can't find in any other agarwood store. For a newbie like me, the Boss, Mr. Jeffrey Teoh, is very helpful in taking the time to explain the various varieties of agarwood as well as how to distinguish between authentic and nonauthentic agarwood.\n\nAlong with soothing background music and ample lighting, the store has a really relaxing atmosphere that makes it easy for me to browse around. In fact, Mr. Jeffrey allowed me to check out the item he was selling at my leisure.",
      "time": 1706432503,
      "translated": false
    }
  ],
  "types": [
    "art_gallery",
    "point_of_interest",
    "health",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3403036645441060831",
  "user_ratings_total": 148,
  "vicinity": "228 Geylang Road"
}