{
  "formatted_address": "739 Bedok Reservoir Rd, Singapore 470739",
  "geometry": {
    "location": {
      "lat": 1.3378796,
      "lng": 103.922568
    },
    "viewport": {
      "northeast": {
        "lat": 1.339207180291502,
        "lng": 103.9241428802915
      },
      "southwest": {
        "lat": 1.336509219708498,
        "lng": 103.9214449197085
      }
    }
  },
  "name": "Ah Orh Teochew Fishhead Steamboat",
  "place_id": "ChIJDQjeoZM92jERLkxaildSKcQ",
  "rating": 3.2,
  "reviews": [
    {
      "author_name": "nicole dk",
      "author_url": "https://www.google.com/maps/contrib/113994758474661434219/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIeeeQj80X2lzhSlV4YtjxIRA1Srdwo_qtU6GZ9Q-h9cTXHkA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 weeks ago",
      "text": "One of the worst zichar store. The cereal prawn was fried with flour without taste and the prawn is mushy and not fresh. The sweet and sour pork not crispy and no taste too. The fish head steamboat still ok only acceptable. The fried rice is tasteless too. Will not come to this outlet anymore. Could have eaten something better with this pricing…",
      "time": 1746535504,
      "translated": false
    },
    {
      "author_name": "Gerald Lim",
      "author_url": "https://www.google.com/maps/contrib/106444601808245259978/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXML65UXMItb9eaaddUz4LOkbRIdK7QQpgsI0ggzGXq3GPGRy2b=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 2,
      "relative_time_description": "a year ago",
      "text": "Food standards are mediocre compared to their main outlet at bukit merah. The coffee shop is super brightly lit and the outer perimeter round tables have got tons of small flies landing on them cos of all that fancy bright lights, making dining there super uncomfortable. The lady managed to have the lights switched off after we feedback, and that solved most of the flies issue. I would just head to their bukit merah restaurant for a better fix if I had to.",
      "time": 1706280455,
      "translated": false
    },
    {
      "author_name": "Alvin Toh",
      "author_url": "https://www.google.com/maps/contrib/116835695888617980447/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWWjXS11lXYRW489uBwxM5iub0qtQBTdOd7TFnBr9RbBfwk3bN8=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "a year ago",
      "text": "This stall was located in one of the coffee shop along Bedok Reservoir road. Coffee shop is huge with many tables available, suitable for family with young children or elderly. Personally I feel it’s a pretty average fish head steamboat, soup base was ok but the fish not very fresh. Their zhi char items was disappointing too( maybe I ordered the wrong items). For this price range that I’m paying, I believe I will be able to get something better around the area.",
      "time": 1692095007,
      "translated": false
    },
    {
      "author_name": "Li Yun",
      "author_url": "https://www.google.com/maps/contrib/107292018901792865359/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVC9r_fp9o5Z8Jl2Gck4KGbq-lwU_QZsbcuIILCM9vJIkdaXl0p9Q=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "3 years ago",
      "text": "Ordered delivery from this shop. Delivery is free if your order hits $88. Food was still hot when it was delivered! Steamboat set up was super easy. Can see they out a lot of thought into how to package everything nicely to make setup of steamboat to be hassle free. Two solid fuel was provided and each cube last around 15 mins. Fire was strong enough to keep the soup boiling. Soup was packed separately in a big bag that comes with a resealable bottle cap. I think it can refill the around pot fully 3-4 times. I only managed to use half the bag of soup. Could keep the leftover soup for next day use easily in fridge. The soup is really flavorful and yummy. Only a little disappointed with the sides. French beans with minced meat was really oily and salty. Oyster omelette could be better if eggs were more fluffy. Imperial pork rib was not too bad. Only teochew style fried kway teow was good. It is the full of wok hey type of kway teow. Overall, fish head steamboat is really nice! Ordering was really easy too! You can either call or Whatsapp them to make arrangements. Menu and details are all in their Facebook page.",
      "time": 1634920140,
      "translated": false
    },
    {
      "author_name": "KiM BooN LeE",
      "author_url": "https://www.google.com/maps/contrib/104527916285751902034/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUCNMtzYuEM-S7VH7q2wXpUdS0b_cohTihFT_jL-W1oj6rXg3W8Eg=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Along Bedok reservoir road. Inside happy hawker coffee shop... Foods wise really nothing to rave bout n aunty handling the store really bad attitude with no smile, with this kind of attitude m wondering how it still survived, due to not much coffee shop along this road?? Tried their crab promotion, proclaimed Sri Lanka crab, 2 for $45, but really disappointed with the size of the crab, 400gm of Sri Lanka crab seem so very unbelievable... Will visit the coffee shop but never to this store again...",
      "time": 1693313241,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14134919441415818286",
  "user_ratings_total": 80,
  "vicinity": "739 Bedok Reservoir Road, Singapore"
}