{
  "formatted_address": "3 Tampines Grande, Level 1, Singapore 528799",
  "geometry": {
    "location": {
      "lat": 1.3544524,
      "lng": 103.9417513
    },
    "viewport": {
      "northeast": {
        "lat": 1.356026430291502,
        "lng": 103.9430713802915
      },
      "southwest": {
        "lat": 1.353328469708498,
        "lng": 103.9403734197085
      }
    }
  },
  "name": "AIA Customer Service Centre (Tampines)",
  "place_id": "ChIJOSpbjQ092jERtncAQQ9pzrY",
  "rating": 3.8,
  "reviews": [
    {
      "author_name": "Chan Tin Chi",
      "author_url": "https://www.google.com/maps/contrib/116367288197198486710/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJXeK1YzVwr0sOZtyuEdyQ5jcdsPx5FHdDuU-vsC62Ymx838w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Thank you Jay for her excellence service and  the effort made to explain the policies i have and what are the options available. I see retention effort, not by forceful means but base on customer's POV and best interest. Good job!",
      "time": 1735549164,
      "translated": false
    },
    {
      "author_name": "An Koh",
      "author_url": "https://www.google.com/maps/contrib/102997756118491276739/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXd8nd3oLWU_hEY9_QcxohpBLsIv6mFVtCE4pmEHqe2WOv46iJ_=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "A zero star if I may, for AIA Credit Life Dept.\nI have a policy that I purchased in 2009, which I held for 15 years.\nIt matured on 1 August 2024. Payment was not made and I needed to call in, spoke to different officers and emails to ask for my money back. Various excuses given before I received an apology for the service lapse.\n\nAfter close to a 3 month delay, $30 shopping voucher as compensation for a 5 digit sum.\n\nFrom Gemini\nA company that provides an insulting compensation to customers after making a service lapse might exhibit the following characteristics:\n\nMinimal or No Apology: The company may offer little or no acknowledgment of the mistake or inconvenience caused to the customer.\nGeneric, Pre-written Responses: Compensation might be in the form of generic coupons or discounts that do not address the specific issue or loss incurred by the customer.\nUnreasonable or Insufficient Amount: The compensation offered may be significantly less than the value of the service or product involved, or the cost incurred by the customer due to the lapse.\nLengthy and Complex Claims Process: The company may have a complicated or time-consuming process for customers to claim compensation, discouraging them from pursuing it.\nLack of Empathy: The company may show little or no understanding of the customer's frustration or disappointment, focusing solely on minimizing their own liability.\nDismissive or Rude Customer Service: Representatives may be unhelpful, dismissive, or even rude when dealing with customer complaints or compensation requests.\nExamples of insulting compensation might include:\n\nOffering a $5 coupon for a $100 service\nProviding a replacement product that is clearly inferior to the original\nRefusing to reimburse shipping costs for a defective item\nBlaming the customer for the service lapse\nThese actions can damage a company's reputation and lead to customer dissatisfaction and churn.",
      "time": 1729663784,
      "translated": false
    },
    {
      "author_name": "Joon Huang Ng",
      "author_url": "https://www.google.com/maps/contrib/112914438010461063201/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJYA4e_JwuecHyfOfYKnzMIfn2BrvpiN6PLf4NVXtYeev2hlg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Today I am at tampines AiA customer services CTR..Ms Farah was serving my request today. I would like to thanks her for her helpfulness, so\nfriendly, professional knowledge to me. Is very efficient and great that you have such a well staff. Thks again.",
      "time": 1740113918,
      "translated": false
    },
    {
      "author_name": "Pak Soon Lau",
      "author_url": "https://www.google.com/maps/contrib/107524637554500568527/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWAupFwdFRgcaHdmSx9fyYJLiukGKqr9fA_TPJ9aT1_jX8gbgHU=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Very friendly and patient customer service staff who took time to explain our policies to us. Very impressed by the service here.",
      "time": 1695788700,
      "translated": false
    },
    {
      "author_name": "Shu L",
      "author_url": "https://www.google.com/maps/contrib/117783825286859619429/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK9Iy8SWtfS-e2O3dCXsEOlqqS0LXxGYEsaMC_pf0x8PlTqXw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "10 months ago",
      "text": "Terrible customer service. I called in to enquire about my claim status because only 80% was reimbursed from the usual 100%. The customer service team talks very authoritatively, trying to talk me down. Making it sound like I have asked a stupid question. First of all, why do you think we bother to call the customer service hotline if policies were straight forward and easy to understand? Just because you know the policies inside out?? I have done CSO call center before, so I know the stress and the volume of calls, but FYI we are all working here nobody is having an easy time with their job. This is not an excuse or a green card for you CSO team to talk down your customer. AIA policies itself have double standards and stingy when it comes to claims, now I have to deal with the CSO team. AIA as a whole is terrible!",
      "time": 1719368224,
      "translated": false
    }
  ],
  "types": [
    "finance",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13172581474341255094",
  "user_ratings_total": 207,
  "vicinity": "3 Tampines Grande, Level 1"
}