{
  "formatted_address": "Blk 440 Bukit Batok West Ave. 8, Singapore",
  "geometry": {
    "location": {
      "lat": 1.3561276,
      "lng": 103.7394966
    },
    "viewport": {
      "northeast": {
        "lat": 1.357508080291502,
        "lng": 103.7408074802915
      },
      "southwest": {
        "lat": 1.354810119708498,
        "lng": 103.7381095197085
      }
    }
  },
  "name": "Al-Dia Restaurant @ Bt Batok West Ave 8",
  "place_id": "ChIJ_YC68y8Q2jERCN6PYelg_eY",
  "rating": 2.5,
  "reviews": [
    {
      "author_name": "Zaki Arif",
      "author_url": "https://www.google.com/maps/contrib/109193082106787874162/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL1FG7RQyNjefgVpfshh0h_GTAbKRGMTClSkU-n3TC3aMTztA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Bukit Batok resident, this 1 of the worst ‘Indian Muslim’ shop!! Food served to me are like left overs!! I ordered mutton soup, what I received are soup with mutton that not even 1 that is in shape all were broken pieces just I have mention left over / unwanted food! Beware the pictures on the menu aren’t only for illustrations but also to deceive all customers!!",
      "time": 1707048589,
      "translated": false
    },
    {
      "author_name": "Riko Wahabs",
      "author_url": "https://www.google.com/maps/contrib/100707458087735516593/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL9WD3oxqKKPsfKPdPE8AiplDDq_m7E1p4VMZl_pn-XzbXEBw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "1. Be very careful and observant when making cash payment,\n2. Eat here only if you are starving or dying and there are no other options,\n3. Don't bother to queue or be civilised when ordering food. If you are locals, be prepared to have your orders pushed back if foreign Indian workers arrive with their demands.\n\nI won't be explaining in details about my experience with this stall since I feel that they don't deserve my earnest encouragement for their improvements. After my 1st visit, I had made several returns to give them the support and perhaps, another chance to prove my initial impression wrong. I felt stupid for doing that, so I stop buying from them completely.",
      "time": 1672266652,
      "translated": false
    },
    {
      "author_name": "Ken Peh",
      "author_url": "https://www.google.com/maps/contrib/113975004215945002265/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXSJxn-MN1vy970v-MMcT8F_p28Ghtkh0hnblugxH0puU79a2To=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 2,
      "relative_time_description": "a year ago",
      "text": "Used to get my weekly roti prata craving here. However, after a diarrhea case was experienced, I stopped patronizing them altogether. Their prata is okay to be honest, just that probably the handling of the food can be more hygienic.",
      "time": 1694247324,
      "translated": false
    },
    {
      "author_name": "jcszzupise",
      "author_url": "https://www.google.com/maps/contrib/100703981714698978324/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLRufHDPDq41rjS10aVLBBJuiwMEMljczMnO0S1HQxYmEpxRQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 years ago",
      "text": "Dishonest stall/ staffs, Who else has had bad experiences with this stall, “Al-dia Islamic food” indian food stall at Blk 440 Bukit Batok West Ave 8?\n\nI am a resident living near this indian food stall. Had on several occasions the following unfortunate/ bad experiences;\n\n1)\tOnce the stall’s staff shortchanged me when I paid for my food. I only realised after I reached home & as it wasn’t a lot(About twenty ot thirty cents) I had let go on this matter.\n2)\tAnother time, a different staff handled my take-away order & I realised I was given short of 1 prata after reaching home.\n3)\tMy daughter purchased a package of Fish Briyani & was not given a package of curry which this stall would normally do. When questioned, the stall staff said he had put the curry into the rice which we later discovered the curry added was of meagre amount.\n\nThere are normally a lot of indian migrant workers petronising this indian food stall giving this stall the bulk of their business, which probably explained why they are not interested to do the local’s business whom purchases are not as much.\n\nBlame myself for returning after several rounds of unpleasant experiences & suffered again. Learnt my lesson, beware of this stall.",
      "time": 1647625626,
      "translated": false
    },
    {
      "author_name": "Simon Y",
      "author_url": "https://www.google.com/maps/contrib/110316451866688483932/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKdB7d_PSK9ZHr8J9TtmvE4epyNyCeqBI5I4Iqoxa34ic6CMw=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "2 years ago",
      "text": "Mediocre food and inefficient service. I had probably seen OMO that work more effectively than the two man team here.\n\nOrdered Indian Rojak and Nasi Goreng, saw one of them dumped the Rojak items into fryer and the two staffs started chit-chating, No ONE was preparing the Nasi Goreng! I gestured for payment to make sure they got both of my orders, paid for both items and still no one was preparing the NG! Eventually the Rojak was ready and the same man that was frying the Rojak finally starting to fry the NG!! OMG! what can't he cook while waiting for the Rojak.... And what was the other man doing? Ans: apparently the other man was in charge of Roti Prata which I order none so he had nothing to do with my orders.",
      "time": 1663595563,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16644566353311686152",
  "user_ratings_total": 25,
  "vicinity": "Blk 440 Bukit Batok West Avenue 8"
}