{
  "formatted_address": "9012 Tampines Street 93, Singapore 528845",
  "geometry": {
    "location": {
      "lat": 1.3401422,
      "lng": 103.9419744
    },
    "viewport": {
      "northeast": {
        "lat": 1.341666630291502,
        "lng": 103.9435586302915
      },
      "southwest": {
        "lat": 1.338968669708498,
        "lng": 103.9408606697085
      }
    }
  },
  "name": "Al Habib Halal Foodiez",
  "place_id": "ChIJd0CbDgA92jERyw_ne7IiZN8",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Frederick Tan",
      "author_url": "https://www.google.com/maps/contrib/105431133624174376742/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX-LwQprCQajdt7zC7cd1e236USKKDV3lFIC5VcEI2TrDWjftUv=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Al Habib Halal Foodiez: Hidden Gem Prata and Briyani!\n\nStepping into Al Habib Halal Foodiez felt like discovering a culinary secret, a newly opened haven of deliciousness. And on a recent cool, rainy afternoon, their egg roti prata proved to be the perfect antidote to the weather and at $1.80 only per piece.\n\nThis wasn't a thin, flimsy affair; it was a beautifully layered roti, cooked to golden perfection, with a rich, perfectly cooked egg nestled within. The texture was spot on, a delightful balance of crispness and softness.\n\nAnd then there was the hot fish curry. Forget bland, forget watery. This was a robust, flavourful curry, packed with aromatic spices and tender pieces of fish. It had a comforting warmth, a gentle heat that lingered pleasantly on the palate. The curry and the egg prata were a perfect match, a symphony of textures and flavours that left me thoroughly satisfied.\n\nGiven its recent opening, the atmosphere was refreshingly unpretentious. The focus was clearly on the food, and the service was genuinely friendly and efficient. It felt like a place where the locals were just starting to discover their new favourite prata spot.\n\nAl Habib Halal Foodiez is a breath of fresh air, a testament to the fact that you don't need to break the bank for a truly delicious meal. The egg prata, at that incredible price, is a steal, and the fish curry is a must-try. If you're looking for a hidden gem that’s just starting to shine, look no further.\n\nHighly Recommended!",
      "time": 1743943836,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "store",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16097029118107258827",
  "user_ratings_total": 1,
  "vicinity": "9012 Tampines Street 93, Singapore"
}