{
  "formatted_address": "125 E Coast Rd, Singapore 428810",
  "geometry": {
    "location": {
      "lat": 1.3060196,
      "lng": 103.9047552
    },
    "viewport": {
      "northeast": {
        "lat": 1.307403830291502,
        "lng": 103.9061298302915
      },
      "southwest": {
        "lat": 1.304705869708498,
        "lng": 103.9034318697085
      }
    }
  },
  "name": "AlibabaR Hawker Bar East Coast",
  "place_id": "ChIJvxvZ7nIY2jER3rgHFi9EeXc",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "jayden",
      "author_url": "https://www.google.com/maps/contrib/105743541374316989018/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLwULvJdQDmvny72TJa5YalPplbiH7oOpP8fRxWfUiYNkgQ6pmd=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "This place has been opened more than a decade ago and over the years it manage to keep it's customers coming in, even survive through the covid crisis which definitely tells about this place.\nThe hokkien mee has always been my favourite since so many years ago and the taste and standard is always the same. Nice broth with a strong taste of prawn heads, noodles are soft and not those doughy kind simmered in it's tasty prawn broth. The chilli is just nice, not too spicy, nice to go with the noodles. One of my favourite hokkien mee places to go, it's rich in its flavour and definitely has its own unique recipe.\nThe waitress selling the beers are also friendly, many varieties of beers from draft to bottled beers to cocktails etc, good place for a hangout. (4 stars for the hokkien mee and drinks stall)\n\nHowever,  recently I tried the western stall beside the hokkien mee, the fries is ok though kind of pricey for it's portion of truffle, however what got me irritated was that when I ask for chilli or tomato sauce, the person just told me \"don't have, ran out of both\" which is ridiculous of how can you operate a western stall without the basic tomato or chilli sauce, what if I were to ordered a plain fries, does it means I will have to eat without any sauce? Any for goodness sake you could have told us before we order.  The truffle and cheese also wasnt mixed property, it's just chunks of it on the top layer of the fries with middle and bottom just purely plain fries(*2 stars for the attitude and service*)",
      "time": 1740135392,
      "translated": false
    },
    {
      "author_name": "Aaron S",
      "author_url": "https://www.google.com/maps/contrib/103367843736048925874/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLb-hlAMjKtq_KUAjmkbuNjGQxQZSxRbBUuiQO39dXJIUoqWQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Every visit to Alibabar The Hawker Bar is elevated by the warm and attentive service provided by Min and Nay. Their dedication to creating a welcoming atmosphere is evident in how they remember returning customers, making each experience feel personalized and special.\n\nMin’s friendly demeanor and attention to detail ensure that orders are taken with care and delivered promptly. Nay’s cheerful presence and efficiency add to the overall positive vibe of the establishment. Together, they contribute significantly to the bar’s inviting ambiance, making it a favorite spot for many.\n\nTheir consistent excellence in service not only enhances the dining experience but also fosters a sense of community among patrons. It’s staff members like Min and Nay who make Alibabar The Hawker Bar more than just a place to eat and drink, it’s a place where customers feel valued and appreciated.\n\nKudos to Min and Nay for their outstanding service!",
      "time": 1745753597,
      "translated": false
    },
    {
      "author_name": "Devane Sharma",
      "author_url": "https://www.google.com/maps/contrib/110960017867590746601/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKqvQNUZzNBYHc-FKQdvMaG7gjCiUBT68rh0Pk0r5Brc1F-5bT0=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Tried a burger from the burger stall, kebabs from the Turkish one, and their craft beers. All were great and they have a nice selection of craft beers- the staff are great and happy to give recommendations for the beers. This place is set up like a food court and is a relatively cheap option in the otherwise pricey East Coast dining belt.",
      "time": 1742035013,
      "translated": false
    },
    {
      "author_name": "chu xuan",
      "author_url": "https://www.google.com/maps/contrib/114900991350615107188/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXNpj0g5dwYiOuel7iG4w7xPNuLuOve5iINVGhJHN5EZ_LS2a675w=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "Good vibes and good food! 4.5/5 stars!\n\nThe hokkien mee is okok. Wet kind and the sauce was not bad. We shared $8 for 2 pax.\n\nThe pizza stall sells REALLY GOOD sourdough truffle pizza for $16! Omg cheesy and rich and hot. They gave so much truffles I got sick of it towards the end!\n\nPlace also has huuuge selection of craft beers! My red by Petrus (fruity beer) for $14++ was so expensive but tastyyyy. \"Like wine and beer had sex and made a sweet baby\" yeah tastes damn classy.",
      "time": 1715700897,
      "translated": false
    },
    {
      "author_name": "Jeffrey Cecilio A. Araña",
      "author_url": "https://www.google.com/maps/contrib/105439833466567962925/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVW9z_Kh3M59jAa5sgaerrAQWOBlpce53EwS48Hi7NEGcPGM1E6Ig=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Hence Busog! Sarap! Ubos!\n\nIf you're looking for a winning dinner experience, Pete's is the place to be! Their skewers of grilled chicken are cooked to perfection, juicy and flavorful, and paired beautifully with a fresh and vibrant salad. To top it off, a cold Paulaner beer is the perfect complement to the meal. The atmosphere is another highlight—on a Thursday dinner time, the crowd is all professional, creating a lively yet relaxed vibe. Pete's truly nails it with great food, quality drinks, and an inviting ambiance. Highly recommended!",
      "time": 1737031252,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8608987131719170270",
  "user_ratings_total": 877,
  "vicinity": "125 East Coast Road, Singapore"
}