{
  "formatted_address": "S11-01, Pusat Komersil Visi Medini Persiaran Medini 2, Iskandar Puteri, 79250 Johor Bahru, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.4166764,
      "lng": 103.6223425
    },
    "viewport": {
      "northeast": {
        "lat": 1.418011180291502,
        "lng": 103.6236876802915
      },
      "southwest": {
        "lat": 1.415313219708498,
        "lng": 103.6209897197085
      }
    }
  },
  "name": "Alina Cafe Bakery",
  "place_id": "ChIJw9gIvR0L2jER9EarbLcZU3o",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Munirah A.A",
      "author_url": "https://www.google.com/maps/contrib/106749858251617346672/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX1cHCffjrS-fYp1CV1YtfUpg0NJcma7E5JPxtvrxgqD-sFvCk=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "all foods served are well-balanced, flavorful and light. absolutely a good place to have good western foods. the orange cake definitely the best. the seasoning for mushroom soup was spot on—not overpowering but just enough to enhance the natural flavors of the mushroom. all pasta were good but i would pick Tomyam Pasta as my fav!",
      "time": 1738507648,
      "translated": false
    },
    {
      "author_name": "ana othman",
      "author_url": "https://www.google.com/maps/contrib/104064743523267222968/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIqPHLT_b15O5UMJAd9ZmKD82EcEnbI90Pjcx9rxkq5wm3jOw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Im glad we drop by this underated lil bakery while waiting for our car to be polished a few shops away. Love the clean and homely taste of their lasagne (i ended up 'da bao-ing' 2 more for my kids to try). Coffee is good too! We also bought their plain sourdough and it did not disappoint. Will return to try out their other bakes soon!",
      "time": 1735886346,
      "translated": false
    },
    {
      "author_name": "Marie Amira",
      "author_url": "https://www.google.com/maps/contrib/111761153277097722330/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUTroWas2ql_TbweGTl80XNWuPLW7YI-8qDQQDTlaLTt9feET-CpA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "7 months ago",
      "text": "First time came here with hubby at 10 Oct 2024\n\nGreeted with smile by i think boss-lady.\nThe door its a bit confusing. Apparently not me alone doing the confusing thing. Most of them are doing it. A signage would be nice.\nWaited at the table for 6 minutes and was given a QR but the QR only a list of menu. Still have to call them to order.\n\nI write down based on pictures i have couldnt recall the full name from the menu.\nWhat we ordered:\nLemongrass lime: No lemongrass taste\nChocolate Ice: Its coco, was expecting milky taste of chocolate (sorry for my asian-ise tongue expectation)\n\nSandwich: Disappointed with it. It would be nice if there is some taste inside. Too dry.\nSalad: Its a fruit salad, its nice its delicious. Love it so much.\nScrambled Eggs with Toast: I love the toast with a pumpkin seed inside if im not mistaken and the scrambled. Gosh you could enter to heaven even just with a bite. The softness, the creamy and lil bit of herbs. My fav!\nLasagna: Its big portion for the price of RM20+ Wouldnt recommend for breakfast but its a nice lunch to go with. The pastry for the lasagna plain taste.\nCarrot Cake: It doesnt feel right to me, the bottom cake over power the taste of the frosting. It doesnt balance the overall taste.\n\nEnvironment:\nI like the table setup\nYou can view the chef inside thru the glass\nI cant recall with any music around but if not it would be nice to have low jazz music to fit the vibe as you can listen to next table gossip iykwim.\nYou can grab your own plain water and sauce at the main display counter\nThey have jars of cookies, i didnt try coz i dont trust my tastebud with cookies.\n\nSecond visit alone:\nOrdered the same heavenly taste of my fav scrambled egg with toast and plain water.\nA quick breakfast visit.\nNoticed an improvement, QR has been placed on the table but not all table.\n\nThird visit with a friend:\nWhat we ordered:\nLunch Set\nThe lunch set includes\nMain Course,\nDrink (Roselle or Lemongrass Lime)\nand Random Slice cake.\n\nPesto: This is delicious, chef kiss but i must say the chicken a bit salty. But maybe im not a fan of salty things.\nBeef Carbonara: Creamy, pinch of herbs taste. Nice and satisfying for sure.\nWe both ordered same drinks\nLemongrass Lime: Same feedback, no lemongrass taste.\nWe both get the same cake:\nChocolate cake: Its a big slice, too dry. We couldnt finish it.\nWe ordered extra Mushroom pie. The size, the stuffing are just nice. The flavor good too.\n\nSomething new this visit is\nThey have a menu present to us. ❤️\n\nI hope owner finds this review as a constructive criticism. Would definitely come back.",
      "time": 1729590593,
      "translated": false
    },
    {
      "author_name": "Kimberley Howarth",
      "author_url": "https://www.google.com/maps/contrib/114957590885643931784/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKqIRXau89p_qX4D_iPhWPke2K9bpcZNopPSg5xJgvjCHJQZg=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "This is a wonderful new cafe in the area. It is clean and cosy, and the staff are really lovely and friendly people. They have a small humble menu, maybe because they are still so new... but they have a great variety of cakes and bakes. Everything looks so enticing and delicious. Plain drinking water is self-service, and the lemon slices in the water were a refreshing touch. I ordered a nasi uduk daging semur. It was really tasty, the beef is perfectly cooked and seasoned, and the sambal is just right. I really enjoyed the sambal because it was not too spicy but still had all the great fragrant flavours that I love in a good sambal. Well done. I also ordered a takeaway beef empanadas - also delicious by the way and very nice heated up in an air fryer. Good job. I wish you success!",
      "time": 1726029449,
      "translated": false
    },
    {
      "author_name": "cheekee yong",
      "author_url": "https://www.google.com/maps/contrib/109732556149934111373/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJtSsfknNlSFhqB84uuZzwfoFOx5bITfciZOCzlKbQEN38PSg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "30 years ago, I always wished I could try the food creations featured in Vogue Entertaining & Travel magazines - in Malaysia. The creations in this cafe remind me of those days, except I can finally partake in those creations!\n\nI think dropping the QR code ordering process and a fully western interpreted menu helps this cafe crystallise a western cafe vibe in an otherwise fierce marketplace.",
      "time": 1735482217,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8814417171287066356",
  "user_ratings_total": 24,
  "vicinity": "S11-01, Pusat Komersil Visi Medini Persiaran Medini 2, Iskandar Puteri, Johor Bahru"
}