{
  "formatted_address": "820, Block A Thomson Rd, #06-01, Singapore 574623",
  "geometry": {
    "location": {
      "lat": 1.3418305,
      "lng": 103.8379635
    },
    "viewport": {
      "northeast": {
        "lat": 1.343167330291502,
        "lng": 103.8393136302915
      },
      "southwest": {
        "lat": 1.340469369708498,
        "lng": 103.8366156697085
      }
    }
  },
  "name": "AliveoMedical Mount Alvernia Branch",
  "place_id": "ChIJ1-Jm6dsX2jERYKSVBPcgUKk",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Chinese Guy",
      "author_url": "https://www.google.com/maps/contrib/115148613288478044474/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUknMzsioLL-F-cWRBW6flqUEiiTi72UNo16UWCIWUm22QLY6WM=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Dr Loo is very patient and has very good knowledge. She will explain my medical issue to me in an easy to understand manner and the steps I need to take to improve my health. She has good memory of my specific medical issue and unlike many doctors I see, I don't have to re-explain my issue in my visits. This give me confidence that she is fully aware of how to resolve my medical problem. Highly recommended to anyone who like to work in partnership with your doctor.",
      "time": 1736303442,
      "translated": false
    },
    {
      "author_name": "Ma tt",
      "author_url": "https://www.google.com/maps/contrib/102382313505418526836/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW0OIzLucjtC4_z02o2ErmUtqNzljXXCyLOcN11Of-xBz_deB6E=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I did a colonoscopy with Dr Loo, and it was one of the best decisions that I had made. Dr Loo was patient and knowledgeable. She could relate to patients and use terms that are easy to comprehend, something which I greatly appreciated.\n\nThroughout the procedure, she was assuring and my first experience in doing the scope went smoothly. The subsequent follow-ups were also done professionally, with her spending time to explain thoroughly my current situation and the next course of actions to take.\n\nI am also thankful to the helpful staff for handling the administration and documentation work, ensuring that communication was prompt and concise.\n\nOverall, my experience here was great. I would definitely recommend the clinic and Dr Loo.",
      "time": 1741057425,
      "translated": false
    },
    {
      "author_name": "Esther Tay",
      "author_url": "https://www.google.com/maps/contrib/107660234215643348214/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocItuvIs8KpWytMRfDVQFw8QNJ-19gjU8bOLImqTGB5NL53HKw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "It has been a peaceful consultation and operation journey experience with excellent and very experienced Dr Stephen Tsao - Senior Consultant Gastroenterologist and also with Aliveomedical team. The way Dr Stephen Tsao consult is calm and professional and makes the patient feel relax and secured without any negative pressure before and after operation upon each and every consultation session. Operation also was done well smoothly and my polyps were removed without any pain within very short time like in one blink of eyes. All the staff at the reception seem well trained as experienced medical staff. Not only as normal registration process, the staff show care and concern and ask and check in details related to health issues that patient is facing based on the past medical reports. Really recommend Dr Stephen Tsao and Alivemedical team for any gastroscopy and colonoscopy consultation and operation process.",
      "time": 1740453716,
      "translated": false
    },
    {
      "author_name": "Chandra Prabha",
      "author_url": "https://www.google.com/maps/contrib/107449865537619409035/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV2s4nP47hxKhYmJ-mvuv0iIl5eHZ4HpHnwD2nWLfXauIY4TCtdpQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I was seen by Dr.Loo Wai Mun. Initially I had spikes on some values on my blood tests which were vague indications of some underlying health problems. When I took the problem to the doctor, she very clearly explained to me the possible things which could have resulted in the spike and ran some tests and helped to diagnose the problem correctly. Based on her advise, followed strict diet and exercise after which I could see the readings drastically improve. The staffs were also super friendly and made all of my appointments and follow ups a breeze. The doctor and attending staffs are very professional and would highly recommend.",
      "time": 1744183932,
      "translated": false
    },
    {
      "author_name": "Carrie",
      "author_url": "https://www.google.com/maps/contrib/107367919383112170938/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKSV9rFcENYX6m0SoN3y_HATpEGFk4QOpk2wbeZ4f5D-sOtrA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Dr Loo was very professional, thorough in explaining the process and had an excellent bedside manner, which put me at ease ahead of my scopy and surgery. She was also supported by a wonderful team, who went out of their way to secure me an earlier appointment. I am very pleased with their service and care, and would highly recommend them.",
      "time": 1739933394,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12200287635852600416",
  "user_ratings_total": 13,
  "vicinity": "820, Block A Thomson Road, #06-01"
}