{
  "formatted_address": "10 Collyer Quay, Level 43, Singapore 049315",
  "geometry": {
    "location": {
      "lat": 1.2832397,
      "lng": 103.8520217
    },
    "viewport": {
      "northeast": {
        "lat": 1.284436230291502,
        "lng": 103.8535157302915
      },
      "southwest": {
        "lat": 1.281738269708498,
        "lng": 103.8508177697085
      }
    }
  },
  "name": "Altro Zafferano",
  "place_id": "ChIJ8Ts47w4Z2jER3wgHYemC4hw",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "ben vaillant",
      "author_url": "https://www.google.com/maps/contrib/118246295467421053874/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJcyNRfRWGWSuZkoapc5L0L_z66ZO2FmITtBe3AhEfPPYn7kw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "Superb experience and highly recommend for Dinner!\n\nThe service from when we entered the building all the way to us leaving was top notch!\n\nWe highly recommend the scallops for starter and the pasta wheel for main. The wine pairing we was offered was also a lovely accompany to the main.\n\nThe atmosphere was great, especially for a late dinner reservation (20:30) and the pre ordered drinks were ready for when we were sat.\n\nMark, our waiter was very professional and provided us with a great insight into the menu and was very communicative throughout the evening.\n\nThis dinner reservation was also for my partner’s birthday and they were great with everything requested too!! Highly recommend for a date night.",
      "time": 1745245133,
      "translated": false
    },
    {
      "author_name": "Yuan Tian",
      "author_url": "https://www.google.com/maps/contrib/113261722861482475818/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWqqgMjoib-rfIe1bp8bOWmRVh4PTpuMRMo_5prPSJ2vV7tLZBElw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "We recently celebrated Valentine’s Day at this restaurant, and it was a truly memorable experience.\n\nAmbiance:\nThe atmosphere was bright and airy, thanks to the large glass windows and lush greenery. The modern decor, combined with natural lighting, made for a relaxing yet elegant setting. It’s a perfect spot for a romantic dinner or any special celebration.\n\nFood:\nThe dishes were beautifully presented and tasted just as amazing as they looked. Each plate was thoughtfully crafted with fresh ingredients, and the flavors were well-balanced. We particularly enjoyed beef which stood out for its taste and texture. Also the dessert was really tasty and not too sweet.\n\nService:\nThe service was attentive yet unobtrusive. The staff were friendly and ensured everything was perfect throughout.\n\nView:\nThe panoramic view added a special touch to the entire experience. Dining with a view like that elevated our celebration, making it even more unforgettable.\n\nOverall:\nThis restaurant was a perfect choice for Valentine’s Day, offering great food, exceptional views, and a romantic atmosphere.",
      "time": 1739548667,
      "translated": false
    },
    {
      "author_name": "Karren De Jesus",
      "author_url": "https://www.google.com/maps/contrib/108955218388433577005/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUu_PDv_HkUEh2ma2_n6URXP0NVQ_g36NrkhJnTqr6atMXAE_j_=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Perfect choice for my hubby’s birthday. Amazing food, ambiance and service. We had a lovely dinner in the main dining area. Then, headed out to the terrace for dessert and drinks. Great view with bonus fireworks display. Thank you Altro Z staff for taking care of us last night. Highly, HIGHLY recommended and will definitely come back. ❤️",
      "time": 1738975564,
      "translated": false
    },
    {
      "author_name": "Darwin K",
      "author_url": "https://www.google.com/maps/contrib/111742897677287064516/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUJy-4Jl0SI4qsCqH2zR3Kswpi1lbczNtWrgIvL2dlUpUd9IMKE=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Truly a unique experience to visit this restaurant. It has spacious indoor area and cozy outdoor section, from which one can enjoy the breathtaking view of Singapore skyline without worrying too much about rain, thanks to the roof covers. Staff are professionally trained and very knowledgeable about wines and other alcoholic beverages. The 4-course Western meal is delicious, although the portion is shy of filling. The Beef Tenderloin with Truffle Jus steals the limelight while the chocolate dessert brings the sweet finishing well. The night was made complete with a great live performance by 53A.",
      "time": 1744645514,
      "translated": false
    },
    {
      "author_name": "Syl L",
      "author_url": "https://www.google.com/maps/contrib/114850437828511138776/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW6guzeSFHUGEMVPqok0yXFl1WShtrIiy97pAa8oBL0Z9gJBOHR=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "2 months ago",
      "text": "Seasonal menu calls for improvement.\nSuckling pig could be done better as skin isnt crispy, fats of pork did not melt down in mouth.\n\nSeasonal dessert lacks some texture or taste to bring out its uniqueness.\n\nStandard menu is great. Turbot was better than cod.\nBeef tartare from standard menu would be better.\n\nOverall service is great!",
      "time": 1741853430,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2081369916665432287",
  "user_ratings_total": 1083,
  "vicinity": "10 Collyer Quay, Level 43"
}