{
  "formatted_address": "22 Sin Ming Ln, #04-82 Midview City, Singapore 573969",
  "geometry": {
    "location": {
      "lat": 1.3584498,
      "lng": 103.8336633
    },
    "viewport": {
      "northeast": {
        "lat": 1.359669480291502,
        "lng": 103.8347316302915
      },
      "southwest": {
        "lat": 1.356971519708498,
        "lng": 103.8320336697085
      }
    }
  },
  "name": "Amway Authorised Service Provider (Esprit Consortium)",
  "place_id": "ChIJ7yEWHtIb2jER2e7RDpyhmgU",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Edward Rodrigues",
      "author_url": "https://www.google.com/maps/contrib/112847367770121252188/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWEuREAXfutxJZ_-5cNB81GT2J1OgNSdcte2SFX-7dJHTKA4ZbOyA=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "7 years ago",
      "text": "A very well organised outlet. Excellent and quick service.  👍",
      "time": 1512638762,
      "translated": false
    },
    {
      "author_name": "mum777 at work",
      "author_url": "https://www.google.com/maps/contrib/111885333756419966173/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLjxLJutQK_gCpe9UMdWEj-9lORePbaX-QfMs3CLoa5YhKaTw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Hi. Just sharing my experiences with Artistry Beauty Experience sessions.\n\nMy first visit was with Irene. Second visit was with Rose. They analisised my skin and recommended products suitable for my skin type, starting from \"basic\" products.\n\nI will make sure I'll fix an appointment to visit them when I've finished certain products. I want to make sure I'm using the correct products for my skin type.  Visiting them is like a facial routine for me.\n\nThey will do the same process and will advised/recommend me whether I just remain on the products I've used or need to change certain products or add another products which is suitable for my skin type.\n\nThey will asked how's your skin feels after using their products? If you feel itchy on the sides nose area, for example, just let them know. They will explain to you and may be you need to change to another products which is suitable for your skin type. But they won't ask you to stop using it so not to waste it. They will advised you \"this one use in the morning and the new one use at night' (for example like me, I didn't consult them the first time I purchased Artistry facial wash, toner and moisturizer.\n\nBefore my third visit on 26.5.2022, I forgot the steps to purchased my Voucher before I can make appointment with the Beauty Consultant. Emailed them and leave my number to get an assistant. Irene called me and tried to explain to me tru phone but I couldn't. (I hope Amway can simplify the steps on purchasing the Voucher) Irene suggested I come down and she will show it to me but I've got another issue with my phone, I must exit from the website to view my OTP on my SMS. When exit from it we have to redo it over again. We redo couple of times. Normally, it's not like this when I purchased the Voucher. I realized I should use my hubby's card. So I told her to call my husband using their company's phone. She explained it to my hubby. Got my hubby's OTP and redo everything back and settled.\n\nOn the same day, told Rose I wanted to buy compact powder too so she helped me to choose the colour suits to my skin tone and applied on the skin.\n\nMany thanks ladies! I'm looking forward to visit you both again on my next appointment. It's been a pleasant visit all this while.\n\nGood day ahead.",
      "time": 1655267767,
      "translated": false
    },
    {
      "author_name": "Bonn Lim",
      "author_url": "https://www.google.com/maps/contrib/109711532440400505109/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWJVTmJWi9HTeXij3uMzEN_i9bUoEbvrbw4OhSdEL8_0XfN27B4=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "3 years ago",
      "text": "Have been a distributor for many years and really disappointed with some of the recent changes.\n\nPlaced an online order on 1 June 2021 just after midnight and selected 9am-1pm time slot. Supposedly will receive products the following working day on 2 June. No delivery came. Probably there were delays so waited for another day till 3 June. Delivery person finally came, at 5pm, after I had left the house to run errands (he did not notify that he will be late). Told the delivery person to reschedule to the next day (4 June). Again, waited till evening and was then informed by Amway that the delivery company can't deliver that day and have to wait another day (till 5 June).\n\nAs of now (5 June 2021, 1.19pm), still waiting for my products which I ordered on 1 June 2021, 12.30am.\n\nUpdate (5 June 2021, 2.58pm):\nReceived a call back from Amway customer service and they said there is no record of a delivery scheduled for me for today. This is getting ridiculous....\n\nPlease get a better delivery company. Aside from me, my customers are also waiting for the products too. It's difficult for me to justify how good the service of the company is when the delivery is delayed for so many days! And we are only notified at the very last minute about the delays and change in delivery schedule.\n\nAlso placed an order for espring bundle for my customer recently (April 2021) and was unable to key in warranty details through the website. Called and email Amway customer service to double check that the warranty is valid and the staff said will get back to me, but no response till now",
      "time": 1622877817,
      "translated": false
    },
    {
      "author_name": "Kelly Choo",
      "author_url": "https://www.google.com/maps/contrib/112620597984818196048/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLVADJUupQlCsUCCc8Pe4L3zas2wAztrJCBSM5CnfL1CgGQvw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Best service from Mr teo and shaun. Making the repairs done within 2 hours . Thanks to their efficiency that I have clean after to drink. Thank u very much",
      "time": 1658140278,
      "translated": false
    },
    {
      "author_name": "Pinto O",
      "author_url": "https://www.google.com/maps/contrib/101762461445483130272/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJkO4lbu2sSVbUodIPC1uWu7g1aUGlMUQJgqX9aBLG-ivizhA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "6 years ago",
      "text": "Received SMS to collect pickup my online order.  Don't remember placing it.  Was in the area so I dropped by.  The guy told me while staring at his pc \"it was a mistake\" -  No eye contact, no apologies.  Was irritated I couldn't respond to him in Mandarin.  Am so not impressed by their \"service\".",
      "time": 1531463941,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=403812808238690009",
  "user_ratings_total": 107,
  "vicinity": "22 Sin Ming Lane, #04-82 Midview City"
}