{
  "formatted_address": "2 Bayfront Ave, #B2 - 89 89A, Singapore 018972",
  "geometry": {
    "location": {
      "lat": 1.2834644,
      "lng": 103.8591559
    },
    "viewport": {
      "northeast": {
        "lat": 1.285147130291502,
        "lng": 103.8610771302915
      },
      "southwest": {
        "lat": 1.282449169708498,
        "lng": 103.8583791697085
      }
    }
  },
  "name": "Angelina",
  "place_id": "ChIJF00CUpgZ2jER8NbMc61ckZ4",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "C",
      "author_url": "https://www.google.com/maps/contrib/110704375820971665962/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV5MtvJVsB1D93gKZxoopOBS-Mqt3yZOtj4VfpMS6GUFR6UfjcBEg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "Had truffle fried, signature hot chocolate, ice-cream. Seated at the open area, can be a bit challenging in getting table at point. Ordered a cake with birthday wishes on it, as we requested for so, they are attentive.",
      "time": 1747032281,
      "translated": false
    },
    {
      "author_name": "Nguyên Nguyễn Ngọc Hà",
      "author_url": "https://www.google.com/maps/contrib/108575296668225029282/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVhaiNNftr5Q6QX5GfO2E2QRBkTqocFeDptYG9fagLAo2IRhw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "The food was decent overall, but nothing particularly remarkable. It met basic expectations in terms of flavor and presentation, but didn’t go beyond that to leave a lasting impression. The dishes were satisfactory, offering a standard dining experience without any standout elements.\n\nOne of the highlights of the restaurant is its unique location — situated along an artificial river inside the Marina Bay Sands shopping mall, it provides a visually interesting and convenient setting for a meal. This central and well-known location makes it easy to find and adds a certain charm to the dining experience.\n\nThe noodle dish, in particular, was fairly enjoyable. It had a pleasant taste and was well-prepared, making it one of the more memorable items on the menu. However, when looking at the overall pricing, it becomes clear that the restaurant leans toward the expensive side. While the convenience and ambiance may help justify the cost for some, the value-for-money aspect may leave others feeling that the prices are somewhat steep for what is ultimately a just-above-average meal.",
      "time": 1744299876,
      "translated": false
    },
    {
      "author_name": "Tan Chun Hao",
      "author_url": "https://www.google.com/maps/contrib/105351387135725543768/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX6CuWgAbgEkQULApU5g5Hv2Wo9lXiN9TH4SNee31rNkBk7Wb-wTw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "great dessert and tea selections.\n\nfruit tart was very meh, but the chocolate tart was unanimously good. especially when you pair it with the chocolate flavoured tea. amazing.\n\nthe tea pots they serve the tea with is extremely hot. be very very careful. it also means your tea will be kept hot for longer.",
      "time": 1742743149,
      "translated": false
    },
    {
      "author_name": "E Lim",
      "author_url": "https://www.google.com/maps/contrib/102941767376783098432/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUcaACyHHWPdfcP3clEWfGpdA4MZrnu4Gyi28iEgmsXc9NiMA3u=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I had an absolutely wonderful experience at Angelina Restaurant in Marina Bay Sands! A huge shoutout to Galvin, the assistant manager, who went above and beyond to assist me with the reservations. His helpfulness and dedication to ensuring a smooth experience were much appreciated. The service at the restaurant was impeccable and prompt,  and the food was nothing short of amazing! The steak was cooked to perfection, and the chocolate cake was a decadent treat. Thank you for making my dining experience unforgettable. I will definitely be back!",
      "time": 1739608678,
      "translated": false
    },
    {
      "author_name": "Raine",
      "author_url": "https://www.google.com/maps/contrib/116044104906500620874/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK-FaD3M5Cnh2Atxjl1zDADchIGdktdwOykx7E-WiJut-qsVw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Always liked their macarons, very yummy. Truffle fries (about 20+ sgd) portion is insane, can feed 4 people, there were 2 of us and we couldn’t finish half, but taste is excellent, double fried to crispy and strong truffle and parmesan aroma. French onion soup was not bad, very buttery and could be saltier imo. All of the savory pieces in the tea set were meh, they were either bland (not enough salt) or lacking in flavour itself and flavour balance. The Angelina tea is a sweet vanilla scented oolong flavour, latte was fine but the art looked like a failed attempt at a heart lol. Their sweet offerings are better.\nIt is pricey tho, it was $155 for the tea set for two, truffle fries and soup.\nAlso, sign up for the mbs rewards card online for free, you get instant rebates credited immediately, great if you buy any food etc in MBS.\nService was great.\nSunlight can feel a little glaring if you sit in the middle because of the glass ceiling.\nSaw one fly on the table, but place looked very clean.",
      "time": 1746790238,
      "translated": false
    }
  ],
  "types": [
    "bakery",
    "restaurant",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11426015629657560816",
  "user_ratings_total": 1161,
  "vicinity": "2 Bayfront Avenue, #B2 - 89 89A"
}