{
  "formatted_address": "Jurong East Street 21, #01-433 Block 214, Singapore 600214",
  "geometry": {
    "location": {
      "lat": 1.3392387,
      "lng": 103.7393925
    },
    "viewport": {
      "northeast": {
        "lat": 1.340699680291502,
        "lng": 103.7407703802915
      },
      "southwest": {
        "lat": 1.338001719708498,
        "lng": 103.7380724197085
      }
    }
  },
  "name": "Anne's Baby And Child Clinic",
  "place_id": "ChIJyST1XRoQ2jER9gH9YdpegwU",
  "rating": 2.9,
  "reviews": [
    {
      "author_name": "Zr3n Zr3n",
      "author_url": "https://www.google.com/maps/contrib/111551263859108617901/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUaYSdXXtCrGIty87CyB1dgCvv28U6QIsGSEXtnSKMqOkdu3_TMag=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "Clinic located beside provision shop & along Padi Mas food court.\nAfter register you can wait at the food court instead,cause waiting time is very long.\nWaited so long in the clinic,despite so many patient already register.\nApprox 1.5-2hrs to see doctor.\nConsultation quite costly too,for only 1 small cough syrup.\nNurse here not helpful either,ask nicely how many patient more will be ignored.",
      "time": 1668492607,
      "translated": false
    },
    {
      "author_name": "Stanly Dani",
      "author_url": "https://www.google.com/maps/contrib/102406451755118643422/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK4tWf1j9ab-02q9hPcLqEL0VG1Ji5GQ6x0vtxQ7iKjzC_Jhg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "We visited the clinic hoping for effective treatment for our child's pain and discomfort. However, to our dismay, we encountered some serious issues that left us deeply concerned. The hygiene standards within the doctor's office were shockingly poor, which, quite ironically, could expose children to more germs, bacteria, and viruses – the very things that cause illnesses in the first place.\n\nMoreover, we were disheartened by the doctors' lacklustre attempts at diagnosing the root cause of our child's ailment. Instead of addressing our concerns, she seemed dismissive and uninterested. This left us feeling puzzled and frustrated. When we tried to discuss this, the doctor's attitude became even more irritable. She even suggested we head to the hospital's emergency department rather than seek her help.\n\nIt was clear to see that compassion was missing from the doctor's demeanour. Patience seemed to be in short supply, and effective communication with us as concerned parents was virtually nonexistent. It was evident that building lasting relationships with clients was not a priority for her. We found her diagnostic process shrouded in mystery, and the staff pressured us into buying medication through aggressive tactics. Their attempts at shaming us if we hesitated to buy the prescribed medicine only deepened our discomfort.\n\nThere was a serious question about the doctor's trustworthiness throughout the ordeal. It was painfully obvious that our child's well-being was not her genuine concern. Our experience at the clinic left us feeling undervalued and dismissed. We really wish that other parents searching for a kind, respectful, and family-focused place to get medical help would look somewhere else because you won't find that here.",
      "time": 1692368395,
      "translated": false
    },
    {
      "author_name": "novita thio",
      "author_url": "https://www.google.com/maps/contrib/102031516772652980533/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIOLNULf9-7D3pZtONUdkNzaj690nj3cqCDLEMwRsunOBjrDg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "At Anne's clinic you will be getting incompetent, money grubbing, uncaring doctor and staff, and unhygienic clinic.\nA highly concerning incident occurred when the doctor requested an early morning urine sample from my child for a prepaid lab test. The doctor stressed the need for quick results, compelling us to submit the sample as soon as the clinic opened the next morning. We complied, believing that the doctor genuinely cared about our child's well-being. However, we were later informed that the clinic had failed to send the sample to the lab due to staff oversight. While they did provide a refund, it raised serious concerns.\nBut I gave them another chance, assuming the initial error was a one-time mistake.\nThe second and final incident occurred this morning. I took my son to the clinic due to a fever, and once again, they prescribed medicines for every symptom. The doctor recommended a blood test at Gleneagles Hospital. Considering the distance, I inquired about alternative labs. The nurse mentioned the Polyclinic but cautioned that their results wouldn't be as prompt. She assured me that Gleneagles could provide results within a day and even offered to assist in tracking them down. Trusting the doctor's concern for my son's well-being, I agreed and promptly went to Gleneagles. After the blood test, I intended to inform the clinic to initiate the result process. However, I was preoccupied with consoling my son, who was understandably distressed by his first blood test, which is much more unsettling than a routine vaccination.\nWhen I eventually reached out to the clinic around 12:33pm, shortly after their closing time, and received no response, I understood the timing and was not overly concerned. Around 2pm, I sent a Google chat to the clinic, hoping it would prompt them to follow up with Gleneagles about the results. With no reply, I decided to trust them and wait for their 6:30pm opening time to inquire about the results. Upon calling at that time, I was astonished to hear the nurse suggest that the lab might already be closed, and that the results might not be available by the next day, which contradicted earlier information. Urging her to contact Gleneagles, I even requested that the doctor be informed of my call.\nDiscussing this with my concerned husband, he promptly contacted the clinic. Interestingly, the nurse held a different stance and claimed the results were already accessible. I awaited the clinic's update. Eventually, Dr. Anne herself called, displaying unexpected annoyance at my inquiry. She emphasized the time of my previous contact via Google chat at 2 pm and highlighted the speed with which the results were already available. She also claimed that despite the blood test result, she had no idea what caused his discomfort. She advised sending my son to the hospital, revealing her lack of insight into his condition and expressing displeasure at my call regarding the results.\nThroughout the call, Dr. Anne repeatedly recommended sending my son to the hospital if I was concerned, and she told me that her staff would provide the blood test results.\nAgreeing, I reminded her to send the results. Unexpectedly, she became visibly angry, asserting that she had already promised to WhatsApp them.\n\nWe seek medical assistance to promptly alleviate our children's pain. If you're unwilling to remain involved once results are available due to incompetence, you shouldn't charge a doctor's fee and prescribe numerous medications prior to an accurate diagnosis. Dr Anne suspected the \"white spots\" on his tonsils were \"food\" but the doctor at the hospital could see his tonsils were swollen and diagnosed it as tonsillitis.\nDuring my last visit, I realized that the clinic is also facing a problem related to their hygiene practices. I noticed a liquid residue on the patient bed, which I initially assumed was drool from the previous baby patient. I brought this to Dr Anne's attention when she requested my son to lie down on the bed. This indicates that no cleaning had been performed after each patient's use of the bed.",
      "time": 1692741502,
      "translated": false
    },
    {
      "author_name": "April",
      "author_url": "https://www.google.com/maps/contrib/114525571610039678434/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJF-RU74qW3cIih4559Ag-7Dz7yJhAbftcfvaS4iueVPbvrCcI=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Dr. Anne is patient and efficient. Her prescribed medicines are always effective with my 2 children. With my 2nd child who were an infant last time, he was prescribed with different medications for his skin rashes with the hospital’s paediatrician and all didn’t work despite the many given medications (creams etc). We had decided to brought him to Dr. Anne for 2nd opinion and we’re delighted that Dr.Anne’s findings was correct and all given medications worked well with my child. All his rashes were gone and healed.\nRecently my 2nd child had cough for 2 weeks+ and suddenly became a wheezing cough, thanks to Dr. Anne again all her given medications worked well after bringing him to her clinic.",
      "time": 1700556636,
      "translated": false
    },
    {
      "author_name": "Kelvin Koh",
      "author_url": "https://www.google.com/maps/contrib/100847334632152370261/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVTVPzQElEIMEX--E0PNYYdyVyqL5ZDjbff6K-VCgp4-fudmheb=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Good place for kids doctor. Patient Anne and friendly staff. Price seems to increase quite substantial.",
      "time": 1681182338,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=397265484178588150",
  "user_ratings_total": 51,
  "vicinity": "Jurong East Street 21, #01-433 Block 214"
}