{
  "formatted_address": "11 E Coast Rd, #01-01 the Odeon, Singapore 428722",
  "geometry": {
    "location": {
      "lat": 1.3043344,
      "lng": 103.9020603
    },
    "viewport": {
      "northeast": {
        "lat": 1.305648130291502,
        "lng": 103.9034026802915
      },
      "southwest": {
        "lat": 1.302950169708498,
        "lng": 103.9007047197085
      }
    }
  },
  "name": "Annie Tiang TCM",
  "place_id": "ChIJ-f__d20Y2jERzYrGfKssDmI",
  "rating": 3.9,
  "reviews": [
    {
      "author_name": "andrea lim",
      "author_url": "https://www.google.com/maps/contrib/105793859247904982846/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKq88BOtABlbpnXZl9dGnIQfSMgS7hjxI-Iuro-6XY3dy9w4g=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Avoid this clinic unless you enjoy being shamed for asking about prices. My mother had a terrible experience here with the unbelievably rude and condescending practitioner, Sharon.\n\nShe went to activate an expired tui na package that her friend had left unused. While speaking to the receptionist about the reactivation fee, Sharon suddenly barged in and rudely demanded in Mandarin, “What does she want?” The receptionist explained that my mom had a strained back and wanted to use the remaining 5 tui na sessions. Sharon, without missing a beat, snapped: “Without a consultation, who are you to say you have a strained back?”\n\nThat is true. My mother agreed to a consultation. But what followed was less of a medical consultation and more of an ego-driven sales pitch designed to make my mother feel utterly ignorant and financially inferior.\n\nSharon declared that tui na wasn’t good and pushed for an acupuncture package costing $XXXX. When my mother (rightfully) commented that it was expensive, Sharon raised her voice and said that my mom was money-minded.\n\nDespite the pushiness, my mom decided to sign up for acupuncture and asked if she could start immediately. But Sharon wasn’t done. She taunted my mother again, saying, “Do you think one acupuncture package is enough? You also need XX tui na sessions for $XXXX.” My mother again noted the high cost, and that’s when Sharon went full God Complex.\n\n“Do you even know who I am? If you truly want to recover, you should never be bothered by cost.” Sharon then dramatically declared, “I AM ANNIE TIANG’S DAUGHTER-IN-LAW, OK?”\n\nOh, forgive us mere mortals! We had no idea we were in the presence of Hua Tuo himself, the grand healer of all ailment, the savior of medicine and gatekeeper of wallet emptying.\n\nIn any normal customer-service setting, it’s completely reasonable to ask about pricing before committing to a package. But apparently, unless you have the bank account of Annie Tiang or her daughter-in-law, you should just hand over your wallet and never question the cost of your care.\n\nNeedless to say, my mom walked out without paying a single cent. And if you believe in transparency, respect, and the simple right to ask how much something costs, do yourself a favor and find another TCM clinic.",
      "time": 1741167854,
      "translated": false
    },
    {
      "author_name": "Palvinderjit S Gill",
      "author_url": "https://www.google.com/maps/contrib/101230927399387892413/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUib_mEVozoUgQk5bMOFUHjKhrBjD5OPiEQRjeaRxeQz8cqsNh4=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I've been going Annie Tiang (TCM) and found it to be a fascinating and holistic approach to health and wellness. TCM emphasizes balance and harmony in the body, using natural herbs, acupuncture, and Cupping I appreciated the focus on preventative care and treating the root cause of ailments rather than just symptoms. The experience was calming and insightful, with practised professionals sharing wisdom passed through generations. While it might not replace conventional medicine for everyone, it offers a valuable complementary perspective. Overall, TCM encourages mindfulness and a deeper connection with one's body.",
      "time": 1735892643,
      "translated": false
    },
    {
      "author_name": "corrine wong",
      "author_url": "https://www.google.com/maps/contrib/114465721395308762486/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUnm_KfECludWRWLJ1eSLdoN75PfOdyW3KlbvYtlSOGHUtnGcU=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Jackie and dr joe takes careful attention each time to assess the current state of the body to adapt the treatment accordingly to address the current needs of the body to treat, improve health and immune system functions.",
      "time": 1737297179,
      "translated": false
    },
    {
      "author_name": "Daisy",
      "author_url": "https://www.google.com/maps/contrib/115872611835574362516/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX4aoOVddPpPxjG-YN4zjpR-jgxZ1xwYaPrI18RPF2ucslEA-c=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "The monthly Tuina  with Jackie at Annie Tiang is very good - always feel so much better after a session with her !",
      "time": 1737887312,
      "translated": false
    },
    {
      "author_name": "Chan",
      "author_url": "https://www.google.com/maps/contrib/101215423860505986332/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW_1qeZim9-mi8YLkaB2wSsOLeuSlO4iaGFlwjHArHTNbu85uGi=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "So grateful that I chanced upon this place before reading the reviews! Its my 2nd visit and honestly its by far the best TCM I gotten! I been to other kind of tcm, but the effects were not as good as this! My therapist really knows what my body needs and did the TCM according to what she felt is importance! The results were instant. She alleviates the stiffness caused by my neck and improve the mobility of my left shoulders. Its not cheap but its definitely worth every single penny! I cant wait for my next session!",
      "time": 1724488054,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7065633980435303117",
  "user_ratings_total": 204,
  "vicinity": "11 East Coast Road, #01-01 the Odeon"
}