{
  "formatted_address": "38 Irrawaddy Road, Mount Elizabeth Novena Specialist Centre, #10-50, Singapore 329563",
  "geometry": {
    "location": {
      "lat": 1.322086,
      "lng": 103.8440906
    },
    "viewport": {
      "northeast": {
        "lat": 1.323438630291502,
        "lng": 103.8456208802915
      },
      "southwest": {
        "lat": 1.320740669708498,
        "lng": 103.8429229197085
      }
    }
  },
  "name": "AP Centre for Joint Reconstruction",
  "place_id": "ChIJkxQZrOAZ2jERwLq1PlI-dS0",
  "rating": 5,
  "reviews": [
    {
      "author_name": "嵐",
      "author_url": "https://www.google.com/maps/contrib/103321336785569515933/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX2dJj4uVwrBLhZA_NTisq9EvkxgsClKK2_sO246n64IyTVEsKmxg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I’m really grateful to Dr. Lai for helping both me and my mom with our fractures.\n\nTwo years ago, I had an ankle fracture, and Dr. Lai was incredibly patient and took great care of me. Thanks to his expertise, I was able to recover within a few months—walking again and starting physiotherapy. Now, I can walk without pain.\n\nLast month, my mom had a bad fall and suffered a serious smith fracture. Since the wait time at the government hospital was quite long, we decided to seek Dr. Lai’s opinion. He explained everything in such detail that my mom felt safe and confident in his care. We proceeded with the surgery under Dr. Lai, and it was a great success.\n\nA special thanks to Judy as well—she went above and beyond to arrange the operating theatre for us, provide quotations, and handle all the paperwork before the surgery.\n\nWe truly appreciate all your hard work! Thank you!",
      "time": 1742787430,
      "translated": false
    },
    {
      "author_name": "Chengfeng Yeo",
      "author_url": "https://www.google.com/maps/contrib/113529024020946607522/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLfVo8t6qsR3iZGvyxxcPmiWljpWHAICzEot6j3ZGjUHlhsyjc=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "3 weeks ago",
      "text": "I was referred to Dr. Lai after I first tore my ACL and was having difficulty walking. From the moment I stepped into the clinic, the experience has been nothing short of wonderful. Judy treated me with such warmth and kindness, making me feel at ease right away. Dr. Lai was incredibly reassuring throughout the process, taking the time to explain everything clearly and performing the necessary procedure with expertise and care.\n\nThanks to their help, I’ve made great progress and can walk again without pain. I’m truly grateful for the hospitality and professionalism shown, and I strongly recommend this clinic to anyone in need of orthopaedic care.",
      "time": 1745460262,
      "translated": false
    },
    {
      "author_name": "Arnold Chiam",
      "author_url": "https://www.google.com/maps/contrib/110852050793163525152/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXR7b81HISQetRzjGeDDj0QUk7xXnWz6G9WnElNj98MkKy9F9Ky=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Dr Lai fixed my right kneel torn ACL, torn meniscus and damaged cartilage. After 8 months from the surgery, I can jog now while still on the recovery journey to regain my right kneel back to its fullest potential. Amazing skills from Dr Lai! Also, thanks to lovely Judy on providing great administrative duties. Thank you Dr Lai and Judy!",
      "time": 1742706996,
      "translated": false
    },
    {
      "author_name": "Aaron Teh",
      "author_url": "https://www.google.com/maps/contrib/103060434841331642809/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKJt_FVnSKRWkQFmUnecs2U6yXjJPshqmmnme60nbFTMvTdwQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I had a great experience at the AP Centre for Joint Reconstruction. Dr. Lai, who performed my surgery, was fantastic. He was clear, reassuring, and attentive throughout the entire process. The surgery went smoothly, and I felt well cared for every step of the way. Judy, the receptionist, was equally amazing. She was friendly and engaging, always making jokes to lighten the mood and help me feel more at ease. Her warmth, humour, and genuine kindness made everything feel easier and much more manageable.",
      "time": 1732528851,
      "translated": false
    },
    {
      "author_name": "dominique yapp",
      "author_url": "https://www.google.com/maps/contrib/114456271926699769980/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXRXofgbT5st3siDtTqWPRQdZ7w-2LhnEHTeQOfLW8dixRVpeu1mQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I bring my wife to consult Dr Lai on her knee pain. As we are working, we are asking for Sat appointment date. The clinical nurse, Ms Judy, is so helpful to find the slot for us even trying till at night to update just in case there is a slot available as she knows my wife is in pain. We appreciate her thoughfulness. Her communication in polite manner and making people feeling good is a plus point as we hear her talking to operator to get the MRI slot. Well done, Judy. And Dr Lai is very patient and calming to reassure my wife that her knee is okay with the right diagnosis and treatment, step by step. We look forward to seeing Dr Lai soon for the upcoming treatment. Thank you Dr Lai and Ms Judy. Appreciate all the help rendered.",
      "time": 1739363383,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3275592826942241472",
  "user_ratings_total": 28,
  "vicinity": "38 Irrawaddy Road, Mount Elizabeth Novena Specialist Centre, #10-50"
}