{
  "formatted_address": "960 Jurong West Street 92, #01-172, Singapore 640960",
  "geometry": {
    "location": {
      "lat": 1.3413854,
      "lng": 103.6914284
    },
    "viewport": {
      "northeast": {
        "lat": 1.342640230291502,
        "lng": 103.6927644802915
      },
      "southwest": {
        "lat": 1.339942269708498,
        "lng": 103.6900665197085
      }
    }
  },
  "name": "Apex Medical Centre Pte Ltd",
  "place_id": "ChIJRz0LZJkP2jERN4tYjdD88WQ",
  "rating": 2.9,
  "reviews": [
    {
      "author_name": "yannicious",
      "author_url": "https://www.google.com/maps/contrib/116755412352717428162/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUpJsJKQPBHnTi1ajbPyKyByPbDuaisVIFDx0HckjGkk0E5qoCz=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "I was told by one of the clinic assistant at 615pm that the doctor would be available at 7pm, with my turn likely around 8-830pm. This is frustrating, as if the clinic had answered my call earlier and issued a queue number, I could have gone home to have dinner, shower, and return on time. Instead, I had no choice but to wait at the clinic, as going home would have been too rushed and risked missing my turn.\n\nI attempted to purchase medication but was met with unhelpful and poorly trained auntie staff who was unable to advise me on suitable options based on my prescription history. The lack of professionalism and competence from the clinic assistants is deeply disappointing.\n\nI have decided not to return to this clinic and will lodge a formal complaint with the MOH and inform the area MP. Patients deserve better service and proper training for clinic staff to avoid such inconveniences.",
      "time": 1739274051,
      "translated": false
    },
    {
      "author_name": "P S Ang",
      "author_url": "https://www.google.com/maps/contrib/101513515216786900600/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLlshsP5AYskB6pAp0sZ9w50FXeHGmFn04ftXpacqlGkdUiwg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "do not be in healthcare industry if you lack basic empathy. Counter staff in her 30s were extremely rude, shouted at my elderly grandma. We spend money to see doctor because we are ill, not to be scolded. Come at your own risk.",
      "time": 1743504393,
      "translated": false
    },
    {
      "author_name": "Irene D",
      "author_url": "https://www.google.com/maps/contrib/105755199362573534660/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXfZxZeSfJkedANEZkYcQ1cbnlcon3AYvWOmjLR-Z1XY-kEOs50iQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "7 months ago",
      "text": "If you’re looking for poor diagnosis, wasted time, and rude customer service, this clinic is the place to go.\n\nI had the unfortunate experience of visiting this clinic twice in 2024, both times being consulted by Dr. Goh.\n\n1.\tAugust 2024 – I sprained my thumb, and the pain extended to my wrist. I explained that I couldn’t move my thumb, and my wrist was in significant pain. Dr. Goh briefly examined my wrist and simply stated that it was sprained. He prescribed ointment, but the pain worsened over the next week. I later visited a polyclinic where the doctor provided a more thorough assessment, diagnosing a nerve injury in my wrist that required a steroid injection. After being referred to a hospital and receiving the injection, I recovered fully within three days.\n\n2.\tSeptember 2024 – I experienced heavy menstrual bleeding for two weeks. Dr. Goh advised me to take Norethisterone for 20 days to stop the flow. When I asked if it was necessary to take it for so many days, he insisted it was. He also added that I should take high blood pressure pills, despite me telling him I don’t have high blood pressure. He tested my blood pressure three times and insisted it was abnormal. I explained that I’ve had low blood pressure most of my life and that the elevated reading might be due to panic after bleeding excessively. He refused to reconsider, claiming that high blood pressure pills would reduce the bleeding. When I tested my blood pressure at home, it was normal.\n\n3.\tPatient Privacy Concerns – There’s absolutely no regard for patient privacy in this clinic. Two of the counter staff (packing medication and collecting payments) are respectful, speaking softly when dealing with patients’ personal information. However, the two seated behind the counter never get up and instead shout out patients’ full names, NRIC numbers, house addresses, and phone numbers for everyone to hear. During both of my visits, I witnessed them shouting at elderly patients. On one occasion, an elderly man mentioned it was his first time at the clinic, and the staff loudly responded, “Why must you come here?” I also saw a middle-aged woman buying medication without her physical NRIC. Instead of proper verification, the seated staff simply asked her to recite her NRIC number and proceeded to sell the medication. Isn’t this dangerous? Why isn’t there a proper process in place? People come to the clinic unwell – the least they deserve is respectful treatment.",
      "time": 1727885910,
      "translated": false
    },
    {
      "author_name": "faustina koh",
      "author_url": "https://www.google.com/maps/contrib/115314996523453056959/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIY7PVHmR16-jTupO_DWKgWdbdUz9cnAkv_xuckf_I0pvlAQA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "10 months ago",
      "text": "Suspected dengue last monday but dr goh dismissed me and refused to address it. Prescribed me antibiotics which to i had an adverse reaction to - stomach was in intense pain. Had to go back to dr tay last wed to get meds for my stomach.. went to poly clinic on saturday due to rashes appearing. It has been a week and not surprised that it turned out i had dengue. Dr Goh not only diagnoised me incorrectly.. he even prescribed me meds that i didn't need which caused a whole new issue.. disappointing",
      "time": 1719816494,
      "translated": false
    },
    {
      "author_name": "Alibaba 748",
      "author_url": "https://www.google.com/maps/contrib/109851880927580739823/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKxEzNyphPzY4xIU22A4h6FGvzF60Cv82WrdilmikrIrP8SAw=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "11 months ago",
      "text": "Went to Dr Goh a few days ago and I suspected that I had gotten phytophotodermatitis from googling online but the doctor said its not. So i went to National Skin Centre just for the doctor to confirm that it's indeed phytophotodermatitis LOL",
      "time": 1717515028,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7273872845834849079",
  "user_ratings_total": 32,
  "vicinity": "960 Jurong West Street 92, #01-172"
}