{
  "formatted_address": "72A Amoy St, Singapore 069891",
  "geometry": {
    "location": {
      "lat": 1.2803132,
      "lng": 103.846719
    },
    "viewport": {
      "northeast": {
        "lat": 1.281630130291502,
        "lng": 103.8481013802915
      },
      "southwest": {
        "lat": 1.278932169708498,
        "lng": 103.8454034197085
      }
    }
  },
  "name": "Appetite",
  "place_id": "ChIJZdzbqc0Z2jERGUPkHoY19KE",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Keira Herr",
      "author_url": "https://www.google.com/maps/contrib/104296358644721010701/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIgWqRcIWYSJ27amJuCh13PvMw70eV2aKgT4EuNgOAMrWApTQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Very intimate setting, 8-10 seats around an open kitchen.\n\nVery interesting plates, all female chefs, pretty plating\n\nTaste wise, some dishes did better than others. The corn custard with uni was delicious, the sweet hokkaido corn complementing the fresh brininess of the uni. The kanpachi crudo was visually stunning and very fresh and fun as well.\n\nThe wagyu toast was a little disappointing - the beef was served somewhat as a tartare and the taste was quite bland. The chicken liver parfait toast was good in taste but too much bread to parfait ratio.\n\nThe jamon pecorino was a little soggy, and could use with perhaps some oil to bind the jamon with the wet tomatoes.\n\nThe turbot was cooked beautifully.\n\nI like that there is a changing experimental menu, and that it was all female chefs. Service was very good.",
      "time": 1744812188,
      "translated": false
    },
    {
      "author_name": "Kelvin Lim",
      "author_url": "https://www.google.com/maps/contrib/113058853777067306846/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLDnbtasvQdSYgDjclZiuIhX0SuV7U9xUfcniaNdwMdmAnOgQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "5 months ago",
      "text": "I visited in May with my friend to celebrate his birthday. It was part of a day-long food experience and the rave reviews convinced me that it would be a fitting end.\n\nThe experience started off strong with great service, introducing the menu and all that entails. We decided against the Chef's Choice Menu since we weren't that hungry, and that marked the significant decline in service standards. It was almost as if we were recognised that we wouldn't be spending the full sum recommended, and thus weren't worth the time and attention compared with other customers.\n\nGetting attention was a bit of a pain and asking to serve the pre-ordered birthday cake seemed like I was troubling the staff. The other guests who ordered the Chef's menu were taken around the restaurant while I felt like we had become invisible. We left quietly after payment.\n\nThis was contrasted with the flawless and warmth service we experienced at Ginger.Lily (Hilton Hotel) during our high tea.\n\nTo be clear, no one was outright rude to us but the differing service delivered was disappointing. As an establishment associated with Nouri, there is a lot more way to progress if it intends to thrive in cutthroat F&B industry in Singapore.",
      "time": 1733305009,
      "translated": false
    },
    {
      "author_name": "Elaine Neo (梁雁婷)",
      "author_url": "https://www.google.com/maps/contrib/101260680686655265157/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVmGs-tzVMK5ETi5d0w8HJzOeL9tmS8n57E9M6QB36Hy-QXUERdQQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Appetite is where Wine, Vinyl, and Vibes Collide. It feels like your cool friend’s living room—if your cool friend had impeccable taste in wine, a killer vinyl collection, and amazing living room. The wine flows, the music spins, and suddenly you’re wondering why your own living room doesn’t feel this good. Cozy, stylish, and just the right level of laid-back, it’s the kind of place that makes you want to stay long after your glass is empty.",
      "time": 1734435310,
      "translated": false
    },
    {
      "author_name": "Avijeet Sen",
      "author_url": "https://www.google.com/maps/contrib/117541567004086369769/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU2O-Ka2qb-gc-yeDiMN99jHPTtgbAMroDxss7J3Zu7wwUmlKob=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Visited in Oct 2024\n\nThis is a really fantastic 10-12 seater restaurant with a good mix of small plates (tapas type) courses and a few main courses in its menu. There’s an a-la-carte menu as well as a Chef’s Tasting menu. I went with the latter which comprised 8 courses in total.\n\nAmong the 3 starting courses, my favourite was the foie gras & chicken liver parfait (which is one of their signature dishes). The Hokkaido corn custard starter course was also quite good. The main course of the pork belly was another of my favourites in the meal.\n\nFor drinks I tried the Mezcal Grapefruit Negroni which was a very interesting twist on the Negroni. Would recommend Negroni lovers to try it.\n\nService was really good and you are constantly attended to throughout your meal. The restaurant also was able to cater to my allergies by removing certain ingredients from a couple of courses.\n\nOverall, Appetite is a fantastic place to dine at and I would strongly recommend a visit.",
      "time": 1730451814,
      "translated": false
    },
    {
      "author_name": "Stephanie Wong",
      "author_url": "https://www.google.com/maps/contrib/102299102225370126629/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV-Z0u8ahL_vENAlzwlativ2FLAXAlwQY4AThMbeXO5XzaMbx7rCQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Recently had dinner at this refined yet casual restaurant and it was one of the best meals I've had here. The dishes were incredibly refreshing, showcasing a perfect balance of creativity and flavors. Plus, the listening room upstairs offers a cozy ambiance where you can enjoy drinks while listening to vinyls, adding to the overall charm of the experience. Highly recommend for a memorable dining experience!",
      "time": 1710090416,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "art_gallery",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11670011384583963417",
  "user_ratings_total": 114,
  "vicinity": "72A Amoy Street"
}