{
  "formatted_address": "1 Fusionopolis Place Level #03-20, West, Lobby Galaxis, Singapore 138522",
  "geometry": {
    "location": {
      "lat": 1.2999093,
      "lng": 103.7882901
    },
    "viewport": {
      "northeast": {
        "lat": 1.301531780291502,
        "lng": 103.7896821802915
      },
      "southwest": {
        "lat": 1.298833819708498,
        "lng": 103.7869842197085
      }
    }
  },
  "name": "Applied Metaphysics",
  "place_id": "ChIJ48rPzVcb2jERPGJXTvv68lc",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "ivie low",
      "author_url": "https://www.google.com/maps/contrib/109826999618452279109/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJbdlZTRlrDrHj_VUwYwwa9JDI-3lmszlJ5Mh7xzgcIu4xRxw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "In October 2023, I learned about this community from a stranger. Initially, I went to see the teacher with a mixture of skepticism and curiosity.\n\nWhen I met teacher John, I was not only struggling with my mental and physical health but also dealing with long-term anxiety due to business worries. I was overweight and bloated, and the aftermath of COVID left me with a persistent cough and hoarse voice. These problems had caused me to lose confidence and gradually distance myself from friends over the past few years.\n\nThrough the teacher's natural therapies, all these issues were resolved. In just four months, I lost 10 kg so far and I have regained my confidence and self-esteem.\nMy gratitude to teacher John and the whole community support to make a stronger person and highly recommended this community to everyone.",
      "time": 1720860625,
      "translated": false
    },
    {
      "author_name": "Pauline Tjoa",
      "author_url": "https://www.google.com/maps/contrib/116249649723270377781/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLYo3QSvXrYIEwaZcZww_1imXhqX1xr7lN1iR3YP_w4ADloew=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "John Wong is the kind of teacher I had been seeking for and fortunately, the master appeared 5 years ago when we were so ready to learn. Our family are forever grateful as John shown us the path of living healthy, natural life style, sustainable living and constant learning to be mindful of our environment, to protect the planet.\nJohn, your keen intuitive to tap into our inner strength and ability to shine is incredible. You share your deep knowledge generously, your dedication, commitment and readily available to answer any difficult questions in such a simple understanding have made the learning process an enjoyable life long love of learning indeed. On behalf of my family, we sincerely blessed to know you and I can only say to everyone I meet, if you want to know a good healthy life, John Wong is the guru to learn from. Thank you and love you my dear life guru.......",
      "time": 1642049797,
      "translated": false
    },
    {
      "author_name": "Carina Chan",
      "author_url": "https://www.google.com/maps/contrib/114547440837297435756/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJU9iDR7Kw2f1FH5ZEs6Vpq9qVX2Q6xAhlN75hQ2jcdxSacqw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I am recovered from my eczema after consulted  with John, and also learnt a lot ancient knowledges from applied methaphysics during my healing journey, thanks for always sharing ancient and NOWaday world wide information to broader my eyesight.\n\nRecommend to everyone if you are wish to embark in your natural path with genuine guidances.",
      "time": 1705372429,
      "translated": false
    },
    {
      "author_name": "Sameer Dulhot khan",
      "author_url": "https://www.google.com/maps/contrib/102029590572384777304/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWhv2vVsZyLNlkF-wj5vu_O9znpFBqWzM1yqrvdQsFjbLwqnsY=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "Sar my account unban please help me and hack sorry🙏😞😭",
      "time": 1735967541,
      "translated": false
    },
    {
      "author_name": "Eve Chong",
      "author_url": "https://www.google.com/maps/contrib/113039611804046408344/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJOdduH7WBcYYAhEDog765uz4ejClxMBuLQozwQZTDjaRuABQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Lessons conducted, whether online or in-person, has helped me to understand how to use the oils in a useful way in terms of its quality and quantity. John has the wisdom to put the oils together for the study in the improvement of physical and emotional health. The ecology of natural earth is also an important element in the human survival. How it affects the sea and the soil environment affects the end product - the plants and sea animals. These are crucial survival, and the end result is the production of the quality of oils and the continued existence of the sea animals and its in the ocean. The sea animals should not be made to suffer because of our oblivious negligence.We are what we eat and use. The intake of toxins poison us, the natural food intake build strong tissues in us as we \"eat clean and use clean\". John's lessons have led me into this knowledge.",
      "time": 1642167151,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6337403582921794108",
  "user_ratings_total": 96,
  "vicinity": "1 Fusionopolis Place Level #03-20, West, Lobby Galaxis"
}