{
  "formatted_address": "585 Bedok Reservoir Rd, Singapore 470704",
  "geometry": {
    "location": {
      "lat": 1.3383267,
      "lng": 103.9195561
    },
    "viewport": {
      "northeast": {
        "lat": 1.339690730291502,
        "lng": 103.9211722302915
      },
      "southwest": {
        "lat": 1.336992769708498,
        "lng": 103.9184742697085
      }
    }
  },
  "name": "Archipelago",
  "place_id": "ChIJg2bngFk92jERgUyLtkvBQ74",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Wayne Ong",
      "author_url": "https://www.google.com/maps/contrib/103030108443975173296/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKiHwh9oyMKMHSLDLJ9dHLzs3Li_4aQHr7bz8g_2tWV6h-Zew=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Very arrogant security guard, was doing food delivery  as per allocated from tamp to bedok.\n\nWe are not allow to park our bike within the area. The security guard dont even bother to talk nicely just shouted at me.\n\nAfter finished delivery also no tips from customer. Low class and cheapskate. Worst than normal citizen",
      "time": 1740840227,
      "translated": false
    },
    {
      "author_name": "XH G",
      "author_url": "https://www.google.com/maps/contrib/112651390120066570148/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLsuef8q7_AmsBUHNA1ViTeaKiWj7QwxA_FNteeJ-Y-XqRArg=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "a week ago",
      "text": "For any potential buyers or tenants, just be aware the intercom system at Archipelago doesn’t allow control of access via external apps (something the agents don’t even tell you!). Which means you won’t be able to accept deliveries when no one is home (think receipt of online deliveries).. Abit shocking given this is basic requirement of a condo but it was apparently rejected at their AGMs… otherwise a nice condo with good facilities. Very strict security…",
      "time": 1746967787,
      "translated": false
    },
    {
      "author_name": "Laven Loo PropNex",
      "author_url": "https://www.google.com/maps/contrib/107726440411329069223/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUYsnGAsGUr29pBljqkXC2nqWAoUg-zTPGXRyKfnYfrmDTfowpfBA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "3 years ago",
      "text": "Resort living. The allure of landscape greenery and vacation-style facilities account for most owner occupying or even tenants who are willing to pay for premium to rent .. it’s really beautiful. Completely different vibes as compared to most of the condos I have ever visited in the East! What I love about this condo is the greenery, most units ensure greenery privacy views. The facade of the units facing the road or greenery portrays a completely different design which is seldom seen in Singapore. Pet friendly owners would definitely love this place more as there is ample space for pet strolling. Not forgetting the pool, which gives two different kinds of feelings either within the greenery or under the sky. The quality of the furnishings ensure premium and the layout is decent. Definitely one of the development I would shortlist for my future home purchase if I’m looking for EAST!",
      "time": 1649176710,
      "translated": false
    },
    {
      "author_name": "Yee Wei Ng",
      "author_url": "https://www.google.com/maps/contrib/116810088498904447439/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIbx_iwXw6rFhETuc-qd8CVVqh4wP219CMl5qZdMQ-iDAOKQ6w=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "3 years ago",
      "text": "Massive land size, nice low rise low density resort feel. Landscaping and pools very well done, though maintenance is perhaps needing a little further attention.\n\nGood mix of units, but some facing the road can be noisy. The greenery facing units are lovely. Short walk to amenities, transport links and eateries.\n\nOne gripe is that it doesn't have a proper drop off lobby area- drop off is all within the basement car park, which takes away some of the allure of the otherwise very nice development.",
      "time": 1623053507,
      "translated": false
    },
    {
      "author_name": "Ferdi",
      "author_url": "https://www.google.com/maps/contrib/101089507334323086805/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUZLkxEsZk_sj6GJNZAImMLvuuLj5qUlZJ3o_AJNFHwPHchDofgvA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Bedok Reservoir is a bit understated compared to some other areas in the East, but it does offer plenty.\nArchipelago in particular is a really nice development to live in (been here for 6.5yrs & counting). The condo has direct access to the Reservoir through its private back gate, though going from the main gate is just 5 mins walk. Literally nature at your doorstep.\n\nThere's a lot of facilities within the condo: a few swimming pools (yes, a few of them), jacuzzi, gym, clubhouse, bbq pit, to name a few. The condo is very green, strolling around is almost like walking in a park (plus you get to hear the birds occassionally from the reservoir).\n\nThere are 24/7 Sheng Shiong & Fair Price just next door, a Guardian, McDonald's, 7-11 and a number of convenience stores, bakeries, barber & hair saloons, etc. The popular Refuel cafe, Reiwa Soba, Scoop are just a few hipster names around the corner.\nIt's a 20-30min drive from the city, and it's not far from the PIE exit. Changi Airport & Jewel are just a short 15-min drive.\nThe Bedok North Downtown line station is just a 10-min walk.\nFor car owners, majority of the car workshops can be found in Ubi.\nWith Red Swastika & many other good schools around, Bedok Reservoir really has a lot to offer.",
      "time": 1692113739,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13710014221575212161",
  "user_ratings_total": 231,
  "vicinity": "585 Bedok Reservoir Road"
}