{
  "formatted_address": "820 Thomson Rd, #01-03 Medical Centre A, Singapore 574623",
  "geometry": {
    "location": {
      "lat": 1.3416368,
      "lng": 103.8372638
    },
    "viewport": {
      "northeast": {
        "lat": 1.342935380291502,
        "lng": 103.8386234802915
      },
      "southwest": {
        "lat": 1.340237419708498,
        "lng": 103.8359255197085
      }
    }
  },
  "name": "Argent Plastic Surgery",
  "place_id": "ChIJKfNpYqcX2jERPBQeQObZaeI",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Arti Gupta",
      "author_url": "https://www.google.com/maps/contrib/104649598835006286015/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJaLFB2pTX0MBDdwdfXKBX6-xvnn32nnRkZ1s9rSPHA0rWwsw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Dr Lee is a very nice person. She is a professional who takes pride in her work and puts in 100% dedication to it. Dr Lee is very patient and answers all the questions a patient has before and after surgery. Katherine is an amazing lady too. Very helpful and always ready to answer any questions we have for her. My journey with them has been nothing but a breeze. Post op, it was a painless experience because thats how well the work was done. Kudos to you both and thank you for everything!",
      "time": 1745894907,
      "translated": false
    },
    {
      "author_name": "Chevelle Chin",
      "author_url": "https://www.google.com/maps/contrib/113893195218829087454/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXC7eHhPbcHLHtAGCQq32mppJTH6qCFQabmqpFtJrasL9vbURlR=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Chanced upon this clinic on Instagram and decided to make an appt for consultation. The initial stage was a pleasant experience. Dr Lee is very patient and explained everything in detailed. She walked me through the entire surgical procedure and manage my expectations. I felt very comfortable from the start to finish. When in doubt, I can just contact the clinic via WhatsApp and they always respond very quickly.\n\nAfter the procedure was done, Dr. Lee assured me that everything went well. The recovery process was smooth and the transformation exceeded my expectations.\n\nWhen I was back to the clinic for my follow-up visit, Dr Lee and Katherine continued to make me feel well taken care of, which I feel very thankful and appreciated 🥰",
      "time": 1745814964,
      "translated": false
    },
    {
      "author_name": "Jin Wei Poh",
      "author_url": "https://www.google.com/maps/contrib/108106991149520562977/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK21Gh88vydM8xlqirHY2dVLiCW498cGNzpU2uZb-GTo3lefXU=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Dr. Lee is an incredible paediatric plastic surgeon, and we are so grateful for her care and expertise. Our toddler recently had a fall that required stitches, and as parents, we were naturally anxious about the procedure—especially with general anaesthesia involved. However, Dr. Lee was very reassuring, patient, and professional throughout the entire process.\n\nShe took the time to address our concerns, ensuring we felt at ease before proceeding. Her attentiveness before, during, and after the procedure was truly commendable. When it was time for the stitches to be removed, she handled it with speed and precision, even as our son protested.\n\nShe works very well with her team and they are very experienced in handling kids.\n\nWe deeply appreciate her skill, kindness, and dedication. Thank you Dr. Lee and team for taking such great care of our little one!",
      "time": 1739791994,
      "translated": false
    },
    {
      "author_name": "Delanie Wong",
      "author_url": "https://www.google.com/maps/contrib/110109412395671558108/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWqs3HsuwFbXucL4UHSRp-iCRXGPAV7_yj6peeRWME3C4qYStha=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Was recommended Dr Lee Hanjing from our doctor as my son got into a serious accident and required surgery. We were in A&E and I was heavily pregnant and very anxious.. when we met Dr Lee, she was extremely calm and professional. She explained to us in detail how the surgery would go and what we can expect. Truly appreciated her gentle yet professional approach which made us feel very reassured. Indeed the surgery went well, the stitches were extremely well done and recovery went as expected. She is very experienced and has a way with young kids that makes them feel safe. Our follow up visits were also so pleasant. Her staff Katherine was also very attentive to us. Would definitely go to her without hesitation if I need a Dr in this field again.",
      "time": 1738985859,
      "translated": false
    },
    {
      "author_name": "Sharon Tay",
      "author_url": "https://www.google.com/maps/contrib/109750256979246795836/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI1rBJa4kpEsgUvRC0V4ZwSmXMX7a4LSRFOyfEnPYerS087nw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "I have a superb experience with Argent Plastic Surgery. I removed excess skin below my eyebrow to lift my droopy and heavy  eyelids. What impressed me the most was Dr Lee Hanjing’s stitching. She was so skillful that the recovery process was a breeze.\n\nWithin 4 days, most swelling has reduced and by 7 days when the stitches were removed, I was 70% back to normal.\n\nDuring this journey, Dr Lee and team were always there to ensure that I was comfortable. There was minimal pain.\n\nI would like to thank Dr Lee and team for the great experience. In hindsight, I would have done this procedure earlier if I know that the process is so hassle free.",
      "time": 1745634451,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16314810708067750972",
  "user_ratings_total": 101,
  "vicinity": "820 Thomson Road, #01-03 Medical Centre A"
}