{
  "formatted_address": "BLK 866A Tampines Street 83, #02-01, Singapore 521866",
  "geometry": {
    "location": {
      "lat": 1.3553724,
      "lng": 103.9344296
    },
    "viewport": {
      "northeast": {
        "lat": 1.356636280291502,
        "lng": 103.9357343302915
      },
      "southwest": {
        "lat": 1.353938319708498,
        "lng": 103.9330363697085
      }
    }
  },
  "name": "Artemis Preskool @ Tampines",
  "place_id": "ChIJv9QtGCg92jERj7Sc5Ei5ssw",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Shir Nee Yap",
      "author_url": "https://www.google.com/maps/contrib/101151232282429053553/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocILDwJ2bkeYdVWdSsnskcNgRn5ZknF2Ak11FVL-nKHrKDUH6g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "My child has flourished socially and developmentally during her time at Artemis Preschool Tampines. Over the past few years, I’ve witnessed her grow into a more confident and socially adept individual, thanks to the nurturing environment and dedicated educators. The school’s holistic approach to learning and its emphasis on fostering social skills have truly made a positive impact. I’m grateful for the supportive community at Artemis and highly recommend it to other parents seeking quality early childhood education.",
      "time": 1734449504,
      "translated": false
    },
    {
      "author_name": "Rahul Rastogi",
      "author_url": "https://www.google.com/maps/contrib/111619510218208207142/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKcjZJreB5g7ZesIPPJtL7KZ-gVV3QN2o5-67mzmzjvW3Mzq-A=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "Artemis Preskool @ Tampines is located at 866A, Tampines Street 83, within the Tampines Central Community Complex. The preschool operates from Monday to Friday, 7:00 AM to 7:00 PM, and on Saturdays from 7:00 AM to 2:00 PM. They offer various programs including Playgroup (18 months to 2 years old), Pre-Nursery (3 years old), Nursery (4 years old), Kindergarten 1 (5 years old), and Kindergarten 2 (6 years old).\n\nThe center serves food with no pork, lard, or beef, though it lacks certification from MUIS. It is not an anchor or partner operator and has not received the Healthy Pre-school Accreditation or SPARK Accreditation. Transportation services are not provided.\n\nFor fees, the full-day infant care costs around $1400, and the full-day child care for children from 18 months to almost 7 years old costs about $809 per month.",
      "time": 1719983591,
      "translated": false
    },
    {
      "author_name": "Nur Hidayah",
      "author_url": "https://www.google.com/maps/contrib/113921294140106406615/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWd0l7753pJSP0aRQQ_VtfHh2UtDRVYgbbAjXfrpVoHqmMaFPVR=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I am grateful for the wonderful graduation concert at Artemis Preskool. The school's commitment to a safe and stimulating environment, engaging curriculum, and emphasis on holistic development has positively impacted my child. The dedicated and kind staffs, along with open communication, instills confidence in parents. The sense of community among parents and the school's involvement in events like the concert create a nurturing environment. Overall, Artemis Preskool's focus on education, emotional well-being, and community involvement makes it an exceptional choice for early learning, and I feel fortunate to have my children enrolled in such a supportive environment.",
      "time": 1701244908,
      "translated": false
    },
    {
      "author_name": "Shi Jing Chee",
      "author_url": "https://www.google.com/maps/contrib/107305316644227846200/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKA45KV2cMVwNLKrCSbM3J81JJEnFit6MzH2tOZUdIlKNhOjg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I am delighted to share my positive experience with Artemis Preskool, where my child has been enrolled for the past 3 years. From the moment we walked through the doors, we were impressed by the warm and welcoming atmosphere. The staff members are not only highly qualified professionals but also compassionate individuals who genuinely care about the well-being and development of each child under their care.\n\nOne of the standout features of Artemis Preskool is their commitment to providing a safe and nurturing environment. The facility is meticulously maintained, with ample space for children to explore, learn, and play. Security measures are in place to ensure the safety of all children, giving parents peace of mind knowing their little ones are in good hands.\n\nFurthermore, the educational programs at Artemis Preskool are exemplary. The curriculum is thoughtfully designed to promote holistic development, encompassing cognitive, social, emotional, and physical growth. Through a combination of structured activities and free play, children are encouraged to learn and discover at their own pace, fostering independence and a love for learning.\n\nThe staff members at Artemis Preskool are not only educators but also mentors and role models for the children. They create a supportive and inclusive environment where every child feels valued and respected. Communication with parents is excellent, with regular updates on their child's progress and opportunities for parent-teacher collaboration.\n\nAdditionally, the nutritional standards at Artemis Preskool are commendable. Meals and snacks provided are nutritious and balanced, accommodating various dietary needs and preferences. This ensures that children receive the fuel they need to thrive throughout the day.\n\nIn conclusion, I wholeheartedly recommend Artemis Preskool to any parent seeking high-quality childcare services. The dedication of the staff, the emphasis on safety and security, the enriching educational programs, and the focus on holistic development make it an exceptional choice for families. My experience with Artemis Preskool has been overwhelmingly positive, and I am grateful for the positive impact they have had on my child's early years.",
      "time": 1707278213,
      "translated": false
    },
    {
      "author_name": "Alson Tan",
      "author_url": "https://www.google.com/maps/contrib/104238015474896882383/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIDLWD__giyM4hVCZAhexqCQ46F_jAxJCt4eJd0jT3mDPrbuQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My child attended Artemis since he was 7 months old until he was 2.5 years. With a heavy heart, we transferred him to a nearby school for practical reasons. We had a great experience with Artemis.\n\nWe thank teachers Erika, Santa, and He laoshi for being such caring and loving teachers. They were patient, kind, and took so much pride in helping my kid grow. From events such as learning his first steps, we can tell from the videos they sent, of their enthusiasm and joy in helping my little one learn and grow. My wife and I can't thank or appreciate them enough.\n\nWhile some very occasional admin hiccups were noted, we're glad the admin team worked with us to sort it out.",
      "time": 1711536825,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14750055452316054671",
  "user_ratings_total": 10,
  "vicinity": "BLK 866A Tampines Street 83, #02-01"
}