{
  "formatted_address": "6 Napier Rd, #09-19 Gleneagles Medical Centre, Singapore 258499",
  "geometry": {
    "location": {
      "lat": 1.307022,
      "lng": 103.8200232
    },
    "viewport": {
      "northeast": {
        "lat": 1.308183930291502,
        "lng": 103.8213275302915
      },
      "southwest": {
        "lat": 1.305485969708498,
        "lng": 103.8186295697085
      }
    }
  },
  "name": "Arthur Tseng Women's Health Services - Singapore Urogynae",
  "place_id": "ChIJnV36PiAa2jERPTMO1cZvH2g",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "bc goh",
      "author_url": "https://www.google.com/maps/contrib/118346294907630261102/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVGihVDgczxVtbATrjwt6FHjiEAYTpHRJjpiOkiLUOBA0NvhW4=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Since I found myself needing gynaecological medical attention in late 2015, Dr Tseng has been managing my issues, which included surgical procedures. I am thankful for the happenstance of having him as my GYN. He is attentive and a wonderful listener who is thorough and purposeful with his questions. He is also clear and detailed with his answers, explanations and advice. Dr Tseng's care and concern for his patients extends beyond the consultation room into the operating theatre,  assembling a team that ensures comprehensive support during and after procedures.",
      "time": 1743428994,
      "translated": false
    },
    {
      "author_name": "Emma",
      "author_url": "https://www.google.com/maps/contrib/116539983409678813053/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXINxRiRH6iQyPukaeQJS23p4oawIpTiDzHLNvZVulGw7d1i2A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "I am so grateful to Dr Tseng for his expert help. My experience at his clinic has been fantastic.\nI feel he really takes the time to listen and takes great care of you.\nI have seen many Drs for my pain, and Dr Tseng got to the root of my issue very quickly. He has a holistic approach and gave me loads of advice for prevention also.\nHis team are kind, caring and efficient and I always feel at ease in the clinic. I highly recommend.\nThank you so much!",
      "time": 1727166753,
      "translated": false
    },
    {
      "author_name": "Alyta Widiana",
      "author_url": "https://www.google.com/maps/contrib/109257929718076305679/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXbqRnSA3oFcBvrj3uzkrbzm_Cv9yRWDRjDulJij6AKOWColesT=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "I had an outstanding experience at Dr. Tseng’s clinic. From the moment I walked in, I was greeted by the warm, sweet and kind clinic staff who were not only welcoming but also extremely knowledgeable. They made sure I felt comfortable and informed at every step of the process.\n\nDr. Tseng is an exceptionally thorough and detailed doctor. His calm and reassuring demeanor immediately put me at ease during my visit. He took the time to listen to all my concerns and carefully explained and checked everything. I never felt rushed, and his thoughtful approach made me feel confident that I was in the best hands.\n\nOverall, the service at this clinic is truly top-notch, and I highly recommend Dr. Tseng and his team to anyone seeking quality healthcare.",
      "time": 1724070023,
      "translated": false
    },
    {
      "author_name": "CHIO Lyn",
      "author_url": "https://www.google.com/maps/contrib/115064426826217346305/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLvA8gPxCz4vfbCdSU6uhlCRj6O01gQbGIA9AeYOLOkBjU71w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "I have been a long time patient of Dr Tseng who provided me excellent pre- and post-natal care, in the delivery of my 2 children. He continues to care for me in terms of women’s health issues. He is very knowledgeable, trustworthy and has excellent bedside manners and good hands. Rati, who assists him, is also very experienced, puts patients at ease and will go the extra mile for patients. I am very appreciative of their care and concern for me. Highly recommended!",
      "time": 1721631722,
      "translated": false
    },
    {
      "author_name": "Chew Qianhui",
      "author_url": "https://www.google.com/maps/contrib/104789740992216675588/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW2ZMxV_CBVl1nwmMaqSJ1Xu_z77s6c-ZCJUXQ-i3mT9s-WLLPL=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "I have been under the care of Dr Arthur Tseng for many years to manage my health. From the beginning, Dr Tseng took all my concerns seriously and explained my blood work with me line by line. He has never been dismissive with any of my concerns and genuinely cares about his patient's health.  He is warm and caring and makes me feel safe.\n\nI believe that due to regular checkups with Dr Tseng, I had no issues in getting pregnant. Dr Tseng became my obstetrician and my pregnancy was smooth despite having some complications. My delivery was comfortable and I had a very speedy recovery. My C section wound has healed beautifully and my baby is healthy and now 3 months old :)\n\nDr Tseng's assistant Rati is a lovely and has the kindest soul. She  truly cares for Dr Tseng's patients, and always make me feel safe despite being in a such a medical and personal setting. She is responsible and professional in managing the clinic as well!\n\nDr Tseng is an expert in his field and a skillful surgeon. You will definitely be in good hands with Dr Tseng & his team.",
      "time": 1721804348,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7502838403991221053",
  "user_ratings_total": 14,
  "vicinity": "6 Napier Road, #09-19 Gleneagles Medical Centre"
}