{
  "formatted_address": "275 Thomson Rd, #01-37 Novena Regency, Singapore 307645",
  "geometry": {
    "location": {
      "lat": 1.32125,
      "lng": 103.8416022
    },
    "viewport": {
      "northeast": {
        "lat": 1.322650880291502,
        "lng": 103.8430738302915
      },
      "southwest": {
        "lat": 1.319952919708498,
        "lng": 103.8403758697085
      }
    }
  },
  "name": "Artists Music Studio",
  "place_id": "ChIJt3sF9JsZ2jERweZiwIOGmsY",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Agnes Suwandi",
      "author_url": "https://www.google.com/maps/contrib/108799999122703203703/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIwUUUUckx2LGxjUuWw65H7TtylZlj4QiK3Syi7VqhaMI9zEQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "Ariel’s musical journey with teacher Laurence started 3 years ago and it had been nothing short of remarkable. I particularly appreciate teacher laurence’s emphasis on emotional connection and expression in music.\nThrough regular recital and performances, it also helps to develop Ariel’s stage presence and self esteem.\nHighly recommend to anyone seeking a rewarding musical experience for their child.",
      "time": 1722406596,
      "translated": false
    },
    {
      "author_name": "Keryn Lim",
      "author_url": "https://www.google.com/maps/contrib/102904509883781535849/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLlCCWofADvu6BP9sVVJs0CW44NVUbLDlqnrrZplPOYzyr2ng=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "My boy who has a grade 5 started his piano lesson with Teacher Laurence in April. In this short period of time I have seen an improvement in his playing and inspired to do play better. I don't have to ask and he is practicing himself everyday. My boy shared with me Teacher Laurence is very skilled in recognizing the tone and color of the music. He is patient to correct his techniques and always explain very clearly. We are very fortunate to have him as a mentor. Thank you Teacher Laurence.",
      "time": 1725356290,
      "translated": false
    },
    {
      "author_name": "eyleen chua",
      "author_url": "https://www.google.com/maps/contrib/114821219303493104024/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU4zLabWlxImqgCkFo89rvD4WzOOtY6n7PsOzVZnPKxlz33nfG_=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "I’m happy to share our positive experience with Artist Music Studio.\n\nMy son began his piano journey at just 4 years old, but faced numerous disruptions over the past years, including the pandemic and frequent teacher changes. Despite these challenges, he maintained his enthusiasm for learning music.\n\nAfter struggling to find a dedicated and passionate music teacher, I almost gave up. That’s when a friend recommended Artist Music Studio. My initial conversation with Teacher Laurence was enlightening. He spoke alot on music learning  journey and philosophies without pressuring us to sign up immediately, which reassured me that this is the right place for my son.\n\nNow, after nearly a year of lessons with Teacher Ben, my son looks forward to every class ( even on days when he was exhausted from school and sports training). My son told me that teacher Ben is not only encouraging and funny, but he also makes lessons enjoyable and easier to understand. My son is  happy to have finally achieved a milestone by earning a distinction in the ABRSM exam. This achievement is especially significant after a long and uncertain learning journey, and it’s evident that Teacher Ben’s exceptional guidance and support were crucial to meeting this milestone.\n\nI recommend Artist Music Studio for anyone seeking a nurturing and inspiring environment for piano lessons.",
      "time": 1726502917,
      "translated": false
    },
    {
      "author_name": "Ethan Foo",
      "author_url": "https://www.google.com/maps/contrib/103770258411549281216/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocITGFBNHUj43-yfyeOtH1yPRfhs8_XnL6cdQ80j8cp-lVD2JA=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "8 months ago",
      "text": "My daughter was taught by Miss Lee who corrected her mistakes and habits developed from another music school. Miss Lee had been a firm teacher who helped to build my daughter’s musical foundation. Teacher Hazel who taught my daughter subsequently was very encouraging and guided my daughter through the grade 5 exam and she passed with distinction. I am grateful to both teachers and would highly recommend AMS and their teachers.",
      "time": 1726383973,
      "translated": false
    },
    {
      "author_name": "Violet Lavender",
      "author_url": "https://www.google.com/maps/contrib/113332562417933861622/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV8rEmbNcj--bO3W2P1SRPOsaoQ_ZnM03gFtHwsNwA1xO5XalPt=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "I started off my piano journey in Singapore with many changes along the way. I had multiple piano teachers but still couldn’t find the teacher that understands and patiently teaches me. However, when I began learning with teacher Midorie then teacher Laurence, I felt like I had finally found two great teachers that truly took the time to teach what the music is about, not just treating the music as a piece of paper and plainly memorizing. I am currently learning with teacher Laurence and I am extremely grateful for the countless things he has taught me. Thank you to teacher Midorie and teacher Laurence, they are incredible mentors in both music and in life!",
      "time": 1721465181,
      "translated": false
    }
  ],
  "types": [
    "moving_company",
    "school",
    "store",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14310898666349717185",
  "user_ratings_total": 31,
  "vicinity": "275 Thomson Road, #01-37 Novena Regency"
}