{
  "formatted_address": "26 Sin Ming Ln, #04-121 Midview City, Singapore 573971",
  "geometry": {
    "location": {
      "lat": 1.3594885,
      "lng": 103.833788
    },
    "viewport": {
      "northeast": {
        "lat": 1.360873780291502,
        "lng": 103.8350571302915
      },
      "southwest": {
        "lat": 1.358175819708498,
        "lng": 103.8323591697085
      }
    }
  },
  "name": "Artspaze Pte. Ltd.",
  "place_id": "ChIJD_8ynDIX2jERW4ypK-zKTwk",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Vanessa Joseph",
      "author_url": "https://www.google.com/maps/contrib/104226468307892955057/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIPOgfu91BR-aFI2CaPL7qSH-VzC299XYxcisTFyWS8UBC9Sw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Yu Long was patient and amazing throughout our reno process even though we made many changes to the design, some when project was near completion. He puts a lot of thought into the design and functionality, and works to ensure that the house is not only aesthetically pleasing, but that the layout of the built-in furniture works with with each household member’s lifestyle. This was our second time working with Yu Long and we are one happy customer!",
      "time": 1679066015,
      "translated": false
    },
    {
      "author_name": "Chin Hwee",
      "author_url": "https://www.google.com/maps/contrib/102267931422762233583/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJfNsvOAf884PN_N5gXOjM1edaSGZmSaHKzErqk7w-J3LTtDA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "I am clueless on the renovation, but I am happy that I have engaged Nivel Lim as my ID. He has guided me well through my renovation journey.\n\nNivel is professional, friendly, trustworthy, customer-centric, understanding my needs, work within the budget and best of all, always response to renovation enquiries.\n\nHe gave great advices on renovation tips, ranging from design, color choices, electrical works, carpentries, defects check, furniture, electronics, curtains, plants, etc. I have learnt so much things from him! Thanks, Nivel!\n\nNivel never fails to put himself in customer shoes; to understand our usual lifestyle at home and our needs. With his vast experience, knowledges, and creativity, he will strive to balance our expectation. He has helped us to achieve practicability for long-term comfort & satisfaction. Not just short-term satisfaction & aesthetically pleasing.\n\nI have let Nivel to run the whole renovation, and he always update regularly on the progress without the need for me to drop by. There were no delays in the renovation, and I get to move into the house as scheduled.\n\nI am incredibly happy for my newly cozy renovated house. I really love it, thank you Nivel!\n\nIf you are looking for ID, I highly recommend Nivel Lim.",
      "time": 1587271880,
      "translated": false
    }
  ],
  "types": [
    "shopping_mall",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=670977985195117659",
  "user_ratings_total": 2,
  "vicinity": "26 Sin Ming Lane, #04-121 Midview City"
}