{
  "formatted_address": "3 Mount Elizabeth, #09-05 Medical Centre, Singapore 228510",
  "geometry": {
    "location": {
      "lat": 1.3044618,
      "lng": 103.8351405
    },
    "viewport": {
      "northeast": {
        "lat": 1.305725480291502,
        "lng": 103.8364985802915
      },
      "southwest": {
        "lat": 1.303027519708498,
        "lng": 103.8338006197085
      }
    }
  },
  "name": "Ascent ENT Specialist Singapore (Mount E Orchard)",
  "place_id": "ChIJFWsY_mQa2jERFkjEOmz__es",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Gunny V",
      "author_url": "https://www.google.com/maps/contrib/107158351986156958080/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ3-G1WvYKpQua5STQppDz2c5Cwg8MzzuLZgoMzywI6zkA8Zw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "I had my nasal septum deviation and fungal ball removal surgery done by Dr. David Chin two weeks ago, and I’m truly grateful for the care and professionalism I received throughout the process. The surgery was completed successfully, and I’m already noticing a significant improvement in my breathing and overall comfort.\n\nFrom the very first consultation, Dr. Chin was thorough in his explanation and made sure I understood the condition, the procedure, and the recovery process. He took the time to answer all my questions patiently and helped ease any anxiety I had going into surgery.\n\nThe procedure was smooth, and the post-operative care instructions were very clear. What stood out most was the follow-up attention—I never felt like I was left on my own after the surgery. Dr. Chin checked in during my review appointments and ensured everything was healing well.\n\nI also want to acknowledge the clinic staff who were courteous and efficient, making the entire experience seamless from start to finish.\n\nHighly recommend Dr. Chin for anyone dealing with sinus or nasal issues—his experience and patient-centered approach really make a difference.  - Ganesh V",
      "time": 1746279417,
      "translated": false
    },
    {
      "author_name": "Dheeraj Madan",
      "author_url": "https://www.google.com/maps/contrib/109364602942028071545/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKoUwcqYXsqKRG4GOdSDoaSlQCINulW1nXOt4SW1yH9GXGhyA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "I had been struggling with a prolonged cough and persistent runny nose for months, and after seeing multiple doctors with no lasting improvement, I finally found real relief with this ENT specialist Dr David Chen. The doctor was incredibly thorough and took the time to clearly explain the underlying cause of my symptoms and the treatment plan. It made a big difference to understand what was happening and why certain steps were necessary.\n\nWithin a short time, my symptoms significantly improved — something I honestly wasn’t expecting after so long dealing with it. I really appreciate the doctor’s patient approach and expertise.\n\nAlso, a big shoutout to the reception team — Josie and Amos were absolutely fantastic. Super friendly, efficient, and made the whole visit smooth and welcoming.\n\nHighly recommend this clinic if you’re looking for effective care and a team that truly goes above and beyond!",
      "time": 1745218829,
      "translated": false
    },
    {
      "author_name": "Esther TPL",
      "author_url": "https://www.google.com/maps/contrib/108970020947040217110/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKonZpR165zeqOyxKm-WnSswOaX9BSpFGMT57NFM7Ha55-j=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Dr Leong is one of the best and friendly doctor I have ever met. He always greeted me warmly with a big smile,  his calmed and assurance words put me at eased before my ear operation. Thank you Dr Leong will always appreciate your professionalism.",
      "time": 1745892668,
      "translated": false
    },
    {
      "author_name": "Iris Low",
      "author_url": "https://www.google.com/maps/contrib/116811054277680227457/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJe7tlRwDSh9vcXTthAadyfJGSnaKSg5VVBjQD3krI7Dy2Ffw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Dr Leong is really professional. Just a look at my ear condition and he can determine the reason and give me the best treatment. The Nurse Ferna is so friendly and warm. Keep informing when will be my turn",
      "time": 1745380798,
      "translated": false
    },
    {
      "author_name": "Yeo Jia Hui",
      "author_url": "https://www.google.com/maps/contrib/113552213818976310451/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVCZRPMpJw8GVqch4fDlyGpG39yyqU6XBEtFSp9XOJUjULlt7U=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "The staff are kind, doctor are friendly. Initially appt was 4pm but I reached earlier, managed to see dr earlier too but waited in the treatment room for quite sometime. It was fine bcos the environment compared to outside of the room was much more quiet and comfortable.",
      "time": 1746775406,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17005028608328353814",
  "user_ratings_total": 334,
  "vicinity": "3 Mount Elizabeth, #09-05 Medical Centre"
}