{
  "formatted_address": "Blk 219 Henderson Road #05-01/02/03/04 Henderson Industrial Park, Singapore 159556",
  "geometry": {
    "location": {
      "lat": 1.2803168,
      "lng": 103.8199838
    },
    "viewport": {
      "northeast": {
        "lat": 1.281606630291502,
        "lng": 103.8214225802915
      },
      "southwest": {
        "lat": 1.278908669708498,
        "lng": 103.8187246197085
      }
    }
  },
  "name": "AsiaPac Technology Pte Ltd | ICT Solutions Provider",
  "place_id": "ChIJN1qmjtcb2jERMLsHjVNzSAE",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Claudia chong",
      "author_url": "https://www.google.com/maps/contrib/118435061080766777884/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLNTxGODRDaoqix3xdlBeqzbHsn5oyU1nkdMtg2jx-h_v7QZA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "I paid for a laptop two weeks ago and was told it would be delivered before school started. Instead, I was only informed on Sunday night that I would receive it on Tuesday — after school had already begun.\n\nThis is especially unacceptable considering the company is handling school-issued student orders. How can you be “out of stock” when you should have known exactly how many students needed devices? If you're not prepared to fulfill bulk orders, don't take our money in the first place.\n\nWhat’s worse — calls are not answered, emails are ignored, and when someone finally responds, it's often a poly student replying very late. This is clearly not a support team that’s equipped to handle customer needs, especially in a time-sensitive situation like the start of a school term.\n\nI’ve seen many other Google reviews with the exact same complaints — it’s not an isolated issue. Even more concerning, the company’s LinkedIn page shows they’re hiring for many new roles. Are they overwhelmed, understaffed, or expanding too fast without fixing their operations first?\n\nFrankly, the school should reconsider working with this vendor. Students and parents are left hanging at a critical time, and this kind of unreliable service does real harm.\n\nVery disappointed and frustrated.",
      "time": 1745200422,
      "translated": false
    },
    {
      "author_name": "jaylyn",
      "author_url": "https://www.google.com/maps/contrib/109618134463396570247/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKfxlQNCKQcNX9y1puVD0SxzGDG0XIrc8NeNp7MWN8dMxu1wg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Placed my order and paid in full two weeks ago, expecting the laptop to arrive as promised before the new school term. Instead, I was only informed the night before school started that it would be delayed until Tuesday. Seriously?\n\nThis company is supposed to handle student laptop orders, yet somehow didn’t anticipate that most students would be ordering around the same time? Being “out of stock” at this point just shows poor planning and zero consideration for the people relying on these devices.\n\nReally poor experience. If you can’t manage your logistics, maybe stop accepting orders you clearly can’t fulfill on time.",
      "time": 1745199737,
      "translated": false
    },
    {
      "author_name": "Ja koh",
      "author_url": "https://www.google.com/maps/contrib/112076531918633000187/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIOXQ3_XiC3Kge2-VP2YZRDQ2EWTyqMhX23oAkfTxuZv2yKDg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "For a vendor supporting the public polytechnics, I am shocked at the level of service. The model ordered was not available and I was only informed just prior before the semester started. Was asked to choose alternative models which were more expensive and inferior. Even after preparing to wait until early May for the model to arrive there was no reply to emails and phone calls were not answered. I questioned the integrity of both the company and the polytechnics involved in selecting such an unreliable vendor.",
      "time": 1746593252,
      "translated": false
    },
    {
      "author_name": "Daniel Kou",
      "author_url": "https://www.google.com/maps/contrib/100560299907634756466/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLMbcqn6I8OzeNjSud7k3UqeAK7Lqq6-c2BG71ri8AGHt-Pig=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "in the last week",
      "text": "Terrible experience. Do not buy from this company. My poly used them for a laptop show, so I thought they could be trusted. Nope. I ordered online, waited for a week (way past their promised delivery date), and no laptop. I started to email them, took about a week to get a disappointing answer. No stock! They took two weeks from my order date to tell me no stock! I emailed back to ask about when stock will come in, will my order be prioritised, or can I get a refund. No answer. At all. Really, do not buy from this. If you can buy it in person, cash-and-carry, may not be such a bad deal.\nUpdate. Yup. Buying in person is better.",
      "time": 1747366213,
      "translated": false
    },
    {
      "author_name": "Antonia Tan",
      "author_url": "https://www.google.com/maps/contrib/107018680374650831312/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLk9Zcl8J172-KwgzFxkF-qHPrPJ93GQn5F7FEndk9ryOkWXQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "My son ordered a laptop, our full address wasn’t given to the delivery team by the sales team. We checked our order, we had written full address.\nAs a result the delivery wasn’t fulfilled. Tried calling the office several times for 2 days during the company’s stated operating hours,  to try to rectify the situation.\n\nHowever, no one answer the phone!!\n\nWe had emailed the company with our order details and requested for help, yet received no reply.\n\nFeeling helpless as we spent $1.5k on laptop order and seems it’s money down the drain.",
      "time": 1744597040,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=92450595046669104",
  "user_ratings_total": 207,
  "vicinity": "Blk 219 Henderson Road #05-01/02/03/04 Henderson Industrial Park"
}