{
  "formatted_address": "2 Seah Im Rd, Singapore 099114",
  "geometry": {
    "location": {
      "lat": 1.26633,
      "lng": 103.8194036
    },
    "viewport": {
      "northeast": {
        "lat": 1.267664680291502,
        "lng": 103.8209550302915
      },
      "southwest": {
        "lat": 1.264966719708498,
        "lng": 103.8182570697085
      }
    }
  },
  "name": "Aspirasi Chicken Rice",
  "place_id": "ChIJf4mpm-Eb2jERaUFlcKOqXek",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Dee",
      "author_url": "https://www.google.com/maps/contrib/117491518369229498458/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXuv_hLo2ZzpvWLEB0AihwPjwS2YgMJZ-B9CdtAoh4haOiB9zeR=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Be prepared to queue.\n\nThis is one of the best chicken rice stalls in Singapore! Aspirasi Chicken Rice that serves up hearty, flavorful meals at great value.\n\nI tried both the Sambal Chicken Rice and the Original Fried Chicken Rice, and both were excellent.\n\nThe sambal is spicy but well-balanced, and the fried chicken is crispy and juicy. If you prefer something milder, the original version is just as satisfying. Prices are very reasonable ($5.50–$7.00), and the portions are generous.\n\nService is quick even during peak hours, and the staff clearly takes pride in what they do. There is also a nice variety of flavors like black pepper, lemon, and sweet & sour — something for everyone.",
      "time": 1746775327,
      "translated": false
    },
    {
      "author_name": "I W",
      "author_url": "https://www.google.com/maps/contrib/107686746966044708528/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLR7qMD7CnzxdTPSlKI_8v7zMjNlXGM2jRE5RrfdOt4e5vRqw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "2 weeks ago",
      "text": "Had a craving for Ayam Penyet style chicken rice and gave this stall a try.  Their rice was quite flavourful, and the chilli has a nice kick to it.\n\nHowever, I found their chicken a bit on the dry side.  In the end, I felt that something was lacking as my craving wasn't satisfied.\n\nSo I ordered from Farasha by Intan (chicken only)(reviewed), which was in the same hawker centre.  Farasha's chicken was moist and better tasting. No way could I have eaten two plates of Ayam Penyet including the rice, hence only ordered the chicken from Farasha.",
      "time": 1746095383,
      "translated": false
    },
    {
      "author_name": "Zul M",
      "author_url": "https://www.google.com/maps/contrib/118286768499241544620/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUoXdorylwB_OnwpGyIjbatIWoekEeWrS9GC3t1WLgsXjIeCih3Ww=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Aspirasi chicken rice isn’t your typical Chinese-style chicken rice—it’s got a unique charm that feels like a warm hug on a plate. The fried chicken is perfectly crispy, yet somehow manages to avoid being greasy, which is a culinary miracle in itself. It’s my first time here, and I can already tell it won’t be my last. The flavors are comforting, the vibes are homely, and yes, I’m officially a fan. Highly recommend giving it a try—you might just fall in love, too!",
      "time": 1737173292,
      "translated": false
    },
    {
      "author_name": "WDG Dingguo",
      "author_url": "https://www.google.com/maps/contrib/118149297852514861223/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJaYXI4A1CYXv4bcTzEDq15VdiLj9VGwFE-nrcyY4-MU4fwig=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Wow. Soft and tender on the inside. Crispy and fragrant on outside. I ordered no.7 fried rice with chicken. Don’t be fooled. You get real chicken portions. It is ayam  penyet with fried rice.  What tops it off is its free crisps and tasty chili sauce. Will come again.",
      "time": 1733975272,
      "translated": false
    },
    {
      "author_name": "Sean",
      "author_url": "https://www.google.com/maps/contrib/117168273624339544276/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUbD_BYMwEhIygC-QuvrmQkmjlwc4-WeblS46YWrS1JTROT0-uBhw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "6 months ago",
      "text": "I live far away and when I come here once in a blue moon, I would eat at this stall.\n\nI got the ayam penyet at 6.50 SGD although my friend would encourage me to just get the chicken rice.  The price seemed expensive.\n\nThe price seemed to have gone up since the last time I came before the covid.  They switched to using all disposable crockery. This is a problem because the plastic fork and spoon is too soft to cut the chicken.  I have no choice but to resort to using my hands.  The chicken was very oily.  However the skin was nicely done and very crispy.  The meat however was tasteless.  But when you ate it with sambal you would find it very nice.  The sambal was great and spiciness was just nice for me without causing me to tear up like some other stalls.\n\nThe other good point about the food was that we could add crispy bits from a container according to how much we wanted.  The crispy bits went well with the white rice.  The rice was cooked well with the right texture.  There was a small bowl of salted soup.\n\nOverall it might be something that you would want to try.\n\nThe afternoon sun shone into the hawker centre on this stall side strongly and it would be fairly hot to eat here.",
      "time": 1729936975,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16815784202613375337",
  "user_ratings_total": 161,
  "vicinity": "2 Seah Im Road, Singapore"
}