{
  "formatted_address": "1 Kay Siang Rd, #05-01/02, Singapore 248922",
  "geometry": {
    "location": {
      "lat": 1.296068,
      "lng": 103.8157862
    },
    "viewport": {
      "northeast": {
        "lat": 1.297340980291502,
        "lng": 103.8171339802915
      },
      "southwest": {
        "lat": 1.294643019708498,
        "lng": 103.8144360197085
      }
    }
  },
  "name": "Astor International School",
  "place_id": "ChIJ74yXLGUb2jERVeesfuDMuUk",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Sumit Talwar",
      "author_url": "https://www.google.com/maps/contrib/112461200379586352747/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVpj4PuazhKUVg74a8B-3ftC-dCR8ydR-dB-gLgZfEpPkNDRVSeWQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Astor International School Singapore has been an amazing experience for my daughter! The warm, welcoming atmosphere feels like a home away from home. The teachers and staff are incredibly supportive, ensuring every child receives personalized attention. They go above and beyond, like arranging food if a lunchbox falls, and taking extra care with allergies by clearly communicating with parents and ensuring allergen-free ingredients in cooking tasks. This level of care has always been handled effortlessly, with no issues. The school fosters academic excellence, personal growth, and inclusivity. We’re grateful to be part of this nurturing environment. Highly recommended!",
      "time": 1743260726,
      "translated": false
    },
    {
      "author_name": "Анна Павлова",
      "author_url": "https://www.google.com/maps/contrib/115557501533999516587/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJchiTR6iSrCOGdt7yQCKKC5HTeVMo8RhofL0jfCfFFPTW8rA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "My oldest daughter studied at Astor for two years. We came from Russia, and she easily joined the learning process. We had no conflicts with anyone. And even with the transport company everything was fine. I like the organization of all processes. Everything is very clear and transparent. My daughter loved school. The routine there is nicely diluted with events and holidays. The atmosphere is friendly and comfortable, without pressure. But there is development. This is especially noticeable in English. Great progress. The youngest, aged 5, also went to Astor, and she is also happy. We are leaving now, my children will miss. We want to say a big thanks to everyone involved in the work of the Astor School. You're doing great.",
      "time": 1719394944,
      "translated": false
    },
    {
      "author_name": "Dian Ekowati",
      "author_url": "https://www.google.com/maps/contrib/104872660436077977270/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXN8_KcCNzR-ezX0qCFUCmZm9wFGRmOBsOO5J_158jjhC4WQtvG=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I visited this school a year ago to find affordable, good primary school for my son. During my visit, Leena Patel was really helpful to explain the school and took us to tour. I liked the school's atmosphere, the showcase in the wall from the students, the way teacher and students interact, the playground. I don't end up sending my son there as we couldn't get a rental nearby the school - and I don't want to send my son for more than an hour per trip to school. But if we were near, I won't have any doubt to send my son there.",
      "time": 1709795446,
      "translated": false
    },
    {
      "author_name": "Ayesha Kumar",
      "author_url": "https://www.google.com/maps/contrib/103858543707557612302/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLY2xStbXl1RT7wVN9jS38YmBuPAr3Hvh_uWB8K86_191PTQA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "We are very happy with the progress our child has been showing after moving to Astor International. She has been enjoying attending school and has really settled into her class.\n\nAs parents we are grateful that our child has settled into her new school surroundings really well.\nWe always hear positive stories about her time in class, with her Teachers and what she is learning during ECA.\n\nThank you again for the support and we look forward to seeing our child continue to enjoy learning at Astor International.",
      "time": 1700538313,
      "translated": false
    },
    {
      "author_name": "Robert ord",
      "author_url": "https://www.google.com/maps/contrib/114477238095218582444/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKkVz87O_yD64STthZ9IIPbA-JmDk3aABEX9NWl8ZrfuUg9Yg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Relocation approaching.  Our daughter has completed 5 years at this lovely  ‘little’ school with its caring and attentive Staff.\nRich and varied curriculum, 3 Rs are not forgotten about,  plus something for all in the enrichment classes.\nThe learning journey is long nowadays and extends well beyond the classroom, we are grateful to the school for playing their part in ensuring our child sets out on the journey well prepared.\nThank You ASTOR.  Ellie will miss you all.",
      "time": 1710919440,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5312502500030211925",
  "user_ratings_total": 30,
  "vicinity": "1 Kay Siang Road, #05-01/02, Singapore"
}