{
  "formatted_address": "30 Labrador Villa Rd, Singapore 119189",
  "geometry": {
    "location": {
      "lat": 1.2679766,
      "lng": 103.8004316
    },
    "viewport": {
      "northeast": {
        "lat": 1.269363030291502,
        "lng": 103.8019228802915
      },
      "southwest": {
        "lat": 1.266665069708498,
        "lng": 103.7992249197085
      }
    }
  },
  "name": "ASU",
  "place_id": "ChIJC6ZUlo8b2jERpVxZoqhzK6E",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Josiah (jo)",
      "author_url": "https://www.google.com/maps/contrib/103512687356506187631/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIEuDo6Ivthjstbu0sU_pCx0ked8g-Oei7dZLcRbbPQ3Qww1Q=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "ASU is a breath of fresh air. The concept and the flavours that Chef Ace has presented is well thought and it is shown in every bite.\n\nWe had the chance to try out their winter menu right before it ended and we weren’t disappointed.\n\nThe thing that stood out for us was that each dish was individually introduced and the chefs took their time out, telling us about the backstory for each serving. You can taste the history in each bite and they portrayed it not just through words but through pictures and flavours.\n\nI would love the opportunity to return once again, to try out another season",
      "time": 1746794085,
      "translated": false
    },
    {
      "author_name": "Billy K",
      "author_url": "https://www.google.com/maps/contrib/111428954203320929883/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIwacjky6Dqki_toDbMLZebmILzZWNnGbi9GFOhO5NRvCWPeWI=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I’ve visited ASU twice since its opening, experiencing both seasonal menus, and I’m equally impressed. What stands out to me most is Chef Ace’s authenticity and his meticulous approach to designing each dish with progressive Asian elements. Unlike some places where creativity feels forced, his creations always have a story behind them. His ingredient pairings and execution methods are often unexpected yet intricately precise, making each dish a delightful surprise. If you appreciate a thoughtfully curated culinary journey, ASU is a must-visit.\n\nThe restaurant’s interior is also something special—a modern monastery-inspired space with curved tables that allow you to watch the chefs in action. This layout adds a dynamic element to the dining experience, making the transitions between courses feel like part of a seamless performance. It’s an experience that keeps you engaged, both visually and gastronomically.\n\nThe price point is very reasonable for what you get, the portion is reasonable that even my parents felt full and worth the money 😝 unlike a typical “fine-dining” experiences, and I’d highly recommend adding the optional dishes—you won’t want to miss out. The lighting is on the dimmer side, so I didn’t take many good pictures, but honestly, the food was so good that I didn’t want my phone to eat first anyway!\n\nASU is perfect for food lovers, date nights, and catching up with old friends. Highly recommended!",
      "time": 1738669809,
      "translated": false
    },
    {
      "author_name": "Janice Lee",
      "author_url": "https://www.google.com/maps/contrib/106560684916099273567/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXQf-OHJi6CmZ_ZCgS1ck62TLUXsdPM_tA8CZ1BYdORFLFtMt4R7g=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I know I got to go to Asu Restaurant the moment I read about how Chef Ace Tan’s Progressive Asian Cuisine, where East Asian dishes are reinterpreted with different global techniques while incorporating Traditional Chinese  Nourishment elements. And this beautiful restaurant, with the beautiful cuisine with beautiful taste, absolutely astounds me. So much so that I know I will back for another season!\n\nI love it that so much thoughts is put into the concept of the restaurant, evident from the little details such as printed cards of the ingredients being beautifully hand drawn by an artist from Hong Kong, the paintings and plants reflecting the four seasons and the magical elevation of Asian dishes that score perfection in both taste and texture.\n\nEach meticulously made bite-size morsel, made with luxurious ingredients, is so complex and well-balanced in taste while highlighting the vibrancy of Asian tastes. The dishes here are also unique in that they have this delicate familiar yet special cooling property like that in traditional medicine, so there is always a “wow, this is really something unique and awesome” moment when I take the first bite of each dish.\n\nHoused within a historic colonial bungalow amid the lush forest at Labrador Villa, the exterior of the restaurant is grand, with touches of nostalgia and character. In fact, walking up the brick stairways flanked by lots of foliage while admiring the greenery surrounding the bungalow and feeling the serenity, away from the bustle of the city, is such a relaxing and different, great experience. The interior is classy, and stylish with subtle tones of lux, combining elements of modern sensibility and traditional Chinese flair.\n\nThe service here is simply awesome, being friendly, thoughtful, professional and meticulous. This restaurant is definitely of Michelin Star standard.\n\nThe crystal ball like Tea Smoked Sakura Masu is full of light umami yet tastes refreshing. This is so unique and out of this world.\n\nMapo Tofu is reinterpreted to be so well-balanced and complex.\n\nHotaru Ika Hitam is like the best Firefly squid dish I ever have.\n\nButa Wrap, which is Chinese style Tacos with sliced tender, juicy grilled Hokkaido Pork wrapped with Charcoal Crepe. The lovely warm meatiness is elevated by spicy, exciting, tangy flavours of the condiments.\n\nHong Zhao Main Xian totally wins me over. The Geoduck goes so well with mild sweetness of Red Koji, spiciness of Bentong Ginger and crunchy, refreshing potato noodles.\n\nKing Crab Shiro Kare King is a delicate dish packed with the briny sweetness of crab that I absolutely love. This incites that pure feeling of Happiness with every mouthful. The juicy succulent sweet crab meat has its sweetness further highlighted by the mild spiciness of the white curry.\n\nThoughts: Absolutely Astounded!",
      "time": 1743376628,
      "translated": false
    },
    {
      "author_name": "Sean Aaron Chong",
      "author_url": "https://www.google.com/maps/contrib/107809966642363550343/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI5V7qYTC2oAIRR05FCAsTp-I8iEfbAZGxtMBEANYxs-2VDmw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Exceptional service, artsy ambiance and mind blowing dishes that are creative yet flavorful. Keep an eye out for their new seasonal menus. I had to privilege to try their 2025 New year menu ‘A Feast of the seasons’\n\nThinking of really indulging in fine dining, ASU is your answer.",
      "time": 1742404234,
      "translated": false
    },
    {
      "author_name": "Jez L",
      "author_url": "https://www.google.com/maps/contrib/111623614356778497628/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVivVDX2e9iiTGbYtckF3h334cjhoQsdnPYBB7mAjPBoH2XMp9ZbQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "The set up with medicine drawers, island kitchen and diners table around the chefs are well received with interactions. The nicely crafted menu cards for each course depict the curated ingredients and goodness each dainty portion brings. Our Spring menu is slightly light for my buds, perhaps I was expecting more chinese herbs to dominate. I enjoy the crystal ball and spring roll best, gave me surprises beneath the wrap. Would suggest for better lighting for diners to be more comfortable, esp. taking shots of the art piece presented, cast defined shadows unnecessary.\nMuch of Tamarind Hills still remains in main hall and lounge, hope to see the upcoming refreshed ideas to go along with Asu.",
      "time": 1743407323,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11613503232220421285",
  "user_ratings_total": 37,
  "vicinity": "30 Labrador Villa Road"
}