{
  "formatted_address": "1 Jalan Anak Bukit, #01-29, Singapore 588998",
  "geometry": {
    "location": {
      "lat": 1.3390906,
      "lng": 103.7787333
    },
    "viewport": {
      "northeast": {
        "lat": 1.340364080291502,
        "lng": 103.7800920802915
      },
      "southwest": {
        "lat": 1.337666119708498,
        "lng": 103.7773941197085
      }
    }
  },
  "name": "Attitude Performing Arts Studio",
  "place_id": "ChIJ3dARAokQ2jERdgrbEnrSTG8",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Amy Cho",
      "author_url": "https://www.google.com/maps/contrib/103008649111555412785/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJe33Eke9IByTDlZfEQV2JuhtahmvBzWr5MpWf2PGUdTKEQzg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "My 5 year old granddaughter Bella is attending ballet lessons in this studio.\nShe enjoys her dance lessons very much, always looking forward to attend the class.\nBesides, the supervisor John is indeed an amazing staff here, friendly, efficient and always serve with a smile.\nKeep up the good job John. You are indeed an asset to this dance studio.\nCheers",
      "time": 1733020464,
      "translated": false
    },
    {
      "author_name": "zhan ding",
      "author_url": "https://www.google.com/maps/contrib/104984579885950492430/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL10M6pmVqJ-EXGCVkJ1iBjjn3FpOppBGn_TgaboV8C6bCzGg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "The teacher doesn’t know how to manage smaller kids, they dun understand younger kids go through separation anxiety. I was there for first two classes, and was told not to be present from next class onwards. Since then I stopped going because I know my daughter would not enjoyed the class. During the class, feels like a passing/wasting time with limited teaching and coaching. When my daughter was not following the class, she was asked to step aside instead of being encouraged to try by the teacher. Super disappointing to see. Not recommending this place to any parents if you want your kid to develop interest in dancing ballet.",
      "time": 1731373796,
      "translated": false
    },
    {
      "author_name": "Helen Wang",
      "author_url": "https://www.google.com/maps/contrib/111580116366508167320/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJrrnUTqnkqGjEpMREsww3UDMyBBwk387kAMVhR0LHELcFOxA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "The school does not want parents to see their children in the dance class and chases the parents out of their facility. It is quite an odd policy. The staff was also rude to the grandparent and the maid. We strongly suspect discrimination here. We had to pull out of the class forfeiting one whole term's fees. We have since started attending Barreworks. Firstly, the teachers at Barreworks are so much better and more professional. They bother to instill the learning and are not just passing the time. This is a common observation among all the family members. Secondly, Barreworks allows the adults to stay in the facility the whole time the class is going on, with big glass windows for them to see what is going on during the class. We are happy we have moved away from \"Attitude\". The name of the place says it all. We have indeed gotten a lot of \"Attitude\" here.",
      "time": 1711328325,
      "translated": false
    },
    {
      "author_name": "韩依娜",
      "author_url": "https://www.google.com/maps/contrib/116344015988963279190/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW4Ot_1mO0D9S5P3II8B80xDUvlp4Al1lOnVBHecZ_UFixECF5v=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "a year ago",
      "text": "My daughter loved the class and especially classmate. She willing to come every weekend. But the school needs to improve the management system. School called 15 minutes before the class and informed the teacher is sick and class canceled. it’s a weekend morning class, less than 10 students. The teacher called 15 mins before class telling she is sick ? Or the school took more than 1 hour to inform parents less than 10 students? Either way, there is an opportunity the school improve the young students and parents experience.",
      "time": 1698548744,
      "translated": false
    },
    {
      "author_name": "Franck Gan",
      "author_url": "https://www.google.com/maps/contrib/105334767700094709142/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKwdCp9WPrizarEypvHdr8gSwmW-re0KnNSBmzFlSHuqqQf0w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "Been to cafeteria for a short break while awaiting for better weather to move on. Got a cup of coffee and few cookies just when I ask for check. I realised I actually forgotten my wallet. Thanks god for very kind and helpful waiter which kind enough  allowing me to pay next visit. I am touch with the kind attitude toward walked in guest. Just before I about to leave he actually handed me with an umbrella.  I am touched with the warm and helpful individual.  Thank you. 🙏🙏",
      "time": 1599741873,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8020016458184198774",
  "user_ratings_total": 52,
  "vicinity": "1 Jalan Anak Bukit, #01-29"
}