{
  "formatted_address": "27-A, Jurong Port Rd, #01-15, Singapore 619101",
  "geometry": {
    "location": {
      "lat": 1.3157021,
      "lng": 103.7202409
    },
    "viewport": {
      "northeast": {
        "lat": 1.317123730291502,
        "lng": 103.7216030802915
      },
      "southwest": {
        "lat": 1.314425769708498,
        "lng": 103.7189051197085
      }
    }
  },
  "name": "Autofriend (Jurong Port)",
  "place_id": "ChIJnYgUWk4F2jERaB56A6IkUFE",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Abel Tay",
      "author_url": "https://www.google.com/maps/contrib/117283171673412775554/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKTdu5Xg0NjrAFwjg88-eS4Pk0R7Stcto3AkHGveLmnCzFVMos=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Sent my baby Volvo for service @ Autofriend. Their service and professional skills impressed me. They are able to identify all the faults and repair them promptly . I think this is due to the professional skills of the mechanic at Autofriend. William is a highly experienced professional mechanic while Charles is a degree qualified Engineer. I am sure you can put your trust in their skills and knowledge to look after your car needs. Now my baby drives like a NEW Volvo.  Highly RECOMMENDED Workshop here in SIngapore.",
      "time": 1725526953,
      "translated": false
    },
    {
      "author_name": "Dan Dan",
      "author_url": "https://www.google.com/maps/contrib/105023132040851704245/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKauBg2zD7xxTREw4aoYVHdnuWtvtvvtDaJzUWCoaIXs0kFqA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Sent my car to get the rear absorbers changed. Ah Hai did a great job with it. He is very experienced. Charles was also there to answer all my questions and attend to my concerns. The price charged was reasonable too.  Highly recommended if you stay in the west of Singapore.",
      "time": 1731417020,
      "translated": false
    },
    {
      "author_name": "Davier Wang",
      "author_url": "https://www.google.com/maps/contrib/108353415237496295675/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIPJuuqF5dm76AkOwCAhHK01fbCBw1tFAh7Bx4kLYfue3SG=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Charles was very patient and took time to explain the basics of car maintenance to me after I told him that I am a new driver. After sharing with him some of the suspected issues with my car, he even went with me on a drive nearby to see and hear what the problems were. If you need someone patient and professional, going to this workshop won’t go wrong. Thanks Charles for the advice.",
      "time": 1731724518,
      "translated": false
    },
    {
      "author_name": "Fathiin Fawwaz Hussien",
      "author_url": "https://www.google.com/maps/contrib/100100719217721248823/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW3vVL2v2Kq2fqPHs0LxRcR-Ut-Gc4ymHn94ZxKMyMIqz6ygqY=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "I recently had the pleasure of visiting., and I am beyond impressed with the service I received. From the moment I walked in, the staff was friendly, professional, and attentive to my needs. The waiting area was clean and comfortable, which made the short wait much more pleasant.\nThe mechanic who worked on my car, was incredibly knowledgeable and thorough. They took the time to explain the issues with my vehicle in a way that I could understand and provided a detailed estimate before any work was done. I never felt pressured or rushed into making a decision.\nWhat stood out the most was the quality of the work. My car is running better than ever, and I feel confident knowing that it was repaired with care and expertise. The pricing was also very fair, and there were no surprise charges when I received the final bill.\nOverall, I highly recommend Autofriend Pte Ltd for anyone in need of car repairs or maintenance. Their professionalism, honesty, and exceptional service have earned them a loyal customer. I will definitely be returning for all my future automotive needs.",
      "time": 1722779894,
      "translated": false
    },
    {
      "author_name": "Crystal Lim",
      "author_url": "https://www.google.com/maps/contrib/117972992832664367797/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJHLYiXE5PfQNQuUvvzox6ygb4dV0oOBzIbBfnk6zqoWCNebg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I highly recommend Autofriend! William is incredibly experienced and truly cares about his customers. My car had serious issues—the engine icon light was on, it couldn’t engage lower gears at times, and it struggled to go up slopes or accelerate normally.\n\nI initially went to my regular mechanic, who couldn’t fix the issue but provided a fault code and referred me to KAH Motor. When I went there with the fault code, the assigned mechanic showed no interest in helping. They simply told me to book an appointment online and warned that they’d need the car to stay at their workshop for 2-3 days just for diagnosis, with no guarantee they could fix it. I was also told I’d have to pay a diagnosis fee of $100+ regardless of the outcome, and if parts were needed, it could take anywhere from two to eight months to get them because my car is over 10 years old.\n\nThankfully, a friend recommended William at Autofriend. Unlike KAH, William was proactive and knowledgeable. He quickly diagnosed the problem, sourced for the necessary part, and had my car fixed within the same day! I am beyond grateful for his professionalism and expertise—Autofriend saved me time, money, and a lot of frustration.",
      "time": 1731326113,
      "translated": false
    }
  ],
  "types": [
    "car_repair",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5859223393470652008",
  "user_ratings_total": 24,
  "vicinity": "27-A, Jurong Port Road, #01-15, Singapore"
}