{
  "formatted_address": "2 Gunner Ln, #02-04/05 Mess Hall Sentosa (Blk 17, Singapore 099567",
  "geometry": {
    "location": {
      "lat": 1.2528382,
      "lng": 103.8207408
    },
    "viewport": {
      "northeast": {
        "lat": 1.254297380291502,
        "lng": 103.8219108802915
      },
      "southwest": {
        "lat": 1.251599419708498,
        "lng": 103.8192129197085
      }
    }
  },
  "name": "Axe Factor",
  "place_id": "ChIJK2FgHvMR2jERFba-OzTDP0E",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Sim Scarlett",
      "author_url": "https://www.google.com/maps/contrib/102981571610188442253/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUMLdlS-MlKxoUAuNBe2MEEPKQiYS5EgrLCjGhygAzEKLGeK7S-=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I can't thank Axe Factor enough for allowing us to host our ROM at their incredible venue! From the moment we walked in, we knew we had made the right choice. The space was perfect for such a special occasion – it had a great mix of fun energy and uniqueness that really added something extra to the day.\n\nWe worked with an external ROM setup company, and the coordination between the setup team and Axe Factor was seamless. The team at Axe Factor went above and beyond to ensure everything went smoothly. They were so accommodating and made sure we had everything we needed.\n\nNot only did we get to enjoy the space for our ROM, but the added bonus of the axe-throwing experience created a relaxed and fun environment for all our guests. Everyone had such a blast! The venue itself is vibrant, welcoming, and has such a cool vibe. I can’t recommend Axe Factor enough for anyone looking to host a memorable event.\n\nThanks again to the entire team at Axe Factor for making our day even more special – your generosity, hospitality, and excellent coordination truly made it a celebration to remember!",
      "time": 1741080766,
      "translated": false
    },
    {
      "author_name": "Rachel Lee",
      "author_url": "https://www.google.com/maps/contrib/111701172499580628303/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWBcAE31JASI9t9RnDs2rgV5HCiCekNCsNh_YDrpHX-j0JuBXDg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "WE HAD SO MUCH FUN HERE!!! Bought tickets (and therefore a time slot) in advance as I didn't want to be disappointed. Best idea, as even though it was a weekday afternoon, a swarm of groups came in after us, and some were disappointed there were no lanes available for them.\n\nA thrilling new experience - no experience necessary. Staff were most helpful and had clear instructions as they brought us through the safety briefing, and were diligent to help correct our posture or throwing as we went along.\n\nI had booked a 2 hour session, and another staff who happened to be available came to teach us another way of throwing the axe. It definitely brought a different challenge and made the learning that much more exciting! For the 2 of us, we were so engrossed in getting it right and enjoying the practice that we were pretty shocked when time was up. We were sad to leave, but i was so glad I booked the 2 hours - totally WORTH IT.\n\nReally thankful to the watchful staff who came to observe and guide us. It really would have been a different experience if not for them.",
      "time": 1735749296,
      "translated": false
    },
    {
      "author_name": "Emad AL-Manthari",
      "author_url": "https://www.google.com/maps/contrib/115448599827014184056/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUBYzggLqkxFMSGYW9eV4YyKRiIE4ttjblIq5w4dsZGftc6I_r7=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Axe Factor is an exhilarating and unique experience—Singapore’s first indoor axe-throwing facility! The venue is well-designed with safety as a priority, featuring secure lanes and guided sessions led by friendly and knowledgeable instructors. Whether you’re a beginner or an experienced thrower, the variety of game modes keeps it fun and engaging for everyone. It’s also a fantastic spot for events like birthday parties or team-building sessions. Located at The Grandstand, the atmosphere is laid-back, and booking in advance is highly recommended, especially for groups. If you’re looking for a thrilling activity in Singapore, Axe Factor is a must-try!",
      "time": 1731162688,
      "translated": false
    },
    {
      "author_name": "Jane neo",
      "author_url": "https://www.google.com/maps/contrib/112454242128226346751/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWVe-fqjs5vDREhdBqHY6YL7wky66iU2Ed0PvojnhVI1hCo9T8Y=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Done a corporate event on 25 April 2025 for 30 pax. 6pm to 9pm. It was very well organized and well supported by the team! Ordered their buffet too",
      "time": 1745639605,
      "translated": false
    },
    {
      "author_name": "Tammy Huang",
      "author_url": "https://www.google.com/maps/contrib/109289450428597551098/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUtrKF8jFbMKnfSu2yLOperls40m7HODaAZ4wc-M8stYoKfnlLU=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Had a wonderful time at The Axe Factor. Zul and Wan were perfect instructors and hosts. They really know what they’re doing and they’re so good! Very chill and friendly guys. Axes were sharp and place very comfortable.",
      "time": 1743325883,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4701691165106157077",
  "user_ratings_total": 376,
  "vicinity": "2 Gunner Lane, #02-04/05 Mess Hall Sentosa (Blk 17"
}