{
  "formatted_address": "421 Ang Mo Kio Ave 10, #01-1149, Singapore 560421",
  "geometry": {
    "location": {
      "lat": 1.3654958,
      "lng": 103.8531034
    },
    "viewport": {
      "northeast": {
        "lat": 1.366755880291503,
        "lng": 103.8544847802915
      },
      "southwest": {
        "lat": 1.364057919708498,
        "lng": 103.8517868197085
      }
    }
  },
  "name": "Bangkok Street Mookata - Ang Mo Kio",
  "place_id": "ChIJYYPvW-IW2jERC_bxqS5N7Fo",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "carmen l.",
      "author_url": "https://www.google.com/maps/contrib/118402978624883148533/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXhcH1HLvtz5RRA14flN7mnToqmKuKi8INIixFBmRSc3BRW9Bmt=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "been here twice at this point, but it never disappoints! prices are generally really affordable, with around $10 per pax.\n\nit’s in a coffee shop under hdb blocks, and it opens till 2am, which means you’re able to get your late night supper fix here.\n\nthey block the fire with aluminium foil so the wind would not blow it out, which i think is really smart to do.\n\nwe ordered 6 meats and we were already full by the 3rd plate. if you want more bang for your buck, do not get the mookata set unless you’re an avid seafood lover or you prefer not having to pick everything on your own. it’s more costly to get the set as compared to getting ala carte honestly.\n\nthe broth is vegetable based and mild in taste. get the thai noodles if you want a tom yum seasoning packet to add to the broth, or maybe 2 because 1 didn’t feel like it was enough after refilling the broth a couple times.\n\noverall, my partner and i felt extremely satisfied and happy from the meal! very delicious, will come back again for sure. 😋",
      "time": 1737906393,
      "translated": false
    },
    {
      "author_name": "Darren Lee",
      "author_url": "https://www.google.com/maps/contrib/114331438677429094505/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXNHaGXgL3Ze4JBW9o3aZ9WeacOcwrJEbHkngXBwrR7DBxbaZOq=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "Celebrated Father's Day dinner with my family, and what better way to do so than with a good old Mookata in the heartlands. Bangkok Street Mookata has several branches across Singapore, but I've always felt that the one in Ang Mo Kio is the best. I used to visit frequently, and when I returned last Saturday, I was pleasantly surprised to see that the coffee shop had been renovated for the better. There are more seats, better spacing, improved lighting, and cleaner facilities, including a much-improved toilet. Overall, the atmosphere has significantly improved following the renovation.\n\nThe mookata was as good as ever, with generous portions at reasonable prices. Their garlic chicken remains the superior go-to dish and is a must-have. Other recommended dishes include bacon, quail eggs, luncheon meat, and, of course, tom yum maggi. What truly sets them apart and elevates their mookata experience are their two chili sauces. One is a thick, sweet chili, and the other, my personal favorite, is a wetter, spicier chili that resembles chicken rice chili sauce.\n\nA new addition is their collaboration with the Thai cuisine store, allowing customers to place orders from them as well. We tried the Moo Ping, which was excellent—rightfully so, as it is run by a Thai family. I look forward to trying more of their dishes, such as basil chicken rice and tom yum soup, on my next visit.\n\nThe staff are nice and attentive, always ready to help change the gas or refill the soup. It can get quite crowded, with long queues on weekend dinners, so be prepared to wait a bit. Nonetheless, it's worth the wait, and Bangkok Street Mookata is a great place to gather with friends and family for a hearty meal. Highly recommended!",
      "time": 1718631565,
      "translated": false
    },
    {
      "author_name": "Ender Berry",
      "author_url": "https://www.google.com/maps/contrib/111484501924596378031/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUbJgNRyZN9fgLcL-5HBoAUc2yIwMbA0hG7yBcAg_1OYsOWMX5d=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Nice place I've went regularly for some nice and cheap food. Used to go there often when I trained nearby just to chill, eat dinner with friends, and just talk. Atmosphere wise it can get pretty crowded during dinner time but I've never minded it much. Great place to go on a budget for a nice big portion to talk and grill for hours",
      "time": 1738223198,
      "translated": false
    },
    {
      "author_name": "Eve C",
      "author_url": "https://www.google.com/maps/contrib/109756518746414930822/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUQU3wOFRLMgNb3VcKY8wCYgWAjbktK7DbOQ0RgmSSo7MlZ8AJrJQ=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "10 months ago",
      "text": "I was surprised to see the place packed at 5pm on a Sunday and decided to try it.  Definitely one of the best mookata I eaten.  Most importantly the food was priced very affordable.  Some may argue that it was cheap because the portion was small but I like the portion small with an equivalent price placed on it so I can better control what I eat and eat what I like.  Marinated food was delicious. Queue poles were there to manage queues and seats assigned by staff.\n\nWould love to be a regular here.",
      "time": 1721459902,
      "translated": false
    },
    {
      "author_name": "Ars 3276",
      "author_url": "https://www.google.com/maps/contrib/114029124935079806014/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVqD6Z7ryvjDIcgRwGDM6qJg1xwvfEd5W7bWNSozRkTwe910AFrGw=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 3,
      "relative_time_description": "a year ago",
      "text": "I actually came for other food but entire place seems to be monopolize by Mookata.\nUnable to find any table at all and i kinda pity the other stalls.\nAsked the lady and she told me i would have, if i'm eating mookata.\n\nOk so here i started my mookata meal.\n\nOverall wasn't too bad. U can skip their beef, it sucks.\nOther meat were quite good.\nSeafood is alright as well.\n\nVery good business indeed as 85% of tables were having Mookata.",
      "time": 1704027088,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "restaurant",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6551696420732270091",
  "user_ratings_total": 627,
  "vicinity": "421 Ang Mo Kio Avenue 10, #01-1149"
}