{
  "formatted_address": "6 Tebing Ln, #01-04, Singapore 828835",
  "geometry": {
    "location": {
      "lat": 1.3925667,
      "lng": 103.9167709
    },
    "viewport": {
      "northeast": {
        "lat": 1.394075130291502,
        "lng": 103.9179228302915
      },
      "southwest": {
        "lat": 1.391377169708498,
        "lng": 103.9152248697085
      }
    }
  },
  "name": "Banyan Beer Garden",
  "place_id": "ChIJt5Pvx3892jERXWxKcNCNPDs",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "oXRYSTALo Ong",
      "author_url": "https://www.google.com/maps/contrib/114556064085815871377/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSTtKcF9FYMbh-XNbDu8f7Whl3gi-ZY6T8pFPOm3v9Y98Ws7jL=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Banyan Beer Garden (Punggol): A Relaxing Oasis with Great Ambiance (4/5 Stars)\n\nRating:\n\n• Atmosphere: 4/5 (Versatile atmosphere with a cozy indoor bar and a romantic, tropical patio, perfect for unwinding)\n\n• Drinks: 4/5 (Good selection of refreshing beers at reasonable prices)\n\n• Service: 4.5/5 (Friendly and thoughtful service from the owner)\n\n• Value: 4/5 (Good value for money with the combination of atmosphere, drinks, and service)\n\nOverall: 4/5\n\nDonkey and I were looking for a chill spot to unwind and enjoy some good craft beer. Banyan Beer Garden, located near the Punggol Har Bin prawning area, seemed like the perfect place with its “relaxed oasis” promise. And it definitely delivered on the atmosphere.\n\nThe ambience was versatile, offering a choice between two distinct vibes. The bar featured a rustic-industrial chic design with exposed brick, wooden beams, and a textured wood bar, creating a warm, inviting space that felt slightly aged and cozy. The dim, warm lighting and casual seating, both at the bar and under the covered patio, made it feel super relaxed.\n\nThe covered patio itself transformed the vibe into something more romantic and tropical. String lights and lush greenery added to the ambiance, while casual wicker furniture and ceiling fans made it feel comfortable and perfect for socializing. It was a perfect blend of a cozy indoor hideaway with a little touch of an outdoor oasis. The place was also breezy and not stuffy, which was great, especially in the Singaporean heat.\n\nWe decided to settle in on the patio, enjoying the breezy evening and the twinkling lights. The atmosphere was just what we needed—relaxing, inviting, and perfect for enjoying a good conversation over a few drinks. I had a 1664 Blanc with peanuts, while Donkey had a Connor’s Stout Porter. The beer was refreshing and reasonably priced. The atmosphere was enhanced by a light, soothing soundtrack of Chinese music, which added a nice touch.\n\nThe inviting atmosphere made us feel comfortable and relaxed, like we were in a hidden gem, away from the hustle and bustle of the city.\n\nWe feel that Banyan Beer Garden has a lot of potential to become a popular spot. The beer selection is good, the atmosphere is great, and the music adds a nice touch. It’s also conveniently located near Punggol Park, and you can even see people prawning nearby, which adds to the local charm. The shop owner was incredibly friendly and provided great service. He even brought me a ziplock bag to keep my leftover peanuts in, which was a thoughtful touch.\n\nThe snack menu offers a good selection of bar bites, with options like crispy chicken tulips, karaage squid, tater tots, fries, chicken nuggets, chicken popcorn, and cuttlefish balls. It would be great to see some more unique and interesting bar snacks in the future, but the current options are a good starting point.",
      "time": 1739288014,
      "translated": false
    },
    {
      "author_name": "Doraemon",
      "author_url": "https://www.google.com/maps/contrib/112665277904119154671/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX2VSCcaT9axvOwx2nD8XD3PgZ8V5VFnv420aocMSfLa6GlcEmN=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Kitty and I were looking for a chill spot to unwind and enjoy some good craft beer. Banyan Beer Garden, located near the Punggol Har Bin prawning area, seemed like the perfect place, with its \"relaxed oasis\" promise. And it definitely delivered on the atmosphere.\n\nThe ambience was really versatile, offering a choice between two distinct vibes. The bar features a rustic-industrial chic design with exposed brick, wooden beams, and a textured wood bar, creating a warm, inviting space that felt slightly aged and cozy. The dim, warm lighting and casual seating, both at the bar and under the covered patio, made it feel super relaxed.\n\nThe covered patio itself transformed the vibe into something more romantic and tropical. String lights and lush greenery added to the ambiance. The casual wicker furniture and ceiling fans made it feel comfortable and perfect for socializing. It was a perfect blend of cozy indoor hideaway and a little touch of outdoor oasis. The place is also breezy and not stuffy, which is great, especially in the Singaporean heat.\n\nWe decided to settle in on the patio, enjoying the breezy evening and the twinkling lights. The atmosphere was just what we needed – relaxing, inviting, and perfect for enjoying a good conversation over a few drinks. Kitty had the 1664 Blanc and I had the Connor's Stout Porter. The beer itself was refreshing and reasonably priced. The atmosphere was enhanced by a light, soothing soundtrack of Chinese music, which added a nice touch. Kitty also bought a packet of peanuts to go with her beer.\n\nThe inviting atmosphere made us feel comfortable and relaxed, like we were in a hidden gem, away from the hustle and bustle of the city.\n\nWe feel that Banyan Beer Garden has a lot of potential to become a popular spot. The beer selection is good, the atmosphere is great, and the music adds a nice touch. It's also conveniently located near Punggol Park, and you can even see people prawning nearby, which adds to the local charm. The shop owner was also incredibly friendly and provided great service. He even brought Kitty a ziplock bag to keep her leftover peanuts in, which was a thoughtful touch.\n\nThe snack menu offers a good selection of bar bites, with options like crispy chicken tulips, karaage squid, tater tots, fries, chicken nuggets, chicken popcorn, and cuttlefish balls. It would be great to see some more unique and interesting bar snacks in the future, but the current options are a good starting point.",
      "time": 1739286101,
      "translated": false
    },
    {
      "author_name": "Joel",
      "author_url": "https://www.google.com/maps/contrib/110645823735940428298/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJY_bs209xyACazhCbs1cS3ypY29F4xt1KcHLL0nS1nOO2nUOcv=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "5 years ago",
      "text": "80 per tower. Quite ulu for the price. Good to have toilets (portable here)",
      "time": 1565272234,
      "translated": false
    },
    {
      "author_name": "khor spencer",
      "author_url": "https://www.google.com/maps/contrib/102498339211554525935/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLepg9DVFQcffpdagpBJF1HdFug9TYZWq1Vt5LzZPV_UAizyw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "5 years ago",
      "text": "Alittle overpriced for just fried food, $7 for 8 pieces of onion rings.",
      "time": 1570275102,
      "translated": false
    },
    {
      "author_name": "Chris Chris",
      "author_url": "https://www.google.com/maps/contrib/102028354569207672938/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIUGBFB4-u4XK0bbTLa8Q6UwfgqdvpkZ7BBmPSkQbiP9Iqhag=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "Is a nice place to chill although the food varieties not much.",
      "time": 1579353778,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4268442473217027165",
  "user_ratings_total": 12,
  "vicinity": "6 Tebing Lane, #01-04"
}