{
  "formatted_address": "55-57A Haji Ln, Singapore 189248",
  "geometry": {
    "location": {
      "lat": 1.301152,
      "lng": 103.85869
    },
    "viewport": {
      "northeast": {
        "lat": 1.302526130291502,
        "lng": 103.8600709302915
      },
      "southwest": {
        "lat": 1.299828169708498,
        "lng": 103.8573729697085
      }
    }
  },
  "name": "Bar Stories",
  "place_id": "ChIJ4cva-rAZ2jERj-ZgtryGGEI",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Perry Dina",
      "author_url": "https://www.google.com/maps/contrib/116029868943637244401/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWDcJRQlK5R4fBZH1wimcKxlll8ywq9ah0-B0NsgwQ98Jg7fJ0=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Bartenders concoctions are customized to your preference and they do a fantastic job!!! I was happy with my passion fruit martini! Had some rosemary and lime in it. Also had a whiskey sour which was bomb. Service was great!! Our bartenders were super friendly and also gave recs for things to eat and do in the city! Highly recommend!",
      "time": 1747122901,
      "translated": false
    },
    {
      "author_name": "Nomnomnoted",
      "author_url": "https://www.google.com/maps/contrib/109791542087842534857/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW-LrsBGAuxSU6GZk7G1ZORqaVGJQApCEwGOKgxxFVmUZrWni7Hbg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "5 months ago",
      "text": "Cocktail Paradise: A Must-Visit for Drink Lovers\n\nIf you’re after a one-of-a-kind drinking experience in Singapore, this is the place to be! I’ve visited multiple times, and the creativity of the mixologists never fails to amaze me.\n\nHere’s the magic: just share your choice of liquor, preferred flavors, and vibe (refreshing, sour, sweet, tropical—you name it), and they’ll craft a unique cocktail tailored just for you. My first visit? I asked for a berry, lime, and gin-based experience, and they created six incredible variations—tropical, refreshing, and more. They even handed me a box of fresh raspberries. Talk about going the extra mile!\n\nThough the vegetarian food options are limited, the drinks alone are worth the trip.\n\nRatings\nCocktails: ⭐⭐⭐⭐⭐\nService: ⭐⭐⭐⭐⭐\nAmbience: ⭐⭐⭐⭐☆\nFood: ⭐⭐⭐☆☆\n\nTL;DR: Inventive cocktails, stellar service, and an unforgettable experience. Drink lovers, don’t miss this spot!",
      "time": 1733216968,
      "translated": false
    },
    {
      "author_name": "Chris Mann",
      "author_url": "https://www.google.com/maps/contrib/113972602713733086192/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXCL-CTqVOTl46nP4MyZTq3UXz9pcTuMrD-9KCfFUPVoCyLxoPn=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "This upstairs spot has some incredibly talented mixologists.  The cocktails are invented on the spot based upon your spirit choice and preferred flavor profile.  Just delicious.",
      "time": 1735988331,
      "translated": false
    },
    {
      "author_name": "Katie Kozuki",
      "author_url": "https://www.google.com/maps/contrib/115646419272736659461/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVWtAcWH77TtIHkP0bykXAqamLMB8D4xZJNUpW8zweYzotypv7YeQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "This cocktail bar is a true hidden gem!  It's tucked away in an unassuming, casual space overlooking the colorful Haji Lane (look for the stairwell to the right of Habibi-san!).  There's no set cocktail menu, so come with your ideas and  preferences, and head mixologist Dave and his team will craft a custom cocktail to your liking.  Literally every drink I had was well-balanced, delicious, and really reflected the notes I had given.  You can order food off the Habibi-san! menu, which is a fusion of Middle Eastern and Japanese flavors - and it all works surprisingly well together.  I had the roasted brussel sprouts  with bonito, mentaiko labne with tobiko, babaganoush, and several kushiyaki skewers (pork jowl and chicken hearts) - and it was all delicious.  You can't go wrong with a place that melds exceptional cocktails, tasty food, and truly friendly + fun staff (Kalai and Dave were so memorable!) - I highly recommend this!",
      "time": 1728974324,
      "translated": false
    },
    {
      "author_name": "Duck",
      "author_url": "https://www.google.com/maps/contrib/117904743162254979692/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU7dpUh9ZvRa6NL6InDsB6PimwVkuKE9wAh_Uybx4EJyQnjRFY=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "7 months ago",
      "text": "I visited Bar Stories, a bar located on the second floor of a restaurant-bar combo. While I didn’t try the food, the dishes at neighboring tables looked quite appealing, and the place was packed, so reservations are definitely a must. Fortunately, we were able to secure a spot just 30 minutes before arriving and were seated at the bar counter.\n\nOne of Bar Stories’ defining features is that they don’t have a drinks menu, which allows the bartenders to get creative. While this could imply a higher level of craftsmanship, the result didn’t quite live up to the hype. We ordered two drinks, both of which were visually impressive—one with a flaming fruit garnish and another topped with a torched marshmallow. However, we noticed that the bartender repeated the same dramatic touches for multiple drinks throughout the night, which made the experience feel a bit less special. For the $30 price tag per drink, I had expected a more unique or personalized experience.\n\nThe bar was busy, and service was a little slow, but overall, the atmosphere was decent. It’s a place with a lot of potential, but the repetitiveness of the drink presentation took away from the novelty.",
      "time": 1729097905,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4762704751016076943",
  "user_ratings_total": 739,
  "vicinity": "55-57A Haji Lane"
}