{
  "formatted_address": "1 Cuscaden Rd, Level 2, Singapore 249715",
  "geometry": {
    "location": {
      "lat": 1.3046567,
      "lng": 103.8249439
    },
    "viewport": {
      "northeast": {
        "lat": 1.305888830291502,
        "lng": 103.8263550302915
      },
      "southwest": {
        "lat": 1.303190869708498,
        "lng": 103.8236570697085
      }
    }
  },
  "name": "Basilico",
  "place_id": "ChIJPTigtosZ2jERpvAxTkMlsac",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Belle Bella",
      "author_url": "https://www.google.com/maps/contrib/108370683456675825877/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWrRRig3aqXUSbfGBLLhoTr-2E8IsH1S6TpJ9lXCRiNcgvJXOsCcA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "First time coming here after introduced by a friend to try out their range of cheese if you are cheese lover. Alot of interesting choices and fusion cheese mixed with chocolate or alcohol.\n\nCold food snow crab legs and prawn were fresh but the other shell fishes were not that fresh and great.\n\nHot food beef and lamb were nicely cooked with medium rare. Love the redness.\n\nRestaurant Manager Raphael walked to check on customers time to time (regardless of your status) and engaged small talks with us.  great personality and service!",
      "time": 1745747356,
      "translated": false
    },
    {
      "author_name": "richard sunga",
      "author_url": "https://www.google.com/maps/contrib/101915776636626569239/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLRSb5yY9wTAlYknsjdMLF80PC068U1SQVR2N59DPpxJ9KUeQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Basilico comes up when you google Best Italian Buffet, and she ia right! Went on a monday lunch in May and paid with $68 Chope voucher(no need to pay ++). Good pizza. Good pasta. Good antipasti. And my fave are the 6 types of buffala cheese. Great creme brulee.",
      "time": 1747135727,
      "translated": false
    },
    {
      "author_name": "Bloody Toad",
      "author_url": "https://www.google.com/maps/contrib/113593135148233291633/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJooAGd1Q2h9WWYjEtkzermDgY3f0RcQXkZcKRrE6OLKjOnKQ=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "5 months ago",
      "text": "Italian buffet, quite some varieties of food, but not everybody's taste bud of course. Food did taste good. The service was great! Waiters were quick enough to clear my plate and re fold my napkin while I went out to hunt for other food to try. They also topped up our water glass frequently.\n\nAll in all,  the waiters were efficient. Kudos for the great service!",
      "time": 1734714883,
      "translated": false
    },
    {
      "author_name": "Ivan Teh",
      "author_url": "https://www.google.com/maps/contrib/114332345573544911646/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV5w6w1Nz613H-FTdYMJdrdrsR43y5bcInG5AtU7Oxf59DHDoeK=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Dining Experience @ Basilico.\n.\nRenowned for its authentic Italian cuisine and elegant dining experience. Offering ala-carte, semi-buffet, and full buffet options, Basilico is well-regarded for its use of high-quality ingredients and traditional Italian recipes, and perhaps best known for their massive cheese room with an impressive selection of over 40 varieties of artisanal cheeses.\n.\nAmbience has a quiet elegant splendour. The spacious dining hall is carved into different sections, each with its own unique atmosphere; from semi-private lounge seating to bar-front seats to casual comfortable dining hall seats. Warm diffused lights are used, casting soft illumination over the generous and beautifully arranged food displays. The cheese room has an air of luxury, the aroma of cheese perfuming the air.\n.\nService is refined, discrete, attentive, and professional. Staff look after specific sections, and are able to accord guests with good attention and engagement. They clean up finished plates promptly, so you rarely have to stack dishes when returning from the buffet displays. Staff also top up water glasses semi-proactively, though this could be improved. The chefs at each buffet display demonstrate great product knowledge of their items.\n.\nFood is Modern Italian cuisine. Dishes are made using the freshest ingredients, and the manner of presentation is appealing and enticing. There's over 40 different dishes for the full buffet and semi-buffet, and it's replenished quickly during the stated buffet hours. The ala-carte dishes are of similarly high quality. The cheese room is the star, with about 30 varieties of artisanal cheese available. Portions are naturally unlimited for a buffet. Prices command a value-for-money premium, budget about SGD $128++ per person.",
      "time": 1741606820,
      "translated": false
    },
    {
      "author_name": "purple taste",
      "author_url": "https://www.google.com/maps/contrib/102668978906728306586/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVIc8ZqU1s-hY-l8FXBi0kbB7IPOmo2LCgVQ_P3ZJanf7ae2dBL=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Visited for the Saturday Weekend Brunch. Lovely staff at the restaurant entrance. She has a beautiful smile and helpfully explained the location of the cheese room and the bar.\n\nThe cheese room was nice and one could ask for recommendations from the Chef there.\n\nI enjoyed the oysters especially the Australian Oceanlink ones. The foccaccia brought by the staff to the table was also flavourful and fluffy.\n\nThe place was not too crowded. Another pleasant surprise was the table visit by the roaming Chefs to offer a dessert or two.\n\nSole fish was my favourite, and the roasted pork knuckle was nicely tender. Don't forget to get some of the crispy skin too. Risotto was rather mild. Lasagna and seafood cavatelli were enjoyable.\n\nFor ice cream, I loved the coconut flavour. The cakes were pretty and so tempting.",
      "time": 1742041366,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12083480246216683686",
  "user_ratings_total": 1470,
  "vicinity": "1 Cuscaden Road, Level 2"
}