{
  "formatted_address": "1 Toa Payoh N, Singapore 318990",
  "geometry": {
    "location": {
      "lat": 1.3416799,
      "lng": 103.8518807
    },
    "viewport": {
      "northeast": {
        "lat": 1.343298380291502,
        "lng": 103.8530079802915
      },
      "southwest": {
        "lat": 1.340600419708498,
        "lng": 103.8503100197085
      }
    }
  },
  "name": "Beatty Secondary School",
  "place_id": "ChIJ13CgF2wX2jERG-papLrcu8w",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "czy",
      "author_url": "https://www.google.com/maps/contrib/110997475907161202562/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUTzdt8SLRF_sqPKvuOR5dTSUBAL9IOmneGVyynvcHfg468PwHj=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "3 months ago",
      "text": "School is overall better than that of average Singaporean schools. There's many cases of yp/vaping/bullying\nTeachers are Ok except for a few who are rude and biased.\nChem and humanities dept is good, physics dept not good, and maths dept is ok.\nAmenities wise, they promised us a lift since 2020 and still not constructed.\nPrincipal is ok but he yaps\nGeneral office staff are rude and have very low patience\nAnd for ccas I recommend the Infocomm club/choir if ur a slacker and I don't recommend band/volleyball because they have toxic environments and very time consuming, (band every Monday have to wake up earlier to play anthem and school song so beware)\nSchool feels like got no budget aswell, keep focusing funds on wrong part of school such as renovating the foyer and lvl 2 classrooms when we really need lift and maybe toilet upgrades\nOverall Ok school but if you have a higher AL score please join a higher ranked school however if ur AL score is 18 then this is the best u can get",
      "time": 1738499442,
      "translated": false
    },
    {
      "author_name": "extra",
      "author_url": "https://www.google.com/maps/contrib/114957833345780826336/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKK2mDNDBoffgUQRTo_C7FMJn2S01dyaTb8lOLCnygyhpliwA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "Its so bad i wanna give it a 0\nWhat is wrong with your teachers? No braid allowed even though handbook says braid your hair? no bun???? And calm down about the earrings... your teachers are acting like victorian men seeing ankles for the first time. Get a grip",
      "time": 1738683349,
      "translated": false
    },
    {
      "author_name": "Bones",
      "author_url": "https://www.google.com/maps/contrib/102273887373119645665/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVWMtitTTadQEgm-wF0E1a_6hRg9hq21NOZ5SGdR0vQIVnbzVI=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "6 months ago",
      "text": "I would give 1 star but I'm feeling nice. Firstly, principal keeps talking non-stop like I get its a speech but there's NO NEED to keep repeat DREAM in every speech he makes, although yes it can be helpful, but really, it gets annoying after a while. Leadership... the chosen people, at least during my time are mostly just popular people, whether their actually capable of leadership is another thing. Sorry to say but NFS teachers here are just gossip girls and I recommend keeping your teachers in check as yes, there are some good teachers who actually care about student's wellbeing and learning, but some are much more unprofessional and incapable of teaching. At least they are finally building a lift in 2024. Students here are a joke, not all but some really need to get checkups on their mental wellbeing. Lots of YPs and xmms, vapers, smokers(more vapers though) and people who will do about anything for attention. Also, phones are not allowed to be used in school EVEN after school hours. Only can be used at canteen or foyer after school hours. It would be great if we could use our phones during breaks and after school hours as some of us need to check when our bus comes and rush home. I feel that mental health is not really taken seriously in this school but I won't elaborate. Overall, two stars, also did I mention the GO staff are rude?",
      "time": 1730855522,
      "translated": false
    },
    {
      "author_name": "QingQiu Shen",
      "author_url": "https://www.google.com/maps/contrib/111152630488973102993/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJhppMe3klb1x28t4kHJyNp91mUkWVSV3oUrDINfb5W4ozCYA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "The discipline here is crazy, I see girls walking around with 2 of their buttons of their polo t shirt unbuttoned and for some reason they never get caught but a teacher came to my friend and told her that she has to put her hair in a ponytail?? For your information her hair was in a bun and had a side ponytail",
      "time": 1737629569,
      "translated": false
    },
    {
      "author_name": "Shivani",
      "author_url": "https://www.google.com/maps/contrib/101252847852365627538/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWXua3M9TG9G1vx5YvPZeLuToSyJxeSNiIuT48Odo7MzBNSrHC4=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "6 months ago",
      "text": "honestly this sch is not that bad, if you compare to other sec schs. The difficulty level is quite high for G3, esp for math and science which is why it’s not entirely a bad sch. But got a lot of cases of bullying and vaping and not much is done to prevent it from happening. It’s become a very common thing. GO staff can be quite condescending.",
      "time": 1730979719,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14752627698561640987",
  "user_ratings_total": 85,
  "vicinity": "1 Toa Payoh North"
}