{
  "formatted_address": "176 Orchard Rd, #05-16 The Centrepoint, Singapore 238843",
  "geometry": {
    "location": {
      "lat": 1.3019805,
      "lng": 103.839695
    },
    "viewport": {
      "northeast": {
        "lat": 1.303087880291502,
        "lng": 103.8412484802915
      },
      "southwest": {
        "lat": 1.300389919708498,
        "lng": 103.8385505197085
      }
    }
  },
  "name": "Beauty in The Pot 美滋锅 at The Centrepoint",
  "place_id": "ChIJ-131x5YZ2jEROumyYjpVEIU",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Kevin (AussieFoodieAdventures)",
      "author_url": "https://www.google.com/maps/contrib/107203837341723663240/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKhH3ORwgBxPneR8rKfe9BmN0hHZNzAU_F6q8jk5Ja-yxeJ-g=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "The collagen soup is one of their signature soup bases. It is rich, flavorful and very tasty. I like pairing the collagen soup with another lighter soup base - my other favorite is the simple chicken broth. The variety of options is vast and I absolutely love the half portions which allow you to try the different ingredients. Everything we ordered looked well presented and was good quality. Service was fantastic. Our wait staff constantly kept out broth topped up and skimmed away the top layer of fat (I think) from the collagen broth. The iced guy shots at the end were a nice treat to end the meal.",
      "time": 1740914768,
      "translated": false
    },
    {
      "author_name": "Jo Ong",
      "author_url": "https://www.google.com/maps/contrib/100842784750707953901/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXuLyoa1W95c4EYSDHJAe0mJwS_K6yJTX-Oz0c3V3jmm8P8nu8XgA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "5 stars\nVisited Beauty in The Pot at The Centrepoint and was thoroughly impressed. The collagen broth was rich and flavorful, making it a standout among the soup bases. The variety of ingredients, from the tender US Wagyu beef to the fresh seafood options, was top-notch. The service was exceptional; staff were attentive, ensuring our broths were consistently topped up and even offering shawls when it got chilly. The ambiance was elegant, with spacious dining areas. A delightful touch was the complimentary yuzu dessert at the end, providing a refreshing finish to the meal. Highly recommend for anyone seeking a premium hotpot.",
      "time": 1744979767,
      "translated": false
    },
    {
      "author_name": "A B C Traveller",
      "author_url": "https://www.google.com/maps/contrib/116585614877993483182/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU0LsuPMTT41P4vauMG4j9XRUCYVlSapMZWfq0mk0SVBO8vzVVFDg=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "It is one of the most famous hot pot restaurants in town. I had a chance to try it in other countries, this is the first time I have a chance to try it in Singapore. We arrived at this branch at 5.30 PM and we did not book in advance. We need to book a VIP room or we need to wait until 10 pm. We came in a big group so we don't mind getting our own room for dinner. The waiter in charge of our room is a young energetic man. He is fluent in English and very enthusiastic about serving us to the best level. We ordered a full table of food and each of us enjoyed different soups. I had my own collagen pot. I love the presentation of the food and freshness of the seafood. Check my pictures for more. Highly recommended for locals and tourists.",
      "time": 1735660723,
      "translated": false
    },
    {
      "author_name": "Eve Loh",
      "author_url": "https://www.google.com/maps/contrib/107735431621898661853/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXM-G6_9-k2hXRMh-XbleRXbZuRrl0RiRZzjWZL6SHQlDlVflMN=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We were celebrating my triplets’ birthday and requested a cake for each of them. To our surprise, the team generously provided three complimentary cakes without hesitation—such a thoughtful gesture!\n\nThe food was fresh, flavorful, and generously portioned—we especially loved the collagen broth. The highlight, however, was the exceptional service, especially from Ah Yong, the restaurant manager. It wasn’t until towards the end of our meal that we realised he had moved from Star Vista branch to Centrepoint. Having known him since his time at Star Vista, it was great to see his professionalism and warm hospitality remain top-notch.\n\nHighly recommend this outlet for great food and excellent service. Thank you, Ah Yong and team, for making our celebration so special. We’ll definitely be back!",
      "time": 1743262421,
      "translated": false
    },
    {
      "author_name": "Yeewen Ivy",
      "author_url": "https://www.google.com/maps/contrib/116436436762961611511/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWFy7KzbVoDsNez9ZiNGko413C881cjVX7k-rgAb6qUDsdZEiVy=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Fantastic experience for dining in VIP room! Privacy enough and you can enjoy your song with Bluetooth connected in the VIP room! Excellent and professional service from Helen! She is passionate and friendly to warm us during our dining experience! The set up in the VIP room was nice and neatly! Definitely will come back again because of Helen!",
      "time": 1742219183,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9588257315924142394",
  "user_ratings_total": 2311,
  "vicinity": "176 Orchard Road, #05-16 The Centrepoint"
}