{
  "formatted_address": "Oasia Resort Sentosa Hotel, 23 Bch Vw Rd, #01-02 Palawan Ridge, Singapore 098679",
  "geometry": {
    "location": {
      "lat": 1.2531961,
      "lng": 103.8194919
    },
    "viewport": {
      "northeast": {
        "lat": 1.254646230291502,
        "lng": 103.8206808302915
      },
      "southwest": {
        "lat": 1.251948269708498,
        "lng": 103.8179828697085
      }
    }
  },
  "name": "Bedrock Origin - Steakhouse @ Sentosa",
  "place_id": "ChIJTRAkJcMb2jERn2_5B9Y0kRc",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Nigel Kaw",
      "author_url": "https://www.google.com/maps/contrib/103561961915657205716/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIQRp9Nl_aZlLnL6rVLuPtC3-6aruQVyn0Ovfdwz_x0DQQ8hA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "First time at Origin. Like previous reviews, service was excellent. Attentive and thoughtful without being overbearing.\n\nTheir steaks were expertly dry aged and cooked competently. Sides were generously portioned. The corn was delicious but would have liked a bit more char and seasoning on the brussel sprouts\n\nAmbience was relaxed though it seemed like it was a little unsure deco wise whether it wanted have a darker, warmer vibe like its siblings fireplace and bedrock or a brighter 1960s feel\n\nThank you remembering that we were celebrating a birthday.\n\nWill be back to try the seafood",
      "time": 1746954874,
      "translated": false
    },
    {
      "author_name": "Janine kathryn",
      "author_url": "https://www.google.com/maps/contrib/114597361726876817870/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWaC6kLIpCiPOgFWahT-ecJSRJ521cA84SXCQgm0BiKDFFh47j1=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Our experience was wonderful and spectacular - the staff were amazing, super helpful and overall made our experience so so good at Bedrock Origin @ Sentosa. Shoutout to Ms Maricel and the team for their great service.\n\nI highly highly highly recommend their Bedrock Mac&cheese, bone marrow starter and the Bedrock Black Pepper steak that we did a double order! YUMS! 🤤🤤\n\nTheir sides such as the mushroom, Brussel sprouts and Asparus is also a great pair to have. Not to mention, BOMBE ALASKA is a must to try too for a rare experience and a yummy sweet treat after the whole meal.\n\nOverall a wonderful experience for us, and would definitely come back! 🤩🤩🤩",
      "time": 1744981767,
      "translated": false
    },
    {
      "author_name": "SP T",
      "author_url": "https://www.google.com/maps/contrib/103895907099943741725/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJF_PW_RG6gVEKzZxmzHC-zylnqPeEFezv76kUPSIBcxlKtqA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Like many others , we were blown away by Meet’s impeccable service. It was our first time dining at Bedrock hence we do not have any prior experiences to compare with . But here’s my honest thoughts .\n\nThe freshly served naan was definitely unique compared to places that serves bread. Loved the pairing of butter n garlic. French onion was probably on the sweeter side for us, but quickly fixed with some fresh pepper from the staff. We had both the signature pepper wagyu steak and the dry aged ribeye. Both were medium rare but i personally enjoyed the ribeye more. The wagyu steak was strangely a little bit coarse n tough to bite, even though it should have more fat content. Unfortunately none of the sauces (we tried all) impressed us. Pairing it with salt and pepper may be the best way to go .\n\nWe ordered the brussels sprouts which was supposed to have chilli oil in them, as stated in the menu. However, we could barely see or taste a tinge of red. It was very very bland with little to no seasoning tasted . Checked in with Meet and he kindly offered to change to an asparagus dish for us . Though we also found the asparagus to be cooked a little too soft than usual restaurant standards, we didn’t want to cause any more inconveniences. However this will not hinder us going back to try other veg dishes.\n\nWe did not get the name of the male Indian manager but he and Meet both kept checking in on us to make sure we had a great experience. We were also served a really delicious off the menu cheesecake dessert and a polaroid picture to end the day with. Would definitely recommend this location to anyone who is craving for steak.",
      "time": 1743786829,
      "translated": false
    },
    {
      "author_name": "Ming Shen Tham",
      "author_url": "https://www.google.com/maps/contrib/116082735539712168059/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLGrMZ5UuB0fyolyPuJlKXs_jnFqr1bJiIw06AcP6YaQ8GAbQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Came here with my family on a weekend, courtesy of my brother’s treat. Interestingly, this place used to be a Chinese restaurant over 20 years ago, so my mum got all nostalgic reminiscing about the past.\n\nSince we had a dog with us, we were seated outdoors, but despite the lack of air conditioning, it was still relatively cooling thanks to the fans around.\n\nThe service was excellent—our waiter was friendly and engaging, striking up small talk while we waited for our food. Given that some dishes took a while to arrive, the conversation helped pass the time so we weren’t just sitting idly.\n\nAs for the food, it was impressive. We ordered a variety of sides, including:\n\nKingfish sashimi – had a nice acidity that stimulated the appetite\n\nMac & cheese – as expected, rich and full of cheesy goodness\n\nBrussels sprouts – well-cooked without the overwhelming buttery aftertaste\n\nBeef rice – infused with beef fats for an intense flavor, but not overly greasy\n\nFor the main, I had the classic pepper steak, which was fantastic for the first few bites. The fat added great flavor, but by the last few bites, it started to feel a little too greasy, making it hard to finish.\n\nThankfully, we ordered the Bombe Alaska, which was not only sweet and satisfying—helping to neutralize the richness of the steak—but also came with a cool “fire show”. The waiter heated the alcohol and poured it over the dessert, creating a flaming effect that was a fun way to end the meal.\n\nOverall, great service and food, and I’d definitely visit again!",
      "time": 1743606991,
      "translated": false
    },
    {
      "author_name": "MH Tham",
      "author_url": "https://www.google.com/maps/contrib/112376174358198242550/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXJ4tOLbvkkJYRe2LZw4PmTrCsbezMPVke50H01b6T0gSd095fp=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Huge shoutout to Meet, who has made all our visits to Bedrock Origins such a pleasure. We first went in 2022, post-covid and craving a good steak.\n\nMeet introduced us to the Triple+ membership during our first visit and helped us order exactly what we didn’t even know we wanted, which was tender, medium-rare meat with a nice char. Since then, “medium rare charred” has become our default and we soon learnt that it was known as “Pittsburgh-style” at most respectable steakhouses.\n\nSince then, we would pop by Bedrock Origins whenever a steak craving hits. After we got a dog, we were delighted to find out the place is outdoor pet-friendly too. Over the years, we’ve had amazing meals here with friends and family, and the experience never disappoints.\n\nFor our recent visit, special mention goes to the Flaming Bombe Alaska. Meet has really leveled up on his flaming skills! Our favourite dessert is now made better as it is beautifully flamed and caramelised.\n\nDefinitely recommend checking out the Triple+ deals, the great grills, and of course, the top-notch service.",
      "time": 1743316667,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "bar",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1698196628356820895",
  "user_ratings_total": 955,
  "vicinity": "Oasia Resort Sentosa Hotel, 23 Beach View Road, #01-02 Palawan Ridge"
}