{
  "formatted_address": "601 Ang Mo Kio Ave 4, Singapore 569898",
  "geometry": {
    "location": {
      "lat": 1.3745994,
      "lng": 103.8374405
    },
    "viewport": {
      "northeast": {
        "lat": 1.376056830291502,
        "lng": 103.8387532302915
      },
      "southwest": {
        "lat": 1.373358869708498,
        "lng": 103.8360552697085
      }
    }
  },
  "name": "Bethesda (Ang Mo Kio) Kindergarten",
  "place_id": "ChIJYXi468QW2jERQvGXurq0vcE",
  "rating": 5,
  "reviews": [
    {
      "author_name": "D K",
      "author_url": "https://www.google.com/maps/contrib/108905155636707713412/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKJrjkiBYAJBywK_FObvMa123zJCwFBPDknsGqSORRAckN27Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "I am writing this review to express my heartfelt gratitude for the exceptional care and evidence based learning environment that Bethesda (Ang Mo Kio) Kindergarten provides for my two currently enrolled children. The school's dedication to support and foster their growth has made a remarkable impact on my family.\n\nTheir commitment to evidence based teaching practices is truly commendable and exceeded my expectation. I have noticed how the well structured and research driven activities in school have sparked curiosity and confidence in both of my children. My daughter has blossomed in her language skills, eagerly sharing new words learned, stories and global news with me on a daily basis, while my 2 year old son has shown incredible progress in problem solving through the school's famed hands on learning. The way the school tailors their pedagogy to each child’s developmental stage is nothing short of amazing.\n\nBeyond academics, the caring atmosphere at Bethesda is extraordinary. The staff’s warmth and attentiveness make both my children constantly feel safe and valued. From celebrating small milestones to comforting them during tough moments, the teaching staff (including those not teaching my children!) goes above and beyond to nurture their emotional well-being. As a father, knowing my children are in such compassionate hands brings me immense peace of mind.\n\nI am extremely grateful to the always smiling principal Ms Faith and all the staff at Bethesda (including the admin staff and kitchen chef), and I thank you for creating an environment where my two children can thrive so much both intellectually and emotionally. Bethesda (Ang Mo Kio) Kindergarten is a shining example of what early childhood education should be and they have in my mind set a new benchmark for other preschools in Singapore to emulate, and my family feels so fortunate to be part of this community.",
      "time": 1745492049,
      "translated": false
    },
    {
      "author_name": "Joyce Bonilla",
      "author_url": "https://www.google.com/maps/contrib/113487891641309399979/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUiYk5GyV5tApzvlgxmABXw-FBqB0iUYrKRBYORTDK9G0Cyxg0=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I'm so grateful to have found Bethesda Kindergarten! This Christ-centered school has provided a nurturing environment for my child to grow and learn. The teachers are exceptionally caring, sincere, and dedicated to helping their students develop a strong foundation in faith and academics.\n\nThe school's focus on teaching kids to love and follow Jesus is truly inspiring, and I've seen the positive impact it's had on my child's life.\n\nI highly recommend Bethesda Kindergarten to any family seeking a values-based education that prioritizes spiritual growth and development.",
      "time": 1737949376,
      "translated": false
    },
    {
      "author_name": "Tan Tse Yong",
      "author_url": "https://www.google.com/maps/contrib/117099411863226899609/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVj6QUNF2OTNYmqqtrLV4Zgo-4znlkb5APgXrGpVz299raVjLqJ6w=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "As my son, Elijah, graduates from Bethesda AMK Kindergarten this year, I want to express our deep gratitude for this incredible school. For 38 years, Bethesda AMK Kindergarten has provided a nurturing and supportive environment for countless families, and we are fortunate to have been part of this rich heritage.\n\nWhile the school is rooted in Christian values, it warmly embraces families from all backgrounds, offering an inclusive and loving community. The dedication and passion of the teachers, guided by Principal Faith, have created an environment where every child feels valued and supported. We are especially grateful to Principal Faith and her wonderful team of teachers for their unwavering commitment to the students.\n\nElijah has not only grown academically but has also developed strong character, kindness, and confidence. The holistic approach to education, combined with the emphasis on respect, compassion, and community, has left a lasting impact on him.\n\nFor parents looking for a school that blends tradition, modern education, and a nurturing atmosphere, Bethesda AMK Kindergarten is a true gem. It’s a place where children from all walks of life can thrive and build a strong foundation for their future.\n\nThank you once again to Principal Faith and her amazing teachers for all the love and care they’ve shown throughout this journey.",
      "time": 1727773131,
      "translated": false
    },
    {
      "author_name": "Wong TK",
      "author_url": "https://www.google.com/maps/contrib/113242337667478824341/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW5uMSym7TlR3uLN67RR_dBRN9O0PhX7HNwRqWKX8MF5x69_jJX=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "My granddaughter would be graduating from Bethesda (Ang Mo Kio) this year, making her the second generation in our family to attend this wonderful kindergarten. Her two older brothers in 2019 & 2020, and even her father also graduated from Bethesda in 1991, so it's a special place for our family. With a 36-year track record, this kindergarten has been a blessing to countless children, many of whom have grown up to be responsible young adults and parents. I want to express my heartfelt gratitude to the staff, the kindergarten management, and the members of Bethesda Hall (Ang Mo Kio) for their prayers, dedication, sacrifices, support, and community services. Their love and care have made a lasting impact on so many lives, and I believe that the blessings resulting from their efforts would be felt for eternity.",
      "time": 1728705030,
      "translated": false
    },
    {
      "author_name": "Jeanette Lim",
      "author_url": "https://www.google.com/maps/contrib/111724496358231122037/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ4UIGQ7TSahCeTtR89paWKcWVg1bSt7KZ6czP8claIAjYYzg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "The teachers at Bethesda (Ang Mo Kio) Kindergarten are dedicated, caring and have a heart for teaching the children. They greet them with a smile at the school gate every morning.\n\nThe Principal is very friendly, approachable and hands-on. She doesn't hesistate to listen if you have any issues to bring up. The school administration staff is also very pleasant and helpful.\n\nAs a Church Kindergarten, the children are exposed to Bible teachings and stories during Assembly every Monday. There is very strong support from the church members who will come every week to conduct the Assembly and even turn up during special events like Children's Day, to prepare balloons for the children.\n\nThe school also brings in vendors to conduct after school enrichment classes. This is great and convenient as my children are able to attend a variety of classes at one place.\n\nBoth my sons enjoy going to school and I can't wait for my daughter to be able to join them when it's her time.",
      "time": 1740455221,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "school",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13960513134005842242",
  "user_ratings_total": 18,
  "vicinity": "601 Ang Mo Kio Avenue 4"
}