{
  "formatted_address": "2 Bukit Merah Central, #02-03, Singapore 159835",
  "geometry": {
    "location": {
      "lat": 1.2847568,
      "lng": 103.8138566
    },
    "viewport": {
      "northeast": {
        "lat": 1.286004380291502,
        "lng": 103.8153097802915
      },
      "southwest": {
        "lat": 1.283306419708498,
        "lng": 103.8126118197085
      }
    }
  },
  "name": "Bianka Panova Academy",
  "place_id": "ChIJ0451Y9Eb2jERfQBHkMCiMBs",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Daniela Michaely",
      "author_url": "https://www.google.com/maps/contrib/107888454828173962663/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWl0KoubS9uVa5LvgXpvDZ_r-atnJy49L7EtfpS16YRh8DD5VBQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "I feel privileged to have given my daughter the opportunity to train under Bianka Panova at the Bianka Panova Academy for the past 10 years. This experience has been transformative, shaping her into the remarkable young adult she is today. The dedication and expertise of the academy have not only honed her skills in rhythmic gymnastics but have also instilled values of discipline, confidence, and perseverance.\nI wholeheartedly recommend Bianka Panova Academy to other parents. It’s a place where young athletes are nurtured to reach their fullest potential, both in sport and in life. I am grateful for the positive impact it has had on my daughter and am excited to see others benefit from this incredible opportunity.",
      "time": 1745578208,
      "translated": false
    },
    {
      "author_name": "Jane Tan",
      "author_url": "https://www.google.com/maps/contrib/113977905126159619474/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI4nSE4c5Yblg24Camc6SpPKu1rIBL5cce8XOIHYpiaK81MsQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Love the positivity and culture of the school! The coaches at BPA are very encouraging and positive. They put the girls welfare first and team work amongst the girls across different is strong. My 2 girls have been with them for almost 2 yrs plus and loving every min of their time here!",
      "time": 1746432825,
      "translated": false
    },
    {
      "author_name": "Elizabeth",
      "author_url": "https://www.google.com/maps/contrib/106408247549581476578/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIV9TaUE3TFlzkkNGGGN3OMVAbBzqC2aq1t85jaUw5wzdimtg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Our daughter has been with BPA for 2 years and we have seen tremendous growth in her interest, passion and learning. The coaches are dedicated and loving, guiding the girls patiently to acquire new skills and master their routines. Our girl looks forward to every class, even if training is tough, developing a drive to improve and a confidence in wanting to do her best. We are amazed to witness her growth, from learning her sit ups, to doing her cartwheels and back walkovers, as well as seeing how she works hard to overcome her challenges. It thrills us to see her so excited each time she rushes home to share with us what she has learnt. It has been such a wonderful experience and look forward to more..",
      "time": 1745586244,
      "translated": false
    },
    {
      "author_name": "Jayne Leong",
      "author_url": "https://www.google.com/maps/contrib/109381171197982354390/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJGduvqiHYByislGlAkqDeuYx6uIN5316jD1dy3zZCeLcv3UBk=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "We moved to Bianka Panics Academy (BPA) two years ago after starting out at another academy that, unfortunately, lacked structure and proper administrative support. From the moment we joined BPA, we felt the difference. As a parent, what stands out to me is that BPA is a single-branch academy that truly knows and cares for each gymnast. The coaches are dedicated and deeply invested—not just in performance, but in the individual growth and well-being of every child.\n\nI’m not focused on my daughter just winning medals; what matters more to me is that she enjoys the sport, learns real sportsmanship, and builds meaningful bonds with her teammates. At BPA, she gets all of that and more. I’m so grateful to have found a place that nurtures her as a whole person, not just an athlete.\n\nHighly recommend to any parent looking for a thoughtful, child-focused gymnastics academy.",
      "time": 1746314271,
      "translated": false
    },
    {
      "author_name": "Viktor Atanasov",
      "author_url": "https://www.google.com/maps/contrib/108529641496831143121/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUk3rWpx00CudzdrXJhRwaBuo8lv4eWmbyAwKrXjH0Qai6Qahqt=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Exceptional rhythmic gymnastic academy in Singapore! My 7-year-old princess has been part of this rhythmic gymnastics program for kids for a year now, and it has not only improved her physical development but has also greatly heightened her focus, confidence, and competitiveness. The coaches, including the 9 times world champion, Bianca Panova, are truly amazing. The added bonus of master classes conducted by world and olympic champions adds an extra layer of inspiration for my kid - especially when she got to touch their gold models. Highly recommend for any parent looking to nurture their child's holistic growth through the world of rhythmic gymnastics!",
      "time": 1699526158,
      "translated": false
    }
  ],
  "types": [
    "gym",
    "school",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1959244785844158589",
  "user_ratings_total": 27,
  "vicinity": "2 Bukit Merah Central, #02-03"
}