{
  "formatted_address": "11 Bali Ln, Singapore 189848",
  "geometry": {
    "location": {
      "lat": 1.3006144,
      "lng": 103.8589225
    },
    "viewport": {
      "northeast": {
        "lat": 1.302084580291502,
        "lng": 103.8601397802915
      },
      "southwest": {
        "lat": 1.299386619708498,
        "lng": 103.8574418197085
      }
    }
  },
  "name": "Blu Jaz, Bali Lane",
  "place_id": "ChIJHfTZVbAZ2jERf2McsHqXPwY",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Georg B",
      "author_url": "https://www.google.com/maps/contrib/109722010266123120178/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK6ykQQRpKscEfdh-h2COqT41OrMs4AS7C24fR0wLzeB1bl3bw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "My favourite live music bar in Singapore. I particularly enjoy the free entry jam sessions on Fridays. The crowd is very light spirited and talkative. Cool music and great musicians (usually). However, note that in terms of style it ranges from blues to soul to pop arrangements – actual jazz on the other hand is few and far between. Might therefore not be the right thing for hardcore jazz lovers. Food is great (and portions are big), cocktails are reasonably priced and interesting. All in all a fantastic bar in my opinion.",
      "time": 1738688229,
      "translated": false
    },
    {
      "author_name": "Faris Karsheh",
      "author_url": "https://www.google.com/maps/contrib/110370541304346980764/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWIdr2CGUfB3g6pw3uYRVKy3IYOcKi_h7Z_D9rQHEPlTHeOm-fE=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Was good location and atmosphere. Food is delicious but portions were small for me. Prices are matching the food portions. Service was quick. They offer two menus, apparently from a neighboring restaurant, I don’t understand this concept, but almost all restaurants in the neighborhood are doing the same. I consider it clean",
      "time": 1742214001,
      "translated": false
    },
    {
      "author_name": "TLC Is In The House",
      "author_url": "https://www.google.com/maps/contrib/116246063219109577345/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW2ebPCJdxHLl-TQj3diUpiuDTggmj2HgMTW59h9QzwBAwk0BrU=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "2 weeks ago",
      "text": "If a laid-back, organic and rustic bar experience is what you seek, you'll feel right at home amongst the backpacker and blue collar types that seem to be the main clientele here.\n\nUnfortunately, this wasn't our jam. It's not our typical refined speakeasy or remotely close to the 'Asia's 50 Best Bar' pedigree we're accustomed to so we were seriously fooling ourselves for even stepping in. We made an attempt at ordering a round of drinks and some bar food but alas, we threw in the towel after an excruciating hour.\n\nOf course, YMMV. Personally, after sitting through a rather amateurish jazz act and walking the neighbourhood after dusk, taking in the 'colorful', unappetizing hodgepodge of takeaway eateries and ethnic offerings, I've had more than my fill of the rustic bar scene.\n\nAfter this episode, I realize I've taken for granted the very respectable offerings of those not-so-boring hotel bars and I never thought I'd be so relieved to return to what this crowd might refer to as a posh, pretentious bar again! :)",
      "time": 1746426132,
      "translated": false
    },
    {
      "author_name": "Mei Yi Yeap",
      "author_url": "https://www.google.com/maps/contrib/105952848007991953931/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV7ARhIXbHRjIChsBgg2VNvzpq18_CezCjvDpQqswyxj7iIJLLMbQ=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Food is surprisingly good for a place that's more known for music. Came here for dinner with a big group of friends and tried many of their dishes. The stand out is the pizza -- Roman style, made with focaccia bread and we had the 5 cheese. So so good. They have an extensive selection of western and indian menu to choose from. From all that we tried i think the only one i didn't enjoy is the tuna salad as the tuna is not so tender\n\nI think music is lively and many were there for it, although personally a bit too loud for me coz we were seated indoors.\n\nStaff is very helpful despite how busy it is",
      "time": 1739492298,
      "translated": false
    },
    {
      "author_name": "YK Lai",
      "author_url": "https://www.google.com/maps/contrib/117975338233530524725/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKl2g92ljR1rLSvnG7BTIVRJgHlRFo777Qi6ql_56VfQa_L8g=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Joined some friends gathering at this venue on Friday evening. It is a very happening place. Yet, the food served pretty fast. We enjoyed the vibe here for good food and lots of drinks. Just needed to be mindful that the open area seating is exposed to 2nd hand smoke if you're not a smoker.",
      "time": 1733144964,
      "translated": false
    }
  ],
  "types": [
    "night_club",
    "bar",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=450245040956793727",
  "user_ratings_total": 3381,
  "vicinity": "11 Bali Lane, Singapore"
}