{
  "formatted_address": "Singapore, 实龙岗景上段25号",
  "geometry": {
    "location": {
      "lat": 1.3758004,
      "lng": 103.9028784
    },
    "viewport": {
      "northeast": {
        "lat": 1.376908630291502,
        "lng": 103.9042943802915
      },
      "southwest": {
        "lat": 1.374210669708498,
        "lng": 103.9015964197085
      }
    }
  },
  "name": "Boathouse Residences",
  "place_id": "ChIJ8T8i1iQW2jERKr8MLLyY8p0",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Gary Choo",
      "author_url": "https://www.google.com/maps/contrib/116906288324961316894/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU8IuaONnz_kIZJkjAqf70CRaO9BWQ4EbzRr75C34LIKW8CJU1b=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Located within a small enclave of other condos, the road leading in is relatively smooth flowing.\nThe overall environment gives a resort vibes with many greeneries.\nWorth mentioning will be the pool.\nA lagoon shaped pool, with a small \"island\" where one can chill in the hammock provided.\n3 sheds with jacuzzi and forest shower.\nThe function room is located right beside the pool, \"overhanging\" like a river side boathouse.\nThe gym is also located right beside the pool with a small deck where residents often do their yoga there.\nGym equipment is well maintained and stocked although space is not huge.\nAlso right beside the pool, is the \"River Pavilion\" where there is an electric teppanyaki pit for gatherings and chill sessions.\nThere is also another jacuzzi located right beside this and only 5 steps away from the pool.\n2 levels of carpark, means, parking is never an issue for residents and visitors.\nLift lobbies in B1 and B2 are fully air-conditioned, rendering a very welcoming mood after a long day.\nWeekdays, the condo is relatively quiet, and serene.\nAfter some arrangements between residents and MCST, deliveries (food and online), are no longer an issue.\nNearby, there are basic amenities like a NTUC, clinic, Singapore Pools, Unity, Texas Chicken (24hrs), coffeeshops, DIY shops, etc.\nThe PCN along Sungai Serangoon is also only a short walk away.\nCons: the fighter jets flying around the area can be VERY bad at times, and occasional \"sounds\" from the school next door. If you wakes up early (7.30am), you get to hear and singalong Singapore's National Anthem =D\nOtherwise, this condo really fulfils the resort style living.\nOh, worth mentioning, the MCST, although with some unpopular rule of walking pets, is very up to speed in maintaining and upkeeping the whole estate.",
      "time": 1744769359,
      "translated": false
    },
    {
      "author_name": "KiM BooN LeE",
      "author_url": "https://www.google.com/maps/contrib/104527916285751902034/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUCNMtzYuEM-S7VH7q2wXpUdS0b_cohTihFT_jL-W1oj6rXg3W8Eg=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 3,
      "relative_time_description": "3 years ago",
      "text": "Surrounding areas seem good as lot of eateries but condominium itself seem \"cramps\"... It seem we could \"see others\" from the opposite side... 3 rooms seem a little small but master bedroom a little bigger than others condominium thou... Guards outside are friendly...",
      "time": 1650043379,
      "translated": false
    },
    {
      "author_name": "Nesty Tayag",
      "author_url": "https://www.google.com/maps/contrib/110491658281047521601/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX1JwZPCExgDPCLYg9pg20ofDPPixRWxb9sap3jm826S3LOFvov1w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "My home for 4 years now! I came here as single then got married and now with a daughter. I love how it looks like a resort & also very suitable for kids. Most importantly, I like the security that we get here. It is also very nearby the hawker center, grocery and even PCN going to Coney Island. This is really a home away from home ♥️",
      "time": 1632637416,
      "translated": false
    },
    {
      "author_name": "Backyard Xplorer",
      "author_url": "https://www.google.com/maps/contrib/102260626085916018032/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXeAsxA0ZL92WBe1c9egfujwIiv91L1o5erLeWy9caKKn3I8Q5Y=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "Condo setup like a holiday resort with nice landscape and and lot of plants around the whole estate. In fact the landscape has won this residency as best landscape in a condo when it was newly TOP. The resident gardeners employed by the management put in q lot of effort to keep the greenary in good shape. You can see butteflies and small rare birds flying around in mid afternoon. Weekdays after 7pm is quiet with a 1 or 2 swimmers doing laps in the pool. Weekends on the noisy side from more people and children using the pool but it is usually just from 3pm to around 7pm...after that is peaceful and quiet again\n\nCondo has its own shuttle services for residents and it operate between the condo and hougang mrt station.",
      "time": 1618291342,
      "translated": false
    },
    {
      "author_name": "Wei How Owi (Howie)",
      "author_url": "https://www.google.com/maps/contrib/114953474611893082765/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWnaWuYE5mlH69ovqCLuS7rpqN-QdBOAOUWxXxFVjHeljb5qnxP=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 years ago",
      "text": "Super nice view! The pool makes me just wanna jump down and chill! This place is not hot and very windy because it's blocked by most of the surrounding blocks. Love it!",
      "time": 1497806178,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11381327142278971178",
  "user_ratings_total": 202,
  "vicinity": "实龙岗景上段, 25号"
}