{
  "formatted_address": "10 Paya Lebar Rd, #02-09 PLQ Mall, Singapore 409057",
  "geometry": {
    "location": {
      "lat": 1.3175284,
      "lng": 103.8928037
    },
    "viewport": {
      "northeast": {
        "lat": 1.319040780291502,
        "lng": 103.89562415
      },
      "southwest": {
        "lat": 1.316342819708498,
        "lng": 103.89106315
      }
    }
  },
  "name": "Bonchon PLQ",
  "place_id": "ChIJwS6VchwZ2jER0hCpSEnxW6U",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "T “dikyranidrona” T",
      "author_url": "https://www.google.com/maps/contrib/106440039449201091609/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUL69SvDI2_Fh_goloBOetfZ6nEQ4dRal5CT7rTzf3bcwx_ABwK=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Dear All, please pick your next meal wisely.\n\nThis shouldn’t call as a Korean restaurant, should be call as Heated Korean Frozen and Instant Food shop!\n\nIt was my first visit and this will be the last time as well.\nMe and my friends were attracted by the “good” reviews and the menu seems nice, looks like proper cooked dishes.\nHowever I’m so disappointed when foods was served on table…\n\n///they don’t provide side dish (banchan)///\n\njjajangmyeon -\nwas serve with Instant noodles instead of real jjajangmyeon, and with one air fry chicken cutlet on it (dry and tasteless) and how could jjajangmyeon was served without marinated yellow pickled radish??\n\nBoneless fried chicken -\nApparently it is frozen food, odd round shape, dry and hard to bite\n\nVeg pancake -\nFloury and not much ingredients which cost around $14 and this too tasted like frozen food… probably they bought from grocery stores…\n\nThe overall foods experience is very bad, we even thinking might the chef had runaway or quite his job, if not… probably Bonchon is just serving some instant foods  which for me this was wasted of money! Above 3 foods and with drinks for 3 pax, it cost us $70+ I could pay this amount for other well prepared and served real Korean foods restaurants!\n\n*we did finish the foods coz we dun want to wasted the money and also the foods, posting this review coz feel like cheated by the owner, like how could they selling this standard of food and called themselves as a restaurant?! LMFAO",
      "time": 1742694035,
      "translated": false
    },
    {
      "author_name": "Maggie Mok",
      "author_url": "https://www.google.com/maps/contrib/117748564291358008895/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUkjV7bHNHi7F5RE1OAQc5UYhJ4iWJYcD2oRr0GNW7pWJnl68KU=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "We visited on 18/11/24 during dinner time, we are very satisfied with the food and the service staff very polite. The food is excellent and I can felt that no MSG. Food serve very fast too, definitely will come back again because the staff all very helpful. We have pleasant experience in this outlet. We also celebrated friends birthday here ☺️ for the male Chinese staff service us, I really appreciate your excellent service. Keep up your good work. Cheer 💪🏻",
      "time": 1731951408,
      "translated": false
    },
    {
      "author_name": "Zuriel Mamba",
      "author_url": "https://www.google.com/maps/contrib/100097027827819745483/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXjjbnbgtrpHKDsQ_m9uOBbcQW6_NM5DrNtFVcH68Q8o1UewEnX=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 3,
      "relative_time_description": "3 months ago",
      "text": "Visited this Korean Fried Chicken in PLQ for meal.\n\nThe Samgye tang was comforting, meat was tender which matched the glutinous rice. The fried chicken was rather crispy on the skin, I thought the spicy version can be more spicier & less sweet.\nThe army stew had quite a bit of ingredients\n\nStaffs were attentive & friendly.",
      "time": 1737484287,
      "translated": false
    },
    {
      "author_name": "Clarence Ow",
      "author_url": "https://www.google.com/maps/contrib/112234615480628100933/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX_dX_-LEj7UqCWF1JKZREPhyLFgPJjp7PYAIjqqOhzJhaYPuc=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "2 months ago",
      "text": "The environment of the shop is not bad. Spacious, quiet and comfortable. The staffs are chill and provide good services.\n\nHowever, several emotions comes to my mind eating the Dak Bulgogi. Presentation wise, the meat looks really dull, similar to some boiled meat. Taste wise, it tasted quite sour and fermented, a bit similar to rice wine.\n\nI admitted I enjoy it to a certain extent. However, I strongly feel that having a non spicy option could have killed this dish as it does not justify the potential of the Dak Bulgogi.",
      "time": 1740978261,
      "translated": false
    },
    {
      "author_name": "M.R. mr",
      "author_url": "https://www.google.com/maps/contrib/113560880648083786115/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWHLd_1z0D9K_w13C-luc-W5lkN9ZRPP5f4y0Dp17z5N2W_VzU=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "Not worth a visit and for the price paid\nFood was decent.. however, it was on the salty side.\nAs a Korean establishment the amount of side dishes given was pathetic. Just a few slices of kimchi for two person, the waitress was surprised when we asked for a second serving of kimchi.\nOrder the two flavored chicken, the next surprise was the small serving compared price paid. Taste wise, was just passable due to the amount of salt.\nRice cake with rame, overpriced food again.",
      "time": 1742921000,
      "translated": false
    }
  ],
  "types": [
    "meal_takeaway",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11915382536192725202",
  "user_ratings_total": 400,
  "vicinity": "10 Paya Lebar Road, #02-09 PLQ Mall"
}