{
  "formatted_address": "124 Lor 1 Toa Payoh, #01-489, Singapore 310124",
  "geometry": {
    "location": {
      "lat": 1.3387541,
      "lng": 103.8450081
    },
    "viewport": {
      "northeast": {
        "lat": 1.340163780291502,
        "lng": 103.8458244802915
      },
      "southwest": {
        "lat": 1.337465819708498,
        "lng": 103.8431265197085
      }
    }
  },
  "name": "Braddell Medical Clinic",
  "place_id": "ChIJI0IR8asX2jERbDRs90SsbXg",
  "rating": 3.3,
  "reviews": [
    {
      "author_name": "Vincent Kim",
      "author_url": "https://www.google.com/maps/contrib/109659768322089871252/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJhHtPKpvzhNPDDtI98pax3dvOHdx5DZFJ1bhkJNT19wN1EPA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Do not go to this clinic!! Give wrong medication label for kid's medication. Poor customer service. No apology was given. And they made me wait for nothing when they were unable to amend the medication label and receipt. No explanation was given. There was only one other patient at that time. Not that they were busy. There was a notice for respect of the staff in the clinic.  If they asked for respect, please respect your customers first!! For avoidance of doubt, I didn't argue with them at the clinic. Writing a Google review is the best option.",
      "time": 1744866579,
      "translated": false
    },
    {
      "author_name": "Joseph Chan",
      "author_url": "https://www.google.com/maps/contrib/114171467811882960053/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVttMrdnuep-NsWUvKTCrq1q9uU357_34rTnJWbrLPpPIV66iOH=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "3 weeks ago",
      "text": "I've been here a few times and it's a standard clinic. Clinic assistant is familiar with insurance policies and I've had no issues so far. The lady at the triage is efficient and helpful as well.\n\nOf the 4 times I've been here, every doctor is different, so there is a lack of consistency there if that is what you're looking for.\n\nOn 23rd April 2025, I was here at 805am, just past opening hour. I was given queue number 62 and an elderly couple before me was first in line with the queue number 61. The doctor only started seeing patients at 850am, a full 50mins past opening hour.\n\nAfter the elderly couple was called, I was expecting to be called next. However, another patient was called by name to see the doctor before me. This is typically not an issue but it is unfair especially since I had waited for over 50mins already by this point. If a doctor is late, I believe they should at least clear the queue of the people who actually waited in line before attending to their friend.\n\nNevertheless, the consult was standard and fine. This is a fine clinic, but the seeming lack of an anchor doctor means your consults might vary in quality.",
      "time": 1745462259,
      "translated": false
    },
    {
      "author_name": "Jake Ng",
      "author_url": "https://www.google.com/maps/contrib/110421470606877395351/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIeIo0L5yfQrkpjYVGVJGQCkUsTjdV9TRfEFwtdWVtrw20-sg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Extremely poor service and attitude from reception counter. Most of the receptionists carry a nonchalant attitude. They are also visibly impatient and show 0 empathy to patients walking in. An irony that the management group actually puts up a sign that reads “please treat our staff with respect” when it isn’t even practised in the first place.\n\nIt’s a shame as most of the doctors are actually doing a great job, treating patients as patients .",
      "time": 1744971931,
      "translated": false
    },
    {
      "author_name": "BRYAN L",
      "author_url": "https://www.google.com/maps/contrib/115548405171205952549/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJBnNGwQ74W2l1ZTF98C_paNBxPviJzdtzAkzk7wgU_vnEXVg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "7 months ago",
      "text": "Accompany my wife to see doctor at ur clinic today. Didn’t have much choices as today is weekend. (Bad Choice!)\nClinic assistant is helpful and good.\nBut Doctor is untidy with his long hair, unprofessional, doesn’t seem interested to interact with patient, seem reluctant to see patient (maybe is weekend, spoil his weekend plan?)\nWhile sitting in the clinic waiting medication, each patient who went in to see him is less than 5min.\nThe best part, the clinic assistants don’t even know the name of the doctor they are working with. They have to check the computer for his name, DR LOW.",
      "time": 1728729448,
      "translated": false
    },
    {
      "author_name": "Mairi Kants",
      "author_url": "https://www.google.com/maps/contrib/115562864616784861359/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWcRNjS0wG96cyF773VunmqHB-1KOHexVt1UDWLHC5hLNb71Kwb=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Very pleasant experience with this clinic. I first visited on Friday evening and since blood test was required, I had to come back on Sat morning. Dr withdraw the blood and said results will be out by 2-3 working days. To my surprise, clinic called me on Sat evening saying that results are already out and I can come for review when available. Although I was attended by different Dr all 3 times, all of them were friendly and professional. I would like to thank Dr Lee for his professionalism and patience in explaining the blood test results to me, really appreciated it. We need more doctors like him :)",
      "time": 1685845936,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8677781469221631084",
  "user_ratings_total": 72,
  "vicinity": "124 Lorong 1 Toa Payoh, #01-489"
}