{
  "formatted_address": "150 Orchard Rd, #05-38/43 Orchard Plaza, Singapore 238841",
  "geometry": {
    "location": {
      "lat": 1.301086,
      "lng": 103.8409854
    },
    "viewport": {
      "northeast": {
        "lat": 1.302580430291502,
        "lng": 103.8425169302915
      },
      "southwest": {
        "lat": 1.299882469708498,
        "lng": 103.8398189697085
      }
    }
  },
  "name": "Brainy Child Montessori Learning Centre",
  "place_id": "ChIJBaw6-5YZ2jERuBHq4mqdAk8",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Evelyn Rosiana",
      "author_url": "https://www.google.com/maps/contrib/109841734601068176453/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJYJ5BE--SnYbt4fI3wT6MCz-CtgXVuoXOMZQLE_DV6HjzBGg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "My son has been attending this Montessori school since he was 19 months old, and I’m so happy with our experience. The teaching methods are excellent— child-centered and easy for him to follow. Over time, I’ve seen such amazing progress. He used to say only a few words, and now he’s talking so much more with confidence!\n\nThe teachers are incredibly kind, patient, and genuinely care for the children. My son used to be shy at school, but now he looks forward to going every day. As a parent, it’s such a comfort knowing he’s in a safe, loving, and supportive environment. I’m truly grateful for this school and highly recommend it to any parent looking for a nurturing place for their child to grow",
      "time": 1743999446,
      "translated": false
    },
    {
      "author_name": "Julius Santua",
      "author_url": "https://www.google.com/maps/contrib/104746607201802952004/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWXLholEc0hxKv2nZXiHUvSbcLWZEBYPd2cpTKHoNrrJlEqjzQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Both of our children attended Brainy Child Montessori before we migrated to Australia.\n\nThe move was a challenging transition for our family, but our children handled it exceptionally well. They carried with them the valuable life skills they learned at Montessori—patience, kindness, and creativity.\n\nDuring our initial stay at a friend’s house, their behavior was truly remarkable. Even in unfamiliar and difficult circumstances, they remained well-mannered and adaptable.\n\nOur friends even complimented us on how polite and respectful our children were. We are incredibly grateful to Brainy Child for laying such a strong foundation in their early years.",
      "time": 1747109550,
      "translated": false
    },
    {
      "author_name": "Vanlalruata Fanai",
      "author_url": "https://www.google.com/maps/contrib/116214505080902832921/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUonSxoQepYsuC_Hb0mOqeCqifsfDaDCpMQURDdOThuvK3IwEWuTA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "As parents, we are impressed by the caring and supportive environment our daughter, Darlene, experienced at the Brainy Child Montessori Learning Centre. Darlene started attending the school when she was around three and a half years old, beginning with Saturday classes to help her familiarise herself with the school environment. Soon she joined regular weekly classes and immediately felt at home. For Darlene, her experience at the Brainy Child Montessori was full of fun and progress.\n\nOur daughter enjoyed the classroom interactions, hands-on learning experiences and field trips that make her education journey enjoyable and effective, while helping her develop socially and emotionally. The diverse culture of the school also provides a platform for her to appreciate and understand different backgrounds.\n\nAll the staff members, led by the passionate, caring and well-qualified Principal Miss Monica Lim whom the students fondly call 'Teacher Monica', and her team of dedicated teachers such as Teacher Shilpi and Teacher Jhuma, to name a few, had been exceptional. They have created an environment, where students, including our daughter, felt safe to make mistakes and learn from them, which was essential in helping Darlene to develop self-confidence and resilience.\n\nBrainy Child Montessori values the involvement of the parents, which was an important factor in our daughter's positive experience. Regular contact with the teachers kept us informed of her progress and challenges and provided valuable insights into how to support her learning at home.\n\nSince leaving Brainy Child Montessori, our daughter has continued to build on the strong foundation she received there, which has given her confidence as she transitioned to a new school as we moved to our home country. The school has provided a platform for our daughter to learn with confidence and grow, and we are confident it will do the same for other children.",
      "time": 1742496576,
      "translated": false
    },
    {
      "author_name": "Vincent Oh",
      "author_url": "https://www.google.com/maps/contrib/106992646127668694201/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKELX0phOGKOqH1-1HhZgL0mRdNtni3-XwNKVfu3tK_czgwgA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Our daughter, has been attending Brainy Child Montessori Learning Centre since she was three years old, and as she prepares to graduate next month, we reflect on our wonderful experience with deep gratitude.\n\nThe school’s nurturing environment has been a cornerstone of her development. The teachers’ gentle approach, free from scolding or stress, has fostered a love for learning in her. Their unwavering patience and kindness have created a space where children feel safe and valued. She often shares how the teachers have never raised their voices, which speaks volumes about their dedication to positive reinforcement.\n\nAdmittedly, the school’s location in an older building initially gave us pause. However, upon visiting, we were greeted by the genuine smiles of both teachers and students. Even the more reserved children were eager to participate, raising their hands enthusiastically. This vibrant atmosphere quickly dispelled any concerns we had about the physical setting.\n\nAs we approach the end of this chapter, we are profoundly grateful for the positive impact Brainy Child Montessori has had on our daughter’s early education. The school’s commitment to fostering a loving and encouraging environment has set a strong foundation for her future learning journey.",
      "time": 1731557289,
      "translated": false
    },
    {
      "author_name": "Suny Markose",
      "author_url": "https://www.google.com/maps/contrib/117709541317882746393/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVs2OfI86Bdc2tvW9Zjgmw-Hlyeca8bkYSSAvp7x2plA6eJWptb=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "We are thrilled to share our experience with this wonderful Montessori preschool, where our daughter has been enrolled for the past three years. Over this time, she has blossomed academically—learning to read, write, and even grasp early math concepts—while enjoying every moment of it.\n\nAs working parents, we had limited time to teach her at home, but we are incredibly grateful for the school’s rigorous yet nurturing approach. The school strikes a perfect balance by maintaining academic excellence while staying true to Montessori principles, focusing on the individual needs and pace of each child.\n\nThe teachers are exceptional - highly experienced, caring, and truly dedicated to each child's development. The principal Ms. Monica Lim is equally wonderful, providing efficient leadership and a warm, supportive environment.\n\nThe small class sizes ensure that every child receives ample personalised attention, which has been invaluable to our daughter’s growth. Additionally, the school offers a range of exciting field trips, far surpassing the number and quality offered by other international schools in the area.\n\nIf you are looking for a preschool in the Orchard area or surrounding neighbourhoods, this school is the perfect choice. It ticks all the boxes for an enriching, well-rounded education, and as parents, we couldn’t be happier with our decision to enrol here. Our daughter often says she never wants to leave, and that speaks volumes about the positive impact this school has had on her.",
      "time": 1734308349,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5693285961348813240",
  "user_ratings_total": 59,
  "vicinity": "150 Orchard Road, #05-38/43 Orchard Plaza"
}