{
  "formatted_address": "11 Bidadari Park Dr, #02-20/20A, Singapore 367803",
  "geometry": {
    "location": {
      "lat": 1.3389272,
      "lng": 103.8726377
    },
    "viewport": {
      "northeast": {
        "lat": 1.340274630291502,
        "lng": 103.8739944802915
      },
      "southwest": {
        "lat": 1.337576669708498,
        "lng": 103.8712965197085
      }
    }
  },
  "name": "Brewerkz Woodleigh Mall",
  "place_id": "ChIJecTvJ58X2jERLGS8yjEbHek",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Victor Ho",
      "author_url": "https://www.google.com/maps/contrib/113636991537124889569/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIR5Q8V0Y-S-7x3ntypUsIffdV5E4HRdQlllhaMX4CavZo2Mg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "Our 2nd visit as the food was good especially the fries and the wagyu beef in the picture . It was very tender and soft. Atmosphere was great. Seats not too close  which was good for a big person like me. Service was impeccable and service personnel very attentive and soft spoken. On our 1st visit my wife left her water flask and didn’t realise it till the next day. We came back, the manager recognised us and knew we were back to ask about the flask. Good job guys.",
      "time": 1747199519,
      "translated": false
    },
    {
      "author_name": "Koh Huey Min",
      "author_url": "https://www.google.com/maps/contrib/108097352662396107986/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV0TKq1kjmuFTgGRBSwTgtwF2hDbMdSyDmUpQfJ9k_BnDLXVnCD=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Here for a tea break.\n\nIncidental find. The location may be a bit off. Not too sure whether people with intention to visit the place can find it.\n\nAmbience was great. Nice and relaxing. Everybody was calm.\nKFC was really interesting. Crispy on the outside, soft on the inside.\nBeeramisu tasted great. Just that the presentation posed an inconvenience. Because it is in a glass, the spoons given became short for the parts deeper inside the glass. Had to tilt the glass to eat those bits.",
      "time": 1744503146,
      "translated": false
    },
    {
      "author_name": "AA Ong",
      "author_url": "https://www.google.com/maps/contrib/115191725541420620861/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXym46rXdLSYhKG3nhzm2VxbWSbfTWxwnIiIzyziKHN45r1BhLn=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Nice food. Good service. Great beer. What more can I ask for? 5 stars!",
      "time": 1737989716,
      "translated": false
    },
    {
      "author_name": "Jechtto",
      "author_url": "https://www.google.com/maps/contrib/106407471320614893952/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXfpuQZTlp2__GjGOxQV6bcw2xpvSE6rQbeHGZ3jSZ2CFmY-bts=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "Came here on a Christmas eve as my partner was craving for their ribs and nachos which she raved about previously after trying it for the first time. For myself, I have never really paid attention to Brewerkz, had a couple of drinks and finger food at other outlets but nothing really stood out for me. To be honest I was mentally prepped tp stand in a queue for at least an hour and make do with less than ideal sitting arrangement but what greeted me was a massive restaurant with only about 30% capacity. Interesting, either way we could pick the table we wanted and promptly ordered the Brewerkz platter and their BBQ Ribs. Now the ribs were fantastic, full of flavour, tender and juicy too. Plus the meat on the bone was not only substantial but easily fell of the bone with the gentlest of prodding. The platter too was a massive win, ultra crisp truffle fries, peppercorn deep fried chicken chunks, tiny popcorn shrimp, breaded calamari and ultra think nachos that went perfectly with the salsa. In short, everything was almost perfect, though the calamari was a little tough and I found the curry sauce for the peppercorn chicken a little too overpowering. The shrimps were easily my favourite, no peeling needed, you just chow down on the entire piece head, legs and tail. And as a cherry on top, the service was great too with the server assigned to us checking in on us with the food and if we needed anything else. BRAVO!",
      "time": 1735065290,
      "translated": false
    },
    {
      "author_name": "Rom25Jan",
      "author_url": "https://www.google.com/maps/contrib/112163084815807245296/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWk-vOEmTLlTc0Vu3uz-pScrLm8Xmic6W1j9SZURINVxRffgSi5=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Casual family dinner on a weekday.\n\nGreat food, the BBQ ribs were tender and flavorful, served in good portions with fries. Desserts were great too, with Lava Cake that is oozing warm chocolate. I recommend the Beeramisu (Tiramisu with hints of beer and Bayley’s); it’s original and tastes really good!\n\nKudos to our waitress Ella, who happened to be French (like us) and from the same region. She was kind, offered great service and pleasant chat! Other staffs were really nice too!\n\nOnly one thing to say could be the music played in the restaurant was maybe a tad loud, but overall a great experience. We will definitely visit again!",
      "time": 1735832068,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "liquor_store",
    "bar",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16797612085830509612",
  "user_ratings_total": 312,
  "vicinity": "11 Bidadari Park Drive, #02-20/20A"
}