{
  "formatted_address": "102 Simei Street 1, Singapore 520102",
  "geometry": {
    "location": {
      "lat": 1.3412378,
      "lng": 103.9513712
    },
    "viewport": {
      "northeast": {
        "lat": 1.342572080291502,
        "lng": 103.9527325802915
      },
      "southwest": {
        "lat": 1.339874119708498,
        "lng": 103.9500346197085
      }
    }
  },
  "name": "Brighton Connection Student Care Centre Simei",
  "place_id": "ChIJYSK6qw892jERr7CsrgeRuwU",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Raghavan Nagarajan",
      "author_url": "https://www.google.com/maps/contrib/105356267930889241853/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWECmOycK4i0CUSPAomnnafvALuAnGGUQ6L0KXAdv_mrcvVgqmw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My son, who studies at Changkat Primary School, has been attending Brighton Student Care Center (BSCC) at Simei, even since they opened up in Dec 2021. BSCC is a great place for the kids to spend their afternoons after their school. The center manager, teachers and volunteers there have a great line up of activities for the kids everyday which include outdoor play, arts and crafts, silent reading, LEGO, UNO and other play toys, watching documentaries and also getting their schoolwork completed or practicing other work sheets relevant to their school curricula. With Brighton Foundation, and given their diverse range of involvements in serving the society, the BSCC team genuinely cares and nurtures every child who come to their center. The kids have the freedom to speak, play and have fun while also ensuring that they do so responsibly with due respect to all their friends. As a parent, it gives me a lot of relief and happiness that my son is attending BSCC as it very much a \"homely setting\" outside of school and the informal and friendly atmosphere created by the teachers there makes it very comfortable for all the kids to open up and speak their heart. BSCC also has several nice family gathering that they organize from time to time (atleast 3-4 times a year) and these events are so fun to attend and build a bond with the community. Their holiday programs are also lined up with lot of interesting activities and they take the extra efforts to get the kids to go on field trips at least 2-3 times during the June and December holidays.  The teachers are very accommodative and I must say the center is very inclusive as they also care a lot for children who may have special needs. The center staff handle every kid's needs with great maturity and perseverance and do not bring up issues to parents for every small incident, as they make an effort to work with the kids and get them to realize their mistakes and work on them collaboratively. There are very few locations in Singapore with non-school based student care centers and I am glad my son is able to attend one such at Simei just opposite to his school, which is BSCC. Thanks to BSCC team and Brighton Foundation for all their efforts and for serving beyond the call of duty! Anyone willing to know more about BSCC from a parent's perspective can reach out to me by email at nagarajan at sutd.edu.sg",
      "time": 1701739708,
      "translated": false
    },
    {
      "author_name": "Tin Pham",
      "author_url": "https://www.google.com/maps/contrib/112507564684159508745/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVAsyzR1_inW1F9vXnJKshV55oyoPm-Pcc8U76PWm2xkpjaBD-y=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Good place for your kids.",
      "time": 1708169974,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=413083253015883951",
  "user_ratings_total": 2,
  "vicinity": "102 Simei Street 1, Singapore"
}