{
  "formatted_address": "307 Choa Chu Kang Ave 4, #01-693, Singapore 680307",
  "geometry": {
    "location": {
      "lat": 1.3852417,
      "lng": 103.7427307
    },
    "viewport": {
      "northeast": {
        "lat": 1.386685930291502,
        "lng": 103.7440616302915
      },
      "southwest": {
        "lat": 1.383987969708498,
        "lng": 103.7413636697085
      }
    }
  },
  "name": "British Dental Surgery",
  "place_id": "ChIJUwlPW9wR2jERobe3_wYpQQs",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Adrian",
      "author_url": "https://www.google.com/maps/contrib/112650091918325033403/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUJHf5QDVAkrQnQqKkYV7H1iOWb8ys8wxhEeyFb-Qp2rM974NbB=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "I recently had my teeth checked and cleaned here. It was a Monday morning and I was attended to by Dr Ng Ee Jean. She was respectful and polite, and she wasn’t dismissive about any concerns I had regarding my teeth. I appreciated her taking the time to explain my reports and giving me her evaluation of my oral health.\n\nThe cleaning process was good. She was gentle with the scaler and I didn’t bleed too much. I dentist-hop like once a year and I’ve had experiences where the dentist is really aggressive with the scaler in an attempt to expedite the process. Big plus here.\n\nAfterwards it was X-rays. While waiting for the X-ray to develop she started the tooth polishing process.\n\nDepending on what you get for your checkup and cleaning expect to pay around $100-250 for the whole process. If you have a CHAS card remember to flash it before payment.\n\nI recommend this clinic. Dr Ng will guide you through every step of the way.",
      "time": 1678697344,
      "translated": false
    },
    {
      "author_name": "Noor Khazenah",
      "author_url": "https://www.google.com/maps/contrib/104695400210169984167/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWidILnsJM5YclZp050uJ6zj2CjWZDgJbbTzJ2L1SJvpCKojzka=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "Be cautious when getting fillings and always seek a second opinion especially if the number of cavities diagnosed seems unusually high. I was told I had six cavities meaning six fillings were needed which seemed odd since British Dental Clinic had mentioned i had only minor decay / \"small tiny holes.\" When I asked how soon I needed to get the remaining four fillings done, the dentist appeared calm despite my panic and simply said, \"as soon as possible.\" Since the clinic was busy that day, I proceeded with two fillings first each costing around $90, totaling about $180.\n\nConcerned about the cost, I went to a polyclinic for the remaining four fillings and was shocked to learn that I had no decay at all. They provided a doctor's letter and scan as proof exposing a misdiagnosis—not just one, but six cavities. This happened last June. Interestingly, the polyclinic dentist at Toa Payoh confirmed in July last year that I had no cavities, another dentist at Ang Mo Kio today, during my routine half-yearly checkup,reassured me once again that my teeth simply had a deep structure (deep grooves). I also had my cleaning done today.\n\nThankfully, I trusted my instincts and went to the polyclinic; otherwise, I would have wasted money on four unnecessary fillings. Spending over $300 on fillings for perfectly healthy teeth is unreasonable! Worse, having two fillings done unnecessarily means drilling out healthy tooth structure. Now, I have to request scans to check for decay between the fillings—completely avoidable and unnecessary.\n\nI only visited this clinic once and will not return due to lost trust, especially since they never followed up with me. However, I would still recommend this place for cleaning or polishing, as the dentist and assistant are friendly, accommodating, and allow breaks whenever needed.",
      "time": 1738327795,
      "translated": false
    },
    {
      "author_name": "Firdaus Othman",
      "author_url": "https://www.google.com/maps/contrib/105386438934879923916/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVfumD8dz3pYITVkyQ6QXJ9a5bY5vDYZfdRfQQanLO7n4uby6WBRA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Had bad experience with another dental & decided to try out this dental instead. Went there twice so far & Dr Siva has been amazing and skilled in his work. Got to do a filling on one of my teeths and it has been great so far.",
      "time": 1739272595,
      "translated": false
    },
    {
      "author_name": "Vivian w",
      "author_url": "https://www.google.com/maps/contrib/102557451710441239748/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWH2_YNmwkyce5HeWF-uscjYZYkZNBBDt1ivNOCxdUEiSeXAnWI=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "12 months ago",
      "text": "Dr Ng was very professional and knowledgeable. She doesn't only gently did her job, but also gave me a very detailed explanation so I understand why certain procedures were needed. Her assistant was very nice as well (forgot to ask for the name sorry). Will definitely be a regular here :)",
      "time": 1716295689,
      "translated": false
    },
    {
      "author_name": "Ben Chua",
      "author_url": "https://www.google.com/maps/contrib/107775599023863500830/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVpI-rNPe1QcRNiMarQEZMAwWohMLXC1u1bEq19I1GJeGQWa006Bg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "I visited British Dental Clinic for a regular cleaning, and I had an excellent experience. Dr. Ng Ee Jean is incredibly gentle, patient, and detailed in her work, making the entire process comfortable and stress-free. Her assistant, Ms. Tay Siew Boon also deserves high praise for her efficiency, gentleness, and attention to detail. The teamwork between Dr. Ng and Ms. Tay is seamless, ensuring that patients receive the best care possible. I highly recommend Dr. Ng to anyone in need of dental services.",
      "time": 1722514363,
      "translated": false
    }
  ],
  "types": [
    "dentist",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=810974517940172705",
  "user_ratings_total": 51,
  "vicinity": "307 Choa Chu Kang Avenue 4, #01-693, Singapore"
}