{
  "formatted_address": "LG2-29, Residensi Teluk Puteri, Jalan Tanjung, Puteri Harbour, 79000 Iskandar Puteri, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.411775,
      "lng": 103.6568219
    },
    "viewport": {
      "northeast": {
        "lat": 1.413010680291502,
        "lng": 103.65774985
      },
      "southwest": {
        "lat": 1.410312719708498,
        "lng": 103.65403805
      }
    }
  },
  "name": "Britz",
  "place_id": "ChIJr2GVe5AN2jERJZPbEruSv8k",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Joanne Liaw",
      "author_url": "https://www.google.com/maps/contrib/103808277413405954420/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW4hS5qSWGuWRtqHaH8_MSGIIWMGkuURztSjNbahfl83HYlq2A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Friendly bosses and staff!! A unique place where you can order any cocktails as there is no cocktail list.\n\nLove how the staff cater for my drink when I only tell him my preference of the drink and he made the cocktail for me. The boss even takes a step further to find out how to play the \"Jackpot\"  game and teaches us.  Great service.",
      "time": 1732812342,
      "translated": false
    },
    {
      "author_name": "Joanne Lim 林舒雯",
      "author_url": "https://www.google.com/maps/contrib/115857432548887979652/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU8KjhL_PCrvay0W3Qoss6eufMxB0hVgKIzQjZg1AASTliCo8s=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "The only British restaurant and bar / British pub in Johor. It’s that sort of pub you build a community in. So come in to meet them as friends. Say hi to Chris, Dave, Andy, Jenny, the Britz team, and the colorful patrons from near and far across the world.\nGet the Sunday roast, or Guinness meat pie, a pint, and revel in the crowd, sights, and sounds. If youre an introvert, no worries, amuse yourself with the chalk scribbles of the week by Chris on the walls, or enjoy the Puteri Harbour view al fresco, or bring your fav book and be seated on the bar stool, your choice.\nTrivia quiz every first Sunday of the month.",
      "time": 1733373414,
      "translated": false
    },
    {
      "author_name": "June Tan",
      "author_url": "https://www.google.com/maps/contrib/111064510966911213900/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKVKRI02Mp9GMsdpF40HDTC74Sk1NTGNOqNCvANXNfJdCSKfA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "We had the chicken parmigiana and the Royale Burger, with a side of buttered spinach.\nEverything was fresh and delicious, and obviously cooked with a lot of heart. Nice chilled vibe and good music too. Will be back!",
      "time": 1732277987,
      "translated": false
    },
    {
      "author_name": "Gary Holland@IHH",
      "author_url": "https://www.google.com/maps/contrib/107071813809977031077/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJtf4sUUoRIV2HqL7Nuuyl6Vup1rQMV9E6XgXL9eY3x55AP-w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Looking for a proper bar rather than the generic rubbish we’re used to, when looking for a drinking hole on a Saturday evening there isn’t much choice.\nWe came when it was super busy, but was met with sheer enthusiasm for our arrival and nothing was too much effort, I had the parmigiana and my wife had the French dip.\nWill be returning, with 10 more people.",
      "time": 1732706027,
      "translated": false
    },
    {
      "author_name": "Amanda Lim",
      "author_url": "https://www.google.com/maps/contrib/116321628918706777749/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVm0cb7Ep5UJMRsHug0XWAhwNyVMFKP3H551exiybxnvXl_YRg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "It’s our first time in the area, and we were pleasantly surprised to find a nice cove area lined with about 4-5 restaurants. We were greeted by kind hospitality, inviting us to check out the menu before deciding if we want to go in. With two toddlers in tow, I normally wouldn’t choose a British Pub as my choice of a dinner place, but the menu seemed quite family friendly, with interesting pork themed dishes.\n\nBoy, was the food well executed! I ordered a french onion soup as it’s usually not well done at many food establishments. I was impressed when it was brought to the table. It may not have the best presentation, but one look at the soup consistency and colour told me it’d be good. Carbonara was decent too. But the beer bites platter was exceptional. Blind finches (bacon wrapped homemade sausage grilled and drenched in a beer sauce), crispy roasted pork, meatballs and even fries were very well done. Star of the show was the Blind finches. I totally forgot to take photos of the platter because we too eagerly dug into our food. But do drop by if you’re in the area! The warm hospitality is also very pleasing and welcoming.",
      "time": 1704281211,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14537499454348170021",
  "user_ratings_total": 58,
  "vicinity": "LG2-29, Residensi Teluk Puteri, Jalan Tanjung, Puteri Harbour, Iskandar Puteri"
}