{
  "formatted_address": "SG Compassvale Bow 85, #530558 Singapore 544685",
  "geometry": {
    "location": {
      "lat": 1.3829831,
      "lng": 103.8933556
    },
    "viewport": {
      "northeast": {
        "lat": 1.384474180291502,
        "lng": 103.8944776802915
      },
      "southwest": {
        "lat": 1.381776219708498,
        "lng": 103.8917797197085
      }
    }
  },
  "name": "Buangkok",
  "place_id": "ChIJX-pz3j8W2jER0fhQEhJ-KoM",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Charles Tan",
      "author_url": "https://www.google.com/maps/contrib/105144941117330142837/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV9C321sMqIPbWrvrCDbpQd8AiY3RkTUzWUSvGlX0RFAMNW_T5Q=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "4 years ago",
      "text": "Well organized MRT Station 🚉 , clean and quite quite station I have been through transit and explore around in Singapore. Enclosed are showing 3 major banks ATM for withdrawal or transfer online . That's is excellent for choices . Exits to places are well displayed in properly and precision is the  🗝️. Plenty of space for commuters  for entry and exit to their desired location..",
      "time": 1618023924,
      "translated": false
    },
    {
      "author_name": "The Travel Hunter",
      "author_url": "https://www.google.com/maps/contrib/112702441126152817912/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjViyU8VDQNpC7RWExvw3bruVfyZtmqWkZfXAJrtvXSW4Tm_f8AWGQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Buangkok, Singapore - A Neighborhood Review\n\nBuangkok, located in the northeastern part of Singapore, is a serene and family-friendly neighborhood that has grown steadily over the years. It blends modern conveniences with a touch of suburban tranquility, making it an appealing choice for families and professionals alike.\n\nConnectivity\n\nBuangkok MRT station on the North-East Line ensures excellent connectivity to the city and other parts of Singapore. The nearby expressways, such as the KPE and TPE, make driving convenient for those with cars. The efficient public transport system, with numerous bus routes, enhances accessibility within the area.\n\nHousing\n\nThe neighborhood features a mix of HDB flats, condominiums, and landed properties, catering to different budgets and lifestyles. Recent developments, like the integrated development Sengkang Grand Residences, have added a modern touch and enhanced the area’s appeal.\n\nAmenities\n\nBuangkok has a variety of amenities to support daily needs. There are supermarkets, local eateries, and clinics conveniently located in nearby shopping complexes like Hougang Green and Compass One. Sengkang Grand Mall, once fully developed, promises even more retail, dining, and leisure options right next to the MRT station.\n\nLifestyle and Community\n\nOne of the highlights of Buangkok is its peaceful vibe, with plenty of green spaces nearby. Punggol Park and Sengkang Riverside Park offer recreational options for outdoor lovers, while the park connectors make it ideal for cycling and jogging.\n\nSchools in the area, such as Palm View Primary School and Montfort Secondary School, make it a practical choice for families with children. The neighborhood is also known for its close-knit community feel, with residents organizing events and activities to foster a sense of belonging.\n\nPotential for Growth\n\nBuangkok is on an upward trajectory in terms of development, with projects like Sengkang Grand Residences boosting its attractiveness. With its balance of modern conveniences, connectivity, and a peaceful environment, Buangkok is increasingly seen as an up-and-coming area to live and invest in.\n\nConclusion\n\nBuangkok is a hidden gem for those seeking a harmonious blend of urban convenience and suburban charm. While it may lack the bustling vibrancy of more central neighborhoods, its growth potential and livability make it a compelling choice for families, young professionals, and investors.",
      "time": 1732596460,
      "translated": false
    },
    {
      "author_name": "Siti Zainab",
      "author_url": "https://www.google.com/maps/contrib/100537082947170953777/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWl-3JtHAcgnnycoavzCLKV7Mgdtr2ugovKKEfjzSBw1Ri_Rgshqg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "3 years ago",
      "text": "Left one Kampong side in Singapore go this place remember the old days when I live in Kampong so nice place, quite and peaceful village.",
      "time": 1631417668,
      "translated": false
    },
    {
      "author_name": "Chua Mui Cher",
      "author_url": "https://www.google.com/maps/contrib/114748553892930425563/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIt7weHNpklRJywwnnWu_Axs-d--BXnb9zmmaCM0TLy_o2Sdg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "7 years ago",
      "text": "Buangkok MRT station has becoming more crowded during these few years especially morning peak hours. Because of two new  nearby condos and two precincts of newly completed HDB flats. In a few years' times when the upcoming new hawker centre with residential cum shopping mall, new bus interchange next to the station be completed the expected crowd will be worse. Let's take it in the stride.",
      "time": 1525160098,
      "translated": false
    },
    {
      "author_name": "Gayathri Maruthamuthu",
      "author_url": "https://www.google.com/maps/contrib/111244913061192372941/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIUMM-K5kBsQpSiQuSSa_ER06c0t4NC_Nhoqj5C_jMyrGmznw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "My hospital is located in bangkok crescent. Nice place to stay here.",
      "time": 1735091940,
      "translated": false
    }
  ],
  "types": [
    "subway_station",
    "transit_station",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9451505384072214737",
  "user_ratings_total": 112,
  "vicinity": "SG Compassvale Bow 85, #530558"
}