{
  "formatted_address": "1 Jelebu Rd, Singapore 677743",
  "geometry": {
    "location": {
      "lat": 1.3800396,
      "lng": 103.7642339
    },
    "viewport": {
      "northeast": {
        "lat": 1.381346880291502,
        "lng": 103.7657182802915
      },
      "southwest": {
        "lat": 1.378648919708498,
        "lng": 103.7630203197085
      }
    }
  },
  "name": "Bukit Panjang Plaza",
  "place_id": "ChIJe3kTN6MR2jERr5FbmFCuxPI",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Tony Fong",
      "author_url": "https://www.google.com/maps/contrib/111271234938422356089/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWgv-8MW-TUkQBheVXtQSVRERRhxa5qmA4XOdB7fUvhGTW6eK4DPA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "If you ever find yourself in Bukit Panjang and are looking for a cosy, convenient spot to shop, eat, or simply relax, Bukit Panjang Plaza is a gem worth visiting. This nostalgic neighbourhood heartland mall has been around for years and holds a special place in the hearts of many residents. Though it’s relatively older compared to its newer neighbour, Hillion Mall, it has been thoughtfully upgraded over time and continues to be a beloved hangout for locals, families, students, and visitors alike.\n\nOne of the highlights of Bukit Panjang Plaza is the weekly sale at the foyer, which runs from Monday to Sunday. Depending on the week, you might stumble upon great deals on clothing, quirky tidbits reminiscent of NTUC FairPrice, car showcases, or other pop-up events. If you head down early in the week, you’re more likely to score the best value buys before they’re snapped up — a little local shopping secret that regulars cherish.\n\nThe mall offers a well-rounded mix of popular food outlets. You’ll find familiar names like Starbucks, Subway, McDonald's, Pizza Hut, KFC, and Old Chang Kee, alongside bubble tea favourites like Bober Tea and LiHO Tea. For sweet treats or festive goodies, Bengawan Solo and Bee Cheng Hiang (known for their bak kwa) are delightful stops. If you’re craving a hearty sit-down meal, Swensen’s, Ichiban Sushi, and Andes by Astons... provide halal and non-halal options, catering to a diverse crowd. Latest opening - Don Don Donki and the newly upgraded Hawket Street food court.\n\nFor your grocery runs, the NTUC FairPrice Finest in the basement is a convenient choice, though some shoppers feel that Value Dollar Shop. You’ll also find other useful stores like Guardian Pharmacy, Popular Bookstore, Japan Home, Challenger, The Body Shop, Beauty Language, and Hockhua Tonic. There’s even a money changer, which is always handy.\n\nWhat sets Bukit Panjang Plaza apart from many other neighbourhood malls is its integration of community amenities. The National Library branch within the mall is a real gem — it’s not every day you find a shopping centre that also offers a peaceful space for reading or studying. Located right next to Senja-Cashew Community Club and overlooking the scenic Pang Sua Pond in Bukit Panjang Park, the mall also benefits from a lovely green backdrop that makes your visit feel like a break from the bustling city.\n\nGetting here is a breeze. The nearest LRT station is Senja (BP13), which connects to Bukit Panjang MRT (DT1) at Hillion Mall. Direct buses from the mall take you to Orchard, as well as across the North, East, and West of Singapore, making it highly accessible. Whether you’re just popping in for groceries, grabbing a quick meal, or spending a leisurely afternoon, you’ll appreciate the mall’s clean, well-maintained environment and welcoming atmosphere.\n\nCompared to the shiny and modern Hillion Mall across the road, Bukit Panjang Plaza may come across as humble and familiar — but that’s precisely where its charm lies. Many residents hold fond memories here, whether it’s enjoying childhood treats, hanging out after school, or doing everyday errands. Even today, many still prefer shopping here for the dependable FairPrice Finest supermarket and the comforting taste of the familiar food court stalls.\n\nOverall, Bukit Panjang Plaza offers something for everyone — from romantic couples and groups of friends to students, expats, and families. With its friendly, cosy vibe, a wide variety of dining and shopping options, convenient location, and connection to community spaces, it’s a mall that continues to serve as the beating heart of the Bukit Panjang neighbourhood. If you’re in the area, it’s well worth a visit — whether for nostalgia or just to enjoy a pleasant and practical shopping experience.",
      "time": 1746588502,
      "translated": false
    },
    {
      "author_name": "Patrick Patrick",
      "author_url": "https://www.google.com/maps/contrib/107557588153745055831/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUmMdh9SMFmKaAwvfOhJJNZ8ZElSvz67IznG4m8iUXvcsJGxwhlKw=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "One of the popular shopping center in Bukit Panjang neighbourhood. Near to MRT and have direct buses to Orchard, North, East and West if Singapore.\nThe Bukit Panjang estate, particularly the Fajar and Saujana areas, offers a blend of older and modern amenities, making it an appealing option for those seeking affordable housing. The estate is well-connected by LRT but not as close to major MRT stations or malls. It features ample parking, including a new multi-storey car park with a rooftop garden, and accessible walkways. Despite its age, recent upgrades have enhanced its livability, particularly for elderly residents with amenities like e-lobbies and sheltered pathways.\n\nOverall, Bukit Panjang provides a quiet, nature-friendly environment ideal for those valuing tranquility and essential conveniences.",
      "time": 1723350436,
      "translated": false
    },
    {
      "author_name": "andro meda",
      "author_url": "https://www.google.com/maps/contrib/117751987943817733440/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKZ5EsObnyVl7Ec72RZU9qHsLZSFZpwUimjb2CbgThLUn-r-A=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "Compared to Hillion mall, BP plaza has ZERO seats. The seats are very helpful for seniors and those with health issues like myself who need to rest a little in between shopping. The owner of hillion mall has a heart and not entirely driven by greed for money unlike bpp (i.e Capitaland).",
      "time": 1746744513,
      "translated": false
    },
    {
      "author_name": "Djoeis Shi",
      "author_url": "https://www.google.com/maps/contrib/111128052716293687431/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWbz592v-i2ox_ynVCcm_KTj7aa-AL0cT6QXAvYEUHKUaNqD-UabQ=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "7 months ago",
      "text": "Bukit Panjang Plaza is an older shopping mall in the Bukit Panjang area. It is near the MRT station.\n\nThere are several shops here though not as crowded as the newer Hillion Mall.\nLevel 4 open air could be rented for the event.",
      "time": 1728721085,
      "translated": false
    },
    {
      "author_name": "Eileen Neo (Sgsohotleh)",
      "author_url": "https://www.google.com/maps/contrib/114986102670574642770/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVPiRDlMw2MALiqHHWarH82GMgVN__4D6L4QNXqGIl8UKKS90VZ7Q=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Great, well-maintained mall with strong anchor tenants, NTUC, Kopitiam, Harvey Norman, library and etc. Offered many varieties of food. The halal and non halal options; Swensens, Ajumma, subway, Ichiban, Sukiya. Relatively convenient as it is walking distance to MRT. Clean mall.",
      "time": 1654763482,
      "translated": false
    }
  ],
  "types": [
    "shopping_mall",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17493298513790603695",
  "user_ratings_total": 5719,
  "vicinity": "1 Jelebu Road"
}