{
  "formatted_address": "1 Jelebu Road #04-04 & 16/17 Bukit Panjang Plaza, Singapore 677743",
  "geometry": {
    "location": {
      "lat": 1.3799627,
      "lng": 103.7643391
    },
    "viewport": {
      "northeast": {
        "lat": 1.380997780291502,
        "lng": 103.7655932302915
      },
      "southwest": {
        "lat": 1.378299819708498,
        "lng": 103.7628952697085
      }
    }
  },
  "name": "Bukit Panjang Public Library",
  "place_id": "ChIJAQAASKMR2jER1rsyt_ipOM0",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Yellow Bear",
      "author_url": "https://www.google.com/maps/contrib/104489311735261065689/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXJw6wU_ViJ96j0KUowLXVVtxYUueaV518tEdvuXXsBsEMiDzjh=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "It’s small but very well maintained; bright and clean, with books of 4 main languages in Singapore. The staff are friendly and helpful in this library.",
      "time": 1731988207,
      "translated": false
    },
    {
      "author_name": "Melsha Lau",
      "author_url": "https://www.google.com/maps/contrib/106078607105383913309/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIg8-JUTlnTWVrdDs-4lEoRwHwSC5OODeaT6Ohqsp-KLhcXXw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "The librarians thre are extremely kind and willing to help and The library is well designed like the book mountains and colourful bookshelves (Book mountains) and the mountains design pasted on the book borrowing station. I would strongly encourage you to visit this Library, It is located in Bukit Panjang Plaza and very convenient by bus as there is a bus stop in front of Bukit Panjang Plaza.",
      "time": 1746778162,
      "translated": false
    },
    {
      "author_name": "Zenith Zenith",
      "author_url": "https://www.google.com/maps/contrib/104303597646743009486/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUvEWCyGdaJiItApLnnqYGtm9wMhctVNU1_MTLt1mfw523QWqFM=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I am a cynical person by nature. I am deeply impressed by staff good customer service when approached for help. They are so kind, empathetic, caring and helpful to do their best to assist. I am truly touch by their kampong spirit to render assistance whenever needed and I am truly bless to be a patron of Bt Panjang Public Library. I wld like to give credit to the young Malay  plum lady dressed in blue uniform with tudung on last Sunday going all out to assist me to connect my laptop to the wirelessSGx in the late afternoon. Another Malay lady also dressed in blue uniform with a tudung and an Indian lady in spectacles with a pig tail on 4 Mar at about 130pm to 2pm to help me reserve a seat at the library as there is something wrong with the NLB App to reserve seat via my mobile phone. I hope NLB would take note of such dedicated staff for their good customer service. NLB is truly blessed to have such staff.",
      "time": 1741077266,
      "translated": false
    },
    {
      "author_name": "Victoria Lee",
      "author_url": "https://www.google.com/maps/contrib/108288823348313810892/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUR377hicEQTxt5W5vYcCE8JFar9OzH3J7q_Gu-3BR44bq08bLp=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "2 months ago",
      "text": "my experience at library is peacful. yes, its quiet and a clean environment. But, i feel like there are not many seating places to study. i suggest that they can add more seatings and as a very introverted person, i find it hard to sit with others at a one circle table. so maybe to make other introverts like me feel less anxious by making one seating with walls around. :)",
      "time": 1742198076,
      "translated": false
    },
    {
      "author_name": "Xoom Too",
      "author_url": "https://www.google.com/maps/contrib/105863133358477079886/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVLRzhuxFKh1jOBQiJLb1bjferwZ-xPRZ7v7ReqgRp2P_uVyh9Y4Q=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "3 years ago",
      "text": "My rating: 4/5\nWhat I like in libraries: Books that are available that I originally have on my online To-Be-Read (TBR). Spacious environments. Multiple book genres.\n\nI have never seen a library like Bukit Panjang. It’s in a mall, and once you go to the highest level of the mall, you’ll notice there are 2 Bukit Panjang Libraries, when in reality they only have one, just the kind of spread it out a bit. On one side of the level, there’s a children’s section. On the other side, there’s an adults & teens zone.\n\nThe children’s zone is very spacious. The design of the children’s zone is very different and kind of unique. In the middle of the room, there’s these bookshelves on this circle thing, and you can walk up there, and there are a few shelves there too. They also have these like walls that are kind of separated, they form a circle, and you can sit in between the walls.\n\nIn the adult & teens zone, one of the first things I noticed was the shelves for the magazines. They were almost like a zig-zag in a sense. When you first walk in, you can see this swirly thing where they have a few books on display.\n\nWhen you look up, you can notice the design close to the ceiling, and I think it’s really cool. Like the children’s zone, they also have separated walls that form a bit of a circle, and you can sit there, and work on your computers, study, and read. They also have audiovisuals, and a section with tables and computers.\n\nThere’s also this circle thing, once you’ve walked in a bit farther and turned to the right. It’s filled with bookshelves, tables, seats, and people. I noticed everyone that was sitting there was studying on their computers. Which makes me think the Bukit Panjang Library is a really nice place to study at. But I think it would be a bit harder to get a seat if you don’t come early.\n\nOverall, I personally really like this library because I think you can do diverse things there like, reading, listening to an audiobook, working on your computers, studying, and more.",
      "time": 1643161893,
      "translated": false
    }
  ],
  "types": [
    "library",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14787756262161562582",
  "user_ratings_total": 216,
  "vicinity": "1 Jelebu Road #04-04 & 16/17 Bukit Panjang Plaza"
}