{
  "formatted_address": "469 Bukit Batok West Ave 9, Singapore 650469",
  "geometry": {
    "location": {
      "lat": 1.3551385,
      "lng": 103.7417936
    },
    "viewport": {
      "northeast": {
        "lat": 1.356387030291502,
        "lng": 103.7432534302915
      },
      "southwest": {
        "lat": 1.353689069708498,
        "lng": 103.7405554697085
      }
    }
  },
  "name": "Bukit Batok West Hawker Centre",
  "place_id": "ChIJP4_FiqQR2jERBKnVkYoHIcQ",
  "rating": 3.2,
  "reviews": [
    {
      "author_name": "Lau Guan Zhen (Sean)",
      "author_url": "https://www.google.com/maps/contrib/111510773764729640794/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW5BlZx4dqH3OGtISOZEkZWCNCoiltHoVwqsu5qsJH_gj6jI-fx=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "4 weeks ago",
      "text": "Really impressed with the new Bukit Batok West Hawker Centre! It’s clean, spacious, and has a great mix of stalls — from classic local favourites to newer, trendy options. Great that every stall offers a budget meal too, so it’s super wallet-friendly. Plenty of seating and the vibe is lively but might crowded at certain hour. It’s a great spot for lunch or dinner if you’re in the area. Will definitely be back to try more!",
      "time": 1745306250,
      "translated": false
    },
    {
      "author_name": "edtayjb",
      "author_url": "https://www.google.com/maps/contrib/107467079327459015215/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJnxyZ0BYtgLZ6p7QJ-kzeM77_I23A7aVM-YXaEyCzSWBv6Fg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "3 weeks ago",
      "text": "My first visit today to this \"recently\" opened, newest hawker centre in Singapore. Whilst there were only 22 stalls, the food choices here were more than sufficient to satisfy me. I tried today the Hokkien Mee and it was very good. The Kopi from the drinks stall was also very good and reasonably priced. The Tau Suan here IMO could be better. I'd recommend this hawker centre if you the type who finds the bigger hawker centres overwhelming. My only disappointment - as with the newer hawker centres - is the poor drink stall to number of stalls ratio. There's only one for this hawker centre.",
      "time": 1745561884,
      "translated": false
    },
    {
      "author_name": "Kim Kimora",
      "author_url": "https://www.google.com/maps/contrib/116582846243655414021/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXFHfGkHuzBwrI824AfcQz_Y1xhJChfCrCB_8OfDkCk_ajMast2uA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "The noodle with meat and egg for $3.50 is very delicious and affordable. Must give it a try. Already opened as early as 7am. The set of coffee, bread and eggs are good too. I saw many people queue for the noodle stall. Should be nice too.",
      "time": 1743400796,
      "translated": false
    },
    {
      "author_name": "ML",
      "author_url": "https://www.google.com/maps/contrib/106421457478618430542/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU76uZp9exsjWuit0CWjXHcvmeLRK6F0HQyeN5y4e1R8WhaOhjlpQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 2,
      "relative_time_description": "2 weeks ago",
      "text": "Went there first time over the weekend and it was too crowded to get any seat or Q for food so we left.\nWent again on weekday lunch hour, less people than weekend but still crowded.\nManaged to share a table but Q for food was pretty long.\n\nThe fried rice with pork chop $6.90 was pretty dry- both the rice and meat was really dry. The food was a bit of a wait to order and collect at least 10-15 min.\nYoutiao & soy bean stall female shop keeper was quite rude shouting at customers for no apparent reason.\nThe prawn mee also very long Q and long waiting time as they fried batch by batch. Small portion $5. The taste was very sweet. Not so suitable for my palate.\nFishball noodle was very salty and also long Q. At lunch hour the fried bun shengjianbao wasn’t opened yet. Too bad can’t try.\nIt’s good that each stall has a cheaper option less than $4 to benefit the lower income.\n\nThere’s big fans above so the whole hawker center is airy. Also has many washing basins to clean hands. The place is new so everything is clean. There’s many stalls from Vietnamese to chicken rice to briyani and prata.\nI think if you’re a good place to dine for people in the area but no need to travel there just to eat.\n\nMay 2025 update:\nTried the so called popular shenjianbao and noodles shop, it’s poor quality to me. The Bao are small, yes it’s crispy and juicy but the filing is not great, I ordered the prawn it was quite tasteless and mushy. Not sure what filling it is after eating it. For $5.50 three small pieces it’s quite expensive.\n\nThe beef noodles from the same store, flavor wasn’t good, the soup doesn’t have a nice braised beef taste, it’s quite bland. It’s a bit gamey too. Not to our taste. I won’t eat it again. $5.50 is quite filling as I’ve already had the Bao but on its own maybe you’re better off just eating ban Mian.\n\nWe also ordered the vegetarian beehoon with toppings it was like $6 for beehoon with 3 veggie toppings. It’s ok ok not like wow must eat unless you’re vegetarian. This hawker center is like getting disappointing.",
      "time": 1746530372,
      "translated": false
    },
    {
      "author_name": "Pauline Wee",
      "author_url": "https://www.google.com/maps/contrib/113442208195765868656/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUz_DLKjUGkLOhF6kJ93NDOEdoKp27yXqfzBfwzQJWmZ2qYcjPb=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "A great hawker centre located right beside Le Quest Mall at Blk 469, Bukit Batok West Ave 9. There are over 20 stalls offering a wide variety of local delights – from traditional noodles and chicken rice to modern fusion bites. The place is well-ventilated with large ceiling fans, making it comfortable even during peak hours.\n\nThe entire area is clean and well-maintained, and the return tray station is neatly tucked at one corner, keeping things organised. Parking can be a bit of a challenge as it's only available on Level 2 with just one level of parking, so it’s quite limited. Still, it's worth the visit if you’re in the area or staying nearby. Great spot for a casual and tasty meal!",
      "time": 1743978973,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14132585397398907140",
  "user_ratings_total": 122,
  "vicinity": "469 Bukit Batok West Avenue 9, Singapore"
}