{
  "formatted_address": "10 Medical Drive, MD11, #01-40 Yong Loo Lin School of Medicine, Singapore 117597",
  "geometry": {
    "location": {
      "lat": 1.2958638,
      "lng": 103.7818031
    },
    "viewport": {
      "northeast": {
        "lat": 1.297104730291502,
        "lng": 103.7832103802915
      },
      "southwest": {
        "lat": 1.294406769708498,
        "lng": 103.7805124197085
      }
    }
  },
  "name": "Burnt Cones Gelato (NUS MD11)",
  "place_id": "ChIJr145y2Ab2jERhDyPC-k6riU",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "K K",
      "author_url": "https://www.google.com/maps/contrib/115916787628645073954/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJfY_DmzpdjB24nZ-Oz20_8Zj-_TeyDx7HLCVBScC5Xy1z7vg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I visited this gelato café and tried their signature flavors, peanut butter and mint chocolate, buttermilk waffle, and cold brew white. All of them were delicious! The peanut butter and mint chocolate had a nice mix of creamy and refreshing, the buttermilk waffle was sweet and buttery, and the cold brew white was a perfect blend of coffee and cream. A great spot with tasty, unique flavors!",
      "time": 1743236273,
      "translated": false
    },
    {
      "author_name": "Georg B",
      "author_url": "https://www.google.com/maps/contrib/109722010266123120178/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK6ykQQRpKscEfdh-h2COqT41OrMs4AS7C24fR0wLzeB1bl3bw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "A little expensive for me as a student, but some of the best coffee and ice cream in Singapore. Quite nice for a study break. I highly recommend the pistachio ice cream!\n\nThey do offer a 5% student discount, in theory, but singing up for it requires downloading an app and going through a sign up process that took too long and required too much information, so I never completed it. My suggestion to management: offer a 10% discount for anybody with a student card, out of fairness and respect to the students, without trying to acquire data or harass us with a newsletter. Your profit margins surely allow for it.",
      "time": 1740386929,
      "translated": false
    },
    {
      "author_name": "Kayven",
      "author_url": "https://www.google.com/maps/contrib/106786175078854997780/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV3bI6gh3o4U735Efn4lwQ_Jgf9SFv3j9nk2EHwQYKb0Jpa-f0=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Heavenly flavours and crisp texture (from chocolate bits)\n\nFood rating: 10/10 🍦\n- oh my days im telling you when this is the best ice cream spot, this is the best ice cream spot! We ordered the stracciatella, which is milk ice cream with chocolate bits, as well as stracciamenta, which is mint ice cream with chocolate bits. The milk ice cream had such a smooth consistency and had none of those little ice crystals you would find in one of those big ice cream shop chains. And the stracciamenta’s minty taste was like just nice and it was very soft. Also tried the pistachio ice cream at newest and it was one of the richest and smooth ice creams ever so you can try that as well! Each cup of ice cream is $5 and premium flavours are $6, which is lowk very affordable at this day and age for something of such high quality. They also occasionally have special flavours like Dubai chocolate or strawberry shortcake which ranges from 10-12$.\nword to describe food: OHHH YES\n\nService rating: 9/10 🧍‍♂️\n- despite the crowd, the staff are still respectful and do their best to serve the customers with care and consideration, ensuring all orders are fulfilled with quality. These young ones are still able to work so efficiently and the waffles and ice creams come out before you can even walk back to your seat. The drinks do take awhile longer as it takes more time to make, so don’t grumble!\n\nAmbience: 10/10 🌴\n- i think burnt cones is going for a more industrial look with their exposed concrete look - where it is unpainted and untiled, yet smooth. This really adds to the simplistic aesthetic where there’s no abstract design that might overwhelm your eyes with complex stuff all around you, which makes it a fairly good spot for more serious discussion or causal conversations with minimal distraction. Really good dessert spot for families and friends after a good meal too!\n\nOverall rating: 10/10\n- Vibes immaculate, amazing food, you will confirm be back bahaha (nus branches also have new menu item of cakes!) All sweet tooths arise and support burnt cones ✊✊",
      "time": 1741445127,
      "translated": false
    },
    {
      "author_name": "Lisa Tan",
      "author_url": "https://www.google.com/maps/contrib/101214716706794404630/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJKQrsA9Fx2H3CGtsTgVoOT4BS3yf1kuBSWbq00lfaJV_UUBw=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "pretty yummy gelato! also with the shopee vouchers and nus 1-for-1 offer the gelato is super worth! ube and goji chrysanthemum are my favourites\n\nflat white has a strong coffee taste too!",
      "time": 1739509570,
      "translated": false
    },
    {
      "author_name": "scott kingsworth",
      "author_url": "https://www.google.com/maps/contrib/101498485278993995874/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIWXcj3V_BNRhCqbCKY4TYiyCwT-6eISVoqgw0N3Aj_1Dv9OuA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "The best service ever! The ice cream was delicious and the staff were so kind to let us try it out😍😍 must come here!!!!",
      "time": 1742795338,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "store",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2715172397946715268",
  "user_ratings_total": 1134,
  "vicinity": "10 Medical Drive, MD11, #01-40 Yong Loo Lin School of Medicine"
}