{
  "formatted_address": "49 Cuppage Rd, Singapore 229466",
  "geometry": {
    "location": {
      "lat": 1.302489,
      "lng": 103.840372
    },
    "viewport": {
      "northeast": {
        "lat": 1.303860030291502,
        "lng": 103.8416542802915
      },
      "southwest": {
        "lat": 1.301162069708498,
        "lng": 103.8389563197085
      }
    }
  },
  "name": "Cable Car 1890's Saloon",
  "place_id": "ChIJzTfUl5YZ2jER4Op0LpTj_DE",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Gabriel Yeong",
      "author_url": "https://www.google.com/maps/contrib/115043003420852420669/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL993MmHJsrkegg_rGy9GDwaWprWzarr-5JApbnjaAZYLqDpg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "This bar has become one of my favorite spots! The atmosphere is always vibrant and welcoming, and the drinks are consistently top-notch. A special shoutout to the manager, whose hospitality truly sets this place apart. They always go above and beyond to make every visit feel special, creating a warm and inviting environment for everyone. Highly recommend stopping by—you won’t be disappointed!\n\nLove the takowasa and grilled squid. I’m glad luncheon fries are back too :)",
      "time": 1734788667,
      "translated": false
    },
    {
      "author_name": "Michael Agustin",
      "author_url": "https://www.google.com/maps/contrib/105092259468793502019/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXq1ob9GBQGFj2OnwIprCmTwyanJbA6EVTHuJybDEuduJ4oGfk=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Me and my wife had a great experience of dining here. One of the best bar experience so far. Welcoming and friendly staff like Dennis Waray Oronos, they served awesome cocktails made from local ingredients. Simply amazing! We will surely going back again.🤙🏻🫡🙏🏻😇",
      "time": 1731318369,
      "translated": false
    },
    {
      "author_name": "Raul Benjamin Libunao",
      "author_url": "https://www.google.com/maps/contrib/117337029462221719046/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWw7ENlL0ZtqJ7G3dx3ZbYMGpsH4Tm7dPCLMqk9D9kKiffF_Sj4=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "The restaurant's beginnings of Sunday afternoon was slow, with only one table occupies. We were greeted and seated immediately with the accomodating server.\n\nWe ordered two of their 10 SGD Sunday Promo Pizzas: one 4 Cheese Pizza and the other Chilli & Sausage Pizza. Total came to 24 SGD (inclusive of 10% service charge and 9% G.S.T.). Serving time was eighteen minutes from the moment we placed our order.\n\nBoth pizzas taste great, with the Chilli & Sausage Pizza having a kick in spice, but I would call this expensive, as all the restaurants in the area.",
      "time": 1724908580,
      "translated": false
    },
    {
      "author_name": "Dru Lu",
      "author_url": "https://www.google.com/maps/contrib/115927493800245457440/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWmVFS1biEig1iBfP74zrNgvGpzc5UU6zKopz5pbeHtDmi4iUp6=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "I love how this place is rated so low on google. It’s got cold beer at reasonable price for orchard, it’s got a fairly quiet and comfortable environment, it’s got a decent selection of hard liquor (not expansive), it’s got izakaya food???? That’s weird for a pub. But it does checks all the marks for neighbourhood watering hole. The beer is poured well and cold.",
      "time": 1679151896,
      "translated": false
    },
    {
      "author_name": "Dylan (The Cool Dude)",
      "author_url": "https://www.google.com/maps/contrib/114322867736248245242/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUR11W6SR4Iu_P6gnF0xvpgVnrsiCp8nUsBgvu0zlHkvQzvz6Fq=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "Nestled in the vibrant heart of downtown Orchard, Cable Car 1890’s Saloon seamlessly blends the elegance of classic cocktails with the artistry of Japanese cuisine. This chic establishment offers an inviting ambiance perfect for both intimate evenings and lively gatherings.\n\nUpon entering, you're greeted by a chic, classic interior with subtle English influences—think soft lighting, woody decor, and a warm, inviting atmosphere. The bar boasts an impressive selection of spirits, with a particular emphasis on whiskey and beer. Their skilled mixologists craft timeless cocktails like the Highball and Negroni with meticulous attention to detail, while also offering innovative creations that tantalize the palate. They also make alcohol free cocktail like the Gunner.\n\nThe culinary experience is equally exceptional. The menu features an array of Japanese delights, from delicately prepared sashimi and sushi rolls to heartier dishes like tempura and yakitori. Each dish is a testament to the chef's expertise, with fresh ingredients and traditional techniques taking center stage.\n\nWhether you're savoring a perfectly balanced cocktail or indulging in exquisite Japanese fare, Cable Car 1890’s Saloon delivers an unforgettable dining experience. It's a must-visit for anyone looking to enjoy the best of both worlds in downtown Orchard.",
      "time": 1721908327,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3602004027563633376",
  "user_ratings_total": 196,
  "vicinity": "49 Cuppage Road"
}