{
  "formatted_address": "29 Swan Lake Ave, Singapore 455718",
  "geometry": {
    "location": {
      "lat": 1.321616,
      "lng": 103.923928
    },
    "viewport": {
      "northeast": {
        "lat": 1.322662980291502,
        "lng": 103.9254585802915
      },
      "southwest": {
        "lat": 1.319965019708498,
        "lng": 103.9227606197085
      }
    }
  },
  "name": "Cafe de Swan",
  "place_id": "ChIJBRwJ-hkj2jERQjAzfUJVaX4",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "קרולין ג'ודית",
      "author_url": "https://www.google.com/maps/contrib/111623065647759363899/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKcqWRGaivwiASMzxstjX4GnzZe_F5pX40FIUpoJ4aCpUnYjzI=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Step into this charming cafe and be transported to a world of epicurean bliss. With a menu that boasts an impressive selection of gourmet delights, artisanal coffee, and heavenly pastries, you'll be spoiled for choice. Every bite and sip is a masterclass in flavor and presentation.\n\nThe crew staff are all warm and friendly awaiting to help you with your orders. Every dish is curated to its very best.",
      "time": 1741155416,
      "translated": false
    },
    {
      "author_name": "B T",
      "author_url": "https://www.google.com/maps/contrib/118180948935792046103/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJrSYULzYlf2PokUxaWihad-hVce8OtW0dTpi7nc5XlWRq6IA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "This cafe is truly a hidden gem in Opera Estate. Desserts are intricately crafted and made in house! The standout for me was their lemon tart, featuring a uniquely crispy crust that perfectly complements the tangy and sweet filling—dare I say, the best lemon tart I’ve ever had. Came back for more and wasnt disappointed.\n\nEvery dish reflects incredible attention to detail, from the artful presentation to the exquisite flavors, showcasing the passion and craftsmanship of the team. Whether you’re a dessert enthusiast or seeking a cozy spot for quality mains like pasta or light snacks, this cafe is an absolute must-visit. I can’t wait to return!",
      "time": 1736077776,
      "translated": false
    },
    {
      "author_name": "xy",
      "author_url": "https://www.google.com/maps/contrib/112701604865340439009/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK2nni2gSheiLXAvz8O9iTznRM-RKqbQbWeD8CvKRksUTw9EQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "the food was better than we had even anticipated (even though we came in with pretty high expectations from all the raving reviews). service was good, can tell that the staff are passionate.\n\nthe pork chop was so good my dad couldn’t stop raving about it- the quality and finesse justifies the price. salmon skin was soooo crisp & well-seasoned. we had not even planned to order the waffles (we were eyeing the tarts) but bc another table did, the smell of the waffle being made was soooo yummy we had to get it too :”) no regrets, it was perfectly crispy outside and nice and fluffy on the inside. the fruits as topping was a nice touch too! Overall, we rly enjoyed the food and will be back to try more dishes & maybe the drinks too.",
      "time": 1745811536,
      "translated": false
    },
    {
      "author_name": "Lee Ker Yih",
      "author_url": "https://www.google.com/maps/contrib/116731102949941192826/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWDP_Wiy1wrqx-9Pt6yavf1nN0WEg5-AovGnhWxGFPunggcfJP0=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "First-time visit to Café de Swan and it definitely won’t be the last!\n\nThe café is conveniently located near the main road, just a short walk from the nearby bus stop, making it very accessible. The interior is spacious, thoughtfully renovated, and exudes a cozy yet modern vibe. Soft, soothing music playing in the background added to the relaxing ambiance perfect for a casual catch-up or a quiet afternoon break.\n\nUpon arrival, I was warmly greeted by the friendly staff, which made the experience even more welcoming. I ordered the Tater Tots and requested a truffle oil infusion, kudos to the team for accommodating the special request. They were crispy, aromatic, and incredibly addictive. I also had the Nutella Mocha, which was rich, smooth, and just the right balance of chocolate and coffee.\n\nOverall, a delightful experience with great service and quality offerings. Looking forward to returning to explore more of their menu and uncover more hidden gems",
      "time": 1743924713,
      "translated": false
    },
    {
      "author_name": "Ang Hui Keng",
      "author_url": "https://www.google.com/maps/contrib/107259753146417680176/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWglAE0LBEx13kiSj3w39Vyw0aIRCh5vEPeqXrfBmR1w78o73A3hQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Visited twice this weekend…Delicious food, ordered the carbonara, 1/2 chicken, triple bangers, duroc pork chop and crispy salmon; all done nicely. Brownie with vanilla ice cream is yummy.",
      "time": 1745757989,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9108905465390248002",
  "user_ratings_total": 135,
  "vicinity": "29 Swan Lake Avenue"
}