{
  "formatted_address": "50 Upper Serangoon View, #01-01, Singapore 533893",
  "geometry": {
    "location": {
      "lat": 1.3742128,
      "lng": 103.9028089
    },
    "viewport": {
      "northeast": {
        "lat": 1.375609680291502,
        "lng": 103.9040938802915
      },
      "southwest": {
        "lat": 1.372911719708498,
        "lng": 103.9013959197085
      }
    }
  },
  "name": "Cambridge @ Kingsford Waterbay",
  "place_id": "ChIJAUZY9McX2jERd0tZbpy50Qg",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Gary Ang",
      "author_url": "https://www.google.com/maps/contrib/103124475536577803078/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWd5c9H_7HMp3Pbc_PI2hqqeY6vs5QFzdnlb6dKT3Wb7V-4jjMV=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Our son has been with Cambridge@Kingsford Waterbay since he was just 5 months old, and we couldn’t be happier with the care and attention he has received over the past several months. It’s heartwarming to see how much he enjoys being at the centre, especially his bond with the teachers. Every morning when we arrive, he lights up when his teacher smiles and calls to him, and he eagerly walks towards them—it’s clear they genuinely care for him.\n\nThe centre offers a variety of engaging sensory activities, and we’re thrilled that our son is learning both English and Mandarin songs. They also incorporate outdoor activities in a safe environment, taking advantage of the Kingsford Waterbay condo common areas, which is fantastic for the babies to enjoy fresh air and explore safely.\n\nWhat’s truly special is how even teachers from other classes, as well as the principals, know my son by his name. This level of personal attention creates a warm and inclusive community, making the centre feel like an extended family. The small class size allows focused attention for each child, and we appreciate the thoughtful detail of assigning every baby their own bed for comfort and hygiene.\n\nCambridge@Kingsford Waterbay has been a wonderful second home for our son, providing him with a nurturing and stimulating space to grow, learn, and interact with others. We’re deeply thankful for the love and dedication of the staff and highly recommend this centre to other parents!",
      "time": 1733275243,
      "translated": false
    },
    {
      "author_name": "ashley chia",
      "author_url": "https://www.google.com/maps/contrib/113221854005056069805/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIrwa7RQcskbKvOpyhwRAxYWZl8sBDBDMm85eCi30yA4NgpLw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Best decision made to send my children to.this preschool. Best teachers whom are caring and understanding.i see growth in terms of academics and personal in both my son and daughter. Yr 2024 was his last year in Cambridge and he feels sad leaving this wonderful place. Because of his love for the school, he choose to stay in school till end of Dec despite having a choice of staying home to relax before he starts P1.\nI would like to thank Teacher Regina and Wang Laoshi for being such wonderful teachers to him..he will miss his fav teachers...",
      "time": 1735661928,
      "translated": false
    },
    {
      "author_name": "Danay Figueroa",
      "author_url": "https://www.google.com/maps/contrib/109081628024801571907/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXrssPXbKV8VUCRBK7uOumH7v72UFOw9DiYjbhwooJqKhXrrAbgKw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "My son is very happy at school, when he started he didn't know how to speak English since we are Latinos and we speak Spanish and it's so cute that in 3 months he already spoke quite a bit of English My son loves his teacher Hanna, she is very kind and teaches children with great love and dedication, she loves her profession❤️ and I am very happy",
      "time": 1734441041,
      "translated": false
    },
    {
      "author_name": "Ceriine Lee",
      "author_url": "https://www.google.com/maps/contrib/113135384455105272412/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJuR7T2N-7bECgpeE1W3sA85jns52KgyLPhoNf9ys-inBmH=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "My kids entered into Cambridge Preschool during their N2 journey. Just within that 1 year itself we can see how well they grow and learn from the school. The well-rounded cirruculum makes the kids so interested in learning & every single day they're looking forward to go school. Impressed with their AI chinese and math when I revised with them at home. Not forgetting to mention they have a bunch of dedicated & attentive teachers. Keep up the good work and will highly recommend this pre-school.",
      "time": 1732275736,
      "translated": false
    },
    {
      "author_name": "iw4ns",
      "author_url": "https://www.google.com/maps/contrib/109902693758535132452/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUfg2A7aUliRkNHKKMd-a1dacXdo4WISNjq0W7RCQ7JMvU7jI8=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "My daughter have been in Cambridge Kingsford waterbay since N2 till K2 and now almost graduation already. coincidentally the same 2 teachers have been teaching her and her classmates since N2 till now. What I really like about Cambridge is that we can easily communicate with teachers either via mobile app (comm-app) or speak directly in person. In the first few months joining Cambridge I can see a lot of improvement in my kid's ability to recognize her feeling and handle her emotion better. Her Chinese language was also improving although we never speak Chinese at home. They learn so many useful skill like how to read the time, counting the money, phonics, isteam.They also always provide the parents updates about what they learn and their activities. I'm also quite surprised my daughter is familiar about low code programming or game based programming (e.g code monkey, jimu robot), utilizing the current tech like artificial intelligence (math-ai, Chinese-ai) enhancing the learning experience and make them familiar how to collaborate with AI. I think my daughter is in good hands so I can focus on my work during the day.",
      "time": 1732269619,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=635493103953333111",
  "user_ratings_total": 66,
  "vicinity": "50 Upper Serangoon View, #01-01"
}