{
  "formatted_address": "7 Jurong West Street 41, Singapore 649414",
  "geometry": {
    "location": {
      "lat": 1.3457076,
      "lng": 103.726896
    },
    "viewport": {
      "northeast": {
        "lat": 1.346446680291502,
        "lng": 103.7279522802915
      },
      "southwest": {
        "lat": 1.343748719708498,
        "lng": 103.7252543197085
      }
    }
  },
  "name": "Canadian International School",
  "place_id": "ChIJIzUM1WYZ2jERkCc8DvkwgRs",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "y s",
      "author_url": "https://www.google.com/maps/contrib/107984361077914871194/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI_g_xjdS4V7_KYnm_FPD8yD9S90OdIK5tf8oYMQRymb2Tc1E8=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Not bad this school，To be honest！ Some teachers are very nice，responsible.the school facilites are much better than other schools. recommend！just the lunch prices at the school cafeteria are a bit high. In 2024, the school had two students who achieved a perfect IB score. It is a great school. swimming club is perfect，swimming team coach are very good！",
      "time": 1741350727,
      "translated": false
    },
    {
      "author_name": "Alex Tan (sup dot sg)",
      "author_url": "https://www.google.com/maps/contrib/114029170025753307595/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVZIUHpZzivPaRIlKl3HeA8OgppX-34l6zOq9S3p5xCUStGLGU=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "I recently had the pleasure of touring this school and I have to say, I was blown away by the level of professionalism and commitment to education that I witnessed. From the moment I arrived, it was clear that this is a school that takes its mission seriously and strives to provide the best possible education for its students.\n\nFirst off, the location of the school is incredibly convenient, with easy access from major highways and public transportation. This makes it a breeze for parents and students alike to get to and from the school each day.\n\nBut what really impressed me was the level of care and attention that the staff and teachers put into creating a positive and engaging learning environment. The classrooms were bright, clean, and well-equipped with the latest technology and teaching resources. And the teachers themselves were knowledgeable, passionate, and dedicated to helping their students succeed.\n\nBut it's not just the academics that set this school apart - it's also the sense of community and inclusivity that permeates throughout the campus. From the diverse student body to the various extracurricular activities and events, it's clear that this is a school that values and celebrates differences.\n\nOverall, I couldn't recommend this international school highly enough. If you're looking for a school that combines convenience, professionalism, and a commitment to excellence, then look no further. This school is truly top-notch and deserving of every single one of its 5 stars. yours truly, doge multiverse sg",
      "time": 1680791594,
      "translated": false
    },
    {
      "author_name": "Cocodoco Melon",
      "author_url": "https://www.google.com/maps/contrib/106527368926846674605/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocItFJCQLYJvlpJ4ywHyuLasogkMPacze3zKnx91BhjVIj0TVw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "We absolutely love CIS! One of the things that stands out most to us is how the school embraces and nurtures “friendology” — a focus on building strong, supportive relationships among students. When my daughter made a mistake in front of everyone, I was touched by what happened next. Instead of laughing or teasing, students of all ages came over to cheer her up and encourage her. It was heartwarming to see such kindness and empathy in action. This sense of community, beyond just academics, is something truly special. I’m so happy my daughter is learning and growing at CIS!",
      "time": 1741913736,
      "translated": false
    },
    {
      "author_name": "Lynx",
      "author_url": "https://www.google.com/maps/contrib/112982382019460214071/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLNKy5CYK8zzSOmf4PRDIX4DPQtcCplULgFGHKgaREqcZv-qw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "I happen to be sitting in the cabin when it reached Chinese Garden MRT. This female student from this school trudged in and sat down hastily next to me, as if she is afraid it will be the end of the world if she doesn't obtain a seat. She knocked into me and it hurt me alittle but she did not bother to apologise. No spatial awareness. I didn't think too much about it but throughout the journey these girls speaks so loudly and it just doesn't give the school a good impression. Their demeanour seemed so rowdy and bimbotic. Thereafter the female beside me tied her hair and kept on swinging her dry hay-like hair in my face. Very unladylike. Ruined my public transport journey. I thought they should be polite but this one is not.",
      "time": 1736859374,
      "translated": false
    },
    {
      "author_name": "Yan Li",
      "author_url": "https://www.google.com/maps/contrib/116005159788707915749/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV2aZoFG4-GD7bvG7ZrTGF5CIiStYjg9WxQ-Xup-AfyhhDQsXI=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "11 months ago",
      "text": "Never consider this school unless you don’t mind being trapped by the horrible traffic on campus. CIS has crazily expanded the admission of students recently without expanding their roads and carpark. We were just stuck in the hot sun on campus for 15 minutes after pick-up and this is a record of off-peak hours. The school has no respect for parents’ time and no consideration for our experience. Bye-bye, we are leaving. Good luck for those staying!",
      "time": 1717057652,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1981919157263542160",
  "user_ratings_total": 134,
  "vicinity": "7 Jurong West Street 41"
}