{
  "formatted_address": "#01-01, 33 Hyderabad Road, HortPark, Singapore 119578",
  "geometry": {
    "location": {
      "lat": 1.2786628,
      "lng": 103.8008116
    },
    "viewport": {
      "northeast": {
        "lat": 1.279875280291502,
        "lng": 103.8024161302915
      },
      "southwest": {
        "lat": 1.277177319708498,
        "lng": 103.7997181697085
      }
    }
  },
  "name": "Canopy HortPark",
  "place_id": "ChIJD2-oVRwb2jERt-DXYPcnbQs",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Joyce Goh",
      "author_url": "https://www.google.com/maps/contrib/108357057812241637168/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJTQrbFo0fWH6o10tpUspmwiGNlMt3vMsUmKOcTyrLW_0Yppg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "3 weeks ago",
      "text": "Food - portion is big, taste ok. Can share of u are not big eater.\nService - very good, waiter serves ice water w/o being asked as it's so warm! Food served quickly, and he was also happily help us pack leftover fries and hash browns.\nPlace - we came bec we like cafes with natural lighting which u have lots here, and green scenery. Decor is also v Balinese style.\nPlace is v big, lots of empty tables even on a Sunday lunch hour bec of the weak aircon. It was quite warm inside, waiter said aircon is at max. There are blower fans outdoor but they were blowing warm air. What a pity, they could have bot some standing fans to improve the indoor ventilation. Cooler fans for outdoors. We were sweating eating indoors.\nIf we were to come back, it would be on a rainy day or maybe evening when it's cooler and more comfortable. Otherwise, it's hard to stay long bec it's too stuffy. We drove off to Vivocity for our coffee instead.",
      "time": 1745735186,
      "translated": false
    },
    {
      "author_name": "Gerald S",
      "author_url": "https://www.google.com/maps/contrib/109755735098658641853/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKb7ChNp5p_GcFG_KSb26hA5YFll6lK57r4pPSPV7EJ4QHkmQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "The food is delicious and comes in generous portions. Not to mention the fantastic ambience, being surrounded by greenery and open spaces while you tuck into the food. Have I forgotten to mention the excellent service by the staff. I would strongly recommend this place if you want to enjoy brunch with an alternative setting...",
      "time": 1744514038,
      "translated": false
    },
    {
      "author_name": "seph0210 jo",
      "author_url": "https://www.google.com/maps/contrib/103663466941418195661/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX7repUHpmuDJvtlw_aOHRJiHLWj7HIyY46eaULyt4dR_OoeI2YdA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "a week ago",
      "text": "We were seated at our table promptly, as the restaurant wasn't busy at the time. As the evening progressed, it slowly filled up to about 30-40% capacity.\n\nThe pasta dish was slightly bland and overcooked to our taste, although the presentation was visually appealing. On the other hand, the ribeye steak was cooked to our requested medium doneness and tasted good. However, we had specifically indicated \"sauce aside\" during online ordering, but the sauce was served on the steak nonetheless. We didn't press for it to be remade to avoid wasting the dish.\n\nWe also reordered additional truffle fries, but despite repeated reminders to the waitstaff, it took 30-40 minutes and still didn't arrive. Frustrated with the delay, we ended up canceling the order, paid the bill, and left.\n\nPlease note the wheelchair accessible toilet, there is a step! Hence it is inaccessible. Given the issues we experienced, this will be our first and last visit to this restaurant.",
      "time": 1746882405,
      "translated": false
    },
    {
      "author_name": "Abraham Lee",
      "author_url": "https://www.google.com/maps/contrib/115808583411002036520/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX64ZcDlmc5rWpvX4jSWLaw-vE6cikYGXs-CmHdorYWxVNRRMQF=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "Overall nice and pleasant garden theme and vibes set within a nice environment. Vast amount of greenery and space - kids could run all around and loved it. The food was alright, prices a little on the steep side. Nice alfresco area and plenty of seating indoors as well. It was surprisingly expert for a weekend night. Food ordering was done via the QR code on the table. Staff were prompt and generally attentive.",
      "time": 1734939805,
      "translated": false
    },
    {
      "author_name": "Liting Tan",
      "author_url": "https://www.google.com/maps/contrib/102651901505464176496/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIo081whh5GHRxlVTFdfBHL7eIkkHgp2eMDBTwhQpeoOe3IbQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "2nd visit after a long long time. The service is very good, the staff very patience and will answer your enquiry. The food are great, order fish & chip, carbonara, Sakura pasta and Hawaiian pizza, all food taste delicious! Photo will explain it. Atmosphere very comfortable and spacious, and i know it is pet friendly! Will come back again! Thank you!",
      "time": 1744520113,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=823358250313834679",
  "user_ratings_total": 1706,
  "vicinity": "#01-01, 33 Hyderabad Road, HortPark"
}