{
  "formatted_address": "1 Fusionopolis Wy, #03-05 Connexis, Singapore 138632",
  "geometry": {
    "location": {
      "lat": 1.298866,
      "lng": 103.7873964
    },
    "viewport": {
      "northeast": {
        "lat": 1.300507830291502,
        "lng": 103.7884385802915
      },
      "southwest": {
        "lat": 1.297809869708498,
        "lng": 103.7857406197085
      }
    }
  },
  "name": "CARELITE MEDICAL CLINIC (DOVER MEDICAL CENTRE)",
  "place_id": "ChIJx3Huzt8b2jER8QJFG56HU7k",
  "rating": 3,
  "reviews": [
    {
      "author_name": "Marta",
      "author_url": "https://www.google.com/maps/contrib/103462897826215173703/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX5-jawKylrT98GJ6fWzZUPOQT_5lD1_GAg02SN8SkHO8wcVSZLJw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Had a very pleasant impression of whole process.\nCommunication via WhatsApp is prompt, polite. I sent all details, so by arriving to clinic I didn't need to wait or fill any forms.\nAt 9am there was no queue and it took less than 5 minutes to see the doctor. As I had simple fever and sore throat, diagnosis didn't took long time, and after 10 mins I already had all my medicine packed, and happily going home. Consultation fee was around 25$. Payment by cash is possible.",
      "time": 1687420675,
      "translated": false
    },
    {
      "author_name": "Vianna Lin",
      "author_url": "https://www.google.com/maps/contrib/116642578519773511654/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJsgu7zNNJgYCrCyhvCYejQDlz0BwliAfWgKrZPhGGzFsfuzg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "The receptionist named Daniel (as he claimed) is so arrogant, impolite, and unprofessional, which is defintely not acceptable. Use this facility at your own risk.\n\nWe arrived at 17:07, there were only two people waiting to see the doctor. My partner was firstly talking to a female receptionist who was about to register FIN number (she was helpful), all of a sudden this male receptionist came out of nowhere started to tell my partner that they do not accept any more registration due to the capacity is already met.\n\nMy partner has used the service here many times so she has a good sense of the estimated time needed for 1 person to be consulted; and she observed the situation at that point around 17:15 (still 30min until closing time): there was only 1 person waiting outside to see the doctor and 2 waiting numbers were called but with no show. So my partner tried to communicate that if it is ok for her to wait for a bit while and see if she can make it before the closure.\n\nThen the male receptionist started: NO, I TOLD YOU TO LEAVE. LEAVE NOW. My partner got furious finding out that this person is not here to be helpful and not able to reason. His attitude is filled with arrogance and impatience, and I quote \"I said I am not gonna register you, so what? what can you do about it?\" \"I asked you to leave\" \"Go ahead and make a compaint!\".\n\nWhat's more: he seems to have a pattern dealing with customers already - there was a lady before us who wanted to collect some subscriptions was treated similarly. He just repetitively telling the lady that \"there are five ppl before you, no more patients for today\", which is again, not a fact. The lady mentioned that it was like this yesterday too. How about training the staff to observe the actual happenings and to be helpful at least???\n\nWe understand that doctors have their capacity to consult each day, but it is NEVER acceptable for anyone to treat their customers like this. This person should not be allowed to communicate with customer in such a way that will damage your brand image - we had good experience with Carelite, but unfortunately not any more.\n\nFor anyone who does not want to go through the arrogant and unprofessional experience, I would suggest that there are many decent clinics for your choice. I feel sorry for the colleagues who have to work with this Daniel.",
      "time": 1693390221,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13354166433215742705",
  "user_ratings_total": 2,
  "vicinity": "1 Fusionopolis Way, #03-05 Connexis"
}