{
  "formatted_address": "WEST PLAZA, Pasir Ris Street 72, #02-328 BLK 735, Singapore 510735",
  "geometry": {
    "location": {
      "lat": 1.3797473,
      "lng": 103.9363331
    },
    "viewport": {
      "northeast": {
        "lat": 1.381193580291502,
        "lng": 103.9375902802915
      },
      "southwest": {
        "lat": 1.378495619708498,
        "lng": 103.9348923197085
      }
    }
  },
  "name": "Caring Medical Clinic (Pasir Ris West Plaza)",
  "place_id": "ChIJhd3taww92jERmsM8EFuUS0A",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Su",
      "author_url": "https://www.google.com/maps/contrib/104104302462879641340/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXuTF5qJHaWpY9jkYADMHGrxk3e3XuLIo74E9k76ZAcDm1eTSOH=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I started seeing Dr Lee Jing Kun at Woodleigh Family Clinic in February 2024 for my younger son who was frequently falling sick with sore throat and fever. Despite past treatments, his condition persisted affecting his studies during PSLE year. Dr Lee’s keen diagnostic skills led to an influenza test as my son got H1N1 in December 2024 and the test revealing a faint positive. He assured me antibiotics weren’t needed and true enough, my son recovered with just fever medication.\n\nWhat truly sets Dr Lee apart is his thoroughness. He identified my son’s inflamed tonsils as the root cause, advised dietary changes and after two follow ups, my son stopped experiencing monthly fevers and sore throats!\n\nI too became Dr Lee’s patient due to chronic sinusitis and frequent inflammation. His diagnosis explained my persistent voice blockage something even an ENT specialist overlooked. With his treatment, I’m now much better.\n\nRecently in Jan 25 when my elder son had an ear infection, I discovered Dr Lee had moved. After just one visit to another clinic, I knew I had to find him. I google his name and realised he is at Caring Medical Clinic in Pasir Ris and didn’t hesitate to bring my son there. I stay in Woodleigh and the distance is quite far for me, I really don't trust any doctor except Dr Lee 😅\n\nDr Lee’s dedication, compassion and expertise will give me peace of mind and I trust the way he prescribe the medication.Even though my mother-in-law has a regular doctor near Serangoon Gardens, my husband chose to bring her to Dr Lee despite the distance. He insisted on it because her previous doctor wasn’t thorough enough which led to her being hospitalized.  Doctors like Dr Lee are rare. I’m truly grateful and trust him wholeheartedly with my family’s health.\n\nP.s I will be visiting Dr Lee to do power of attorney for my family. Thank you, Dr Lee, you are a genuine doctor that will go beyond!",
      "time": 1740554494,
      "translated": false
    },
    {
      "author_name": "ryu lew",
      "author_url": "https://www.google.com/maps/contrib/117631884207741083029/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIrJgb2vTK-8jGTF6s4wz4U-3Ung3zJ6tSXaKsGeqxRxvQ4LA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Great experience at this new neighbourhood clinic in the Pasir Ris West Plaza! It’s cosy, clean, and well-maintained. The doctor and receptionist were both very friendly and professional. Queue management was efficient, and the online booking system was super convenient. Highly recommend! 👍",
      "time": 1734095100,
      "translated": false
    },
    {
      "author_name": "Lily Ooi",
      "author_url": "https://www.google.com/maps/contrib/115350057624546767844/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLD2G1aR1dYqIvUqXcp-NDe6QEBHamdYmEHmRlk4UrIKg6Nsw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Thank you Dr Lee for the good advice when I went to visit his clinic. I was having regular pain. Dr. Lee recommended me to do blood test. As a result of this , I realised that there were presence of gallstones in my gallbladder. Dr. Lee advised me to have my gallbladder removed by specialists that he recommended. Dr. Lee took the time to explain to me the whole process. I had my gallbladder removed this week. Thank you Dr. Lee.",
      "time": 1742475755,
      "translated": false
    },
    {
      "author_name": "Lian Chengyuan",
      "author_url": "https://www.google.com/maps/contrib/103538417017734658863/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLZK0Cc-dtMkOapc7elOoU6__sQfshaziPjkdkWZJyg5Ds9lA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "It's a newly opened clinic. My mother's arm was burnt bad, and we came over. Dr Gan was truly ... Caring. Dr Lee later was good too. The few nurses were just chill folks, which isn't a bad thing. 😅🙏\n\nAfter a while, guess I should not be selfish and should bump this clinic with a 5*. Here's hoping that it can truly live up to the words on the Chinese drawing hanging on its wall. 😌🙏㊗️🪷",
      "time": 1742994579,
      "translated": false
    },
    {
      "author_name": "Syakirah Samsul",
      "author_url": "https://www.google.com/maps/contrib/117976827590475940578/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ3sETKc7RwGcBAtqAybzC4N6K708lgGDO6XZaIzmt2gMkYc8j0=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I'm thoroughly impressed with the new clinic in my neighbourhood! They went above and beyond to accommodate my walk-in request, and I was extremely pleased with Dr Lee's gentle, detailed, and caring approach. He quickly established a great rapport with me, and I truly appreciate the exceptional care I received. Thank you once again!",
      "time": 1739241247,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4632959760516039578",
  "user_ratings_total": 25,
  "vicinity": "WEST PLAZA, Pasir Ris Street 72, #02-328 BLK 735"
}