{
  "formatted_address": "59 Sungei Tengah Rd, The Animal Lodge, Singapore",
  "geometry": {
    "location": {
      "lat": 1.3812996,
      "lng": 103.7255819
    },
    "viewport": {
      "northeast": {
        "lat": 1.382602830291502,
        "lng": 103.7269868302915
      },
      "southwest": {
        "lat": 1.379904869708498,
        "lng": 103.7242888697085
      }
    }
  },
  "name": "Causes For Animals",
  "place_id": "ChIJ0f9MTQ4a2jER9THHKwaKSAg",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Lin Bolt",
      "author_url": "https://www.google.com/maps/contrib/100925385882893214090/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXhc85sXpQNcrUHRY8AzyfvSrVqkAYZPPz--awquW-lLZ8fANc=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Causes for Animals is a wonderful  organisation run by kind and compassionate people who love animals. We adopted our fur baby Polly from them and the whole process was professional, efficient and thorough. CAS goes through a rigorous screening process - as they should! - with every potential adopter. Too many stories of people not fully understanding the commitment, time, money, training and emotional dedication that is needed when you bring in a new family member - and then either not taking care of the animal properly or giving up on them.\n\nCAS regularly followed up with us on how Polly was doing and helped us with training when she was going though her puppy/crocodile phase, also to ensure that she is properly socialised. We are eternally grateful for our bundle of joy - she is a daily source of laughter, cuddles, play and exercise and has made our life infinitely better. We hope that she feels how much she is loved.\n\nTo anyone looking to support an animal rights group, shelter and stray management program, please consider supporting CAS. The are a small team but do their very best to make life better for animals in Singapore.",
      "time": 1730872362,
      "translated": false
    },
    {
      "author_name": "YUVA RAAJ",
      "author_url": "https://www.google.com/maps/contrib/117268848014457328671/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUXa_lNh_b3Rpa5d_X5bLRfyNJU5-c0PCM7BW5ZxKNkQvEvnqkE=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "This is more than just a 'dog shelter' to me. I see this as a spiritual refuge and a place of redemption from my own demons that have haunted me from my past and by being service for the dogs there - I connect with them on a deep level and have built some really beautiful and magical relationships with some of the little (not VERy little :P) buggers there.\n\nFavourite dogs would be Fokker, Sammy, Harry & Arthos!\n\nWhen I initially volunteered at CAS I was undergoing severe depression and by showing up and doing the work, it really helped to alleviate my depression and I see a part of myself in the dogs there - it is something that can't be explained by words.\n\nPlease go there and give these souls love. Be of service for them and expect nothing in return - but trust me, the love they'll return is extremely heart touching.",
      "time": 1568006697,
      "translated": false
    },
    {
      "author_name": "Nur Azeanti Suparman",
      "author_url": "https://www.google.com/maps/contrib/110288396721611209455/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJEQyQPKwoc-lFMzdZTLv8HK_HiKihWVVVwjj7L1lvX-Og1SQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "A very, very helpful and passionate organisation with helping stray animals. Communication with Christine has always been very efficient and easy. They had never say no to any request for help for the strays. 3 of the stray cats from my workplace that I have trapped on my own had been TNR through CAS. Another community cat who is suspected to be unwell has also gone through a medical assessment by their vet. They will really go the extra mile for the strays. Thank you very much CAS!",
      "time": 1683805259,
      "translated": false
    },
    {
      "author_name": "WoW Legion Captblood Capt",
      "author_url": "https://www.google.com/maps/contrib/109040641345123644318/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVJo6gvCTgLK0eS4B_5CpzwfUFizR5mPySS1sir3IixToH8O-Q=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 years ago",
      "text": "Sent them a few messages in the first instance regarding volunteering to help .\nNever got a reply\nThen sent a few regarding information on adopting a dog that they posted a picture of on their Facebook page.\nReply was pretty blunt and Uninformative\nRequested where I could see or view the dog to learn more...\nNever heard back..\nWondering what kind of dog loving charity they are or if this just another small local group of friends that do their own thing and are uninterested in outside help..?\nFrom the other comments it seems that they are in general\nUnhelpful\nUnresponsive\nSeem to be turning helpful animal lovers away...\nPerhaps look elsewhere if you like dogs\nI also don’t see much attempt from them to reply to these posted comments and feedback.",
      "time": 1619494000,
      "translated": false
    },
    {
      "author_name": "Celeste",
      "author_url": "https://www.google.com/maps/contrib/112368847229913128541/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJvlzHH9cOAhOzVy-Rp3EwWcNhBPQ8j_H3SIedrK7zGiePOnzw=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "4 years ago",
      "text": "Horrible customer service. I came all the way from the east just to volunteer but I couldn't find the place even after walking for about 30+ mins (after alighting at a bus stop at Yio Chu Kang Road) as I followed instructions given in google maps. I then messaged the number stated in CAS website to ask for help to get to the location. The lady was nice enough to send me pictures to guide me and I really appreciated her help. However, the instructions and pictures she sent were not clear at all and extremely confusing. I still ended up getting lost again. When I asked the lady for help to get there again, she was rather rude and told me to book another session as I was already late. She also said that I would not be able to do anything if I were to get there. I could've been on time if the lady gave more specific instructions and responded quickly. In the end, I did not volunteer at all. I understand that I may not be able to do much volunteer work even if I reach the place as I was already late (due to time wasted on finding the place). But, the lady could've told me in a nicer tone or nicer way instead of simply dismissing me and saying that there was 'no point walking in'! Extremely horrible experience!",
      "time": 1615434450,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=596878709735502325",
  "user_ratings_total": 44,
  "vicinity": "59 Sungei Tengah Road, The Animal Lodge"
}