{
  "formatted_address": "20 Mandai Lake Rd, #02-32 Rainforest Wild ASIA, Singapore 729825",
  "geometry": {
    "location": {
      "lat": 1.4088282,
      "lng": 103.7810406
    },
    "viewport": {
      "northeast": {
        "lat": 1.410117680291502,
        "lng": 103.7823459802915
      },
      "southwest": {
        "lat": 1.407419719708498,
        "lng": 103.7796480197085
      }
    }
  },
  "name": "Cavern Restaurant",
  "place_id": "ChIJWX6hZwAT2jERCJjVk3CHRmU",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "CHOLE Tang",
      "author_url": "https://www.google.com/maps/contrib/114642132578006423922/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKGV83Kyo-eUd0oontdupCC3vwMT1NOwyeIHaen4sqjWyJLnA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "Went here for a family dinner and was stunned by the amazing view of the restaurant! It was so well themed and beautiful, and the atmosphere was calm and quiet. The food was a bit on the pricier side, but considering it is a tourist spot, it isn't surprising.\n\nThe mushroom soup was one of the most popular dishes there, but for the quality. I wouldn't say it was worth the price. Had it been cheaper then the soup is feifinrtly worth a try, but this is not a must try meal.\n\nThe tacos were however, amazing. They were juicy, soft and succulent, but the downside is that for three tacos, the portion was quite small for the price.\n\nThe tooth fish tasted a bit like cod, but was fresh and juicy, which made it melt in your mouth, and both the pasta were on the cheesier end, especially the tomato one. So if you're not a fan of cheese I recommend giving them a pass.\n\nThe grill however, was really well balanced. The prawns were fat and juicy, and peeling their shells were really easy, the ribs had more bone than meat, but was juicy and tender all the same, and the chicken was surprisingly not tough or dry, but spicy, there was also beef but I gave it a miss.\n\nOverall, it's a great place to try out if you're a tourist visiting, but it isn't all that good if you're there for the food.",
      "time": 1746794671,
      "translated": false
    },
    {
      "author_name": "J S",
      "author_url": "https://www.google.com/maps/contrib/107678637392727440177/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVrzn9Xf8MRwnDECrMPcx7D26W3hxom_RJQBN3dzEZZ6OMuP7rE=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Cavern Restaurant offers a unique dining experience with its impressive cave-inspired setting, the first and only one of its kind in Singapore. The ambience is lovely, and the service is great. The staff were friendly, efficient, and even helped take great photos for us, which was a nice touch. However, the experience was slightly marred by the fact that we were served the wrong food twice.\n\nAs for the food:\n•\tMushroom soup: Tasty and enjoyable.\n\n•\tMushroom ragout fettuccine: Supposedly their signature dish, but it didn’t live up to expectations. The sauce lacked depth, and I struggled to finish it. I also noticed another diner leaving behind a sizable portion.\n\n• Little Miner’s Spaghetti: A complete letdown for the little one. It barely had any sauce, and despite the menu stating spaghetti, it was served with rigatoni instead. The pasta could have been cooked a little longer, and ironically, the grapes on the plate were the best part of the dish. It felt like very little thought was put into this dish.\n\n•\tBalinese dark chocolate tart: Good flavor, but not sure why the toffee layer was so hard.\n\nOverall, a great place for the ambience, but the food quality needs tremendous improvement. I’d return for the unique setting, but with different menu choices.",
      "time": 1742399913,
      "translated": false
    },
    {
      "author_name": "Faith Chng",
      "author_url": "https://www.google.com/maps/contrib/116642979148606296181/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWZWd6Y0zey5PqiqkkYpixKg3ZvwP47BRyVFaHd7u8bv13sNyEv=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "Family dinner celebration on a weekday evening. Unique atmosphere, in a cave setting. Servers were friendly and efficient in clearing plates. The food was serve hot & nice, we enjoyed the dinner. Last order at 8.30pm. Close at 9pm. Ample of parking lots & it’s free parking after 6pm. Don’t expect price to be cheap in a tourist spot but overall, a good experience.",
      "time": 1747315977,
      "translated": false
    },
    {
      "author_name": "Raymond Beh",
      "author_url": "https://www.google.com/maps/contrib/116800841162966503379/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXypDdiv19BlyAAA0iqmsOPYCbplnuZH_6BJVt5UKmSryb9ZLWpyg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "You know the saying — if a restaurant looks nice, the food might not be good? Well, Cavern Restaurant completely breaks that myth. The place has a fantastic ambience, really unique and cozy, making the whole dining experience special.\n\nBut more importantly, the food is excellent! We tried 4 out of their top 5 bestsellers (skipped the burger) and honestly, every dish impressed us. The Cave Smoked Ribs, Mushroom Soup, and Mushroom Ragout Fettuccine were outstanding. I don't know why the Smoked Ribs are only ranked #5 — they deserve to be Top 1 or at least Top 2 in my opinion! The ribs were so tender and flavorful, easily one of the best I've had.\n\nOverall, Cavern is a hidden gem that truly delivers on both atmosphere and food quality. Highly recommended if you're looking for a great meal with a great vibe!",
      "time": 1745738490,
      "translated": false
    },
    {
      "author_name": "Audrey Koh",
      "author_url": "https://www.google.com/maps/contrib/105824571128400237249/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLpV0Gf2Bvh1TH6UUClbs1GAjrrcBXgFRqt-Psmy0A7ooP2Ig=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Food was delicious. Me and my friends enjoyed all dishes. Price is slightly on the high side but its expected since its at a tourist attraction. Special mention to David Tan. His service was impeccable and he also gave us a small piece of cake with candle when he knew we were celebrating birthday. I would visit again and its a great place to go if you want to impress your date :)",
      "time": 1744902269,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7297669163786803208",
  "user_ratings_total": 268,
  "vicinity": "20 Mandai Lake Road, #02-32 Rainforest Wild ASIA"
}