{
  "formatted_address": "304 Choa Chu Kang Ave 4, #01-653, Singapore 680304",
  "geometry": {
    "location": {
      "lat": 1.3846727,
      "lng": 103.7431632
    },
    "viewport": {
      "northeast": {
        "lat": 1.386017080291502,
        "lng": 103.7445516802915
      },
      "southwest": {
        "lat": 1.383319119708498,
        "lng": 103.7418537197085
      }
    }
  },
  "name": "CCK Family Clinic",
  "place_id": "ChIJn0X2M-gR2jERiNAg08R15TM",
  "rating": 2.2,
  "reviews": [
    {
      "author_name": "toh xinying",
      "author_url": "https://www.google.com/maps/contrib/107258758911083162627/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLs7p8eA4vMFaP32efOktF7XCUSbXdpo1e4SVisoaAeg5jAsg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "forgot to share this. but this happened when i was there before chinese new year. i got sick with just phlegm for just like 1-2days and went to see the doctor but was surprised the doctor gave me antibiotics instead of just normal pills treatment for phlegm and when i look shocked cos i heard antibotic only given when its over a week or very serious situations. the doctor look at me and said, “i dont know its up to you, if u dont want i can give u normal pill but later if it get worse than i dont know le, somemore cny upcoming is very busy everywhere is closed” like i felt this doctor wasnt very professional. he kinda used this gaslighting way to make me purchase more expensively instead of telling me that my conditions and so what needs this antibiotic. Made me felt like scam bruh they all just want earn more money",
      "time": 1745483922,
      "translated": false
    },
    {
      "author_name": "Karen Hou",
      "author_url": "https://www.google.com/maps/contrib/106389445143530196139/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXr3CkfVp5FwbmdL7bKtG4Txyta8yOvk1pso-MTfY8mDugJyAh5=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "My dad accompanied my mum to this clinic (just because their usual family clinic is closed already) and got attended by a doctor, most likely locum and burmese. My dad told him he can’t speak english and the doctor asked him why come (to the clinic) if he cannot speak english, better dont come! Terrible attitude. Do you mean old folks cannot seek medical treatment if they cant speak english?! The clinic is opened in heartland (not Orchard ok!) and you expect everyone to be able to speak fluent english? Singapore is multiracial and multilingual, if you cannot handle then why you come to work in Singapore? Anyway this fellow could not make a diagnosis after checking and suggested to call an ambulance to send my mum to the hospital. He also gave my mum a jab but my parents were not told what ist for as they cant communicate. According to this fellow, ECG reading is abnormal. My mum got checked in the hospital and found nothing serious and was sent home. Think twice if you want to visit this clinic. I saw many negatives google reviews, i really hope medical association can really take action to review this clinic. Some of these doctors clearly lack professional ethics.",
      "time": 1740619789,
      "translated": false
    },
    {
      "author_name": "Angel Tan",
      "author_url": "https://www.google.com/maps/contrib/104467984479543522261/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWw0-MtNK0-AEc_JBokOFLMK9gtwoIiWZs_Ov1pHJUKwD7rQAU=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "2 chinese young ladies at receptionist have poor attitude. Clinic last minute changes closing timing at 8pm, without any inform, website still showing 10pm. Doctor Eng is not good, and not compassionate, wants patient to do more tests etc. Do not recommend",
      "time": 1741697128,
      "translated": false
    },
    {
      "author_name": "Sunitha Patchu",
      "author_url": "https://www.google.com/maps/contrib/103061800784962418901/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXOdRAunXm4XUgVwwesdof7bcKNOu8yxYH4r7hHm4LyDu5FNB3ewg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Very very bad experience at this clinic. Not once, not twice but thrice wrong medication was prescribed. When confronted the doctor waived off his consultation fee. I see many young kids brought there for flu and cold.. please beware...",
      "time": 1743304514,
      "translated": false
    },
    {
      "author_name": "Kunta Kinte",
      "author_url": "https://www.google.com/maps/contrib/113435258480330706778/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKMczn7nJVfd7Tc8vv0bYTXqPpvf1D6uI2Ym9Hn4rXqdVme=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "Went to this clinic for some minor traffic car collision matters. Doctor insists go for xray and reluctant to give me 3days mc. Very funny clinc. If I need pxray I would have gone to the hospital. I walked out of the clinic wasting my time at this stupid clinic.\nDid not pay anything. Doctor was too nasty to say I should visit next door clinic.\n\nI indeed went to another clinic and settled all.",
      "time": 1735121117,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3739524553817247880",
  "user_ratings_total": 160,
  "vicinity": "304 Choa Chu Kang Avenue 4, #01-653"
}