{
  "formatted_address": "39-01 & 40-01，40-02, Laman Niaga Sunway, Persiaran Medini 3, Bandar Medini Iskandar, 79250 Iskandar Puteri, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.3943157,
      "lng": 103.6346494
    },
    "viewport": {
      "northeast": {
        "lat": 1.395623930291502,
        "lng": 103.6359694302915
      },
      "southwest": {
        "lat": 1.392925969708498,
        "lng": 103.6332714697085
      }
    }
  },
  "name": "Chada Thai Kitchen & Bar",
  "place_id": "ChIJc6NGQAAJ2jEROoE6i8E1Efc",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "SY",
      "author_url": "https://www.google.com/maps/contrib/105747780294286305616/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJnTdIckGy2vzIRzbg7j2leY0IuUte63NKSwbQ9RO96D5Cm=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Nice ambience, good and yummy authentic Thai food with superb service, can’t ask for more. Fish was fried to a good crispiness with meat soft and juicy. Paired with the mixed herb sauce with mango, so delicious and refreshing. Clear tom yum soup has the right balance of sourness and flavour, opened up our appetite, the green curry chicken was very good, fragrant from the spices tickled my taste buds, the thick and creamy gravy went very well with white rice, so good that I drank it like soup. The only disappointment was the red ruby, the starch wrapping the chestnut was too soft and mushy, broke down into pieces and there was not enough ice to make it a really cold dessert. Love the square dessert in pandan leave though. Enjoyed a good dinner with hubby, will sure recommend this beautiful place to friends and family. Kids friendly too.",
      "time": 1735744340,
      "translated": false
    },
    {
      "author_name": "Kimberley Howarth",
      "author_url": "https://www.google.com/maps/contrib/114957590885643931784/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKqIRXau89p_qX4D_iPhWPke2K9bpcZNopPSg5xJgvjCHJQZg=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Came here for dinner on a weeknight. The staff here are all amazingly charming and friendly. Most of them are Thai, but speak very excellent English and Malay. Their menu is authentic, and they had so many delicious things on offer. We ordered som tam with fermented crab, raw prawns with spicy fish sauce, sundried pork skewers, and a duck breast salad. Everything came out in a timely fashion. The atmosphere is pleasant and cooling in the evening, was actually nice to sit outside. The staff all looked after us very well, and made sure we had everything we needed. There were an array of desserts too, but we were too full to try any. That's the other thing, portion sizes were generous and large. Warrants another trip here!",
      "time": 1745587992,
      "translated": false
    },
    {
      "author_name": "Dion L",
      "author_url": "https://www.google.com/maps/contrib/101836653562900623873/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIoxqJapfUPU-JKHo-ZsMu-xWLCOQ0b-M8VR4LC4bqAbwR-oqg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "2 months ago",
      "text": "Been here the third time, and their rice still slightly undercooked…🫠\nThis time is after the reopening, so I was actually hoping for some significant improvement. Apart from the slightly uncooked rice, pork satay tasted quite good, the red curry sauce from the duck also very creamy and flavourful.\nHowever the service didn’t really improve compared to before the reopening. Waitress had good smile but that’s all. Waited for a long time to receive the dishes. After that I specifically ordered a drink during our meal with her and even mentioned less ice with her nodding her head but until the end when I was paying the bill they still didn’t serve the drink and turned out it wasn’t even in the bill.\nHuge space for improvement.",
      "time": 1742301931,
      "translated": false
    },
    {
      "author_name": "E L",
      "author_url": "https://www.google.com/maps/contrib/107132914053525697562/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXd9agNO8hJRQtnUjjesMcOXkaSNEfYnXNrINwzBEt1ub-W2T1f=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "Their range of desserts, especially the pumpkin custard, is unique. I also really enjoy the mango sticky rice ! Lovely atmosphere with creative decorations. We enjoyed ourselves very much.",
      "time": 1746940734,
      "translated": false
    },
    {
      "author_name": "Peggy Ng",
      "author_url": "https://www.google.com/maps/contrib/107950033128037427920/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVanIRfCuWMKjYzNS-TxdvgpgpO8lJSA3aLW___C_br8TgAevWefg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Amazing service by the staff. Food is served very quickly and piping hot which is amazing! The food tastes fantastic especially the chilli lime steam fish highly recommend! Reasonably priced as well. Didnt have enough room to try the desserts which looked amazing too! Will be back again!",
      "time": 1735986670,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17803069907353108794",
  "user_ratings_total": 86,
  "vicinity": "39-01 & 40-01，40-02, Laman Niaga Sunway, Persiaran Medini 3, Bandar Medini Iskandar, Iskandar Puteri"
}