{
  "formatted_address": "54 Tanjong Penjuru, Singapore 609035",
  "geometry": {
    "location": {
      "lat": 1.3046746,
      "lng": 103.737696
    },
    "viewport": {
      "northeast": {
        "lat": 1.305970680291502,
        "lng": 103.7392880302915
      },
      "southwest": {
        "lat": 1.303272719708498,
        "lng": 103.7365900697085
      }
    }
  },
  "name": "Chee Fatt Co. Pte Ltd",
  "place_id": "ChIJRVS-28ga2jERxoljhZjb7jA",
  "rating": 3.9,
  "reviews": [
    {
      "author_name": "Jax Teller",
      "author_url": "https://www.google.com/maps/contrib/112001506697996078142/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV0zpBlIl8NV5cSWePCxAjToS7c3cvRAo79WhOgA6VTC9Ywsx4=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "3 years ago",
      "text": "MILWAUKEE TOOLS BRAND:  UNTRUSTWORTHY AND POOR SERVICE,  SAFETY CONCERNS\n\nThis experience relates to a Milwaukee Tool product for which Chee Fatt is still the distributor and service ctr.  While I have received good technical service from Chee Fatt per se and the person i dealt with was also responsive & helpful, their association with Milwaukee Tools and the outcome results in this poor review.\n\nMilwaukee Tools - very untrustworthy because i experienced nothing less than a big corporation bullying a powerless customer with valid concerns. Please read on for your protection.\n\nBought an orbital polisher in August 2021 in Singapore from a dealer, President Trading. A screw fell out of tool while using it for the first time. On checking, found another loose screw. Brought it to the distributor and service center (Chee Fatt Company Pte Ltd) who then found a 3rd screw loose. The dealer and distributor quickly claimed they could not assist further when I expressed safety concerns that something else might have been missed by Milwaukee Tools quality control.  Chee Fatt asked me to deal directly with Milwaukee Tools.\n\nWrote to the Milwaukee rep based in Singapore (Mr Keith Lai, Commercial Manager) who flatly denied the possibility of loose screws. At same time, refused to acknowledge that my item was a lemon (a logical conclusion since he claimed a case like mine happening was near to impossible). I asked for an exchange but the Milwaukee rep tried to end the email exchanges without offering any corrective actions.\n\nWhen i stated that he would be held personally legally liable for any safety issues, he quickly placed the responsibility on his distributor, Chee Fatt Company, claiming that the service center would have certified any tool that goes through it's doors. This was a mistake as the service center did not inspect the tool. When I asked for a written statement from the service center (because it was not inspected but the Milwaukee rep asserted it was done), Milwaukee rep Mr Lai then came up with options to inspect and repair my item.\n\nThe whole time the Milwaukee rep failed to perform his rightful duties of responding appropriately to valid customer issues, especially relating to safety concerns. He was negligent in assuming safety inspection was performed, and derelict in duty by trying to end the matter without offering any basic help.\n\nIf this is the kind of service to be expected from Milwaukee Tools, it is very difficult to trust this company and brand.",
      "time": 1634011420,
      "translated": false
    },
    {
      "author_name": "Kuan Loong Ngoi",
      "author_url": "https://www.google.com/maps/contrib/113393888758762864814/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKPR_hcv3b6CCf_CDfttLdkkcGvwD9TlAX1lw8D54WbxnCmVA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Excellent customer service from outdoor sales team and bosses. Special mention to William who has provided top notch customer service to our business and attend to every single enquiry since day 1. Such a responsible and hardworking staff is very difficult to come by nowadays. His right working attitude and responsibility is the reason for us to keep supporting Chee Fatt and having confidence in their products. Keep up the good work! (From Management of NS Hardware Pte Ltd)",
      "time": 1634616188,
      "translated": false
    },
    {
      "author_name": "Jasper DualcirclesBikeRental",
      "author_url": "https://www.google.com/maps/contrib/116799445855095944465/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUAK2tPsOM5GvRJ-k8SkiFa3omcuV8SB0goSUiBozzxwlaqj4dA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "Dangerous driving, filter to main road, did not stop at give way lines. Good image for the company",
      "time": 1682157450,
      "translated": false
    },
    {
      "author_name": "Zen Chen (Zen Chen)",
      "author_url": "https://www.google.com/maps/contrib/108399154054153807292/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIkJIykyGsOpjwXX-rpvch4URsjbi8xWZ_TNnchb36NtOotOQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "10 months ago",
      "text": "Old reputable company, A lot of hand tools",
      "time": 1721305851,
      "translated": false
    },
    {
      "author_name": "Ho Z",
      "author_url": "https://www.google.com/maps/contrib/107217629087872882749/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXddEmhbKpw18CfzuCuNl-ghvMcnJN4sX1yT_PnmvnxK-KX4fasQw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "Culture is great",
      "time": 1572095055,
      "translated": false
    }
  ],
  "types": [
    "hardware_store",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3525997006397082054",
  "user_ratings_total": 9,
  "vicinity": "54 Tanjong Penjuru"
}