{
  "formatted_address": "20 Craig Rd, Singapore 089692",
  "geometry": {
    "location": {
      "lat": 1.2781934,
      "lng": 103.8422926
    },
    "viewport": {
      "northeast": {
        "lat": 1.279492230291502,
        "lng": 103.8435633302915
      },
      "southwest": {
        "lat": 1.276794269708498,
        "lng": 103.8408653697085
      }
    }
  },
  "name": "Chef's Tavern",
  "place_id": "ChIJ63aALm0Z2jERphNXNlGRGRk",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Schabo",
      "author_url": "https://www.google.com/maps/contrib/114129174902845808405/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK-gF0ghQyJUcXI9r6mCkWw7uHWth6EHpzLXEeSmVPMvsyDyg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Definitely a must go! You either can eat at the table or the bar area which was our preferred choice. It’s lively and we liked the style and vibe of the bar area.\nIf you come as couple, I would recommend to order different small plates and create your own Asian Fusion Tapas Style, so you can taste the best of all.\nWe loved the food and selection of wines by the glass. Try some of the creative Cocktails as a pre dinner drink or to finish the night.\nFood, drinks, service, atmosphere .. alla good reason to come back soon.",
      "time": 1744391853,
      "translated": false
    },
    {
      "author_name": "Steve Hutch",
      "author_url": "https://www.google.com/maps/contrib/100481551532008707343/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWyXwRZoKIW7aYn--e3BvPQJ-vJLGnW4RM6bdfa0kT01_IkwwMA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "A Fantastic Lunch Experience That Delivers for Both Casual Diners and Foodies Alike\n\nHad the pleasure of enjoying a fantastic lunch today at a restaurant that truly knows how to strike the perfect balance. Whether you're a casual diner looking for a relaxed meal or a passionate foodie in search of something special, this place delivers on every level.\n\nThe menu is a joy—carefully curated with a well-thought-out selection that showcases creativity without being overwhelming. Each dish we tried was a standout in its own right, full of flavour and beautifully presented. It’s clear the kitchen puts real thought and care into every plate, elevating familiar favourites with just the right twist while offering options that would intrigue even the most seasoned food lover.\n\nThe atmosphere is warm and inviting, making it just as suitable for an easy-going lunch with friends as it is for those wanting to savour a more refined dining experience. Service was attentive without being intrusive, adding to what was already a thoroughly enjoyable afternoon.\n\nIf you're after a place that caters to every mood—whether it’s a casual bite or a culinary adventure—this restaurant is absolutely worth a visit.",
      "time": 1742541263,
      "translated": false
    },
    {
      "author_name": "Q Hvefjn",
      "author_url": "https://www.google.com/maps/contrib/107162673574556341556/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWK4fsBzoVamDcHX9V_Hsq5A0Fi2HzYIvZM2gfkJpa-Ir0KBUO3=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Excellent service and the food was incredibly delicious. It’s a must try when in Singapore. Get the angel hair pasta, hispi cabbage and the Hokkaido scallop crudo. The desserts were amazing, get the dark chocolate gateau",
      "time": 1746583548,
      "translated": false
    },
    {
      "author_name": "Shirley Lim",
      "author_url": "https://www.google.com/maps/contrib/110430313389823015589/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWpNv-yhyqbBhnvJ2ptfCv2IncXGfi_wwrWxcntcqGqYpdCE2CPTw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Went to try Chef Stephan’s new casual european-japanese restaurant and I can honestly say it was one of the best dining experiences I've had - Value for money plus delicious! The fusion of European and Japanese flavors is nothing short of genius. Every dish was beautifully presented, bursting with unique flavors, and expertly prepared.\n\nI particularly loved the Lobster bisque ramen with the massive succulent prawns, which perfectly blended the richness of European ingredients with the delicate finesse of Japanese cuisine. The attention to detail in both the presentation and taste is evident in every dish. Another favourite was the yummy prawn and lobster roll for only $10!\n\nThe deco and ambiance of the restaurant is stunning, offering a cozy yet modern atmosphere, perfect for a casual dinner, girls night out or date night. The staff was welcoming, attentive, and knowledgeable about the menu, making the entire experience even more enjoyable.\n\nIf you're looking for a restaurant that offers something truly unique, yummy and yet affordable, Chef’s Tavern is the place to go. I'll definitely be back to explore more of their amazing menu. Highly recommend!",
      "time": 1742117684,
      "translated": false
    },
    {
      "author_name": "Rob Willock",
      "author_url": "https://www.google.com/maps/contrib/102492096175691482297/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL4YOO62CNq0BEjA69UDALamXJAEQpJbO9g-foRi0EutojOjg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Excellent location and ambiance for date night. It’s great to see another excellent dining venue open up on Craig Road, and I have a feeling this will be an instant classic.\n\nThe bar was an ideal spot to spend half an hour before dinner…we loved people watching through the open windows. And the dining room is intimate but relaxed.\n\nFood was superb…it reminded me of my summer travels in Europe. I can recommend the tartare from the bar menu which balanced sweetness, subtle spice and saltiness perfectly. And the maple leaf duck from the mains…chef’s kiss.\n\nThe service was excellent. I love it when a restaurant’s team is both professional and friendly and this team nailed it. Chef Stephan, the owner, even came to our table to share about the ingredients and his passion for quality.\n\nWe didn’t try any wines but there were a few on the menu that I recognised and were actually good value for the rarity and quality.\n\nRecommended for a more relaxed date night or dinner with friends…it has that perfect balance of premium food, bespoke service and a relaxed yet refined atmosphere.",
      "time": 1742545116,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "bar",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1808636503356019622",
  "user_ratings_total": 476,
  "vicinity": "20 Craig Road"
}