{
  "formatted_address": "23, Jalan Eko Botani 3/4, Taman Eko Botanic, 79100 Iskandar Puteri, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.4383994,
      "lng": 103.6196218
    },
    "viewport": {
      "northeast": {
        "lat": 1.439801030291502,
        "lng": 103.6209059802915
      },
      "southwest": {
        "lat": 1.437103069708498,
        "lng": 103.6182080197085
      }
    }
  },
  "name": "Cherie Hearts International Preschool Eco Botanic",
  "place_id": "ChIJ4UUK4TYL2jEROBfXC6d4C74",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Brittany BOND",
      "author_url": "https://www.google.com/maps/contrib/101623266154822741253/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLqEIQ_BALdek_7dhyD57UjzTgRvImlObOdUPYSry9eU1BG_w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "My son has been attending Cherie Hearts for almost 2 years and we have had a great experience. They have all been extremely helpful and flexible with my schedule, offering early care and late care. The teachers are all very dedicated, hardworking, and kind. Overall, we have had a very positive experience.",
      "time": 1734684412,
      "translated": false
    },
    {
      "author_name": "Khong Wui Gan",
      "author_url": "https://www.google.com/maps/contrib/102527585679059275804/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKXF_W3Frq_tpnnI-UXS1U-IUWdZbllrQQHX2iaIPT8MQgfew=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "I have my 2 kids sent here and the experience has been good. The teachers are caring, attentive and patient. They organise various outdoor events and teaching activities which my kids enjoy a lot. Over the years, I can see my kids picking up new skills and good habits. Kudos to all the teachers.",
      "time": 1729350330,
      "translated": false
    },
    {
      "author_name": "Yogeeta Moothy",
      "author_url": "https://www.google.com/maps/contrib/115649657107075138282/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ_-N3uuNRLaE3A6TRadbVrbHAJpU5CUzFxVw9kNiXFjxgMYg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "My 5 years old daughter has been here since she was 3 years old.Very happy with the school systems and very cooperative attitude by the teachers for making my daughter more comfortable and self confidence.My daughter really enjoying going to school everyday.We as parents here were very satisfied with our daughter progressing well academically and co-curriculum activities.Excellent teaching method and thank you to all teacher.",
      "time": 1741601574,
      "translated": false
    },
    {
      "author_name": "Jo-Han Ng",
      "author_url": "https://www.google.com/maps/contrib/107120237754208326273/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLTqWgtQpgIldAYsKUagPhSuJDboiOAcMU8gSR0u-eTCqWcnw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Being selective parents, we physically visited many preschools in Iskandar Puteri with our kid. Cherie Hearts Eco Botanic is the only preschool that the entire family fell in love with instantly, especially for my kid with the amazing playground and the super friendly teachers.\n\nOur kid started at Playgroup 2 and is finishing his Kindergarten 2. After three plus years, our “love at first sight” has only improved. Here is my 8-point honest review (as an educator and also a parent) to help other parents decide:\n\n(1) Curriculum (linguistic/numerical):\nThe teaching and learning (T&L) method is top notch for preschool kids. My kid and his classmates have good trilingual foundations, being able to read and understand English, Malay and Chinese appropriate for their age. There is a “book club” system where kids have to bring a book back so parents could read with their kids. He can also count and do basic arithmetic which will put him in good stead for his primary school education. Cherie Hearts must have done something good because my kid loves to do his homework.\n\n(2) Socialising skills:\nHaving spent his earlier years in lockdown mode due to the pandemic, we were worried about our kid not gaining social skills. Cherie Hearts has structured most of the learning activities to be group-based, and I am amazed by how much he loves socialising with his friends and teachers.\n\n(3) Soft skills:\nCherie Hearts Eco Botanic excels on many fronts, but imbuing soft skills such as presentation skills, storytelling skills, performances, plays and emceeing are the stuff that really set them apart. Now, I have a confident young kid who is not afraid to speak in public and has no stage fright. If anything, he loves being in the spotlight due to his new found soft skills. The three years have been transformative.\n\n(4) Teachers (and feedback):\nThe teachers are extremely caring, and I know it because my kid absolutely adores his teacher. The teachers provide very good and detailed feedback, with face-to-face meetings every term and written reports every semester. Additionally, the teachers also send us photos and videos of the activities, which allows us (parents) to know what is happening in school, and use that as talking points to our kid at home.\n\n(5) Facilities:\nThe facilities at Cherie Hearts are exceptionally clean and in very good conditions. Each kid has their own storage area and every group has their own play and learning space. The ground floor has a huge playground, a sleeping bay, socialising area.\n\n(6) Food:\nThe teachers will be able to explain the healthy menu that will be adopted. Healthy food aside, I want to highlight the orderly manner in which kids are asked to approach the dining hall. Kids are trained to be independent, and will line up for food and can request for doubles all in a systematic way.\n\n(7) Events:\nMy kid look forward to all events organised by Cherie Hearts Eco Botanic, including the festivals, excursions, parties and the annual concert. Parents are frequently invited to these events and it is great to see the close relationship of the kids amongst themselves and with their teachers.\n\n(8) Fees:\nFees can be valued in terms of price or value. In my opinion, the fees are “value for money”, and I do not regret sending my kids to Cherie Hearts Eco Botanic. I recalled paying the full fee after 2 days of the trial period, after I saw the happiness in my child’s face. In fact, I have also sent my child for all school holiday enrichment programmes (except when we have family holidays) because he really learn many things and do handicraft work.\n\nOverall:\nSend your kids to Cherie Hearts Eco Botanic if you want a strong syllabus, fun activities, professional teachers (and kakak) and great facilities for your kid, because this will cultivate an independent learner who will be ready for the challenges of primary school.\n\n(To all the staff at Cherie Hearts Eco Botanic, we cannot thank you enough for the amazing growth of our child while under your care and guidance over the past 3 plus years).",
      "time": 1725519264,
      "translated": false
    },
    {
      "author_name": "Pamela Si Ying",
      "author_url": "https://www.google.com/maps/contrib/117159154581895090850/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLOskgdVIrXZz6eb-iTm_OE98X1KxWFU5q_L8gx6V1Wv5mwrw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "So far the best preschool and nursery I have seen in Johor.\n\nTeacher does weekly updates on school apps.\n\nTeachers are friendly and nice.\nGentle towards the kids, knowing how to handle the kids in every mood they are having.\nCorrecting the kids when they are doing the wrong things.\n\nTeacher Mary, Fifi, Laila, Adila, Kok, Farah, Lim. Best teachers towards my kids.\n\nWhen picking up the kids, teachers will only release the kids when their parents are outside the school. Teacher will inform you what your kids does in school and eat.\n\nPotty training by the school too.\n\nSelf feeding guided by the teachers very well.\n\nThere's an excursion every term of the year, letting them learn and have fun at the same time.\n\nPrice wise reasonable.\n\nFood are tasty 🤤 my kids loves whatever kakak cooks.\n\nHighly recommend.",
      "time": 1725527322,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13694171750803642168",
  "user_ratings_total": 23,
  "vicinity": "23, Jalan Eko Botani 3/4, Taman Eko Botanic, Iskandar Puteri"
}