{
  "formatted_address": "19F Charlton Ln, Singapore 539643",
  "geometry": {
    "location": {
      "lat": 1.3565012,
      "lng": 103.881579
    },
    "viewport": {
      "northeast": {
        "lat": 1.357756080291502,
        "lng": 103.8828877302915
      },
      "southwest": {
        "lat": 1.355058119708498,
        "lng": 103.8801897697085
      }
    }
  },
  "name": "Cherie Hearts @ Charlton",
  "place_id": "ChIJfTgGRbAX2jER1wOB8voJyBQ",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Weixian",
      "author_url": "https://www.google.com/maps/contrib/115081412464359614804/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIon3KpF9PoU5XIZaKB4nROg5NskD6tOHH1FPfv0FPlnUZHCA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I had a very pleasant practicum experience (2 weeks) at Cherie Hearts@Charlton. The teachers were professional and very understanding which eased me into my role as a teacher assistant. The staff in the centre were very kind and friendly. The setup of the centre gave a nice homely vibe. The facilities available such as the sizable playground, outdoor play and water play area etc. were very adequate and convenient as they are located within the centre. The biggest highlight were the children. They were really lovely to interact with and their joy and antics made my day each day.",
      "time": 1740135537,
      "translated": false
    },
    {
      "author_name": "Victoria",
      "author_url": "https://www.google.com/maps/contrib/108118311674946321605/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIfN89HGC3wzrECElQ2R4SElS6jNrWa8zjpsZrX8XAPzgjjXw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "We visited Cherrie Hearts with our class and school lecturers. The teachers there were really friendly and welcoming. We even got to try their homemade mantou and pea tea! Liu Lao Shi explained things clearly—she spoke with wisdom, knowledge, and heart. The principal and teachers were open to questions and answered them with experience and insight. They also gifted us lunchboxes, thank you so much! We’ll definitely put them to good use ",
      "time": 1745297650,
      "translated": false
    },
    {
      "author_name": "ruth s",
      "author_url": "https://www.google.com/maps/contrib/112645226160193533623/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIIxlGuOo_X5nUOWpbZRiNlVOpDGFIVUg0EZW0tBrdyUSdF3g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "As first-time parents, choosing a pre-school was an important decision for us. The teachers at Cherie Hearts are very caring and we appreciate that the school really tries to build a community beyond just providing childcare services. We are very satisfied with our experience and would definitely recommend this school.",
      "time": 1743817062,
      "translated": false
    },
    {
      "author_name": "Jasmine lin",
      "author_url": "https://www.google.com/maps/contrib/112584760230089701407/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI8gz6v2LuFit42AG8-nqjJb_FqoQIcNkSGQJPqUSeeKHiRCA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Our 5 year old just transferred to Cherie Hearts Charlton this year and we’ve seen her linguistic and cognitive abilities shift substantially in the short two months since she’s been here. She was pretty chatty before but since being here her fluidity of sentences and coherence have increased. Her ability to string causation and curiosity have also increased substantially. As the classes are pretty large, it pushes her to think outside the box to find creative ways around social stalemates and conflict resolution. We like that the school places emphasis on values and character, not just fully focused on academics or making parents “happy”. The teachers are also extremely energetic even at pickups and all have a good relationship with the students.\n\nWe really appreciate the management’s extremely prompt and timely communication every single day, it feels like they’re always at work behind the scenes. The variety of real world of exposures through community involvement and excursions is also impressive, and helps the children to see a world beyond themselves.\n\nThere are many options for kindergartens/childcare centres out there, but if you’re looking for one that is constantly evolving, practical and still does things with heart- this might be the right place for you.",
      "time": 1740390152,
      "translated": false
    },
    {
      "author_name": "Pamela Neo",
      "author_url": "https://www.google.com/maps/contrib/100247988851417031800/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLm5cPvPhyaMElWwnrJEcusIP5FEETx7ieC1Ady6beHmcjstA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "We have only started our boy this year at cherie hearts and so glad that he has eased and adapted beautifully.\n\nThe teachers and staff made him felt welcome and he let go off his fears and uneasiness in a short time. We appreciate the ability to view cctv on site the classrooms as it allows us parents to have a peace of mind,  especially during his first few days/weeks. It is assuring to see that he subsequently gets into the school routine like all other students. There are also constant updates and communication on our boy be it via WhatsApp group chat or verbally with the teachers, which we are also appreciative of.\n\nThe school's curriculum and activities are well thought of and planned. From the monthly messy plays to different excursions indeed allow students to learn through play. Not to mention the yummy lunches prepared by kitchen staff, being a picky eater we are glad he eats all of his food and sometimes even go for second helping.\n\nOverall we are very pleased with how much our boy has grown in these 2 months being with Cherie Hearts @ Charlton. In his words, \"I like Cherie Hearts because I learn many new things\". Looking forward to see how he bloom further!\n\nThank you to Ms Ng, all teachers and staff for your commitment and dedication to the students and their well being. Keep up the good work that you do!",
      "time": 1740883644,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1497457849515705303",
  "user_ratings_total": 168,
  "vicinity": "19F Charlton Lane"
}