{
  "formatted_address": "102 Amoy St, Singapore 069922",
  "geometry": {
    "location": {
      "lat": 1.2816502,
      "lng": 103.8473518
    },
    "viewport": {
      "northeast": {
        "lat": 1.282964280291502,
        "lng": 103.8487640302915
      },
      "southwest": {
        "lat": 1.280266319708498,
        "lng": 103.8460660697085
      }
    }
  },
  "name": "Chico Loco (Amoy Street)",
  "place_id": "ChIJRWZqWwgZ2jERb-hCGEDDHM0",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Mary M",
      "author_url": "https://www.google.com/maps/contrib/115982231899040116636/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ4IrInolGSwFOwWvi7k-N6XOsLRitDhdF_HYhW4FFCzFUm5C0=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Just had a meal at Chico Loco and I’m already planning my next visit. The chicken is packed with flavor— and very juicy too. Their guac? Creamy with just the right kick. And don’t even get me started on the margaritas—strong and tangy\n\nThe vibe was laid-back with a fun, festive energy. Prices were decent. Big thanks to Lisa and RD for their big smile and good service.",
      "time": 1744124788,
      "translated": false
    },
    {
      "author_name": "Pearl Rodil",
      "author_url": "https://www.google.com/maps/contrib/100563429824058056114/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjViGs_8MErNqWpYJziB9UMmsBh11bWUuiAhbdsEWNZmOwSF4sM=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "If you’re a fan of authentic Mexican cuisine, this place is an absolute gem! From the moment we walked in, we felt like we were transported straight to Mexico. Its lively atmosphere is perfect for casual dining. Whether you're in the mood for something spicy or mild, they have a range of options that will satisfy every palate.\n\nBut what really made the experience stand out was the service. The manager, RD, went above and beyond to make sure everything was perfect. From offering great recommendations to checking in on us throughout the meal, it was clear that he truly cares about providing a top-notch experience for every customer.\n\nIf you’re craving delicious Mexican food and a welcoming atmosphere, this is the place to be! Highly recommend! We’ll definitely be back for more!",
      "time": 1743140172,
      "translated": false
    },
    {
      "author_name": "Ian Chua",
      "author_url": "https://www.google.com/maps/contrib/110247771005926257407/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJwBzM6KGQ2dLoLPA2giqyGUg192V5sSux326xDxAuFr-dtfA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "3 weeks ago",
      "text": "The chicken was amazingly succulent, with the half chicken or chicken breasts completely moist, flavourful and tender at the same time. Tomato rice side dish is probably the best version I've had. The chicken broth was a great way to start the meal. Will definitely be back.",
      "time": 1745971559,
      "translated": false
    },
    {
      "author_name": "Hrucha Damle",
      "author_url": "https://www.google.com/maps/contrib/111705598274040127370/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWQm5Ja_E3uhz91gjOPRuwwo6ALJZ7GSJLPMvyMH6Hw4-HuzOSGUg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Dinner, tables available for walk-in at 7pm, likely to get crowded later. Alcoholic drinks have a cutoff at 730pm, cutoff time written in fine print on their promo leaflets so do watch out!\n\nTried their wagyu beef brisket (150gm) with 2 sides (can choose from many) for $22, choice of having it mild or spicy (comes with a sauce to pour over the top). Very very worth it, made my first beef brisket experience very pleasant. Crusting of the brisket was flavourful, and meat was so tender!\nGot their salad (wouldnt recommend, smaller portion than expected) and the brusssl sprouts. I would gladly order their brussel sprouts as a whole side to eat by myself - the cook on them was on point, and the sauce they were coated in was delicious. This and the beef - super enjoyable.\n\nGot their loaded nachos to share too (not pictured), decent portion, standard.\n\nFriendly staff, good atmosphere, convenient location (",
      "time": 1742428201,
      "translated": false
    },
    {
      "author_name": "Ametrine Nephrite",
      "author_url": "https://www.google.com/maps/contrib/113539123325266929297/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJSr7xcYddd4ys7eHjEgpZOiCAOLu1x_LXbwmkkXC8GHpNofLM=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Had an absolutely amazing experience on 15 April 2025, all thanks to RD and his fantastic team! I made a reservation online, commented my seating preference, and checked the birthday option—never expected the thoughtful surprises that followed!\n\nWe were treated to complimentary churros with a candle, and the staff even sang a birthday song while bringing out a Mexican hat and maracas—so fun and memorable! They also helped us take a group photo and surprised us with a printed copy along with a handwritten card. Such a thoughtful gesture that truly made our night special.\n\nThe service was exceptional—attentive, friendly, and observant throughout. Easy to get their attention. Plus, there were great vegetarian options available too. Highly recommend this place for celebrations or just a good time with great vibes and great service!",
      "time": 1744747388,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "meal_delivery",
    "meal_takeaway",
    "bar",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14779902757175486575",
  "user_ratings_total": 804,
  "vicinity": "102 Amoy Street"
}