{
  "formatted_address": "63 Hillview Ave, #01-03 Lam Soon Building, Singapore 669569",
  "geometry": {
    "location": {
      "lat": 1.3570307,
      "lng": 103.763132
    },
    "viewport": {
      "northeast": {
        "lat": 1.358502280291502,
        "lng": 103.7644145802915
      },
      "southwest": {
        "lat": 1.355804319708498,
        "lng": 103.7617166197085
      }
    }
  },
  "name": "ChildFirst @ Hillview",
  "place_id": "ChIJ_0UnrtYR2jER7Cbhxx_ifZc",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "JANE ZHENG",
      "author_url": "https://www.google.com/maps/contrib/106384625574214009872/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKjz15PN4WCceb9g80gBSWvLOlA2JD6KG1oEzbKvnXnFo11mw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We are truly happy and grateful to have chosen ChildFirst@Hillview for our son. Although he has only been attending for a month, we already feel a strong connection with the school.\n\nFrom the very first visit, we were impressed by the bright classrooms, safe and well-maintained facilities, and—most importantly—the warm smiles from every staff member. During the first week, I noticed that every teacher and staff member could call my son by name, which made us feel truly welcomed and cared for.\n\nThis is my son's first time in kindergarten. At first, he cried so much that he didn't want to go to school. But the teachers fully embraced his mood, talking gently to him, patiently comforting him, and even staying by his side throughout the nap. We really appreciate your concern, it means a lot to us. It is clear to us that the teachers here are not only professional, but really kind and compassionate.\n\nWe feel very fortunate to be part of the ChildFirst@Hillview family. Thank you for all the love and dedication you give to the children every day.",
      "time": 1744883444,
      "translated": false
    },
    {
      "author_name": "Marcus Chai",
      "author_url": "https://www.google.com/maps/contrib/109283150956135471848/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUtk4Kpao9VKr14WgT5DwXdpAl1SBsV_Stc3XkDVWPGSpDRdmlU=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "My child has enjoyed Childfirst, having transferred over from a previous school. The teachers care very much for the children, and the curriculum is rigorous. The school regularly engages us parents, and we are deeply involved in our child’s education journey. The school puts in a lot of effort to scaffold their lessons and plan varied and engaging lessons. Thank you, Childfirst!",
      "time": 1742805625,
      "translated": false
    },
    {
      "author_name": "jillyan siow",
      "author_url": "https://www.google.com/maps/contrib/103629571678313543085/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUZBQQs9-1g0LTi7GcQDefo7xyO50PUaDhfSAabt2CliUJGOJce=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Things we appreciate about the school:\n\n1. clear and timely updates about curriculum and school work- my child has blossomed since joining the school in k1. she speaks enthusiastically about the activities in school and the updates also help us engage her at home.\n\n2. holistic approach: the school prides itself in coding and my child also enjoys the AI chinese and math sessions. not only that, she also enjoys the hands on activities and learning journeys planned.\n\n3. enclosed classrooms: dedicated classrooms for each class so that learning can take place effectively.\n\n4. caring teachers and management: we sense that they care immensely about the holistic development of a child.\n\n5. events like CNY, christmas etc celebrated with the involvement of parents - meaningful activities planned for us.\n\nThank you for providing a safe and nurturing space for our child!",
      "time": 1738034384,
      "translated": false
    },
    {
      "author_name": "PriyankaAnkit Goyal",
      "author_url": "https://www.google.com/maps/contrib/117842548012070235321/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKRRnchDeHIdHXu5zYSDMLkpkgGAM-pk3Un5kY2A6dYMRX6hg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "We are so grateful for the wonderful experience our son has at ChildFirst, Hillview. The dedicated teachers genuinely care about each child’s growth, creating a nurturing and supportive environment that makes learning fun and engaging. The innovative curriculum not only builds a strong academic foundation but also fosters creativity and independence. Seeing our child thrive, grow in confidence, and develop a love for learning has been truly rewarding. Highly recommend this preschool to any parent looking for a caring and enriching early education experience!",
      "time": 1738284232,
      "translated": false
    },
    {
      "author_name": "Olivia Leu",
      "author_url": "https://www.google.com/maps/contrib/103018690713653018846/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLw7M1-6sf1BXlXFwsG6qxFXTsRukTsMPyVHGng7vktJg9EAw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "We couldn’t be happier with our experience at ChildFirst Hillview! Our journey with the school began 2.5 years ago when we attended their open house. I first came to know about ChildFirst after seeing them featured on TV, which sparked my curiosity. I explored many preschools in my neighborhood, including some of the most renowned names in town, but ChildFirst stood out in every way.\n\nFrom the open house itself, I was impressed by how organized and welcoming the school was. The admin team confirmed our visit in advance, and the form teacher personally showed me around, explaining their curriculum in detail, complete with textbooks. The teachers we met were warm, happy, and passionate. The robot interaction activity was such a fun and unique experience, and it left me confident that this was the right place for my son.\n\nFast forward to today, and I’m so glad we chose ChildFirst. The new campus at Hillview is stunning—spacious, clean, and futuristic in design. While the fees are slightly higher compared to some of the preschools, the exceptional quality of education and peace of mind they provide make it absolutely worth it. Unlike other brands that expand quickly, ChildFirst focuses on maintaining high standards, which is something we truly value.\n\nThe tri-language program is phenomenal. The AI-driven Chinese app is cutting-edge, identifying areas for improvement and reinforcing learning through repeated practice. It’s well-preparing my son for primary school. Coding was introduced in N2 (age 4), and it laid the foundation for his interest in robotics. The phonics program is also excellent—my son blends sounds fluently, and we’ve never felt the need to send him to any additional academic enrichment classes.\n\nBeyond academics, ChildFirst places great emphasis on character building. My son has grown emotionally resilient and can manage his emotions much better now. The teachers are patient, caring, and truly invested in the children’s growth.\n\nWe owe so much to the wonderful team led by Ms. Patricia. Ms. Stephanie, Zhang Laoshi, Ms. Sharon, and Ms. Shiting have been nothing short of amazing. They’re approachable, warm, and genuinely care about the children and parents alike. Their constant communication and support have made all the difference.\n\nThe graduation ceremony held yesterday was a truly emotional moment for us. It was so beautifully organized and heartfelt that I couldn’t stop tearing up, especially as the children bid farewell to their teachers. It was clear that the teachers had poured so much time and effort into making it a memorable experience for everyone.\n\nChildFirst Hillview has exceeded all our expectations. It’s a school that focuses on quality education, character development, and creating a nurturing environment for children to thrive. We’re so grateful for the difference it’s made in our son’s life, and we highly recommend it to any family looking for a preschool that truly stands out.",
      "time": 1733235639,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10916129697941235436",
  "user_ratings_total": 33,
  "vicinity": "63 Hillview Avenue, #01-03 Lam Soon Building"
}