{
  "formatted_address": "229 Mountbatten Rd, Singapore 398007",
  "geometry": {
    "location": {
      "lat": 1.3075455,
      "lng": 103.8816879
    },
    "viewport": {
      "northeast": {
        "lat": 1.308905180291502,
        "lng": 103.8831626302915
      },
      "southwest": {
        "lat": 1.306207219708498,
        "lng": 103.8804646697085
      }
    }
  },
  "name": "ChildFirst @ Mountbatten",
  "place_id": "ChIJmfyM9EcY2jERZgi-crCm4vk",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Kaye Lin",
      "author_url": "https://www.google.com/maps/contrib/108084727098607694232/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUCTiOERqNMKbjdxktiK-ugoSUUKohFQGMHbnFi7EE41UBB50Tt=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "I have had 2 children attending ChildFirst since 2020, and now that my eldest has graduated and gone on to P1 this year while my youngest is in N2, I would like to share my thoughts about this school.\n\nWe chose ChildFirst because it is very near our house, and we valued the convenience. Over time we have also learned to appreciate the school, especially its curriculum.\n\nOur eldest has benefited a lot from the school's emphasis on Chinese and coding. This picture is to show you an example of how Chinese is taught in N2, which frankly I wished I was taught Chinese this way. My kids both will sing out the songs of sentences with words from the root Mandarin character. Even my youngest who usually doesn't speak Mandarin is now conversing with us in Mandarin more. She is very fond of her Chinese teacher, Liu Laoshi.\n\nTheir coding syllabus is also impressive, the K2 children will even have the opportunity to compete in the National Robotics Competition, which my eldest did and won a medal for. I don't know much coding, so I can probably say that my 7-year-old knows more about coding that I do!\n\nThe food served in the school has also earned high praise from both my fussy eaters.\n\nThe main negative that I would like to share is the high turnover rate of teachers. Since 2020, they have had 6 different principals (technically 5 since 1 returned, but then left again). The most recent one was sprung on us just last month. For my eldest, she has had her teachers leave one after another throughout her 5 years in the school. Some stability in the staff would be great. I hope the management can be more mindful about this aspect.",
      "time": 1740982935,
      "translated": false
    },
    {
      "author_name": "HolyKnight A3",
      "author_url": "https://www.google.com/maps/contrib/100861590986420705796/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKThLFW6oSj0vKSinYBUxHS6apUxhvRYGWtzRpjO6QaK0lKCg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I cannot speak highly enough of Vice Principal Yao. Her present at ChildFirst Mountbatten has had a profoundly positive impact on my child’s education and overall school experience.\n\nVice Principal Yao is approachable, compassionate, and always willing to listen—whether addressing concerns, offering guidance, or celebrating student achievements. My child has always mentioned about her.\n\nCommunication with parents is another strength. Vice Principal Yao keeps us informed, responds promptly to queries, and actively involves with true caring attitude.\n\nIt is great to have Vice Principal Yao in ChildFirst Mountbatten. We truly appreciate her effort, full hearted delegation and commitment.",
      "time": 1743692746,
      "translated": false
    },
    {
      "author_name": "Jeremiah Yap",
      "author_url": "https://www.google.com/maps/contrib/107560951091508854750/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJgAdiWZb8grS2Zlcuvn2LclyQVAW0D98lFVnOez00AVZ-vDw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We started our child in February 2025 and have been very impressed with it.\n\nWe noticed our child looking very happy and enjoying school compared to past experiences where he did enjoy but it seems that he is a lot more looking forward to go to school.\n\nParents get updated very consistently about our child’s activities in school and the teachers, Ms Anna and Liu Laoshi are both very caring and attentive teachers. They notice even the smallest things and will update us promptly on anything regarding our child.\n\nParents are also invited to many updates and events and are also encouraged to participate with our child, and that is much appreciated.\n\nFor our child, the teachers lined up many engaging and encouraging activities daily. Children also get to experience simple coding by prompting commands and instructions to robotics provided for by the school. Part of the focus of ChildFirst is they teach in tri-lingual courses, namely English, Chinese and Coding Languages.\n\nOverall, we are very happy that we found ChildFirst for our child.",
      "time": 1742970252,
      "translated": false
    },
    {
      "author_name": "Laura Domínguez",
      "author_url": "https://www.google.com/maps/contrib/105346530882453289106/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXiXv74UDpa_vFTtw5ndh0TPOy27A3Sfk8tCbUXzzDE2Qao6iwv=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I would like to share my positive experience with childfirst@mountbatten. As a mother of four children, I have had three of them attending this preschool, and a fourth will soon join. The fact that I have entrusted my children to this preschool since 2019, when I enrolled my first child speaks volumes about my happiness with their program/curriculum, teachers, and overall approach to early childhood education.\n\nThe learning environment is exceptional, and the teachers demonstrate genuine care and attentiveness towards the children. Additionally, the weekly updates on class activities provide valuable insight into my children's development and engagement at school.\n\nOne of the aspects that particularly stood out to me was the exceptional Chinese curriculum. As a foreigner, my children do not have exposure to Chinese outside of their time at school. Now that my eldest has graduated from childfirst, I can confidently say that he is fluent in Chinese for his age. We often receive compliments from native Chinese speakers on his fluency and accent. One key aspect for me is that each class has its own dedicated space. I prefer schools that do not have open spaces with separating walls but a proper class for each level instead. Additionally, I value the clear differentiation between English and Chinese classes. Not only do the teachers change, but from N2 onwards, the children also change classroom which helps them to transition to a different environment changing their mindset knowing that they have to speak a different language in that new enviroment. I strongly believe that this approach accelerates their language learning journey.\n\nI also appreciate that, like in any organization, there are times when changes or teacher rotations may disappoint parents. However, I have found that the management is willing to listen to parents and address their concerns, which further demonstrates their commitment to providing a supportive and responsive learning environment for the children. I am truly grateful for the positive impact this preschool is having on my children's growth and development.",
      "time": 1733726338,
      "translated": false
    },
    {
      "author_name": "Rebecca Ng",
      "author_url": "https://www.google.com/maps/contrib/101234757309936062931/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIpztL54QuZSDNoYGu9ZTncK5WKRar9eMdwtZ-lAvQgF86xSg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Both my sons, Lucas and Reyes, have been enrolled at ChildFirst since they were 2 years old, and I couldn’t be happier with their growth. Not only do I see their progress, but they genuinely enjoy going to school, which is every parent’s dream.\n\nMy elder boy had a tough time at his previous school—he cried almost every day. However, when he joined ChildFirst, everything changed. He loved going to school, and not once did he dread it. Even a year after his graduation, we’re still in close contact with his preschool classmates, which speaks volumes about the community ChildFirst fosters.\n\nAs for my younger son, he had noticeable pronunciation difficulties when he was at his previous preschool. Thanks to the dedicated team at ChildFirst, he now speaks fluently.\n\nI am incredibly grateful to the ChildFirst team for their dedication and heartfelt efforts. You’ve truly made a difference in my children’s lives!",
      "time": 1732847122,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=18006137536950175846",
  "user_ratings_total": 49,
  "vicinity": "229 Mountbatten Road"
}