{
  "formatted_address": "133 New Bridge Rd, Singapore 059413",
  "geometry": {
    "location": {
      "lat": 1.2852093,
      "lng": 103.8447228
    },
    "viewport": {
      "northeast": {
        "lat": 1.286175930291502,
        "lng": 103.8458059802915
      },
      "southwest": {
        "lat": 1.283477969708498,
        "lng": 103.8431080197085
      }
    }
  },
  "name": "Chinatown Point",
  "place_id": "ChIJBXC7TAsZ2jERdpAi-2uczMQ",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Jenna Limited",
      "author_url": "https://www.google.com/maps/contrib/106112611970896909857/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU0wH6L5GcFHQEEPvfQ-TKVqwX0nUjWEftnqO4PF-h20GmGNZQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "Chinatown in Singapore feels like a miniature China, with everything you can imagine in one vibrant neighborhood. From clothing, jewelry, and decorative items to herbs and traditional Chinese food, the area is packed with Chinese culture and charm. The streets are colorful and lively, filled with both locals and tourists exploring shops and food stalls. It’s often very crowded, especially during meal times, and finding a seat to eat can be a challenge. Despite the hustle and bustle, it’s a fascinating place to experience authentic Chinese heritage right in the heart of Singapore.",
      "time": 1747013469,
      "translated": false
    },
    {
      "author_name": "Bayu Gunawan",
      "author_url": "https://www.google.com/maps/contrib/115364669384360054303/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWKj5mHPuyLylS3chcs-T0P0X2CJFOPA-yVktIbloeciX6I6jTp=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "One of Singapore thematic traditional market which we can find stalls and stores selling not only traditional cuisines but also Thai and Indian cuisine, souvenirs, fruits and many more.\nThis market near to China town MRT Station that we can get by this market easily. I did not buy any food that I can recommend Chinese cuisines to buy. We bought some souvenirs. Souvenir's price is relatively cheap.Although it is \"crowded\" this market is tidy and clean. Lets share your review guys.",
      "time": 1743663370,
      "translated": false
    },
    {
      "author_name": "Vijay devara",
      "author_url": "https://www.google.com/maps/contrib/104966255889525177171/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUpDJc7-Hm3HV6TsfwVhTH6jq5Yq6ZHA1Ejw1SuW8ig-cgwv5eDyg=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "Chinatown in Singapore is a vibrant cultural and historical gem that offers a perfect blend of heritage, food, shopping, and spiritual experiences. One of the most iconic and awe-inspiring highlights of this area is the Buddha Tooth Relic Temple and Museum.\n\nLocated in the heart of Chinatown, this majestic temple is not only a place of worship but also a showcase of Buddhist art and architecture. The moment you step into the temple, you’re greeted by intricate carvings, serene chanting, and the scent of incense. The grandeur of the four-story building, with its Tang Dynasty-inspired architecture, is simply breathtaking.\n\nThe sacred relic, believed to be the left canine tooth of Buddha, is housed in a stunning stupa made of solid gold on the fourth floor. The viewing experience is peaceful and respectful, with monks and visitors quietly offering prayers. The rooftop garden, which features a beautiful prayer wheel pavilion and orchids, provides a quiet escape and a panoramic view of the city.\n\nAside from the temple, Chinatown itself is a lively maze of heritage shophouses, bustling markets, and mouth-watering street food. Whether you’re shopping for souvenirs, tasting local delicacies at the Chinatown Food Street, or learning about history at the Chinatown Heritage Centre, there’s something here for everyone.\n\nThe area is easily accessible by MRT (Chinatown Station), well-maintained, and very tourist-friendly. Whether you’re a spiritual seeker, a history buff, or simply looking for a unique experience, Chinatown is a must-visit—and the Buddha Tooth Relic Temple is truly the spiritual heart of it all.\n\nPro Tips:\n•\tVisit in the morning for a more peaceful experience at the temple.\n•\tDress modestly if you plan to enter the temple interior.\n•\tDon’t miss the free museum inside—it offers deep insights into Buddhist culture.\n•\tTry local favorites like char kway teow, chicken rice, and kaya toast from nearby hawker stalls.\n\nHighly recommended for anyone visiting Singapore!",
      "time": 1747299685,
      "translated": false
    },
    {
      "author_name": "Aileen Organic",
      "author_url": "https://www.google.com/maps/contrib/112206400202127444554/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUJoEVyINd54Eao7u0MHmZgv4KcAQCU3LPvve_4L-Do-HijDk_Q=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "2 months ago",
      "text": "Chinatown is a vibrant place, flooded with tourists. Hot, many alleys, many small shops selling souvenirs. Many art murals to showcase the scenes of old Chinatown. Good for photography. Beware of pickpockets even though Singapore is relatively safe. Try local coffee, very different from Western coffee.",
      "time": 1741058836,
      "translated": false
    },
    {
      "author_name": "Xoom Too",
      "author_url": "https://www.google.com/maps/contrib/105863133358477079886/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVLRzhuxFKh1jOBQiJLb1bjferwZ-xPRZ7v7ReqgRp2P_uVyh9Y4Q=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "One of the must visit places when in Singapore, at least for a quick peak. Location is great being near a lot of street food, MRTs, stores and just a walkable place.\n\nThere’s quite a lot of restaurants, snacky food places, jewelry stores, clothing stores, a food court & supermarket on the basement floor, and there’s also a library on the highest floor. Mall is quite clean and can be busy in the later hours of the day or on weekends.",
      "time": 1746189729,
      "translated": false
    }
  ],
  "types": [
    "shopping_mall",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14180881314271629430",
  "user_ratings_total": 19583,
  "vicinity": "133 New Bridge Road, Singapore"
}