{
  "formatted_address": "144 Upper Bukit Timah Rd, #01-21, Singapore 588177",
  "geometry": {
    "location": {
      "lat": 1.3423741,
      "lng": 103.7762593
    },
    "viewport": {
      "northeast": {
        "lat": 1.343521730291502,
        "lng": 103.7774519802915
      },
      "southwest": {
        "lat": 1.340823769708498,
        "lng": 103.7747540197085
      }
    }
  },
  "name": "Citi Beauty",
  "place_id": "ChIJ____P4oQ2jERP39MK_NrvyQ",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "L S",
      "author_url": "https://www.google.com/maps/contrib/104943415089697121781/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXn-AVAuqVvJjS4FEuKUmWy8jgkxCcmDl3o8OqSs3wlHXQMnDAtRA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I found this cosy gem of a place after visits to a few nailcare salons which declined helping me :( after I caught a toe fungal infection unexpectedly, following an injury where my toenail came out completely (ouch!) and I had to regrow my toe nail all over again. I had never had such a bad toe nail incident before so was at a loss of what to do for a start. I was very touched by Citi beauty’s kindness and warmth when the dedicated and knowledgeable Chinese Manager, Ah Yan, assured me they are confident in treating and healing my toenails back to my previously good condition with their expertise and deep experiences. True enough, it sure did with their fantastic pedicure services, daily nail tincture spray and sanitizing foot soak balls which I bought from them, my regrown nails regrew over many months to better and better condition with a few pedicures and daily spray remedies to the rescue, though it has to take months to heal. After the very satisfying experience, I signed up for their IPL hair removal treatment with unlimited sessions in a year. Tracy attended to me and she is a very lovely bilingual (English & Mandarin) speaking Vietnamese lady and did the eyebrow embroidery beautifully for her colleagues. Ah Yan and Tracy seriously know their stuff in this area and how to pace my weekly to monthly IPL treatments amidst my work schedules to get the full permanent results with their machines. I do see results of my otherwise stubborn hair reducing in its area of growth over months of weekly treatment (15 mins each time) so that is encouraging!  Thumbs up to Ah Yan and Tracy! 😊\nP.S. Please do not swim in pools untreated with chlorine to not risk being infected by fungi which spreads in water. It’s not a pretty experience to have.",
      "time": 1737030544,
      "translated": false
    },
    {
      "author_name": "Ben Hui",
      "author_url": "https://www.google.com/maps/contrib/109539210615020907593/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUWUW-gKxBQsu7klM7n1FKrfHrlRC0LL0w33Nrp0MWSQ-RpwfaQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Walked into Citi Beauty with my wife on a Sunsay afternoon for a facial.\n\nI got a treatment from Tracy. And now my skin  feels as smooth as a baby bottom.\n\nThe room was relaxing and the vibe was great.\n\nThanks",
      "time": 1742123075,
      "translated": false
    },
    {
      "author_name": "K2papa",
      "author_url": "https://www.google.com/maps/contrib/112760540358206462428/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVo-LyU2kUm_FC99v6I5LwfGGTImRyRab47V4Rdjka1PYXgAujT=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I am writing this review on behalf of my wife, who has been visiting this salon since Sept 2023. Her facial therapists had often changed and she finally found someone she trusted. Tracy is patient, not pushy with sales, and truly skilled in her crafts. My wife felt comfortable and relaxed under her care, which has been a refreshing change from other therapists who always try to sell other services during/after each facial treatment even though my wife already have two packages. Tracy makes her facial experience enjoyable and my wife appreciate her professional expertise. Thanks Tracy and as the saying goes - “Happy wife, happy life”.",
      "time": 1743259041,
      "translated": false
    },
    {
      "author_name": "Lian Bee Ti",
      "author_url": "https://www.google.com/maps/contrib/105930855873862470560/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJFlGd0jTlTr8i9HTJlwZXdoGTpmX5_LL9m43aPE4VD48LD_A=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "Hard selling all the way. Felt cheated purchasing a small black unknown China brand ‘cell recombination essence’ at SGD68 by beauty therapist at Beauty World, only to come home and find that the ingredients consisted only of Aloe Vera gel and distilled water. Terrible.",
      "time": 1735669069,
      "translated": false
    },
    {
      "author_name": "sh",
      "author_url": "https://www.google.com/maps/contrib/101369207977291006635/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKuKAZf6tZao-TIhUi8A7TcuPYqKaAYnMckZWNT1dZ3QtpjLA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Had a wonderful full body massage with Wen Wen at Citi Beaute. She applied exactly the right pressure throughout — just how I like it. Left feeling totally relaxed and refreshed. Highly recommend her!",
      "time": 1743910481,
      "translated": false
    }
  ],
  "types": [
    "beauty_salon",
    "spa",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2647953798064799551",
  "user_ratings_total": 223,
  "vicinity": "144 Upper Bukit Timah Road, #01-21"
}