{
  "formatted_address": "431 Clementi Ave 3, #01-324, Singapore 120431",
  "geometry": {
    "location": {
      "lat": 1.3138084,
      "lng": 103.7626092
    },
    "viewport": {
      "northeast": {
        "lat": 1.315039880291502,
        "lng": 103.7638286302915
      },
      "southwest": {
        "lat": 1.312341919708498,
        "lng": 103.7611306697085
      }
    }
  },
  "name": "Clementi Dental Surgery Pte Ltd",
  "place_id": "ChIJqRYh4ZEa2jERxilNCUAfhXc",
  "rating": 3.3,
  "reviews": [
    {
      "author_name": "Jess Chan",
      "author_url": "https://www.google.com/maps/contrib/117684318084424382207/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIN23t79AxLxx-qAAyXYvq3sZobtxZ41bpn2uI_EmovBjyFOK-t=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Was in great pain with the molar tooth and decided to visit my regular dentise via walk-in.\nIt was quite fast as the wait was only around 35mins.\n\nMy dentise Dr Soh is on afternoon shift and I was attended by Dr Lim instead. There are times that I do go to Dr Lim too and i am really thankful that she went through my diagnoses in details and also the extra mile with the booking of my last min appt with the Endodontics slated 40mins. (The Endodontics that I was referred to is fully booked this week and i was in pain and travelling in few days time)\n\nI used to visit lady Dr Soh for care services in the past too and i remembered that my gums used to bleed very easily. She did deep cleansing for me and all was good after!\n\nAppreciate this dentise family alot and it is not easy to find good dentise nowadays.\n\nJust to highlight that they are super popular and thus try to book in advance if possible.\nI know how it feels when we have tooth emergency yet no slots available. However they need their rest and breaks too. Lets be nice !!",
      "time": 1747154342,
      "translated": false
    },
    {
      "author_name": "Wong WY",
      "author_url": "https://www.google.com/maps/contrib/116371450089350895020/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLrkdP9ozOuxHQcnFvn3_MZ0m7AAS35KWTamqFzbeUoduwP9A=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "3 years ago",
      "text": "i have made this dentist appointment with them three months in advance but what greeted me today is a shut shutter. i even called them on their phone and nobody is answering. i came all the way from east singapore and this is what happened. i am very disappointed with their terrible admin service. they should have called and informed me that they are not opening their clinic due to whatever urgent reasons or divert their phone calls to answer enquires\n—-\n\non hindsight, i call them on tuesday and the clinic did get back to me. Good service recovery and hopefully the next appointment will proceed without any issue. Thank you.\n\n—\n\nupdated on 26/3/22\nI finally get my scaling and polishing done by Dr Soh. As usual, he is very assuring and skillful. 👍🏼",
      "time": 1648349945,
      "translated": false
    },
    {
      "author_name": "NYY",
      "author_url": "https://www.google.com/maps/contrib/113933141618585219203/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ2xK9aD7lQpxurgp8g4Z62l7M6g-eryTrSnYvgyLdqAqTBpg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "I visited the clinic on 26 Oct 2023 10:30am (my aunt's regular dentist) as the Dentist I frequent was out of town. I was attended to by Dentist Ms Soh Siang Yu. At the start of the treatment, she conducted a check and informed me that I was diagnosed with Periodontitis and this might have occurred since I was 6 years old. I have visited numerous dentists from 6 years old till today (being an adult) and no dentists has ever mentioned the above.\n\nDuring my 30 mins dental treatment (scaling and filing), Dr Soh repeatedly advised me to visit Dr Meryvn Ng at The Periodontics Practice located at Camden Medical Centre and that I should ONLY approach the above Dentist as treatment will be more cost effective when I clearly advised that I would prefer to visit NUH for periodontitis, which was nearer in location to me. The repeated persistence by Dr Soh for me to ONLY visit Dr Meryvn Ng made me very uncomfortable and I felt pressurized to do so.\n\nBeing worried on the above advice, I have since visited two other Dentists for a 2nd advice and NONE of the dentists advised that I have Periodontitis. The advice received, similar from both dentists, was to go for more frequent scaling/filing treatment.\n\nMy aunt, who visits the same clinic, was also advised by Dr Soh that she had gum problems as well.\n\nNot recommended to visit. The 3.5/5 stars google rating currently is reflective of my own experience at the clinic as well.\n\nEdited to include my date and time of visit to the clinic. Also wanted to clarify that I have no issues with the periodontitis diagnosis but it is the REPEATED INSISTENCE TO ONLY visit the said clinic that made me uncomfortable.",
      "time": 1700449590,
      "translated": false
    },
    {
      "author_name": "Steven Lee",
      "author_url": "https://www.google.com/maps/contrib/109228618027010945924/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLJ5-WefyBBDVb3tXZ_dgJ41RbrU4a9HgTZeGY410lfPcjr0w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "Just finish my visit to Clementi dental, I had visited this dental clinic more than ten years. Dr Soh, his partner and their staffs had provide a good and responsible service everytime I visit.\nI had make another appointment to clean my teeth again in August so to those who have no patient and can't wait for their service, please avoid. Feel like trying your luck, walk in and straight away your turn, fat hope. Their appointment list is always full. They will never rush to finish their job just because of long queue in the clinic. It is not like ordering food, everything must be quick and fast. I appreciate each time they put in effort and check carefully throughout the whole treatment. Thanks so much.",
      "time": 1613637344,
      "translated": false
    },
    {
      "author_name": "Jane Beh",
      "author_url": "https://www.google.com/maps/contrib/116738194160709144768/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKW0KhzCc8SDwWE7_Z3B_7wpcikXbLT6JbvJQRz5JruOf7K-g=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "9 months ago",
      "text": "not a good experience. i went to see dentist to see toothache but was told by Dentist Ms Soh Siang Yu that it was gum disease. She, as per NYY, recommended to go to visit Dr Meryvn Ng and I went through $1500 gum cleaning but the toothache didn’t go away. after been checked by National Dental Center, the ache was caused by crack at a molar teeth. i don’t understand why 2 dentists, Ms Soh Siang Yu  and  Dr Meryvn Ng can misdiagnosed even after i pointed where is the ache. how many teeth are there to check? 2 dentists checked on me and they can misdiagnosed. Are they professional ? 3 months torture!!!",
      "time": 1722389123,
      "translated": false
    }
  ],
  "types": [
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8612324222310361542",
  "user_ratings_total": 36,
  "vicinity": "431 Clementi Avenue 3, #01-324"
}