{
  "formatted_address": "7500 Beach Rd, Singapore 199591",
  "geometry": {
    "location": {
      "lat": 1.3001984,
      "lng": 103.8608667
    },
    "viewport": {
      "northeast": {
        "lat": 1.301638130291502,
        "lng": 103.8619545302915
      },
      "southwest": {
        "lat": 1.298940169708498,
        "lng": 103.8592565697085
      }
    }
  },
  "name": "Club 5",
  "place_id": "ChIJ_w10l7EZ2jERlFMyQlupDYg",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Florence Leow",
      "author_url": "https://www.google.com/maps/contrib/102656561598060120185/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWWAO5NDzda0lWfeRJhWD1zQtDlUm5XL-zVuqnQGNv9Rilxc3M7=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "🤎 Club 5 ( lobby level)\nPARKROYAL on Beach Road\n7500 Beach Road, Singapore 199591\n\n🟠  My husband and I visited \"Club 5\" at PARKROYAL on Beach Road on May 1st, 2025, and had a delightful experience. ▪︎As we stepped into the bar lounge, we were drawn to the vibrant ambience & stylish decor.\n\n🔵 Description of the decor\n*******************************\n🟨 Club 5 exudes an elegant yet contemporary charm.▪︎The space features warm ambient lighting from gold-accented ceiling fixtures that cast a soft glow across the room. 🩶 Plush velvet seating in deep, rich tones adds comfort and style, while the geometric-patterned flooring & mirrored accents contribute a touch of glamour.\n\n● The bar area is illuminated & framed by arched wooden shelves displaying an array of spirits and liquor. 🔷️ Overall, the decor is upscale and atmospheric.\n\n🟩  We only ordered 2 Hot Cafe Lattes, as we just had dinner at Ginger, the restaurant next door. The lady bartender was attentive and friendly. ● When I requested her to customise my Cafe Latte with more milk, she acceded to my request happily. 🌿 Before we left, she asked my hubby if the coffees were okay. 🙏🏻 The Cafe Lattes were rich and creamy, thank you bartender for the kind hospitality:)\n\n🟪  I flipped through the Club 5 Menu and saw it has an extensive and diverse range of bar snacks.\n\n🟧 The live band at Club 5 was amazing, and the lead vocalist exceeded my expectations.▪︎ When I requested 'Too Sweet' by Hozier, they happily obliged, and the performance was awesome. ● The intimate setting and acoustic instrumentation added to the charm of the evening.\n\n🌿🔵 Our first visit to Club 5 was a pleasant and happy one. The combination of great coffee and excellent service made for a memorable evening.\n\n🖤Dated 1st May 2025 / Thurs",
      "time": 1746116546,
      "translated": false
    },
    {
      "author_name": "Pokky Pay",
      "author_url": "https://www.google.com/maps/contrib/110918808891933220081/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIg5QtwCiGUswYDj_5sW44oCOoIajiabVkkOA27A8fZyDw-FQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Exceptionally cosy, great service, band that is absolutely engaging and taking dedications. Special shoutout to Amy for her amazing service and all out to serve, always looking for ways to delight, great recommendations on food and drinks and great cocktails. Keep it up and will definitely come back!",
      "time": 1734534558,
      "translated": false
    },
    {
      "author_name": "Lady Morpheus",
      "author_url": "https://www.google.com/maps/contrib/100314224516003808214/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU2BNQfPKS1dnBcZLNN2Ge6OQxO3bYiosDbI7kB9TwWW3aGL3dx1A=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Im a huge fan of park royal hotels (and pan pacific) and Club 5 is pretty chill on a Tuesday. Decided to pop by after dinner for some wine and as usual, enjoyed my stay. Staff on duty, Jasmine was super friendly and helped to see with my orders and took very good care of my table. Thank you Jasmine!",
      "time": 1733409267,
      "translated": false
    },
    {
      "author_name": "Min",
      "author_url": "https://www.google.com/maps/contrib/107454828471909497355/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK2AWCSnRx8LyWJda-FAq1fLwslmS9v7Pbrozs5BC4Q2-6QPw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "7 months ago",
      "text": "We’ve been here a couple times- we like that it’s usually pretty quiet (esp before 9/10) and has solid bar food (think from ginger next door, including satay, prawn paste chicken, lobster mac&cheese).  The decor/ playlist is a bit curious, kind of like a mixed bag, but all in all a reliable spot.",
      "time": 1729313135,
      "translated": false
    },
    {
      "author_name": "A G (Pourover Traveller)",
      "author_url": "https://www.google.com/maps/contrib/113615325065597115682/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXalVMmSibbSkqWmlwaShVFaKzr-mRhUmXFzbD0KxlPWBLVYXoNMg=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 3,
      "relative_time_description": "a year ago",
      "text": "I struggled to like this place. The hotel lobby ambience is quite good after the renovation and the Club 5 has also been renovated during COVID and was just recently launched. I like the Club 5 decor as it reminds me a bygone era but renewed with a lot of taste of classic modern.\n\nThe bar looks good, but on closer look they don't carry a lot of good spirits, just the typical ones. Then there is this big Negroni sign by Campari that just ruins the mood in my opinion, understand it's a sponsorship still it ruins the decor I feel.\n\nThe drink menu needs to be redone, I get a bit confused as I was first served a menu then later they told me it's the old menu. The paper is crumpled, a lot of pen marks and also stapled together at the back that just makes it super cheap + the font is super small even for my eyes plus the dark environment makes it harder to read (imagine for older people). Then they serve me the flight of cocktails and things are looking better. The flight menu of cocktails is definitely better. I guess I'll give it a second shot next time.\n\nThe music and the ambiance on the other hand I feel clash. The DJ is young and I feel is playing music that doesn't gel well with the decor, plus the disco lights is way too Saturday Night fever than just having a good classic old dancing floor that I heard this place is trying to reminisce.\n\nSo overall it's a mixed feelings for me.",
      "time": 1686451878,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9803678173273150356",
  "user_ratings_total": 163,
  "vicinity": "7500 Beach Road"
}