{
  "formatted_address": "05 Keong Saik Rd., Singapore 089113",
  "geometry": {
    "location": {
      "lat": 1.2793219,
      "lng": 103.8414258
    },
    "viewport": {
      "northeast": {
        "lat": 1.280673530291502,
        "lng": 103.8428237802915
      },
      "southwest": {
        "lat": 1.277975569708498,
        "lng": 103.8401258197085
      }
    }
  },
  "name": "Coach Cafe (Coach Play Singapore Shophouse)",
  "place_id": "ChIJMX-0Ey4Z2jER-DV0nFHq-AA",
  "rating": 4,
  "reviews": [
    {
      "author_name": "S S",
      "author_url": "https://www.google.com/maps/contrib/110831138618060265517/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV4CDHbV3yjMSP_8XxULy9tqAPiTRK-1x-2xtbBZMF5ylsOyaVj=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Cute little boutique on an iconic road. I had the signature hot chocolate and it’s worth a try despite a higher price tag. Rooms are themed with a beautiful blue and a vintage yellow room. Very bougie but cute.",
      "time": 1739037200,
      "translated": false
    },
    {
      "author_name": "Ph031",
      "author_url": "https://www.google.com/maps/contrib/113214477136962046049/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUgfLyWNDp1i4ALdnsQulJQSUkEve5qCJzr1uy-HunWm3TTGJVq=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "The Concept Store of the Coach Brand is the first Coach Cafe in Asia. The bag brand was founded in 1941.\nThe unique shop is very beautiful and stylish. Inside the eye-catching pink building, the location of the cute cafe\nWhen you enter the front, there will be a Digital Screen as an introduction for us to see. When you enter, you will see both vintage and New York atmospheres combined in the Coach Play concept. Both those who like the brand or those who are Cafe Hopping will love this. There will be very friendly staff to give advice. The decorations are colorful. You can take pictures and have fun. The coffee is very good because it is a collaboration with Brawn & Brains Coffee in Singapore. The drinks are delicious. If you come, I recommend ordering The Coach Hot Chocolate (13 SGD) because it is served with the C logo. The taste is strong. There are also many other dessert and drink menus.",
      "time": 1722612125,
      "translated": false
    },
    {
      "author_name": "Ng Google",
      "author_url": "https://www.google.com/maps/contrib/113786083060003258850/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLEi6ME9zt3xhjDmS9jeOmiR4GBVlyDhu_e_YrePVaUOpG61w=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "It’s quite hard to find a cafe on Keong Saik on a Sunday. There are some local options like Killiney but I just needed my western coffee fix. Came across this pretty and attractive pop up cafe by Coach.  Cafe is run by Brawns and Brains, which I knew they would have good coffee. Instead of my usual iced white, I saw the B&V coffee milkshake. Well, this gotta be different then. Priced at $12 but it was before gst was added. My drink was $14+. Abit pricey for a milkshake but never mind, I have already ordered.\n\nMilkshake is quite good and the coffee makes it even better. I believed only for coffee drinkers, you might wanna try this. I saw from the menu they have other desserts too, it was pre-dinner for me hence did not try any desserts though. Perhaps next time when I’m around the area again and when the pop-up is still around.",
      "time": 1730633959,
      "translated": false
    },
    {
      "author_name": "Bernice L",
      "author_url": "https://www.google.com/maps/contrib/109470125400117205597/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU7LFfsMGxxxE3lEDVD3mDsDa5gF0DoQqz8w-QuOOa_pNqj1kKwFw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 4,
      "relative_time_description": "11 months ago",
      "text": "Visited Coach Cafe on a Saturday afternoon to try their All Day Menu but was only informed at the cafe that they don’t sell the food, and only serve desserts and beverages.\n\nFood aside, this shophouse offers a unique experience for visitors to browse quirky, trendy and sustainable Coach products, and learn about the brand’s history and business direction. At least we didn’t leave “empty-handed”!\n\nThe staff was polite and helpful as she guided us through each floor and explained the ideas behind each concept room. Best part - this activity costs $0 🤩",
      "time": 1717684466,
      "translated": false
    },
    {
      "author_name": "Juztin Png",
      "author_url": "https://www.google.com/maps/contrib/117169322123176550814/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUtzHAHZgaOV2n0QzORFWlO5FGHscN0QRgS1aPAfbUneUNl8eYBgg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "9 months ago",
      "text": "Coach Café on Keong Saik Road offers a visually stunning entrance with its vibrant yellow design, making it a standout spot in the Chinatown area. Housed in a charming shophouse with 3 levels to explore. The café also doubles as a retail space for Coach products, including bags and fashion wear. The staff here are genuinely friendly and welcoming, adding to the overall pleasant experience.\n\nWe sampled a few drinks: the Iced Mocha, Iced Black Coffee with an extra shot, and the Long White. While the coffee was decent, we were hoping for a sharper and stronger flavor, especially from a café associated with such a well-known brand.\n\nOn the food front, the Coach Brownie was a highlight. It came with three pieces of chocolate brownie paired with a scoop of vanilla ice cream, sprinkled with pistachio—a satisfying treat. However, the doughnuts were just alright; they were fluffy but lacked filling.\n\nOverall, if you’re in the area and need a place to relax, Coach Café is worth a visit. It’s a lovely spot to sit and rest, even if the coffee could use a bit more punch.",
      "time": 1723193764,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "restaurant",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=70063430462354936",
  "user_ratings_total": 133,
  "vicinity": "05 Keong Saik Road"
}