{
  "formatted_address": "277 Orchard Rd, #01-09 09A, Singapore 238858",
  "geometry": {
    "location": {
      "lat": 1.3004289,
      "lng": 103.8397786
    },
    "viewport": {
      "northeast": {
        "lat": 1.301656030291502,
        "lng": 103.8410831802915
      },
      "southwest": {
        "lat": 1.298958069708498,
        "lng": 103.8383852197085
      }
    }
  },
  "name": "Coffeesmith (Orchard Gateway)",
  "place_id": "ChIJRQiKPJEZ2jERFDqQDduZiiw",
  "rating": 3.8,
  "reviews": [
    {
      "author_name": "Kaitlyn",
      "author_url": "https://www.google.com/maps/contrib/112413454146648258652/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocISI8S_de5GFi3H7DrSk1TJmCf4vA8wE-BUkWSa9mMRuGmloA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Love this outlet tuck at the corner of orchard gateway where I get my coffee fix whenever I needed one.. The fabulous part ain't only about the variations of coffee, tea choices and desserts but more of the services you get from the staff here and did I mention the Brownie?? It's a must try.. this store is open 24hours so you can pop by anytime after shopping around the area.. it's has the cozy and relax ambience..",
      "time": 1741916703,
      "translated": false
    },
    {
      "author_name": "Nugi Mugi",
      "author_url": "https://www.google.com/maps/contrib/107397424699014411487/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWZfAOEUQT0YfIOzqh3Y-QyOWDrDv8jav_I000vkHIHIQqVyddT=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "The place is very functional for online work charging outlets in most seats.\n\nI ordered Sunday brownies. It looks nice visually but unfortunately not worth the price $11.45. The ice is mediocre/cheap vanilla ices taste wise. The brownie had an odd texture like a cheap brownie. Not to mention it wasn’t hot enough to complement the cold ice cream so it was just two cold things together. Which defeats the concept.\n\nThe most concerning factor I have an issue with is the amount of chocolate syrup served on the Sunday brownies was too much. It took over the entire flavour of the dessert. Every bite I took was like someone pouring straight chocolate syrup in my mouth.\n\nNeeded to drink water to wash it all down.\n\nWhich brings me to my next complaint, I went to the counter prior to ordering to ask if they were busy and if they were willing to refill my water bottle. I don’t mind tape water since it’s drinkable but the issue I had was the servers.\n\nI always wait to find an available server since I understand the role of a server isn’t strictly for customers only. They have other responsibilities. I ask one server who was at the chair register and he said he was busy. So I moved on to find another server. My bottle hit the counter and made a loud thud by mistake so it might have startled the servers and came across as rude. I apologise for it.\n\nI proceeded to ask if they were busy, they responded with a no so I asked if they can help fill my bottle up. As soon as the server reached to grab my bottle, she asked me if I’m planning on buying something in the store. Which is responsible question. I affirm her I was. She hesitated for a while looking back to her colleagues for assurance I think. I repeated myself to reassure I was indeed planning on buying something. It took her some time before she took my bottle and filled it.\n\nI’m grateful she didn’t deny my request but the hesitation and behaviour was off putting. It left me quite troubled.\n\nThe plus side of cafe is that it offers plentiful seats/tables so no worries about finding a table there.\n\nThe minus though is the seats are quite old and have visible tears & rips.\n\nNot to mention I saw a small roach on the walls of the cafe. Which isn’t entirely the cafes fault as it’s located by one of the mall entrances. Nonetheless not something you wanna see while eating though.\n\nMy friend who was with me ordered Smith Ade lemon and she enjoyed it. So I recommend trying that.",
      "time": 1743998467,
      "translated": false
    },
    {
      "author_name": "Kristy Low",
      "author_url": "https://www.google.com/maps/contrib/115305501306070393111/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocINJCok7U9AuSN0Re3PqmkdAf4C8P8NUZ0NPkMFsNwb_UKMbw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "I am writing to express my disappointment with the mocha frappe my friends and I recently ordered. As a mocha lovers and regular customers for many years, we have always enjoyed the consistency of your mocha across outlets. However, the mocha frappe we received this time was drastically different from what we're used to have.\n\nWhen we were served the drinks, we immediately noticed that the color was much lighter than usual, and there was many many foam on top, which is not how we’ve experienced it before. The frappe itself was also unusually watery and lacked the thick texture we expect. Is a mocha frappe supposed to be this watery?\n\nWhen we asked the staff about the difference, we showed them a photo of the mocha which i taken from another Coffee Smith outlet. We were told that each outlet follows a different recipe. My friend, feeling confused, asked for clarification: “You mean different outlets have different recipes?” The staff member confirmed, “Definitely!”\n\nWhile we understand that some variations may occur, this explanation left us confused, as we have always enjoyed the same mocha frappe at different Coffee Smith locations over the years.\n\nAs a loyal customer who have been enjoying your mocha for years, we were truly disappointed by this change. It no longer meets the quality and flavor we have come to expect.",
      "time": 1734793397,
      "translated": false
    },
    {
      "author_name": "Maksim Pomazov",
      "author_url": "https://www.google.com/maps/contrib/104848871344508960879/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXfdbGYbKkOqXvDC6BjJFaRa1sM_dmPXY9pq5Ela9G8gYxrAE0Y=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "An interesting place where you can drink different types of drinks and all kinds of different flavours. I tried coffee “Сofe Vienna”, but I can say that the taste resembles the original from Vienna. So you can try, the atmosphere of the shopping centre, of course, creates its own entourage, not very clean and on the aisle, but in general it deserves 4 stars.",
      "time": 1742899871,
      "translated": false
    },
    {
      "author_name": "Cosmo Wolfie",
      "author_url": "https://www.google.com/maps/contrib/111112283605558288055/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXJ4JcirNdwhxOaSuy2VkciQGevGE3zNPOek41CXKDiGt-7VWY=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "⭐⭐⭐⭐\n\nCoffee Smith’s bingsu is a refreshing treat! I tried the mango and rice cake flavor, and the rice cake was soft and chewy—absolutely delicious. The mango was a bit on the sour side, which may not be for everyone, but it added a nice contrast to the sweetness of the shaved ice. Overall, it was a tasty and enjoyable dessert. Great place to relax and enjoy a unique treat!",
      "time": 1731412825,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3209546850559343124",
  "user_ratings_total": 915,
  "vicinity": "277 Orchard Road, #01-09 09A"
}