{
  "formatted_address": "323 Bukit Batok Street 33, #01-114, Singapore 650323",
  "geometry": {
    "location": {
      "lat": 1.3617041,
      "lng": 103.748231
    },
    "viewport": {
      "northeast": {
        "lat": 1.363181780291502,
        "lng": 103.7495736802915
      },
      "southwest": {
        "lat": 1.360483819708498,
        "lng": 103.7468757197085
      }
    }
  },
  "name": "Coffee and Tea",
  "place_id": "ChIJPb-_750R2jER4PkV6wkKMOw",
  "rating": 3.5,
  "reviews": [
    {
      "author_name": "Dean Loh",
      "author_url": "https://www.google.com/maps/contrib/101526612593517384616/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVNcCy3qR3SmHjcRaXQWZ4QcV-U3t6mt8iH5tfZ9qJPOj7vrX6FbA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "For the information of those who are not from Singapore, our coffee shops usually have multiple food stalls, each managed by different individuals. My review is based on my overall experience, although I will still highlight some stalls that I particularly enjoy.\n\nThe coffee shop has recently undergone renovations. I am unsure if there has been a change in ownership, but the service has definitely improved. For instance, even though it is a self-service establishment, the staff at the coffee stall still make the effort to go around and take orders for the convenience of customers. The prices of their drinks are also very reasonable. My son especially loves their \"Frappuccino-style\" Ice Milo.\n\nIn terms of food, my personal favorites are the mixed rice stall (or what Singaporeans call it \"cai fan stall\") and the curry noodle stall.\n\nThe zhir char (cooked-to-order) and prawn noodle stalls are also worth trying. As for the other stalls, I believe it depends on individual preferences. After all, one person's favorite may not be another person's cup of tea.\n\nOverall, this coffee shop is a great option for breakfast, lunch, and dinner.",
      "time": 1733020041,
      "translated": false
    },
    {
      "author_name": "Alvin Lim",
      "author_url": "https://www.google.com/maps/contrib/106394450808200270399/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIxZNGEnT0cZHyqpm01NBQf4pe3QR3fg7z4kJHhoEmNNALnbQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "Update 27 Dec 2024\n\nTried caifan-not too bad tasting\n\nTried wanton mee-portions are generous and edible\n\nThe prawn noodles soup put up a signage to inform that they are closed for 1 month!\n\nUpdate 13 Dec  2024\n\nThis is the new name of the former Kopi Tarik, under new management and with new tenants (save for the zichar Hongkong Street Cheng Zi which is still there).\n\nSome new  stalls look interesting (especially the porky prawn noodles) but yet to try.\n\nPrevious:\n\nRenovated hdb kopi tiam under new name and new  management  with new stalls (about 11 or so)  save for the same old Hong Kong Street Cheng Ji Zi Char stall serving up their signature delicious  fish soup and bee hoon as well as dishes like prawn paste chicken and curry fish head.\n\nHave also tried the new cai fan stall (they have value meals of 2veg 1 meat for $2.80 but only if u pick designated dishes) which is rather decent considering the price.\n\nAlso tried the guo tie (fried dumplings) which is fairly decent as well.\n\nThe Indian rojak stall is quite good as the fried items taste \"fresh\" and the rojak gravy is quite nice.\n\nOverall, nice makeover and the place is clean and bright and as always, bustling with many beer drinkers in the evening.",
      "time": 1735338689,
      "translated": false
    },
    {
      "author_name": "Cindy Ho",
      "author_url": "https://www.google.com/maps/contrib/111285134472906893604/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIgwbgl5sZxkeaNKUeE4MylD8uf21-DlfBMUvrzA6MkK82DrQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "There is a new wanton noodles stall. Noodles is springy and it taste really good. Wanton is not small, packed with meat filling and tastes nice and fresh. The portion I shown is $4 and it is not too small, just nice. It is better than other franchise wanton mee stalls whose portion is pathetic and wanton as just a smear of meat filling. Do try out this stall and support the lovely ladies.\n\nThere is also an Indian food stall that serves really good prata, dosa and briyani. Prata is crispy and soft, not chewy. Do try out the stall if you are nearby.",
      "time": 1729996626,
      "translated": false
    },
    {
      "author_name": "Alvin Li",
      "author_url": "https://www.google.com/maps/contrib/101636040394390892825/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUEJRUarzonItc6LmgTN1Zkf3sq-hVMQTzlPLSrYBY3UcMbYhmJ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "5 months ago",
      "text": "Zui Xiang Wanton Mee\n\nThere was a major renewal of tenants some time between end October and early November 2024.\n\nCurrent stalls include: economical rice, pop piah, drink stall, seafood BBQ, Ipoh Curry Mee (moved to 155 Bukit Batok Street 11), BB Corner, wanton mee, soup, prawn noodles, zi char, Muslim food. Fishball noodles is coming in January 2025.\n\nThere is a new initiative for elderly in the neighbourhood that started on 20 December. Order a cup of kopi/teh o kosong for 70¢.\n\nThis is currently my favourite wanton mee in the neighbourhood now. The stall is manned by two petite ladies who work hard to churn out delicious bowls of wanton mee. Add on some fermented fried pork or a side of fried dumplings and wanton to zhng your meal.",
      "time": 1734755714,
      "translated": false
    },
    {
      "author_name": "BCW MOTORRAD",
      "author_url": "https://www.google.com/maps/contrib/117651874255575944558/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKg_OyaGVolZjv1V7WiQRmsRe2KJq87MKzyUzBpNSjBH0th_Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Had Fish head bee Hoon @ HK street Cheng Ji. Delicious and ample fish meat @ $7 a bowl. Worth coming back next time",
      "time": 1736945449,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17019114029548173792",
  "user_ratings_total": 28,
  "vicinity": "323 Bukit Batok Street 33, #01-114, Singapore"
}