{
  "formatted_address": "308 Clementi Ave 4, Block 308, Singapore 120308",
  "geometry": {
    "location": {
      "lat": 1.3209378,
      "lng": 103.767042
    },
    "viewport": {
      "northeast": {
        "lat": 1.322398580291502,
        "lng": 103.7684541802915
      },
      "southwest": {
        "lat": 1.319700619708498,
        "lng": 103.7657562197085
      }
    }
  },
  "name": "Common Grill @ 308 Clementi",
  "place_id": "ChIJeZSQYIQa2jER1tQr5IPcij8",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Lawrence Lau",
      "author_url": "https://www.google.com/maps/contrib/114816378847700340645/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK6jpb9JZBlB7eDlzifnJ_JynEjCS4m30OuiWTTsmc-AusLLw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 weeks ago",
      "text": "Visited on 1 May PH at 640pm and ordered a pizza and chicken chop.\n\nWaited 40min before asking for our order as it was a really busy evening for the kitchen, only to realize that the buzzer system was not working. Our food has in fact been on the collection desk for a period of time enough to cool it to room temperature.\n\nWhile collecting our food, we noticed a few plates of pathetic looking plated food with dry meats waiting for its rightful owner to collect. There was also a small crowd (include food deliveries riders) gathering around the collection point.\n\nOur pizza unfortunately tasted horrible as it was cold and salty; we couldn’t finish even half of it. Chicken chop was the worst and it tasted like it’s been left overnight.\n\nWhen we left at about 8pm, 3 plates were still at a collection desk. I wonder if it is still there now. 🤣\n\nWhat surprised me greatly is the lack of initiatives to manually call out the order number so that the collection point will not jam up and the diners can get the food.\n\nI love Collins and has supported this outlet way since it first opened but this may be my last visit.",
      "time": 1746167324,
      "translated": false
    },
    {
      "author_name": "elan covan",
      "author_url": "https://www.google.com/maps/contrib/117193676866927852432/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKzFx-D9vThkq-kOMMVG0PB9xTv_FdQ_yY3kaVuqmishi0mmg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Very poor counter service from you young counter staff rude behaviour stuck up behaviour should send her to upgrading school on customer service. 8.30pm Clementi outlet Blk 308. Very disappointing. We are old people should educate how to talk and handle us.\n\nPasta like soup watery",
      "time": 1741698213,
      "translated": false
    },
    {
      "author_name": "Dorene Lim",
      "author_url": "https://www.google.com/maps/contrib/106200550032419773033/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWyCCdRVLcgJ43CddQ1hDYrY4WOZHPMP-6Icy27ZB2TnlZx1Zw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "8 months ago",
      "text": "On 21/9 @ 8:23pm after my appointment purposely google to the nearest COLLIN's for dinner. Ordered a Mixed Grill & a medium Ribeye Steak, all stated clearly in the receipt to eat in, at the same time ordered 2 set of Double Chicken chop set to take away. When the food came the Ribeye was charred and hard, but bcos after a hard day work too tired to bring for exchange  we decided just go with it later just give a feedback. When we finish our dinner went to collect my takeaway, we just gave a friendly feedback said the steak was overcooked and hard, they said we ordered the wrong part, but we showed them it was a ribeye, then they said next time pls bring back to exchange. While waiting for the food i reminded the cashier my 2 takeaway both set are double portion of chicken she said she is aware but i told her she forgot to charge for one set, so i paid her additional $5/-.  Few moments later our food was ready, when we collected the food they said the spagehetti are under the chicken. So we did not suspect anything took the bag and left, when we reach home reaslized the 2 chicken set does not have any spaghetti, both are for my 2 hungry son, can you imagine how disappointed i felt.\nI paid $20.90 for ribeye came out dry and hard\ni paid $9.50 chicken chop + $5 double up chicken X 2 Sets total paid $29/-  end up they did not give me my spaghetti. I felt so short change. Staff do not accept feedback when we do so they not  apologetic but yet purposely short change my food. Do you think they accidently missed out? If yes, why would they tell me the spaghetti is under the chicken. I am very upset and disappointed.\nI really hope the management could do something about this.",
      "time": 1726932204,
      "translated": false
    },
    {
      "author_name": "Christine Ang",
      "author_url": "https://www.google.com/maps/contrib/111771560638701422647/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV_lVccOMvryXFngG9vMIwZqL9N3kAu2J2It31wLOpXCdDjOYX_=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "This place never fails. Reasonable price, nice food equivalent to their main steam restaurant standards.\n\nIf the aglio olio looks like it's overflowing on the mixed grill plate, it's because I added aglio for extra $3.\n\nCome before 6:30pm on weekends, else the crowd starts coming in.",
      "time": 1740825767,
      "translated": false
    },
    {
      "author_name": "FFROSTYY",
      "author_url": "https://www.google.com/maps/contrib/116438099716975631225/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWmeoCeD8HCptKjPM8qfqczdN5Nz_Vfuzp4bcB5tNLmW89WII6t=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "11 months ago",
      "text": "Quiet and remote place to eat during lunch time ! Always easy to find parking, food prices are heart lander prices. Good ventilation here as well. Common grill is the watered down version of Collin’s and quality is definitely worse than their parent brand. They had this cheap lunch menu of 10 dollars for soup and the commonly ordered western food. Overall, can’t expect much but the portion is sizeable with fries, pasta, corn and a large size meat. Coffee sold here is quite watery too.",
      "time": 1716875886,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4578714430202434774",
  "user_ratings_total": 273,
  "vicinity": "308 Clementi Avenue 4, Block 308"
}