{
  "formatted_address": "698 W Coast Rd, Singapore 608784",
  "geometry": {
    "location": {
      "lat": 1.318987,
      "lng": 103.7456026
    },
    "viewport": {
      "northeast": {
        "lat": 1.320326130291502,
        "lng": 103.7467674802915
      },
      "southwest": {
        "lat": 1.317628169708498,
        "lng": 103.7440695197085
      }
    }
  },
  "name": "Commonwealth Secondary School",
  "place_id": "ChIJ9TkRCBcQ2jERr5vfHgln9C4",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Sri Janakiraman",
      "author_url": "https://www.google.com/maps/contrib/113162979134168222186/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVX5GGeKy0QPuOLVBW0iDWBcDoyrIY3d-l2a_4BbG4D8FzsEsNQ4Q=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Commonwealth Secondary School stands out as an exemplary institution that blends academic excellence with cultural vibrancy and holistic development. The school's dedication to nurturing talents across diverse domains is truly commendable.\n\nOne of the highlights is the inclusion of Tamil literature in the curriculum, which ensures students stay connected to their cultural roots. The school also celebrates diversity through its vibrant Indian Dance (Tamil dance) program, which allows students to explore their heritage while showcasing their talent and creativity. These performances are both graceful and a true testament to the school's commitment to cultural appreciation.\n\nThe wide range of Co-Curricular Activities (CCAs) at Commonwealth Secondary is another remarkable feature. From performing arts to sports, there’s something for every student to pursue their passion and develop essential life skills. The school’s nurturing environment and dedicated teachers provide the perfect support system for students to excel.\n\nFurthermore, the school’s focus on fostering a well-rounded education ensures students are prepared for challenges beyond academics. Commonwealth Secondary not only emphasizes strong values but also encourages critical thinking, teamwork, and leadership qualities.\n\nOverall, Commonwealth Secondary School is an excellent choice for parents seeking a school that balances academic rigor, cultural enrichment, and personal growth.",
      "time": 1731733919,
      "translated": false
    },
    {
      "author_name": "isa",
      "author_url": "https://www.google.com/maps/contrib/105001663090240653325/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUjcm48uQFl-__Ka5TNm-AFUUq_DbBiYVbnC6Bb9awJg73aGS0H=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "2 months ago",
      "text": "I got picked on within the first week, very unpleasant. The students from my class are all quite toxic, lots of dramas going on every week. Other classes seem very chill and it looks like it's only my class that has so much things going on. Would love to be in another class, almost all the nice people I know are from other classes. Wonder why they don't split the G3 and G1/2 students, it's easy to be influenced by the people around you. The teachers teach quite well, I learnt a lot. Generally nothing to complain about except for the students there.",
      "time": 1740232606,
      "translated": false
    },
    {
      "author_name": "K a l 1 S S",
      "author_url": "https://www.google.com/maps/contrib/100679182423591505301/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUZN_CxKsBHTTt_VDGh6HzPSZElJ0zYfBbDR9gVK6KTnptbolo=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Review: Jan 2024\nRepainted & with a New look during the evening.\n\nReview: June 2023\nEvening Sunsets around the school is natural beauty  miraculously with its colourful sky\n\nReview: May 2023\nThe New look of Commonwealth Sec School with other developments on the way around it\nHistory of its site :\nJurong Junior College (1981–1985) moved to new location in 1985, premises re-allocated for use by River Valley High School.\nRiver Valley High School (1986–2004) moved to new location in 2004, premises re-allocated for use by Commonwealth Secondary School.\n\nReview: September 2022\nThe cleanliness surrounding the parameters of the school is cleaned & clear .\n\nReview: 8Aug 2022\nStudents accompanied by their teacher distributing Singapore 🇸🇬 National Day packs to every neighborhood home . The excitement seen in the Students for the event was very obvious with their greetings 😀 and movement 😀. Their personalised messages drawn on every pack . Children involvement in such community activities is a must as its symbolically educational for as a caring society.\n\nReview: 30May 2022\nThat loud Kompang music has stopped playing near to the residents\nThe ingress & egress of walking students is now through the side gates 3 & 9 since the foot path alongside the school is narrow & used by cyclists & more.\nNoticed many times , players who are unfamiliar with the school coming to play sport games & walking at the parameters of the school after closing hours which having me to post those pictures of the gates .\n\nReview : January 2022\nMusic lessons are conducted super loud like crazy with the banging of drums (kompang) and near to residential homes , when there is plenty of space facing the Jurong Town Hall Road.\n\nStudents seen in uniform as in couples or  groups  at the residence blocks stairways for their private  activities . Smoking or viewing phones  .",
      "time": 1705592015,
      "translated": false
    },
    {
      "author_name": "C T",
      "author_url": "https://www.google.com/maps/contrib/116532032469384560252/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIaWB_OUXRtpoDO4EE7l-fGr-ZFOdLf9vBELyOY3kVzFcFYNg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Visited their open house and they are one of the most vibrant out of the schools we've visited. Really impressed that they have a holistic mindset to education and have incorporated design thinking and eco stewardship lessons in addition to their regular curriculum. This school is clearly preparing students for the future economy.",
      "time": 1731761032,
      "translated": false
    },
    {
      "author_name": "Luiz Jeric",
      "author_url": "https://www.google.com/maps/contrib/116741579635144556348/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXWHtFAjX8o2FRY1rVxnIXI0FwJCf4vpxs9PebLeF7TcxLxe82G=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Nice school but why is it called commonwealth when it's near Jurong East",
      "time": 1735974118,
      "translated": false
    }
  ],
  "types": [
    "secondary_school",
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3383442508932422575",
  "user_ratings_total": 62,
  "vicinity": "698 West Coast Road"
}