{
  "formatted_address": "51 Compassvale Cres, Singapore 545083",
  "geometry": {
    "location": {
      "lat": 1.3960452,
      "lng": 103.9002456
    },
    "viewport": {
      "northeast": {
        "lat": 1.397248680291502,
        "lng": 103.9014743302915
      },
      "southwest": {
        "lat": 1.394550719708498,
        "lng": 103.8987763697085
      }
    }
  },
  "name": "Compassvale Secondary School",
  "place_id": "ChIJk8CdLAkW2jERdy-WT67Bhjw",
  "rating": 3.4,
  "reviews": [
    {
      "author_name": "Poop Lim",
      "author_url": "https://www.google.com/maps/contrib/112701710686239631974/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLmM2A54pIXmEemXd2sqhNcOm7_4qguu3-EL9_RtowZBywg2w=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "I am quite disappointed with the behavior of our school librarian. On multiple occasions, I’ve encountered rudeness when asking for help or simply seeking information. The librarian seems uninterested in assisting students, often responding in a dismissive or condescending manner. Additionally, there appears to be a clear bias in how certain students are treated, with some receiving far more help and attention than others. This makes the library feel unwelcoming, and it’s disheartening that a place meant for learning is instead a source of frustration. I would write another paragraph about the school's principal but I will leave that for another day. Truly disappointing.",
      "time": 1738492794,
      "translated": false
    },
    {
      "author_name": "Account123",
      "author_url": "https://www.google.com/maps/contrib/106772035210014795351/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKLPPZfAFjXJ9drHw9gjc-4PhVoXPGhgvYsS_YB0vA8IaXp2A=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "Just close the school down already, terrible DM who nags every assembly lesson thinking we would listen.\n\nAnd apparently the school got angry cuz of the low ratings they decided to start scolding us next assembly saying “what if your employer sees you go to a school with a low rating?” Like bro Idc if you want good rating then be a good school 😭",
      "time": 1737777453,
      "translated": false
    },
    {
      "author_name": "theguy_withstuff",
      "author_url": "https://www.google.com/maps/contrib/112628164904019834073/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWlhD11B8MNBb2dFkvmtl0rTiNZFwD5S7HSV7gGkoAuKV2oEDlv=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "3 years ago",
      "text": "how do you rate a school anyways? Anyways as a student in this school, could be worse. Like, this schools has been here for 20 years so of course theres something good there, the design of the school is quite unique. Ain’t perfect though, mainly the toilets, hell is in those toilets, trust me you don’t want to go in there, the further the toilet is from the classrooms the better. Best thing about sending your children to school is the convience of it, Compass One is a short walk away and theres a conviences store right next to it. Uniform rules are quite relaxed, no tucking in or whatever and your phone is allowed during recess which is nice. The food there was good, not great but good, if you want something the westren food is not bad. Honestly for the requirement I needed (200) it was quite good, could have gone worse.",
      "time": 1645675286,
      "translated": false
    },
    {
      "author_name": "Holiday lover",
      "author_url": "https://www.google.com/maps/contrib/104723346232860802563/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWlk5ZT9Tp4etGhAZUM68s0PvxMWhtK2kPPmI4pEkrMttMeBB80=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "3 months ago",
      "text": "Parents, please do NOT force your child to go to a school just for “convenience” let your child choose their school.\n\ndue to lack of influence and will to study im stuck in NT nearing ITE(its the end) i regret that i didn’t go NA now all my friends are gonna go poly while i get akps  because im all alone in ITE.\n\nJust for not much hbl days i hate this school\ni hate how everytime i hear my friends brag that theres hbl to piss me off and that they’re hanging out in a goon circle while im stuck in class listening to the teacher scream at my classmates who clearly gave up on life because they’re NT while wondering what did i do to deserve being forced here and why didn’t i study to go poly with them.\n\nbasically due to my parents forcing me to go to this school for “convenience”my youth is spent lamenting and my adulthood will be spent working shitty jobs.\n\nGreat malay store though so 3 stars bc of Malay store",
      "time": 1739540092,
      "translated": false
    },
    {
      "author_name": "Yuan Kangyang Jordan (Cvss)",
      "author_url": "https://www.google.com/maps/contrib/110005354025465778044/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIMiTzLblqZuJLuQA1rM1soDL4D1R0tppxQk8aL1V39q_nPXA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "7 months ago",
      "text": "I recently visited this schools  library and was shocked by the librarians terrible attitude. Instead of the helpful guidance I expected, I was met with sarcasm and impatience when I asked for assistance. It felt like I was bothering her rather than seeking help. The atmosphere was uncomfortable, and I left feeling frustrated. Libraries should be welcoming places for learning, but this experience was anything but helpful.",
      "time": 1729476208,
      "translated": false
    }
  ],
  "types": [
    "secondary_school",
    "point_of_interest",
    "school",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4361386243558616951",
  "user_ratings_total": 91,
  "vicinity": "51 Compassvale Crescent, Singapore"
}