{
  "formatted_address": "170 Upper Bukit Timah Rd, B2-01B Shopping Centre, Singapore 588179",
  "geometry": {
    "location": {
      "lat": 1.3430257,
      "lng": 103.7761427
    },
    "viewport": {
      "northeast": {
        "lat": 1.344276430291502,
        "lng": 103.7773840302915
      },
      "southwest": {
        "lat": 1.341578469708498,
        "lng": 103.7746860697085
      }
    }
  },
  "name": "Concept Math Bukit Timah",
  "place_id": "ChIJtVb9YooQ2jERrN14YT6RpUg",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Sylvia Tan",
      "author_url": "https://www.google.com/maps/contrib/105759356130400701577/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKztibEjjQTLfS-XMltvVjZjH2h4cbJb2I6Sd2BQxMsl4n_OA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "My eldest girl joined Concept Maths when she was  in P5 as I noticed a sudden drop in her term exams. Her marks were ranging from AL4-AL5. After the trial class at Concept Maths, she immediately asked me to sign her up. She loves the methods and techniques taught in Concept Maths as it helps her to understand and solve more challenging questions easily. She even asked me to sign her up for holiday programmes which really helps a lot.\nAll the teachers at Concept Maths Bukit Timah branch are so passionate and encouraging. Big shoutout to Teacher Paulina, Teacher Idayu, Teacher Irene, Teacher Elaine, Teacher Ee and Teacher Jessica.\nAs my girl prepares for her PSLE, teachers at Concept Maths really put in 100% in guiding her. My eldest girl scored AL1 in her PSLE this year!\nI even signed up my second and third child with Concept Maths right after I enrolled my eldest girl. I will highly recommend Concept Maths to others!",
      "time": 1732778851,
      "translated": false
    },
    {
      "author_name": "Alvin Keng",
      "author_url": "https://www.google.com/maps/contrib/102230148444472889743/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKz88fHtXAchB1eqFINRqqhrYzboAw4cAMJcwJiQTPDRJRZhA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "The teachers are good and focus. They care for the children’s ability to catch up and follow lessons.\nBoth my kids benefitted from the tuition. I’m pleased with the tuition outcome.",
      "time": 1732840508,
      "translated": false
    },
    {
      "author_name": "T Tan",
      "author_url": "https://www.google.com/maps/contrib/104535632071135806685/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLwZFRCLLHwGzPRbiLDv1BbtPQImFtYWY-896s-v6Nz-Qy_Ag=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I want to extend my heartfelt thanks to teacher Irene and the team at Concept Math… my son just got back his P5 EOY math results and he scored an AL1 for the first time. Although he’s been with Concept Math for only a year, his improvement from P4 EOY AL4 to an AL1 at P5 exceeded our expectations. The team of staff and teachers were very prompt in answering the math questions my son was struggling with during the exam season and gave very detailed solutions.\n\nWe also attended the online Seminars arranged by Concept Maths on PSLE preparation which we found extremely helpful in finding out which topics we should focus on for the upcoming PSLE. The PSLE marking Math Revision course helped to refresh the topics covered this year and made him confident going for his exams. The online course material and booster worksheets allowed him to self-study when we are at work. A great help for consistent learning throughout the year. We trust that he will continue to learn well as he enters P6.\n\nTwo thumbs up for Concept Math.",
      "time": 1730601304,
      "translated": false
    },
    {
      "author_name": "Angeline Neo",
      "author_url": "https://www.google.com/maps/contrib/114125153647165045706/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJkHdpI2BLezedpcPKbPdlturmUQcGGbTA_E-3kKBpqZfAaoQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Our child's confidence in handling challenging Math questions has improved tremendously under Teachers' Ee and Elaine teaching and guidance. The Math Concepts that the teachers teach are easy for my child to understand, learn and apply to the different Math questions. He can solve Math questions with ease and achieve high marks in school now. We can count on Concept Math teachers to support our child in getting excellent Math results in school & PSLE.",
      "time": 1700307209,
      "translated": false
    },
    {
      "author_name": "Rae Rae",
      "author_url": "https://www.google.com/maps/contrib/105231585774991325464/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJnN6k9Cj4Y7SjTo0ahBylOxqV6JrgbATWJwiuXTVXPCini7w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Concept math is very good credible tuition school. My kids benefited from the tuition program tremendously, and the improvement in their grades is a strong testament of the centre’s program. In addition, the teachers at Concept Math are very patient and focused. I thank all teachers in Concept Math for their dedication. Thank you!",
      "time": 1700626498,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5234749838997380524",
  "user_ratings_total": 21,
  "vicinity": "170 Upper Bukit Timah Road, B2-01B Shopping Centre"
}