{
  "formatted_address": "1 Goldhill Plaza, #03-01, Singapore 308899",
  "geometry": {
    "location": {
      "lat": 1.3185189,
      "lng": 103.8429045
    },
    "viewport": {
      "northeast": {
        "lat": 1.319898080291502,
        "lng": 103.8442896802915
      },
      "southwest": {
        "lat": 1.317200119708498,
        "lng": 103.8415917197085
      }
    }
  },
  "name": "Concept Math Novena",
  "place_id": "ChIJJ8XHlOcZ2jEReGdAkPMzKwU",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "K G",
      "author_url": "https://www.google.com/maps/contrib/101040139874747331912/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIJjfPEw5Gh_6GNX7odHUd_lAVfGOc9pwh5kL5dsSF3iAKztg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I would like to share a brief feedback as my P4 daughter begins her journey with Concept Math. The program offers a well-structured and engaging learning experience. The instructors are knowledgeable, and the staff is both helpful and transparent. The after-class session provided valuable insights for parents, and the video materials effectively reinforced key concepts. I truly hope my daughter is learning positively and making progress through the program. Overall, it has been a highly effective and enriching experience. Thank you for your dedication and support!",
      "time": 1742457447,
      "translated": false
    },
    {
      "author_name": "Joanne L",
      "author_url": "https://www.google.com/maps/contrib/108407998621621762049/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJt3OuxLXb_S1HGUZWO1_p4doo3XUvGHTES878Rh9XjX1bMvA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Concept Math’s curriculum and clear explanations have helped both my children grasp various topics more easily since lower primary, building a strong foundation for their learning. The e-classroom has also been a valuable tool for revision, reinforcing key concepts effectively. Their teachers are responsible and proactive in monitoring and supporting their learning progress. Overall, Concept Math has greatly boosted my children’s confidence in mathematics!",
      "time": 1745836439,
      "translated": false
    },
    {
      "author_name": "shengjoin Lua",
      "author_url": "https://www.google.com/maps/contrib/104810691808043998841/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKCb2yjtiwOhlpRNnYHJlectnSrTEcnXuXDB69PiFATKf0Zfg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Both my daughters are students of Concept Math from primary 1. While I have no basis of comparison vs other math enrichment facilities, I can only say that both my girls and us (parents) are extremely comfortable with the curriculum and teachers of Concept Math. From my observation of my daughters doing their math problems, I can see them approaching each question in a very logical and methodical way, as taught to them in Concept Math.  The teachers are both patient and dedicated and the parents debriefs offer us parents the opportunity to appreciate how our girls are taught. I would recommend Concept Math to all parents who want their kids to grasp the fundamental and essence of Math.",
      "time": 1738479638,
      "translated": false
    },
    {
      "author_name": "Cindy Sum",
      "author_url": "https://www.google.com/maps/contrib/117939531692102122099/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJbDjwSZ2CH_vGffnUjU52gdZ69vPp-oBIbp6f02vZwZl7IYA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Concept Math has been a great help! Enrolled my girl since P2 and she has grown so much under the guidance of teacher Charlene! She is engaging, clear and more importantly, my girl loves doing Math and does her Math homework independently!",
      "time": 1743217730,
      "translated": false
    },
    {
      "author_name": "claire au",
      "author_url": "https://www.google.com/maps/contrib/106395892062332228304/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJplzvW1TjrN4Jmqx8c49V2k25OTLUJ9lSHxV7_6-ii2NxHYA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Thanks to Concept Math, my boy scored full marks for his year end math assessment test last year! I wasn't even aware until another mum asked me which tuition centre I send my boy to, because she heard he had full marks.\n\nI'm genuinely very impressed by how systematic and well-organised the school is run. They have a debrief for parents to sit in after every class, so we're kept up to speed on what our children are learning. That way, we're better equipped to guide our children at home.\n\nIf we miss a lesson, besides in person replacement class, we're also given the option to attend via zoom, or watch a replay. That is very helpful because we can watch the replay at a time convenient for us. I have seen my son sit through the replay lessons quietly, paying attention because the lesson is engaging.\n\nMy son also likes his teacher, Teacher Jeslyn, who is very good with the kids!",
      "time": 1739608686,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=372448515378407288",
  "user_ratings_total": 84,
  "vicinity": "1 Goldhill Plaza, #03-01"
}