{
  "formatted_address": "21 Lor Kilat, #01-07, Singapore 598123",
  "geometry": {
    "location": {
      "lat": 1.3409543,
      "lng": 103.7729881
    },
    "viewport": {
      "northeast": {
        "lat": 1.342347180291502,
        "lng": 103.7743332302915
      },
      "southwest": {
        "lat": 1.339649219708498,
        "lng": 103.7716352697085
      }
    }
  },
  "name": "Cowpresso Coffee Roasters Singapore",
  "place_id": "ChIJ6VzXLGEQ2jERXwVlpVrULtM",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Yen Trinh",
      "author_url": "https://www.google.com/maps/contrib/106124579273314676288/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXtC6RP6_O3tKS71cmbi6hA37Jv2zW8KSkMDlmH8Vog__ar-MCB3A=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We've been loyal customers to Cowpresso for easily a year now, both the cafe and the equipment showroom. The space is spacious, the coffee is fantastic and I love their food options (especially the classic breakfasts). The staff are always so friendly and welcoming (Lin from the showroom was simply incredible when we bought the Lelit machine). This is a great place to catch up with friends, or to buy high quality coffee machines!",
      "time": 1744360816,
      "translated": false
    },
    {
      "author_name": "EZ",
      "author_url": "https://www.google.com/maps/contrib/114987800707147658095/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLdhMfWRNfGmW2-QDPSw9sdEYg7mYELYuwr0tX0qi2N7QirMA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "This showroom requires an appointment to visit, but we've waited over 10mins past appointment time. Have to knock on doors to get in.\n\nService is sub-par. The lady staff is either too tired or not passionate about her job. I walk in ready to buy a machine, and walked out in 15mins determined even I'm buying definitely not here.\nE.g I asked if the price she quoted was final? Because the same seller on Shopee is selling $200 cheaper, any reason. Her answer wasn't making most sense, n instead said u can order it online.\n\nFollow-Up: the staff followed-up to explain n apologize for the inconveinence. not meant to cause any harm, and understand today is a public holiday n quite busy day. Just hope the service level can be improved. all the best!\n\nCoffee is good btw",
      "time": 1743430026,
      "translated": false
    },
    {
      "author_name": "Brian Claus",
      "author_url": "https://www.google.com/maps/contrib/100194968913569891982/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKHxV1v89jmeT2IyGg0B1RwU7vMNvkv8YvwY9fnFVZKcejUuA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "I wish I could write about how great the food was, but while ordering at 7:15pm we were brusquely (and a bit rudely) told we could only order takeaway as the shop was closing in 15 minutes.... despite posted hours of 8pm. I also strongly dislike restaurants that require registration and personal information be entered into their online menu for the privilege of dining at their establishment.\n\nIt was a waste of a Sunday evening out for what looked like it could have been an interesting cafe.",
      "time": 1745162778,
      "translated": false
    },
    {
      "author_name": "Travis Lee",
      "author_url": "https://www.google.com/maps/contrib/114317766905567101774/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ1gqKInv4IpC30bSRQACVuCVD1JOblU_VKXOZ25skjZuf9EA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Cowpresso is a well known store among local coffee enthusiasts, and an excellent specialty cafe as well.\n\nI have been purchasing items from Cowpresso on Shopee for years. They carried a great range of products (particularly for Lelit, DF64) at a highly competitive price, in fact the best value in Singapore.\n\nI finally visited their physical shop for an afternoon coffee break. The latte did not disappoint. Cowpresso delivered that perfect cup of latte, presented with beautiful latte art. And the food was equally enjoyable.\n\nThe cafe provides ample seats, with 3 distinct sections to choose from. A small selection of accessories and beans are available off the shelves. While the bulk of the products are displayed behind glass doors, and required an appointment to view.\n\nCowpresso is more than just a cafe or retail store, it’s a heaven for coffee lovers.",
      "time": 1743412239,
      "translated": false
    },
    {
      "author_name": "Christine Regala",
      "author_url": "https://www.google.com/maps/contrib/105551386009781407148/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXy12SAn4c_dT3hZg6PZNcwYMA7ZMcyM8MABQjwP0HV9yJ7U0wv=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I just tried the lasagna and taro drink, and I had to come back and share how amazing it was! The lasagna was absolutely delicious, especially with the generous amount of beef and mozzarella cheese. The taro drink is one of my favorites — I love it! It would be great if they sold the taro powder so I could enjoy it at home anytime.\n\nThe staff were really nice and friendly, and the chef was also very welcoming. The place was clean and well-maintained, which made the experience even better. Highly recommend!\n\nAesthetic Interior and Design..Instagrammable!!!! 💯💯💯💯💯",
      "time": 1732372737,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "restaurant",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15217333676718490975",
  "user_ratings_total": 496,
  "vicinity": "21 Lorong Kilat, #01-07"
}