{
  "formatted_address": "75 Airport Blvd., #01-01, Singapore 819664",
  "geometry": {
    "location": {
      "lat": 1.3585609,
      "lng": 103.9879672
    },
    "viewport": {
      "northeast": {
        "lat": 1.359866280291502,
        "lng": 103.9894760302915
      },
      "southwest": {
        "lat": 1.357168319708498,
        "lng": 103.9867780697085
      }
    }
  },
  "name": "Crowne Plaza Changi Airport by IHG",
  "place_id": "ChIJvySRapM82jERRQTFHA8XoHQ",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Alex K",
      "author_url": "https://www.google.com/maps/contrib/105643504606036899658/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUm9dBolDczIJCtW1hfasUgyxEy4NsfKMEFyopEZqQinm5c7BZu=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "𝗖𝗥𝗢𝗪𝗡-ning Glory of Airport Hotels! 🏊‍♂️🩳🩱For an airport hotel, Crowne Plaza Changi really redefines what “transit luxury” looks like. From check-in to check-out, it’s a polished and well-designed experience that genuinely stands out ✨.\n\nAlthough we didn’t have time to use it, the third-floor outdoor pool 🏊‍♀️ looked fantastic – complete with external changing rooms meaning you can take a dip before or after your flight ✈️. Such a clever feature for a transit stop!\n\nThe rooms were perfectly sized, spotless, and thoughtfully designed 🛏️ – no complaints on comfort or layout.\n\nCheck-in was also a breeze – manned by actual people (refreshing these days!) and surprisingly quick compared to other Singapore hotels we stayed at ✅.\n\nBreakfast was great too 🍳 – a well-balanced mix of Western and local favourites. We didn’t go wanting for anything and left very satisfied.\n\nOne of the best perks is the proximity to Jewel 🛍️🌳 – just a 5–10 minute walk from the hotel lobby. Whether it’s grabbing food, seeing the waterfall, or just exploring, it’s a perfect day or night activity before your next flight.\n\nPros:\n🛏️ Comfortable, well-sized rooms\n🏊‍♂️ Rooftop pool with outdoor changing rooms\n🧳 Perfect for layovers and early/late flights\n🍽️ Tasty, varied breakfast\n🚶‍♂️ Easy walk to Jewel – great for shopping, dining, or exploring\n⚡ Fast and friendly check-in process\n\nCons:\nHonestly, none – it’s miles ahead of most airport hotels, especially compared to Tokyo where we’re staying now!\n\nWould 100% stay again. This hotel is a great example of Singapore’s world-class infrastructure, thoughtful design, and efficient service all in one package ⭐",
      "time": 1744966623,
      "translated": false
    },
    {
      "author_name": "Gursevak Singh",
      "author_url": "https://www.google.com/maps/contrib/117473139881298215140/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ5fsQfg8PyS6ajORyUma2KvXfI56CssDeScvwmd-PFKlxt7g=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 4,
      "relative_time_description": "3 weeks ago",
      "text": "I stayed at the Crowne Plaza Changi Airport and had a very comfortable experience overall. The hotel is directly connected to the airport, making it super convenient for layovers or early flights. The design is modern and relaxing, with lots of natural light and a calming atmosphere.\n\nThe room was impressively spacious, especially for an airport hotel. It was well-equipped, clean, and felt luxurious with a large bathroom and comfortable bed—perfect for resting after a long flight.\n\nThe only downside was the breakfast. While the quality and presentation were great, there were no Indian options and very limited vegetarian choices. For such a global hotel catering to international travelers, a bit more variety—especially for vegetarians—would have been appreciated.\n\nStill, the service was professional, the amenities were excellent, and the location can’t be beat. Would recommend it for a relaxing and seamless airport stay, especially if room space is a priority.",
      "time": 1745410743,
      "translated": false
    },
    {
      "author_name": "Anthony Schmitz",
      "author_url": "https://www.google.com/maps/contrib/101830558352534450823/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJeRWznEKTcLPE_jCnO7KN7aMgX3By6ei7sLcjUUrN-jaan2qnX=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "This hotel is conveniently connected to the airport, making access easy. The king-sized room is spacious, featuring a comfortable bed and a stylish ambiance. The front desk staff was very friendly and quick to assist.\n\nHowever, the biggest downside is the price. I wouldn't choose to stay here if it weren't for a business trip where the cost is covered. There’s no reason for a one-bedroom to exceed $300 a night. They don’t even provide chilled bottled water. While there is a filtered water spout in the room, the only ice machine is located on the second floor, requiring guests to go all the way downstairs. This is quite inconvenient and unreasonable for a hotel with such high rates.",
      "time": 1747124099,
      "translated": false
    },
    {
      "author_name": "Lynette Pope",
      "author_url": "https://www.google.com/maps/contrib/108455433898764226517/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIlkytqeHmJqNweIa05u44oglTPSgw-2NfVePXA3fyePWQpFQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "What a beautiful hotel!\nFriendly staff, beautiful decor, very comfortable rooms, fancy bathrooms with privacy lights and amazing views over the airport runways, delicious buffet breakfast and the pool was soooooo beautiful!\n\nThe location is amazing, an easy walk to Terminal 3 and the Jewel where all the food and shopping options are right at your fingertips.\n\nWe will definitely stay here again if we are passing through Singapore. I can absolutely see why the hotel has won so many awards. Very well deserved.",
      "time": 1745674867,
      "translated": false
    },
    {
      "author_name": "Ian",
      "author_url": "https://www.google.com/maps/contrib/101822156993225229645/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXrqdURUiOkZJcI_46u5Duyn60QlJm9R6KaBl-H5mNkfUaSZqSt3g=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Great location if you want to be close to the airport, and the Jewel, although for some reason we had trouble finding our way in from terminal 2 after our flight. Maybe we were tired, but we followed the signs until they disappeared, but couldn't find the entrance to the hotel. We ended up carting our luggage through the maze of walkways, out of the airport, into the Jewel and then somehow ended up in terminal 3 at the airport again, where the entrance was located. I think there could be clearer directions and more signage here.\n\nThe hotel is modern and clean and is popular. All the flight crews seem to stay here.\n\nThe rooms were quite small but very comfortable, especially the bed and pillows. Only basic facilities like tea and coffee, and an ironing board, but I guess that's because the hotel is probably designed for 1 or 2 night stays where people have a quick turnaround before flying out again. It's not really a hotel designed for a week's visit to Singapore as its location is probably too far away from most attractions. However the MRT is located close by which could get you to where you want to go.\n\nWe had breakfast at the buffet, which I wouldn't recommend. They had an assortment of Asian and Western food, but it was disappointing and you could probably do better  if you ventured into the Jewel shopping centre, or basement level 2, where there is plenty to choose from for a cheaper price.\n\nWe had an awesome Margarita in the bar, but be careful you don't get carried away before your flight 😁.\n\nOverall, it was comfortable for a short stopover. Just eat elsewhere to avoid disappointment and hotel priced food.",
      "time": 1743882450,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8403742258347967557",
  "user_ratings_total": 4758,
  "vicinity": "75 Airport Boulevard, #01-01"
}