{
  "formatted_address": "Singapore 578774",
  "geometry": {
    "location": {
      "lat": 1.359803,
      "lng": 103.819582
    },
    "viewport": {
      "northeast": {
        "lat": 1.361108880291502,
        "lng": 103.8209463802915
      },
      "southwest": {
        "lat": 1.358410919708498,
        "lng": 103.8182484197085
      }
    }
  },
  "name": "Daniel Beh Photography",
  "place_id": "ChIJBQaUbaUZ2jERIsRTN7sMPFU",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Abigail Eats",
      "author_url": "https://www.google.com/maps/contrib/115460934006959049602/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVH96w8C9wpqhVYuxa2T9K-J0YEAO3UpO9YWc-22rsQNoKgI4kG=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "7 years ago",
      "text": "It was an absolute joy to have Daniel photograph our wedding day. We've received so many compliments on picking such a great photographer, though much of the credit really goes to him for being one of Singapore's best wedding photographers.\n\nNot only was Daniel utterly professional throughout the entire process (Performing thorough site recces before the big day, setting up meetings to find out more about our photography preferences, and calmly putting my photo-shy parents and husband at ease for example) his photojournalism style was able to accurately convey the fun mood of the occasion.\n\nDaniel is extremely flexible and will do his utmost to photograph everyone in a way that you're most comfortable with once you let him know your preferences. My husband despises having his photo taken, but Daniel was so steady and quick that couple shots were a breeze. On the wedding day itself family and friends all remarked on how gentle and friendly he was, whether coordinating group pictures for over 60 people, or discreetly snapping candid shots of everyone.\n\nMost importantly, the photos from that day turned out amazingly well - we were thrilled with the album, and our guests were too. Vivid and elegant, they really managed to capture the heart of various key moments. We'll be able to look back very fondly on our wedding thanks to Daniel's help.",
      "time": 1504062558,
      "translated": false
    },
    {
      "author_name": "Kwong How Ong",
      "author_url": "https://www.google.com/maps/contrib/109718423994154600186/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUyttRtsrDhwsdVU4u6s4owcIk0GjTtd8-rlWKyMR5vVSSLXMgy=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "7 years ago",
      "text": "If you’re reading this, it means you’re already sold by the high standards of Daniel’s photography. You’ve seen his works and read the reviews by others. But thatʼs barely scratching the surface of what you need from a wedding photographer.\n\nMy wife and I met Daniel after having consulted two other wedding photographers. We liked him immediately. He has such a friendly personality, and from our conversation, we could tell that he has great passion for his craft. It was a world of difference. We placed our deposit on the spot.\n\nOver the months we discussed our Pre-Wedding (PW) and Actual Day (AD) shoot details over email/WhatsApp. Daniel’s response is always very timely. He’s set such a high standard in promptness that we found ourselves doubting our choices of our vendors for other services! And trust me—with so many other moving parts in planning your wedding, the anxiety and frustration from chasing a vendor for a reply is the last thing you need.\n\nDespite being an established and experienced photographer, Daniel is very humble and diligent in his work. He spares no effort in doing site visits so that he can plan ahead and be prepared for the shoot. He is also very helpful in coming up with ideas to make the shoot more interesting. He even dropped by our place to interview us on our family and relatives so that he could capture our event in the angle most meaningful to us.\n\nOn our AD, Daniel was like a supportive friend. He did his job and captured all the right moments, but more importantly, having seen so many weddings, he guided us along and kept us calm when things didn’t turn out the way we planned.\n\nMany people often judge a photographer only by the pictures they produce. But years down the road, your memories of your wedding will inevitably be affected by how you felt on your big day—and the journey leading up to it. Working with Daniel certainly made our wedding journey much more enjoyable. 10/10 would recommend him to anyone in a heartbeat! Thank you Daniel!",
      "time": 1526824024,
      "translated": false
    },
    {
      "author_name": "Joanne Chen",
      "author_url": "https://www.google.com/maps/contrib/104967704319730725056/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVut0S8jFgSTy1d-CPW9iDXB2oalB0W9g3MZz3em_EskPgSfeQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "6 years ago",
      "text": "We got Daniel to shoot our actual day wedding. Daniel was super professional - he met us during our wedding rehearsal to give us some very helpful tips. In addition, he arrived early on the actual day and started shooting. Got the whole set of our edited photos within a month. Loved all the shots he took! Really captured the emotions of all at the wedding!",
      "time": 1556243954,
      "translated": false
    },
    {
      "author_name": "Adeline Chai",
      "author_url": "https://www.google.com/maps/contrib/111469285907345503912/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVpseGiuAukM3uOVTYdWzQnss0X_EDTzeX40eFHEki__97tEno3=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 years ago",
      "text": "We were introduced to Daniel by a close friend of mine who got married the year before us.  My husband has celebral palsy since childhood which affects his muscle control and coordination, making it a chore for him to keep his eyes open and smile before the camera.  Whenever we take selfies, it would often require numerous takes before we could get an almost-perfect shot.  When we met Daniel about 6 months before our wedding, we brought all our concerns to him who simply dismissed them, assuring us that he would take up the “challenge”.  We felt totally comfortable around him as he does not put on any airs despite being an accomplished photographer.  When we met him again on our wedding day (8 Dec 2017), his patience, humility and friendliness touched us.  Even when our friends would ask him to take pictures together with us using their handphones, he did not push them off and would kindly assist.  When we received our photos as well as the beautiful wedding picture montage, we were amazed at how he captured us and our guests and our day so beautifully.  This is a photographer who is passionate at what he does, who works with his heart and takes his profession seriously.  Every photo is a gift and a memory that money cannot buy.  Our heartfelt thanks to Daniel for being our wedding photographer and for being a part of our memories. - Adeline & Michael Ng",
      "time": 1516041253,
      "translated": false
    },
    {
      "author_name": "Jie Ying Lee",
      "author_url": "https://www.google.com/maps/contrib/114323040372392167608/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJIHKno3e_-39Ht_lwq5jG6sjFo_eTeIm1eumKHqfqJfTSy8Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 years ago",
      "text": "Daniel is the most sincere wedding photographer and it can be seen from his beautiful pictures. He took the time to find out more about the personalities of Khang Chiang and I so that we can find the most appropriate location for the photo shoot. Daniel was always generous with his time, coming earlier and staying beyond his stipulated time. We will definitely engage him in future, for our family photoshoot :)",
      "time": 1533802438,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6141797990053168162",
  "user_ratings_total": 11,
  "vicinity": "Singapore"
}