{
  "formatted_address": "11 Choa Chu Kang Street 52, Singapore 689285",
  "geometry": {
    "location": {
      "lat": 1.3950704,
      "lng": 103.7433723
    },
    "viewport": {
      "northeast": {
        "lat": 1.396261280291502,
        "lng": 103.7449704802915
      },
      "southwest": {
        "lat": 1.393563319708498,
        "lng": 103.7422725197085
      }
    }
  },
  "name": "De La Salle School",
  "place_id": "ChIJDwIPVfAR2jERJrA--SqAGN4",
  "rating": 4,
  "reviews": [
    {
      "author_name": "liu taiming",
      "author_url": "https://www.google.com/maps/contrib/108723510076690369766/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIp_00G1SRP8t4g8-am2597pQyHK3wZVy-mPHhHDKkgcQVNbQ=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "As a former student of this school, I have three things to state about it\n1. This school has a terrible administration, the discipline master is known for his unfair punishments besides that the school administration does not provide for many leaderships positions to students and the bureaucracy of the school is very inefficient\n2. The teachers are excellent they are some of the best and the resources they give are great but there are some outliers that ar absolutely horrible teachers that if your child has the displeasure of being taught by them that you have to monitor their well being and check if their are doing well mentally. Speaking of mental health, this school has a great counsellor who is very caring and understanding of every student's needs.\n3. The school has some decent facilities, but they are not the best, the hall has air-conditioning at least, classrooms are quite clean and new with plenty of space.\n\nTo conclude sending your child to this school will guarantee that they receive a good education but due to the high amount of bad influences in this school I strongly recommend that throughout their primary school education here that you ensure they do not fall with the wrong crowd and monitor their well being.\n\nEdit: forgot to include that this school is affiliated with SJI and St Patricks so if your looking to send your children there the COP for affiliated schools for SJI is 12(only for G3) and 22 for St Patricks(G3)",
      "time": 1740475723,
      "translated": false
    },
    {
      "author_name": "alicia",
      "author_url": "https://www.google.com/maps/contrib/104916044309390583955/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIwaxstMvaU9lCbE9OhL90VkTtoRyVGjsupAUjaGPh5xCNz5A=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "this boy from de la salle is so mean i was just taking bus to yew tee and when i was going to reach yew tee this boy flicked his red shirt in his shoulder on my face like…. wts do de la salle not teach their students proper values on how to behave outside?",
      "time": 1739679800,
      "translated": false
    },
    {
      "author_name": "Jovan Ho",
      "author_url": "https://www.google.com/maps/contrib/103405535899664855225/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVcRNTSmhAxUsn6vTNAXWR48_Weqwm3nCOSiiUZNGmT3O1ZkhE=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "no just no this school is really really bad the teachers do absolutely nothing and when it comes to bullying and others their minds just go blank they just do nothing and usually in the morning they always do talks and it’s boring on the outside this school may seem nice but it’s definitely not",
      "time": 1735043795,
      "translated": false
    },
    {
      "author_name": "Tran Thao",
      "author_url": "https://www.google.com/maps/contrib/112369946043170892303/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ7dPh4YS4roscr1EX8dViYN24lQXsPon8sn1OFAKsY6DuHQQ=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "a year ago",
      "text": "I'm from this school it's a very big and beautiful school! But the teachers are really strict.. like if you forget to bring something, THEY WILL BASH YOU. Yes, yes, there are teachers who are chill and cool, but there is alot strict ones, although they don't let you go to the toilet a lot.. (student from 2015), and here's some things (I'm not sure)\n\nArt rooms are big (aircons)\nComputer lab room (aircon can get very cold)\nIf you're p6, you gotta walk all the stairs\nMusic rooms (cold also at least 3/4 music rooms)\nP6 swears (i guess)\n\nFact: My teacher threw my classmates' whole table with all the things on it ",
      "time": 1704542310,
      "translated": false
    },
    {
      "author_name": "Liew You Xuan",
      "author_url": "https://www.google.com/maps/contrib/117041880454440958396/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLtVRAb6_IrnxHMqWftk1dpDNU-V_7oaJTMLhwds-imk4bU5Q=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Stop ruining the schools reputation. As an alumni and current political student from choa chu kang secondary school, I am very disappointed with the attitudes and rumours I've heard and seen ever since I left the school. Why are you still looking down on de la salle school? In fact some reviews were just for jokes only as we were students there. To be honest, each of us have our own different experience. But in the end, I think what matters most is in the end, did the school benefit you and did the school really live up to standards? Pls reflect on this as this may be considered a threat to the students and staff there. To conclude, I will represent my alma mater to deal with you all one by one and I will make sure that nothing like this happens again. Since the school might not be able to see the reviews here, I will moderate all reviews\nStop it ok? Let the school do their own thing man.",
      "time": 1685027809,
      "translated": false
    }
  ],
  "types": [
    "primary_school",
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16003682197919674406",
  "user_ratings_total": 63,
  "vicinity": "11 Choa Chu Kang Street 52, Singapore"
}