{
  "formatted_address": "C-GF-22, ION AXXES, Persiaran Medini Sentral 6, 79250 Iskandar Puteri, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.4073331,
      "lng": 103.6227682
    },
    "viewport": {
      "northeast": {
        "lat": 1.408708680291502,
        "lng": 103.6241500802915
      },
      "southwest": {
        "lat": 1.406010719708498,
        "lng": 103.6214521197085
      }
    }
  },
  "name": "Delicia Medini",
  "place_id": "ChIJD7nMHEgL2jERP7zKddfi8QM",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Ruzaidie Dar Surnik",
      "author_url": "https://www.google.com/maps/contrib/112219867875429759417/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWhqbEY_VjSqQRcpjlCmNhq4eZh70EAHI3T4eN2T-6AAs8XBMw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Delicia lived up to its name! Our first visit was a resounding success. From my satisfying Big Breakfast to my wife's flavorful Lontong Kering with Sambal Sotong, and the girls' happy faces enjoying their Nasi Lemak Ayam Grilled and Lontong Basah with Sambal Kerang, every dish was a hit. Quick service and a tempting menu mean we'll be back for sure to try more. Highly recommend!",
      "time": 1745155388,
      "translated": false
    },
    {
      "author_name": "Nur Syazana Md Shariff",
      "author_url": "https://www.google.com/maps/contrib/100698454702016204566/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXHBFjnleIShv__oLhHI17VVGV2XA-vvbExphszWkKh-7FohBCVIA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "Cute cafe with full of classic Malaysian delights. Highly recommended to try their Asam Pedas and masak Lemak,the broth was rich and well-balanced.",
      "time": 1747375417,
      "translated": false
    },
    {
      "author_name": "syaza nor athirah salleh",
      "author_url": "https://www.google.com/maps/contrib/109117085273206070702/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXvmRCQpvap1wX11-RN9tUguy5kt6Wb2it7h_gXgGLx6jDvDXId=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "The shop has plenty of parking since no one in that area. Service was great staff welcome with smile. Shop has asthetic deco.\n\nOrdered big breakfast. Everything is great to my liking. Bagel with chicken ham and cheese also great my son really like it. We ordered addons hashbrown also great it doesnt oily at all and crunchy!\n\nPrice wise is very cheap compared to every aesthetic cafe in this town. Recommended and will come again!",
      "time": 1739704255,
      "translated": false
    },
    {
      "author_name": "Marie Amira",
      "author_url": "https://www.google.com/maps/contrib/111761153277097722330/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUTroWas2ql_TbweGTl80XNWuPLW7YI-8qDQQDTlaLTt9feET-CpA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "Greeted with the staff with smiles\nParking still alot since its not busy area\nWide choices of menu\nCheap it compares to other places in Medini with sufficient portions and complete condiments.\n\nWhat we ordered:\nBig breakfast\n箝撰ｸ鞘ｭ撰ｸ鞘ｭ撰ｸ鞘ｭ撰ｸ十nSurprisingly it came with beef bacon, nice smokey aroma.\nSalad plain taste but they encounter it with cherry tomatoes that they grilled.\nA bit disappoint with the scrambled, they need to wait another 2-3 seconds more to make it less watery.\nRequested for salt and pepper, it took them 7 minutes to serve me that but only served it using plastic chilli sauce plates. kan membazir gitu. Hope they can look into it and improve 洵ｰ\n\nNasi Lemak Telur\n箝撰ｸ鞘ｭ撰ｸ鞘ｭ撰ｸ鞘ｭ撰ｸ十nIt just remind you of home cooked meals.\nComplete condiments too\nBig portions\nCheap!\n\nSangkaya\n箝撰ｸ鞘ｭ撰ｸ鞘ｭ撰ｸ十nNice portions\nFluffy breads\nThe sangkaya is purely sweet, doesnt have the creamy flavour nor the taste of coconut milk.\n\nLontong Basah Special\n箝撰ｸ鞘ｭ撰ｸ鞘ｭ撰ｸ十nWe couldnt figure out what went wrong with it but something feels off about it.\nBrilliant side, they use nasi lemak's sambal.\nOur assumptions are they didnt put lemongrass and lime leaves inside.\nLontong basah is Indonesian dish its either lime leaves or bay leaves.\nAgain, its just our assumptions.\nThis traditional dish you cant cut corners to it or it will ruin the whole authentic taste.\n\nOverall:\nWe definitely will come again!",
      "time": 1731405600,
      "translated": false
    },
    {
      "author_name": "N.a.d S",
      "author_url": "https://www.google.com/maps/contrib/106508447515282719603/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVXyH2dDHGGGKQQ9PKPyV_w-KRWR2BSLzwILyKzW89YeYk9WtM8=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 2,
      "relative_time_description": "5 months ago",
      "text": "Haish, I hate writing a bad review as I do believe in supporting local eateries but I feel like this needs to be mentioned for future improvement(s).\n\nI dined in with a friend so there were 2 of us. The place was not deserted empty but it wasn't full, there were diners going in after another table finished eating etc. The interior of the place is pretty charming and cute. Nice atmosphere. I discovered this place from IG.\n\nWe ordered lontong basah & lontong kering, coupled with sangkaya. Just as we started eating, we looked at each other and mentioned that there was something wrong with the food, I thought it was the kuah kacang in my lontong but my friend said hers was fine and it's the sayur jawa that has almost or has gone bad. I tried it and I agreed with her, so she just continued eating but put the sayur jawa aside. Everything else was alright especially the paru goreng, it was fried crispy to perfection. When she was almost done with her food, we discussed that she should tell the wait staff so they wouldn't serve it to other customers. The wait staff offered to change the food but she said it's alright as we were almost done anyway and don't want another plate to go wasted. I finished my lontong despite feeling a lil bit queasy in my throat.\n\nThe wait staff was apologetic about the incident. When we paid, we were charged full price for the Lontong Kering despite the sayur jawa gone bad. Of course, I don't expect free food at all, we were happy to pay for what we ate but the least the restaurant could do was deduct the price portion of the sayur jawa gone bad, we didn't eat everything and only had a tiny bite after tasting it.\n\nWhen I went home, I had a bad tummy. I don't know whether it came from me tasting the sayur jawa gone bad from my friend's plate or there was some bad sayur in my lontong which I didn't realize after mixing it together with the kuah lontong. I don't think I will be returning here for a while. Don't let my review deter your visit, it's only for the owner to take note and be more careful. Maybe we were just unlucky.",
      "time": 1733218562,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=284257666523118655",
  "user_ratings_total": 22,
  "vicinity": "C-GF-22, ION AXXES, Persiaran Medini Sentral 6, Iskandar Puteri"
}