{
  "formatted_address": "8 Empress Rd, #01-29 Empress Mall, Singapore 260008",
  "geometry": {
    "location": {
      "lat": 1.3163869,
      "lng": 103.8053655
    },
    "viewport": {
      "northeast": {
        "lat": 1.317940730291502,
        "lng": 103.8066756802915
      },
      "southwest": {
        "lat": 1.315242769708498,
        "lng": 103.8039777197085
      }
    }
  },
  "name": "Dental Werks @ Farrer",
  "place_id": "ChIJAyzd6xEa2jERUTrJOa4aW0o",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Rick Tan",
      "author_url": "https://www.google.com/maps/contrib/114551867167480133467/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKSc26uX2ejGmeKYtbhIHk-2Ab_TvFXexPM-CC7cvLV51PNog=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Had my first appointment at the clinic today with my dentist (Dr. Tan) from the previous clinic. The service provided here was definitely much better than the previous clinic that I had visited. Friendly front desk staff and Dental Assistant. They even have a television for patients to indulge in Netflix during the dental treatment process, making it not only a less stressful environment, but also a pleasant one.\n\nWill be back for my follow up appointments.\n\nUpdate:\nI came back again, this time round for my wisdom tooth extraction. I remember feeling extremely nervous and my legs were shaking tremendously even before I stepped into the clinic. But Dr Tan and her assistant were gentle, patient, and reassuring throughout the whole procedure, helping me to feel more comfortable with dental visits. Even after the procedure, the swelling and pain were not that bad. They can be well managed with the painkillers provided.\n\nJust 3 days after my tooth removal, I was able to return the gym and mats for my training.\n\nHuge thank you and Kudos to the team! 💯🙏",
      "time": 1736589217,
      "translated": false
    },
    {
      "author_name": "Diana Lai",
      "author_url": "https://www.google.com/maps/contrib/108206585799933229972/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXJvlYP0u0wRozFPjv0lYSafa5nMVCIdCuRLMP2Ksj4uchfxcBudQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Dr Ray Tang is an excellent dentist. He took the time to explain every procedure he was doing. His charges are very reasonable given his extensive experiences of 20 years. I would recommend Dr Ray to everyone. He is the best dentist I have ever had.",
      "time": 1708773241,
      "translated": false
    },
    {
      "author_name": "Belle.Beauty_",
      "author_url": "https://www.google.com/maps/contrib/103594920815928928525/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ3DKK2Nk7P38rbhUn2k1aSUn_cX74iUSmNpZ-i8GE-MxQl5w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "I started my braces journey with Dr Ray Tang, I am grateful to have him as my dentist. He made the process as painless for me as possible. Thank you Dr Ray🙂🙂🙂",
      "time": 1725506436,
      "translated": false
    },
    {
      "author_name": "Ethan Tang",
      "author_url": "https://www.google.com/maps/contrib/100611331867162170977/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWGMOGhW1ObPhGULiX8EUkSjlp4oM8zpUY3L0nA22oda5t4bVc4=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Dr Tang is a fantastic dentist. Does so much more than take care of my family’s teeth. Does a full cost breakdown before undergoing treatment as well as offering the most cost effective treatment. Am extremely grateful to him for his service !",
      "time": 1691913511,
      "translated": false
    },
    {
      "author_name": "Magdalene Chia",
      "author_url": "https://www.google.com/maps/contrib/105548099947660489455/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVayOozLsQ9U2VZyYrfAw-oSopiF265GI71ca66VCjlEG4WP_7M=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "I had a really bad toothache and had been seeking various consultations from different dentists, and it just felt like there wasn’t a “solution” until I came across a referral to Dr Ray Tang. Having had bad experiences from 2 diff wisdom tooth extractions with different dental clinics(and never going back there) I’m grateful to have came across Dental Werks, Dr Ray Tang.\n\nI extracted a total of 3 teeth with him in one day, 1 surgical for a impacted molar and 2 normal extraction - and it only took an hour(for all 3) compared to other dental clinics that usually take about an hour per tooth(base on my past experience)\n\nHe will also ask questions in-between the extraction - if any pain is felt and will preempt you of what you would possibly feel during the extraction process.\nHis costs are reasonable for the experience and care you’d get. Definitely in line with Dental Werks mission/vision aims of making quality dental care available to the masses at affordable rates.\n\nPost extraction care: He had predicted(& managed my expectations) I may have some problems healing (as I didn’t bleed enough for my suture to close up properly) and was ready to help affix the problem 3 days post surgery.\n\nDefinitely my choice of dentist that I trust and will go back to - and although I live quite a distance away from his clinic, I will travel for his amazing expertise.\n\nThank you Dental Werks and Doctor Ray Tang for the amazing dental work.",
      "time": 1652171799,
      "translated": false
    }
  ],
  "types": [
    "dentist",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5357905517283457617",
  "user_ratings_total": 18,
  "vicinity": "8 Empress Road, #01-29 Empress Mall"
}