{
  "formatted_address": "112 E Coast Rd, #03-08 i12 Katong, Singapore 428802",
  "geometry": {
    "location": {
      "lat": 1.3052002,
      "lng": 103.9050645
    },
    "viewport": {
      "northeast": {
        "lat": 1.306644380291502,
        "lng": 103.9065360302915
      },
      "southwest": {
        "lat": 1.303946419708498,
        "lng": 103.9038380697085
      }
    }
  },
  "name": "DermAlly Specialist Skin Clinic & Surgery (Katong)",
  "place_id": "ChIJmbXLk1IZ2jER_9gtIS6iA0o",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Advait Naik",
      "author_url": "https://www.google.com/maps/contrib/110402398083641135563/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVH5vre8I3Z5Mbb-GX_DhiAXmo5uzgMq8SBCvt-WuOmprl7Xjpc=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 weeks ago",
      "text": "One of the Most Frustrating Clinic Experiences I've Ever Had!\n(This has been a repeated complain, you can read previous reviews from others as well)\n\nDermally @ I12 Katong has been nothing short of a scheduling nightmare. For a clinic that presumably wants to serve a broad clientele, their extremely limited operating hours—strictly during regular office times—make it nearly impossible for working adults to access care without taking time off work. This is already an inconvenience, but what followed was even worse.\n\nDespite having three doctors on staff, getting an appointment is shockingly difficult. I wasn’t even particular about which doctor I saw—any available one would do. After finally securing a slot for a Tuesday, I received a call the evening before saying it had to be moved to Friday because the doctor was suddenly unavailable. No explanation. Then, midweek, another call—Friday’s appointment was off too because the doctor was now on medical leave.\n\nNow, I completely understand that medical leave happens, but here’s the issue: it is the clinic’s responsibility to manage such situations. There are two other doctors, and I was open to seeing any of them. Why was the default solution to just cancel and reschedule repeatedly?\n\nThe blatant disregard for patients’ time is staggering. They expect complete flexibility from their patients but make zero effort to reciprocate. This level of disorganisation and poor patient management left me with zero confidence in their professionalism, and I ultimately decided not to go ahead with the appointment at all.\n\nDermally really needs to get their act together. Until then, I’d advise others to take their time—and their trust—elsewhere.",
      "time": 1746056382,
      "translated": false
    },
    {
      "author_name": "Yue Woon Hiang",
      "author_url": "https://www.google.com/maps/contrib/100473783806176075071/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIhM22lZ07fTJK2zAmHwIRl4daaMSVM-KkLHuQUo5Vsm62X0A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Dr Kong is so gentle and meticulous (while being super fast) that my procedure didn’t hurt at all and recovered fast. Yvonne is a gem who is polite in her own quiet way but super warm and helpful when you need to reschedule. This is valuable when you have a busy changing work schedule. Thank you ladies for making it all effortless.",
      "time": 1734318516,
      "translated": false
    },
    {
      "author_name": "Hsin Liu",
      "author_url": "https://www.google.com/maps/contrib/112814622532797303166/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKu8mdR8F8bmJuml4gEvhAmZ_PU_K7LntsRvJ91fOc1atCUfA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "The clinic is clean and brightly lit. I brought my kids and the receptionists were very patient and kind with them even when they were making some noise. They were offered biscuits to keep them occupied.\n\nI did a hydra facial and it was so soothing and calm. My skin was clearly more vibrant after the facial!",
      "time": 1733753403,
      "translated": false
    },
    {
      "author_name": "Jovan Tan Gao Wen",
      "author_url": "https://www.google.com/maps/contrib/115067890411999545467/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWnALGRGFgnEmEm_ivJE3hZ0yc-eMfuIgTugGofbIXEUzMKlaSU6A=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Referred by a friend to Dr Kong for my day surgery procedure. Treated by her once and appreciated how smooth and quick the entire process took.\nCame back again for a similar procedure. Clinic was at a different location but more accessible for me. The Reception was prompt and had a very friendly demeanor in handling all my questions.\nDr Kong was warm and professional as ever. I appreciated how she took the time to explain everything and kept checking if i had any further questions, which helped calmed me down quite a bit.\nShe was gentle and reassuring throughout and I was properly stitched up before I knew it.\nHighly recommend if you’re looking for top-notch skills with a personal touch.",
      "time": 1725259479,
      "translated": false
    },
    {
      "author_name": "Ivy Lee",
      "author_url": "https://www.google.com/maps/contrib/106112666248995514715/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJZINl8D8LxsHok80J0efbjDxqoIQGK_sm2sSraaLcY9OEmDA=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "6 months ago",
      "text": "Like what other reviewers said, doctor and clinic environment are good. But, I must say their receptionist is very rude and unfriendly, being the first point of contact at front desk, being friendly, kind and jovial are key to bring warmth and good impression to patients in the clinic, even for a first-time visit patient.  It would be good if the Owner of the clinic can take this into consideration in hiring a suitable yet professional nurse/receptionist to improve their customer service standards.",
      "time": 1731733916,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5333284702745647359",
  "user_ratings_total": 72,
  "vicinity": "112 East Coast Road, #03-08 i12 Katong"
}