{
  "formatted_address": "100G Pasir Panjang Rd, #01-02, #07-18, Singapore 118523",
  "geometry": {
    "location": {
      "lat": 1.2779525,
      "lng": 103.7964482
    },
    "viewport": {
      "northeast": {
        "lat": 1.279332230291502,
        "lng": 103.7976788302915
      },
      "southwest": {
        "lat": 1.276634269708498,
        "lng": 103.7949808697085
      }
    }
  },
  "name": "Dinosaur Speech Therapy - Early Intervention Programme in Singapore",
  "place_id": "ChIJGZPzO_kb2jERhbtfRASj_fM",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Nyka Tan",
      "author_url": "https://www.google.com/maps/contrib/100343454015586188996/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXCWBUNK8GWgpttLX2TfoYALwGbxYOIPntB6VflTUqBnsOlEUT0=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Highly Recommended!\n\nThis school is a true gift for students and families alike.\n\nThe staff, including educators, therapists, and support personnel, are incredibly patient, compassionate, and dedicated to each child's progress. They treat every child with care and respect, ensuring that their individual needs are met through personalized learning plans.\n\nThe interventions have made a noticeable difference in my child’s development. Within a few months, we saw improvements in communication, confidence, and social interaction. It  has provided my child with the tools and confidence to navigate their world and has given us hope for their future success.\n\nWe are truly grateful for the impact this programme has made.\n\nHighly recommended for any family seeking early developmental support for their child. Their detailed daily updates are excellent for tracking and documenting my child's progress.\n\nThank you so much Dinosaur Family! 🙏❤️",
      "time": 1735959516,
      "translated": false
    },
    {
      "author_name": "tammy t",
      "author_url": "https://www.google.com/maps/contrib/107643153160757971352/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVoIgHG6O_pdLeL0EQdE9-XKBuAcxDmvnwv9yUTLK8vIjfwxqGk=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Highly Recommended! My son has been attending Dinosaur Speech Center for both speech and occupational therapy, and we’ve seen obvious improvements in his communication and emotional regulation. He enjoys every session and looks forward to seeing his therapists, Teacher Elizabeth and Teacher Zann, who are not only skilled but also incredibly patient and caring. He likes the Center and calling it his ‘dinosaur school’! We’re truly grateful to the amazing team—thank you for your dedication and hard work!",
      "time": 1739438749,
      "translated": false
    },
    {
      "author_name": "Pia Galvez-Go",
      "author_url": "https://www.google.com/maps/contrib/116595166945662449426/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX1-SEzbnU3LQjeAceLcKpAKRSlwG0LfF6Kd5jOFZuG5sDs_tIQpQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "We initially visited Dinosaur Speech Therapy because of its proximity to our place. We were immediately impressed by the teachers. Both our children did speech therapy and occupational therapy for about a year. We could see notable progress in only a few weeks.\n\nTeacher Zann (OT) always made sessions fun and was very good at motivating the children in doing tasks that would normally be challenging for them. There has been noticeable improvement in their strength, stamina and agility which has translated to them being more active in sports, outdoor play and other kid activities.\n\nTeacher Rebecca (Speech) had a good connection with my 13 year old son who needed  more high level and pragmatic therapy. She was able to help him improve how he communicates in social settings which are very important in the teenage years. She also helped him be able to clearly communicate what he is feeling or thinking by also considering the other person's perspective.\n\nTeacher Jia Ling (Speech) helped my 7 year daughter be a more confident speaker. Aside from helping with pronunciation, Teacher has also helped in developing conversational skills. We could see that our daughter has been putting more thought in what she says and was more focused and engaged during conversations.\n\nStaff and teachers have always been warm and helpful. It has also been easy to communicate with them thru WhatsApp or email.\n\nChoosing this centre was one of the best decisions we have made for our children.  We will truly miss this place (as we are relocating to another country).",
      "time": 1720770286,
      "translated": false
    },
    {
      "author_name": "qinxi chen",
      "author_url": "https://www.google.com/maps/contrib/105938583124518766198/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIjhFZk9yFPh_YFBIPTosaoT6jzrLBig0YbxYAf0DerS2XcaQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Thank you teacher for your hard work. After 20 sessions of treatment, my child has improved from lagging behind to average. I am very grateful and have recommended it to my neighbors.",
      "time": 1739520990,
      "translated": false
    },
    {
      "author_name": "Ain Che",
      "author_url": "https://www.google.com/maps/contrib/101489934622779614035/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJtTG2PXWGpqhHacV_2wPu3j6LamGLLt2Oz_7hqWpsZidJY_g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Sending our daughter to Dino school was really a great decision. She had made very good progress during her stay there. We had been facing challenge recognizing numbers and letters but with the good strategy, patience and dedication from Teacher Yzelle, she was able to recognize some letter and most numbers already. The lessons prepared every session is well-taught of and the materials being used each session are not repeated and very creative which helps catch the attention of the student/child. The updates provided every after class were very detailed which gives parents an idea on the child’s improvement as it comes with photos and pictures. Thank you so much Dino school especially to Teacher Yzelle for helping Chesca! Teaching child with special needs is truly your passion!  ☺️🙏",
      "time": 1732757345,
      "translated": false
    }
  ],
  "types": [
    "school",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17581387759046605701",
  "user_ratings_total": 25,
  "vicinity": "100G Pasir Panjang Road, #01-02, #07-18"
}