{
  "formatted_address": "8 Empress Rd, #01-09, Singapore 260008",
  "geometry": {
    "location": {
      "lat": 1.3165533,
      "lng": 103.8054556
    },
    "viewport": {
      "northeast": {
        "lat": 1.318010880291502,
        "lng": 103.8069874302915
      },
      "southwest": {
        "lat": 1.315312919708498,
        "lng": 103.8042894697085
      }
    }
  },
  "name": "Doctor W Clinic",
  "place_id": "ChIJ65ydwREa2jER8xweqge5Urc",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Kimberly",
      "author_url": "https://www.google.com/maps/contrib/117567554056022311008/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW4bayZmoCHJBNtH3rGycnD52e4NOMWTnqX5OBzUlvXcUYpTOZeWw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I went for the CHAS HPV test as this is located to be the nearest clinic to my place. At first, I saw the bad reviews before me and was like, are they real? Why are so many people upset over this clinic? That’s when I realised that they don’t understand the true value of this clinic. Here are some pointers based on my experience\n\n• Dr Winnie really knows her stuff, she is a certified family doctor and has went for the NUS family doctor exam (which has a passing rate of 40%). Both she and Amy were very gentle during the procedure, better than a gynae I’ve been to before that traumatised me cuz they weren’t gentle 🥲. This clinic is also thorough about privacy and maintaining high cleanliness standards, and the consultation fees are lower than if you were to see a family doctor at the polyclinic.\n\n• My initial wait was quite long as there were a lot of walk-ins (first time there), it was probably a busy day. Since I haven’t eaten breakfast/lunch, I took the opportunity to eat and asked Amy (admin staff) to contact me when I am next in the queue. I really liked this service, all you have to do is approach Amy at the counter :)\n\n• Dr Winnie is very polite and nice. If you ask her things related to your results, she is honest and does not sugarcoat things. I think this quality is important to have as a doctor, and it resonates with me. I don’t need to be reassured, I want to understand what I am going through and how I can live better. I think this is what she intends to convey, and a lot of people misinterpret that as rudeness or something.",
      "time": 1745030404,
      "translated": false
    },
    {
      "author_name": "Astri Novelia",
      "author_url": "https://www.google.com/maps/contrib/104184283862836148211/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWfAN4yHZvaKGRrEg6jM3BCMFLqm0twC6BXGKtxoJiNgBLXVuza=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Told me their price is a bit expensive compare to others because they said \"our medicine comes from Europe\" but the i checked with other pharmacist it is just normal medicine. They just saying rubbish to justify daylight robbing price on a clinic. I wouldn't say the price is expensive but IT'S AN UNREALISTIC. Do not come to this place if you do not want to get robbed.",
      "time": 1744624651,
      "translated": false
    },
    {
      "author_name": "Robert Rigg",
      "author_url": "https://www.google.com/maps/contrib/112206715379286608720/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK5cOZeIkCkNemloAyPho5zIFPo2mSuObQs4DPD8BswoVnFnw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Seen quickly and received an excellent, swift and clearly delivered diagnosis. Was able to buy meds on site and was one the road to recovery in 24 hours. Great job!",
      "time": 1743308194,
      "translated": false
    },
    {
      "author_name": "Daniel Ng",
      "author_url": "https://www.google.com/maps/contrib/100849806377022513298/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK1hkN8C_D21RqGZetc8Dd_PD17WUtiK68gddFtilzPK-QXPA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "I've been visiting Dr Winnie's clinic since end 2020, and it's has been very pleasant and comforting visiting Dr Winnie. She has a wealth of experience in family medicine, and provides great advice and effective medicines for the ailments I have. She's also kind and pleasant, and it always feels like a nice (and informative) chat with her - never rushed or unpleasant. She sometimes says to me, \"I hope I don't see you again so soon...\" - with jest of course - which reflects her principle of providing effective medical care so that patients recover well, and don't have to see her again soon. Would definitely recommend Dr Winnie and the clinic!",
      "time": 1665826831,
      "translated": false
    },
    {
      "author_name": "marilyn chen",
      "author_url": "https://www.google.com/maps/contrib/113332637867271145946/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLPv3c3NY0lfj4gCbOsUTiG9da_LNZdPX9PsMhKAZIwfQzFwA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "I have visited Dr Winne ever since I moved to this area in 2018. Had initially visited her as her clinic was one of my panel clinics in my insurance plan.\n\nHowever I didn’t stop visiting her even when her clinic opted out from the panel later. She is an awesome doctor who diagnose your illness and prescribed the right medication so you don’t need to visit her the second time.  She’s patient, knowledgeable and friendly. Kudos to her for taking care and healing me each time I visited her!",
      "time": 1660105767,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13209824099601095923",
  "user_ratings_total": 91,
  "vicinity": "8 Empress Road, #01-09"
}