{
  "formatted_address": "322 Sumang Walk, #01-05, Singapore 820322",
  "geometry": {
    "location": {
      "lat": 1.4115273,
      "lng": 103.8978229
    },
    "viewport": {
      "northeast": {
        "lat": 1.412730530291502,
        "lng": 103.8992074302915
      },
      "southwest": {
        "lat": 1.410032569708498,
        "lng": 103.8965094697085
      }
    }
  },
  "name": "Domino's Pizza Sumang Walk",
  "place_id": "ChIJKy6biCwV2jERv20WPlxzEkY",
  "rating": 2.4,
  "reviews": [
    {
      "author_name": "- -- -",
      "author_url": "https://www.google.com/maps/contrib/105470987284095657704/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK6_jzBjqviHBF1FMWtr6utV49xoqs1r9sWeyxyJW6vuABdBg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Horrible delivery experience, worst i have ever experienced in SG and other countries.\n\nOrdered pizza approx 1.5hrs in advance for delivery at 6.30pm.\n\nFood was finally delivered 45mins late. No accountability from the restaurant, calls were unanswered and no updates provided.\n\nWhen i asked the delivery rider, he said he only received the call around 7.03pm, which was 15min prior to his arrival.\n\nIt takes about 10mins to travel from Sumang to my house on car/motorbike.\n\nDominos should save money on advertisements and work on improving the operations first.\n\nPizza delivered was underwhelming, with just a few pieces of meat on top.\n\nThis will be the first and last time im ordering anything from Dominos.\n\nShould have read the reviews here first before ordering anything. The replies from management seem to be simply paying lip service. From the reviews, it is apparent that nothing has been done to \"provide top-notch quality and customer satisfaction\".\n\nDont bother asking customers to submit feedback if there isnt any intention to improve in the first place.",
      "time": 1743253435,
      "translated": false
    },
    {
      "author_name": "Jabbit Melody",
      "author_url": "https://www.google.com/maps/contrib/117250017780328856822/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIdxTnOKR7Iauy5YVWMfYT8LcA98ihntVTC_GqDBJYR3iWWoE0=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "I’m writing to raise a serious concern regarding an order I placed on Vesak Day, 12 May 2025. The order was delivered on time at 6:30 PM, and I appreciate the prompt service.\n\nI had ordered 1x Simply Cheese and 1x Romano Margherita. To my dismay, I discovered a piece of pineapple on the Romano Margherita. Initially, I let it slide. However, I then found a slice of ham and a cube of chopped ham on the same pizza which was extremely disappointing, especially since I deliberately chose a non-meat option for this occasion. I have clear photo evidence of this.\n\nAdditionally, this isn’t the first time I’ve noticed bits of cardboard shreds stuck to the bottom of the pizza. I let it go previously (6 May 2025’s order), but this time, the fragments were quite noticeable and affected the quality of the food. It raises questions about the standard of your packaging and overall food safety.\n\nWhat makes this even more concerning is that my young niece and nephew also ate the pizza. I sincerely hope no issues arise from this, but if anything does, I will not hesitate to escalate the matter further.\n\nI’ve been a regular customer and have always enjoyed your pizzas, but this experience was unacceptable. I hope this feedback is taken seriously.\n\nAlas, I am requesting a formal explanation and would like to know how your team intends to address this issue. Please provide an update on what actions will be taken to prevent this from happening again, and how you plan to make this right.\n\nI look forward to your prompt response.",
      "time": 1747099098,
      "translated": false
    },
    {
      "author_name": "Lisa T",
      "author_url": "https://www.google.com/maps/contrib/101998729191684176802/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKeFDn-duE5HzLALt3mTye4XszHrfF9fRpqiWBTJTWMWw1BhWY=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "First of all, pizzas were piping hot when we ate here and did not wait long for our order. Golden prawns with thin crust was very YUMMY and prawns were sweet and plump. Hawaiian had too much tomatoes at the base but the cheese on the side crust was good. Wish there could be more pineapple and toppings.",
      "time": 1740401903,
      "translated": false
    },
    {
      "author_name": "Shaun Tan Hong Xin",
      "author_url": "https://www.google.com/maps/contrib/104500354755450979378/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ0zA0VNWfQSV36ttQSOERKnH8WdeEvpWdEIkZ10Rfq97SqLSw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Food was bad and cold. Ordered at 749pm, order only came at 915pm. Understandable is peak hour timing but delivery was so long. The worse part wasnt even in the late delivery, i basically paid $60 just to get everything i didnt order. Requested for refund but to no avail. What a joke😂",
      "time": 1743263884,
      "translated": false
    },
    {
      "author_name": "Vina",
      "author_url": "https://www.google.com/maps/contrib/115515985734962345871/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJOXEwGn6vSOVcJi5dQ6TVhLsxKar7gpdkrYxIX8bJ9XbWj-g=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "2 weeks ago",
      "text": "Badly made pizza.\nThe sauce and cheese were unevenly distributed.\nThe slices were uneven and didn’t cut through properly. We had to tore the dough apart!!\n\nI’d rather wait for 5 more minutes to have these done properly.",
      "time": 1746097326,
      "translated": false
    }
  ],
  "types": [
    "meal_delivery",
    "meal_takeaway",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5049224972251590079",
  "user_ratings_total": 267,
  "vicinity": "322 Sumang Walk, #01-05"
}