{
  "formatted_address": "25 Changi South Street 1, Singapore 486059",
  "geometry": {
    "location": {
      "lat": 1.3391206,
      "lng": 103.9715626
    },
    "viewport": {
      "northeast": {
        "lat": 1.340560930291502,
        "lng": 103.9727784802915
      },
      "southwest": {
        "lat": 1.337862969708498,
        "lng": 103.9700805197085
      }
    }
  },
  "name": "DPEX Worldwide Express (S) Pte Ltd",
  "place_id": "ChIJp3M1J9E82jERKKAln5eCq7E",
  "rating": 1.7,
  "reviews": [
    {
      "author_name": "Wilson Chang",
      "author_url": "https://www.google.com/maps/contrib/102589058598808274925/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL-vSXjFi0PgWtWv9WneTaljLWq2hldwR7n8loebb8nf3h2GWAe=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Unsure of the negative reviews by others.. ! But for me, I'm very fortunate to have this Uncle David from DPEX courier to hand deliver my time-sensitive and important packages from KrisShop online shopping.\n\nUncle David is very courteous, very punctual and never late in delivering my packages to Jurong. For this, I'm very thankful 🙏\n\nDPEX courier also provides a pre-delivery tracking notification via sms which is very helpful in knowing when to expect my parcel delivery.\n\nSee attached photos. For this KrisShop Order, I placed my order on Friday 10th December 2021 night and received via DPEX express courier on Monday 13th December 2021 at noon time.\n\nDPEX Worldwide Express is located in 25 Changi South Street 1, Singapore.\n\nRecommended\n(for DPEX Uncle David)\n⭐ ⭐ ⭐⭐⭐",
      "time": 1639373160,
      "translated": false
    },
    {
      "author_name": "Daniel Kiang",
      "author_url": "https://www.google.com/maps/contrib/100223420825612770336/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUsDbaYYIGGIpXWnPpv4fUn9eIcx9RBEtwomrEGogk-kiyCdwjX=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "Terrible service, i opened the door and asked who is the parcel for? Instead communicating with you he just dump the parcel at the side and take a photo of you. The guy is just couldn’t talk not a single word.",
      "time": 1735291348,
      "translated": false
    },
    {
      "author_name": "nimali weerasena",
      "author_url": "https://www.google.com/maps/contrib/117416508748290496362/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWtN9qFt2vmHYbLqS1ZqU4G4W1WbiBSBM3S492IQmuF0v1XwIJ4=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "7 months ago",
      "text": "Very bad this service my parcel haven’t delivered in home and they lied they said, that call is we no answer but they didn’t call us. Very bad we paid money to time to delivered but take money only service very bad.plz  Don’t use any more this service. 😡",
      "time": 1729080234,
      "translated": false
    },
    {
      "author_name": "Jesica Soefendy",
      "author_url": "https://www.google.com/maps/contrib/112237635627267211505/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIsDDWbiOLAlMmc3XRYNQMRbdmnKjO9cyKpxN9ohiiOKJk41Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "After reading all the reviews, I was sooo restless the whole time waiting for my parcel. I called them a total of 3 times. The first 2 times the lady assisting me was super kind and patient, so different from what I’ve heard from here. The 3rd time, however, the lady was quite rude and she seemed to want to end the call as soon as possible. I wanted to arrange for pickup after reading the reviews but when I called them to inform that, my parcel is already out for delivery. I them at around 12pm and they said my parcel will be delivered by 7pm. So the whole time I was so anxious but at 1.30pm a delivery man called me and my package arrived safely!!\n\nIf you’ve read so far, I advise you to just stop reading the reviews and scare yourself even further. I’m not saying bad things can’t happen to you but it’s better that you don’t know the bad reviews and just be nonchalant about things compared to being stressed about it 😄",
      "time": 1609739771,
      "translated": false
    },
    {
      "author_name": "Lafayette Estelle",
      "author_url": "https://www.google.com/maps/contrib/108588469947246715665/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJmNVjvsI72R3fkB-aWh9iZ3Z6gf6viixL8eqaxgoxeoB-iIw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "I would like to let people know of my positive experience when I unwittingly got Dpex as my domestic courier.\n\nOn 2nd September 2020. My parcel arrived at Singapore custom.\n\nBut my parcel which was imported from Japan contains dutiable goods (DVD) which I bought online and so it was being held in custom.\n\nSir Bernadette Caldea, the person who is in charge of the import clearance, was very responsive. He first sent a message via sms, instructing me to confirm my parcel in custom via email.\n\nSo I did, sent him an email specifying who I am and my tracking number for reference and such.\n\nThere were around ten emails sent back and forth between me and Sir Bernadette on questions regarding the items of my parcel and the cost that needs to be pay (GST, Permit) and so on.\n\nAt the last email, he let me know that the estimated delivery is the next day.\n\nSo, today, 3rd September 2020, with anticipation and fear. I waited for the delivery. I input my tracking number in the dpex website's under track and trace and saw that the Custom clearance was completed at 12am while it was out for delivery at 08.36am.\n\nI'm a little skeptical and anxious, when the delivery has yet to arrive when it is 5.30pm. But at around close to 6pm, around 5.58pm or so. The doorbell rang.\n\nThe delivery man was an elderly malay man. He was kind and handle my parcel with care. Since the items inside weren't damage at all and the outer appearance of the box is as good as new.\n\nI was surprised by the negative feedback Dpex received here. And, it was the reason why I became anxious and fearful as I continue to read the others feedback when I knew that I've gotten Dpex as my domestic carrier.\n\nPerhaps I was fortunate to get both a responsive employee and a responsible delivery man in comparison to others here with the bad experience who gotten an irresponsible employee to tend to their enquiries.",
      "time": 1599133759,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12802469953452482600",
  "user_ratings_total": 258,
  "vicinity": "25 Changi South Street 1"
}