{
  "formatted_address": "Gleneagles Medical Centre #10-05, 6 Napier Road, Singapore 258499",
  "geometry": {
    "location": {
      "lat": 1.307185,
      "lng": 103.820141
    },
    "viewport": {
      "northeast": {
        "lat": 1.308572080291502,
        "lng": 103.8214764802915
      },
      "southwest": {
        "lat": 1.305874119708498,
        "lng": 103.8187785197085
      }
    }
  },
  "name": "Dr Adrian Wang Psychiatric and Counselling Care",
  "place_id": "ChIJ53bhbiAa2jERAT1jxB5ZzAk",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Flo Yeow",
      "author_url": "https://www.google.com/maps/contrib/101597484841229205770/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUCED0nHINoONtoIhYrg_037nt9gzG8G4ZOxJ3RLinEhCioWYU8hrs=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Dr. Adrian Wang's patient, empathetic, and thoughtful approach, as highlighted by many patients, resonated with my own experience. His professional recommendations were delivered with careful word choice, and he took the time to explain relevant concepts and address my questions thoroughly. It felt as if he truly understood my situation. My therapist at Counseling Perspective recommended him, and I can now see why.",
      "time": 1742656726,
      "translated": false
    },
    {
      "author_name": "aditi brandon",
      "author_url": "https://www.google.com/maps/contrib/114879406403168106787/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU8g1hI4QYgHPnAo2PrY6i-HOCAX7rBMylHM-KKeIbL9AcpzY2X=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "As someone who has been through the public system and a couple other psychiatrists, I have to say that Doctor Adrian is a wonderful psychiatrist who is consummate professional, prompt and understanding.\n\nI began seeing him in December of 2022 and he was very clear in his explanations for my condition as well as the medications and treatment options that I should explore.\n\nThroughout the time I have seen Dr Adrian, my condition has improved and i've also come to realise what is necessary for my mental health with my condition, both of which have positively impacted my quality of life. Every appointment was useful and informative for me.\n\nI highly recommend anyone who needs to see a psychiatrist to see Doctor Adrian at their earliest convenience.",
      "time": 1729484979,
      "translated": false
    },
    {
      "author_name": "EunKyung Shim",
      "author_url": "https://www.google.com/maps/contrib/117372200900528902883/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW8oPKYq5GopihuE2heoiZe3P76r19eB6yyr5jCMoKtP3SZb4M=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "The doctor takes time to attentively, empathetically listen to your story. I also got the feeling that he is concerned about ensuring that the patient is given appropriate meds without facing too much side effects - i.e. careful dosage and type prescriptions from the get go. I am glad I saw this doctor based on my friend's recommendation - I have likewise been recommending him to other friends as well. Grateful to have had his attentive care all this year.",
      "time": 1723517004,
      "translated": false
    },
    {
      "author_name": "Wai Kit Woo",
      "author_url": "https://www.google.com/maps/contrib/109929391060843433529/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLYPkgMfbOtk6RcR2V48HIGtryDZMdLIAvntfvPNKoZXxDGdg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I am writing to express my deepest gratitude for the exceptional care and support you have provided me during my journey through depression.\n\nYour commitment to my well-being has made a profound impact on my life, and I feel compelled to acknowledge your unwavering dedication to your profession. From our initial consultations to the ongoing treatment, your empathy, understanding, and honest advice have been instrumental in guiding me through the challenges of managing depression.\n\nI am truly grateful to have had you as my doctor, and I believe that your dedication makes a significant difference in the lives of many. Your passion for helping others shines through, and I am fortunate to have benefited from your expertise.\n\nWishing you continued success in your practice and in making a positive difference in the lives of others.",
      "time": 1707126921,
      "translated": false
    },
    {
      "author_name": "Hui Ling",
      "author_url": "https://www.google.com/maps/contrib/103303186898011273791/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJD1JVEbtNCHHktrZbXMs1cstMJ035McflpclkfkBJNJHdr_w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Dr Wang is welcoming and willing to listen to your concerns. He selects the most appropriate medications according to the symptoms that you are having. His sincere care towards his patients probably explains why his clinic is so busy. The clinic assistant Josephine is also very patient and explains the medications to you in an easy to understand manner.",
      "time": 1707831135,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=706037230269054209",
  "user_ratings_total": 33,
  "vicinity": "Gleneagles Medical Centre #10-05, 6 Napier Road"
}