{
  "formatted_address": "158 Bedok South Ave 3, #01-581, Singapore 460158",
  "geometry": {
    "location": {
      "lat": 1.318787,
      "lng": 103.9450695
    },
    "viewport": {
      "northeast": {
        "lat": 1.320125880291502,
        "lng": 103.9464943802915
      },
      "southwest": {
        "lat": 1.317427919708498,
        "lng": 103.9437964197085
      }
    }
  },
  "name": "Dr Chio Aesthetics Singapore",
  "place_id": "ChIJPzsXxGsZ2jERIhmwW6GQcoo",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Md Shawwal Will Abd Lau",
      "author_url": "https://www.google.com/maps/contrib/105338179107493396457/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVKluDav5uXKug1jLq0lI0s6X0MmDxPz8mVbeYbf_QE5lVNADY=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I'm really glad to say that the facial treatment I'd received at Dr Chio Aesthetic & Laser Centre @ Orchard is certainly very good!\n\nI've always had a very bad facial complexion. I've tried many products but it didn't help.\n\nHowever, after my very first treatment at Dr Chio's, I can see the vast improvement the treatment has done to my skin!\n\nI felt the treatment has lighten my melasma and pimple scars. Definitely has reduced the occurrence of pimples on my face. The treatment has also helped improved my skin condition with less redness and oilyness on my face!\n\nThe doctors and staffs are very friendly and  professional. I felt really welcomed at the clinic. Thank you everyone for your great attitude and VIP service you guys have provided me!\n\nThere is a staff by the name of Agnes,  whom I wish to mentioned especially. She is very courteous and sincere with her service. Knowledgeable and always very patient with explaining and answering my questions. Thank you Agnes! Keep up the good work!\n\nI will definitely highly recommend anyone and everyone to Dr Chio's clinic at Orchard!\n\nI shall look forward to seeing you guys again!",
      "time": 1692164298,
      "translated": false
    },
    {
      "author_name": "Jen Fox",
      "author_url": "https://www.google.com/maps/contrib/104399993746153371136/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVMHGQ-eAGz4nYXkxH8qTSHeJfjAIl-bhGa8JjQFpdXpmaUPbHO=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "3 months ago",
      "text": "Wife went after 6, was told she had zero fever. Went back took her temps under the pits and tongue, 38 degrees\n\nNext day she developed sore throat and visibly sore and swollen throat\n\nAvoid this even if you’re desperate, just go further away or the better True medical or veteran of the area, Tanamerah\n\nIf you’re looking for laser treatment sure, but for flu, cold and fever which are more life complicated\n\nWouldn’t call it a sham but a practise trial for their less than capable practitioners\n\nOh and the reason why it’s “ highly rated”? Take a closer look at those high raters and the number of reviews and how “new”",
      "time": 1738982103,
      "translated": false
    },
    {
      "author_name": "Siti A",
      "author_url": "https://www.google.com/maps/contrib/108679912756757430583/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVQLn20Qs9RO4c-MTy0P9vHqehXrF64qxpboCbC2Q5iV8z6lFkx=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Love my results! enjoyed my experience here, staff were professional and friendly. Doctor Chio was great and very experienced. he’s patience as he listens to my facial concerns, at the same time took time to advise what my facial actually needs, highly recommended!",
      "time": 1730559229,
      "translated": false
    },
    {
      "author_name": "Sandro",
      "author_url": "https://www.google.com/maps/contrib/108824710679303539078/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVVdL8tcso4sUb_Cai7Q_Lp9Cu4RqY7xJkNggFnbWWfSuZ4dbZVTA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "I do not  recommend this place. They charged me $50 \"consultation fee\" for inquire about the prices. They said that if I don't take the treatment they need to charge a consultation fee, and showed me a small sign that was on the table, however before the \"consultation\" (that took probably 5 minutes) they never mentioned about the charge. Tried to lie to me saying that is always like that everywhere, when it is not, since it is not the first time I attend one of these centers.\nI didn't had much time to argue, so for this time I just paid the amount and left.\nIn honest places you are not charged for asking prices (how you will acquire the service then?), or at least you are warned in advanced about a possible \"consultation fee\" you will be charged if you don't take the treatment.",
      "time": 1732382869,
      "translated": false
    },
    {
      "author_name": "Stella matteo",
      "author_url": "https://www.google.com/maps/contrib/115655160124413991153/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIVtwr1zWO21iSaskjsUHhpXqG1FLDEgszD4gQ-Sz4vqZDNBw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I have to say as a first timer doing facial enhancer, this place definitely reassured my fear in needles and explaining everything in details to the procedure i wanted to have. Dr. James Goh was so patient with me and explaining everything and suggesting what’s best for me.\nThe procedure was so quick and surprisingly no pain maybe a tiny small like ants bite feeling and some pressure but really its nothing.\nThank you so much Dr. James Goh for making me look beautiful 😍\nAlso i have to mention the staff Agnes and Ginny they are so accommodating with me and not pussy on selling. What a pleasant experience. Definitely will see u guys soon.",
      "time": 1734795994,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9976195147281471778",
  "user_ratings_total": 183,
  "vicinity": "158 Bedok South Avenue 3, #01-581"
}