{
  "formatted_address": "101 Irrawaddy Rd, #15-12 Royal Square Medical Centre, Singapore 329565",
  "geometry": {
    "location": {
      "lat": 1.3206053,
      "lng": 103.8432372
    },
    "viewport": {
      "northeast": {
        "lat": 1.322038230291502,
        "lng": 103.8445538802915
      },
      "southwest": {
        "lat": 1.319340269708498,
        "lng": 103.8418559197085
      }
    }
  },
  "name": "Dr Chong Kids Medical & Eczema Clinic",
  "place_id": "ChIJf3-GzOgZ2jER2oDmtLOcPow",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Peppy Lang",
      "author_url": "https://www.google.com/maps/contrib/118317340884054351751/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKNTR7DvvHYsoy3cTVOBldOn-aelIdDtHqn_ziSHN3x1tTGlA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Dr. Chong was incredible with my child, who is usually very anxious about injections. He made sure my child felt comfortable and reassured, explaining everything gently. The injection itself was so quick – done in the blink of an eye! Beyond that, Dr. Chong was very thorough in the check-up, addressing all our questions and showing great care. We’re so grateful for his skill and kindness! Highly recommend for anyone looking for a truly patient-centered doctor.",
      "time": 1730128255,
      "translated": false
    },
    {
      "author_name": "Donmet Cherry",
      "author_url": "https://www.google.com/maps/contrib/108010645135474256011/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIjwx3uYAVBkqgPTrQuNHNyLMOvWduQ4CVaPWtSdYZo8QXNxQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I am sharing my experience with Dr. Chong, our pediatrician, who has consistently provided exceptional care for my children. From our very first visit, it was clear that Dr. Chong is not only a highly skilled professional but also a genuinely kind and compassionate individual.\nDr. Chong takes the time to explain the vaccination process in a way that is easy to understand, alleviating any fears my children might have. His calm demeanor and warm approach make every visit enjoyable, transforming what could be a stressful experience into one that is reassuring and even fun for the kids.\nWhat I appreciate most is his attentiveness. He listens carefully to any concerns I may have and provides thoughtful, evidence-based answers. He truly cares about the well-being of his patients and their families.\nThe clinic environment is welcoming and child-friendly, which makes a big difference. The staff is also wonderful and supportive.\nOverall, I wholeheartedly recommend Dr. Chong to any parent seeking a pediatrician who combines professionalism with genuine kindness. Knowing my children are in such capable hands gives me peace of mind. Thank you, Dr. Chong!",
      "time": 1730125103,
      "translated": false
    },
    {
      "author_name": "Jessica XC",
      "author_url": "https://www.google.com/maps/contrib/108729380229513696709/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXqSMlExeDIyP6jxkoB123Z9NQ7Mz4qZxFnjToDtdmRxhQWmciC=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Dr Chong is patient, friendly and professional and very knowledgeable about Eczema treatment. He is able to address our queries and insightful sharing. He is bilingual and speaks fluent Mandarin and English. We visited him and Eczema healed very fast with his medication cream (within 2-3 days) and recommended moisturisers! He also let you pick the range that your child is most comfortable with. We were very amazed by the good results. Dr Chong is a gem!  Service is very good and clinic is  colourful and fun.  His clinic has many testimonials from patients. Service staff is very friendly. Super grateful! First consultation fee is $180. Clinic also accepts CDA/baby bonus card payment.\n\nHis webinar is informative and a good watch before visiting him so that save time and ask questions during the consultation:\nhttps://youtu.be/eHeOIxl7DK8?si=x8Vd8sRlWfizO0qu",
      "time": 1710221170,
      "translated": false
    },
    {
      "author_name": "Alvin Chin",
      "author_url": "https://www.google.com/maps/contrib/108202995657884577537/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUkVe_VoxLwWlSzbXCZe4FM8X-YMGdld-y_vpNWhoZ0P4N3caWrSw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Doctors generally align in their diagnosis and prescribe almost similarly but there is something about Dr Chong that makes him stand out amongst paediatricians and dermatologists. Happy to have found him again after 6 years, especially him having his own practice.",
      "time": 1745565267,
      "translated": false
    },
    {
      "author_name": "Nurul Atiqah Yusri",
      "author_url": "https://www.google.com/maps/contrib/107928257195271478092/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWHSVYbQ7HwxOlnW3VH3LpdXnYcwUg-179id45qsHe7Bq91y-f2=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "We are extremely grateful to have found Dr Chong! Our sweet little girl had a bad baby eczema. Dr Chong examined thoroughly and advised us with specific details on how to treat it. We were so happy to see much improvement on our baby girl’s skin!!!\n\nNurse Ras and PJ were very helpful and made us feel comfortable. All in all, it was a fantastic experience and I guessed we have found our favourite paediatrician for our daughter!",
      "time": 1696216131,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10105686909514055898",
  "user_ratings_total": 42,
  "vicinity": "101 Irrawaddy Road, #15-12 Royal Square Medical Centre, Singapore"
}