{
  "formatted_address": "Mount Alvernia Hospital, 820 Thomson Rd Level 2, #02-81 St. Anne Mother & Child Centre, Singapore 574623",
  "geometry": {
    "location": {
      "lat": 1.3420912,
      "lng": 103.8388782
    },
    "viewport": {
      "northeast": {
        "lat": 1.343327580291502,
        "lng": 103.8403957802915
      },
      "southwest": {
        "lat": 1.340629619708498,
        "lng": 103.8376978197085
      }
    }
  },
  "name": "Dr Yeo Tong Hong - Paediatric & Neurology Clinic",
  "place_id": "ChIJwVsH8Z8X2jER573eN6qMheU",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "J C",
      "author_url": "https://www.google.com/maps/contrib/116378783802395817469/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVGF1V50OIcyTbakrBwm3ovj7jVspnrlNUrCNXv7IPwSvZ3B1Xr=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Dr. Yeo is an exceptional pediatrician who has made a significant positive impact on our family. From the very first visit, it was clear that he genuinely cares about the well-being of children. Dr. Yeo is not only highly knowledgeable and professional but also warm, patient, and approachable, which makes both parents and children feel at ease.\n\nWhat stands out most is his ability to explain medical information in a way that’s easy to understand, without ever making us feel rushed. He takes the time to listen to our concerns and answers all our questions with patience and empathy. Our child always feels comfortable during appointments, thanks to his friendly and reassuring demeanor.",
      "time": 1742176154,
      "translated": false
    },
    {
      "author_name": "Ng Yu Ning",
      "author_url": "https://www.google.com/maps/contrib/105847607314964794916/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ5hGQd1ca_gdfodpS00te0plSbfNZVbM2qtsA22XPqu7CJDA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Dr Yeo has been very patient from the start till the end and is very knowledgeable. He provides good advice and options for parents, and breaks information down to digest-able parts. My family and I are grateful for the level of care given to my son.\n\nClinic staff are super friendly and approachable! Thanks to the team as well!",
      "time": 1742803156,
      "translated": false
    },
    {
      "author_name": "Letty Lian",
      "author_url": "https://www.google.com/maps/contrib/108873241078466828915/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIbHfMrjdXquy4H1HhqtfCbUom6KFel6RfBx_mE53XDT7s5wg=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "3 weeks ago",
      "text": "This review concerns the communication and administrative professionalism at Dr. Yeo’s clinic.\n\nOn 24/04/25 at 10.30am, I arrived for my child’s scheduled appointment only to be informed at the clinic that Dr. Yeo was unavailable due to illness.\n\nWhen I inquired why I had not been notified in advance, a nurse stated that an attempt to contact me via phone was made, but there was no answer. I confirmed that I had not received any calls from the clinic. The nurse then suggested the possibility of a wrong number being dialed and mentioned that Dr. Yeo had been unwell since the previous day.\n\nIt is worth noting that I did receive a text message confirmation of the appointment prior to this incident. Given this successful prior communication, a text message informing me of the cancellation would have been a reasonable and efficient means of contact, especially with 24 hours' notice of the doctor's absence. However, no such notification was received.\n\nTo further verify the clinic's claim of a phone call, I checked my call logs, which showed no missed calls from the clinic's number. Subsequently, I sent a text message to the clinic requesting the date and time of their alleged call. The clinic responded with a text stating, 'Hi mum, sincerely apologize, we have checked on our end we did not inform you ahead that Dr Yeo is unavailable today.' This confirms that no prior notification of the cancellation was sent!\n\nWhile a new appointment was offered, the details provided for the rescheduled date and day were inaccurate.\n\nIn conclusion, while I acknowledge Dr. Yeo's skill and compassionate approach, my experience highlights significant areas for improvement in the clinic’s administrative processes and communication protocols.",
      "time": 1745485400,
      "translated": false
    },
    {
      "author_name": "Crystal Ting",
      "author_url": "https://www.google.com/maps/contrib/111858430653605544095/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLt2cUD3G_3UXBy7AUKXlCaoTGQxmpTMU7hI1fZuBSOOt1s0w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I’m grateful for the excellent care my daughter received at Dr. Yeo Clinic. The front desk staffs are warm and attentive. My daughter was hospitalized twice due to a viral infection, and Dr. Yeo provided exceptional care, always taking the time to explain things clearly. The whole team was supportive and professional throughout her recovery. I highly recommend Dr. Yeo Clinic for anyone seeking compassionate and expert care.",
      "time": 1741675853,
      "translated": false
    },
    {
      "author_name": "Janice Chin",
      "author_url": "https://www.google.com/maps/contrib/100361631063697139381/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLqxIxG9uBwi4J2yxXCmfUe27wQOPHnvUaEFbLQWvw4MmmB=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "We are incredibly grateful to Doctor Yeo and his team for their exceptional care and support in managing our son's unprovoked seizure. After the episode, our son began showing signs of abnormalities, which I promptly shared with the team via chat. They quickly escalated the matter to Doctor Yeo, who recognized the urgency and brought him in for immediate checks. Doctor Yeo conducted a thorough examination, ensuring there were no major concerns. His meticulous approach and reassuring demeanor gave us immense peace of mind. The follow-up care has been equally outstanding, and we truly appreciate the continued attention to our son's wellbeing.",
      "time": 1729671999,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16538779869297688039",
  "user_ratings_total": 38,
  "vicinity": "Mount Alvernia Hospital, 820 Thomson Rd Level 2, #02-81 St. Anne Mother & Child Centre"
}