{
  "formatted_address": "Mount Faber Rd, Level 2 Mount Faber Peak Singapore, 109, Singapore 099203",
  "geometry": {
    "location": {
      "lat": 1.2713774,
      "lng": 103.8192945
    },
    "viewport": {
      "northeast": {
        "lat": 1.272641030291502,
        "lng": 103.8208482302915
      },
      "southwest": {
        "lat": 1.269943069708498,
        "lng": 103.8181502697085
      }
    }
  },
  "name": "Dusk @ Mount Faber Peak",
  "place_id": "ChIJTa5Gxd8b2jERJkyx1H654CU",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Ramen, hot pot KRUB",
      "author_url": "https://www.google.com/maps/contrib/118313226983921129918/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKaKqo5FPnJjwTxyFahiETKF2Cjz3BgEU7_De2uM6afjPauig=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "I recently dined at Dusk @ Mount Faber Peak and was blown away by the exceptional experience, thanks to David’s outstanding service and photography skills. David’s warm, attentive approach made us feel like VIPs from the moment we arrived. He anticipated our every need, ensuring our evening was seamless and memorable.\n\nWhat truly set David apart was his incredible talent for capturing our dining experience using just my iPhone. His photography directions were nothing short of genius—better than many professional shoots I’ve seen. He expertly guided us on angles, lighting, and framing, turning simple shots of the stunning dishes and breathtaking views into magazine-worthy photos. The food at Dusk was a delight, with each plate as flavorful as it was beautifully presented, perfectly complementing the vibrant atmosphere and panoramic sunset vistas.\n\nDavid’s passion and creativity elevated our night to something truly special. If you’re dining at Dusk, ask for David—you’ll leave with not just a satisfied palate but a collection of unforgettable photos. Highly recommend!",
      "time": 1747099905,
      "translated": false
    },
    {
      "author_name": "Nicholas Hoon",
      "author_url": "https://www.google.com/maps/contrib/102562712308456671903/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW1d1mp6UgSxHuDPI-PE9G-wxX_AOEnyzfkyE_KuTuj8xcMLwtY=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "My wife and I visited to celebrate our anniversary, and it turned out to be a wonderful evening with stunning views. The food was outstanding — the staff offered plenty of great recommendations, and the dishes we chose were fantastic. We had salmon and beef for our mains, and we couldn’t get enough of the chocolate cake and cocktails. The staff were incredibly friendly, welcoming, and always eager to help. Enjoyed our evening to the max!",
      "time": 1746277120,
      "translated": false
    },
    {
      "author_name": "Alexander John Villanueva",
      "author_url": "https://www.google.com/maps/contrib/110816087744874093034/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVXxwEMS-pbGtMCHxTc_kJIMbjI2CL0TCa4tKCZ6cONquyAhLg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Loved it here. Everything we ordered was good. Service was good. View was good. Better to come here around 6 to 6:30 for the perfect sunset. Only problem is public transportation going down from Mt Faber. Had to walk down some 15 minutes to Harbourfront MRT. But still good. Will definitely go back.",
      "time": 1745765110,
      "translated": false
    },
    {
      "author_name": "Sophie Kriewolt",
      "author_url": "https://www.google.com/maps/contrib/116712060169451328974/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKhpWklDnN2VB95hWeni2cnLdz-EuPWXUyFPnIu1aBLROIBOQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We had an absolutely unforgettable evening celebrating my boyfriend’s birthday with a group of 16, dining outdoors with the most breathtaking view you can imagine. The setting was simply perfect – the skyline, the breeze, the atmosphere – all spot on. The food was incredibly delicious, every dish packed with flavour and beautifully presented. Drinks were top-notch too, well-crafted and refreshing.\n\nThere was great music playing throughout the evening, adding to the lively and relaxed vibe. Everything came together so seamlessly – service, ambiance, food, drinks – really nothing to fault.\n\nWe’d do it all over again in a heartbeat. Truly one of the highlights of our time in Singapore!",
      "time": 1743087014,
      "translated": false
    },
    {
      "author_name": "Damien Bower",
      "author_url": "https://www.google.com/maps/contrib/113619094176953798226/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV79GxP8h5pXmA9BmmhzIuxT-1LlGEPTw4V0eKEzNW_7rOsPeQ4CQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "Short notice anniversary dinner. Thank you to David, Jong, Krishna and Maria for looking after us both. You were all amazing and the food was heavenly. We look forward to returning and highly encourage others to dine there.",
      "time": 1747366844,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2729385328571927590",
  "user_ratings_total": 3684,
  "vicinity": "Mount Faber Road, Level 2 Mount Faber Peak Singapore, 109"
}