{
  "formatted_address": "247 Hougang Ave 3, Behind Kovan MRT, Singapore 530247",
  "geometry": {
    "location": {
      "lat": 1.3591697,
      "lng": 103.8912548
    },
    "viewport": {
      "northeast": {
        "lat": 1.360462480291502,
        "lng": 103.8929078302915
      },
      "southwest": {
        "lat": 1.357764519708498,
        "lng": 103.8902098697085
      }
    }
  },
  "name": "Eager Kids Montessori",
  "place_id": "ChIJQaiPAcoX2jERcTLqPKsDYTc",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Sirish Krishna Pallevada",
      "author_url": "https://www.google.com/maps/contrib/116201922590615683773/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXw5ujEwVZxc1g8wJZV_UKYeIQeKXXsjIWMYkiwcfQJlCpVA_Hy=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "After having visits and tours to multiple schools, I found Eager Kids Montessori to be the perfect place for my child. As a parent I have looked at two key things that are needed from school.\n1. Child-centered approach\n2. How passionate the guides(teachers) are.\nEKM excels at both. After speaking to the guides, I have learnt how I need to respect and value my child as an individual.\nGuides feedback on my child was always deeply nuanced which can only be derived after a lot of observation and keenness.\nSchool which keeps child’s interests at the centre above all.\nEKM is a place where my child had a happy childhood with lot of learning.\nA place where kids graduate with happiness, kindness and lot of goodness.",
      "time": 1743592451,
      "translated": false
    },
    {
      "author_name": "Shabuja Shanthy",
      "author_url": "https://www.google.com/maps/contrib/110248257687698398832/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXXXq67EozAgfHzUoQGvnbAfmJhpIDw__5GkkLMd7-mN9--PKHz8A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My daughter just graduated from K2 at Eager Kids Montessori. The 3 years she spent here has shaped her in so many commendable ways. The guides are very passionate about Montessori principles and follow the same in every aspect in the school. Students of this school stand out from those from traditional schools with regard to personality, perception, curiosity, learning abilities and discipline.\nWe couldn't have asked for a better school for our child to get started with. It's a very clean, well-maintained, safe and fully equipped Montessori school. I'd recommend EKM to anyone who is passionate about their child flourishing overall and not just in academics alone.",
      "time": 1701420592,
      "translated": false
    },
    {
      "author_name": "Aparnadevi M",
      "author_url": "https://www.google.com/maps/contrib/115524697757219324135/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUk2rryedqOPMu8WzaCfcSqHSk4holJlq3yAXh52unry3EOeyNmig=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Finally, a school that exists for quality education and not pure business. Even though there were not so many reviews/recommendations online, after visiting the school, we decided to give EKM a try. Looking back, this was the best decision we ever made for our son. In 2 years, he has become a confident, responsible and caring child. He has developed a positive attitude towards learning.\nAnjum and her team are doing a great job in inculcating the Montessori culture in school and educating the parents to do the same at home. During COVID times, they managed pretty well in staying connected with the children. They observe every child keenly and give honest and in-depth feedback to parents. Under their care, every child feels that he/she is important. Learning is not limited to language and maths but also extends to geography, science, arts & crafts and even practical life.\nI would recommend the school to anybody who is looking for a place where their child can grow in every sense.",
      "time": 1638276655,
      "translated": false
    },
    {
      "author_name": "Tejaswini Kuncham",
      "author_url": "https://www.google.com/maps/contrib/110355139656760240162/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIm1SNtLlSLDzvWsHNM2be2_CAVttAnZ8pw2SrWPWWDMhzTSCug=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "You all have been great mentors and guides. our daughter is so fortunate to have been placed in Eager kids Montessori. You all have amazed and inspired her daily. Never in her three years of schooling she felt bored. She wanted to go to school even during holidays and she learnt many practical lessons which are much needed in our day to day life. Everyday was a new experience for her. She is so bonded with all of you and her friends so much that she will miss all the fun.\n\nYou have not only guided the children but also the parents in every step.\n\nOur sincere and heart-felt “Thank you” to Anjum for giving us all the support and guidance and for being a wonderful teacher. We are truly inspired with your ideas and methodology.\n\nTeachers Vidya, Alaka – Thank you for being a truly outstanding Teachers.\n\nFrom the bottom of our heart, We wish all of you a great success in all your future endeavours and also inspire and train many children.\n\nThank you...\nTejaswini",
      "time": 1638106771,
      "translated": false
    },
    {
      "author_name": "hari priya srinivasan",
      "author_url": "https://www.google.com/maps/contrib/109267983904542249446/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIWSh5q-EaNC289eLB-6hWXAzEBt0v46RqwTz48UYMiumco9ts=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 years ago",
      "text": "A great place to start your child's academic journey and build love for school. A place where your child will always be \"Eager\" to go to. Wonderful teachers and appealing classroom.",
      "time": 1526670200,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "school",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3990474778823242353",
  "user_ratings_total": 11,
  "vicinity": "247 Hougang Avenue 3, Behind Kovan MRT"
}