{
  "formatted_address": "9 King Albert Park, #01-58, Singapore 598332",
  "geometry": {
    "location": {
      "lat": 1.3369213,
      "lng": 103.7790175
    },
    "viewport": {
      "northeast": {
        "lat": 1.338392980291502,
        "lng": 103.7807433802915
      },
      "southwest": {
        "lat": 1.335695019708498,
        "lng": 103.7780454197085
      }
    }
  },
  "name": "EagleWings Cinematics",
  "place_id": "ChIJ3dSCfKMR2jERsBpC6UoFuaQ",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "annnee71",
      "author_url": "https://www.google.com/maps/contrib/112625903731334377077/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWD0ubszLWfxglpYwFDerxZKcpiJYMQf_IHVv73eifVWo1aoPs=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I watched The King of Kings with my son who is autistic and has sensory issues during Holy Week. We love it that the environment at Eagle Wings somehow felt peaceful and calming. The space among the chairs is comfortable, not too cramped. The food from the Loft Menu was delicious and reasonably priced. I also appreciate the Premium Lounge area where we can unwind over a drink before heading to the cinema hall. The relaxing vibe, having a place the unwind and having food served during the show all helped my son and I enjoy the movie experience. And I must not forget to mention that the staff are very helpful and efficient in their service.",
      "time": 1744727223,
      "translated": false
    },
    {
      "author_name": "Ry R",
      "author_url": "https://www.google.com/maps/contrib/103553675000524459139/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL-1WVCHu2-Dv7IZi9D7cBqj8y0QF8lCsvNmx9FBKfyGDgloBI=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Made a trip today to try out EagleWings Cinematics for the first time, and overall, it was a pleasant experience. While we initially encountered some hiccups with the lounge service, the manager and team were proactive, sincere, and prompt in addressing our concerns, which we truly appreciated. The theatre itself was well-maintained, with spacious and comfortable seating. Dining in the theatre was enjoyable, and the Loft Menu offered good food and snacks at reasonable prices. Given the many positive aspects of our visit, we look forward to returning.",
      "time": 1742375864,
      "translated": false
    },
    {
      "author_name": "Doraemon",
      "author_url": "https://www.google.com/maps/contrib/112665277904119154671/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX2VSCcaT9axvOwx2nD8XD3PgZ8V5VFnv420aocMSfLa6GlcEmN=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Kitty and I have been loyal patrons of EagleWings Cinematics for years, and we absolutely adore this cinema.  It's a truly unique experience that we keep coming back to again and again.\n\nEagleWings Cinematics is located within the KAP Mall, and it stands out from other cinemas in Singapore because of its intimate and luxurious atmosphere.  Each theater is cozy and designed to hold a small group of people, like 12 to 20 people, making it feel like a private screening. It's so comfortable and relaxing!  The seating is fantastic, and we've tried all their classes—Silver, Gold, and Platinum.  Our favorites are Gold and Platinum, which offer plush reclining sofas with blankets to keep you warm.\n\nBut the real highlight is their amazing service and amenities.  Right next to the cinema is a fantastic restaurant where you can order a wide variety of food, from local favorites like laksa to international dishes like steak and fish and chips.  You can even order beer if you choose Gold or Platinum class.  It's a far cry from the typical cinema snacks! You can also enjoy their lounge one hour before your movie starts, with free-flowing coffee and soft drinks, and even two massage chairs to relax in!\n\nThe service is impeccable.  They efficiently deliver your food to your table in the theater, and the table lamps are perfectly positioned to illuminate your meal without disturbing other guests.  The sound system is excellent, and the air conditioning is just right.  It's a comfortable and enjoyable movie-going experience.\n\nWe love how EagleWings never feels crowded or rowdy.  The atmosphere is always so peaceful and relaxing, perfect for enjoying a movie.  We've recommended EagleWings to many of our friends, and they've all become addicted to this amazing cinema.  From that point on, they've been watching movies at EagleWings exclusively!\n\nThe overall experience is always positive.  It gives you a holistic experience, where you can enjoy your movie on the comfortable sofa seat and have delicious meals in the cinema.  The food we've tried over the years has always been above average.\n\nEagleWings is also incredibly convenient.  All the theaters are on level 1, and if you're looking to book a private function, you can head to level 2.\n\nWe highly recommend EagleWings Cinematics to anyone looking for a luxurious and memorable cinema experience.  It's a great option for a romantic date night, a family outing, or a night out with friends.",
      "time": 1729784355,
      "translated": false
    },
    {
      "author_name": "Kezia Hartono",
      "author_url": "https://www.google.com/maps/contrib/110176750051295042056/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVwwcewhm39qqYnf0C9RVPP9d6-p9pdR80BRd6jMWmrXgMSn4r4=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We really had a wonderful experience with Eaglewings Cinematics.  The theater was well maintained and clean with a cozy seat too. The staff and their services were excellent, friendly and helpful.  Their food was also flavourful especially their fish & chips.  Thank you for going above and beyond to your overall service.  Everything is awesome👍❤️",
      "time": 1744715500,
      "translated": false
    },
    {
      "author_name": "Cellyn Tan",
      "author_url": "https://www.google.com/maps/contrib/106262122557342001395/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVKrsuuZjfiWXV8vqyJ_ZqFS-Q5aCEY1iozkkLv30EsJhEdMBfT=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "2 weeks ago",
      "text": "Watched a movie here earlier today at Gold Hall 1. Ordered food 10 minutes before movie started, and only got the food an hour in due to a glitch in the system which staff only mentioned after I probed. If you are going to provide dine in services during a movie then I consider the bare minimum to have close to extremely low latency in the ordering system (since you don't allow over the counter preordering). I find it hard to believe the dysfunction was going on unnoticed for a substantial period of time. It was an hour for me and maybe more for others.",
      "time": 1746356001,
      "translated": false
    }
  ],
  "types": [
    "movie_theater",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11869524112210795184",
  "user_ratings_total": 410,
  "vicinity": "9 King Albert Park, #01-58"
}