{
  "formatted_address": "31 Tampines Street 33, Singapore 529258",
  "geometry": {
    "location": {
      "lat": 1.3529446,
      "lng": 103.9618398
    },
    "viewport": {
      "northeast": {
        "lat": 1.354595930291502,
        "lng": 103.9631373302915
      },
      "southwest": {
        "lat": 1.351897969708498,
        "lng": 103.9604393697085
      }
    }
  },
  "name": "East Spring Primary School",
  "place_id": "ChIJQXHosOI82jERKFah0Tvr11U",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Van C",
      "author_url": "https://www.google.com/maps/contrib/103429851909753477578/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK6PuHUxIpufw1eDzYb5hrmZnbb9RH6E0BHsu0edDAbfMPTrg=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "I am a past student that has been transferred. Honestly I love the book shop auntie she's so kind and the things are so good to buy there it has been three years since I transfer",
      "time": 1744808744,
      "translated": false
    },
    {
      "author_name": "Nadine Idrah",
      "author_url": "https://www.google.com/maps/contrib/109313034845347469770/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLBTB5h6O4CBFlHZOSvF8pJrB-PXivdfecJfAZM38dbZSyJkg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "A concerning amount of teachers would talk behind their students. Sure, you can at least talk about their academic weaknesses but talking behind their backs like how you gossip with friends is actually crazy, if not concerning. This is actually proven by my Math teacher who said to my friend that every teacher talk smack about her.\nIf you'd don't want them to slack in their subjects, talking literal smack would not give them good. You'd have to actually interact with the student in question and actually ASSIST them.\n\nSome teachers would go to the next level and literally humiliate their students about getting something not done right. (getting low marks for an example) Honestly, this is actually  embarrassing for the teacher too as the actions committed by the staff is actually considered immature.\n\nAt least there's some teachers such as Mr Kang who would support his students, even though he is a PE teacher. There's also this book shop aunty who's also wholesome.\n\nHonestly just give Mr Kang for the best teacher award for being a Father figure",
      "time": 1735897166,
      "translated": false
    },
    {
      "author_name": "bat",
      "author_url": "https://www.google.com/maps/contrib/105980910349613238505/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUUBXQhuagR0uAsNOrVp4BWz9fBpwlIgxW702M26hrOOidT0dFN=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "8 months ago",
      "text": "An ex student from this school was absolutely HORRID. Most of the teachers who teaches in that school are not very helpful but to talk bad about their student's backs or calling them names. The toilet in the canteen is also bad as if it had gone to three world wars. The only good thing about the school that they have a very nice bookshop owner which sells on what is trending in medias and stuff and the school councillor, ms tan, is EXTREMELY HELPFUL. Thanks to her, I was able to score a good grade and go to the school I wanted. There's a teacher named mr lukman or luqman idk and he used to scold me every time I do some questions wrong even though he CLEARLY stated in the class that 'mistakes makes perfect' while he is literally draining my motivation to even do work in his maths lesson I extremely hated this teacher as he also made insults to a student who wanted to be him because with his jewellery and stuff. 😭 The cca are fine as well, but by the time I graduated, the school has not added back choir and it was removed at the year where there was a covid pandemic. Some teachers also purposely embarrass their students for having bad grades❤️ (i highly do not recommend unless you want to suffer)",
      "time": 1726591475,
      "translated": false
    },
    {
      "author_name": "Hector",
      "author_url": "https://www.google.com/maps/contrib/115179526697030818054/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXYMbhtrhgLDz_sls2TPV6k13YklSs8ebLR7PPm7saJkAF4afYY=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Just attended orientation for the P1 2024 students. School looks well-organised with Staff and Teachers putting their best foot forward and doing their part to welcome new students to P1 2024. Witnessed the canteen-time of new students — all the teachers giving attention to each and every student to make sure kids learn canteen-etiquette, buying food, making payment etc.\n\nIn-class briefing was nice too - heard the slide presentation from subject teachers, with detailed walkthrough of what to expect from the curriculum. Though I felt the technical and audiovisual issues could’ve been better managed.\n\nAll in one, a very well-organised Orientation by the staff and teachers.\n\nWishing best of luck for the new students (and their Teachers) at this wonderful school!!",
      "time": 1704161926,
      "translated": false
    },
    {
      "author_name": "Danning J (Alice)",
      "author_url": "https://www.google.com/maps/contrib/110247112803118285561/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVnJ8nAFZ0-vqnE3gh-DuR2U0a33eCuPZrhcQcPCmZ8xW3Rhewe=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "I’m an ex student of ESPS. Though many people think it’s a neighbourhood school, it provides lots of learning experiences and the teachers are really helpful and encouraging. The school grounds is very pretty and I have fond memories there. As an alumni, I will proudly say that ESPS was the main reason I could get in to RGS. My teachers really cared about us and the school has a systematic way of teaching.",
      "time": 1675604108,
      "translated": false
    }
  ],
  "types": [
    "primary_school",
    "point_of_interest",
    "school",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6185671255369274920",
  "user_ratings_total": 41,
  "vicinity": "31 Tampines Street 33"
}