{
  "formatted_address": "1000 ECP, #01-03, Singapore 449876",
  "geometry": {
    "location": {
      "lat": 1.301317,
      "lng": 103.9129037
    },
    "viewport": {
      "northeast": {
        "lat": 1.302543980291502,
        "lng": 103.9142086802915
      },
      "southwest": {
        "lat": 1.299846019708498,
        "lng": 103.9115107197085
      }
    }
  },
  "name": "East Coast Commune",
  "place_id": "ChIJVwlS_k0Z2jER7Di5t1WgS2s",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Christopher Leong",
      "author_url": "https://www.google.com/maps/contrib/103939193283593924638/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWeH2vxiq4o_ym7ZwBRvPb0OXMuxleKRDTWy-xXQZ1kTSo_IjyT=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Ate here a couple of times on weekdays and weekends. Service and atmosphere are great on weekdays where there's little crowd. On weekends you can expect a longer wait for a table and to be served.\n\nVery kid friendly with play area in the restaurant, together with a small shop selling baby stuff.\n\nFood was overall above average, with the mango smoothie surprisingly good. Would recommend the cauliflower pops and roast chicken. Great to hang out with kids if you can come on weekdays or early on the weekend to avoid the crowd.",
      "time": 1744008386,
      "translated": false
    },
    {
      "author_name": "Sandy Shum",
      "author_url": "https://www.google.com/maps/contrib/106380917396877023232/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWcPHypY6b9nFj-UnbIpygGqZOAKpKrXzt1ls9UqQ9gWOxlxkNnNw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "3 weeks ago",
      "text": "The café features a large, spacious indoor area with plenty of big sharing tables, as well as outdoor seating. Both areas are kid- and pet-friendly. Food portions are not large, but the affogato is excellent. Service is prompt, though it could be more attentive.",
      "time": 1745675347,
      "translated": false
    },
    {
      "author_name": "Ron Tan (RonTanzk)",
      "author_url": "https://www.google.com/maps/contrib/107028940687363192871/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUFsvZRm8JTStgEjCIEAA8tojbwMADL_H_AVQak46z6fUYTt7hi=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 3,
      "relative_time_description": "3 weeks ago",
      "text": "This was my second visit, and while my first experience was decent, this time around left a bit of a sour taste—enough for me to write a proper review.\n\nWe came for an event where we were supposed to be able to picnic outside with our pet, but unfortunately, it was raining. When I approached the staff to ask about a wet weather alternative, there didn’t seem to be a clear plan. Eventually, we were told we could sit at one of the sheltered outdoor tables, although the staff seemed a bit hesitant to allow it. We sat anyway, quite hungry by that point.\n\nWe ordered the pork banh mi, but to be very honest, it was disappointing. It came with just a few slices of pork and didn’t feel remotely worth the $20 price tag. I’ve had much better—and cheaper—banh mi at places like Geylang and Katong. I shared this feedback with the staff, who said they’d pass it on to the manager.\n\nThe manager later came by and asked me to repeat my feedback. After hearing me out and learning it was my second visit, he kindly offered a complimentary dish, but by then, I had already lost my appetite. We ended up leaving, and they gave us a discount.\n\nI honestly can’t rate the food more than one star based on this experience, but since my first visit was okay, I’ll give it three stars overall. Service was a bit hit-or-miss, though I do appreciate that they tried. The atmosphere was also dampened (literally) by the lack of a proper wet weather plan, but I understand that some things can’t be helped.",
      "time": 1745459675,
      "translated": false
    },
    {
      "author_name": "L Davis (SG)",
      "author_url": "https://www.google.com/maps/contrib/112234525476361740401/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVCKMjPeW42EeBFFK-UQKEfbg6HlSwrX6p1B4wP-2tjVztequLE9g=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Good and prompt service and food on a Sunday morning. Their honeycomb latte (cold only) was very unique in its taste. The raw wild sugar taste on honeycomb seem to combine well with their coffee. Sourdough was crispy with its own hint of butter sweetness.",
      "time": 1736125821,
      "translated": false
    },
    {
      "author_name": "Colin Wong",
      "author_url": "https://www.google.com/maps/contrib/101172033169644568663/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWvSzEYcaZtj33w0dqRuRFzxvAGf1rs96NU8WQ7LoJgq2F_US9f=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "4 months ago",
      "text": "I was looking for a western cafe along East Coast to take the family this Xmas day and I appreciate that F&B ppl are working on a PH.\n\nFood wise I prefer my Italian food authentic and savoury. The food here though is too bland, salty and innovative.\n\nThe carbonara is green w pork slices rather than bacon. It was also salty. The crab pasta is cooked w an Asian flavor that tastes like mee siam, and the roasted chicken plain bland. The chicken is frozen, lacking in seasoning and the fish is poorly presented.\n\nFor $80, 3 dishes, I’m looking to be  but we were disappointed.\n\nIt’s also a really noisy place. When you play music loud, ppl will try to talk over the music creating a really loud environment not conducive for relaxing.\n\nHopefully we will see an improvement if we do come back.",
      "time": 1735104174,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7731449475326621932",
  "user_ratings_total": 652,
  "vicinity": "1000 East Coast Parkway, #01-03"
}