{
  "formatted_address": "201 Hougang St 21, Singapore 530201",
  "geometry": {
    "location": {
      "lat": 1.3578609,
      "lng": 103.8835431
    },
    "viewport": {
      "northeast": {
        "lat": 1.359285830291502,
        "lng": 103.8848268302915
      },
      "southwest": {
        "lat": 1.356587869708498,
        "lng": 103.8821288697085
      }
    }
  },
  "name": "Eastern Hougang Eye Specialist",
  "place_id": "ChIJhR80T7EX2jERSq_tRT3NcZ0",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Tan Lewis",
      "author_url": "https://www.google.com/maps/contrib/104969628598032056170/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW-8opPhgpNQRPghEdC2XI7alewuZZToZ1vkSZ8UM7P89sL0c-Z=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I went for an eye examination due to tired and dry eyes after seeing good reviews from Google. The waiting time was approximately two hours, which was understandable given the clinic was packed with patients. However, what made my experience exceptional was the staff. They were prompt, professional, and attentive. A special mention to Dr. Liew, Pamela, Kai Xian, and the counter staff for their outstanding service. Their price is affordable compared to other eye specialist clinic. Keep up the good work!",
      "time": 1739581275,
      "translated": false
    },
    {
      "author_name": "Kenneth Chia",
      "author_url": "https://www.google.com/maps/contrib/100847405949440265369/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJTCjHyZNIQu6M1GftctvBFoXYXlfNLkuaSCPQZeBi7_U1sKg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Dr Liew was awesome! Had a lesion on my eyelid and came for a minor operation. Waiting time can be a bit long but it was totally worth it. 4 other lady staffs were all friendly and accommodating. They totally put you at ease and very professional. Only problem is the clinic is a bit too small. Should look at expanding but then again the pricing may go up if this happens. Your friendly neighborhood eye specialist.",
      "time": 1708996582,
      "translated": false
    },
    {
      "author_name": "fiona heng",
      "author_url": "https://www.google.com/maps/contrib/116406544714611303809/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK9u4xAj7Yo5u8KNGqQryCu64UBzNNui5MadMdYDc_aIq7xrQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Very good experience with the staff as well as Dr Petrina’s expertise here. She is only at the clinic on Thursdays. I had a persistent chalazion for 2 months+ and had visited the GP and another eye specialist beforehand. Dr Petrina really looked into the details of my eye condition and considered all options with me. In the end I opted for steroid injections. I was happy Dr offered me a mid-invasive option. The results worked well on my eye and the chalazion is gone after 2 weeks. Dr also gave me a followup appt 1 month after and by then, everything is good, just some redness left and she still continued to recommend ways it could get better. Overall thankful for the effective treatment and genuineness of this doctor !\n\n(I also visited the clinic just to buy steroid ointment as mine expired and the staff patiently looked through all my folders while the clinic was busy and found it and sold the ointment to me). Thank you!!",
      "time": 1741857911,
      "translated": false
    },
    {
      "author_name": "Matthew Pang",
      "author_url": "https://www.google.com/maps/contrib/112651242025848656597/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKrHAmSENrs5mCWAoewZhriUScCRqADPy58yqqXlFt-X3fcRQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Had a serious eye infection and can feel the effects in less than 2 hrs after applying the eye drops. Only regretted not knowing this clinic earlier.\n\nBe prepared for a one to two hours wait if you are visiting",
      "time": 1744529448,
      "translated": false
    },
    {
      "author_name": "Delphine",
      "author_url": "https://www.google.com/maps/contrib/105437019113759864556/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVChU6vl9WM1uYaIfWEc7xSGdmAZYAzk73GIgqtv-nWzHeW7SXw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Good things come to those who wait – this is how I felt after each visit to Eastern Hougang Eye Specialist. I have very high myopia and was doctor hopping till I came here 6 years ago. I must commend the professionalism and efficiency of Dr Liew and her team. They were remarkably swift, multitasking seamlessly to manage a busy schedule while still ensuring that no waiting patient felt forgotten.\n\nI appreciate their commitment to thorough care. The process included eye dilation, which is all about waiting; followed by a detailed series of checks and multiple examinations, all conducted with precision and care. It was clear they did not skip any steps (remember I was a doctor hopper) which gave me confidence in the quality of treatment. There are no cutting corners when it comes to this gift of sight so you have to be patient and trust the professionals to sustain it.",
      "time": 1734544592,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11345074599372894026",
  "user_ratings_total": 88,
  "vicinity": "201 Hougang Street 21"
}