{
  "formatted_address": "248 Simei Street 5, Singapore 520248",
  "geometry": {
    "location": {
      "lat": 1.3435185,
      "lng": 103.9534043
    },
    "viewport": {
      "northeast": {
        "lat": 1.345113480291502,
        "lng": 103.9544708302915
      },
      "southwest": {
        "lat": 1.342415519708498,
        "lng": 103.9517728697085
      }
    }
  },
  "name": "East Asia Department Store 东亚百货商店",
  "place_id": "ChIJxbbEFCI92jER84ezH_FKYIU",
  "rating": 1.6,
  "reviews": [
    {
      "author_name": "Diana Abdullah",
      "author_url": "https://www.google.com/maps/contrib/108738451773069396754/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIQ1fp1TENB3UxdSvFiOGPZGQTDTaC5y2qmIcIcckyCW1KQ6g=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "My 15 years old daughter bought a bulb that is wrongly recommended by Myanmar shop assistant herself. My daughter shown a bulb's photos that is with two ins adapter but was recommended by the shop assistant the screw type.. My daughter made payment as the shop assistant said the same product. Then my daughter called to verified with me. I told my daughter its a wrong product and go ask for refund on the spot which is less then 30mins of asking for refund and the Myanmar shop assistant refuse to refund. I came down to the shop and ask for the refund but then she still refuse to refund...WHAT KIND OF POLICY IS THIS LESS THEN 30MINS CANNOT REFUND AND WRONG ITEMS IS RECOMMEND BY THEIR OWN STAFF. AND SHE IS EXTREMELY SUPER RUDE!!!! I WILL LODGE A COMPLAIN ABOUT THIS.",
      "time": 1714652070,
      "translated": false
    },
    {
      "author_name": "Wing Tso",
      "author_url": "https://www.google.com/maps/contrib/103494407821337653743/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKmviHgjXGV7hnXyT5_UJIvbGRNQcf10W-Xtypoz76j7LN0qA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "4 years ago",
      "text": "I've been a customer for years of this only hardware provision store in Simei. Owners changed. Bought a defective mortar and pestle, started flaking off bits after being washed with a sponge (& without use)! The male Chinese staff was rude, argumentative and ignored any asks for a solution, refund, exchange, full or partial. Puts all the blame on you, saying you should check before buying. How does one check for a defective flaking product in the shop without using it!!?? I wanted to support neighbourhood stores during Covid but don't bother shopping here unless you want to risk throwing away your money or get frustrated with selfish service! Go to nearby NTUC Fairprice at Eastpoint instead. Very disappointing.",
      "time": 1601249770,
      "translated": false
    },
    {
      "author_name": "Ros L",
      "author_url": "https://www.google.com/maps/contrib/102706116861943113125/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLGU8SI6Rrnyj4p86KhbCnOiTnxNpiY0iKAERTX19A2J02dhg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "10 months ago",
      "text": "If you’re the owner of this store, I hope you read this. The cashier is extremely rude and lacking in basic manners. Which made for an intolerable and off-putting experience.\n\nRight before I enquired about the thing I wanted to buy, I also heard her speaking dismissively to a customer on the phone. So it’s definitely not a one-off incident and she has an attitude issue. Please step up and learn some basic manners if you want to work in the service industry.\n\nI suggest you avoid this shop if you would like to have an unspoiled day. Look for what you need at Value Dollar, Japan Home and Nitori in Eastpoint — the pricing is actually cheaper than this shop. And the service is world-class compared to this woman!",
      "time": 1721711394,
      "translated": false
    },
    {
      "author_name": "Viee",
      "author_url": "https://www.google.com/maps/contrib/105274748460631882152/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU6osw5xUWRKq6JNXqvr2RkGWBrbKOkyo_t_PtxjpqcM-xoCdDC=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "10 months ago",
      "text": "Super rude boss n Burma cashier. Must rmbr to get receipt cos they dun gv unless request. Exchange require receipt else they dun honor. Kopitiam coffee stall staff oso supper rude. Are simei shops staff trained this way 🫣🤔",
      "time": 1720953649,
      "translated": false
    },
    {
      "author_name": "Edward Koh",
      "author_url": "https://www.google.com/maps/contrib/102713730221443483090/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLKHXwO_A_lOkGmlyHmZIt575zghDTiqG0EK_tmGOeJVkhu2A=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "6 years ago",
      "text": "Worst experience I ever had. My Wife went to duplicate key and despite going back 4 times due to the key can not unlock the cabinet, we were told to go back and ask for refund. When we were there, the counter lady cannot make decision and called the boss. I spoke to the boss and explained to him we came over 4 times to get the key fixed, but eventually the key doesn’t work. I told him that we wasted time and parking to come and get the keys fixed. The next thing he told me is, you chose to come to my shop and get your keys done. It’s not my choice. So I won’t refund you.\nThat really triggered me to write this to inform everyone about this bad experience.",
      "time": 1556890489,
      "translated": false
    }
  ],
  "types": [
    "convenience_store",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9610764004288071667",
  "user_ratings_total": 14,
  "vicinity": "248 Simei Street 5"
}