{
  "formatted_address": "10 Anson Rd, #02-25/26/27 International Plaza, Singapore 079903",
  "geometry": {
    "location": {
      "lat": 1.2756998,
      "lng": 103.8458098
    },
    "viewport": {
      "northeast": {
        "lat": 1.277000980291502,
        "lng": 103.8473554802915
      },
      "southwest": {
        "lat": 1.274303019708498,
        "lng": 103.8446575197085
      }
    }
  },
  "name": "Elegance Beauty & Slimming Centre Pte. Ltd.",
  "place_id": "ChIJn5yMmIwZ2jERiH9SZZJOguQ",
  "rating": 3,
  "reviews": [
    {
      "author_name": "Mary Dela",
      "author_url": "https://www.google.com/maps/contrib/109033231628740797371/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIK_Sl29CI7mHj9D3zCby9dYBXG2lIEALLXUREu1qPVMpfpGg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Amazing Massage Experience!\n\"I had an incredible experience with Jennna.  Her technique was both relaxing and therapeutic, addressing all my tension points with just the right amount of pressure. She was professional, attentive, and truly knowledgeable about different massage techniques. I left feeling refreshed, rejuvenated, and free of stress. Highly recommend to anyone in need of a quality",
      "time": 1742196869,
      "translated": false
    },
    {
      "author_name": "Felix Ho",
      "author_url": "https://www.google.com/maps/contrib/117795777758341334558/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI6_VTMVBRgu_bhwKJcxWJf7pJBmVo9O5h8DY1fozGMOpOvWA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "I had a terrible experience at Elegance Beauty & Slimming Centre Pte. Ltd. During my visit on Friday, 21 March 2025, they intended to use a facial mask that had already expired on 14 October 2024. I only avoided this because I was in a rush and took the mask home instead. When I later checked, I was shocked to find the expired date clearly printed on the packaging.\n\nThis is a major red flag. If they were willing to use an expired product on me, who knows what other expired products they are using on customers' faces? This raises serious concerns about their hygiene, product safety, and overall professionalism.\n\nTo make matters worse, when I brought this up, the manager Stella dismissed my concerns and was unprofessional in her replies. Instead of addressing the issue of expired products and the company’s ethical responsibility, she deflected the blame onto the beautician. This is completely unacceptable—product safety is a management issue, not just an individual staff mistake.\n\nI strongly advise others to check product expiry dates if you visit this place—or better yet, avoid it entirely. Your skin deserves better.",
      "time": 1742637877,
      "translated": false
    },
    {
      "author_name": "Rene Lim",
      "author_url": "https://www.google.com/maps/contrib/104791885308801518240/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJp1j3SnRAd36_o6_GwZ2JzyQojcd-6LVF6GT0BOiPH9DPgqA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "I wouldn't have come to this International Plaza branch if not for the fact that the branch I usually go to is under renovation. But that branch didn't even inform its customers that it is undergoing renovation and calls and WhatsApp messages simply went unanswered. I called this branch and they accepted my booking even though they, too, didn't know the other branch was under renovation until a customer told them so.\n\nThe therapist (Malaysian accent, not from China) was good, gave a hard massage after asking what strength I would like.\n\nBut after the massage I was again brought to a room and of course they tried to sell me a new package. I told the saleswoman (in black suit but darn, she didn't have a name tag otherwise I would write it here to shame her) that their recorded number of hours remaining were wrong after she wanted me to sign on the time sheet and buy more hours. Her records were from when I last came to this branch, also because the other branch's lease was up the last time. I told her I already purchased more hours at the other branch (obviously, the do not have integrated computer system records), and she insisted on the X hours from when I last came to this branch. After I told her a 3rd time that I already have bought new hours, she stormed out (SO RUDE!) and told the receptionist that she should inform the other branch and stormed away. No sales = deal with thunder temper.\n\nHighly do not recommend because it's very pressurizing to come here when you have 10 hours left and they will pester you each and every time after your treatment until you buy. If you are lucky, no black face. If you're not lucky, suffer the wrath of the female \"sales god\"",
      "time": 1737111940,
      "translated": false
    },
    {
      "author_name": "sherene kaur",
      "author_url": "https://www.google.com/maps/contrib/114157237151199093653/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX_aNmM4EDiUhQ1UgNdZ4K4zs_x0OgPXLyzaMNjfFGIPw8gpQWi=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "2 months ago",
      "text": "The personal at Bishan were rude and demanded payment for their facial services$38 per treatment on top of my package , just because my account was from another company which they took over\nIf they did not want to take over as their customer, why did they do my facial the first time reassuring that they value the customers. Then this second time they rejected and demanded service charge.\n\nMoreover because I did not want to pay the service charge, so while waiting for the senior to come, she pretend to give me a facial and called it TCM facial. My god, she just steam my face and took a few blackheads and put a mask. My package was altogether different.",
      "time": 1741485011,
      "translated": false
    },
    {
      "author_name": "XxNite4LifexX",
      "author_url": "https://www.google.com/maps/contrib/108812915144502116624/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL8Lw9Kjw372aWIVEWf6zEXis1H-D9sNyFW1yIp5pp82NOB1FE=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "3 weeks ago",
      "text": "Great! Comfortable message by Jena\nExperience technique help to relieve tension on my the body and reduce soreness. First time body massage at $27, keep recommend to buy bundle",
      "time": 1745474754,
      "translated": false
    }
  ],
  "types": [
    "shopping_mall",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16465809578292051848",
  "user_ratings_total": 137,
  "vicinity": "10 Anson Road, #02-25/26/27 International Plaza, Singapore"
}