{
  "formatted_address": "Blk 866A Tampines Street 83, #04-01 Tampines Central Community Complex, Singapore 521866",
  "geometry": {
    "location": {
      "lat": 1.3553724,
      "lng": 103.9344296
    },
    "viewport": {
      "northeast": {
        "lat": 1.356636280291502,
        "lng": 103.9357343302915
      },
      "southwest": {
        "lat": 1.353938319708498,
        "lng": 103.9330363697085
      }
    }
  },
  "name": "ELFA Preschool @ Tampines",
  "place_id": "ChIJdcEXXnI92jER_j6Z2Qduq3c",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Jol",
      "author_url": "https://www.google.com/maps/contrib/112798353532255025204/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJUT94wK-c3lRgyu8rSujNkkqOu4EGSqlSd9zSbp5EL07VYAQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I am extremely happy with my decision to enroll my two daughters at Elfa School in Tampines. The principal, teachers, and staff have consistently demonstrated professionalism, understanding, and genuine care, providing unwavering support and assurance to both students and parents. This trust allows parents like us to work with peace of mind, knowing that our children’s well-being and safety are in excellent hands.\n\nElfa also stands out for its strong academic foundation, particularly in Chinese language education, which my children have grown to love. Beyond academics, the school offers a well-rounded curriculum that includes engaging activities like speech and drama, gym classes, and various enriching external courses. My kids have thoroughly enjoyed their time at Elfa, learning, growing, and creating wonderful memories.\n\nI wholeheartedly recommend Elfa School to any parents seeking a nurturing and enriching preschool experience for their children.👍",
      "time": 1735788784,
      "translated": false
    },
    {
      "author_name": "Zanaria Zainal",
      "author_url": "https://www.google.com/maps/contrib/104411591723970226038/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ08aA6Bj6ejobmHTzTz8Z16nAsmDJDaYH5DBCIUg8-eidNXQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "ELFA Preschool has been a wonderful experience for my daughter. The nurturing and dedicated teachers create a warm and supportive environment that fosters both learning and personal growth. My daughter has flourished under their care, developing new skills and confidence every day. The curriculum is engaging and well-balanced, making learning fun and exciting. I’m grateful to have found such a fantastic preschool where my child is thriving and happy. Highly recommended!",
      "time": 1721312055,
      "translated": false
    },
    {
      "author_name": "Antonie Ang",
      "author_url": "https://www.google.com/maps/contrib/107045865545309409370/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLVptDRijXaEDb9RV6ZqPWFIR1atr4Q739gt8piStmnDHNEUA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "Million thanks to ELFA Preschool @Tampines .The staff here are amazing and truly care about the well-being and development of each child. My two children have been attending this center and I have seen such a positive change in their confidence and social skills. The facilities are clean, safe, and engaging, providing a fun and nurturing environment for children to learn and grow. I am constantly impressed with the level of care and attention that my children receive from the wonderful teachers and staff members. I feel so grateful to have found such a fantastic childcare center for my family.\"\nELFA adores the kids more than anyone do.",
      "time": 1721276830,
      "translated": false
    },
    {
      "author_name": "Jeremiah Yap",
      "author_url": "https://www.google.com/maps/contrib/107560951091508854750/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJgAdiWZb8grS2Zlcuvn2LclyQVAW0D98lFVnOez00AVZ-vDw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "Very wonderful school for children. We sent 2 of our boys there when they are aged 2 and 5, and we can see how much they learn and enjoy going to school. The team of teachers there are very caring and attentive to each child and we especially appreciate the Mandarin lessons at ELFA which is very highly recommended. Also they make learning enjoyable for our kids and they get to experience different senses and even have some robotics and outdoor activities to create a wholesome learning process for children.\n\nOverall, it is the best school our older boy has been, as we changed 2 other schools to finally find this school which is best suited for him.",
      "time": 1722482066,
      "translated": false
    },
    {
      "author_name": "mei yang",
      "author_url": "https://www.google.com/maps/contrib/108468284912591408871/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocItxtGVSX94yi6Ptk1Q3r2wZXezwdibQV7bwdhGznAsR4oUow=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "All of my children absolutely love attending ELFA Preschool! The curriculum is thoughtfully planned and keeps them engaged and excited about learning. The teachers are incredibly passionate and responsible, always going above and beyond to support each child's growth. We also appreciate Aunty Betsy’s delicious and nutritious meals. ELFA has been a wonderful experience for our family.",
      "time": 1720450896,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8623106891525471998",
  "user_ratings_total": 18,
  "vicinity": "Blk 866A Tampines Street 83, #04-01 Tampines Central Community Complex"
}