{
  "formatted_address": "#01-32 Kallang Wave Mall, 1 Stadium Pl, Singapore 397628",
  "geometry": {
    "location": {
      "lat": 1.3035901,
      "lng": 103.87256
    },
    "viewport": {
      "northeast": {
        "lat": 1.305350680291502,
        "lng": 103.8736858802915
      },
      "southwest": {
        "lat": 1.302652719708498,
        "lng": 103.8709879197085
      }
    }
  },
  "name": "Encik Tan",
  "place_id": "ChIJ4xGaZkkY2jERgdtXt_h0xB4",
  "rating": 3,
  "reviews": [
    {
      "author_name": "Kirito Howl",
      "author_url": "https://www.google.com/maps/contrib/105158001209933118628/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK1Ebjj6ebjpjsSzp6TqcH12v8uTm7TNGuhly9fHJ3blz6ePQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 weeks ago",
      "text": "Assuming it was the manager since she's wearing red, she was shouting at us when we couldn't hear her properly that the items was unavailable since her English isn't fluent.\n\nOnly stating that a specific noodle is available and we're like it's alright and chose a menu. Then she shouts at us to say don't have.\n\nQuite rude I would say. Not a customer service you would expect. Please do something about it since it's not a staff but someone who holds a higher position. Where's the professionalism at?",
      "time": 1746480927,
      "translated": false
    },
    {
      "author_name": "Ary Putra",
      "author_url": "https://www.google.com/maps/contrib/105654729718374077858/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVzoyBEy-rOZ74U2jVIRGhkuBdFwwqHlbHpt6pia77WrgUsbHff=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "Queue was a bit long at that time since there was an event in the stadium, especally for noodle menu.\n\nWe've ordered Fishball Noodle, Chicken Curry Rice, and Teh Tarik. Overall taste was a bit bland, including the teh tarik. The curry actually quite tasty, but I think they should put more curry sauce there. I heard that their Laksa is good enough, but didn't manage to try it.\n\nOverall it is a value-for-money option, the price is affordable with fulfilling portion. And they're halal certified too!",
      "time": 1707222225,
      "translated": false
    },
    {
      "author_name": "Sandra",
      "author_url": "https://www.google.com/maps/contrib/108444186723547263962/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUnW38qMfj2ceMSdn7jQuHtUhD6_Mr7txQBPqSQThSY_-y1RaE5Xg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "a year ago",
      "text": "Spacious n clean, not noisy coz it's off-peak. Ordered a dry premium minced meat noodles $7 n kopi tarik $1+ (I forgot). Fried wanton is stale. Liked d hotate n fried fish (扁鱼) added for premium. Aunty asked some questions to confirm my order of mee kia +chilli +vinegar -spring onion. She explained no ketchup is added if chilli is opted in. She double confirmed if vinegar is ok. She omitted d spring onion fr my bowl of soup but added a big handful into my bowl of noodles?! Kopi tarik is just normal kopi. No foam. n yes, it's made by d v fierce staff who doesn't smile even when I smile at her.",
      "time": 1702766154,
      "translated": false
    },
    {
      "author_name": "Bryan Lim",
      "author_url": "https://www.google.com/maps/contrib/101223150108065162492/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU4-zO710Uc7q7LEae78ELYGUU4h0N6xgrp1bLWpt3wV9E8YQNv=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "I had the most delightful experience at the noodle counter yesterday, all thanks to the wonderful lady who served me. From the moment I approached the counter, her incredibly polite and warm demeanor instantly made me feel welcome. It's rare to come across someone who genuinely cares about customer service, but she went above and beyond.\n\nNot only was she attentive and courteous, but the noodles she prepared were absolutely delicious. Her dedication to her work and her customers truly shines through, and she has the ability to brighten anyone's day with her positive attitude. It's hard to find such exceptional staff in Singapore nowadays, and I am extremely touched by her service. I would highly recommend anyone to visit just for the experience of being served by her.",
      "time": 1723197628,
      "translated": false
    },
    {
      "author_name": "christopher",
      "author_url": "https://www.google.com/maps/contrib/113072858555955373820/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJiIzZiXwpImUgRbZ0JGZ4j6mHou-I5v-Om1GsAfUTSidSUqw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Am here on 14th march 2025. Young Cashier lady for no reason, taking orders with a very bad attitude. It’s just an order and ask for bill amount situation since the counter don’t display the amount for us who are using capital pay. Drinks like kopi c and tea ice was bad as well made by same cashier as compared to last time made by an uncle (which is much nicer).\nOn the other hand, the aunty who is cooking noodles and laksa is friendly and nice. They should learn from her!",
      "time": 1741932320,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2217025528149826433",
  "user_ratings_total": 124,
  "vicinity": "#01-32 Kallang Wave Mall, 1 Stadium Place, Singapore"
}