{
  "formatted_address": "Pioneer Sector 2, Singapore",
  "geometry": {
    "location": {
      "lat": 1.3064377,
      "lng": 103.657345
    },
    "viewport": {
      "northeast": {
        "lat": 1.307875330291502,
        "lng": 103.6587503302915
      },
      "southwest": {
        "lat": 1.305177369708498,
        "lng": 103.6560523697085
      }
    }
  },
  "name": "Eng Kee Wanton Noodles",
  "place_id": "ChIJVd_oHQAF2jERxkzGtBuC1uI",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Doraemon",
      "author_url": "https://www.google.com/maps/contrib/112665277904119154671/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX2VSCcaT9axvOwx2nD8XD3PgZ8V5VFnv420aocMSfLa6GlcEmN=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "5 months ago",
      "text": "Today, I decided to try Eng Kee Wanton Noodles for my breakfast on the way to work.  It's just a small stall, but I wanted to give it a try.  I ordered the wanton mee, which cost $5.50.  The portion of meat was generous, but I felt the overall ingredients didn't quite match the amount of meat.  The gravy and noodles blended well, though.\n\nThey do accept PayLah, which is great!  They also do takeaway orders for lunch and large orders for factory workers, but you need to call or WhatsApp them before 10:30 am to place an order.  The owner is a friendly and humble guy – he seems to have a real dedication to his craft.\n\nI didn't eat my breakfast right away, so it had been sitting for about two hours by the time I got to it.  The meat was cold, but it still tasted pretty good.  I bet it would be even better if it were served hot.  They still use traditional plastic bags for the noodles, which gave me a bit of a nostalgic feeling.\n\nOverall, it was a decent experience.  If I'm working nearby, I'd definitely consider going back for breakfast again.",
      "time": 1733114529,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16345394953096416454",
  "user_ratings_total": 1,
  "vicinity": "Pioneer Sector 2"
}