{
  "formatted_address": "Block 450C Bukit Batok West Ave 6, #13-633, Singapore 653450",
  "geometry": {
    "location": {
      "lat": 1.3520558,
      "lng": 103.7437937
    },
    "viewport": {
      "northeast": {
        "lat": 1.353276680291502,
        "lng": 103.7452130302915
      },
      "southwest": {
        "lat": 1.350578719708498,
        "lng": 103.7425150697085
      }
    }
  },
  "name": "Equarius Photography",
  "place_id": "ChIJZ0XcdnMT2jERTwSJlHVslnM",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Guei Ru Cheong",
      "author_url": "https://www.google.com/maps/contrib/104413910896320663032/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKNeaMZr80_40yyzkb5i48XXh_LqfEMn5X77SU3zMvUJqkn4-Y=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "From the mini casual PWS session we had with Equarius, we knew we were in the right hands for our AD. Their professionalism, attention to detail, and passion were truly exceptional. Not only did they capture every beautiful moment, but they also went above and beyond to make us feel comfortable and at ease throughout the entire shoot. We are beyond grateful for their amazing work, which allows us to relive our wedding day each time we watch the SDE video. ♥️✨ We can’t wait to see our AD photos and video! ☺️\n\nWe wholeheartedly recommend Equarius Photography to our friends and family.\n\nJH & GR\n23 March 2025",
      "time": 1742970722,
      "translated": false
    },
    {
      "author_name": "Crystal T",
      "author_url": "https://www.google.com/maps/contrib/102108104498813827090/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJXgTlSdVM8VFdbcgFaAvht4PDq1Q8LGFkwtNe5rYPDaHdemw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Chris is one of the most talented , professional, fun and passionate person and you’ll definitely want him to be part of your big day. My team love him so much! I never regret engaging him because my big day is much more memorable with him around while capturing every moment. I highly recommend everyone who wish to engage photographers and videographer.",
      "time": 1741884628,
      "translated": false
    },
    {
      "author_name": "Jeraine Jianing",
      "author_url": "https://www.google.com/maps/contrib/117297279438020515484/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLe77SPODS8SRiNuNpPmU-yxPfcw-7ro11mfh-HhqjO6S5rjQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "We couldn’t be happier with the incredible work of Equarius for our wedding! From start to finish, their professionalism, creativity, and attention to detail exceeded our expectations.\n\nThe photos captured every special moment beautifully—whether it was the emotional candid shots, the vibrant colors, or the artistic compositions.\n\nWe highly recommend Equarius to anyone looking for a talented and dedicated wedding videographer and photographer. Their work speaks for itself, and we’ll forever be grateful for the memories they preserved for us.",
      "time": 1733669543,
      "translated": false
    },
    {
      "author_name": "Yun Jie",
      "author_url": "https://www.google.com/maps/contrib/104977501277258209480/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUKJVjR7GmU9K_1aGOo9kFWkwkLJqruM5oFPLIXL8H8LzaMDN8E=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "We recently engaged Equarius Photography for our actual wedding day and we had a really great experience! The way the team handled everything on our big day just made us feel so comfortable. Their easygoing and humorous personality ensured there were no awkward poses or stiff smiles. The team had a great way of making everyone feel natural in front of the camera while still getting the perfect shots.\n\nWe also loved the same-day edit video, as they somehow managed to pull together all the day's best moments!\n\nAll in all, we had a wonderful  experience with them and would strongly encourage anyone to look for them if you're looking  for a photographer/videographer for your wedding!",
      "time": 1731402573,
      "translated": false
    },
    {
      "author_name": "nice celine morales",
      "author_url": "https://www.google.com/maps/contrib/109400016682221021464/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLNOYsi5jxeKrBmj4isxR12sMIZetAJcnf3FQYrztoXazIqfA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "It was a pleasure working with Equarius Photography for our mini pre-wedding shoot and wedding day recently. From the beginning, their team demonstrated professionalism, creativity, and exceptional attention to detail until the very end.\n\nFrom the pre-wedding shoot to just days before the actual day, they were open to our vision of how we hoped the photo- videos and SDEs would turn out, while also bouncing ideas and expectations off us. Given our packed wedding day schedule, the team arrived well in advance for our early call time. They took the time to understand our vision for the day and made sure every important moment was beautifully documented. Whether it was the quiet, intimate moments with our loved ones or the energetic fun shots with our bridal squad, Equarius Photography truly captured the essence of our wedding day.\n\nThe team was unobtrusive but always in the right place at the right time. They made us feel comfortable throughout the entire process, and their easygoing demeanor helped us relax and be ourselves. We particularly appreciated how they guided us while still allowing natural emotions to flow throughout the day. Despite our packed wedding day schedule, they managed to cover all the shots and created a beautiful, quirky, and touching SDE video.\n\nOverall, we couldn't have asked for a better experience with Equarius Photography. Their exceptional service, attention to detail, and ability to make us feel at ease on such an important day made them one of the highlights of our wedding. We highly recommend their services to anyone looking for a photo-video team that goes above and beyond to create quality memories that touch your heart.\nThank you, Equarius Photography! 💜",
      "time": 1739200055,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8328963813127291983",
  "user_ratings_total": 34,
  "vicinity": "Block 450C Bukit Batok West Avenue 6, #13-633"
}