{
  "formatted_address": "302 Pasir Panjang Rd, Singapore 118643",
  "geometry": {
    "location": {
      "lat": 1.2875415,
      "lng": 103.7796554
    },
    "viewport": {
      "northeast": {
        "lat": 1.288901080291502,
        "lng": 103.7809928802915
      },
      "southwest": {
        "lat": 1.286203119708498,
        "lng": 103.7782949197085
      }
    }
  },
  "name": "Eshkol Valley Preschool @ PPCC Pte Ltd",
  "place_id": "ChIJU0MTBasb2jERaGTv2_B4Ydw",
  "rating": 5,
  "reviews": [
    {
      "author_name": "JING SUN",
      "author_url": "https://www.google.com/maps/contrib/110272752319805972880/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIUG4ks5E1_dE_7OkBYrwod5i4Pmgr_ufb8pjt0ybSkLQtUxA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "My son graduated from Eshkol Valley Preschool Pasir Panjang campus in 2024. Teachers at Eshkol Valley Preschool are very patient, kind and full of love. They understand every kid is different and will apply different strategies to guide kids along the preschool journey. They are not only making the kids academically strong, but also focusing on character building. My son really enjoys the time with Eshkol Valley and loves his teachers. Would recommend!",
      "time": 1737041043,
      "translated": false
    },
    {
      "author_name": "Tinghui Goh",
      "author_url": "https://www.google.com/maps/contrib/114986033557274597654/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKC3-OGfgrNJF0hun6Xbb9GfpGPOqYjjsrW9lxGDjpvFZDspg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "My daughter had many wonderful years at Eshkol Valley (Pasir Panjang) thanks to the dedicated teachers. Many of the teachers have been in the early childhood industry for a long time and are experienced and patient.  My daughter enjoys going to school and she loves the food lol . Would recommend!",
      "time": 1735692042,
      "translated": false
    },
    {
      "author_name": "Happy C",
      "author_url": "https://www.google.com/maps/contrib/100567371835393536320/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUU31gPoeVWN4BpBM4WXNe6ggC9ihR3NOjgt7koqqLQQw7Yz9M=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My son enjoyed a very happy time here. The teachers are all genuinely caring and really go the extra mile to do their best to help my son learn. Beyond purely academic learning, we are confident that the authenticity and good values displayed by the teachers will surely be inculcated in each child. My son really looks forward to going to school everyday and this speaks alot. The demographic is also diverse comprising locals and expats from many countries. We found this to be enriching as it gives early exposure to different cultures and thinking.   Though we are sad to leave to move on to Primary school, we are very sure that our son will leave with the best of memories and will look back with fondness in the years to come. We are very thankful to have found this place and hope to keep in touch.If you are looking for a cozy and more personal experience for your child, this is the place.",
      "time": 1701830554,
      "translated": false
    },
    {
      "author_name": "Ann Francis",
      "author_url": "https://www.google.com/maps/contrib/116835473890712667672/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIiV3sSb4YMl4BtnuZVdarpKNHktxjHPqpCv1lHwkxuTimP2g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I would like to extend my deepest gratitude to all the teachers, especially TCR Bee Lin, for their unwavering guidance and nurturing of my daughter during her time there. The passion and care that each of you shows is truly inspiring, and I am so thankful for the positive impact you've had on her.",
      "time": 1739281915,
      "translated": false
    },
    {
      "author_name": "Pooja A",
      "author_url": "https://www.google.com/maps/contrib/106254801565435587091/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLFjA9aS7vo5un9HjuRcWPonryhprLtrtxhW6O3WWmQBjrqyQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My kids graduated from this school in 2023 from Pasir Panjang campus. My kids are here since N1 and they  enjoy every day in school. As we say, Teachers are instrumental in creating a nurturing environment for the child in school and this school for sure has best Teachers. Their dedication is evident in nurturing a love for learning, and their patience and encouragement have contributed to our kid's positive experience. The creative and engaging teaching methods make the class a joyous place for kids to learn and play. Its sad, our kids are no longer here but the teachers have prepared them well for Primary school and laid the best foundation. We appreciate the teachers' commitment in cultivating a supportive and enriching foundation for our child. Thank you for your invaluable efforts!! Our kids will for sure miss all of you and the fun!!",
      "time": 1704251522,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15880106736962462824",
  "user_ratings_total": 8,
  "vicinity": "302 Pasir Panjang Road"
}