{
  "formatted_address": "718 Mountbatten Rd, Singapore 437738",
  "geometry": {
    "location": {
      "lat": 1.3004695,
      "lng": 103.8866758
    },
    "viewport": {
      "northeast": {
        "lat": 1.301974830291502,
        "lng": 103.8877387302915
      },
      "southwest": {
        "lat": 1.299276869708498,
        "lng": 103.8850407697085
      }
    }
  },
  "name": "EtonHouse Nature Pre-School",
  "place_id": "ChIJMYkKdUMY2jERj9LV5z8C4Z8",
  "rating": 3.8,
  "reviews": [
    {
      "author_name": "Marc Rodriguez",
      "author_url": "https://www.google.com/maps/contrib/110071303725121480492/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLVcatk6AUbtiHvgEw3c6Pa5PLIdL49RBiobaP75Z4gQvobHA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Best decision we made.\n\nThe school has a structured way of easing in children, which worked wonders. Our 1.5-year-old enjoyed it from day one. Three months in, thanks to the teaching approach, impressive school facilities, and the chance to learn alongside a diverse set of classmates, our little one's development has been amazing.\n\nMy wife and I also love the opportunities to take part in events, like Chinese New Year celebrations and cultural sharing sessions.\n\nA huge thank you to Ms. Michelle and her team for their warmth and dedication—they've made the experience fantastic for both our child and us.",
      "time": 1742305413,
      "translated": false
    },
    {
      "author_name": "Zuzana Podolanova",
      "author_url": "https://www.google.com/maps/contrib/101089429769169677646/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW6AE13cidG_uwVjGkenBjG9VMYoQWjjXfg9sOf_AFffx7yqUqP6g=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Update to the review I wrote 10 months ago about some challenges at this preschool, but I’m happy to say the situation has since stabilized. The underperforming teachers were replaced, and the new staff are excellent—professional and attentive to the children’s needs.\n\nThe transition to a nature-focused preschool is now complete, with the new playground, butterfly trellis, and other outdoor features enhancing the space.\n\nThe Principal remains highly engaged with parents, regularly seeking feedback and showing a strong commitment to improvement.\n\nThe school has made great progress and is now a much better environment for children.\n\n——————————-\nUnfortunately, our experience with Etonhouse Nature Pre-School has drastically declined following recent organisational changes, compelling me to write this review. The changes have led to a significant turnover in staff, with many of the original, highly competent teachers leaving. This has not only disrupted the learning environment but also affected the quality of education and care provided to the children.\n\nThe replacements for these teachers have been, frankly, disappointing. The lack of experience and competence among the new staff is glaring, particularly when contrasted with the high standards we had come to expect from an international school where the fees are substantial.\n\nI would love to provide multiple examples in this review but decided not to.\n\nGiven these issues, I strongly advise parents to reconsider enrolling their children in Etonhouse until they are properly staffed, teachers gain experience. The decline in educational quality and the overall learning environment is alarming for a school that charges such high fees and claims to offer an international standard of education.",
      "time": 1736743924,
      "translated": false
    },
    {
      "author_name": "SY Q",
      "author_url": "https://www.google.com/maps/contrib/102028388482014629554/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK5BEcxfSIggTr1WX4kww7KlVlaVRSTa2AMpVzssGX9utyg8A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "As it is prior understood that Etonhouse International Research at 718 was under an entirely different system and management, it is very unfair and unreasonable to grade the school as the same.\n\nMichelle and team have put great effort into the transition from the former 718 program into what is rebranded as Etonhouse Nature Pre-school.\n\nAs a parent, I am deeply satisfied to having my child transferred here from the former 717 branch. Development improvements and advancements are very obvious, well above peers from other schools.\n\nI strongly recommend EtonHouse Nature Pre-School, under the care of Michelle and her team.",
      "time": 1710825800,
      "translated": false
    },
    {
      "author_name": "Amy Tong",
      "author_url": "https://www.google.com/maps/contrib/103583873007122931938/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKX1pFV16kYQ08zV811mPfbvwdgnGrbZWEBsFFjB2iCYL_CzQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "EtonHouse Nature Pre-School curates a holistic nature environment that allows play to be infused for children’s learning. I am very touched by the sincerity and care of the Nature family for going above and beyond to guide the young ones learn well with nature. Thank you for your dedication and highly recommend for young children.",
      "time": 1716783350,
      "translated": false
    },
    {
      "author_name": "Jon Lin",
      "author_url": "https://www.google.com/maps/contrib/103753709155041190720/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW_s6k6HRYVNHyTeo2jW1Ruh3uWJcwU3klkvVfQ1vWiDIfhprA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "The revamped outdoor environment is great. Certainly a lot of details to include the various elements for different exposure. My child's teacher has also been kind and helpful in her induction into the school.",
      "time": 1710810856,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11520491795286184591",
  "user_ratings_total": 16,
  "vicinity": "718 Mountbatten Road"
}