{
  "formatted_address": "53 Duchess Ave, Duchess Garden, Singapore 269119",
  "geometry": {
    "location": {
      "lat": 1.3241537,
      "lng": 103.8040345
    },
    "viewport": {
      "northeast": {
        "lat": 1.325607680291502,
        "lng": 103.8053610802915
      },
      "southwest": {
        "lat": 1.322909719708498,
        "lng": 103.8026631197085
      }
    }
  },
  "name": "Facets Singapore Pte Ltd",
  "place_id": "ChIJAfJY_4wZ2jERIShO-A-Vwuc",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Betty Wong",
      "author_url": "https://www.google.com/maps/contrib/107226512839557110252/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKjU7FyJpnkaPCmEa5VtmBGWW9vSw4iUCD1C0T-t3kl9TWk7Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "I have a nice experience with Facets Singapore to reset my late mom's white gold diamond earrings into a classic modern casing. Thanks to Suresh who is professional and helpful in meeting my urgent needs of getting the reset earrings in 2 days. I really love the new look of my earrings and happy with the high standard and quality of the workmanship.",
      "time": 1747026002,
      "translated": false
    },
    {
      "author_name": "Madelin Farrington",
      "author_url": "https://www.google.com/maps/contrib/116332932136665747965/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIPhNSLuoTO_KmcLF7qcnTPKs8WLfICglCb0ZcjNFnxAZfS_g=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "I have used Facets for a number of items over the last fews years, from simple fixing of bracelets and necklaces to resigning wedding and engagement rings and designing a bespoke piece from a Tanzanite purchased on holidays. The craftsmanship and service has always been outstanding. I have also opted to use them over the jewelers that some of the pieces where purchased from.\nSuresh has an incredible knowledge of stones and diamonds and recently was able to give me insight into an heirloom piece from my late grandmother.\nWhether it's something small or large Facets take care of it with the highest standards and quality.",
      "time": 1746246392,
      "translated": false
    },
    {
      "author_name": "Ophelia Lew",
      "author_url": "https://www.google.com/maps/contrib/115378296713392488981/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJycHp7GJp2PqJFTPCLv9i9DlB5tNonor8VZaZd45SHQa5kPQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Resetting my engagement ring was a deeply meaningful decision, and I couldn’t be happier with how it turned out. My original ring was a gold setting with a princess cut diamond flanked by two delicate heart-shaped diamonds—a design I loved for years. But I felt it was time for a refresh that reflected where I am now, both personally and stylistically.\n\nThe result? Absolutely breathtaking.\n\nThe princess cut diamond now takes center stage like never before, catching the light from every angle, with a hidden halo and a micropave setting, and the transformation is beyond anything I imagined. The hidden halo adds just the right touch of sparkle—subtle yet dazzling—while the pave setting gives the ring a clean, streamlined look that feels both modern and timeless. It feels like I’m wearing a brand-new ring, but with all the heart and history of the original. The finish, the setting, and the balance of the design all speak to a level of fine workmanship that’s hard to find.\n\nFrom start to finish, the process was smooth, collaborative, and exciting. I met with Suresh and his lead designer, Nashley, and they both truly listened to what I wanted (I knew I wanted to have the hidden halo and cathedral design) and they delivered something far better than I could have envisioned. Suresh is extremely knowledgeable about diamonds and ring settings (he could also tell the origins of my engagement ring after carefully looking at it) and he was forthcoming in our discussion of what would work and what wouldn’t, which I appreciate. He was approachable and really took the time to understand me, and when it came to translating the vision I had in my head into a design, Nashley did an absolutely fantastic job.\n\nIf you’re thinking about resetting your engagement ring, I can’t recommend Facets Singapore enough. Mine turned out to be everything I hoped for—elegant, meaningful, and uniquely mine.",
      "time": 1746235120,
      "translated": false
    },
    {
      "author_name": "Giselle Seow",
      "author_url": "https://www.google.com/maps/contrib/105573100695624962691/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW_B2hdSyNCy72h19OaH3hm0grGdvG1uS0vk83MX09FOOv7t8lNzQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "I had such a good experience with Facets on my heirloom revival journey.  Nashley is absolutely lovely and it was great working with her in terms of translating my mood board ideas into an actual design concept. Suresh is amazing, and has such an incredible knowledge on diamonds and the technical aspects with regards to bringing the design concept to life.  Another thing I really liked about Facets is their transparency on costing which I appreciated.  They are also very reasonably priced especially for producing such great work and providing incredible customer service.  They took my grandmother in-law's ring to a whole new level and I now have an engagement ring that's designed 100% to my liking, to stack with my wedding band (removed the main sapphire, incorporated diamonds from my other jewelry, set it in a custom design basket-ish setting).  They also did such a good job reviving my earrings by replacing the stems and clasp which was what I asked; they also cleaned up the basket thing (they had so much oxidisation, they looked like copper rather than gold) so well that they look completely brand new, and fixed up little imperfections in the prongs that I didn't even notice - goes to show how much pride they take in their work!  I would highly recommend Facets and will definitely be going back for more projects in the future when I can think of something.  Thank you so much, Facets!",
      "time": 1658248557,
      "translated": false
    },
    {
      "author_name": "hester calkhoven",
      "author_url": "https://www.google.com/maps/contrib/108506876849467343915/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK6qggZG23zX5gnbdoH--Hir4LjhggLWa7kCg51ptR-bYoUHQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "I had worked with Facets Singapore in 2007 and was very pleased with their work and servics then. We now needed a ring to be reset, my engagement ring, to stack better on top of my wedding band. Not only did they suggest a beautiful new setting, they suggested a beautiful new design.  They also designed and made a ring I lost (which was made by them in 2007) which turned out even more beautiful than the \"old\" version. Suresh Hathiramani, the owner of Facets Singapore, is very knowledgeable and a real gentleman dealer. Totally trustworthy!",
      "time": 1729390484,
      "translated": false
    }
  ],
  "types": [
    "jewelry_store",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16700074264066140193",
  "user_ratings_total": 38,
  "vicinity": "53 Duchess Avenue, Duchess Garden"
}