{
  "formatted_address": "746 Bedok Reservoir Rd, Singapore 470746",
  "geometry": {
    "location": {
      "lat": 1.3372194,
      "lng": 103.9212616
    },
    "viewport": {
      "northeast": {
        "lat": 1.338470630291502,
        "lng": 103.9226055302915
      },
      "southwest": {
        "lat": 1.335772669708498,
        "lng": 103.9199075697085
      }
    }
  },
  "name": "FAITH Clinic (Bedok)",
  "place_id": "ChIJw6fAMFo92jERRZq48r8wiG0",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Leo Y",
      "author_url": "https://www.google.com/maps/contrib/117835304336272132768/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKyRedutVCmby9ir76HMuIS6AiIMaaidDRQGW0ysKrw4F-86Q=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "in the last week",
      "text": "Dr Goh is friendly and kind, provided a good medical services.\nThe receptionists or counter staff are simply hopeless, not friendly and zero customer services. They dont allow the patients to the know the cost of bill if you are claiming the insurance. They speak with impatience tone as if you are owing them $$.",
      "time": 1747269952,
      "translated": false
    },
    {
      "author_name": "FAN ZHANG",
      "author_url": "https://www.google.com/maps/contrib/109274334828546128273/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXzhePEuORZRziBq2avjmVLN49j3gLBgbQ9XcQQbt9R4rCPoQ1Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Had 2 excellent experiences with Dr Goh over the past 3 days, one for influenza vaccination, one for my wife's checkup. Dr Goh is friendly, thorough, and extremely patient. He is also bilingual and could communicate medical terms in Mandarin effortlessly. Thumb up for such great service!",
      "time": 1739014219,
      "translated": false
    },
    {
      "author_name": "Pecan Pie",
      "author_url": "https://www.google.com/maps/contrib/102778119224471464181/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLTuWxedjuFJ78WpeVTayHEXLvu0kAE4suEmmscSbF9QbzKoQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "I have no qualms with this clinic and think the doctors and clinic assistants are professional and committed all except one, this lady I do not know her name is quite plump with long hair maybe in her twenties or early thirties, she always wears all black, on two occasions outside the clinic, around the area, she had walked straight into me because her eyes are glued to her phone while she’s walking and everyone has to get out on her way because she does not bother to give way, she just walks eyes glued to her phone and if you don’t see her she will bump into you. In fact, on one of the occasion when she bump into me,  instead of saying sorry she “tsk” me, the audacity. Really inconsiderate and entitled behavior. As for her work in the clinic, i have asked her questions a few times and she shows a black face like i am bothering her answering my queries. She doesn’t seem like she likes her job and maybe should think of another career which isn’t front line.",
      "time": 1742286003,
      "translated": false
    },
    {
      "author_name": "Faulcon DeLacy",
      "author_url": "https://www.google.com/maps/contrib/112668734475122106292/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKPLFVcg2LmOB-MyHyh0FYG6u42DNubLg7k2QM5__AqPvIwIw=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "2 months ago",
      "text": "I came to revisit but 2 (apparently new) receptionists talk differently one asked me to provide a physical insurance card, the other asked for a picture of it.  I had a medic record here for years already and I came here to revisit. Those  young lady and male receptionists forced me to go back to take my card. When I came back they did not even check the ID stuff. So what is the point of this trouble? I had my name, insurance company, ID and phone number registered here long before already. Is that not enough to verify my eligibility?!\n\nIn the end, the male receptionist provided me with an incorrect number of medicines. I was lucky enough to figure it out onsite. Cannot bear to deal with these 2 unprofessional receptionists again.\n\nBefore leaving I asked again, physical insurance card or pic or singpass. Male receptionist insisted 3times that a physical insurance card is required. While later that lady receptionist told me picture also works.\n\nSo dear clinic owner. Which version should I trust?",
      "time": 1740282576,
      "translated": false
    },
    {
      "author_name": "C C",
      "author_url": "https://www.google.com/maps/contrib/106489790648321155185/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocITrNA22znkSHUiUjyvuw5CN-tgTfOZS_k8Pe8DilTjm8CltA=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "3 months ago",
      "text": "Visited Faith Clinic for the first time. I am impressed for the detailed diagnosis and friendliness from Dr Goh. He took time to explain and advise me on my condition despite it being a cold and cough situation.\nIt’s better than some doctors who don’t care to explain the condition and just blindly type on their computer and prescribed. I appreciate him for making me feel relaxed and taking time in the appt.\nBut I have to say that the receptionist definitely needs coaching and a proper customer service training . She is unfriendly and is not suited for a medical receptionist role. I get it that it’s not a big and flashy clinic. I also get it that it’s the third day of CNY and you are at work. But if you choose to show up, live up to your role to welcome your patients and at least, give them a kind smile. Yes, even if you need to fake it cos you chose to be a receptionist.\nSo because of her attitude, this clinic is getting 3 stars.",
      "time": 1738318673,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7892611947935865413",
  "user_ratings_total": 102,
  "vicinity": "746 Bedok Reservoir Road"
}