{
  "formatted_address": "415 Bukit Batok West Ave 4, #01-272, Singapore 650415",
  "geometry": {
    "location": {
      "lat": 1.3632249,
      "lng": 103.746585
    },
    "viewport": {
      "northeast": {
        "lat": 1.364495180291502,
        "lng": 103.7479370302915
      },
      "southwest": {
        "lat": 1.361797219708498,
        "lng": 103.7452390697085
      }
    }
  },
  "name": "Family Care Clinic",
  "place_id": "ChIJmYLanjQQ2jERf4FTEW9PliA",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Karfu Yap",
      "author_url": "https://www.google.com/maps/contrib/113879870508640754831/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJTm4B2oxGkGmDVVr4hZGRn6mh4Ca4qaCmer13qSBbPpvorXQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "I am writing this review to express my sincere gratitude to Dr. Louis Ng for his exceptional care in treating my long-standing skin problem. For so long, this condition has been a source of significant distress. However, thanks to Dr. Ng's expertise and treatment, my skin has now almost fully recovered. What impressed me most was his integrity and dedication to his patients. After seeing such significant improvement, Dr. Ng informed me that a follow-up appointment was no longer necessary. This level of honesty and focus on the patient's well-being is truly commendable. Dr. Louis Ng is undoubtedly the best doctor I have ever encountered, and his medical ethics are truly exemplary (太有医德了!). I highly recommend his services to anyone seeking a knowledgeable and ethical dermatologist.",
      "time": 1745297174,
      "translated": false
    },
    {
      "author_name": "Sarah Lee",
      "author_url": "https://www.google.com/maps/contrib/109863890159976102965/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU_WTr-IW42OyJhjsE14T7lAobq2iWPCDRLdxL7p4qvIV-Fy65M=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "3 weeks ago",
      "text": "This clinic which is often seen with patients queueing, yet has a rude grey hair dispenser who stopped me when I was about to ask her regarding my medication after seeing the doctor, she gestured me with her hand to stop, hinting she was busy, surprising she had time to put on her gloves. Happened on 24 April 2025 around 3.30 pm so I did what i was told and went back to my seat. Used to be the receptionist seated next to her, who seemed impolite, registering patients, likewise now is the dispenser turn to be rude.",
      "time": 1745487922,
      "translated": false
    },
    {
      "author_name": "ice star",
      "author_url": "https://www.google.com/maps/contrib/116099358050128588796/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXFY-6bUscZXokItL1vC4hh5kbaqWmCx9Ct_pfBWn8lPxLQSWA1Ig=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I have consulted 2 clinics for my leg infection. The doctor from  Family Care Clinic was more caring and detailed. Dr Soh treated my wounds patiently and covered the infected areas with dressing.",
      "time": 1731998686,
      "translated": false
    },
    {
      "author_name": "bell bell",
      "author_url": "https://www.google.com/maps/contrib/110195560885144507212/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJyzgMq-mwz9ag-991Z7eDAs_rdG-o0zxCEwSwInrZxT9KYOw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "I will always travel here for my cough remedy. Long que to see Dr Cheung and only come once a month. Dr Louis were good too. Personally I think weekdays evening should be shorter waiting time.",
      "time": 1725680832,
      "translated": false
    },
    {
      "author_name": "Serene Ng",
      "author_url": "https://www.google.com/maps/contrib/113122419163846230487/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWWltsCBikUe1GJ504hcBcJUqyyJ9cSDj1pZOaAy7ynwDoCYire=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Called for an appointment before 9am on Tuesday and was told the earliest availability to be on 11:15am. Came on time and informed counter staff, then told to wait around 30mins as there were 6 patients in front of me.\nAfter an hour i went to check with counter staff, she mentioned that there is 2 more patients…\n\nFirst time when I came on Monday, i was waiting about an hour despite calling upfront. Gave the benefit of doubt that it happened because there was unusually peak crowd on that day.\n\nSeems like this is a frequent practice that appointments are not honoured..they could have asked me to come back an hour later instead of mentioning half the waiting time, giving expectations unnecessarily.\n\nIn short, an hour to see the doctor and another 15mins to get the medication and make payment.\nNot too expensive, total was $50 plus\nLast time was around this price as well.\n\nUpdated: Dr Ng called and explained that there was an emergency situation and apologised for the long wait. I’m grateful that there is an explanation offered and the effort given to my feedback was well received. I do understand and comprehend that they are working on improving the service quality and will therefore look forward for a better experience in future with this clinic.",
      "time": 1739440816,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2348151594170941823",
  "user_ratings_total": 106,
  "vicinity": "415 Bukit Batok West Avenue 4, #01-272"
}