{
  "formatted_address": "158 Bedok South Ave 3, #01-581, Singapore 460158",
  "geometry": {
    "location": {
      "lat": 1.3187668,
      "lng": 103.9450566
    },
    "viewport": {
      "northeast": {
        "lat": 1.320071280291502,
        "lng": 103.9462425802915
      },
      "southwest": {
        "lat": 1.317373319708498,
        "lng": 103.9435446197085
      }
    }
  },
  "name": "Famicare Bedok Clinic",
  "place_id": "ChIJT2_lHs8i2jERUwiaMz_b_qU",
  "rating": 4,
  "reviews": [
    {
      "author_name": "James",
      "author_url": "https://www.google.com/maps/contrib/101934644188155892764/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK8aWXdwFcStb501EDvtDH8BHj23dFi3kQZwCOfmVmnJHeSDNE=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "So bad. Google said the clinic opened at 9am. Was there with my girl at 9am to get her an MC. The hours painted on the window say 9am. Small paper sign on the door has different hours than the window, says open at 10am. We leave and come back at 10am. Nurse behind counter clearly has a cold (red around nose, turning away from us to wipe nose) but doesn't wear a mask. Tells us no doctors until 2pm. Why bother opening the clinic? The nurse should be home on MC and the doctors should repaint the window and update Google. Went to True Clinic 3 doors down and had the MC within 20 minutes. Very fast and friendly service at True.",
      "time": 1736230034,
      "translated": false
    },
    {
      "author_name": "JXiang Lee (ShowTime)",
      "author_url": "https://www.google.com/maps/contrib/116538849232564564665/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIKbT-Heh-NF8PkbX2jXAnN669qvxRRGNtfJhvph2eXVeG23Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Dr Roy and his team is helpful and friendly. Although waiting time is abit long but it’s worth the wait. It’s vry clean in the clinic inside and doctor’s is knowledgeable and patient. Can scan the “ QR code “ to write your experience. Quite many payment methods and there’s offer when using some payment methods ! Recommended ppl who is sick or wanna slim down some weights. Delightful moment in this place !👍🏻😄😄",
      "time": 1692690337,
      "translated": false
    },
    {
      "author_name": "Daniel Xu",
      "author_url": "https://www.google.com/maps/contrib/103024842564359725502/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIkOCgb_hpNZg9EGI6erszkvEk1gj7fn53ZN2L3wJQfTNx43A=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "10 months ago",
      "text": "nurses are rude and unwelcoming giving very plain responses and answering queries in a very \"how did you not know that\" kinda way also made me pay $15 upfront to do art test or else i was denied entry (maybe this is the practice but ive nvr had to do this at any other clinic before) Doctor is also unprofessional and hella egoistic and judgy, asked me if I need mc and for how long and pretended to discuss with me just to say that he can only give 2 days which is literally the mimimum number of days despite literally acknowledging my illness and even said he would not even give if he thought I was lying about my condition, why would I pay money to see a doctor if I am not sick at all ??? I think having that suspicion about your patients to begin with is super unprofessional already. He stated that it was because of the new MOH guideline which I can kinda understand but I was very sick and he was generally very unprofessional overall",
      "time": 1720543439,
      "translated": false
    },
    {
      "author_name": "Yiqing Chen",
      "author_url": "https://www.google.com/maps/contrib/109782722731338463533/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK5yuwyKsiojzvZ57pO-VQU8A82A2T4SutrGw0zzkcHYCIzRw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "This is NOT a standard GP clinic. Opening hours are not indicative of working hours. For most of the opening hours there is NO doctor present in the clinic. You MUST call to make an appointment before visiting. I just feel that this needs to be mentioned since this isn’t a norm for most clinics here.\n\nThis is a clinic review, and not a doctor/staff review. As I’ve tried to come by twice (my bad) and there is never a doctor there. Thankfully there are a couple of other clinics close by that you can go to instead.",
      "time": 1681700442,
      "translated": false
    },
    {
      "author_name": "Mer L",
      "author_url": "https://www.google.com/maps/contrib/113480892415870846092/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK4g11ddfMbzqG5CQzBYia-suqICE1Ef5fhh6BIGDdVK79pU34=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "5 years ago",
      "text": "Operating hours stated 9am-3pm, however doctor (Dr Roy Chio) only arrives around 11.30am-12.15pm. Once the doctor arrived, it seems like he just rushed through all his patients..\n\nCounter Nurses were really friendly and helpful. Thank you for that.\n\nHowever, doctor was not friendly at all. merely asked what was the problem. not a single bit of concern or explanation on my illness was given. i don’t expect him to treat patients like a baby.. but at least.. make them feel comfortable and act like you really want to treat them. 🤦🏻‍♀️",
      "time": 1570770542,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11961238724837771347",
  "user_ratings_total": 110,
  "vicinity": "158 Bedok South Avenue 3, #01-581, Singapore"
}