{
  "formatted_address": "18 Marina Gardens Dr, Singapore 018953",
  "geometry": {
    "location": {
      "lat": 1.2833079,
      "lng": 103.866972
    },
    "viewport": {
      "northeast": {
        "lat": 1.28399035,
        "lng": 103.8679898302915
      },
      "southwest": {
        "lat": 1.28126055,
        "lng": 103.8652918697085
      }
    }
  },
  "name": "Far East Organization Children’s Garden",
  "place_id": "ChIJd2IAFAIZ2jERfs81ovLQcSk",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Y S",
      "author_url": "https://www.google.com/maps/contrib/114810510179567579369/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXWxmWFiVE-5zhT0JeT-ThrR_CN3RxRIR-w8a-GRYaLjtM8KKkFXQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "2 weeks ago",
      "text": "Free and clean public water park for children. Quite well maintained although some of the water features no longer working like it was (like the rotating fountains).\n\nThe thing is that it got very very crowded during May Day public holiday. There is also no shower to rinse off in the changing room (toilet). The changing area is pretty small and gets crowded.\n\nOne last thing, not related to the park but rather the children behavior. Parents/caregiver please don’t scroll your phones when you are there. Watch out and educate your children especially when they are playing with water jets (see the photo). They might be standing directly on top of it with the water jet pointed to a certain part of their body too long after discovering “new sensation” they should have not. I noticed there are many like this which I think is inappropriate, but the children are too innocent to know that.",
      "time": 1746104476,
      "translated": false
    },
    {
      "author_name": "Dhananjay Garg",
      "author_url": "https://www.google.com/maps/contrib/105192542383225533490/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX6CNJjSBpKo1xTmYD61dS4YfnCUxpCTsCMZKXvmOYNgtWMhxNK=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "We recently visited the Children's Garden at Gardens by the Bay, and it was such a memorable experience for our little family. My wife and I took our 2-year-old, and while we had planned to explore all the different play zones, it quickly became clear that the Water Play Area was the absolute star of the show for our toddler!\n\nThe water jets, fountains, and fish sculptures were a total hit, and the interactive water effects kept my son laughing and splashing for hours. The area for toddlers (1–5 years old) was especially delightful, with stepping springs and mini water tunnels designed perfectly for little ones. It was a joy to see him so engaged and happy in the cool water under the Singapore sun.\n\nWe skipped the dry sand areas like the Rainforest Tree Houses and the Adventure Trail this time since my son was completely captivated by the water works. That being said, the lush greenery around the garden made the whole experience feel relaxing and refreshing for us as parents.\n\nThis is one of the best free outdoor play spaces we’ve been to in Singapore, and I can’t recommend it enough for families with kids. We’ll definitely be back for another day of fun—and maybe next time, we’ll convince our little water enthusiast to check out the dry zones too! 😊",
      "time": 1736849100,
      "translated": false
    },
    {
      "author_name": "Michelle Ng",
      "author_url": "https://www.google.com/maps/contrib/107683263981200256448/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIRNXm9Y7N2VAgXw53Fh5P3bMu6F12wGZ2q60QdTZRRsYN9YeOO=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "The Far East Organization Children’s Garden is an absolute gem for families! Located within the stunning Gardens by the Bay, this water play area is completely free—a rare find in Singapore for such a high-quality attraction.\n\nThe main water play area is perfect for kids to cool off, with interactive water features and fountains that keep them entertained for hours. For parents with younger children, there’s a dedicated toddler play area designed with gentler water features and plenty of shade, ensuring that even the littlest ones can join in on the fun safely.\n\nThe garden also offers plenty of seating and shaded spots for parents to relax while watching their kids have a blast. It’s a wonderful way to enjoy a family outing without spending a cent.\n\nTip: Bring a change of clothes, towels, and water shoes for your kids to make the most of the experience.\n\nIf you’re looking for a fun and free activity that both you and your kids will love, the Far East Organization Children’s Garden is a must-visit!",
      "time": 1733734683,
      "translated": false
    },
    {
      "author_name": "Edwin Petrus",
      "author_url": "https://www.google.com/maps/contrib/114785935323023325370/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjViVW8tEXRYc3BatiNcUhGofE27kumEgAfonPrCpL4BlwYPaqBsCw=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Gardens by the Bay also caters for the family and kids needs with the Far East Organization Children’s Garden. Size of the garden is not that large, but it is a play ground for kids and with kids cafe attached. It is a good place to visit if you are bringing your kids to enjoy the garden. Kids maybe bored with the greeneries but at this garden, they may play, learn and eat.",
      "time": 1730297121,
      "translated": false
    },
    {
      "author_name": "Hanson Barry",
      "author_url": "https://www.google.com/maps/contrib/101268284303507823402/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVKhuZ_cE0v2QWSKDJdno5pTZf8sVMcPkj9Kf84ozwDitqiqB8Ysw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Looking for a fun place (with water play to escape the heat) with loads of things for kids to do.... This is it! Bonus, it's free 👍👍",
      "time": 1734067005,
      "translated": false
    }
  ],
  "types": [
    "amusement_park",
    "tourist_attraction",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2986397768445448062",
  "user_ratings_total": 1518,
  "vicinity": "18 Marina Gardens Drive"
}