{
  "formatted_address": "407 Ang Mo Kio Ave 10, #01-753, Singapore 560407",
  "geometry": {
    "location": {
      "lat": 1.3619869,
      "lng": 103.8554121
    },
    "viewport": {
      "northeast": {
        "lat": 1.363399730291502,
        "lng": 103.8565265302915
      },
      "southwest": {
        "lat": 1.360701769708498,
        "lng": 103.8538285697085
      }
    }
  },
  "name": "Fat Boss Waffles and Ice Cream",
  "place_id": "ChIJg3YfrcgX2jERZ27xyzvRKvw",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Nashiya Salim",
      "author_url": "https://www.google.com/maps/contrib/118260635253727043503/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVq6_kc80rTlXR3YlrF4ICb2Xi5HQtTXXqsxv7mW01gk1LZOLjxqw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Hands down the BEST WAFFLEs I have eaten my entire life. I really want this place to have more outlets and prosper so they never goes out of business because I never wanna lose their waffles. I can't keep count of how many places and countries we have eaten waffles from ..but this one's the best of them all. Their waffles are crispy at the same time soft- which is veryyy difficult to achieve. For instance, in all other places the waffle tends to gravitate towards either being too crispy that it falls off or soggy with lil to no crunch to it. Fat boss is the only place that have nailed this balance and you taste their waffle once and you will know the difference.\nPlus their icecreams ..especially Pistachio I can't find myself ordering anything else.This  flavor has me hooked every single time—it's rich, creamy, and has that delightful gelato-like stretch. My son swears by the cookies and cream, and honestly, every flavor we've tried has been a winner.\nIf you’re reading this, do yourself a favor: go try it. Support this gem of a business. Their waffles are world-class, and they deserve to be known far beyond this corner of the world. Speaking of which, the nearest bus top is \"blk 409 mkt/FC\"(54371)",
      "time": 1740481339,
      "translated": false
    },
    {
      "author_name": "Daryl Koh",
      "author_url": "https://www.google.com/maps/contrib/106011451543851178264/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKDfe2-Js3DFQYmkL3g3naZCD-iQJZfDpWpQXSi_823TGlbKg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 2,
      "relative_time_description": "6 months ago",
      "text": "The ice cream was average (sesame and chrysanthemum). The waffle was surprisingly really small. It was seemingly thin and didn’t have that typical waffle texture. We paid about 14.90 for the set and it comes with a small cup of barley drink. Not value for money and will not buy their ice cream again. I would be keen to return to try their cook food given the good reviews.",
      "time": 1730818971,
      "translated": false
    },
    {
      "author_name": "CH Teo",
      "author_url": "https://www.google.com/maps/contrib/101638862884367098083/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVNQj9_53sDzqqYOqT9Ouy3xzbIzxtMl5PnQ_WCxP_-eRqA4fx-1A=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "Din come here for waffles as we were looking for lunch. A satisfying meal and love their chendol! I made sure to praise the staff and thank them for the good food and service. Must always show appreciation for frontline F&B when we receive good food and service. It's not easy working in F&B and we must always appreciate them.",
      "time": 1719638545,
      "translated": false
    },
    {
      "author_name": "Victor",
      "author_url": "https://www.google.com/maps/contrib/117236758220742584078/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJvfQ8m7uj4BlMkntnlqqzDCxEqm9ljd1mekRm89kO7Pq3UPvce=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 2,
      "relative_time_description": "2 years ago",
      "text": "The standard has dropped significantly, waffles are small, thin and rock hard. The middle of the waffle squares is so thin that you end up with a right angled waffle when you cut into it.\nI miss the crispy fluffy circle waffles back when it was good.\nSadly, I can't recommend this Gelato turned Korea food place anymore. I would rather spend the money buying a tub of ice cream from the near by 7-11 store.\n\n3rd visit, had the waffle set, 2 scoops of ice cream with waffle and drink, definitely worth it. A bit disappointed as we couldn't try the Pistachio flavor even after I offer to top up.\nWaffles still as crispy, had Butterscotch Pecan and Matcha flavors. Both were great, really enjoyed ourselves there. Good music selection.\n\n2nd visit, seems like they changed the waffle shape, still as crispy as I remembered. Banana Chips Gelato is the most banana'y Gelato I've tasted yet.\n\nCrispiest Waffle I had in a Gelato store! Flavors were good and friendly staff enhanced the experience.",
      "time": 1677343679,
      "translated": false
    },
    {
      "author_name": "John Wong",
      "author_url": "https://www.google.com/maps/contrib/114637193739314128743/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJS6s5_i56GB_RX7sZRwOk8zDDiseKmk1ueq-F1O_kSrIEGbQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "A five star ice cream waffle place should either be outstanding in one aspect or be highly satisfactory in many. This shop is among the few which made me satisfied thoroughly throughout even though it is my first time here.\n\nI ordered the 12.90 ice cream waffle promotional set, which comes with 2 scoops and a waffle AND an iced/warm tea of choice. This is definitely one of the most value-for-money gelato deals out there.\n\nThe gelatos were somewhat interesting, with their popular flavours being Belgian chocolate, caramalised banana chocolate chip, Mao shan wang, yoghurt speculoos amongst others. They were all on the sweeter side. Sadly no sampling was allowed for now.\n\nI got caramalised banana and Hokkaido milk. The texture of the ice creams were not the smoothest, and there were some ice bits in the  caramalised banana ice cream. Yet the banana ice cream was flavourful and the chocolate chips added good texture and complemented the flavour well. The Hokkaido milk was surprisingly light and still tasty, could have been smoother but nonetheless great.\n\nThe waffle, however, was the highlight. If not for the maple syrup already being drizzled on the plate, which the waffle would be placed on, it would have been an amazing ice cream waffles. Even with the waffle being semi-drenched in syrup, it was remarkably crispy and tasted great. It was a little too airy, as some parts were almost hollow and biscuit-like but majority of it was fluffy and done just right. Yet I'd easily rank this waffles amongst the top 5 I've eaten because of how tasty and crispy it was, even after being soaked by ice cream/syrup. I'd also definitely ask for the syrup to be separate from the waffle. It was such a pity the rectangle waffles seem to be slightly smaller than the regular full circle.\n\nThe freshly brewed tea was a perfect complement to the sweet waffles/ice cream as there were so many options to choose from - earl grey, lady grey, pomegranate, lavender and many more. It can come iced or hot, with or without sugar. I got the lady grey without sugar and it easily cleansed my palate.\n\nThe ambience of the sitting inside the café was great and the service was excellent.\n\nOverall, this place is a hidden gem in the heartland with such a good value for money ice cream waffle set (if they continue the promo). I'd definitely revisit and ask for the syrup to be separate.\n\nGelato: 7.5/10\nWaffles: 9/10\nValue : 10/10 (with waffle/drink set)\nService/ambience etc: 8.5/10\n\nHighly recommended!!",
      "time": 1661271899,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "grocery_or_supermarket",
    "store",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=18170565701334560359",
  "user_ratings_total": 223,
  "vicinity": "407 Ang Mo Kio Avenue 10, #01-753, Singapore"
}