{
  "formatted_address": "Teck Whye Ln, Block 16, Singapore 680016",
  "geometry": {
    "location": {
      "lat": 1.3787335,
      "lng": 103.7551205
    },
    "viewport": {
      "northeast": {
        "lat": 1.380088580291502,
        "lng": 103.7563737802915
      },
      "southwest": {
        "lat": 1.377390619708498,
        "lng": 103.7536758197085
      }
    }
  },
  "name": "Fei zai bak kut teh",
  "place_id": "ChIJAS41XAER2jERgjte7-oAbRs",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Chong How",
      "author_url": "https://www.google.com/maps/contrib/116852952092019913610/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU30d-aia2XQtae66-H_qyPhdtOH9jkRaY8xLWurjWy6FjrFFLA2g=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Wahseh,, My claypot was piping hot when my buzzer buzzed and I go and collect the food. (see video)\n\nThere are 3 pork ribs with a mixture of other ingredients including enoki, lettuces, pork liver, stomach and belly, also taukee.\n\nThe portion shown here is $7.50 (soup) + $0.80 rice.\n\nMost importantly, both staff was very welcoming and fun! First was an indian staff who could speak fluent chinese and he made me respect him when he suddenly spoke chinese after I ordered my Bkt in English. Second was a lady who said that: \" if you find the Bkt good, be sure to give us a review!\" so here is the review.\n\nWill definitely come back! One of the best in the neighbourhood!",
      "time": 1746277093,
      "translated": false
    },
    {
      "author_name": "Karen Phong",
      "author_url": "https://www.google.com/maps/contrib/113772944759747117780/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKDmV4LstX4JhYt3b0DmRWDDdeij6Qwsh2xS-1Kq-cmuUkoyA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I live around the area and come here to eat their bak kut teh nearly every week and can really say that the taste has been consistently good. The texture of the meat has improved tremendously also since my last feedback many weeks ago that the meat on the bkt pork ribs could be softer and now it falls off the bone easily and are cut to a better size. Shows that the owners do take feedback earnestly and are always looking to improve their food. The empty bowls says it all, even the soup was readily slurred up. Thumbs up!",
      "time": 1731384121,
      "translated": false
    },
    {
      "author_name": "Fat Bear",
      "author_url": "https://www.google.com/maps/contrib/104131128739578139292/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKdRIKfpYD9r_f75pX3-FfkQHi7nbq5sL_4vGjIgoarKOZ2YA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "The Bak Kut teh (soup) was good. It’s the herbal version and towards the sweet side. The pork ribs, innards and meat were fresh and tender. If the soup could be a little peppery, that will be great.\n\nThe pork trotter were ordered in two version - braised and vinegar. The vinegar version was good and tender. The fattiness of the trotter were tender and soft. Unfortunately, I can’t take in the fatness. If not, it will be great.\n\nThe dry version of the Bak Kut teh was savory and was stir fried with cuttlefish and other meats. Needless to say, the combination of sweetness, saltiness and mild spiciness were well balanced.\n\nSesame chicken was okay. The onions were cooked till the sweetness blends with aroma of the sesame oil. Slight hint of ginger was observed.\n\nThe side dishes was also good to have - Youtiao, Salt preserved veggie, braised peanuts, were a good complement.\n\nIf you are a carb lover, these dishes above goes damn well with white rice. Any dishes above is good enough to set you off for more than 2 bowls or rice.\n\nThe meat is fresh. Like no foul smell at all.\n\nUnfortunately, self service. If order in bulk, need to self collect.",
      "time": 1735713753,
      "translated": false
    },
    {
      "author_name": "Lawrence Kang",
      "author_url": "https://www.google.com/maps/contrib/109583515553061588487/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI5YKCWalEGEvvLeMy9lJTlRyyKrx13f3-RsLK2MfUn2Iwi4A=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "It has been many months since my last visit to this coffeeshop. Noticed that there is a new Bak Kut Teh stall and decided to give it a try.\n\nTried the dry version and boy, it was good. While the sauce was on the sweeter side, mixing it with rice was just about right. The meat is very tender and easily separated from the bones. Will definitely come again for the soup version.",
      "time": 1728733791,
      "translated": false
    },
    {
      "author_name": "tan angela",
      "author_url": "https://www.google.com/maps/contrib/100431729773500502105/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXHGp0KI-xq1vcs18l5RDqcpPKwWAxU736608vwGJbbhqcqjH0=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "This is my 2nd time eating their soup BKT. This time I ordered a one person portion and rice for takeaway. I like it that the soup has a legit herb taste. Portion is also very generous and value for money. It cost $7.90 when tabao. Their braised pork trotter is nice too.",
      "time": 1731213229,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1976236820523793282",
  "user_ratings_total": 53,
  "vicinity": "Teck Whye Lane, Block 16"
}