{
  "formatted_address": "84 Marine Parade Central, Singapore 440084",
  "geometry": {
    "location": {
      "lat": 1.3019622,
      "lng": 103.906241
    },
    "viewport": {
      "northeast": {
        "lat": 1.303295730291502,
        "lng": 103.9076600802915
      },
      "southwest": {
        "lat": 1.300597769708498,
        "lng": 103.9049621197085
      }
    }
  },
  "name": "Fei Yuan Teochew Noodle",
  "place_id": "ChIJfQlkHgAZ2jERG3qD8_3DHtI",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "Julia Low",
      "author_url": "https://www.google.com/maps/contrib/116360636909081420398/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXr0dK7sFoREDpJtf8XN_asMZqtdXWPelVpLk7QyPBDC1c7T7Y=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "2 weeks ago",
      "text": "Fei Yuan’s fishballs are a highlight! They are soft, smooth, and has a sweet,  savoury fish flavour that tastes freshly made . Their fish cakes are thickly sliced and provides a satisfying bite to them.\n\n🍜 Laksa ($5) – 8/10\nHowever, what we really love is their laksa! The broth is comforting, rich, fragrant, and full of flavor. It leans more towards a spiced, and savory profile than coconut-ty making it a great choice for lunch without being over indulgent.\n\nThe bowl contains their signature fishballs, thick slices of fishcakes, a generous amount of cockles, and tau pok (3pcs) soaks up all the delicious laksa broth like flavor sponges.\n\nHowever, do note that the ingredients and portioning seem to depend on the uncle’s mood—some days you’ll get fishballs, other days none. That bit of inconsistency aside, it’s still a solid bowl worth returning for.\n\nWe’re already eyeing their mee pok and yong tau foo for our next visit, especially with their delicious fishballs.",
      "time": 1746073402,
      "translated": false
    },
    {
      "author_name": "Jasmine Tan",
      "author_url": "https://www.google.com/maps/contrib/111262838099031449969/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLk0or5KhTPnqtX9WeQGFPdT7ukCj7RPBN32iyB66JLNipS8g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Noodles were decent; handmade meatballs were the highlight for me. So fresh, and cooked carefully so the meat doesn’t toughen up. The result is a bowl of bouncy meatballs not overly seasoned, served with noodles coated in BCM dressing",
      "time": 1731895648,
      "translated": false
    },
    {
      "author_name": "Irene Law",
      "author_url": "https://www.google.com/maps/contrib/109976129667070167988/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLtLWHXpxH17YHyKA-Y9xcfQ1FFSZhCjypqLR28ATPmbpAdGws=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "This stall at Marine Parade Central used to be my family daily beakfast choice. The uncle who tend the stall is very friendly and attentive to our orders. The soup and ingredients were flavoured. Everything changed when the Uncle resigned end of March and was replaced by a two new faces.\nThe shorter man who tend the cashier is rude and interrupted my order saying he couldnt remember so much because he has 3 orders before me.. huh? then why he asked me for my order in the first place?\nSecondly my take away order has only one fishball and another one no fishball.. shortage of ingredients, soup also bland so different from before. My order is no 1 in the menu.\nI feel staff is very important To have someone passionate about the job make alot of different in the food flavour.Today when I dine at the food center. I realised there is no queue compared to before at that timing.\nVery sad because my family stop patronising the stall.",
      "time": 1744945674,
      "translated": false
    },
    {
      "author_name": "Sean Goh",
      "author_url": "https://www.google.com/maps/contrib/113608706305591448585/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKEaTeEStI-pfTIXqsvSF6l02FivQ-XBDO9hy5SPhzxdS9tTA=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 3,
      "relative_time_description": "a year ago",
      "text": "Randomly chanced upon this new stall inside Blk 84 Marine Parade Central Hawker centre that sells Minced meat noodle. This stall is located right next to a stall selling dim Sum. Was nearby and decided to drop by here for lunch, walked around and discovered this new stall. Apart from Minced Meat noodle, they also sell Laksa and Yong Tau Foo. There was a short queue when I reached but it didn’t took long before my turn.\n\nThe minced meat noodle starts from SGD$4.50 onwards. The noodle was nicely cooked; texture of the noodle was springy. Sauce was well balanced. My Bowl of noodle came with ingredient like minced meat, sliced fishcakes and fishball.\n\nOverall, I was expecting more since it was SGD$4.50. but nevertheless, a pretty decent minced meat noodle that I have tried lately.",
      "time": 1714665591,
      "translated": false
    },
    {
      "author_name": "Victor HTL",
      "author_url": "https://www.google.com/maps/contrib/105722555913037451991/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJqR7VDATcB50QQlvlrUU-vEx-fNtinX0ew0zskLCHfRcwz8g=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "4 months ago",
      "text": "Don’t get me wrong, it is nice, everything is nice from the sauce to the chilli to the springy noodle choice to the fishball and especially the meatball, BUT, for the price-portion comparison, sorry but personally it is definitely not worth it",
      "time": 1734932519,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15140754492745808411",
  "user_ratings_total": 13,
  "vicinity": "84 Marine Parade Central, Singapore"
}