{
  "formatted_address": "1 Commonwealth Ln, #04-04, Singapore 149544",
  "geometry": {
    "location": {
      "lat": 1.3044888,
      "lng": 103.7967184
    },
    "viewport": {
      "northeast": {
        "lat": 1.305762280291502,
        "lng": 103.7980151802915
      },
      "southwest": {
        "lat": 1.303064319708498,
        "lng": 103.7953172197085
      }
    }
  },
  "name": "Fitness Tutor by Coach Paul Kuck",
  "place_id": "ChIJ43CswUAa2jERdiBYvRaToh8",
  "rating": 5,
  "reviews": [
    {
      "author_name": "EDBERT TAIDY",
      "author_url": "https://www.google.com/maps/contrib/116010590272281573040/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKOOvlMuZlITLYy-BqnI25FPU7zv-_KmbzzYe6fcVEYx9Mf=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Mr.Paul is a very informative coach!\n\nI know a lot of things from his workshops, starting from exercises to do, how to eat the right way.\n\nWe also get to do the exercises hands on during the workshop!\n\nThank you for giving us this opportunity, Mr.Paul!",
      "time": 1730301441,
      "translated": false
    },
    {
      "author_name": "Cleo Ngiam",
      "author_url": "https://www.google.com/maps/contrib/105674693956065457993/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUZoE4KkBCma0sZ9B62Nzy1N_nHStBMxfT1sOkmX5hIY1-0yE8G=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "I'd highly recommend Paul as your fitness instructor. Having had poor experiences with other fitness instructors in the past, I find him way more attentive, thoughtful and not aggressive or pushy.\n\nPaul catered to my fitness goals and was very mindful in each session. I love going to the gym but nothing worked or changed my body or helped my climbing goals. Even though it's been 10 sessions, I've seen a definitive improvement to not only my climbing but my body.\n\nHe keeps each session different and interesting, pushing me a little more every few weeks. I definitely feel challenged and motivated. Though if I had an off day, he'd adapt it so I'm not pushed too far.\n\nPaul also provided diet advice and simple steps to keep to it practically. He doesn't make me feel bad if I've missed it sometimes but he keeps me in check to make sure I'm still eating healthy. Beyond our sessions, should I have any questions, he answers them promptly.\n\nPaul has his own gym setup so he can train clients privately. Most of the time it's just us but when I see him training others, it's a true testament to how adaptable he is. He has a range of clients both in age and fitness ability. He keeps attention to each person and never lets me think he's not paying attention.\n\nHe really is the best instructor I've had and anyone would do well through his guidance.",
      "time": 1684477823,
      "translated": false
    },
    {
      "author_name": "Prashanth Balarama",
      "author_url": "https://www.google.com/maps/contrib/116822602837568792661/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXfQb12jyeE4jaDFN6myGR_KhOqn9ZbyMO6YDWpeV56Hf_RWbjk=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I have been training with Paul for a little over two months now.   I was recommended to Fitness Tutor by a friend and I blindly went in with no idea of how the experience would be.  This is my first time in any proper training set up and what a fabulous experience it has been. Paul is a master at his art.\n\nPaul is a well qualified trainer. He has a master's in Exercise and Nutrition Science.  His approach to your need is very personalised and he sets up your diet and workout plan from Day 1 itself.\n\nMy need was to reduce weight and build core strength.  The combined plan of a nutrition and twice a week workout has helped me reduce nearly five kilos and 4% body fat in this short period and I feel quite good about my body strength.\n\nThe best part of Paul's approach is that he is equally invested in your progress.  Whether it is knowing your limits during workout or balancing your diet with a level of flexibility, makes you feel not being pushed too hard or restricted.\n\nI am glad that I joined Fitness Tutor and highly recommend Paul as a fitness trainer.  Feels great to feel young.",
      "time": 1694394400,
      "translated": false
    },
    {
      "author_name": "Chua Kok Leong",
      "author_url": "https://www.google.com/maps/contrib/111752641024736999737/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLFjtpCw8eDvu7uqyxvYFFIuC66KBEYXFdkIxfhfpSv9vXT8g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I'm 58 years old and after joining the Fitness Tutor my fitness & health have a great improvement.\nCoach Paul is able to adapt exercises and routine to suit my abilities while still challenging me has been truly impressive.His understanding the unique needs and concerns of senior individuals, including myself, set him apart as a remarkable coach.\nPaul knowledge is not only in fitness but his promotion of overall well-being has been invaluable to me. His expertise in working with senior clients like myself is truly commendable, and I feel fortunate to have had the opportunity to train under his guidance.",
      "time": 1693045764,
      "translated": false
    },
    {
      "author_name": "Chandru Kavichandran",
      "author_url": "https://www.google.com/maps/contrib/110183732783705715922/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKYmTmoipZkcv8WPQ6bswY7BSRjqMcQRJWQXLqhghHczU4bAw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I needed to improve my health, targeting both my underweight status and high bad cholesterol levels. Striking a balance between gaining weight and controlling cholesterol felt overwhelming until I met Paul. His exceptional qualifications - a master's degree in Exercise and Nutrition Science - stood out among my options. Paul's holistic approach aligned perfectly with my needs.\n\nChoosing Paul wasn't just about credentials; his warm personality and well-rounded approach resonated with me. He personalized a plan that covered both my diet and exercise, tailoring his guidance to my unique situation. I have been following his plan for the last 11-weeks.\n\nOver the course of these 11 weeks, I have witnessed a good transformation – a gain of 4.9 kgs accompanied by more muscle tone. Equally important, my bad cholesterol levels are now within the normal range - a testament to Paul's expertise.\n\nI'm thankful to Paul for the visible results. I highly recommend Paul as a fitness instructor.",
      "time": 1692277766,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2279546087278125174",
  "user_ratings_total": 49,
  "vicinity": "1 Commonwealth Lane, #04-04, Singapore"
}