{
  "formatted_address": "143 Teck Whye Ln, #01-233, Singapore 680143",
  "geometry": {
    "location": {
      "lat": 1.3805922,
      "lng": 103.7529199
    },
    "viewport": {
      "northeast": {
        "lat": 1.382025980291502,
        "lng": 103.7542988302915
      },
      "southwest": {
        "lat": 1.379328019708498,
        "lng": 103.7516008697085
      }
    }
  },
  "name": "Five Star Tuition Centre Pte Ltd - CCK & Bukit Panjang",
  "place_id": "ChIJuzAmzEER2jERFgICe8sAm50",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Priya Kisnan",
      "author_url": "https://www.google.com/maps/contrib/112210971358475776579/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWN48uiIMlqoWSonJGA1HXzzjS1Np8bauKtBl--oEqhYCWRh4-Tpw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "My daughter has been attending 5 Star tuition since Primary 4, and I’m truly impressed with the quality of their resources. The detailed explanations and comprehensive answer keys have been invaluable in deepening her understanding of the material. The teaching approach is both thorough and engaging, and I’ve noticed significant improvements in her confidence and academic performance. Mrs. Mani has also been incredibly supportive, regularly reaching out to parents and offering free workshops to share study tips and revision strategies. It’s clear that 5 Star goes above and beyond, not just in teaching students, but in empowering parents to support their children’s learning as well. Thank you 5 star!",
      "time": 1731073744,
      "translated": false
    },
    {
      "author_name": "Felix Chang",
      "author_url": "https://www.google.com/maps/contrib/115487221985288079076/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL8xvxgV5GE4VpG6v7rCqAys9o7o5MnJpqpHCk875yc-QNeKQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I have had an excellent experience with Five Star Tuition Centre, and I can confidently say it is one of the most responsible and dedicated tuition centers I have come across.\n\nAll the tutors are exceptionally committed, especially Teacher Mani. She is incredibly diligent and genuinely cares about her students’ progress. Teacher Mani goes above and beyond, investing considerable time to ensure that every student improves.\n\nHer commitment is unparalleled – I have never seen a tutor so devoted, often working late into the night to prepare materials for her students. Her dedication is truly admirable, and I am deeply grateful to have my daughters under all the tutors’ guidance at Five Star Tuition Centre.\n\nTeacher Mani has done an outstanding job, and I sincerely appreciate all her efforts.",
      "time": 1730049933,
      "translated": false
    },
    {
      "author_name": "Esther L",
      "author_url": "https://www.google.com/maps/contrib/104969476524894989110/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIx8Zs6VRUHjqRTyFi79Uddnu4A_Fd_3vXMFPvDs6CLXS6K9w=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Ms Mani and her teachers really put in alot of effort to help all the kids, especially those in P6. My son was there since P5 for English but I switched him over to P6 Science as he was not able to catch up for English.\nBut my son really enjoyed his Science lessons in Five Star due to their interesting way of teaching - making concepts come alive. Ms Mani also came up with really good OEQ answers for all the prelim papers. She always arranged extra lessons or online lessons before each WA, prelim or PSLE paper & bought snacks for the kids to keep them energised. The most surprising thing was that she also gave all P6 a movie treat after the PSLE. Never heard of any tuition centre who does that for the kids!",
      "time": 1730213870,
      "translated": false
    },
    {
      "author_name": "Joyce Tang",
      "author_url": "https://www.google.com/maps/contrib/100690197079639668922/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLj3n5nZCNq5WShufeGHbGi3RrbQJkMfsk4ybdn1PhZB5BK3w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Mdm Mani and her team of teachers are very dedicated and passionate. They will always go the extra miles for the students and tries their very best to help the P6-es to excel. I want to thank my Science teacher Mr Yeo, for his patience and passion for us.",
      "time": 1731565341,
      "translated": false
    },
    {
      "author_name": "Jj Ng",
      "author_url": "https://www.google.com/maps/contrib/101743738153863904659/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXbmiPdD4zvnCXxVlJNG2tP_Rzs7ACswhgcw62orjKcpbdvPvI=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Five Star Tuition has been a fantastic place for learning ever since my mom enrolled me there. Initially, I felt very scared and nervous in a new environment, but the teachers helped and encouraged me! Although my mom only signed me up for p6 science and English, the teachers were very welcoming and friendly. My teachers were Ms. Sera and Mr. Yeo.\nMs. Sera is a wonderful lady. I struggled with English, but she was patient and guided me and my classmates!\nMr. Yeo is a curious and engaging teacher. I love his lessons because they are always interesting and make me want to learn more!\nMdm. Mani, the strict but engaging principal, loves to share stories of her past students and news articles, which made me very interested!\nFive Star Tuition also helped me a lot with my PSLE struggles. The support and guidance I received from the teachers were invaluable in boosting my confidence and understanding of the subjects. Overall, I will miss Five Star Tuition dearly. Although it pains me to leave, I would visit this exciting place whenever I have the time!",
      "time": 1730817600,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11356671759286927894",
  "user_ratings_total": 247,
  "vicinity": "143 Teck Whye Lane, #01-233"
}