{
  "formatted_address": "4 Tuas S Dr, #-4-25 JTC Chemical Hub, Singapore 637048",
  "geometry": {
    "location": {
      "lat": 1.2761436,
      "lng": 103.6195079
    },
    "viewport": {
      "northeast": {
        "lat": 1.277513930291502,
        "lng": 103.6207986802915
      },
      "southwest": {
        "lat": 1.274815969708498,
        "lng": 103.6181007197085
      }
    }
  },
  "name": "Focus Paint (S) Pte Ltd",
  "place_id": "ChIJSdy6nDIH2jERT8L8CvWIAtk",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Along Tracker",
      "author_url": "https://www.google.com/maps/contrib/100342245666610564734/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL7kMK4ozoGgemp8x93YBiKO7WISJJSuXUHv9J37cKbHWbipA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Factors to consider when choosing a painting company in Australia\n\n1.\nExperience and Expertise: The first and foremost factor to consider when choosing a painting company in Australia is their experience and expertise in the field. Look for a company that has been in the business for several years and has a proven track record of delivering exceptional results. A company with experienced painters will have the knowledge and skills to handle different types of painting projects, from residential to commercial, and ensure a flawless finish.\n\n2.\nReputation and Reviews: Before making a decision, it is crucial to assess the reputation of the painting company. Check for online reviews and testimonials from previous clients to get an idea of their customer satisfaction levels. A reputable company will have positive reviews and a strong reputation for delivering high-quality work. Additionally, you can ask for references from the company and contact their past clients to inquire about their experience working with them.\n\n3.\nLicensing and Insurance: It is essential to choose a painting company in Australia that is licensed and insured. A valid license ensures that the company complies with local regulations and possesses the necessary skills and qualifications to perform the job. Insurance protects you from any liability in case of accidents or damages that may occur during the painting process. Always ask for proof of licensing and insurance before finalizing your decision.\n\n4.\nQuality of Materials and Techniques: A painting company that values artistry and perfection will use high-quality materials and employ the latest painting techniques. Inquire about the type of paints, brushes, and other materials they use to ensure they meet your expectations. Additionally, ask about the techniques they employ to achieve a flawless finish. A reputable company will stay updated with the latest trends and innovations in the painting industry.\n\n5.\nCustomer Service and Communication: Effective communication and excellent customer service are crucial when choosing a painting company. A company that values its clients will actively listen to your needs, provide clear and transparent communication throughout the process, and address any concerns or queries promptly. Look for a company that is responsive, friendly, and professional in their interactions.",
      "time": 1702105726,
      "translated": false
    },
    {
      "author_name": "Hung Yih Yeo",
      "author_url": "https://www.google.com/maps/contrib/103229022559156587374/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWFehwELxthy8ooJQZ8rvJqujh4JpVzCGFI7GgaFyj2a2m6D_gd=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "Would highly recommend the forlite interior emulsion series for residential use. Premium quality at great value. Customer service was also very helpful with advice in protective layering, colours and sealant usage",
      "time": 1620031874,
      "translated": false
    },
    {
      "author_name": "Damian Yong",
      "author_url": "https://www.google.com/maps/contrib/109360551327449366606/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLbjorvQCzyCgTE1Ph2ttB79Qg43z4Wfnzls1E6RZdhxzsNdA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "Decided to give a shot with focus paint as price seems much lower compared to those big brands available in the market. Application is easy and fuss-free and the overall effect is as good as other brands. Will definitely recommend this to my friends if they are looking for a good quality  paint.",
      "time": 1620023539,
      "translated": false
    },
    {
      "author_name": "Jane Alam",
      "author_url": "https://www.google.com/maps/contrib/101320562870026277422/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXt8WqpF-Xj8Q_iRKPoCBY7MlA4qFl7HDRK6ZgNs-62-xT--uUV=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "nice",
      "time": 1705658633,
      "translated": false
    },
    {
      "author_name": "Sheila",
      "author_url": "https://www.google.com/maps/contrib/112663296695871745210/reviews",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKPG3NpTg-09s1t-RG5BTs5TgIMU58azXVx75xlNdhtR74IXg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "",
      "time": 1620030791,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15637211442216485455",
  "user_ratings_total": 9,
  "vicinity": "4 Tuas South Drive, #-4-25 JTC Chemical Hub"
}