{
  "formatted_address": "19 Fort Rd, Singapore 439088",
  "geometry": {
    "location": {
      "lat": 1.2996598,
      "lng": 103.8849607
    },
    "viewport": {
      "northeast": {
        "lat": 1.300945830291502,
        "lng": 103.8864321302915
      },
      "southwest": {
        "lat": 1.298247869708498,
        "lng": 103.8837341697085
      }
    }
  },
  "name": "Fortville Serviced Apartments",
  "place_id": "ChIJKU0tnkQY2jERpt6wjkcGf1k",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "harjeev singh",
      "author_url": "https://www.google.com/maps/contrib/104981057259769229261/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJVn6Ea33WI7hwut7PD-sWmLH_F_P9KFFek4hKSIFtHrPDMcQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "I booked Fortville with the intention of becoming a long-term resident — planning to stay at least 6–8 months annually, spending over S$20,000 a year. What I got in return was an absolute lack of empathy, flexibility, or professionalism.\n\nDue to a legitimate medical injury (muscle tear), I requested to push my lease start by just 11 days. I offered full payment upfront and even medical proof. Despite being a serious long-term customer, the team refused my request, hid behind policy, and showed zero concern for my situation.\n\nThey went ahead and forfeited my S$500 deposit, even after I asked them to escalate to someone in leadership. It's clear no one actually reviewed the case from a customer relationship standpoint — just a flat, robotic rejection with no care for the human being behind the booking.\n\nTo make things worse, there's active construction literally next to the property — constant noise, mess, and disruption. If you're expecting a peaceful serviced apartment, this is not the place.\n\nI highly recommend looking elsewhere — there are far better serviced apartments in Singapore that treat guests like people, not policies. Fortville has lost a high-value long-term customer, and I’ll make sure others are aware.",
      "time": 1747059784,
      "translated": false
    },
    {
      "author_name": "Simon Heilig",
      "author_url": "https://www.google.com/maps/contrib/114360050737682103719/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJoNkTULDGogLqYEO-Q23BFvz5ZouD79-zG-3TqE7oIvfYbOBGF=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "I had an amazing week here. The apartment has two working ACs and laundry machines.  The management is very nice and helpful. Big Plus is the Gym and Pool provided by the building and the next MRT Station is just around the corner. I would definitely come back for my next stay!",
      "time": 1745896939,
      "translated": false
    },
    {
      "author_name": "Sharad Bellare",
      "author_url": "https://www.google.com/maps/contrib/118325159464515870469/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVT34YKpOkUhDaZDUqqn4ycs_saPDzY9iFjjoLGQbhbq6eEozE4=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "2 months ago",
      "text": "The Positives:\nVery good location. Apartment neat and clean, with basic amenities in the kitchen, washing machine and refrigerator.\nClose to MRT  and Bus Stop.\nAlso close to Market.\n\nThe scope for improvement\nThe front office day staff is pathetic. Uncooperative, lazy and rude. They are always inside the room behind the front office and rarely seen. Unreliable: Shifted us to a much smaller apartment without informing, for the same rate as the bigger apartment previously occupied. Did not provide any porter service on checkout.\n\nThe best experience:\nThe night, one man staff, Mr. Maru is very kind and helpful.\nRest of the staff, Especially housekeeping is\nSmiling, efficient and hard working.\nEdit:  Re: The owner response:\nDefiant and unapologetic.\nThe response shows why there can be no improvement in the service from the front Office day staff.",
      "time": 1741067906,
      "translated": false
    },
    {
      "author_name": "Ling Chan",
      "author_url": "https://www.google.com/maps/contrib/117525122825571274474/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVGh25qO0SUjCpFI3DN-XsaO5TpiHdwEriaNyuDFiw846zL8c24=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I’ve stayed at Fortville during my yearly trips to Singapore since 2022, and it’s always been a great experience. Mark and the staff are accommodating, and the apartments are well-maintained and serviced three times a week.\n\nThe location is excellent—MRT and bus stops are just minutes away, with plenty of dining and shopping options nearby, including Jalan Batu Hawker Centre, Old Airport Road, and Katong/Joo Chiat. The amenities are exactly as listed on the website, which is always a plus.\n\nFor a comfortable, well-connected, and hassle-free stay in Singapore, Fortville is a fantastic choice!",
      "time": 1743361935,
      "translated": false
    },
    {
      "author_name": "Lisa Dias",
      "author_url": "https://www.google.com/maps/contrib/109399182751754888263/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLsIJPTR2KdeVJzUR5qQ5nd9qTIXOMyAXx7IujX-PFDNYWRaA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I’ve been staying at Fortville since October 2023 and it’s been an amazing experience! The staff are so helpful and friendly, there is house keeping three times a week, the apartment is full stocked with essential items such as pots, plates and cups and it is centrally located making it easy to get around. I would highly recommend Fortville to anyone looking for a short term or long term stay in Singapore.",
      "time": 1737598335,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6448880095824240294",
  "user_ratings_total": 193,
  "vicinity": "19 Fort Road"
}