{
  "formatted_address": "81 E Coast Rd, Singapore 428785",
  "geometry": {
    "location": {
      "lat": 1.3054827,
      "lng": 103.9038135
    },
    "viewport": {
      "northeast": {
        "lat": 1.306754630291502,
        "lng": 103.9052132802915
      },
      "southwest": {
        "lat": 1.304056669708498,
        "lng": 103.9025153197085
      }
    }
  },
  "name": "French Studio Language School",
  "place_id": "ChIJo3FdWQ0Y2jERHqq2Zaz26zQ",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Jonathan Wilson",
      "author_url": "https://www.google.com/maps/contrib/116582168079907219130/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKpXfEGiaW7ABk2bcYlwrI2IpaZSQiI6JSfoT4oTldHmIuWIw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "My daughter signed up for classes before pandemic. They have continued online and she loves them. Teacher Nicolas keeps the kids engaged and where my daughter disliked her prior foreign language option, she loves French.\n\nThe staff also reach out regularly to see if we want to continue online or in person which seems better than just imposing an approach which may not suit.\n\nHighly recommend.",
      "time": 1680593936,
      "translated": false
    },
    {
      "author_name": "Cindy Chong",
      "author_url": "https://www.google.com/maps/contrib/105735637478540374061/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK38fbrZFkvkNGh7y_pJ6lYro0vxkqNaQ4hG9qqkjM8-Nn00Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My teacher Nicolas is very good in pacing the lesson according to my level and he addressed all my questions in details. His lesson is fun and I can see improvements in my conversational skill!",
      "time": 1699105514,
      "translated": false
    },
    {
      "author_name": "Ariel Valdehuesa",
      "author_url": "https://www.google.com/maps/contrib/109624149683405292005/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKwSNuxTYhcVflXDmQ6hyDS2pYPAfpkAnguc5aK8wMlwkUdew=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "2 years ago",
      "text": "The instructor is nice but staff communication is not good. (funny it's a studio that teaches communication)...\nBefore I enrolled for class I clearly indicated that I will be overseas and will be missing one class and requested if there will be remediation available. They just said yes, only to find out setting the remediation class is such a pain. They should have been transparent upfront instead of lying so I could have found another studio instead.\nAlso, the instructor was not even informed that I will be overseas, I only got to find out that the instructor didn't know from my friend from the same class.\n\nTeacher Bexen is really friendly and good.\nFor the rest of the staff? they just lack proper communication and transparency.\nDefinitely not a studio I'm willing to recommend to others who have some expected or unexpected travel plans.",
      "time": 1669723498,
      "translated": false
    },
    {
      "author_name": "Kevin & Shara Neufeldt",
      "author_url": "https://www.google.com/maps/contrib/106907268503422119913/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWrft58GmlmgNaEK2bDaY6Y7JMvbKHJnihpiwScEVljvWsh4t9j=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "The level of service and professionalism for this location is abysmal. We had received a recommendation to this school from a friend and were looking forward to starting here. In the first six months, we had our class term rescheduled twice, to a different time with no notification from the school. We had a class term canceled due to teacher limitations and lastly we had our most recent term canceled with no call or email. My son turned up for the new term only to be told his class was canceled that day. I called the number provided on the website repeatedly for 2 days, to no answer. I even whatsapped the number given to no answer. No one from the school called me or even emailed me. Furthermore there was no more information given and I had pre-paid for the term. When I decided to switch schools, only then did I receive any email regarding the canceled term and what did I want to do with the prepaid funds. If it weren't for the MOE requirement for the Mother Tongue In-Lieu, we would have left this school long ago.",
      "time": 1705217880,
      "translated": false
    },
    {
      "author_name": "Brandon Yuen",
      "author_url": "https://www.google.com/maps/contrib/118406103847704127450/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVTmR_vYlpc7iwtvNEaKortQUzdo2qQxH9jXwyRlTMmTaePoa4Umg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "I had a wonderful experience doing a free form refresher course with Nicolas. I had a few years of French lessons in school 30 years ago, so i knew a few things, but I had gaps in my knowledge all over the place. Neither a structured beginner's course nor a structured advanced course would have been suitable. Nicolas was very accommodating in filling those gaps without forcing me to go through all the basic things that I could already demonstrate some proficiency in. He encouraged communication using whatever I knew, even if there were mistakes in tense and conjugation at times. He'd correct them gently, but keep the conversation flowing, which is what I really wanted out of this experience. I'm a little more fluent after 8 lessons, but still not quite conversational yet. I know I'll be going back to look for Nicolas when I have the time and energy to take this further. Merci beaucoup, Nicolas!",
      "time": 1678421546,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3813412729800534558",
  "user_ratings_total": 60,
  "vicinity": "81 East Coast Road"
}