{
  "formatted_address": "10, Tebing Lane, #01-02, Singapore 828836",
  "geometry": {
    "location": {
      "lat": 1.3927356,
      "lng": 103.9172393
    },
    "viewport": {
      "northeast": {
        "lat": 1.394200630291502,
        "lng": 103.9185920802915
      },
      "southwest": {
        "lat": 1.391502669708498,
        "lng": 103.9158941197085
      }
    }
  },
  "name": "Frienzie Bar & Bistro",
  "place_id": "ChIJDV8kFPg92jERKulk55S832w",
  "rating": 3.9,
  "reviews": [
    {
      "author_name": "Paul Toh",
      "author_url": "https://www.google.com/maps/contrib/110110584107240453374/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUnkejVXf-3HpzKAPopMzXBDlxG7FMjJTok-fResg6Mh5oNfyJBFA=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 2,
      "relative_time_description": "4 months ago",
      "text": "Great ambience and great music\nFood is not good. Fried stuff is fried with old oil, so all food came out quite brown.\nChicken wings were stale, probably frozen for too long.\nWagyu burger tastes like the slight hint of beef you find in some bad Korean beef soup, basically tasteless which I suspect why they had to add a slice of luncheon meat in there.",
      "time": 1735709596,
      "translated": false
    },
    {
      "author_name": "oXRYSTALo Ong",
      "author_url": "https://www.google.com/maps/contrib/114556064085815871377/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSTtKcF9FYMbh-XNbDu8f7Whl3gi-ZY6T8pFPOm3v9Y98Ws7jL=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 3,
      "relative_time_description": "3 months ago",
      "text": "Frienzie Bar & Bistro:  Cozy Atmosphere, Disappointing Dinner (3/5 Stars)\n\nRating:\n\n• Atmosphere: 4/5 (Cozy and welcoming, with a great spot to chill with live music)\n• Service: 4/5 (John provided friendly and helpful service, but the kitchen let us down)\n• Food: 2/5 (Significant disappointment with the steak, soup, and chicken dishes)\n• Value: 3/5 (Prices are decent, but not worth it for the quality of food on our visit)\n\nOverall: 3/5\n\nFrienzie Bar & Bistro has always been a go-to spot for Donkey and me, especially for our cycling meetups. We've always enjoyed their fish and chips on our previous visits, and the atmosphere is always friendly and welcoming. John, a dear friend of ours, always makes us feel at home. He even offered us a spot to put our tri-fold bikes when we arrived, suggesting we push them all the way to our table. Frienzie has always been a cozy place, and with the live band in the evenings, it's a great spot to chill and have a beer with some finger food.\n\nUnfortunately, our recent dinner experience was a disappointment. I ordered a medium rare ribeye steak, but it was served rare. While John was kind enough to bring it back to the kitchen for further cooking, it returned well done, making it tough and unappetizing. The steak, costing $28.90, was a significant let down, especially considering the mashed potatoes that accompanied it were also lacking in flavor. Adding to the disappointment, our chicken and corn soup arrived sour. Although John offered to replace it with mushroom soup, we were already disheartened by the quality of the food. Donkey's chicken dish also lacked flavor, and overall, the food didn't live up to our usual expectations.\n\nDespite John's friendly and helpful service, and the cozy atmosphere, this time we felt compelled to share our experience. While Frienzie is still a great place to unwind with a beer and enjoy the live band, we wouldn't recommend it for a satisfying dinner at this time.",
      "time": 1737526483,
      "translated": false
    },
    {
      "author_name": "Henry Cheng",
      "author_url": "https://www.google.com/maps/contrib/108151994390288524704/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVfwNWg1-WqOnI9hAEUZRyboEsnOwxVecQ6btSc16XE-eLvdD7M=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "I will give it 5 stars just because of the service and the live band. It’s such a place to chill out by the river and just enjoy your surroundings. Drinks are really reasonable as well. The place was quite packed during evenings, so it’s a good sign we are at the right place.\n\nCarbonara spaghetti wasn’t bad. The portions were quite big. Fries were served piping hot with sides of chili and cheese sauce. They have quite a good selection of food options here, so I think it’s a good place for dinners and drinks.",
      "time": 1729088017,
      "translated": false
    },
    {
      "author_name": "MC SM",
      "author_url": "https://www.google.com/maps/contrib/110245550123443528486/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKsEel7YxLXrPZ8Vzh_vbx4qirVqz4_mXRBDXftCYDp92Inwg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "Pet friendly bistro & bar! Pets are allowed to be seated at outdoor area. Very windy and chill vibe with awesome music. Happy hours from 4-7pm, one pint at $9++. Our favourite is the chicken wings (3pcs for ~$10++). We had 1 Cheese Fries, 3 fried chix and 1 meat lover pizza (this was really so so) plus 2 pints of beer, bill came up to $70 after taxes.",
      "time": 1709465643,
      "translated": false
    },
    {
      "author_name": "Aveline Neo",
      "author_url": "https://www.google.com/maps/contrib/115848285820222688997/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIkPpzhKsafA-R0p-LzLR-5sPXmPKjiOyVL124BzUTSrzLv3Dg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "The ambience was cool and relaxing. I went on a Monday and there was liveband performance by Jacky and Simon. It was very enjoyable listening to them. The staffs were attentive and food order was delivered fast. For the price and quality of food, it was reasonable. I ordered a drink and chicken chop which I totally enjoyed. I would go again.",
      "time": 1742797723,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7845196423626025258",
  "user_ratings_total": 955,
  "vicinity": "10, Tebing Lane, #01-02"
}