{
  "formatted_address": "443 Ang Mo Kio Ave 10, #01-1229, Singapore 560443",
  "geometry": {
    "location": {
      "lat": 1.3661921,
      "lng": 103.8550605
    },
    "viewport": {
      "northeast": {
        "lat": 1.367639630291502,
        "lng": 103.8564456802915
      },
      "southwest": {
        "lat": 1.364941669708498,
        "lng": 103.8537477197085
      }
    }
  },
  "name": "Froz Bakery • Cafe",
  "place_id": "ChIJU-zR3-IW2jER1rVlX65drcE",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "瑜夏",
      "author_url": "https://www.google.com/maps/contrib/112140020804504512924/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXL7X32AYQbBPyOd84GwYeAPZhvZV3Wcfdmi-cq66xkSZM5rrw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Had an absolutely delightful brunch at Froz Bakery Café and I just had to share!\n\nWe ordered the Ultimate Breakfast Set (#127) and the Pancake Breakfast Set (#128)—both were incredible and hit all the right notes. The scrambled eggs were creamy and perfectly seasoned, the potato wedges were crispy on the outside and fluffy on the inside (seriously addictive!), and the buttered toast and pancakes were served with generous slabs of butter that just melted so beautifully.\n\nThe Ultimate Breakfast Set came with sausages and grilled mushrooms that paired wonderfully with the toast and eggs. Meanwhile, the Pancake Breakfast Set was a dream—fluffy pancakes, crispy turkey bacon, and those same amazing wedges.\n\nBoth meals came with a fresh salad on the side—crisp lettuce, sweet corn, raisins, tomato, and a light drizzle of dressing. Such a refreshing touch!\n\nThe café vibe was cozy and welcoming, perfect for a chill brunch. Friendly service, warm ambiance, and hearty portions at reasonable prices. Will definitely be back to try more from their menu!\n\nHighly recommend if you’re in the area and craving a satisfying breakfast or brunch.",
      "time": 1745725694,
      "translated": false
    },
    {
      "author_name": "Megan Hoo",
      "author_url": "https://www.google.com/maps/contrib/109644890606737546969/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVgKzaJL3wUHTPvsWYcwwaP3tzqsM5PXKypTZ1LR3YFkSdD19cv=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Ordered the pancake breakfast set, scrambled eggs toast, bento rice set with 12 grilled shrimps, sweet potato fries, signature watermelon lychee frappe and green tea matcha frappe and it was amazing, delicious and superb ! the food was made and served on the spot, the service was great as the staff were very friendly ! would definitely recommend their frappes as it is not too sweet and it taste very good, fresh and clean ! although I didn’t managed to try their desserts as I was too full, it was my first time trying out the cafe and would most definitely come down again to try more of their amazing and delicious food and frappes !\n\nreview on the individual food items:\npancake breakfast set\npancakes were chewy and went really well with the butter and syrup ! scrambled eggs were well down as the texture was really fluffy and moist ! bacon was a little overcooked, but it was crisp ! potato wedges were amazing as it was well seasoned with herbs and a hint of salt ! overall, all the dishes went really well with each other ! amazing experience !\nscrambled eggs toast\nscrambled eggs were very fluffy and moist as well and the toast literally melts in your mouth ! the scrambled eggs and toast went really well with each other and each bite is delicious as it just melts in your mouth and you won’t even feel full afterward\nrice bento set with grilled shrimps\nrice and grilled prawns had a chewy texture !\nsweet potato fries\nyou are guaranteed genuine sweet potatoes ! cooked really well with that perfect crispy and salty flavour that enhances the overall flavour because of the herbs and salt ! not oily at all so I didn’t feel guilty after eating it as well as everything else !\nfrappes\n1000% recommend their frappes as it is just the right amount of sweetness and you won’t feel guilty nor unhappy after consumption as it is not too jelak\noverall 10/10 experience and would most definitely come back again and would 10/10 recommend my friends !",
      "time": 1742110325,
      "translated": false
    },
    {
      "author_name": "Wee Tang",
      "author_url": "https://www.google.com/maps/contrib/112085840480791970569/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKz290LjMB2F4NUtuUitU84bvaHikL_MoqtDAP10LrftKmKcg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "Decided to order a nice sandwich for lunch, and chance upon this place with a really nice picture of the sandwich I was looking for in Grab Delivery. When it was delivered, the sandwich certainly did not match the picture. I am all for supporting neighborhood businesses, but this sandwich was such a letdown. The bread is soggy, the miserable lettuce and tomato does not look fresh (did not risk trying them), the egg was poorly done, and the bacon is rubbery. All this for $8.50. I would have expected better quality from a bakery. Should have taken a walk to get a Subway sandwich instead. The other reviews were mostly good with well prepared and presented offerings. Not sure what went wrong here. Just offering my 2 cents that the sandwich at this place is awful... Hoping that the business would take this suggestion and improve.",
      "time": 1732696821,
      "translated": false
    },
    {
      "author_name": "M F",
      "author_url": "https://www.google.com/maps/contrib/104830127300856289516/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLE53Szw2fgvj3eJigoCLVGG4WUcv-XFGH2pdQ4c6HsJuy4Yw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "A hidden gem in the Ang Mo Kio neighborhood that I found on Google Maps. The uncle there was kind enough to chat with me and shared that this cafe has been around for nine years.\n\nThe food, though served in smaller portions, was surprisingly delicious—both my pasta and fish were fantastic. The coffee was also great. I even brought home a tiramisu and a mooncake to try later.\n\nIt's definitely worth a visit, especially for the tasty coffee and food. It would be perfect if the portions were just a bit larger. Still, it was a delightful experience, and I felt it was worth leaving a review.\n\nThanks to the young boss for recommending other pastries and to the father for patiently preparing the meals.",
      "time": 1723551873,
      "translated": false
    },
    {
      "author_name": "Galvin Yeo",
      "author_url": "https://www.google.com/maps/contrib/114838808848359507098/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWUeHLyLvZ5Rj63d3ZC8lGR5Fb63jpaou_gwMYRq8No-sNK55g=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Very pleasant dealing with the young boss of the bakery (Wayne) and I have been very satisfied with the new year pineapple tarts for  2 years (happy wife, happy life).\n\nAtmosphere wise : TBH I haven't not dine in very often but based on my impression, it's a decent cafe that isn't very very spacious but definitely worth to grab their coffee or tea along with their bakes.\n\nFood: Nothing much to be said except, happy wife happy life. Their bakes often comes in good deals and bundles on occasions so so check them out.\n\nService: Very happy dealing with Wayne and he tries his best to accommodate my schedule in terms of collection.\n\nAll in all, do check the bakery out if you're nearby looking for good bakes and coffee!",
      "time": 1737038860,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "bakery",
    "store",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13955913823797229014",
  "user_ratings_total": 121,
  "vicinity": "443 Ang Mo Kio Avenue 10, #01-1229"
}