{
  "formatted_address": "150 Orchard Rd, #01-39 Orchard Plaza, Singapore 238841",
  "geometry": {
    "location": {
      "lat": 1.3010249,
      "lng": 103.8410995
    },
    "viewport": {
      "northeast": {
        "lat": 1.302574330291502,
        "lng": 103.8426127302915
      },
      "southwest": {
        "lat": 1.299876369708498,
        "lng": 103.8399147697085
      }
    }
  },
  "name": "FUKUDA Yakitori Dining Singapore",
  "place_id": "ChIJPbuUbGYZ2jERf-TH-rHwzqY",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Maycia Hong",
      "author_url": "https://www.google.com/maps/contrib/100431621895525705597/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ7f0rxIHTCD5IXxgzzwSwQPa5I8TFIbVNNpffeZ5AvGfddDQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Quaint hole in the wall Omakase joint. Ordered the premium sets of $98 were exquisite with light and balanced flavors. Everything is delicious and reasonably priced except their alcohol were on the high side. Worth the visit to taste Japan.",
      "time": 1736487917,
      "translated": false
    },
    {
      "author_name": "jinn194",
      "author_url": "https://www.google.com/maps/contrib/115012692322126133646/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXxcdBFtU2f_CPYAT3cz3_8UalnkvI0Kkf7wFH2mrN_cw-6AjU=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "A small and cozy hole in the wall joint that only sits a maximum of 7 people, but the flavor, portions and quality of the food are punching well above their weight.\n\nOpt for the $88 set if you're a fan of traditional Yakitori with all the off-cuts. The beef in the $98 set is just as good and tender.\n\nLastly, their oyaku don is some of the best I've had in Singapore. Tender chicken meat and soft velvety egg over a bed of quality rice.",
      "time": 1722971265,
      "translated": false
    },
    {
      "author_name": "Jack",
      "author_url": "https://www.google.com/maps/contrib/106288565584051666357/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWAz__X8LkfzCSM6CtMEV009262f_gpetU5m9GJjEGYH28gnOyv=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "Quaint hole in the wall japanese restaurant bar serving yakitori. Had the omakase and it started off really well. Every dish is carefully grilled by the chef and it's certainly more tasty when the food is prepared over charcoal grill right before your eyes. However, as the meal goes by, it can get a bit sick of chicken, skin, heart, liver and all. Luckily there were unagi and some beef which is pretty good to break the cycle of chicken. I thought it will be much better if there are some pork as well. Finally the ice cream is really welcome to cleanse all the chicken from our palettes.",
      "time": 1730298346,
      "translated": false
    },
    {
      "author_name": "Ivan Loh",
      "author_url": "https://www.google.com/maps/contrib/114542374982525257775/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWDD-8mEu7F0HJkx-qBTXjltLLKPwUo6tt56idMhexkNdcmQDlMmg=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "It was our first time trying a yakitori omakase, and it was good! The chef grilled every stick to perfection. The restaurant is really small. The counter seats 7 to 8 people, and there is a table that seats 4. Reservations are required. Different sticks of yakitori are paired with specific condiments. It was pretty interesting. The chef would explain everything. It really feels like you're transported to a yakitori izakaya in Japan, especially when more than half of the customers were Japanese when we dined there. Really good food and service. We had a great time!",
      "time": 1710601987,
      "translated": false
    },
    {
      "author_name": "Sebastian Tan",
      "author_url": "https://www.google.com/maps/contrib/108545381766005308150/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocImuSX9hwk0jSOWLZa5Z9yFQEjRG0c7PpXVwAA_cUU3366orQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "I love this place.....discovered by chance,  a pleasant surprise indeed. In my humble opinion, everyone should at least come here once to enjoy the up close personal service by the owner/chef.\n\nA restaurant with intimacy - 6 bar counter seats, with seperate small table fit for 4. Very popular amongst the Japanese, explains authencity of the food.\n\nOmakase restaurant should be intimate and personal, this restaurant embodies all quality!!  Few is more....ala carte starts from 10 pm..... Being here brings me back to Japan, that cozy dining experience  with quality (not quantity) food.\n\nThe boss is very attentive, accommodative and polite. The yakitori sticks allow one to taste the freshness of the ingredients and the charcoal grilled skill of the Chef!!!  Love the \"smoky\" flavour of every stick served.  The beef cubes/stick was so tender and juicy..... A real proof of excellent grilling skill.  I love everything served, undoubtably filled with satisfaction.\n\nOne has to be patient while having yakitori Omakase, since the boss is the only chef who grills the food to perfection, with his heart and soul.\n\nOther than Omakase, I ordered an ala carte beef tongue and half charcoal grilled unagi too.... Simply delicious.\n\nWill certain be back, and introduce more people to try.... You should give yourself a chance to experience this yakitori Omakase! The experience is indescribable with words, feel it yourself!",
      "time": 1725107914,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12019809102705714303",
  "user_ratings_total": 92,
  "vicinity": "150 Orchard Road, #01-39 Orchard Plaza"
}