{
  "formatted_address": "47 Gul Cir, Singapore 629580",
  "geometry": {
    "location": {
      "lat": 1.3143077,
      "lng": 103.6634655
    },
    "viewport": {
      "northeast": {
        "lat": 1.315784980291502,
        "lng": 103.6649356802915
      },
      "southwest": {
        "lat": 1.313087019708498,
        "lng": 103.6622377197085
      }
    }
  },
  "name": "Fullerton Health Medical Centre for Migrant Workers @ Gul Circle",
  "place_id": "ChIJaT160JYF2jERov78GB6kcQ4",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Bryan lim",
      "author_url": "https://www.google.com/maps/contrib/101339629740467913751/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLsjlRifjdslhMPnuFbrOFcc2EYNzh1E1_pqWrJmlalzmbsig=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "Small clinic where by only handle minor diagnosis,\nCan’t settled an open cut injuries yet need to go A&E Dept.\n\nFront desk Service is fast but the medic staff is not well organised yet insufficient.\n\nLocated at industrial park, convenient who need to visit doctor for minor sickness\n\nParking space is for staff only but road side parking is limited",
      "time": 1742789073,
      "translated": false
    },
    {
      "author_name": "CS",
      "author_url": "https://www.google.com/maps/contrib/117961212858537079548/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI9f_LOs2EEnkJ6k035h6coWGrkhs82Pjp4hOpVZ0kuHLFVhQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "I am writing to express my disappointment with the service I received during my visit to your facility on 10/Mar/2025. I arrived at 5:00 PM, well before your advertised closing time of 5:30 PM, only to be informed that registration had already closed at 4:30 PM. This crucial information was not mentioned on Google or any of your public platforms, which led to confusion and wasted time.\n\nAdditionally, the receptionist’s manner of communication was unprofessional and dismissive. Rather than offering assistance or understanding, I felt disregarded and unwelcome. Clear, respectful communication is fundamental to good service, and unfortunately, that standard was not met.\n\nTo avoid future misunderstandings, I strongly recommend updating your public information to clearly state the registration cut-off time. I also hope you will address customer service standards with your staff to ensure visitors are treated with respect and courtesy.\n\nThank you for your attention to this matter. I look forward to hearing how you plan to improve this experience for future customers.",
      "time": 1741598624,
      "translated": false
    },
    {
      "author_name": "ahmed kalam",
      "author_url": "https://www.google.com/maps/contrib/115168697608845555925/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVSqU5ouHOm2woc1HpFrrJWchtD3636Gvz6gome6EMc4rwtRFLP=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Very very bad service of this medical centre, last Saturday i call doctor then he give me medicine today Wednesday still i never received my medicine, i call and messege fullerton number and WhatsApp over 10 time also they never received my call or never reply my message and specially Gul Circle medical centre staff behaviour very very rude 👎",
      "time": 1744768851,
      "translated": false
    },
    {
      "author_name": "Kogilavani Vejayakumaran",
      "author_url": "https://www.google.com/maps/contrib/103377110747359752355/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXTEV0LXkt0HkgIyv7cAzzmlkIUPQtmz4fPQhycEZ6gN-zfE54H=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "This clinic deserves zero stars, but I'm writing this review as a warning to others. Dr. Beulah Patricia is incredibly rude to patients and refuses to listen to their concerns. According to her, if a patient smiles, it means they’re not in pain and are perfectly fine. I seriously question whether she’s even a qualified doctor. This was my first visit to this clinic, and it was by far the worst experience I've ever had. Avoid this place at all costs!",
      "time": 1735198648,
      "translated": false
    },
    {
      "author_name": "Bryant Ee",
      "author_url": "https://www.google.com/maps/contrib/111758792242966947494/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX8arFxeN55Ayx0Us-fezZUP3opRpeJfE-Y47rwQjY8YuuFNa3o=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Poor service has been provided by the health professional. Staff can be seen yelling at migrant workers. The health professional assigned to conduct blood tests was using his phone to watch shows while performing the task.\n\nThis is one of the official channels appointed by MOM for all migrants in the construction sector to visit regarding health and medical issues.\n\nI urge MOM to review and conduct mystery spot checks on them. It is a shame that Singapore is treating these workers with such inadequate medical facilities. I will write to MOM and provide feedback on this matter as well.",
      "time": 1709797518,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1040793438074502818",
  "user_ratings_total": 399,
  "vicinity": "47 Gul Circle"
}