{
  "formatted_address": "36 Nanyang Ave, #01-01/02 Nanyang Technological University, Singapore 639801",
  "geometry": {
    "location": {
      "lat": 1.3454521,
      "lng": 103.6825871
    },
    "viewport": {
      "northeast": {
        "lat": 1.346883580291502,
        "lng": 103.6838972802915
      },
      "southwest": {
        "lat": 1.344185619708498,
        "lng": 103.6811993197085
      }
    }
  },
  "name": "Fullerton Health",
  "place_id": "ChIJqyjq5Z8P2jERRwB6YLBu2Ec",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Mei Kook",
      "author_url": "https://www.google.com/maps/contrib/105146154073421175739/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJyVjf4E0weKD_N-TsuvxqvG-Rk2yu0HoCKSO8GqXRPN_5AXQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 weeks ago",
      "text": "I visited with the intent to fill up my immunisation records for overseas exchange, and was denied at Fullerton even though NTU asked us students to go Fullerton to have it filled up. Their excuse was that we need to come before 4pm to do so, even though the clinic closes at 9pm. However, this information was nowhere stated on their website. I even called them before going down so that I could confirm but no one answered the call. Receptionist staff were very rude as well. Many of my friends also have very bad experience with Fullerton Health, including rude and incompetent staff. So NTU if you see this, please consider changing the healthcare provider if you have the slightest care for your students wellbeing.",
      "time": 1745241736,
      "translated": false
    },
    {
      "author_name": "Lily Warner",
      "author_url": "https://www.google.com/maps/contrib/109555422218100680957/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIA7S_5WMEp1rywXNm1FtQkxB09Fy8r20cRrYAEBrNo9W2F5w=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Bad experience twice with the doctors here. I only come here because it is the closest clinic to the school and it is hard for me to travel when I am sick. The doctors treat patients as if they are faking their illness. It is your job to give good treatment including good service to patients and you are PAID to do so even by those who are faking so what’s with the terrible attitude? If you do not like the job, stop working instead of being annoying to patients. I am already in a bad mood because I am unwell and coming here only makes it worse and the meds do not really help either. It will be great if all the doctors can be changed to better ones that have higher EQ and IQ.",
      "time": 1744366367,
      "translated": false
    },
    {
      "author_name": "s darshni",
      "author_url": "https://www.google.com/maps/contrib/109119317784283248298/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIumbrmPXD2IemoMq6MshKnfUirg1FqsoTMXV4sfBQjs6r8Ww=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I was there today morning with my friend. She came for fever. I was impressed with the way everything happened in the clinic today. Well mannered staffs and the procedure was so smooth. Thank you to the malay girl who passed my friend the medication with a smile and the indian staff at the registration counter who told my friend please take and bye bye. Good feedback needs to be shared too.",
      "time": 1737123268,
      "translated": false
    },
    {
      "author_name": "Celestine Francis",
      "author_url": "https://www.google.com/maps/contrib/103227263714661147766/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWtnu0xF01nEXBInt1XbLe8CN--Y_3Phqze_xs64N4gYTnwmGPt=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "This clinic should have its license revoked. It does not serve its purpose of helping the sick. i was sent back saying that the doctor had no possibility of seeing me even though there was still an hour left to closing! to top it off the receptionist (INDIAN LADY with yellow highlights hair)  was rude about it. my head was throbbing and i felt very weak. i felt so bad to be turned away at such a point. there should be greater efforts made to either manage loads or hire better more efficient staff.\n\nhere is an edit after reading other reviews: perhaps the staff here (under a presumption that some are 'faking' their illness) have adopted a nonchalant attitude in their approach. In any case that is not their judgement to make. The vast majority of people coming in are HURTING. the staff should keep that in mind otherwise they have no place in healthCARE.",
      "time": 1739364422,
      "translated": false
    },
    {
      "author_name": "Peifeng Yang",
      "author_url": "https://www.google.com/maps/contrib/101816698011024558621/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLu_Q5sk54PBPpivDtkqIdmwOMoqxD7F2DIYK5ZeqhlWS09lg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "The worst experience in my life. I was doing medical check up there. When called my number on the screen I walked in doctors room but the doctor just give me a rude hand sign to let me wait outside and I waited until another patient walked in doctor room. I ask nurse what happened she showed me an angry face and sighed seems I was the one causing problem to them. After I saw the doctor I asked why I waiting outside the door you didn’t call me in? He said he called ( by press bell I guess). I was waiting outside and hope he walk to the door and call, probably the 5 steps walk waste his precious time and patience doesn’t deserve it. How about my time when I am waiting and waiting outside? It is just rubbish for them!",
      "time": 1733840410,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5177009475474292807",
  "user_ratings_total": 1308,
  "vicinity": "36 Nanyang Avenue, #01-01/02 Nanyang Technological University"
}