{
  "formatted_address": "144 Upper Bukit Timah Rd, #04-05/06/07 Beauty World Centre, Singapore 588177",
  "geometry": {
    "location": {
      "lat": 1.3423741,
      "lng": 103.7762593
    },
    "viewport": {
      "northeast": {
        "lat": 1.343521730291502,
        "lng": 103.7774519802915
      },
      "southwest": {
        "lat": 1.340823769708498,
        "lng": 103.7747540197085
      }
    }
  },
  "name": "FunLab Preschool 童乐园",
  "place_id": "ChIJXQcm5QnAqAUR4E8sUhBgyHk",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Andrew Ong",
      "author_url": "https://www.google.com/maps/contrib/108494269124872248062/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocISxZKhQftcjO0wWVhyjeTpF6Mquwq_do0ZZJ_JM54_KVLgkA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "My son really enjoys the FunLab preschool environment and curriculum. Great that the administrators and teachers are experienced and super professional.\n\nSchool is clean, spacious, and has a well thought through layout. Good mix of outdoor time, toilet + shower facilities, books, toys and other craft materials and yummy food.\n\nMattress provided so no need to purchase your own.\n\nHe's been to 3 different preschools, this is best one he's been to by far.\n\nRight at the Beauty World MRT door step, level 4 of Beauty World Centre.",
      "time": 1731674072,
      "translated": false
    },
    {
      "author_name": "Saeko Ikushima",
      "author_url": "https://www.google.com/maps/contrib/107064262731189628897/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK2Tmkq_OqJjV1lJklsSgwaECxN_BA1DwFJBrmNmi5EbfdOfg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Since it's a newly opened, it has a small class size, which allows the teachers to give close attention to each child and provide personal support. They update the daily activities with photos, so I can see in real-time what my daughter is doing.\n\nThe communication between parents and teachers is also very good. If I need to ask anything, I can easily talk to them, and I trust them with my daughter.\n\nEvery day, different activities are planned, and my daughter looks forward to going to school. The English and Chinese programs are also great.\n\nThe new playground is well-maintained, and it gives the children a large, safe space to play in.\n\nAlso, the location is very convenient. Since it's on the roof of a shopping mall, I can drop off and pick up my daughter without worrying about getting wet on rainy days, which is really helpful.",
      "time": 1737524394,
      "translated": false
    },
    {
      "author_name": "Sophia Goh",
      "author_url": "https://www.google.com/maps/contrib/105101743025515484883/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVVvwboeCVT9PYkK1vQBINGLD2T5NIlYba55rrR7GkaSiP7WO0=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "My daughter started playgroup at Funlab in January 2025 and transitioned so well to starting school. The principal, Ms Lay Hong, and the teachers, were very warm, welcoming and patient, and really took very good care of her. She looks forward to going to school everyday.\n\nThe teachers update what she does in school everyday, which is very reassuring for a working parent to see that she is well taken care of and learning well in school. She goes for outdoor time, indoor playground, song and music, and arts and crafts, with new activities planned every day.",
      "time": 1740624573,
      "translated": false
    },
    {
      "author_name": "Alison Liew",
      "author_url": "https://www.google.com/maps/contrib/102588831111975844872/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWkamMmKr9t-fPWZ1FGziJoiaFsvt6lUMFvmMswpFh3rsjcS0HV=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "My 19-month old started attending Funlab Preschool in January 2025 and the experience has been nothing short of fantastic thus far. The principal is highly experienced and very hands-on with the children.\n\nThe school is well-renovated with an indoor playground as well as a outdoor open space which allows for different types of activities to be carried out. As it is located near the Rail Corridor and Rifle Range Park, the children are brought out to explore and experience nature.\n\nI think the best testament is seeing my child rush through her morning routine as she doesnt want to miss a single minute of curriculum time. As a parent, this brings incredible comfort knowing that my child wakes up and looks forward to going to school every single day. I can only hope that this continues going forward.",
      "time": 1740623106,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8775369497145790432",
  "user_ratings_total": 4,
  "vicinity": "144 Upper Bukit Timah Road, #04-05/06/07 Beauty World Centre"
}