{
  "formatted_address": "B0114 , BLOCK B, 3, EKO GALLERIA, TAMAN, Persiaran Eko Botani, ECO BOTANI, 79100 Iskandar Puteri, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.4407264,
      "lng": 103.6172489
    },
    "viewport": {
      "northeast": {
        "lat": 1.442058530291502,
        "lng": 103.6186212302915
      },
      "southwest": {
        "lat": 1.439360569708498,
        "lng": 103.6159232697085
      }
    }
  },
  "name": "Gaia Reserve - Eco Galleria",
  "place_id": "ChIJzZpZTrIL2jERw7VEh5vlpM8",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Mason Tay",
      "author_url": "https://www.google.com/maps/contrib/108195777674730720034/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI3l4pFW9WlEHgxW0gH_IGJEwq0L2xp6TODRlTJg0TN4nYP7g=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 2,
      "relative_time_description": "a week ago",
      "text": "Gaia Reserve @ Eco Galleria – Beautiful Space, Underwhelming Experience\n\nDespite the upscale branding, the overall dining experience at Gaia Reserve didn’t quite live up to expectations.\n\nThe Wagyu beef, though of excellent quality, was oddly served in a small, concave bowl, making it awkward and difficult to slice. The portion size of the Merry Me Chicken was also disappointingly small—barely enough to satisfy.\n\nOn the brighter side, the black truffle mushroom soup was rich and flavorful, with real chunks of mushroom that we appreciated. The foie gras with pear was also a standout, well-executed and nicely balanced in flavor.\n\nService was polite but didn’t leave much of an impression, especially at this price point. Overall, while some dishes were enjoyable, we left feeling that the experience didn’t justify the cost.",
      "time": 1747047437,
      "translated": false
    },
    {
      "author_name": "Yii",
      "author_url": "https://www.google.com/maps/contrib/100346815442763561710/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJdXbfgwkzHIJM5pPx5ii4acbnHbZRhQulaQnS3D0HH2TSOPg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I had a wonderful dining experience at this restaurant! The atmosphere was warm and inviting, perfect for a relaxing evening. The service was top-notch, especially Mark, who went above and beyond to make us feel welcomed. To top it all off, there was a live band playing with an amazing vocalist that added such a great vibe to the evening. Highly recommend this place for both the food and the overall experience!",
      "time": 1737204071,
      "translated": false
    },
    {
      "author_name": "Jia Jin",
      "author_url": "https://www.google.com/maps/contrib/114232399407599542158/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJQAx2e_npw93nIL8QI0XI2aYPfm9ERm3gYg9SA_XDcwZnh19U=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "Let's talk about the pros first, the only thing is great is the atmosphere and their layout design.\n\nSaw this recommendation on XiaoHongShu, its my bad which i didn't look thru google review.  The worst thing is those dishes on Menu was 40% not available, this was not informed when we're doing reservation, while its only mention wellington steak need to be pre-order, seafood selection only have 5, but 2 is not available, we select for Miso Sake Cod, and after 5 min, the staff told us its not available today as well, we only have salmon and scallop today. Its ridiculous!\n\nTalk about the food, Merry Me Chicken should be chg to Forgive Me Chicken, tasteless chicken worst than spring roll with super salty sauce. Blue Fin Tuna Roll which the side, kelp is the best in all dishes, the sauce is totally unmatch with the roll. Full blood steak which we order medium doneness, but the actual is medium well. Salmon which we take as alternative of Codfish which is really common, nothing surprise.\n\nConclusion, all the menu are overpriced with normal to bad taste, no surprise you will get here, please lower your expectation if you are coming. If you are looking for something that is worst, Here's the best choice.",
      "time": 1747017545,
      "translated": false
    },
    {
      "author_name": "Darryl Wong",
      "author_url": "https://www.google.com/maps/contrib/110894705557562170787/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIMEUUiar5V4jroqw96W6HKj-Q_UcwSC6fCVC2jQAgA7lQOoehG=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Had an amazing dining experience here! The food was absolutely delicious, with flavors that really stood out. The ambiance was perfect—cozy and inviting, with great attention to detail in the surroundings. To top it off, they had live band performances that made the evening even more special. Last but not least , with our server , David , was friendly and made sure we had everything we needed .  Highly recommend!",
      "time": 1737207176,
      "translated": false
    },
    {
      "author_name": "Louis",
      "author_url": "https://www.google.com/maps/contrib/114348926997417838603/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWe0RFviPJyiVV8jxIeQ32i3cGUn1_DBWBZ67c8SC-mNiaZSDK1-A=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "The restaurant’s stunning ambiance initially promised an unforgettable fine dining experience, but the meal quickly fell short of expectations. Service was inconsistent, with significant delays in serving the food despite later-arriving tables being served first. The mushroom soup was unexpectedly sweet and served lukewarm, while the smoked duck pasta was overly salty and lacked harmony between ingredients. The tuna roll was devoid of freshness, with a flat, uninspired taste. The Nostalgia Chicken, intended as the centerpiece dish, was served undercooked, accompanied by overly salty mashed potatoes and poorly prepared garnishes. Even the Negroni cocktail failed to impress, being excessively sweet with no drink menu available for reference.\n\nIn summary, while the atmosphere was well-executed, the overall dining experience was marred by poorly executed dishes and inconsistent service. This visit felt less like fine dining and more like a test of endurance, with little justification for its premium price point.",
      "time": 1739424596,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "bar",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14962336318183749059",
  "user_ratings_total": 121,
  "vicinity": "3, EKO GALLERIA, B0114 , BLOCK B, TAMAN, Persiaran Eko Botani, ECO BOTANI, Iskandar Puteri"
}