{
  "formatted_address": "415 Jln Besar, Singapore 209016",
  "geometry": {
    "location": {
      "lat": 1.3139779,
      "lng": 103.8599561
    },
    "viewport": {
      "northeast": {
        "lat": 1.315361480291502,
        "lng": 103.8613427802915
      },
      "southwest": {
        "lat": 1.312663519708498,
        "lng": 103.8586448197085
      }
    }
  },
  "name": "Gaia Vets Singapore (Jalan Besar)",
  "place_id": "ChIJK4BigyAX2jEREWaZBscqNlI",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Mariyya Hairil",
      "author_url": "https://www.google.com/maps/contrib/100102612177705787394/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUxt5fRhF7grH20ZsR91HpCARAfSCMPNGY1N0gw2mjJ0YpAVZ8=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I own 7 lovebirds and Gaia Vets is my go-to get clinic whenever any of my birds needs veterinary attention. The staff here have been nothing short of accommodating and professional in what they do. They are able to work well, even when the vet clinic gets busy and my birds have received the best attention and care from the working staff here. They never fail to update on the birds health and always check-in on their well fare after prescribing medications.",
      "time": 1740377945,
      "translated": false
    },
    {
      "author_name": "Davyd Lin",
      "author_url": "https://www.google.com/maps/contrib/109607377127929756342/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW_VAgorEQlEthOw_e4xxO3Eq4la25H2zEUiAYqzofP9eyHHF0jDg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "We’ve been loyal clients of Gaia Vet for nearly a decade. Our senior pup, Tara, is like family to them, and she’s always showered with love whenever we bring her in for a checkup.\n\nCost wise, Gaia offers very affordable medication and they’re always ready to help whenever we need them. Tara has undergone two major surgeries and has always received the best care each time.\n\nWe couldn’t ask for a more dedicated and compassionate team to look after her. Thanks Gaia team 💯❤️",
      "time": 1741086911,
      "translated": false
    },
    {
      "author_name": "Ting",
      "author_url": "https://www.google.com/maps/contrib/102066747652106213041/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLQ3RkUobzxtoJlSK7vQdWn3TIdLiVGPMEg_pHw5KePHQAHmw=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Dr Arman and the team at Gaia Vet provided exceptional care for our senior dog, Brownie, carefully weighing treatment options while prioritizing comfort and quality of life. They took the time to explain everything thoroughly, answered all our questions with patience, and offered compassionate guidance. We truly appreciate their kindness and expertise and highly recommend them to anyone looking for a vet who treats pets like family.\n\nEnclosed: Brownie, at 16 years old, enjoying her day at the beach.",
      "time": 1740314170,
      "translated": false
    },
    {
      "author_name": "Melinda Dang",
      "author_url": "https://www.google.com/maps/contrib/105800352768812676043/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIS0lqbWmviDRjoohNPHDerXX19IF0pBGK1ILzy77w7nCFSng=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "My dog injured his leg and Gaia was able to see him right away. On the phone, I was told what to expect and potential fees involved, but some of those fees were voluntary depending on what I wanted for my dog. The vet was very thorough, explaining why he is having issues, why he might have future issues, and what options we have to help him, laying out a course of action if he gets worse. We chose not to do anything invasive and the vet never pushed us at all or try to upsell us. She was awesome! The receptionists were also very cool. Later in the week, they contacted me to see how my dog was doing. Never had a vet do that before for  a non emergency case. Price is extremely reasonable. Keep doing what you are doing, Gaia!",
      "time": 1746575760,
      "translated": false
    },
    {
      "author_name": "Tien Goh",
      "author_url": "https://www.google.com/maps/contrib/114859506245482379569/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIsxETB5e8ET-6IL2YvIV8zxnMJgdhoIe2ZzkvyiRZnTk0BGw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "A photo of Peanut (regular customer of Gaia Vets) in her happier days.\nThank you all at Gaia Vets for the years of care for Peanut.\nGuys, ignore the One star ratings here and just go to Gaia.\nThey have showed nothing but professionalism and kindness over the years.\nThey managed to diagnose many issues correctly over the years for my two dogs Peanut and Pudding.  And the teams were all empathetic and supportive.\n\nAs for price, I find them the most reasonable\nJust for benchmark:\nTwice I brought them to both to another vet.\nFor the same issue, Pudding’s bill was $250 at Gaia but bill was $900 at another vet.\nFor the same treatment when Gaia was closed due to relocating , Peanut’s weekly treatment was $240 at another vet , while it is $105 at Gaia.\n\nBottom of my heart, a big shout out to the team. Every single doctor, assistant and front desk team & Felicia’s cheerleader smile. “Thank you”\n\nI finally have the courage and mood to write this. After mourning Peanut’s passing.\nThank you for being there for us over the years.",
      "time": 1732517498,
      "translated": false
    }
  ],
  "types": [
    "pharmacy",
    "veterinary_care",
    "health",
    "store",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5923969394150041105",
  "user_ratings_total": 219,
  "vicinity": "415 Jalan Besar"
}