{
  "formatted_address": "G08-01 ECO NEST APARTMENTS JALAN EKO BOTANIC 3/5, TAMAN, Persiaran Eko Botani, 79100 Iskandar Puteri, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.4389116,
      "lng": 103.6192905
    },
    "viewport": {
      "northeast": {
        "lat": 1.440302330291502,
        "lng": 103.6206821302915
      },
      "southwest": {
        "lat": 1.437604369708498,
        "lng": 103.6179841697085
      }
    }
  },
  "name": "Gather Pizza Eco Botanic - 100% Sourdough Pizza in Johor Bahru /Handmade Fettuccini Pasta/Handmade Squid-Ink Pasta",
  "place_id": "ChIJ8RAtiQwL2jERt9drXkFD_GU",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Kelias Quek",
      "author_url": "https://www.google.com/maps/contrib/102455125673888414066/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUnnqKgHJhJHQteS20SNf4c1M3la-iNZ0I5iIXGCnQP-p8vnJSkaw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "This new pizza place, opened by the same team behind the popular bakery and café, is a true gem! I absolutely love their take on Italian cuisine – it’s authentic, with rich flavors that transport you straight to Italy. What sets them apart, though, is the creative twist they’ve added with their Malaysian-inspired signature flavors incorporated into their pizzas and pastas. It’s a unique fusion that works surprisingly well and adds an exciting, flavorful edge to traditional Italian dishes.\n\nEvery bite was packed with quality and flavor, and you can tell they pay great attention to detail in both the preparation and presentation. If you’re looking for something authentic yet innovative, this place is definitely worth a visit. Whether you’re a fan of classic Italian flavors or curious about trying something new, they’ve got something for everyone. Highly recommend giving it a try!",
      "time": 1739690748,
      "translated": false
    },
    {
      "author_name": "Sirajuddin Jamat",
      "author_url": "https://www.google.com/maps/contrib/113481727480900530402/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIln1SwXxhWsnTkzETVonwDyD6l2da9B80evD_6CCVEt4nwCkE=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I chanced upon this gem while trying to find lunch with my colleagues. We were warmly greeted by the friendly staff. Because of the large group of more than 10, we get to try out a lot of items and I must say that the taste and quality is very good. We were also impressed by the pizza albeit slightly charred. The drinks were nice too! I’d highly recommend this place if you’re around the area!",
      "time": 1736214112,
      "translated": false
    },
    {
      "author_name": "Michelle Francisca",
      "author_url": "https://www.google.com/maps/contrib/117800130454123794759/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWqbeeOxCjg6w0PunMiKO8sTptrLV-zgvHWtv4dS-_xT7b71GU=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "I was craving margarita pizza. I found this place from google. The pizza definitely exceeded my expectations, love how soft and tasty the pizza dough added with smokey depth it is really superb. It’s unlike other pizza I ever ate. Love they put fresh basil leaves and plenty of cheese and sauce. We also order corn as an appetiser, we were amazed how sweet and savoury the corn is so delicious. We definitely will come here again.❤️",
      "time": 1741957780,
      "translated": false
    },
    {
      "author_name": "Keh Ping Tee",
      "author_url": "https://www.google.com/maps/contrib/117812576950204882659/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIK0Hvn2rR-WBcP7ztPgd0hwdNz_rKsG4y4nsbtOa73LVxVNQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Five stars aren’t enough for this place!\nTried their margarita pizza with sourdough base, and honestly—it blew me away. The crust had that perfect sourdough tang and a beautiful chew, slightly crisp on the outside, soft and airy inside. The tomato sauce tasted fresh and vibrant, the mozzarella melted just right, and every bite had that perfect balance of flavor. Simple, but done to absolute perfection. If you’re a pizza lover, this one’s a must-try.",
      "time": 1747160166,
      "translated": false
    },
    {
      "author_name": "NY NY",
      "author_url": "https://www.google.com/maps/contrib/116708941660555263029/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU31itFtew1g4S7X6RirdcI3T-A_WpvkeQnyrFAc6NGZEnWdA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "First customers, yet we were served uncooked dough. See for yourself.. so for the price paid, I’d not revisit.. and definitely don’t care to get 5rm discount to give a 5 star review..\n\nAlso the microwave sounds were quite a turn off. Even though yes there will be instances microwave is needed, to hear it when our food is being prepared made me wish I went somewhere else.\n\nAnd they couldn’t manage to prepare tiramisu citing “only one staff in kitchen”.. :(\n\nThankfully they opened on the dot at 12pm. But given it was a sunny day, sitting nearer to counter may be a better option.",
      "time": 1738567234,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7348822639997867959",
  "user_ratings_total": 188,
  "vicinity": "G08-01 ECO NEST APARTMENTS JALAN EKO BOTANIC 3/5, TAMAN, Persiaran Eko Botani, Iskandar Puteri"
}