{
  "formatted_address": "Katong Shopping Centre, Annexe Block #04-01, 865 Mountbatten Rd, Singapore 437844",
  "geometry": {
    "location": {
      "lat": 1.3044133,
      "lng": 103.9015686
    },
    "viewport": {
      "northeast": {
        "lat": 1.306003130291502,
        "lng": 103.9030203802915
      },
      "southwest": {
        "lat": 1.303305169708498,
        "lng": 103.9003224197085
      }
    }
  },
  "name": "Genesis Gym",
  "place_id": "ChIJa04K9EcY2jERF7Q8uKL69o4",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Joel",
      "author_url": "https://www.google.com/maps/contrib/115931914172855103590/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKKyvP7D5hBTIepvu73EHpcanxqaNzxkUftVM2kZYsfDCSXFQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "I have been going to Genesis Gym for about 6 months. I like that they tailor the training programs (including nutrition tips) to my goals, and we do periodic assessments to check in and make adjustments. The trainers are also supportive, knowledgeable, encouraging and give me the right amount of push. Highly recommended if you are looking for help with your fitness goals!",
      "time": 1745232930,
      "translated": false
    },
    {
      "author_name": "Anissa Wong",
      "author_url": "https://www.google.com/maps/contrib/101898999547860963232/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK6agMXPkUAHyxsxEKFenEvnUHNHTxqncT7ZI02WcL_Gn1xXA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "We have been with Genesis Gym for about 3 months. We chose this gym because it’s near our home and it’s friendly towards people over 50.  We are new to strength training with weights in a gym setting. It did feel a little intimidating at first.\n\nThe doubt was quickly squashed by the dedicated team of trainers, who helped us manoeuvre through the little jungle of gym equipment and got us to the right form for each exercise. They also have an app that shows the personalized exercises for each of us and keeps track of our progress. At the end of each 4- to 8- week program, measurements would be taken to check on the actual physical results. A counseling session on diet & nutrition would also take place at the same time.\n\nThe age range of the people working out at this gym varies from the teens to the 70s!  But there is a slightly higher concentration of folks in the middle range. There are some obvious seasoned athletes that lift way above the average folks. Having said that, you wouldn’t feel out of place no matter what age or in what fitness level you are.\n\nThe trainers are a fun but also very professional bunch of guys (no female trainers, bummer!). A shout out to Jerome for taking great care of my prior injuries and existing issues. He would tweak the exercises to ensure they don’t aggravate them but at the same time achieving similar results. He’s also hilarious making training fun! And Malcolm, who just joined the gym has been able to explain the reasons behind the right forms so clearly that you can perform them with confidence after his adjustments. Of course, there is Jen, the manager of the Katong branch, the most serious (but friendly) one of all. He has the ability to elevate the energy level of the gym by just cheering people on from 10 ft away or correcting forms up close!  In fact all other trainers have also been very proactive in offering help when you look a little lost or when the original trainer guiding you is busy with another client.\n\nOn some occasions I would have to wait for a machine when several of us are given the same exercises. But it isn’t often.\n\nThe physical space of Genesis is very basic.  The focus is more on the quality of the training and less so on the experience of the physical space. All in all, I’d highly recommend this gym to people who want to get started on strength training and who want to see results.",
      "time": 1700462158,
      "translated": false
    },
    {
      "author_name": "Joseph Lee",
      "author_url": "https://www.google.com/maps/contrib/105771934429724515380/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUasns4jVY_jqcU9ph0AqELcP95PliDIzbQ8WhVytCTJHaqE9GC=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "We work and reside overseas but have been working from home in Singapore for a few months thanks to the pandemic. We needed a local gym to keep us active and are happy to come across Genesis Gym at Katong SC. This is a very lively gym and all the trainers are super nice, friendly and encouraging. My wife and I both gained 2kg of muscle mass and dropped our body fat % by almost 5% after just 8 sessions of intense training at Genesis. Thanks to Jen, Alvin, Al, Jerome, Ada and all the other trainers who gave us guidance. We just finished our 12 sessions and have signed up for another 12 sessions each. Cannot recommend enough of this gem in the fitness industry! Good job!",
      "time": 1671162662,
      "translated": false
    },
    {
      "author_name": "C K Lee",
      "author_url": "https://www.google.com/maps/contrib/108928366865552158483/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIGcyS-RRrPVZKFIlXBKNbOQOJfrwNDKuUge76mG5DUZ10dEg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Back in 2022, I made a birthday resolution to transform my physique. Back then, despite years of regular runs/swims, I weighed in at 68+Kg, with >22% body fats. Definitely not an inspiration for my two teenage boys.\n\nStumped upon Genesis Katong, like what I saw & signed up with them. It was perhaps one the best decision I have made! Genesis Gym taught me the science of strength training, proper training techniques, recovery essentials, importance of nutrition and diet management. Jen and his cadre of trainers, Ada, Felix, Jerome, Malcom and Andrew…. are knowledgeable, attentive and encouraging. The trainers, together with the gym kakis, fostered a friendly and supportive environment.\n\nToday, I manage to sustain my weight at ~61.0Kg, with 11.8% body fats. Strength training becomes a common topic with my boys. Birthday wishes do come TRUE! Keep the faith, stay the course & I strongly recommend you sign up with Genesis Katong! ; )",
      "time": 1729312101,
      "translated": false
    },
    {
      "author_name": "Jason Cheong",
      "author_url": "https://www.google.com/maps/contrib/114916905627158609310/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWKgxNrz-fXt44IVj_wlnXoCd2OLwhFVZryGS-jll62XGqtBTX0xg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "I can’t recommend this gym enough! I used to experience fainting spells whenever I exerted myself, whether in the gym or outside during exercise. But thanks to the incredible owner, Jonathan Wong, and his magical touch in “fine-tuning” and balancing whatever was missing, I am now completely fine. Jonathan’s expertise has allowed me to push myself to the next level without any issues.\n\nAdditionally, the knowledgeable gym coach is always ready to help and advise on the correct posture, ensuring that I stay injury-free. This gym has truly transformed my fitness journey, and I am grateful for their exceptional support and guidance",
      "time": 1729489162,
      "translated": false
    }
  ],
  "types": [
    "gym",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10301696774439220247",
  "user_ratings_total": 265,
  "vicinity": "Katong Shopping Centre, Annexe Block #04-01, 865 Mountbatten Road"
}