{
  "formatted_address": "Bukit Merah Vw, Singapore 150129",
  "geometry": {
    "location": {
      "lat": 1.2835496,
      "lng": 103.8239931
    },
    "viewport": {
      "northeast": {
        "lat": 1.284998830291502,
        "lng": 103.8251702802915
      },
      "southwest": {
        "lat": 1.282300869708498,
        "lng": 103.8224723197085
      }
    }
  },
  "name": "Gladys Care 1987",
  "place_id": "ChIJt5yoIXMZ2jERwTPGvMYmWeQ",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "AA",
      "author_url": "https://www.google.com/maps/contrib/115401133365724364809/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKRNxioO-pXBckxASZ1cAJyjbJjxx7QS6QbAo-ONjVlqe7FlA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We highly recommend Gladys Care to anyone seeking nanny services. Gladys was very responsive, accommodating to our bespoke requests and patient with questions. She assigned us Nanny Lily as our live-out night nanny for 3 months, which included post-natal massage for a week. We found Nanny Lily to be warm, trustworthy and experienced with infant care. She offered helpful suggestions while always respecting our childcare preferences. Our baby loved her and we miss her very much! We are grateful to Gladys for finding us such good care and will definitely use her agency again.",
      "time": 1744316468,
      "translated": false
    },
    {
      "author_name": "Linda Liu",
      "author_url": "https://www.google.com/maps/contrib/104676371359535950624/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLiJzJSu-6Hr6dIJsZRhuPI02zNmrZNUwXaFT3pxXT9oYK_wA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Im booked two months and two different nannys. At first I'm was worried about if different nanny might cause a lot of troubles surprisingly everything are fine. Two nannys are professional and patience withm my girl, also good cooking im satisfied with my choice. Glady also are very caring for me.",
      "time": 1745891204,
      "translated": false
    },
    {
      "author_name": "Lee Ruijian",
      "author_url": "https://www.google.com/maps/contrib/116233952163112761675/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUab3F12_9w4Ar3n3RT-4KAt9ct5z3ZLZtSzCnaBjBZf_ONgOI=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "We are very fortunate to have a great 28 days of confinement with Nanny Julie, as well as the brilliant massages performed by Ms Gladys.\n\nMy wife and I enjoyed the process, the food and of course the human touch factor.\n\nTagging on their vast knowledge, we matured along our parenting journey. Not an easy journey but these angels decided to give us a good start on this journey.\n\nGreat thanks to Gladys and her team.\nWe really appreciate your presence.",
      "time": 1730995674,
      "translated": false
    },
    {
      "author_name": "Harsh Raghuvir",
      "author_url": "https://www.google.com/maps/contrib/107920450514543163542/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXrZ7BelDKjJkOPmsZG6dWPNNMzoMskNUSwiOkNfi0H8TSae4tAZQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "We had the pleasure of hiring Gladys Care’s confinement nanny service in Singapore, and we were incredibly fortunate to have Tammy as our nanny for our newborn twins.\n\nTammy provided exceptional round-the-clock support to my wife, ensuring she had everything she needed during this crucial postpartum period. Tammy’s expertise and dedication were evident in how she seamlessly bridged cultural and language divides, fostering a warm and supportive environment in our home. She was highly attentive to the needs of our twins and also respected our parenting preferences, making sure to communicate openly with us every step of the way. Her ability to balance care for both babies with our family’s unique needs made this experience so much smoother. We are deeply grateful for her professional yet caring approach and highly recommend Gladys Care for anyone seeking top-tier confinement care.",
      "time": 1728268218,
      "translated": false
    },
    {
      "author_name": "Han Nguyen",
      "author_url": "https://www.google.com/maps/contrib/113093380960818911062/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUUd1OQvPUeyjfYwZxyCh5mQalpjqpzeakLnv8LQVIXde5WtFk=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "I had twins at 37 weeks and could not latch them immediately as they were too small. My supply went down from 40ml to as low as 10ml per pump as I started spending my days feeding the babies formula. Gladys came to our rescue a week after the delivery with her TCM breast massages. We had 4 sessions together and she gave me tons of advice on my diet and lifestyle to holistically help with the supply. I have definitely seen a steady increase now pumping 70-90ml at a time and Gladys thinks it’ll go up more if I keep pumping regularly! I am so happy and excited to be able to finally feed my babies the good stuff. Thank you Gladys!",
      "time": 1582090507,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16454225348587303873",
  "user_ratings_total": 76,
  "vicinity": "Bukit Merah View"
}