{
  "formatted_address": "6A Napier Rd, Singapore 258500",
  "geometry": {
    "location": {
      "lat": 1.3076174,
      "lng": 103.8198659
    },
    "viewport": {
      "northeast": {
        "lat": 1.308791730291502,
        "lng": 103.8212740802915
      },
      "southwest": {
        "lat": 1.306093769708498,
        "lng": 103.8185761197085
      }
    }
  },
  "name": "Gleneagles Hospital",
  "place_id": "ChIJWXTRJCAa2jERXNBB0kxTWSU",
  "rating": 3.5,
  "reviews": [
    {
      "author_name": "Pei Ying Lee",
      "author_url": "https://www.google.com/maps/contrib/114463371506540794189/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIq2C-yXiOBfeqvsGY6s9gAHZLtWmKm51jz9hJ930mN8MM6xg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Admitted for one night stay at Ward 6 west wing for a surgical procedure. Admission office staff was very clear in her explanation in my estimated bill size and payment process.\n\nRoom was clean and well-equipped. Nursing and ancillary staff were all very caring and meticulous in providing care. They checked in on me regularly to assess my pain and attend to my needs. Probably can cut down on the frequency so that patient can have better rest.\n\nPlenty of hospital food options to select from and all tasted very good! I was always looking forward to the next meal.\n\nOnly comment was lacked of info explained to me on what to expect while I’m waiting to be pushed to OT. I waited for more than an hour in my room  not knowing what is going on, when I should change into my robe etc. While at OT, the team was extremely swift in their preparation, would’ve been more assuring if they can inform me what is going to happen at every step.\n\nNonetheless, very thankful to all staff for a fuss-free surgery and stay.\n\nThank you team Gleneagles!",
      "time": 1736434353,
      "translated": false
    },
    {
      "author_name": "Dr. Martha Tara Lee",
      "author_url": "https://www.google.com/maps/contrib/117760636688070753628/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXCAzeIxBfjBJA8pa75xjKtiM6zBXolmjz2StHiYx9rGn2PZCUIUA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "My experience at Gleneagles Hospital was marked by outstanding care, professionalism, and even a bit of humor, which made all the difference during my recovery. From the initial consultation to post-operative follow-ups, the staff’s dedication to patient well-being was evident. The state-of-the-art facilities and collaborative approach among the medical team provided a sense of security and trust throughout my treatment.\n\nI would like to especially thank the nurses in Ward 6 for their exceptional care. Not only were they incredibly attentive and kind, but their light-hearted humor helped me stay positive during a challenging time. Their jokes and playful banter made the atmosphere feel more relaxed, turning an otherwise stressful experience into one where I truly felt at ease.\n\nAdditionally, I want to express my appreciation for the administrative and medical staff at Gleneagles who ensured seamless coordination, making my time at the hospital as smooth and efficient as possible. I am truly grateful for the comprehensive care and the warm, humorous support I received. I would highly recommend Gleneagles Hospital to anyone seeking top-quality medical services with a personal touch.",
      "time": 1744122333,
      "translated": false
    },
    {
      "author_name": "Ayuni Idora",
      "author_url": "https://www.google.com/maps/contrib/110880627309113778849/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL1AaF0et5rHhGEqpx24Iu9zSao--dmIgSfGpdGZo-5xMvysg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Had a 2 days 1 night stay at Ward 5 East wing ( Maternity Ward ) due to emergency laparoscopy. Nurse armina was really nice and welcoming ! She kept on checking up on me to make sure i was well rested & well eaten !",
      "time": 1744217136,
      "translated": false
    },
    {
      "author_name": "Richelle Yap",
      "author_url": "https://www.google.com/maps/contrib/117592059936217306103/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJiPqKgTD_zpsTnr-YFtu3maYO2ilEI8TIjHlF880-3qPQQwy5s=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "On 15 April, I experienced shortness of breath halfway through work and was admitted to the emergency department. All the medical staff I encountered were wonderful, especially Dr. Nickhill Joy. He was kind and sincere—he helped me understand my condition and also comforted my husband. I truly appreciate the care we received. 💝",
      "time": 1745323951,
      "translated": false
    },
    {
      "author_name": "Alicia Joy",
      "author_url": "https://www.google.com/maps/contrib/103497215045374327002/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVEJN9klqexuSnXInLYfJOUEU1aV5_hYch0Y5pK1zNe15Mj_icLsA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "Everything went smoothly from registration, to surgery and the ward. Thank you for making my first surgery/hospitalization experience such a pleasant one :)\n\nRegistered around 5.30am and the admin staffs were very knowledgeable and efficient. After registering, I was being escorted to my room before having to prepare for the surgery. They also went through every amenities that was provided in the room too. Toiletries including face & body towel were provided. There's hot water shower too as seen in my foggy toilet picture, it was nice to have a nice shower before discharging.\n\nThe holding area for surgery was (realllllly) cold but it was nice that they provided a thicker blanket (and it was warm, sooo nice). The nurses and the Anesthetists came to check-in quite frequently before being pushed into the OR. The surgery went well and was pushed to a recovery area (guessing this since I was still waking up from anesthesia).\n\nStayed for a night and a shout-out to all the caring nurses in Ward 9 West for being so nice and reassuring :))",
      "time": 1716704540,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2691273841740730460",
  "user_ratings_total": 436,
  "vicinity": "6A Napier Road"
}