{
  "formatted_address": "67 Ubi Cres, #04-09 Techniques Centre, Singapore 408560",
  "geometry": {
    "location": {
      "lat": 1.3280652,
      "lng": 103.8981786
    },
    "viewport": {
      "northeast": {
        "lat": 1.329336680291502,
        "lng": 103.8993372302915
      },
      "southwest": {
        "lat": 1.326638719708498,
        "lng": 103.8966392697085
      }
    }
  },
  "name": "GN Hearing Pte Ltd",
  "place_id": "ChIJ85s27MsZ2jER8mflZs_spQs",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Andy Wong",
      "author_url": "https://www.google.com/maps/contrib/107841469192249863482/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUwn5pJjDXct82RqwRwSHafwu_hDEH80OkthFJ250cGsRvPKwcYFg=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "2 years ago",
      "text": "Had this Resound hearing aid for almost a year now? This was prescribed by a highly recommended audiologist. The hearing aids are a disappointment!\nFrom the start the battery on the left would run out faster than the right. The difference is 7 to 8 hours. Then both batteries I was told got replaced and now the right run out faster by 5 to 6 hours.\nThere are occasions when hearing aids would just pause momentarily.\nThe The Resound app is unstable and each time the reason given was there were issues with android phones whenever there are software upgrades. So much so that Resound app cannot catch up.\nNow I can't even connect the hearing aids to my mobile phone.",
      "time": 1657179118,
      "translated": false
    },
    {
      "author_name": "Kok Hoong Wong",
      "author_url": "https://www.google.com/maps/contrib/117026618249107133195/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVr81wG7wHzoxVh1CPif7AyxS0S0-ZfC-xskyCSSC6PEtBVs7OKkg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "My 93 year old dad bought one for SGD 6800. Or slightly more than USD 5000. I tried to go through the manuals. Did any of your staff try to read/use your own manual? There are inconsistencies in the labelling which adds to the confusion. And why can't you guys label left' and 'right' with letters on the actual devices instead of using a colour code? There are so many other design flaws and after reading some of the reviews I can't help but think this is basically a badly designed, badly presented product and the only reason why it is so expensive it's perhaps you split hefty fees with unscrupulous medical sales or personnel to get them sold. And why did I say unscrupulous? Because I do not think my dad needed the extra accessories such as extra device for connectivity to the TV and and the remote control.I wouldn't recommend anyone buying this.",
      "time": 1679833532,
      "translated": false
    },
    {
      "author_name": "Nirmala V S",
      "author_url": "https://www.google.com/maps/contrib/105875661553673345251/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLAuGCtVgyqrLbVJ_EuJrm8kPIZ6vt4DK-f6Hcot5NwfuP2WA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 years ago",
      "text": "After getting number of negative feedbacks from our friends about the hearing aids, we were really apprehensive to invest in one. But Resound not just helped us clear our doubts but also educate us about ear anatomy, how brain interacts with sound signals, importance of it recieving both natural and amplified sounds and benefits of wearing hearing aids in both ears simultaneously. They also counseled us about the right usage and expectations. We bought Linx 3D 9, which are really comfortable, particularly with custom made earmolds which makes it easier to wear on and take off, also they have wonderful sound quality. Best thing about them is that we get to control volume and other features with help of a mobile app. We are really happy with Resound hearing aids and their before and after sales services and would highly recommend them.",
      "time": 1529248777,
      "translated": false
    },
    {
      "author_name": "Tamir Ginat",
      "author_url": "https://www.google.com/maps/contrib/105833726772191279996/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKgkrXYVGg3oApxVa21smH4ctamIpHrGHyssZ1x6uuf7Sw1=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 years ago",
      "text": "GN Hearing is much more than a great hearing aids center.\n\nBuying hearing aids is a big decision...it costs a lot of money and you want to make sure that you are buying the right one for you and if something goes wrong, there will be someone to take care of it.\n\nSharad, Aditi and Jenny were there to help me through this journey and I’m sure they will also be there for you.\n\nThe after sales service I received from Sharad and the team exceeded my expectations, they were there whenever I needed them and always happy to help.\n\nIf you are considering buying hearing aids, I strongly recommend you to contact GN Hearing.",
      "time": 1475389623,
      "translated": false
    },
    {
      "author_name": "Theresa Tan",
      "author_url": "https://www.google.com/maps/contrib/101048001486644736992/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIRK2bEcwdYoodTXiY2Sp-RXi2J7-lLWNvQr8Nd6ysbA1HcxA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 years ago",
      "text": "I would like to commend Mr. Naresh for helping me on Thursday 16/11/17 to fix my hearing aid. I had just received my hearing aid from TTSH on 6/11/17 and few days after using, I realised that I could not hear as if my ear was being blocked. TTSH refused to help me after numerous calls to them.  I was disappointed because it was brand new and I could not use it for a few days.\n\nI am grateful to Mr. Naresh and Jenny who are very patience. Even though Mr. Naresh was very busy himself, I am very glad that he scheduled an appointment on the same day to rectify my problems. Throughout the whole session, Mr. Naresh was very polite and attentive to my problems.\nI also like to thank Jenny for helping me to set up an appointment and being so nice to even check on the air-con that will not be too cold for me.\n\nThis is the type of service that will make most consumers happy. Please keep up your effort.  Cheers!\nThank you.",
      "time": 1511153274,
      "translated": false
    }
  ],
  "types": [
    "electronics_store",
    "doctor",
    "health",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=839337281103161330",
  "user_ratings_total": 10,
  "vicinity": "67 Ubi Crescent, #04-09 Techniques Centre"
}