{
  "formatted_address": "2 Marne Rd, #01-03, Singapore 208393",
  "geometry": {
    "location": {
      "lat": 1.3129937,
      "lng": 103.8570245
    },
    "viewport": {
      "northeast": {
        "lat": 1.314295030291502,
        "lng": 103.8584390802915
      },
      "southwest": {
        "lat": 1.311597069708498,
        "lng": 103.8557411197085
      }
    }
  },
  "name": "Gobi Desserts",
  "place_id": "ChIJWyt2YA0Y2jERmAPpYQYNfrI",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Doraemon",
      "author_url": "https://www.google.com/maps/contrib/112665277904119154671/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX2VSCcaT9axvOwx2nD8XD3PgZ8V5VFnv420aocMSfLa6GlcEmN=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Kitty and I were on our way home from City Square Mall, and we decided to treat ourselves to some dessert before heading home.  We searched on Google for a nearby bakery and stumbled upon Gobi Desserts, a cozy and modern spot that specializes in low-sugar cakes and vegan pastries.  We were intrigued by their menu and decided to give it a try.\n\nWhen we arrived, we were surprised to find the place practically empty, just Kitty and me.  While the space was clean and inviting, with white tables and chairs arranged in a spacious room, and the soft, warm lighting created a relaxed atmosphere, it lacked a certain \"wow\" factor that might attract more customers.  We felt the decor could use a boost to make it more Instagrammable and inviting.\n\nDespite the quiet atmosphere, we were delighted by the variety of options on their menu.  We tried a Cappuccino, an Ice Blended Mocha, a Rainbow Slice Cake, and the Red Pear Crème Brûlée.  Our coffee drinks were served with two warm madeleines, which was a nice touch.  The server told us that the complimentary pastry that comes with the coffee changes every now and then. Currently, the complimentary pastry is Madeleine, and it's a vegan madeleine made with vegetable oil.\n\nThe cappuccino was expertly made, with a rich, creamy texture and a perfectly balanced flavor. The Mocha was also delicious, with a smooth, blended texture that wasn't overly sweet.\n\nKitty especially loved the Rainbow Slice Cake.  It was dense and cakey, with a visually appealing array of colors.  While the flavors were subtle, we could detect hints of fruity notes, which added a nice touch.\n\nThe Red Pear Creme Brulee was the highlight of our visit. The pear flavor was subtle, adding a delicate touch to the smooth, creamy custard.  The brulee topping was perfectly caramelized and crunchy, providing a delicious contrast to the soft custard.  The accompanying pickled beetroot and fruit slices added a delightful burst of freshness, complementing the dessert beautifully.\n\nWe were impressed by the overall quality of the desserts and the friendly service.  We highly recommend Gobi Desserts to anyone looking for a sweet treat.  We think with some decor updates, it has the potential to become a real gem.",
      "time": 1741521709,
      "translated": false
    },
    {
      "author_name": "Maros Demko",
      "author_url": "https://www.google.com/maps/contrib/117011482335509727890/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIT6SCySy-4QrAhqywO9ksrG2vSWw-coUZiT8U75kfqK0PQkA=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "2 months ago",
      "text": "We ordered most advertised lava cake, flavor was balanced and no sweet! Unfortunately lava cake was without lava and turned as microwave brownie. Bit banana and nice balanced ice cream. For price $14 not worth for us.",
      "time": 1740547892,
      "translated": false
    },
    {
      "author_name": "George Yohng",
      "author_url": "https://www.google.com/maps/contrib/109609806339687032624/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXzFgf_-OShZqx6P2EiRW3OfSl7N9pUSa86Kf4L5n8RCMlfQcML=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "This place definitely serves the best cheesecakes I ever tried. Chef Gobi comes from engineering background; all desserts or dishes you order are made with precision - the cheesecakes follow a strict recipe to maintain delicate texture and taste, the coffee has a nice tweak to accentuate the flavour, even a simple berry drink is transformed and prepared in layers. The quality is consistent, the atmosphere is nice.",
      "time": 1683174055,
      "translated": false
    },
    {
      "author_name": "Jason Jason",
      "author_url": "https://www.google.com/maps/contrib/101801267434565015122/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXc0HJiIGV_SBoKlqwdyUycQj8uCZ6H5SiIDH4onOfjhEYJnkT0xw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "A dessert dine in old school cafe. They had moved from Maxwell. We had very nice home made chocolate cake, creme buree and coffee latte. They also sell healthy enzymes shots. Low sugar and vegetarian options. Low volume retro background music.\n\nExcellent table service.",
      "time": 1714822708,
      "translated": false
    },
    {
      "author_name": "Aishah Begum",
      "author_url": "https://www.google.com/maps/contrib/115285505218765396521/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX2fDNsTP6av0XDZtvQFNO4Yu5lrCVVYQehDwnDiQMjojY_fOWggw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "I really like the pear creme brulee. According to the owner, the pear was soaked in red dragon fruit enzyme for 14 days to stimulate collagen. The live torching was exciting to witness, too. The lava cake was so delicious! Portions served was so generous. We also tried their apple cinnamon tea and cappuccino,  and both drinks came with a side of cookie and crumbs. We took away some cheesecakes for the kids. This place is vegetarian-friendly!",
      "time": 1671635747,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "bakery",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12861731906880340888",
  "user_ratings_total": 192,
  "vicinity": "2 Marne Road, #01-03, Singapore"
}