{
  "formatted_address": "218 Sumang Walk, #03-01, Singapore 820218",
  "geometry": {
    "location": {
      "lat": 1.4031037,
      "lng": 103.8954656
    },
    "viewport": {
      "northeast": {
        "lat": 1.404445630291502,
        "lng": 103.8968488802915
      },
      "southwest": {
        "lat": 1.401747669708498,
        "lng": 103.8941509197085
      }
    }
  },
  "name": "Greenland Childcare @ Sumang Walk",
  "place_id": "ChIJTxjql-EV2jERwjq94QlfbSY",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Zeb Tan",
      "author_url": "https://www.google.com/maps/contrib/116481234319910421779/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKhZGu0XKJb72jFiiQcw4dW8aDok0hi5zAgDdgPKPofU0oyMg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "The teachers put in tremendous effort to make the children’s graduation special. The kids gave a stunning performance for us parents! We’re truly glad to have chosen Greenland .\n\nWe’re so thankful for Teacher Ms. Judy for the amazing care you’ve given to our son. Your kindness, patience, and dedication have helped him grow and thrive in so many ways. It’s clear how much you love what you do.\n\nAlso big Thank you to Song Laoshi and Mr Shawn for the love, care and support!",
      "time": 1732947800,
      "translated": false
    },
    {
      "author_name": "Nelson Quek",
      "author_url": "https://www.google.com/maps/contrib/112644253236382139486/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXu_rM8wExqNL3N8HeHlwQEfA0Ky_id2VYS50GaPwdpcLF-ZnLr-A=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "We’ve had such a great experience with Greenland at Sumang Walk! My daughter absolutely loves it there and looks forward to school every single day. She’s always the first one awake in the morning, excited and determined to be the first to reach school.\n\nMiss Judy and Miss Song have been amazing teachers. My daughter adores them, and it’s clear how much effort they put into creating a fun, loving, and nurturing environment for the kids.\n\nWhen we recently bought our new place, one of the key considerations was ensuring it was near our current house, which is near to Greenland so she could continue attending the preschool she loves so much. We’re so glad we made that choice!\n\nHighly recommend Greenland to any parent looking for a warm and supportive preschool for their little one!",
      "time": 1733196576,
      "translated": false
    },
    {
      "author_name": "Hailan Guo",
      "author_url": "https://www.google.com/maps/contrib/115451337545285961388/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ-HWVWev9vfh0qYY36EhFzjvsCMo09-k3Hpyx4vQ9oDxWt8Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Our son has been at this school for almost two years, and he has been very happy here. This is all thanks to the dedication and hard work of the school and its teachers.\n\nWe would like to extend our heartfelt gratitude to Gong Laoshi, Ms. Judy, Kuang Laoshi, Ms. Amaleena, and Ms. Elda for their attentiveness and the loving care they have given to our child.\n\nThe teachers' dedicated guidance has given us, as parents, great peace of mind and has allowed our child to grow happily in a warm and nurturing environment. We sincerely thank all the teachers and the school for their efforts!",
      "time": 1733206996,
      "translated": false
    },
    {
      "author_name": "J T",
      "author_url": "https://www.google.com/maps/contrib/101071084297886764937/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWumHX3lIW2Irbk2_tTS0yp-zjd-HxnoyJb-z2OHW5MMShfNxx7Tw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "We transferred our child to Greenland Childcare @ Sumang Walk in 2023, and the difference has been remarkable. From the very start, I was impressed by the warm, nurturing environment the teachers provide. They are dedicated, caring, and truly invested in the children’s growth.\n\nIn just a short time, I’ve seen my child make incredible progress in both learning and confidence. She has developed a real love for attending childcare and looks forward to going every day.\n\nOur child has also made lasting friendships and loves spending time with her peers, which speaks volumes about the supportive, positive atmosphere at Greenland. As she graduate this year and transit to Primary 1, I can confidently say that this centre has laid a strong foundation for her academic and social development.\n\nI am so grateful for the care and attention given to my child, and I know she will carry the lessons she’s learned here into her next chapter. Highly recommend Greenland Childcare to anyone looking for a wonderful environment for their child.",
      "time": 1731931622,
      "translated": false
    },
    {
      "author_name": "weiyi weiyi",
      "author_url": "https://www.google.com/maps/contrib/115261437077923003810/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJQhrV6BCrXEXIKKiqAfWfLx1zDcZKQK2wgZBenpygrQhok7A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I want to express my heartfelt gratitude for the exceptional care and attention you provide to my child every day.\n\nYour dedication to creating a safe and nurturing environment where my child can thrive.\nThe engaging and educational activities that stimulate my child's curiosity and growth.\nThe warm and friendly atmosphere that makes both children and parents feel welcome and valued.\nWe are incredibly grateful for the love and support you offer. It gives us peace of mind knowing that our child is in such capable and caring hands.\nThank you for your patience, kindness, and the positive impact you have on my child's development.\n\nThank you once again for everything you do. We deeply appreciate your hard work and commitment.",
      "time": 1732938017,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2768973841949342402",
  "user_ratings_total": 37,
  "vicinity": "218 Sumang Walk, #03-01"
}