{
  "formatted_address": "624 Choa Chu Kang Street 62, #01-230, Yew Tee Square, Singapore 680624",
  "geometry": {
    "location": {
      "lat": 1.3981277,
      "lng": 103.7468169
    },
    "viewport": {
      "northeast": {
        "lat": 1.399742180291502,
        "lng": 103.7484941302915
      },
      "southwest": {
        "lat": 1.397044219708498,
        "lng": 103.7457961697085
      }
    }
  },
  "name": "Greenlife Clinic & Surgery Pte Ltd",
  "place_id": "ChIJc4d59vMR2jEReE-z3Zk92Uc",
  "rating": 2.6,
  "reviews": [
    {
      "author_name": "Kit Hui Teo",
      "author_url": "https://www.google.com/maps/contrib/105327687577034821338/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUqXC6GHJlDp9zLy4PdLSWMr7Mllf2uqekLxeJcIA6A6rREhtb6=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Dr Ho Lay Wah is the most unprofessional doctor I have ever seen. While the other clinic staff, and Dr Loo provide decent GP service, I came on Friday 11 April 2025 with bad headaches and ear pressure. Dr Ho only checked one ear, kept saying “DO YOU WANT TO SEE A NEUROLOGIST” when I asked her anything and provided no theories whatsoever, dumped a bunch of medication and that’s it. Found out at a different clinic that I have an inner ear infection in the ear that she did not check on Friday. I don’t know how a doctor like this is even working still in this country if she can just see people in one minute without checking anything. The guy before me was coughing hard with lots of phlegm and she saw him for like 30 seconds or something. I thought I could give this doctor another chance because I had a similar horrible experience years ago where she just dumped medication within 1 minute of seeing me that turned out to be irrelevant to my condition, but turns out that things have not improved at all and this doctor is hopeless. Do not waste your time seeing her if you come to this clinic. Shame",
      "time": 1744606683,
      "translated": false
    },
    {
      "author_name": "Pearl",
      "author_url": "https://www.google.com/maps/contrib/110656021232920183376/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKQDwNKmWPbtkTUqVAukGf04zvjfUszycRbY5ZbQbxTcHAUKQ=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "When you go into the clinic. You need to walk up to the counter in their face if not the staff won't serve you. She end up giving this guy who came after me an earlier Q number. I had no voice. But the good thing is the shorter wait time here.",
      "time": 1744338612,
      "translated": false
    },
    {
      "author_name": "Michelle Lim",
      "author_url": "https://www.google.com/maps/contrib/101176041390901817700/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUcHptE-sN3aOtVsppsUK7-MR-b3bc5quk10-dPTjRAqgv7rmeM=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Dr Daniel is my family’s go-to GP. My mom has always said that Dr Daniel is extremely knowledgeable and can be trusted. I never thought much about it till today, when he literally saved my grandfather’s life. In a quick few minutes, he was able to accurately identify what’s wrong my my grandfather, and even wrote a referral letter to the hospital so that he could receive expedited care. My mom brought my grandfather to see Dr Daniel at around 8pm, and by 9pm they were at the hospital, with my grandpa receiving appropriate treatments/care. With Dr Daniel’s quick accurate diagnosis and speedy referral, my grandfather was able to get the necessary treatments. It’s true that he is quick in diagnosis, and may sometimes come across as lacking “gentle care”, but it’s also because he has a high workload and maybe sees time to be of the essence. Dr Daniel is a great doctor and I am glad that he is able to serve our small Yew Tee community.",
      "time": 1674157953,
      "translated": false
    },
    {
      "author_name": "Tiffany",
      "author_url": "https://www.google.com/maps/contrib/107634747528741041435/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKOC-GfJxH_E57NQH3Hq9HsHCmSOWMpPqiYOxrqQJS9h66wiA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 years ago",
      "text": "Saw the doctor within 10 minutes, but then had to wait over an hour for the counter staff to print my MC and give my medicine. The short hair lady seems unqualifed, she takes very long to type and has to keep reprinting as she makes many mistakes that the other staff has to point out.\n\nPlease be more considerate of patients who are genuinely in extreme pain and need to get home as quicky as possible.",
      "time": 1652610800,
      "translated": false
    },
    {
      "author_name": "Tan Sock LING Wendy",
      "author_url": "https://www.google.com/maps/contrib/114936157857595437581/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIeEsp8mIX8M-HMkf3IoOZPNlKx4v5CcQkjTBPSe-gtT2Al8g=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "Doctors are good, only counter staffs the way their communication got many problem. We are your patients,we are not your staffs. I just want to add one more tablet for the medicine, the counter staff say to me, why I never mention early, how do I know, I not working here. And she is not happy when request from the patients to add or less. Not very happy for their services.",
      "time": 1681544003,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5177236977697902456",
  "user_ratings_total": 74,
  "vicinity": "624 Choa Chu Kang Street 62, #01-230, Yew Tee Square, Singapore"
}