{
  "formatted_address": "50 Edgedale Plains, Singapore 828848",
  "geometry": {
    "location": {
      "lat": 1.3962652,
      "lng": 103.9127224
    },
    "viewport": {
      "northeast": {
        "lat": 1.397810080291502,
        "lng": 103.9138705302915
      },
      "southwest": {
        "lat": 1.395112119708498,
        "lng": 103.9111725697085
      }
    }
  },
  "name": "Greendale Primary School",
  "place_id": "ChIJE3LmqtAX2jEReBt1NpyP9oM",
  "rating": 3.8,
  "reviews": [
    {
      "author_name": "joy x",
      "author_url": "https://www.google.com/maps/contrib/107670076447563459968/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKR_VsCQaA6PDDlQC4MDKuSjtf9b-vIH9MMLmDlqrRWKgW6AQ=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "greendale is a great school. my son, currently in p4, there enjoys the environment and says it's going well. They say they treat him very nice and are all very kind hearted and has his back. 👍 His only complaint is that the teachers are stinky 😂. Recommend sending your child here if you care most for good environment.",
      "time": 1729864378,
      "translated": false
    },
    {
      "author_name": "ea ea",
      "author_url": "https://www.google.com/maps/contrib/104387988969273242770/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVks5bNdFP1ot8QRAZO8M1lqvArBxPfoQTvrPyIw6_kyUcox5s=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "5 months ago",
      "text": "helo i am redoing the review cuz i left alot of stuff out :3 as a graudated student i wanna say some stuff,  first of all the reason why some students dont really do hw or follow with the class sometimes they just dont want to learn but the other times its because the teachers of that class makes them feel like not paying attention at all like imagine you had a family emergency and didnt manage to complete your homework and the next day when you have to hand in your homework, you try to explain why you couldnt complete it but the teacher doesnt allows you to and just scolds you on the spot, and even if you explain why, they will still scold you and im not saying most teachers are like this im saying only some are but these type of unreasonable teachers sometimes makes us dread going to their class. There is another type of teachers which are the ones that are too strict. Im not saying that being strict is bad for example like mdm koh as the discipline master she has to be strict but even she loosens up sometimes and another teacher, ms cheok, she gets along with the class and makes jokes and is pretty friendly but she disciplines students and and serves them the punishment/punishments they deserve when they get out of hand. what im trying to say is being strict is fine but the teachers need to be appropriately strict and not too strict if youre too strict it can impact the way you feel towards learning negatively but other than those teachers, i want to thank the teachers that have tried to help me and the ones  that helped me and succeded. bey bey (i forgot uncle simon but i lazy type more :3)",
      "time": 1733663197,
      "translated": false
    },
    {
      "author_name": "Ashton Tan",
      "author_url": "https://www.google.com/maps/contrib/101990158040213093221/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU7dwiIDs7LEm2NeM8pXRT0fBTzaXaZV6dY4iu3rAe040P0d1I=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I'm a greendale student that had graduated and greendale is really good sch but sometimes the tecahers scold u for your own good honestly with out mr sim scolding I wouldn't be where am I tdy ty for all the teachers that had supported me I'm hoping to come back gdps soon! I'm Ashton better rmbr me :)\nBtw I wan thank mdm hadfizah , Mr chean and Ms arifah and Mr wong\nMr wong best chinese teacher❤️❤️",
      "time": 1739433875,
      "translated": false
    },
    {
      "author_name": "Greta Mendoza",
      "author_url": "https://www.google.com/maps/contrib/111792023969568133629/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKtfmG7rRvBUqfQZ0ISC84F5CpbTmy7D-enrox6BuV5djMOkg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Very good school environment. Equipped with gardens, basketball court, oval track, big quadrangle, playgrounds etc. Open space Canteen has good ventilation and a lot of food choices.",
      "time": 1736121077,
      "translated": false
    },
    {
      "author_name": "Xrmelody",
      "author_url": "https://www.google.com/maps/contrib/108202199701377590321/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVS8Pmt_QyjMD70nHar8JdnwmKpd2deXgkwHa89qsq1JU1Wtdc=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "4 months ago",
      "text": "As a graduated student from Greendale  I want to say its not a good experience this means about the teacher and canteen experience the teacher I don't want to mention the name but the teacher is very mean to some person and very kind to some person my friend slept in the class during the game time its after psle alr about October 20plus her classmates is playing only she wants to sleep and the teacher is like talking bad about her and she is nice to the person that smoke and vape???how will the teacher do something like this??? And the canteen is so dirty! They ask the students to clean it? The bird shit is so disgusting how could we clean why dont ask the teacher to clean it? And there's also BULLY in school??? 别来了 真的别来了",
      "time": 1735719145,
      "translated": false
    }
  ],
  "types": [
    "primary_school",
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9508945564330695544",
  "user_ratings_total": 34,
  "vicinity": "50 Edgedale Plains, Singapore"
}