{
  "formatted_address": "407 Northshore Dr, #02-39/K5, Singapore 820407",
  "geometry": {
    "location": {
      "lat": 1.4162894,
      "lng": 103.9021364
    },
    "viewport": {
      "northeast": {
        "lat": 1.417563880291502,
        "lng": 103.9035557302915
      },
      "southwest": {
        "lat": 1.414865919708498,
        "lng": 103.9008577697085
      }
    }
  },
  "name": "Grove (Northshore Plaza I)",
  "place_id": "ChIJf1FtnvgV2jERgJp0XlLhZSE",
  "rating": 3.5,
  "reviews": [
    {
      "author_name": "Page Turner",
      "author_url": "https://www.google.com/maps/contrib/113293133719563777031/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJpIw0ai492RR-2Qcb1UIFATD7as9MCJTivg4nbZ3S16PA2LA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Decided to revisit the place after seeing positive reviews.\n\nTable and cutlery are clean.\n\nTruffle La Mian is so so delicious, generous ingredients with fresh vegetables and mushrooms!\nDim Sum are also equally tasty.\n\nStaff are very good people with friendly vibes. The tall gentleman takes his work seriously. The young lady with glasses is always cheerful and bubbly. The short hair, petite lady is very kind as well. 😊\n\nBlue Pea Nasi Lemak is really nice 👍\n\nAssam Fish with Rice and Bak Chor Mee Dry are my favourite dishes! Generous ingredients with fresh vegetables as always. 😋\n\nHainanese Curry Chicken Rice tastes like like the real deal! If you close your eyes, to chew, you would not believe it's vegetarian chicken. 😁\n\n这里的素食很好吃。😋🙏\n\nMee Tai Mak Laksa is simply delicious. Added one more egg to it.\n\nHainanese Pork Chop Rice is also wonderfully crafted. Also added one egg to the dish.\n\nKudos to both young ladies and the gentleman who put in great effort in customer and food preparation services.",
      "time": 1735215640,
      "translated": false
    },
    {
      "author_name": "Gabriel",
      "author_url": "https://www.google.com/maps/contrib/117387838809977391267/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUxUIqhWMBQgZmnuePRJ3GpjXGkjKP_5RI86sAWszpf99Tmp__P=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "5 months ago",
      "text": "Bak chor mee is rather delicious and flavourful. Truffle la mian could have been better if there was some mock meat added as the default is with zero mock meat. Service crew was polite and friendly. There is limited seats but the crowd is also not alot always so you should be fine even during peak hours.",
      "time": 1732457923,
      "translated": false
    },
    {
      "author_name": "Benjamin Park",
      "author_url": "https://www.google.com/maps/contrib/117599988314464672388/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWd_bOQRSxzK18__MqjIcDyIMRX7WqnWybHqQ5ZGg_XKsArH7NV=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Nice place for breakfast. Quiet and chill place with nice decor. The food is affordable and not bad tasting. You save about $2 for their Kaya toast set compared to fun toast. They have an interesting rainbow toast too.",
      "time": 1732413677,
      "translated": false
    },
    {
      "author_name": "Wie b l",
      "author_url": "https://www.google.com/maps/contrib/109201224600301983721/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWf-o_yzZrdrg4GhIOzdSIKtLnX3UJ8YKauMkWpmm8qPA8Bltkq=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "What a rare find! I was in the neighbourhood, saw the vegetarian food, walked in, and simply \"try my luck.\" And I was blown away! This is a great place for \"meatless compassionate eating!\" Most of all the taste is uncompromising! Go and try it!\nThe place is also near to the Punggol waterfront, so the air is good, very breezy, and best of all, it is not crowded--even on a Saturday night. There are crowd at certain times, but not crazy sardine pack crowd (hate it!)\nThe nasi kampung or nasi rendang is really good. The rice is fragant. The sambal is savoury and not too spicy. The rendang is full on flavours made of Monkeyhead Mushroom, not soy meat. So so so good!\nThe Bah Chor Mee is also very good. The noodle could be harder, but it is not soft. Blended with the paste with the mock minced meat, plus the wontons, it's really very satisfying.\nThe laksa has got good colours, quite spicy. I felt that they could do with lesser oil layers on top. But the colour is so vibrant. You may not get the real laksa taste, but seriously, it is not far behind. In fact, I prefer it. It's really good.\nThe rest were just \"Itchy Mouth\" just to try the Chee Cheong Fun and other stuff. They are up to par and real good value on the overall, a place you can get your \"regular food craving\" fixed.\nI would not say it is a Michelin Star restaurant, but it is certainly a great place to eat, have a chat and enjoy the food slowly. Well, eh ambience can be improved... no place is perfect anyway :)",
      "time": 1724064465,
      "translated": false
    },
    {
      "author_name": "T Vivian",
      "author_url": "https://www.google.com/maps/contrib/115489933675661260632/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJyx_SBbIel9iAzL9pyMgOpPuKZBQWChsXxX2n5esr9DnwiGg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "I visit this shop several times a week for breakfast and they remember the food and drinks I want every time. Although the previous team was excellent, the new little girls and weekend 大姐wearing the spec are also great. Their warm smiles make people feel very friendly every time. The food is also delicious and maintains the same standard. They are serious and work hard and improve. I think Grove is really lucky to have such a sincere and hard-working team again",
      "time": 1728180784,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2406577319787666048",
  "user_ratings_total": 153,
  "vicinity": "407 Northshore Drive, #02-39/K5"
}