{
  "formatted_address": "30 E Coast Rd, #03-06 Katong V, Singapore 428751",
  "geometry": {
    "location": {
      "lat": 1.3037984,
      "lng": 103.9029507
    },
    "viewport": {
      "northeast": {
        "lat": 1.305172430291502,
        "lng": 103.9043519302915
      },
      "southwest": {
        "lat": 1.302474469708498,
        "lng": 103.9016539697085
      }
    }
  },
  "name": "Growing Up Gifted (GUG) Preschool @ Katong",
  "place_id": "ChIJr-EwM-EZ2jERTKsreKF1QY4",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Sharon Goh",
      "author_url": "https://www.google.com/maps/contrib/105483377478438604466/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocICuZ8nO0SL1vSNCEdEA6Gdbx1PMhijmz07xC4j9tFq95aDiw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "GUG Preschool @ Katong has been an absolute blessing for our family! Sending my three kids there has been the best decision we've made. The teachers are incredibly welcoming and approachable, creating a warm and nurturing environment for the children. The variety of activities offered, from water play to yoga, cooking, and even robotics, ensuring that there's always something exciting happening. What's truly remarkable is how they've sparked my kids' interest in Chinese through engaging experiments, delightful songs, and captivating stories. It's truly an awesome place where learning knows no bounds!",
      "time": 1713313817,
      "translated": false
    },
    {
      "author_name": "Rick Hunter",
      "author_url": "https://www.google.com/maps/contrib/115788765277197707542/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIvwTQEz4kEYZpHyF9B5WUu6FCCwIlaCfujk3AecPoYcPUDVQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "This pre-school is the best choice in the East for your toddler if you value quality care, good teaching techniques, staff members that really care for the well being of your precious ones over branding and fancy marketing. I really appreciate the years of taking great care of my kid by the principal Evelyn and the entire team. Kudos and my strong endorsement.",
      "time": 1727753164,
      "translated": false
    },
    {
      "author_name": "houldy",
      "author_url": "https://www.google.com/maps/contrib/108731260934281171669/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVONzGUFDYff1gbcpGCMnBOtCOyJR6ra-tzG22KZfpU9ExF2J1F=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "We transferred Javier to GUG Katong from another childcare center at the start of his K2 year and he adapted very well to the new environment very quickly.\n\nMs Yvelyn’s, the in-charge, commitment to early education and her belief in influencing the correct values to young children gave us confidence that our child is in good hands. The center teachers are patient and encouraging. My child’s favorite teacher was张老师.\n\nMy boy made some close friends fairly quickly and loved the center so much that he balled his eyes out on his last day with the center in Dec 2023.\n\nThank you GUG for giving Javier a wonderful K2 year. 👍",
      "time": 1719976780,
      "translated": false
    },
    {
      "author_name": "C C",
      "author_url": "https://www.google.com/maps/contrib/111340476592304164178/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJHXzj84mU0gZy1_oDbWyXDrX-v6RSR2oqm4PzDDFsAgk1I=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My 1st preschool for my child and I must say that it's really a great time with the school. This is like a big family to my daughter and myself. Everyone is so closely knitted, teachers, principal, director and all staff are so loving, dedicated and caring.  My child used to be very shy and quiet, under the teacher's encouragement, she has opened up alot and is more expressive now.\nExcellent literacy and numeracy syllabus. The foundation in building their skills is excellent. She has no problem in coping with Primary 1 academically.\n\nBig thank you to Ms Zhang, Ms Yvelyn, 张老师，Teacher Siti, Teacher Mochi & all the staff in GUG. Thank you for making my child 's preschool journey a memorable one with many sweet memories to remember.",
      "time": 1713316727,
      "translated": false
    },
    {
      "author_name": "Ray Lim",
      "author_url": "https://www.google.com/maps/contrib/117269898982507683735/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKHdeUfdC3pR-cbb3UQykZ5f51tp6xht212iM7c6dMzAnoTfA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "If you are looking for a preschool in the katong/marine parade/mountbatten area, GUG Preschool Katong should be one of your choices. The principal and teachers there are nurturing and caring. The feedback given during parent meet teacher session is constructive and not just paying lip service. I thought the curriculum was very challenging but it will provide a basis for your child to enter primary school. One of the downsides of the school is that it is located indoors within a mall, hence they do not have an outdoor area for kids to play or explore. However, this is compensated by the periodic activities which the school organises and brings the students on excursions. My child enjoyed the dancing, singing, cooking and robotic classes which are conducted in school. They are not the cheapest in the area but definitely not ridiculously priced. My child thoroughly enjoyed the school experience.",
      "time": 1713308296,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10250603563238271820",
  "user_ratings_total": 15,
  "vicinity": "30 East Coast Road, #03-06 Katong V"
}