{
  "formatted_address": "565 MacPherson Rd, #04-00, Singapore 368234",
  "geometry": {
    "location": {
      "lat": 1.3329697,
      "lng": 103.8850015
    },
    "viewport": {
      "northeast": {
        "lat": 1.334188380291502,
        "lng": 103.8863797302915
      },
      "southwest": {
        "lat": 1.331490419708498,
        "lng": 103.8836817697085
      }
    }
  },
  "name": "GudSht - Alcohol Delivery Singapore",
  "place_id": "ChIJsdHI3-gZ2jERpJywqVIkwUc",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "MH Tham",
      "author_url": "https://www.google.com/maps/contrib/112376174358198242550/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXJ4tOLbvkkJYRe2LZw4PmTrCsbezMPVke50H01b6T0gSd095fp=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Do not be fooled by the funky name nor the coffeeshop-looking packaging that the food arrives in. The food is truly good sht as the name suggests.\n\nWanted to see how good the yakiniku beef cubes were as many were raving on the reviews of the food delivery app that I ordered from. Decided to order both the a la carte and the don buri for fun just to compare the size, and the conclusion is that you won’t go wrong with either options as the portions are well calculated and worth the price. The don buri’s portion for the beef cubes was less, but that is understandable given the addition nori rice and egg. The beef cubes were tender and juicy, but comes with the aroma of incredibly charred meat, likely from the sauce that accompanies it.\n\nTalking about the nori rice, it was actually edible (and great!) unlike many other donburis that try too hard to make their rice stand out, resulting in overly salted rice with strongly flavoured mains.\n\nThe nori rice is faintly nori with lightly salted flavour of bonito, but nothing overpowering to outcompete the beef cubes. Added the pork katsu for an affordable $4, and importantly, the oil used to fry the katsu was fresh and the pork was lean and clean.\n\nThe chicken chop was extremely well priced that I thought I was ordering from a coffeeshop western stall. I opted for the broccoli and nori rice. The broccoli was well salted and boiled. If I could, I would opt for double portions of broccoli next time! The chicken chop was lightly grilled, a little too light for my liking, but there is no denying the technique of the chef.\n\nOverall a genuinely surprise find and will order again really soon.",
      "time": 1740909535,
      "translated": false
    },
    {
      "author_name": "Charlotte",
      "author_url": "https://www.google.com/maps/contrib/102840564007812130797/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKgb4XgK2-37boERpfdZmDwbb2wkyOcFhQRS0bMO-O6yUzfSQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "The first thing that caught my attention at GudSht were the friendly staff (Noh, Stacia and Nika). The staffs on duties are polite, attentive and friendly.\n\nGudsht effuses warmth and hospitality as the ambience is really cosy and relaxing, a really nice place to chill with friends.\n\nThe waiting time for the food is considered relatively fast, portion is very generous, food is very presentable and tasty😋\n\nOverall, the experience here was wonderful and amazing. Definitely a hidden gem in town👍😃",
      "time": 1632322951,
      "translated": false
    },
    {
      "author_name": "Yvonne -",
      "author_url": "https://www.google.com/maps/contrib/106941582602346509993/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVV7jFhPKx_VhvDKV4Obu8Gw-JCafoX4mHOdBDCf7irg-uZwSL7fw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "3 years ago",
      "text": "Decided to try this place since the ratings seemed good and Cineleisure isn't too crowded these days.\n\nTheir food is good but they need to improve in being clear about their promotions and staff to be trained on ways they can handle service recovery.\n\nWe made a small order first while we waited for the full group to arrive to place our bigger order on the app since we will need to key in card details. The server told us we could use the app and didn't seem too happy about taking the manual order. But she told us in the beginning we could order both ways, through staff or on the app.\n\nThere was a table standee that showed a DBS card promo for 1-for-1 chicken wings, 10% off $100 spent and one more drink promo. We ordered 1 set of wings and definitely hit $100 spending and used the DBS card shown in the promo. However, after making the order, we asked the staff about the promo and she told us we can only order through the staff to redeem this and there was nothing they could do as our order through the app was final.\n\nThe offer was 1-for-1 chicken wings so if we already ordered 1 set, they could have manually made a note of this redemption and given us the other set of chicken wings.\n\nAs for the 10% off $100, believe it would have been possible to make a note of that and just issue a refund or deduct $10 off our bill.\n\nThere were no efforts to say that they would be making the promo instructions clearer despite our feedback or offering service recovery which WOULD HAVE BEEN GIVEN ANYWAY had we been advised to order through the staff for promos.\n\nThe food was good (ebi fry, wings, pork belly, yakiniku beef, skewers) except for the mala spam fries and rice portion could be bigger. In fact, we ordered more yakiniku beef because it was so tender. But the service we received unfortunately dampened the dining experience.\n\nDo still want to thank one of the male servers as he was courteous and jovial.\n\nI hope the owner or manager can make the promo instructions clearer and train their staff on service recovery methods rather than the response just being \"sorry, nothing we can do\".",
      "time": 1645858393,
      "translated": false
    },
    {
      "author_name": "Lois Yeo",
      "author_url": "https://www.google.com/maps/contrib/101458353884361743289/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWHiXhXSX2-EmjpkU7NwOhPZl34s93CHok3QwsUwWvLlE9LAc5o=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Some misunderstandings and miscommunications for my orders when I selected collect on site. Rectified within few hours and received my wines through delivery.",
      "time": 1736773520,
      "translated": false
    },
    {
      "author_name": "MrA",
      "author_url": "https://www.google.com/maps/contrib/112008289267740134602/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWmx3lceuKzr9IpyiazfaYGRIijre_2gIhIos5GD21NE_Q_2RUL=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "3 years ago",
      "text": "We dined in last Saturday evening and thoroughly enjoyed the food. It was a filling meal. The staff were helpful too.\n\nSafe distancing measures was observed and we were not seated close to other diners. I didn’t order alcohol as I need to be a responsible driver.",
      "time": 1633329661,
      "translated": false
    }
  ],
  "types": [
    "liquor_store",
    "meal_delivery",
    "meal_takeaway",
    "store",
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5170453784650882212",
  "user_ratings_total": 802,
  "vicinity": "565 MacPherson Road, #04-00"
}