{
  "formatted_address": "231 Bain Street, #03-09, Singapore 180231",
  "geometry": {
    "location": {
      "lat": 1.297152,
      "lng": 103.853617
    },
    "viewport": {
      "northeast": {
        "lat": 1.298536280291502,
        "lng": 103.8550591802915
      },
      "southwest": {
        "lat": 1.295838319708498,
        "lng": 103.8523612197085
      }
    }
  },
  "name": "Guitar Workshop",
  "place_id": "ChIJdaypH6UZ2jER5znHPvxgLCQ",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Valen Goh",
      "author_url": "https://www.google.com/maps/contrib/109951444373600208054/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLDZtpyl2dkkkE5XoiU7ZxfnF1jKJ68yESjP_HIq-KTRuQKvQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "Regarding Guitar Workshop Reply on the post of 1/5 review of \"Custom Hsienmo Guitar\"\n\n1. Initial Price & Adjustments: The original price was S$4,600. After Mr. Goh cancelled an option for a compound radius fretboard (valued at USD$300), the price was reduced and revised to S$4,100 nett.\n\n2. Dispute Over Signature Cost: Mr. Goh argued that the signature “VA” on the 15th fret, valued at USD$120, should be excluded from the cost. Guitar Workshop clarified that this was never included in the S$4,100 price.\n\nMr Valen: Guitar Workshop's claim of S$4100 nett DID included a signature inlay costing USD$120 or USD$150 (they changed rate suddenly?). Please see my attachment discussion with Mr Eng & Hsienmo China Bin Lin.\n\nFor Hsienmo China Sales Bin Lin was very clear throughout the order.\n\nFor Mr Eng's case, he was confused with my custom order, despite we went through several times in shop & phone message. Mr Eng quoted me USD$150, this review quoted USD$120? Mr Eng's confused note order, did not have my signature VA, it was only after his clarification with Hsienmo and my confirmed order, then he added in the VA signature in his notes. (see screenshots) Please get this clear rather than misleading other buyer's thoughts.\n\nFor buyers, please see my attached screenshot order already included VA signature, which was sent to Mr Eng, which they quoted me SGD$4100. After Mr Eng's confusion was cleared speaking to Hsienmo side, he said it will not be charged and it will be FOC, Hsienmo Bin Lin said the same as well.\nHowever, when I requested for a revised quotation, Mr Eng declined and insisted to charge the same rate?\n\n3. Discount Requests: Mr. Goh requested additional discounts, including offering to pay S$3,900 and asking for a free ebony veneer valued at USD$80. These requests were denied.\n\nMr Valen: I was offered a 5% discount from Mr Eng on another guitar. Regarding the free ebony black headstock plate USD$80 that was requested by me, since I was charged additional USD$150, as Mr Eng refused to remove it despite it was \"FOC\" (explained on above). I have no choice to opt for another lower valued upgrade to offset on my lost. I was again rejected, which seems like they are trying to keep their profit high for their end.\n\n4. Customer Review: Mr. Goh leave negative reviews, implying unethical practices. However, he contacted Hsienmo directly, indicating he was still interested in the custom guitar.\n\n5. Guitar Workshop statement on their policies.\n\nMr Valen: This negative review was based on unjustified costing, poor handling, multiple repeated orders yet Mr Eng still got it wrong.\n\nMy 3rd visit to your shop was for a confirmation & deposit payment. If I was deemed of asking for 'cheap' discount, why was I there?\n\nWhy was I rejected by Mr Eng when I wanted to make a deposit? Mr Eng told me to visit next time? So he can reconfirm again on his own comfort time? How is this good service? My custom works was not complex to begin with as well.\n\nOn Hsienmo China Sales Bin Lin: He did a clear run through with me on phone. Shortly, he provided a proper order listed out 100% to my needs. That was when I got the final order from him and passed it to Mr Eng, before this whole incident and my 3rd visit to Guitar Workshop.\n\nAfter incident, Hsienmo Bin Lin have also acknowledged that Mr Eng was confused with the charging policy as well. For buyers, you may see the screenshot for yourself, if you are ever patronizing with them.\n\nOn Guitar Workshop: Mr Eng's order specifications were not accurate, yet Mr Eng insisted to pushed for a confirmation on his list with me, which you may find screenshots of us, disputing on the confirmation.\n\nMy Work Requirement: A same copy of Hsienmo OM45JM, which have alteration of a slimmer neck, change of bindings, added signature, natural finish, matte finish. How hard is that which took them many attempts and wrong orders? As well as wrong charges?\n\nOverall: Sloppy work? Experienced? Additional charges? I speak with transparency based on what I shared here, rather than plain words. Judge for yourself guys.",
      "time": 1734765723,
      "translated": false
    },
    {
      "author_name": "Anna",
      "author_url": "https://www.google.com/maps/contrib/102355404568952512184/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWnc_0SIgbCrh7dDFWs33ydng9ysqfVbHYufZX8U_-cqCEeeoJL=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Amazing service! Brought my guitar for an electrical issue and it was isolated and fixed on the spot! Amazing experience, friendly staff :)\nAlso kind and friendly intern, knowledgeable and helpful.\nThank you so much!!!",
      "time": 1729160978,
      "translated": false
    },
    {
      "author_name": "MusiCliques",
      "author_url": "https://www.google.com/maps/contrib/107146767162821316063/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVvSkx9uLbJhC2man3IgQ55g7qVhHBFIQIF7KAGcJghQ7PdbRwR=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "I have tried to customize a Hsienmo with Mr Eng recently. I was quoted at a rate of $4100 with some additional customization works involved.\n\nAfter some revisions and confirmation with both Hsienmo Sales in charge from China & Mr Eng of Guitar Works Shop, we understood that some works are not chargeable to the bill.\n\nTo my surprise, Guitar Works Shop insisted to charge the same amount of $4100 to me without reduction, despite a USD$150 of work was not chargeable and everyone were awared of this as well.\n\nThere were also a discrepancy in reduction of cost for a cancelled work that cost USD$300. Guitarwork Shop's quotation  was only a partial reduction of only SGD$230, instead of SGD$300+ after conversion rate. Do note that these charges does not affect weight or shipping cost as well.\n\nI decided not to proceed with their costing due to unfair practice and poor transparency.\n\nOn Mr Eng compassion and knowledge of guitar, it's pretty good. However, please buy with caution in terms of their pricing policy and transparency.",
      "time": 1734173726,
      "translated": false
    },
    {
      "author_name": "Erazero EZ",
      "author_url": "https://www.google.com/maps/contrib/109444386616561976350/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWFbBb-wAXXNlmp1RuA_4lL6cK7GOxLLpQgYYTV17IdNyip2ZLH=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Very good seller. They send me a Bass to Italy. High professionality , good communication and safety shipping.",
      "time": 1741596451,
      "translated": false
    },
    {
      "author_name": "nir l10",
      "author_url": "https://www.google.com/maps/contrib/114217853479805661518/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLghpX8mG16xE1EObyqdKe07yDKNY11shpQVasCc-yuWL2mtQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "One of the best I’ve seen they have really good collection and very friendly stuff",
      "time": 1746870460,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2606564920841943527",
  "user_ratings_total": 62,
  "vicinity": "231 Bain Street, #03-09"
}