{
  "formatted_address": "36 Purvis St, #01-03, Singapore 188613",
  "geometry": {
    "location": {
      "lat": 1.2966208,
      "lng": 103.8549145
    },
    "viewport": {
      "northeast": {
        "lat": 1.298005180291502,
        "lng": 103.8562916802915
      },
      "southwest": {
        "lat": 1.295307219708498,
        "lng": 103.8535937197085
      }
    }
  },
  "name": "Gunther's",
  "place_id": "ChIJ0Wkqc6UZ2jERmam6mzVinfg",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "chefquak",
      "author_url": "https://www.google.com/maps/contrib/105281945272229886067/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXuMlw9lnGYDnyma8_MBo893j_L4CmrGdDrDVNQyAY7n9uINDWi=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "friend bought 3pax lunch\n\n@ Gunther\n\nS$48 restaurant week menu\n\nbaguette was good 👍\n\nsmoked salmon with asparagus was good, salmon very lightly smoked, in-house\n\nscallops on shell was big and plump, nicely done\n\npork shoulder quite tasty, texture not the best some tough bits. the shell pasta was good 👍\n\nseems they ran out of prawns for YS, asked to replace with crab meat. pretty good dish\n\nfor dessert I selected cheese platter,  pretty standard\n\ngreat lunch and wonderful dinner with friends\n\n17.4.2025",
      "time": 1744888749,
      "translated": false
    },
    {
      "author_name": "Aubree Ophelia",
      "author_url": "https://www.google.com/maps/contrib/112155242259007570287/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJgNa44aVa8Qtzjcdex-4cGS1fcBUcDNRauB00N1B4wX8xK_A=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "We recently visited Gunther’s on a weekday evening for dinner, and we really loved the food. The ambience, service and quality of food made the entire dining experience enjoyable.\n\nFirst, we were welcomed with warm bread and butter - simple yet so delicious we asked for more! The cold truffle pasta with caviar and king crab leg with tomato rice were eye opening for both us and our tastebuds, highly recommended!\n\nDesserts also did not disappoint and our tummies were extremely pleased when we left. We’ll be back!",
      "time": 1730822533,
      "translated": false
    },
    {
      "author_name": "Kendra Chan",
      "author_url": "https://www.google.com/maps/contrib/117610388462273813487/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLdWligZBfOOpaIeaP43KLpvIWW5pBZlUg3e2Vj4D8Ci-v7Zw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Nice cozy, intimate setting. Staff were really attentive and friendly. They did a great job explaining each dish.\nFood was brilliant. Loved everything in their set menu - freshly toasted bread, artichoke, pasta, pork jowl and dessert. Definitely would come back again",
      "time": 1731256340,
      "translated": false
    },
    {
      "author_name": "Ally L",
      "author_url": "https://www.google.com/maps/contrib/101143257946324941176/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKYM64rh9hq5tuXZzBwMvf0LuGHRpCBYSMur2G1UxhjbGrZFg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "The atmosphere was absolutely beautiful, complemented by mouth-watering food and an incredibly kind and polite service crew. They went out of their way to accommodate my preferences, and the chef did an outstanding job catering to my picky taste buds.\n\nThe only downside was a large birthday party in the event space, which slightly disrupted the ambiance. However, overall, it was a wonderful dining experience.",
      "time": 1732883809,
      "translated": false
    },
    {
      "author_name": "John wu",
      "author_url": "https://www.google.com/maps/contrib/117791455472776711781/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKCOc168QZstLsyo7PSXLfBNYft2IQKUUftaI-cTfjr4z4N-w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "**5/5 Stars - A Culinary Haven at Gunther's Restaurant, Singapore!**\n\nGunther's Restaurant in Singapore has become a cherished dining destination for my friend and me, and for good reason. We make it a point to visit **twice a month**, and every time, the experience is nothing short of extraordinary. From the elegant ambiance to the impeccable service, Gunther's consistently delivers a world-class dining experience. But the real reason we keep coming back? Their **cold pasta**—it’s simply the **best we’ve ever had**.\n\nThe cold pasta at Gunther's is a masterpiece. The pasta is perfectly al dente, tossed in a light yet incredibly flavorful sauce that strikes the ideal balance between richness and freshness. Every bite is a revelation, and it’s no exaggeration to say we dream about this dish between visits. It’s the kind of dish that keeps you coming back for more, and it’s the highlight of every meal we have here.\n\nBeyond the cold pasta, the entire menu is a testament to the chef’s creativity and dedication to quality. Each dish is crafted with precision, showcasing bold flavors and artful presentation. Whether it’s the appetizers, mains, or desserts, everything is executed to perfection.\n\nThe service at Gunther's is another standout feature. The staff is warm, attentive, and always goes above and beyond to make us feel welcome. They remember our preferences and are happy to offer recommendations, adding a personal touch to every visit.\n\nThe restaurant’s ambiance is sophisticated yet inviting, making it the perfect spot for a relaxed dinner with friends or a special celebration. The attention to detail in the decor and the overall atmosphere enhances the dining experience, making every visit feel special.\n\nIn short, Gunther's Restaurant is a true gem in Singapore’s culinary scene. It’s no wonder my friend and I keep returning twice a month—it’s more than just a meal; it’s an experience we look forward to every time. If you haven’t been yet, do yourself a favor and book a table. And don’t forget to try the cold pasta—it’s life-changing! We can’t wait for our next visit!",
      "time": 1741522433,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17914582875135191449",
  "user_ratings_total": 348,
  "vicinity": "36 Purvis Street, #01-03"
}