{
  "formatted_address": "83 Punggol Central, B2-05 Waterway Point West Wing, Singapore 828761",
  "geometry": {
    "location": {
      "lat": 1.4067567,
      "lng": 103.9024751
    },
    "viewport": {
      "northeast": {
        "lat": 1.408528230291502,
        "lng": 103.9033713302915
      },
      "southwest": {
        "lat": 1.405830269708498,
        "lng": 103.9006733697085
      }
    }
  },
  "name": "Guzman y Gomez (Waterway Point)",
  "place_id": "ChIJXWxNbI0V2jERMY4L0hJ0UHc",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Broy Lim",
      "author_url": "https://www.google.com/maps/contrib/113516586658605532370/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXcWsEGWfHxHKb7-gCgqW2PnLlk9YLYUKOG4gyr1dBTidSG-Ue6=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "If I don’t know what to eat, I default to Guzman because you can’t go wrong with the nachos. Staff were really sweet today, handing out balloons and coloring sets to little kids. I’m happy with my food - I don’t need coloring kits because I’m not a kid. 🙃",
      "time": 1746268519,
      "translated": false
    },
    {
      "author_name": "A Teo",
      "author_url": "https://www.google.com/maps/contrib/107977114284811873594/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLVQiTGnn0SoPS06Mibyqnc7mld4zvNWadcZdk0rFzZj9jB_w=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "The food is good. However, the service standards of this outlet is horrendous. The first occasion - I wanted to redeem my Fraser’s mall voucher on my Guzman order but I was told I couldn’t use it, that they had not accepted this payment mode before. Subsequently, on another visit, I tried to use the voucher again and another staff let me redeem the voucher without any issue. But this also led to the second encounter - I ordered takeaway for their burrito bowl, and the quantity of the chicken topping given was close to none (refer to pic). I wrote in to the customer service team and was given a $10 voucher. However, when I accidentally pressed on redeeming the voucher 30 mins before I arrived at the store, I was told I could no longer use the voucher when I reached the outlet. The staff said it was invalid. Subsequently feedbacked to them again however no response given. Fair enough, this was my own error. On the third occasion, I dined in there. It was 8.30pm and they had ran out of guacamole - we added on guacamole for one of our orders. However, as we ordered using the table QR code, we didn’t know that they had ran out of guacamole until our order was served to us half an hour after ordering. The waiting time was understandable as it seemed like there were a lot of orders. But the unacceptable thing is that the staff did not even offer any solution on refunding us the amount we paid for the add-on. They just told us it’s impossible to do a refund as we placed orders using the table QR code. It was only after we chased the staff to ask for a solution did they give us some extra chicken as compensation. Unfortunately, I did not manage to take any photos of this visit as I was too exasperated by these events. The way they operate their business do not come across to me as being honest and sincere and I would not head back again even if the food is good.",
      "time": 1740484605,
      "translated": false
    },
    {
      "author_name": "lihsia Luke",
      "author_url": "https://www.google.com/maps/contrib/108916131187365365172/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW1ep_CIlm49mxBLBbfX3kd3OTkw-x9tw9ZpQhrA_IXOO42Gcnn=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "The food is always fresh especially their guacamole and it taste exactly as expected. Thank you Uncle Justin and lovely, patient lady at the counter who served me today. We normally order GYG on Foodpanda and it never disappoint us.",
      "time": 1746792019,
      "translated": false
    },
    {
      "author_name": "Sh",
      "author_url": "https://www.google.com/maps/contrib/100660602924526319784/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIs0L6gp9YN6hSrRmOS3YmuX_GIqaOVAE-BlglLUMuTeJjFSrI=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "2 weeks ago",
      "text": "I ordered cappuccino today,  it took them more than half an hour to make it. In the end they have given me only black coffee, i realized after i reached home. Pathetic really",
      "time": 1746161909,
      "translated": false
    },
    {
      "author_name": "shasha",
      "author_url": "https://www.google.com/maps/contrib/115807844756667489875/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWRRjhMrSqA_CxgsMbf61EZnkitQBpzl965XgPKtt3FXP7gAYa_=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Honestly speaking, I think I enjoy the breakfast burritos more than the regular burritos, chorizo breakfast burrito was great!\n\nIt took quite a while to get prepared but tasted really good, would recommend a try. Also, spicy isn’t rly that spicy imo.",
      "time": 1740492160,
      "translated": false
    }
  ],
  "types": [
    "meal_delivery",
    "meal_takeaway",
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8597499312832482865",
  "user_ratings_total": 2787,
  "vicinity": "83 Punggol Central, B2-05 Waterway Point West Wing"
}