{
  "formatted_address": "30 Raffles Pl, #B1-29, Singapore 048622",
  "geometry": {
    "location": {
      "lat": 1.2841089,
      "lng": 103.852015
    },
    "viewport": {
      "northeast": {
        "lat": 1.285748430291502,
        "lng": 103.8535697802915
      },
      "southwest": {
        "lat": 1.283050469708498,
        "lng": 103.8508718197085
      }
    }
  },
  "name": "GYOZA-SAN CIMB Plaza",
  "place_id": "ChIJxwH-OjAZ2jERw8tyeZ_nkPc",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Xling Tang",
      "author_url": "https://www.google.com/maps/contrib/103954248798037993511/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKyOVLvd8KRrIM9zF2A6WI3nRiOf0xxdLfkl2jGRuR3_yFgrA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Since I’m in the CBD area, I decided to try Gyoza San, SG 1st HALAL Gyoza Specialty Shop. Their menu is specially curated for locals, packed with international flavors in those little pouches.\n\nI ordered their new menu item, the Mala Gyoza, which features a secret blend of mala spices, chicken, and corn kernels. If you love spicy and mala flavors, you must try this. They’re HIGHLY ADDICTIVE! I also had the Chilli Crab Bento, which comes with an onsen egg, pickled daikon, rice drizzled with chili crab sauce, and 3 original Gyoza San gyozas filled with chicken.\n\nIf you’re craving something special for lunch or are in the area, give them a try! They have exciting promotions, a variety of gyoza flavors, bento sets, special sides, and more",
      "time": 1728493448,
      "translated": false
    },
    {
      "author_name": "Charm Touches",
      "author_url": "https://www.google.com/maps/contrib/118280954043686357764/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIV7cr4j5uih613wXKeIW3ujVcubTBcWL7LCAoB58_mJkbH6vo=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I recently dined at Gyoza-San and was blown away by the flavors! The Mala Gyoza is a must-try; it's packed with a spicy kick and bursting with savory goodness. If you're looking for something different, the Unagi Flavor is equally fantastic—perfectly grilled and deliciously rich! It's great to see that they are now halal certified, making it even more accessible. I highly recommend visiting Gyoza-San for a memorable meal!",
      "time": 1735910528,
      "translated": false
    },
    {
      "author_name": "Melissa",
      "author_url": "https://www.google.com/maps/contrib/112955490821308463771/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIzCI7KkA01B4YKycSq1tEoAAq6zZzSXfunRIrok0PsdpzDiA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Another lunchtime food option for those working in the CBD/Raffles place area! Check out this gyoza and bento speciality shop. They are now Halal-certified!\n\nWe ordered:\n⭐️Chicken Tsukune Gyoza Bento\nWe were not expecting the chicken balls to be this massive.. and there were 5 of them! This bento also includes 3 pcs of chicken gyoza and fluffy Japanese rice. The chicken balls were so juicy and flavourful! And the gyoza were pan-fried and served with a zesty dipping sauce. The tangy kimchi as a side balances out the whole meal 🥰Highly recommend you to try this bento! DAMN SHIOKK!!\n\n⭐️Unagi Chicken Gyoza\nThis is the first time I came across this pairing! Was wondering how it tasted.. and it actually blew my mind!! This pairing SLAPS!! A perfect balance of savory and sweet goodness. It’s a Gyoza Heaven\n❗️Attention all mala lovers, they just launched their mala gyoza! I heard that it’s highly addictive 😋🥟",
      "time": 1730301201,
      "translated": false
    },
    {
      "author_name": "Charmaine Lee",
      "author_url": "https://www.google.com/maps/contrib/115181292951450757753/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJbaRXmOGp652RzLTwzxSWYEoXthpgkVjLMB1daER0vZAp0zw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "I really enjoyed their new flavor Mala Gyoza that is fiery and bold, delivering the numbing and spicy kick typical of Sichuan cuisine. The new Chilli Crab Bento is a fusion delight too. The rich and savory chilli crab sauce pairs perfectly with the crispy, juicy gyoza, giving each bite a satisfying mix of flavors and textures. The sauce is mildly spicy with a hint of sweetness, making it enjoyable without overpowering the dish.\n\nWhether you're in for a casual meal or a quick bento, Gyoza-San delivers satisfying and tasty options that stand out in the dumpling scene. Price is really reasonable in CBD area, will be back for more! Value for money!",
      "time": 1729480504,
      "translated": false
    },
    {
      "author_name": "Rennie Lee",
      "author_url": "https://www.google.com/maps/contrib/104896149882118051128/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWlI9ttj92m3GJKTZ-eyIJbVH2ebrFhZEfbM4MRxj7R0ET5_Hjv=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "Addictive international flavors in a little pouch~ They make really interesting flavors such as kimchi 🥬, tomyum 🌶️, chili crab 🦀 and more!\n\nWhat did I try?\n🥟 MALA gyoza - One look at the menu and I knew I had to try out their new MALA flavor, which didn’t disappoint! It really has all that mala fragrance inside a small dumpling. Super addictive but kinda spicy too!\n🍱 Yakiniku bento - Comes with 3 original gyozas, generous serving of beef and some kimchi on the side. A well balanced meal~",
      "time": 1710394149,
      "translated": false
    }
  ],
  "types": [
    "meal_takeaway",
    "restaurant",
    "store",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17839012796137917379",
  "user_ratings_total": 69,
  "vicinity": "30 Raffles Place, #B1-29"
}