{
  "formatted_address": "238 Thomson Rd, #02 - 46, Singapore 307683",
  "geometry": {
    "location": {
      "lat": 1.32009,
      "lng": 103.8437568
    },
    "viewport": {
      "northeast": {
        "lat": 1.321304230291502,
        "lng": 103.8449384302915
      },
      "southwest": {
        "lat": 1.318606269708498,
        "lng": 103.8422404697085
      }
    }
  },
  "name": "Gyu-Kaku Japanese BBQ",
  "place_id": "ChIJ05kCbucZ2jER_jJKT0FxoIk",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Jing Jie Ng",
      "author_url": "https://www.google.com/maps/contrib/108318175307818512445/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWvicgmjgnkKAsagaLqVfdn9oHTkp1epUtWkFvRkp2Y495peESS=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "3 weeks ago",
      "text": "Food is average for the buffet but pretty decent spread available ranging from dips, appetisers, proteins (seafood, beef, pork & chicken) to ice cream/green tea.\n\nHowever, the service here is excellent. Staff were friendly & helpful, always ensuring we had our water/tea topped up and clearing the empty plates.\n\nKids below 90cm dine free & under 12yo is about half the adult pricing for the buffet which is pretty good value.",
      "time": 1745679807,
      "translated": false
    },
    {
      "author_name": "Chang Ah",
      "author_url": "https://www.google.com/maps/contrib/115847618993544216611/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXnslF6IZeRUnZOq-n3MS2s-eyNnHkT0BDQFGwIvklJnAQIldOT=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Had a dinner gathering with my friends and we went for midtier buffet which is $49++ per person and it did not disappoint.\n\nThe quality of the meat is very good for the price and the truffle egg dipping sauce is superb.\n\nAll the service staffs were very nice, polite and attentive. They constantly checked on our table and changed our bbq net when it was needed. Thumbs up to them.",
      "time": 1744563467,
      "translated": false
    },
    {
      "author_name": "Kenny Chiang",
      "author_url": "https://www.google.com/maps/contrib/111351019886580220485/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJuELnTfZe6BTv18QunftqGnQ2VLiSMHNex_tUZRgvaWId7Lw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Super value for money yakiniku. The meat quality is above average. The star of the show is the truffle egg for dipping the cooked meat. It is amazing and elevates the dish to the next level.",
      "time": 1744450471,
      "translated": false
    },
    {
      "author_name": "Koh Shu Yong",
      "author_url": "https://www.google.com/maps/contrib/116024796060846035567/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVubMyO_220gbSLeNcFQUZgqlQz1WEQge18KBIti4IbAYh_R8KV=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "2 months ago",
      "text": "Has always been a patron at gyu-kaku Novena Square. Recently, for the past two weeks understand they had changed their menu and business model. Last week, we had our dinner at Vivo-city and this week at Novena Square. For it come to my attention that I was very disappointed with the new menu. Basically my family and I had tried all their food of the old menu. This new menu on their products was really really disappointing after trying out two consecutive weeks. The cuts of their beef was poor on quality especially on the tongues and karubi. The thick tongues shall be label as thin tongue which was in comparative to the previous. There was totally no favour and the chewiness. The cuts on the karubi was off and had to order gyu-kaku karubi cuts to have the better favour and chewiness of the beef. Worst of all, the highball nikka, save on the lemon slices ??? Come on !!\nThank goodness on the service because of the old crews! Otherwise I will really consider of coming again ! Even if have a lot of new staff, do educate on proper service ethics !",
      "time": 1742033548,
      "translated": false
    },
    {
      "author_name": "Isaac Sam",
      "author_url": "https://www.google.com/maps/contrib/108426703400532001032/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUW-13Wh8cKYmW9wqhB8JlLi0QuC1DVXDaFHN2kPvjkIM_rCN3f=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "I recently had the pleasure of dining at this fantastic Japanese BBQ restaurant, and I must say, it was an experience worth every dollar! The restaurant offers a 90-minute Wagyu beef buffet that truly stands out. The quality of the beef was top-notch, with melt-in-your-mouth slices of Wagyu that were well-marbled and tender. Each piece had that perfect balance of richness and flavor that you would expect from premium beef.\n\nWhat really impressed me was the value for money. For a reasonable price, you get to enjoy unlimited servings of delicious Wagyu, cooked right at your table with quality Binchotan. The buffet also includes a variety of other options like chicken, pork, seafood, and fresh vegetables, ensuring that there’s something for everyone. The side dishes and dipping sauces complement the meats beautifully, adding to the overall dining experience.\n\nThe service was quick and friendly, with staff always ready to assist without being intrusive. The cozy ambiance and the sizzling sound of meat on the grill created the perfect atmosphere for a relaxed meal with friends and family.\n\nIf you’re a Wagyu lover looking for a great yakiniku experience without breaking the bank, this is the place to go. Highly recommended for its great quality and attentive service.",
      "time": 1728531678,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9917050904786907902",
  "user_ratings_total": 450,
  "vicinity": "238 Thomson Road, #02 - 46"
}