{
  "formatted_address": "205 Hougang St 21, #02-02, Singapore 530205",
  "geometry": {
    "location": {
      "lat": 1.3594593,
      "lng": 103.8852308
    },
    "viewport": {
      "northeast": {
        "lat": 1.360686780291502,
        "lng": 103.8865613302915
      },
      "southwest": {
        "lat": 1.357988819708498,
        "lng": 103.8838633697085
      }
    }
  },
  "name": "Hansik Korean Restaurant (Heartland Mall Kovan)",
  "place_id": "ChIJud-5-bMX2jERCRlnRjTzaUk",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "Doreen Luah",
      "author_url": "https://www.google.com/maps/contrib/115013917741354521755/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUKV1oarNLOV0T_6aFPZ-C0AhWTKURP8X7HYt5IcLMuB23QAz5l5w=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My favourite Korean restaurant in the Northeast region of Singapore serving the nicest authentic Korean comfort food. Their restaurant is always fully packed during lunch or dinner. They recently have set meals menu on weekend too. Please avoid their break time from 3-5pm, last order at 2.30pm.\n\nIt’s a hot day today therefore I craved for cold buckwheat noodles soup.\n\nMy hubby and I had cold buckwheat noodles soup with beef and my girls had Kimchi Ramyeon Soup Set and Jjajiangmyeon Set that includes a drink and a side.\n\nVerdict: 👍🏻👍🏻👍🏻👍🏻\nComments: Everything was so good that we finished all the food fast. Their bonchon was homemade with love. Their barley drink was refreshing. ☺️",
      "time": 1712543029,
      "translated": false
    },
    {
      "author_name": "David Tsai",
      "author_url": "https://www.google.com/maps/contrib/110639038054616025575/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUq4eANGY4WmkFnwhY9rzS6jiu2aL2OjHMFsrOT1zfJAgBF-Thn5Q=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Our usual hangout would be Teochew porridge nearby on PH, decided to drive here n park nearby. We are early diners and also we love love Korean food, honestly the food here is amazing and the sets we tried were really reasonable, and service great too. Will definitely come back soon. The free side dishes are refillable, n generous too. The kimchi is the star here, goes well with steamed rice.",
      "time": 1711839806,
      "translated": false
    },
    {
      "author_name": "Sha M",
      "author_url": "https://www.google.com/maps/contrib/109951020749464689457/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLzAS5fGFRUueP4d1FRhr19dBMbQPAKVwZ_e8h8lcIxvev0xMi-=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "If you're looking for Korean food around the area, this would be a great place to get your authentic Korean fix. It's always crowded during dinner time, so try to come before 6pm. Been coming here a few times already & the food never disappoints. Their menu has changed recently & they now have set meals which look interesting.",
      "time": 1711275258,
      "translated": false
    },
    {
      "author_name": "SS",
      "author_url": "https://www.google.com/maps/contrib/106006553023288414360/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKBAbgbNAiWApS9ltxw-IDP2Qa5DRvFA3_W-bxOpb8_qzB_4Q=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "11 months ago",
      "text": "Horrible experience, saddest Korean meal we had! Really a scam👎\nWent there for the first time with my family of three. Photos of food displayed outside the restaurant look nice and price seems reasonable.\nThe Kimchi Stew set we ordered comes with 2dumplings. The Kimchi Stew was served with the rice first, then the dumplings came 20mins later. Portions of ALL THE FOOD we ordered were surprisingly small, like “kids-meal” size. All the food weren’t served together, we have long-waits in between servings. Waiters avoided eye contact with us as the restaurant was quite full during dinner time. Barley Tea tasted like they’ve been diluted 10 times! Overall an extremely bad experience! Food portion is pathetically small and is very pricey! Service is slow and bad and most importantly, food taste horrible & not authentic.\nWe left the restaurant feeling unhappy and hungry still :( Would not go back & definitely won’t recommend.",
      "time": 1717506307,
      "translated": false
    },
    {
      "author_name": "Rachel Chua",
      "author_url": "https://www.google.com/maps/contrib/114281194157296907385/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW43zDlSpKLGgEcWdcWKYCnhnIfEuNGNaQuDDKEx83bcvbH3LMWxw=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "11 months ago",
      "text": "I havent been to Hansik many times, with each visit a few years apart. But I have craved for the food many times.\n\nPrice is pretty pricey, increasing significantly over the years so each visit shocks me when I look at the menu.\n\nFood quality probably hasn't been the same, with it dropping amidst the increasing costs. However, it is still the home-liest Korean food, hence my occasional cravings. Not sure if they cut down on the variety of side dishes but I wasn't allowed to request for other sides.\n\nService-wise, nothing to wow about. Staff weren't smiley or cheerful, just a typical work-day for them I suppose. Not a place to expect top notch service. But they do serve the correct food and that's good enough.\n\nOverall, it's not the best place for daily meals, but it's great if you want homely Korean food.",
      "time": 1718716359,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5290026643168368905",
  "user_ratings_total": 479,
  "vicinity": "205 Hougang Street 21, #02-02"
}