{
  "formatted_address": "B1-31/32 Hillion Mall, Singapore 678278",
  "geometry": {
    "location": {
      "lat": 1.3785144,
      "lng": 103.7630196
    },
    "viewport": {
      "northeast": {
        "lat": 1.379932880291502,
        "lng": 103.7643414802915
      },
      "southwest": {
        "lat": 1.377234919708498,
        "lng": 103.7616435197085
      }
    }
  },
  "name": "HarriAnns Nonya Table",
  "place_id": "ChIJNxdwCwAR2jERGN3TykJ7W4Q",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Yan Seng Lim",
      "author_url": "https://www.google.com/maps/contrib/101146777084408979277/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWpNqD4An9nptYw6OTJG6o0lPDnrqMyidfpxzuOJxI-9_urHgSdfA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "Authentic peranakan flavour kuih, food specially the spicy sambal! Ordered a new dish, Nonya Laksa Noodle today. But, the noddle was dried & hard to chew. Fedback to Jason Tan & he immediately replaced with another new bowl. Excellent service & serving only the best dishes. Can’t wait to return to try out every other dishes & kuih again!",
      "time": 1745321733,
      "translated": false
    },
    {
      "author_name": "Tiramisooo Tiramisooo",
      "author_url": "https://www.google.com/maps/contrib/104090530719466208807/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWB_OrhGOGZjQ7HzXz48_FtIVlOXr_Qbb1LuDRV9ygEU-eKv5M4=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "a week ago",
      "text": "The kueh kueh is the star. 🌟\n\nFirst visit to HarriAnns Nonya Table and as a fan of Peranakan food, I’d call it a kind of fast food joint for a quick Peranakan meal.\n\nThe Nonya Laksa came in rich, lemak gravy and was pretty satisfying. But what really stole the spotlight were the Onde Onde cake and those colorful  kueh kuehs that were bursting with flavour.\n\nThe standout dish for me was definitely the steamed Otah. It was fresh, very tasty and totally worth the $7.50 price tag.\n\nJust a note that the staff could be more polite. When I approached a young staff for some hot water for my teh, he had that impatient tone and asked me “What do you want??” Gosh, I’m sure we can be more gracious and polite especially to the customers who bother to patronise your establishment.\n\n#tiramisoooo #tramisoooojiaks #jiakjiakjiak #harrianns #hillionmall #peranakanfood",
      "time": 1746947059,
      "translated": false
    },
    {
      "author_name": "Chon Chat Tock",
      "author_url": "https://www.google.com/maps/contrib/106234929147623490389/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJK2sbV2rxS7AFyJBm34LeDPONg_2qoTg8QvjwcqOro8lFmLw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "HarryAnns had been my usual go to place when I am craving for laksa and Nonya snacks, and they never fail to disappoint. Need to to my work place at Bugis Junction but now with the branch at Hillion Mall, it is super convenient.\n\nLaksa and Nonya snacks were still top notch, with fresh ingredients from my taste buds. As have not had HarryAnns for quite some time, I have forgotten their yam cake comes with a drink, although I had specified to the order taker I wanted a yam cake, not yam cake set. Then I ordered 2 drinks but she kept repeating I have 3. I told her I only need a large tea and small yuan yang, but she kept insisting I have 2 teas and 1 yuan yang. Luckily the more senior staff knew what we wanted and told her to key in the yam cake as ala carte.\n\nI suppose listening and understanding what the customer want is important, not assuming. Overall still good experience and food quality.",
      "time": 1746946762,
      "translated": false
    },
    {
      "author_name": "edtayjb",
      "author_url": "https://www.google.com/maps/contrib/107467079327459015215/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJnxyZ0BYtgLZ6p7QJ-kzeM77_I23A7aVM-YXaEyCzSWBv6Fg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "2 weeks ago",
      "text": "My second time here. I started off with a Grandma Glutinous Rice and ended my brunch with a Nonya Laksa Noodles. The former was nice, but I could have done with more chilli paste. The latter was good, but I could have done with some raw cockles. That said the counter service here was very patient and helpful.",
      "time": 1746075629,
      "translated": false
    },
    {
      "author_name": "Winston C",
      "author_url": "https://www.google.com/maps/contrib/117811413595030544234/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWredilit3QVCOzV59feizspJ5Iltfg8ISJtnNiWls8YW-90X7DXA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Good to find this HarisAnns outlet at Hillion Mall. It's small compared to their outlet at Suntec. The tables are for small group of between 2 - 4 seats. I think bigger groups may have a issue finding seats.\nFood is consistent probably all of it comes from their Central Kitchen - just guessing. Food standard is pretty high for casual perankan food. Do note, most of their food are priced as a set (main meal + drink) so I paid $11.95 for a bowl of laska + coffee.\nI see quite a number of their customer drinking coffee and eating their kuehs. Anyway their ondeh ondeh is 👍👍.\nI gave 2 star for service because their model is order your food at the cashier, pay $$, and wait for your food to be ready, called by your queue number - looks like what U will experience at Macdonald! 🤣🤣 At least at Suntec outlet, they have staff to clear the table, here we bring the plates to a collection point.\nI always like HarisAnn food so will be back!",
      "time": 1737819484,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9537352162688097560",
  "user_ratings_total": 40,
  "vicinity": "B1-31/32 Hillion Mall, Singapore"
}