{
  "formatted_address": "80 Siloso Road, Southside Blk, #01-03 B, Singapore 098969",
  "geometry": {
    "location": {
      "lat": 1.258124,
      "lng": 103.811537
    },
    "viewport": {
      "northeast": {
        "lat": 1.259502130291502,
        "lng": 103.8128225302915
      },
      "southwest": {
        "lat": 1.256804169708498,
        "lng": 103.8101245697085
      }
    }
  },
  "name": "HeadRock VR Singapore",
  "place_id": "ChIJYyouLbgZ2jERuV5F8Gi938Q",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Fab Foodie Swede Malin Nordblom",
      "author_url": "https://www.google.com/maps/contrib/107062657007062713328/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUiibmrdYZC_0njkI_zLGd1hHVC_tIM-stmd1f4F6C2ByhrAra9=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "7 months ago",
      "text": "Head Rock VR has something for both the younger generation and for everyone that loves VR. My favourite was the boat ride and the rollercoaster! I would recommend going during the week.",
      "time": 1728524287,
      "translated": false
    },
    {
      "author_name": "Ashley Matthew Teo",
      "author_url": "https://www.google.com/maps/contrib/113097449344309965948/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWC0W0342jkicK9dQy26DPcxi5wjft0xU4_hfzyc2D4raq5iOgGzw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "2 years ago",
      "text": "Rides were incredibly fun and it was a good experience with the family. Staff were really helpful in briefing us the safety regulations and setting up our VR headsets.\n\nHowever there were very little staff accommodating to the visitors that day so for some rides, we had to wait for a bit while the staff tended to other people. There was a technical error to one of our games too so the wait time extended. However, the staff managed to troubleshoot the error.\n\nWhile it's a really good experiences, sometimes waiting spoils the fun.",
      "time": 1672890652,
      "translated": false
    },
    {
      "author_name": "Sebastian Teh",
      "author_url": "https://www.google.com/maps/contrib/106301580128786320606/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVfAenQPHI6_UbxC-tc8kLHszEPkyZoYBCiS29aNDJ16bb0b3GKpA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Went there a few times , last was with my wife.\n\nWe had a great time there as the rides are fun and safe. It's like riding a roller coaster without the need to worry about physical danger.\n\nThis place is certainly design for family, especially for parents with kids. The setup is pretty condusive and comfortable as it's fully sheltered from the sun and rain.\n\nGreat for a quick get away for you and your family to have a blast while staying fully sheltered.",
      "time": 1700366381,
      "translated": false
    },
    {
      "author_name": "Tony Sen (Toni senpai)",
      "author_url": "https://www.google.com/maps/contrib/106993527862802210167/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSZQdDqQlpGNFXlWIM1gX3iSeQ01iXxHUlP2B4dHvaQoxzwbIDJg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 2,
      "relative_time_description": "a year ago",
      "text": "Went there on 24th July 2023.\n\nIt costed $53 pax for 5 tickets each. They give you this panda face covering for hygiene purposes. For those with glasses take off your glasses, put on the mask then your glasses again\n\nBut everything went downhill from there.\n\nAll of the rides had horrible lacklustre voice acting. On storm blizzard especially the dude saying his dogs’ names annoyed me to no end\n\nThey weren’t too exciting either, mainly due to the passable graphics.\n\nThe staff was also not very helpful. They’re pretty aggressive when taking off the VR headset and my glasses were still in it on storm blizzard when they took it off for me\n\nIn addition, there isnt a staff member around at all the things, so sometimes when I need to adjust my headset I just take it off and do it on my own.\n\nThe rides had problems frequently too. Jungle rafting in particular needed to he restarted twice since one of us cant see anything on both times then we just sort of gave up on it (staff troubleshooting was rly bad)\n\nThe most fun I had was at the games. Fruit ninja was really fun and zombie busters was alright\n\nskyscraper was honestly a letdown because you shoot like 5 robots and cut one wire and thats it\n\nThe main reason why this place sucks is that it tries to be so many things with VR. It tries to be an amusement park, it tries to be a shooter game and it tries to be a vr arcade. The only thing original they have is jump jump. For shooter games we have zero latency and sandbox vr, for amusement park universal studios is literally a couple stops away and for vr arcadesyou have v-room and others. Combine that with the location of the very west of sentosa, you get an overpriced vr place that only serves to trap those curious enough to check it out\n\nUnless you have really young kids or have nothing better to do, this was not worth the price. If you insist on going, three tickets is more than enough.",
      "time": 1690194880,
      "translated": false
    },
    {
      "author_name": "Penny Liu",
      "author_url": "https://www.google.com/maps/contrib/112699840710441649452/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLCnd4F0V-I1w8_WzGznWw744upiuEkswQDlGyMdqvu8zXKXA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "2 years ago",
      "text": "Staff are friendly. Price are a bit steep but great in door activity. Suitable activity for both young children or adults. It provides many choices and great VR experiences. It’s hard to find, we took bus A and 3-5mins walking distance from the bus stop. Tickets are cheaper online, so do some research beforehand you can save a few dollars there",
      "time": 1683217925,
      "translated": false
    }
  ],
  "types": [
    "amusement_park",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14186265609645678265",
  "user_ratings_total": 423,
  "vicinity": "80 Siloso Road, Southside Blk, #01-03 B"
}