{
  "formatted_address": "#01-04 Compassvale Link, Blk 267, Singapore 540267",
  "geometry": {
    "location": {
      "lat": 1.3836349,
      "lng": 103.8970495
    },
    "viewport": {
      "northeast": {
        "lat": 1.385019180291502,
        "lng": 103.8985214802915
      },
      "southwest": {
        "lat": 1.382321219708498,
        "lng": 103.8958235197085
      }
    }
  },
  "name": "Healthway Medical (Compassvale)",
  "place_id": "ChIJFVxfdRYW2jERXppRuknP3-U",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "koh hayden",
      "author_url": "https://www.google.com/maps/contrib/114382811043373486448/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLZ_pyyjk5ZrqEMFsVD4RpIW-XgTPQR1ECEEW1bOPOPZAcPmw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Dr. Vincent Chong is an outstanding doctor who treated me with extreme care, professionalism, and a truly pleasant attitude. He is not only highly skilled but also deeply compassionate, making the entire experience reassuring and comforting. I have immense respect for him and his dedication to treat all his patients well.\n\nAs well as the frontline clinic team is equally wonderful - welcoming, kind, and treating patients like friends. Their warmth and efficiency make a real difference. As the way they handle their patients are very quick and smooth",
      "time": 1743508259,
      "translated": false
    },
    {
      "author_name": "Wee Le Tan",
      "author_url": "https://www.google.com/maps/contrib/114415844091751513673/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK8JXSudEopV5AnNMyVAnxMSOULw98Xjq3GkkBkzyAv22fqGg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Dr Chong is a very dedicated and compassionate doctor. A simple act of standing up, opening the door for the patient and greeting the patient comes a long way. I could tell his patients felt at ease when he did those things. He is empathetic and tries his best to understand his patients. His patients always seem very happy around him.\n\nAlthough he is busy with his patients, he also takes time in between seeing patients to check in on us and explain to us the different conditions and treatment plan to help us better apply what we have learnt into clinical setting. I really appreciate Dr Chong’s teaching and guidance during my year 1 medical GP attachment. Thank you Dr Chong!",
      "time": 1745683644,
      "translated": false
    },
    {
      "author_name": "Elizabeth Chia",
      "author_url": "https://www.google.com/maps/contrib/116271140715526930997/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXXge9QXv5zzbQTtqyaizB8hyryub5sqk8LA6xCib5_tFDLZPA0WA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I had an excellent experience with Dr Vincent Chong. He is a professional, kind, patient and experienced physician who truly cares about his patients. He provides a thorough examination, and explains everything clearly. His attention to detail and expertise made me feel confident in his abilities.\n\nThe clinic itself was very clean and well-maintained. I highly recommend Dr. Vincent to anyone looking for a knowledgeable and compassionate doctor.",
      "time": 1743214826,
      "translated": false
    },
    {
      "author_name": "Nicole Ang",
      "author_url": "https://www.google.com/maps/contrib/101500325119538601205/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW6yYHZYTIKhMCVJUFtMHpWYJn_Q4Zqas4YDTQGnV60F1XPq1w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Dr Chong is highly professional and excellent at his job. He is patient to all who walk in and takes the time to get to know his patients well, even amidst his busy clinic. His attention to detail, diligence, and hardwork are part of the reason why many love coming back to see Dr Chong. Not only that, the rest of his staff are a warm and friendly group of people who are patient in welcoming patients in, distributing medicine etc. I would highly recommend this clinic to all who stay around the area. Thank you Dr Chong and team for such an excellent clinic in compassvale! :)",
      "time": 1742426122,
      "translated": false
    },
    {
      "author_name": "Kevin Yip",
      "author_url": "https://www.google.com/maps/contrib/107157503641026822583/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKrg-lwnv5kDoUVnDpOuZKK8OQP6JM-S_u3aIJu05TbWc6lTA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I had an exceptional experience at this clinic. Dr. Chong was not only highly knowledgeable and professional, but also genuinely attentive and compassionate — taking time to explain everything clearly and ensuring I felt comfortable and informed throughout my visit. The prescribed medication was effective, and I noticed significant improvement in a short time. The staffs were equally impressive: welcoming, efficient, and prompt in attending to my needs. From check-in to follow-up, the entire process was smooth and reassuring. Highly recommend this clinic for anyone seeking quality care with a human touch.",
      "time": 1744525417,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16564185870057445982",
  "user_ratings_total": 288,
  "vicinity": "#01-04 Compassvale Link, Blk 267"
}