{
  "formatted_address": "533 Choa Chu Kang Street 51, #02-07, Singapore 680533",
  "geometry": {
    "location": {
      "lat": 1.3922588,
      "lng": 103.7431268
    },
    "viewport": {
      "northeast": {
        "lat": 1.393741330291502,
        "lng": 103.7446328302915
      },
      "southwest": {
        "lat": 1.391043369708498,
        "lng": 103.7419348697085
      }
    }
  },
  "name": "Healthway Medical (Limbang)",
  "place_id": "ChIJo3Rn0u8R2jER23PyPA50Uy4",
  "rating": 2.9,
  "reviews": [
    {
      "author_name": "mi micky",
      "author_url": "https://www.google.com/maps/contrib/111711658131884446080/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVY4ZuW8MAETwPuuB80LKuDc6M4xIAKYgPy4y7TTw-1ceskgyLZ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "There was this Senior Nurse purposely make me waited for almost 26mins to collect my hubby medicine. I told the snr nurse that I m rushing back home to work also and just wish to collect and go as Dr yeo already informed my hubby via phone to collect medicine. The snr nurse purposely hold my medicine on the desk and make me waited  after 3 patients, I approached her 2nd time at 2.40pm. Then another junior nurse said your medicine already ready on table . There you see, the medicine already ready and right in front on their desk and there is no patient standing at counter when I reached at 2.14pm but the senior nurse asked me to wait she saw it and simply placed my hubby nric on top the medicine.  At that point I saw my medicine already on the desk but she said wait, at first I thought Dr yeo wanted to talk to me regarding my hubby medication but end up No, Please address this matter, she is too much for doing it .  Dated on 21mar2025@limbang healthway clinic.\nPls watch yr CCTV at this time, when I approached her at 2.14pm. the medicine was there.",
      "time": 1742542618,
      "translated": false
    },
    {
      "author_name": "Doris Lim",
      "author_url": "https://www.google.com/maps/contrib/102094026678197451675/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIab79yZKH_z9cP_7hwlakADM6N0IpCXrDL2X1vwKTRrB0E3A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "My family use Healthway Limbang for many years. We are very grateful to Dr Teo for his dedication and patience with his patients. He is very through and takes good care of his patients. He wrote a very detailed report on my dad condition and received praises from NUH doctor who said he is highly commendable. All staff especially senior staff are very patience with our queries and requests. Clinic is very crowded but most patients are willing to wait for Dr Teo. Staff has to work under high stress level as they have to deal with all situation, salute them for putting in good efforts. Network may not be great at all time, so it’s beyond them, hence we need to understand their difficulties.\nFeel blessed to have a good GP clinic near my home. Keep up the good work Dr Teo and staff. Big thank you from Doris Lim Poh Lian and family.",
      "time": 1740276969,
      "translated": false
    },
    {
      "author_name": "Sunnyrain3655",
      "author_url": "https://www.google.com/maps/contrib/114250447820089503903/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJKCDU7_AWOq3bqDY6nIgcfKGqFXEkyYDjFN3iEPoz8o52I0g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Giving a 5 star review because front desk staff is really friendly and to people giving bad reviews you have to understand that in a GP setting if you coming down for just a common flu or what not you have to follow the queue system.\n\nIf you feel that you are dying or what please go to your nearest hospitals instead like your A&E or what not.\n\nPatients have to understand too that staff and doctors are all human and everyone even the staff deserves to be treated with EQUAL respect.\n\nHonestly if you are angry enough to write poor reviews here and complain about how sick you are then are you truly that sick?\n\nLet's be civilised and put yourself in the healthcare worker shoes as well if they could treat you ASAP would you think that they would delay your treatment? Common sense abit la people",
      "time": 1740722156,
      "translated": false
    },
    {
      "author_name": "Zacherias",
      "author_url": "https://www.google.com/maps/contrib/114728652654224951850/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXdCkAzKjYCliJBBT_Ww5_XHM4dbVeizwaJlKOVmzwDgZMoEyg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Sometimes the kindness of a person goes a long way! Visited the clinic some time back as it was nearby and Cck polyclinic was extremely busy. Even though it was also busy there the nurse at the counter was nice enough to reassure me and made me felt comfortable and less anxious.  She even asked me about my chas card status and reassured me she will do what she can to help me out with my registration and billing.  Dr teo was a great doctor who didn’t make me felt rushed and make me felt understood even though I didn’t know how to specifically indicate my discomfort. But at the end of the day, it was the nurse at the counter who told dr teo from observing me while I was waiting so he could help diagnosed me better. I later found out the nurse’s name was matula (spelling?) but while it takes a good doctor, a wonderful and keen-eyed nurse made this clinic The good place.  Thank you nurse, but hopefully I don’t fall ill again :)",
      "time": 1738148204,
      "translated": false
    },
    {
      "author_name": "jewell toh",
      "author_url": "https://www.google.com/maps/contrib/112896277156301949209/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLxgD0RzuPWnKo93sGjimdrE8LiisrD2SwWjl8G5hTxZ404Dg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "would rate it 0 if i could.\nfirst occasion was a Saturday, reached at 11.30am when the operating time suggest it close at 1pm. when i was there i was denied entry and a notice on the door “no doctor available” does this even make sense to have a clinic under operation without doctor???\n\nsecond occasion, this clinic does not follow their operating time, so what is the point of having one? friday closing time is 5pm, i called twice at around 4.20pm but no one picked up, reached the clinic at 4.30pm, the door sign shows “closed” ???? no patients were inside and both receptionist was just chit chatting at the counter without having the decency to pick up the phone hahaha. so really if you have an emergency, NEVER come here as they won’t entertain you according to their opening hours.",
      "time": 1738919522,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3338139353312555995",
  "user_ratings_total": 97,
  "vicinity": "533 Choa Chu Kang Street 51, #02-07"
}