{
  "formatted_address": "1 Orchard Blvd, #05-09, Singapore 248649",
  "geometry": {
    "location": {
      "lat": 1.3033039,
      "lng": 103.8239218
    },
    "viewport": {
      "northeast": {
        "lat": 1.304617780291502,
        "lng": 103.8253990302915
      },
      "southwest": {
        "lat": 1.301919819708498,
        "lng": 103.8227010697085
      }
    }
  },
  "name": "Health Screening Singapore (Orchard) by ATA Medical | 新加坡健康检查与体检中心",
  "place_id": "ChIJUd-2RroZ2jERXHO2CNgbd8E",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Mavis Sum-Tsoi",
      "author_url": "https://www.google.com/maps/contrib/116920716509990941811/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI4I69jj_FmWDtDj0ce-7pIBVR0feYDiipGenN6sYgFhOv1jQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I wanted to express my thanks and compliment the team at ATA Medical Centre for the exceptional service and professionalism during the recent health screening for my helper, Helen, and the subsequent doctor review over Zoom.\n\nFrom the thoroughness of the screening process to the insightful consultation with Dr. Joel, I was deeply impressed by the smooth and seamless experience. I especially appreciated the team’s thoughtful communication, keeping me informed about the slight delay in the consultation rather than leaving me in the dark.\n\nDr. Joel’s expertise, professionalism, attention to detail, and compassionate demeanor provided reassurance and confidence throughout the experience. Helen was also happy and at ease during the process.\n\nThank you once again for your outstanding service.\n\nMavis Sum",
      "time": 1744880618,
      "translated": false
    },
    {
      "author_name": "Tan Desmond",
      "author_url": "https://www.google.com/maps/contrib/110106714150679940874/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXswZZc3mf71l1ZIdcOJWHNcsWrKDuFqdWEuKcDn-0JApov61qB=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Well equipped, modern and clean clinic and self-contained for all the tests needed. Friendly and helpful staff and engaging doctors. Definitely a better experience than the usual health screening centres. Will be back for the next health screening. Keep up the good work!",
      "time": 1746796301,
      "translated": false
    },
    {
      "author_name": "Matej Mejak",
      "author_url": "https://www.google.com/maps/contrib/106210268670407030511/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXdXhfDmsJCd5EOyHBG306BTmJ_v-NjfXQ7IPBWylg5a5ki4B3B4w=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Had a great experience at ATA Medical Orchard! The staff were incredibly kind and professional, and they even accommodated me despite arriving more than 30 minutes early. I have medical reasons that make it difficult to take my blood, but they handled it extremely well with great skill and care. Really appreciate their efficiency and warm service. Highly recommend!",
      "time": 1741752097,
      "translated": false
    },
    {
      "author_name": "Regine Lee",
      "author_url": "https://www.google.com/maps/contrib/108466794852380842275/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV2Vf5aXeua1EhND9ArWzyArAKRfpsN6kjRncl8XfLF52aY-wAP=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "I wanted to do a vitamin deficiency test and I tried googling and only saw this Clinic offering this kind of test. I have checked with Polyclinic. They also don’t provide this type of test. Therefore, I decided to do the comprehensive vitamin deficiency test with ATA. Price is affordable. They are conveniently located near Orchard Boulevard MRT station. The clinic looks like a hotel lobby, very atas and posh. I was in and out of the Clinic within 15 minutes. Service is friendly and efficient.",
      "time": 1726718643,
      "translated": false
    },
    {
      "author_name": "Tay YK",
      "author_url": "https://www.google.com/maps/contrib/108429388412437338331/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVgFBsrAr__NmRZGoz_LB5S2hWSS2vili63JL7S-WxKvTl_v2oO=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "My visit to ATA Medical Clinic at Orchard was a pleasant experience. Located just a two-minute walk from Orchard Boulevard MRT station, the clinic is easily accessible, making it convenient for anyone in central Singapore. Upon arrival, I was greeted by a welcoming environment that felt both professional and comfortable.\nThe staff were exceptionally friendly and eager to assist with any inquiries regarding my medical check-up. They provided clear guidance throughout the process, ensuring I felt at ease. The clinic is well-equipped with modern facilities, including X-ray and ultrasound services, which contributed to a seamless health screening experience.\nOverall, my experience at ATA Medical was great. The combination of a prime location, friendly staff, and a pleasant atmosphere made my visit stress-free and efficient. I would highly recommend this clinic for anyone seeking medical check-ups or health screenings in Singapore.",
      "time": 1735362692,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13940641786221720412",
  "user_ratings_total": 368,
  "vicinity": "1 Orchard Boulevard, #05-09"
}