{
  "formatted_address": "157 Ang Mo Kio Ave 4, #01-578 Mayflower Market and Food Centre, Singapore 560157",
  "geometry": {
    "location": {
      "lat": 1.37517,
      "lng": 103.8389369
    },
    "viewport": {
      "northeast": {
        "lat": 1.376418430291502,
        "lng": 103.8403457302915
      },
      "southwest": {
        "lat": 1.373720469708498,
        "lng": 103.8376477697085
      }
    }
  },
  "name": "Healthcare AMK Medical Clinic - Ang Mo Kio Avenue 4",
  "place_id": "ChIJK7WoYsMW2jERMjz_9P49dwU",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "YY Lo",
      "author_url": "https://www.google.com/maps/contrib/101019392807264497274/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKZspvgRHVT1gRKQ8LuRFN5Mzyw_NLd1X92V-ezUm-gThrDpQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I would like to sincerely thank Dr. Ong for his exceptional care and sharp diagnostic skills. After visiting numerous doctors about persistent stomach problems, it was only Dr. Ong who correctly suspected that the issue might be related to my gallbladder. He referred me to a specialist and revealed a large stone in my gallbladder after an ultrasound. Thanks to his attentiveness and expertise, I was able to have it removed, and I’m now free from the pain that had been troubling me for so long. I’m truly grateful to Dr. Ong for making such a difference in my life!\n\nMoreover, Amy, the receptionist is very patient. She will explain clearly the medication and answer my queries. Thanks!",
      "time": 1745122024,
      "translated": false
    },
    {
      "author_name": "Shah Salehin",
      "author_url": "https://www.google.com/maps/contrib/100281172793782847653/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXkgiODV9AaNEbnab1-7bPJKHl0y-Y-29UV4HVJl1h1XRZvP_NM=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Excellent experience at this clinic when I was feeling under the weather with a cold and flu. From the moment I walked in, the staff was friendly, professional, and attentive. The clinic was clean and comfortable, making me feel at ease despite being sick. The doctor was thorough, took the time to listen to my symptoms, and provided clear advice on how to recover quickly.\n\nI highly recommend this clinic for anyone looking for caring, and effective treatment!",
      "time": 1740627883,
      "translated": false
    },
    {
      "author_name": "Faye P",
      "author_url": "https://www.google.com/maps/contrib/100380872304610129410/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVqnQEx1EtL3pgdgHutcojtYUCk_0qMjEveDf9OSophQeuALRxr=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I stumbled upon this clinic a few years ago when I decided to do a random Google search one day. The 5-star reviews caught my attention, and I honestly regret not knowing this place existed sooner — I live just opposite! Growing up, I always went to Dr Hui’s clinic next door (and trust me, don’t go there lol). Anyway, I recently noticed the ratings dropped and read through some of the one-star reviews, which really saddened me because I’ve been coming here for years and can confidently say this clinic deserves way more love. Honestly, it deserves 10 stars if not more.\n\nFirst off, I’ve seen a lot of doctors over the years, but DR ONG is absolutely IMMACULATE. I can’t say much about the other doctors, but Dr Ong is hands down the best I’ve ever come across. He’s so knowledgeable, empathetic, and a brilliant listener. He cured my partner’s back drip issue and fungal infection in just 1-2 weeks — something that 4 other doctors at nearby clinics couldn’t fix after a whole year. They were his company’s panel doctors, but they couldn’t help at all. That’s why my partner would rather pay out of pocket to see Dr Ong — because he’s just THAT good. As for me, I’ve gone to Dr Ong for everything — from minor skin issues to more serious concerns. Just yesterday, I went in for a tiny red patch on my elbow. Most people might think it’s not a big deal, but Dr Ong took the time to inspect every little patch, and he looked even more concerned than I was. After a thorough check, he explained it was likely a fungal infection. His attention to detail and care really stand out.\n\nNow, about the complaints I’ve seen… I don’t get it. The queue moves so quickly, even when the clinic is packed. I’ve had to wait maybe 1 hour tops, even when there were more than 10 people ahead of me. To put it in perspective, Dr Hui’s clinic next door takes over an hour to see maybe five patients, plus another 15-30 minutes to dispense meds. Yes, I grew up hearing my parents complain about how slow Dr Hui’s clinic is LOL over here, once you’re out of the doctor’s room, Aunty Amy (the main receptionist) has your medication ready almost immediately. No long waits — it’s fast and efficient.\n\nAnother thing I love — Dr Ong studied dermatology and helped me with my cystic acne years ago. I’ve struggled with acne my whole life, and I’ve seen at least four dermatologists before, but the acne always came back after I stopped the meds. With Dr Ong, I now have almost perfect skin, with just the occasional pimple here and there. He also offers super affordable chemical peels if that’s something you need. Honestly, is there anything this guy doesn’t know???? I’m sure he’s top 1% in his field 😂\n\nThe clinic also stays open until 10 PM, and Dr Ong will still see you at 9:55 PM, even when the clinic is busy. I’ve never seen him turn anyone away, and compared to other places (looking at you, Frontier clinic), the staff here is super friendly and accommodating.\n\nI’ve never called ahead for appointments, but a lot of regulars, like myself, know you can grab a queue number earlier in the day for evening appointments. It’s pretty straightforward — just respect the process, or find another clinic if it’s not for you.\n\nThis place is top-notch for real. Dr Ong’s expertise, care, and dedication truly make this clinic stand out. And Aunty Amy always makes sure everything runs smoothly and efficiently. Highly recommend!",
      "time": 1735844706,
      "translated": false
    },
    {
      "author_name": "AES'TY NAYAMI",
      "author_url": "https://www.google.com/maps/contrib/114061083254929133453/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUAlHov66mZ7ZekJI4umPCnRDI3-hSzQKDEMrvyDGgkPruhS8w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "This clinic is my family physician clinic for 3-4 years. My kid love this clinic bcs it has lots of toys. Doctor is really kind. Esp doctor Ong. The receptionist is very kind too. Will give sweets to my son when she have.",
      "time": 1736207484,
      "translated": false
    },
    {
      "author_name": "Hwee Lee Yeo",
      "author_url": "https://www.google.com/maps/contrib/111212288472444371428/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLzuCZwxjvu1_E-veYg8WzfQIw1JMLDcQ8m8v-MrU1zz_vxZg4Q=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Wait time is not long. Medical clinic available on Sunday. Doctor is patient and provide good explanation of medical condition. Good experience",
      "time": 1738470016,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=393851657659563058",
  "user_ratings_total": 123,
  "vicinity": "157 Ang Mo Kio Avenue 4, #01-578 Mayflower Market and Food Centre"
}