{
  "formatted_address": "19 Lor 7 Toa Payoh, #01-272, Singapore 310019",
  "geometry": {
    "location": {
      "lat": 1.335236,
      "lng": 103.8565218
    },
    "viewport": {
      "northeast": {
        "lat": 1.336579330291502,
        "lng": 103.8578004302915
      },
      "southwest": {
        "lat": 1.333881369708498,
        "lng": 103.8551024697085
      }
    }
  },
  "name": "HeartlandHealth Kim Keat",
  "place_id": "ChIJQ5sabG0X2jERsid81ou9H6Y",
  "rating": 2.6,
  "reviews": [
    {
      "author_name": "Loo aaron",
      "author_url": "https://www.google.com/maps/contrib/107160347383181498038/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWfFlN_pb9evYX0Ugiv85bBjkurVqArUmnkAtGycuJT485PLYU=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "I visited this clinic yesterday hoping to get the right treatment. After my appointment, the doctor prescribed me medication, but unfortunately, it did not provide any relief. I still feel the same, if not worse, and my symptoms have not improved.\n\nI called the clinic to explain my situation, and the doctor advised me to come in again today. While I appreciate that they are offering a follow-up, I am very frustrated that my concerns weren't addressed effectively during my initial visit. I feel like I’ve wasted time and resources without getting any meaningful solution.\n\nI had high hopes for this clinic, but my experience has left me disappointed. I hope the doctor can offer a better course of treatment today, but I feel this process should have been handled differently from the start.\nDon't recommend anyone to go to this clinic as my family encounter the same situation",
      "time": 1743507263,
      "translated": false
    },
    {
      "author_name": "Ally L",
      "author_url": "https://www.google.com/maps/contrib/101143257946324941176/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKYM64rh9hq5tuXZzBwMvf0LuGHRpCBYSMur2G1UxhjbGrZFg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Would like to give a big thank you to Dr Yeang whom showed so much care, patience, empathy and professionalism towards me. It was so reassuring to consult with him during one of my worst ever GE episodes.\n\nAnd to all the patients out there, stop abusing your doctors. Their job is a lot harder than you will ever imagine.",
      "time": 1739190289,
      "translated": false
    },
    {
      "author_name": "Tan YX",
      "author_url": "https://www.google.com/maps/contrib/114342106887153233763/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJPXwHo2ASab49lmhTK71C8HDo_ZnkXrvpOKi4LS9hheEqcsw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "Dr Lee Cheng Da\n\nAttitude was very bad. We forgot to ask about our child's left ear skin infection and went in to ask him again. Noted earlier on that he had to leave early at 445pm. At around 454pm we asked if we could just quickly show him my daughter's ear. I could hear him getting frustrated inside the room and saying that he needs to leave the clinic already. When we entered, he took a brief look at her ear and said he'd prescribe her with cream. He then proceed to tell us to ask earlier next time. Can we help it if we forgot smth then recalled later? Experience here had always been ok until today. Appreciate if he doesn't appear at the clinic again. Very unprofessional, if he doesn't have empathy and patience then don't be a Dr for goodness sake! I expect an apology for his lousy attitude.",
      "time": 1731661663,
      "translated": false
    },
    {
      "author_name": "Gem Wong",
      "author_url": "https://www.google.com/maps/contrib/114957331342350346806/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJzHO_s-1hxbvAj7RGp6EQwlik6CeXp-yzHPWEImALwSMxy=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Manager Sophia and her team are friendly and efficient.\nDr. Ryan Yak is extremely patient with the elderly.\nAppreciate and thank you Dr. Ryan for helping me solve my many health issues.",
      "time": 1730585614,
      "translated": false
    },
    {
      "author_name": "Danny Ng",
      "author_url": "https://www.google.com/maps/contrib/107635312338465688847/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIYBpAbxk6fzufW2YMpMJ7E91MSKopr3SMK5X7BAR9c-BDTug=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "11 months ago",
      "text": "When I was there the q number was at 79. One hour later then it turned to 82 (my q number). A young male doctor, to me is inexperienced as he seems following the protocol for each steps, very different from experienced doctor when looking at possible symptoms. Was already quite weak. When I was able to leave he asked if I MC for today (Sunday). Of course my reply is a big no.\nIn terms of opening time, it is rated A+. Will never return to this clinic again unless my usual clinic is closed. If you ask me to compare with Polyclinic, then yes he is better than Polyclinic. Not recommended!! There are several other clinics within the block and next. Of course if you want to have  some experience going to this clinic then by all means and you will get what I mean. THUMBS DOWN DOWN",
      "time": 1717899797,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11970494742870632370",
  "user_ratings_total": 32,
  "vicinity": "19 Lorong 7 Toa Payoh, #01-272"
}