{
  "formatted_address": "551 Bukit Timah Rd, Singapore 269692",
  "geometry": {
    "location": {
      "lat": 1.3229704,
      "lng": 103.811969
    },
    "viewport": {
      "northeast": {
        "lat": 1.324342280291502,
        "lng": 103.8134250802915
      },
      "southwest": {
        "lat": 1.321644319708498,
        "lng": 103.8107271197085
      }
    }
  },
  "name": "Hello Arigato Bukit Timah",
  "place_id": "ChIJ7VSchNob2jERSYAj1taTBMs",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Chunwen Huang",
      "author_url": "https://www.google.com/maps/contrib/101636541114526759357/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU81nOC37VL35PmJP--v8XA42CmNGrNcKlUo9Locf70y2BFolC-_w=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Came on a Public Holiday at 12pm with reservation, the cafe was packed except a couple of outdoor tables. Highly recommend making reservations before coming.\n\nOrdered the outlet exclusive Pork Ragu Pasta, Gyu Sando, Truffle Fries and Coco Matcha Cloud.\n\nPork Ragu Pasta (8/10) - A decent plate of Pork Ragu, nothing to shout about. The tomato sauce was not acidic (just how I like it).\n\nGyu Sando (6/10) - the Japanese milk bread was crispy but not as fluffy as I expected of a milk bread. Beef doneness and texture was perfect, but would be better with more flavour (most of the flavour came from the caramalised onions)\n\nTruffle fries (amazing/10) - if you love truffle, this dish is sure to hit the spot. Fries were crispy and the truffle aroma and taste was strong (probably from truffle oil). Topped with parmesan cheese and a side of truffle mayo which also had a strong truffle taste. Highly recommended.\n\nCoco Matcha Cloud (7/10) - literally coconut water topped with Matcha Foam. The Matcha Foam texture and taste was great, the only problem was I had issues trying to drink the Matcha Foam (when I tried sipping straight from the cup, the coconut water surfaced; when drinking using the paper straw, it eventually gave in). Otherwise a pretty good option for drinks.",
      "time": 1745015633,
      "translated": false
    },
    {
      "author_name": "Shannon Lim",
      "author_url": "https://www.google.com/maps/contrib/103065304618629252257/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWmPL_gdgTFCt5Ii7BNyLKKpHj5pTw0cRIrY70ooT9zrucCosf_=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "I’m having mixed feelings about this place.\n\nFirst impressions were poor - we walked in and were gestured to sit at a dirty table that wasn’t wiped properly. After informing the staff, the table was cleaned but the chair (covered in crumbs etc.) wasn’t, and we had to inform a second time.\n\nStaff didn’t seem to be properly trained, Tater Tots were served without the nori mayo. And when the mayo was served it just looked like regular mayo? The portion was unbelievably small for $8, literally less than 20pcs.\n\nThe pork was generous in the Pork Ragu, tasted as what I would expect, nothing extraordinary. Porkatsu Sando on the fattier side. Prices are on the steeper side.\n\nBut the Strawberry Matcha Cloud was the star of the show (or saviour I would say), not overly thick and mildly sweet due to the strawberry puree/milk. Would definitely come back just for the matcha.\n\nAlso, a commendable service was that the water was free, served shortly after being seated, and also came with cups of ice. And GST is included!",
      "time": 1745146735,
      "translated": false
    },
    {
      "author_name": "marissa lavanya",
      "author_url": "https://www.google.com/maps/contrib/115502841007161131625/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU9KJeBBxBkGfyWcuDY1lTryreSBWsHdTFJBB9YPjCDFa5EnR7uVA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "The food was alright, the portion was abit small. The strawberry matcha was too sweet not enough matcha. The pasta was pretty good with the flavours on point and the gyu sandwich as yummy too but we let it sit abit so it became abit soggy. The tater tots portion was too little but the dip was very nice.\n\nWorth trying but might not be filling.",
      "time": 1742707261,
      "translated": false
    },
    {
      "author_name": "Angie Chng",
      "author_url": "https://www.google.com/maps/contrib/108764242257700631083/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXux1TvNz_ST8hQNgagfs8TGDlrWNSio1T2JB_erzvUXHbcyjw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "For weekday morning, the crowd was thin.\n\nService was basic, and the place was well staffed. Like the fact that they are still serving free water. A thumbs up.\n\nBoth our sancho were good. A little oily, though. But both our drinks were disappointing. The hot drinks were a mixture of cold and lukewarm. I guess they might have just added cold milk. We didn't enjoy the drinks compared to other places.",
      "time": 1744471726,
      "translated": false
    },
    {
      "author_name": "Jia Yi",
      "author_url": "https://www.google.com/maps/contrib/115169054387902057121/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKtgWt7Xim6W9KcloL8f6Xw6OOnhr9ez4VpVb1p7UldUP-6nsk=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "felt quite disappointed after having wanted to visit hello arigato for a really long time. i'm not sure if its because i arrived quite late (8pm, which may mean that i got the most concentrated sauce?) but the gyu pasta ($22) was way too spicy and peppery to be enjoyable, and it tasted rather one dimensional as a result. the pepper sauce tasted really similar to the macdonald's prosperity burger so if you like a spicier and more peppery version of that in pasta form you can try this. my stomach didnt feel very good after eating this, and i had diarrhea after. we also got the gyu sando ($28) which tasted fine but not like amazing. the beef was slightly chewy but i think that is okay given the price point for a gyukatsu sando. i was just pretty disappointed after having been so hyped about eating at this place.",
      "time": 1745057566,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "restaurant",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14628980040531148873",
  "user_ratings_total": 224,
  "vicinity": "551 Bukit Timah Road"
}