{
  "formatted_address": "119 Bukit Merah Lane 1, #01-40 Block 119, Singapore 151119",
  "geometry": {
    "location": {
      "lat": 1.2861046,
      "lng": 103.8048371
    },
    "viewport": {
      "northeast": {
        "lat": 1.287397880291502,
        "lng": 103.8062674302915
      },
      "southwest": {
        "lat": 1.284699919708498,
        "lng": 103.8035694697085
      }
    }
  },
  "name": "Heng Nanyang Fried Hokkien Mee Beer Garden",
  "place_id": "ChIJaxhPcgAb2jERg6jKm2nGjI4",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "William Ngoh",
      "author_url": "https://www.google.com/maps/contrib/110347572224560989833/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKlfSVMQAsMJ4BhpTpnfDj0ttUbAoHYYGmy0w8RV2oKFTGfzQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "The HKM was very nice with wok hey and fresh prawns.. ordered $6 portion added 80cents egg.. liked the thin beehoon style and able to add fried egg. But chilli wasnt spicy at all and no pork lard so lose a bit..",
      "time": 1741137249,
      "translated": false
    },
    {
      "author_name": "Alvin Quah",
      "author_url": "https://www.google.com/maps/contrib/117766417318468985509/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXZpZ62WC7gKIUz4SJpXrocQT8wlzw0Rxd6-n5DYg0HD7e1obhn=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "Situated right next to the Alexandra Village Food Center, separated by only a small carpark, Heng Nanyang is an unassuming coffeeshop that is easily overlooked.\n\nOnly after chatting with the staff did I find out that they've been here for about a year(since 2023).\n\nWhat makes matters worse is that there used to be a really famous Fried Hokkien Mee, my favourite in central west, at the other coffeeshop near the main car park entrance (they have unfortunately permanently closed).\n\nToday I've come to try out their Fried Hokkien Mee to see if they can be crowned the new King of the central west.\n\nFirst impression of the dish is that the broth looks really  thick, but the prawns look small.\n\nThe chilli is spicy and slightly sour, it goes very well with the noodles.\n\nThe noodles had a little bit of gravy, I'd say it is between wet and dry type. Personally, I prefer the dry type but this amount of gravy is acceptable to me.\n\nThe broth tastes really flavorful, filled with the richness from prawn and pork, with a tinge of wok hei, which is what I was looking for.\n\nThey use yellow noodles and thin bee hoon, which again, is to my liking (some people prefer the thick ones).\n\nAs mentioned the prawns are a little smaller than what I like but there were four inside the small portion.\n\nThe pork lard was soaked with the broth, some people might prefer theirs crunchy. Personally I avoid them 😂\n\nThey were also 4 slices of squid in the dish, which is not bad.\n\nWhat's missing is sliced pork belly. Which, sadly,  more and more hawkers are leaving out now.\n\nOverall I love the taste profile of their dish and to be able to find it early in the morning makes it even more valuable.\n\nTechnically, this a 4/5 Fred Hokkien Mee and with the dish becoming a rarity, especially in the morning, considering it costs only $5, I think it's fitting to be the new King in the central west (for now).\n\nThey are open from 6am-8pm for food, Breakfast starts 530pm and coffeeshop closes at about 10pm.\n\nI will be back to try their prawn noodles and laksa!",
      "time": 1722564092,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10271803007012874371",
  "user_ratings_total": 2,
  "vicinity": "119 Bukit Merah Lane 1, #01-40 Block 119, Singapore"
}