{
  "formatted_address": "5 Koek Rd, #03-01, Singapore 228796",
  "geometry": {
    "location": {
      "lat": 1.3019405,
      "lng": 103.8407705
    },
    "viewport": {
      "northeast": {
        "lat": 1.303478930291502,
        "lng": 103.8421258802915
      },
      "southwest": {
        "lat": 1.300780969708498,
        "lng": 103.8394279197085
      }
    }
  },
  "name": "HIBACHI JAPANESE CASUAL DINING",
  "place_id": "ChIJIZ6SPoAZ2jEREZLKWGtxpn8",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "GusGus",
      "author_url": "https://www.google.com/maps/contrib/114104884641559601906/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVPUPDiXpDKlnyborVTXX97lVr-UOeGA5VqOTo5dEVBeHSciKheEA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Visit Hibachi for the first time recently with 3 other friends.\nDidn't expect much from it's humble venue. Small restaurant with bar seats and a separate private dining area. Dark and cosy environment in the private dining area, can get a little noisy if it's full house with rowdy crowd.\n\nService was good, attentive and chef's menu beside the bar is updated daily. Food was amazing, Hibachi serves a variety of dishes that are suited for even for diners with more adventurous tastebuds.\n\nLamp chop was intense and flavourful. Stingray fins were my new found favourite snack with alcohol. Sashimi was fresh and thick. Smoked duck pasta sounded western but tasted very Japanese! Overall, every dish did not disappoint. The restaurant was gracious enough to accommodate to us even though we left slightly later. I'm impressed by the experience this place left us.\n\nDefinitely going back again although price is on the steep side. It's worth for food with such quality!",
      "time": 1652436515,
      "translated": false
    },
    {
      "author_name": "Cher S",
      "author_url": "https://www.google.com/maps/contrib/107817726526626375036/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV1jjY8VY4IBZbKhFs7w5ueV0LkBkD0PSVAQnqVp70uRNG3DrMT=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Had a wonderful experience at Hibachi! Everyone was really friendly and most importantly, every single dish was well balanced. You can tell the quality of each ingredient and the skill of the chef.\n\nSome items we had that (seriously all of it was good) :\n1. Aged Wagyu (so mind blowing. The flavour of the meat is so complex, it hardly feels like you're eating beef.)\n2. Oysters (extremely fresh, tastes of the sea).\n3. The grilled stuff are generally good! (plus seasoned salt and celtic salt) we had\n4. Grilled stingray fin - love the depth of flavour\n5. Yuzu sorbet - extremely soft; not icy.\n\nThe chef was also kind enough to make some shio kombu onigiri when we asked (most places stick close to their menu so this kind gesture was much appreciated!). This was literally the best onigiri I've had. While kombu filling was modest (aka the normal amount),  you could somehow taste the flavour of the kombu in the rice. Or maybe it's the trick of the mind cos the kombu smells so good 😋\n\nThe meal left us buzzing inside. Would definitely come back again. And highly recommend you check them out!",
      "time": 1626710959,
      "translated": false
    },
    {
      "author_name": "Sze Ling",
      "author_url": "https://www.google.com/maps/contrib/105944488307655910444/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKUGrc9Ebir7WtvrNTxJtCax9p0j3OZtNbFbSc2cvnuIEEE_A=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Went on a wed for dinner with reservations for 6.30pm and place is packed. But seems like max seating is 8pax around the chef's station.\n\nService staff is attentive and prompt in clearing the plates after we are done with each dish.\n\nEach dish served was well up to standard except for the smoked duck and mushroom pasta which was a replacement for the uni pasta.\n\nNot a place that one will stumble upon and more like a hidden gem that those who know will patronize.",
      "time": 1648292153,
      "translated": false
    },
    {
      "author_name": "Peishan C",
      "author_url": "https://www.google.com/maps/contrib/106883826193635217785/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV46hPtQyfO36PD4Eia3mqY_m1Ac5JVuhxS-ZrMUTB1lsfL91_0nQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "3 years ago",
      "text": "This new izakaya is truly a gem! They started out serving only omakase but I guess with Singapore going in and out of HA/lockdown, it has been really tough for a new space to keep up.\n\nWe dug into their ala carte menu and were very surprised at how well each dish tasted.\nStarting off with the fried squid - very well seasoned and lightly battered, was such a good snack with drinks.\nNext, we had a handful of slightly bigger plates like grilled unagi, grilled miso eggplant, grill pork belly (served Korean style with lettuce), gyutan. Besides the pork belly which was too fatty for me (tho done amazingly - tender pork and juicy fats), I loved the other dishes!\n\nWe ended off with a plate of prawn pasta which was surprisingly served in a thickened broth. I was expecting a dry version, but this  peppery and garlicky dish was right up my alley.\n\nIt was a quiet night, so the ambience was really lacking even tho the dishes were great, hence the four stars.\n\nThey are apparently revamping their menus next week so more reasons to be back for a night of good food with sake!",
      "time": 1634034320,
      "translated": false
    },
    {
      "author_name": "L T Koh",
      "author_url": "https://www.google.com/maps/contrib/101820441362233538461/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK89XCrVwPfKFJBYma5PNCUed2t3Kd2TA1n5GKO41OjdlpgwQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Cuppage been quiet in this covid environment. Ambience dark quiet, counter seating style hence casual setting. They have private style seating(min $100/pax spending). The counter seat is fine really. Food quality gets the 5 star rating.\nThe appetizer is worth the $5/pax, beef is tender. Fresh mussels butter yaki. Lamb chops recommended. Les Tartes Passion to end the meal. Great dining experience, maybe because the area still less crowds! Expect $70-80/pax exclude alcohol on Ala Carte menu.",
      "time": 1649223336,
      "translated": false
    }
  ],
  "types": [
    "meal_takeaway",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9198163994815926801",
  "user_ratings_total": 64,
  "vicinity": "5 Koek Road, #03-01, Singapore"
}