{
  "formatted_address": "727 Clementi West Street 2, #01-272, Singapore 120727",
  "geometry": {
    "location": {
      "lat": 1.3041998,
      "lng": 103.763811
    },
    "viewport": {
      "northeast": {
        "lat": 1.305813530291502,
        "lng": 103.7654731302915
      },
      "southwest": {
        "lat": 1.303115569708498,
        "lng": 103.7627751697085
      }
    }
  },
  "name": "High Power Departmental Store",
  "place_id": "ChIJ9y8_ZjAb2jERJf4c2wObLNI",
  "rating": 1,
  "reviews": [
    {
      "author_name": "인어",
      "author_url": "https://www.google.com/maps/contrib/114995793431716380116/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXDBcJ5nldhjCctqc3ixgs6N0P6nZvx149I_dOMvNnWWbisCQXG=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Brought my sample bulb  to buy a replacement bulb.\n\nWas served by a Chinese lady who took my sample and gave me the Philips bulb and said this is the same and can be used to replace.\n\nI told her my light is long using hand gestures to show how long it is and she insisted that it’s the same and would fit and replace it. I was grateful and so happy to finally find one shop that sells after two shop said they don’t have. (One is the shop further up from this shop).\n\nWent home, tried to fix into light, doesn’t fit. My family member tried, also cannot.\n\nWent back to return it, was turned down flatly by the male Chinese staff though I told him I provided sample bulb but his colleague sold me a wrong sized bulb. . He said no returns.\n\nAsked me to come back next day when the female is working.  I said I just need to change to a longer bulb and asked if he had one. He said they don’t sell.\n\nI told him to call his female colleague as she was the one who sold me the wrong bulb despite taking my sample bulb.\n\nAfter calling her, he said cannot change cos bulb is scratched?!? The bulb is not scratched but there are lines at the side (will not be exposed when fitted into light) cos me and 1 family member was trying to turn it into the light cos we trusted her when she said ITS THE SAME!\n\nReally disappointed with the lack of integrity.\n\nPlease be careful because even when you provide the the sample bulb, they can also give you the wrong one and ITS YOUR FAULT COS YOU TRUSTED THEM.\n\nPs: have been patronising for many years and this is what I get.",
      "time": 1715647725,
      "translated": false
    }
  ],
  "types": [
    "convenience_store",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15144650087803452965",
  "user_ratings_total": 1,
  "vicinity": "727 Clementi West Street 2, #01-272, Singapore"
}