{
  "formatted_address": "60 Springside Walk, #01-04, Brooks, Singapore 786020",
  "geometry": {
    "location": {
      "lat": 1.4050993,
      "lng": 103.8196331
    },
    "viewport": {
      "northeast": {
        "lat": 1.406302430291502,
        "lng": 103.8209356302915
      },
      "southwest": {
        "lat": 1.403604469708498,
        "lng": 103.8182376697085
      }
    }
  },
  "name": "Hiu Hiu by Siam Saap",
  "place_id": "ChIJ6XxV2TUT2jER5Dg3YXces2A",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Jacko Lim",
      "author_url": "https://www.google.com/maps/contrib/107002793625263735733/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLKLjSTrK59gySwRdECD8Nj3nYpjE997ceUVOEiEhixxcTdkQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "The food here is absolutely amazing! The pineapple fried rice was perfectly cooked, with juicy pineapple, tender shrimp, and just the right amount of seasoning. The tom yum soup had a bold, aromatic broth that was mild spicy, sour, and packed with fresh seafood. The green curry was creamy, rich, and vegetable dishes were tasty. Every dish was bursting with authentic Thai flavors — simply delicious from start to finish.",
      "time": 1745758212,
      "translated": false
    },
    {
      "author_name": "Sin Ee Toh",
      "author_url": "https://www.google.com/maps/contrib/111012911627974119892/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUqYl8VS042MH1-CTGCxjlZjKfRxA0LsMWX_OCq5972uDL_jk8W=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Chanced upon this excellent spot for authentic and delicious Thai cuisine. Every dish we tried was outstanding. The pineapple fried rice was perfectly balanced with sweetness and savory notes (bonus points for the generous portion of floss and cashew nuts!). The Phad Thai had just the right amount of tang and spice, the Tom Yum soup was refreshingly flavourful with a kick, and the green curry was so creamy, fragrant, and full of depth. Highly recommend for anyone craving a satisfying Thai meal!\n\n(The 5.0 stars reviews are definitely legit)",
      "time": 1742297296,
      "translated": false
    },
    {
      "author_name": "Florencia",
      "author_url": "https://www.google.com/maps/contrib/115760074205568746405/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUiz4iFsWmHbrZSvigjfk8h8f6onaWZQv9xxLg6Nxa6-o0V312q_g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "As a repeat customer, my experience at Hiu Hiu has only gotten better with each visit. This place has truly become one of my favorite spots for Thai food.\n\nThe atmosphere is always inviting and cozy, with the perfect balance of casual comfort and vibrant decor. Whether it's a quick lunch or a leisurely dinner, the ambiance sets the perfect tone for a great meal.\n\nThe service here is consistently excellent. The staff is always friendly, attentive, and knowledgeable about the menu. They’re happy to offer suggestions based on your preferences, which makes the experience even more enjoyable.\n\nNow, onto the food: I’m never disappointed. The dishes are full of authentic Thai flavors, and there’s a fantastic range of options for all tastes. The Phad Thai is consistently my go-to, perfectly balanced with the right amount of sweetness, spice, and tang. The portions are generous, and every dish is nicely presented.\nTo pair with my food, my favorites is their lemongrass drink, which I always order whether served cold for a refreshing pick-me-up or hot for a soothing, aromatic experience.\n\nWhether you're a first-timer or a repeat customer like me, I highly recommend Hiu Hiu for an unforgettable Thai dining experience. It's a spot that continually delivers both in taste and hospitality, and I look forward to my next visit ❤️",
      "time": 1740976101,
      "translated": false
    },
    {
      "author_name": "Eddie Sit",
      "author_url": "https://www.google.com/maps/contrib/114303931943494067190/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVz6AKkKhQJL1FDrxiN-9xtnVEZVsN5nV4JYZfSjGGUMnSb1SuynA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "One of the best Thai food I’ve had in Singapore. Been here multiple times to say that food is definitely consistent. The omelette is as close as you can get compared to very nice restaurants in Thailand. Green curry chicken is also very good.\n\nI also love the decor and the themed posters and the thoughtful designs!\n\nHighly recommended.",
      "time": 1732965600,
      "translated": false
    },
    {
      "author_name": "CY LEE",
      "author_url": "https://www.google.com/maps/contrib/112984011904456782246/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLXevcGOMisd8iwMYR8syY39E7A0pIGgC7H20EOLf1uXl3axw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I recently dined at here and was thoroughly impressed! The Thai-style omelette, Tom Yum soup, and garlic pork were all standout dishes that exceeded my expectations.\n\nThe atmosphere was cozy and intimate, making it a great spot for a night out with friends or family.\n\nOverall, I would highly recommend this restaurant to anyone looking for delicious and authentic Thai food in Singapore. The prices are reasonable, the portions are generous, and the food is simply amazing.",
      "time": 1733466767,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6967946546553239780",
  "user_ratings_total": 80,
  "vicinity": "60 Springside Walk, #01-04, Brooks, Singapore"
}