{
  "formatted_address": "11 Northshore Dr, Singapore 828670",
  "geometry": {
    "location": {
      "lat": 1.4150195,
      "lng": 103.8992514
    },
    "viewport": {
      "northeast": {
        "lat": 1.416752580291502,
        "lng": 103.9007133802915
      },
      "southwest": {
        "lat": 1.414054619708498,
        "lng": 103.8980154197085
      }
    }
  },
  "name": "HJ Bistro",
  "place_id": "ChIJ2ySmJuwV2jERnkYZuVdJevA",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Sandra Lee",
      "author_url": "https://www.google.com/maps/contrib/116165000050588647032/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVFJamNamaMAn54dXe1IYIpXsT0cz9rHwXNQs-rMP0RGDcKxLxaJw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Long story. Was here with my family to have dinner on a Thursday night. Wanted to order Coke and was recommended not to order it by the server because they serve their soft drinks from 1.5L bottles? Thats ridiculous for a bistro if you ask me. Nvm. We ordered some fried and stir fried dishes - lala was either overcooked or not fresh cuz texture was rubbery, Hokkien mee was bland, the only saving grace was their fried rice. Then came the satay which honestly made my blood boil. We received our order and started eating. Out of nowhere came a frantic looking lady who shouted that “her staff” gave the wrong order and we “took” her friends’ food in an accusatory tone. We were confused and puzzled because that’s our order, then she asked in a demanding way what flavour we were eating. Next moment she looked like she was about to snatch the plate from our table. In the end, the staff came over to clarify that the order on our table was indeed ours and the lady who appears to be the lady boss was mistaken. No apology no nothing. Is this how you treat your paying customers?\n\nAnd you know what’s the worst part? Lamb satay was served COLD. Lol.\n\nTo be honest the servers’ attitude was overall very pleasant.\n\nTLDR; food was mid, lady boss attitude’s worse. Do not recommend.",
      "time": 1743696507,
      "translated": false
    },
    {
      "author_name": "tan adam",
      "author_url": "https://www.google.com/maps/contrib/109188017494978942959/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUjDpCz8J5WRlMp8kPYgNrJBnYssxGSPhpk7FXnDpWdXaZOmADZ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Discover the ultimate dining and entertainment experience at this fantastic restaurant bar in Punggol!\n\nWith a vast array of mouth-watering dishes to choose from, you'll be spoilt for choice. I highly recommend the Gong Bao frog porridge, which was expertly cooked and absolutely delicious. And the best part? It's incredibly affordable, with 4 frogs available for just $30.\n\nBut it's not just about the food - this restaurant bar offers a wide range of activities to enjoy with friends and family, including pool, darts, and live music performances in the evening.\n\nThe overall atmosphere is really awesome! Whether you're looking for a night out with friends, a family dinner, or a fun outing with kids, this place has something for everyone.\n\nIf you haven't visited this restaurant bar before, what are you waiting for? Come and experience it for yourself - you won't be disappointed!",
      "time": 1739452112,
      "translated": false
    },
    {
      "author_name": "Karen Gads About",
      "author_url": "https://www.google.com/maps/contrib/113503192007654817905/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVkXw-3PJp4F15K6g2v9SUWUTMJgRuktDYTjG-ce1izYJYZWl1TgA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "8 months ago",
      "text": "A good live music place to chillax here! They've DAILY live performances every evening with endless canto/mando/eng pop renditions. Friendly singers who will frequently take song dedications too!\n\nTheir menu also very extensive here, not just finger snacks to accompany our beer pints/towers, they have everything from zichar to western & more!\n\nWe tried:\n• HJ Signature Fried Rice\nwhich has great wokhei + generous ingredients within\n• Claypot kungpao frog with porridge\nwhich was really flavourful & comforting\n• BBQ Sting Ray\nwhich has nice char on the fresh slab though I hope the sambal is more savory than sweet! Not a deal breaker tho & defo an enjoyable meal overall!",
      "time": 1726711691,
      "translated": false
    },
    {
      "author_name": "Freddy Kua",
      "author_url": "https://www.google.com/maps/contrib/112928888531363475275/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXRnqSHxv6Ti-2q-hOPX1sofp0q32GUp2HpipWjgzFUqay5TKds=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "2 years ago",
      "text": "This is a family friendly live music bistro with decent food and friendly ambience. It has an indoor and outdoor seating. Just a few steps away from a seafront promenade.\n\nThe pop corn chicken was my favourite. Chicken wings are quite plain like home cooked type. Food are ok, just not to expect fancy or exciting dishes or finger food. The draft beer was soothing.\n\nThe live band duo singer/band has good vocals, singing popular mandarin songs. The music volume was perfect, not scaring me away or stopped any conversation. Many live band places are just too loud for sanity or hearing health.\n\nSaw many tables with young parents and children when I visited, telling me it’s a good place for family to relax together.",
      "time": 1677487145,
      "translated": false
    },
    {
      "author_name": "Joanne Cheng",
      "author_url": "https://www.google.com/maps/contrib/110408957347137900620/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU69WnBz6UtQGAW_jdNBBB6Zg3Fs_bmPPs4FNhhaDrlYGsN99B2pg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "First time visit as celebrate hubby’s birthday. Nice environment and we chose air conditioned seatings. Live band start at 7.30pm and it’s daily liveband. Food is served pretty fast and we find the food not bad. Price is reasonable for 5 of us. We ordered fish and chip, chicken chop, stingray, pork satay set, 2 caborana, and the dessert. The live band music is not loud and just nice for catch up. It’s suitable for family or friends gathering. You can order liquor and have drink while enjoying live band. We will come back again.",
      "time": 1715084107,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17328243157377828510",
  "user_ratings_total": 612,
  "vicinity": "11 Northshore Drive"
}