{
  "formatted_address": "900 Bedok North Rd, Singapore 479994",
  "geometry": {
    "location": {
      "lat": 1.3417359,
      "lng": 103.9195389
    },
    "viewport": {
      "northeast": {
        "lat": 1.343057930291502,
        "lng": 103.9206521802915
      },
      "southwest": {
        "lat": 1.340359969708498,
        "lng": 103.9179542197085
      }
    }
  },
  "name": "HomeTeamNS Aqua Adventure",
  "place_id": "ChIJF246z5s92jERaMjvEMrNJlA",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "S H",
      "author_url": "https://www.google.com/maps/contrib/118339670979951913335/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLDxy-UQYLHSJBkCLHL7znEQv9A_EJEE8_fOPszbRAIEhunow=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Not bad, though if it's crowded, may be slow moving, but just be patient and wait for the staff lah. My kids love the rock climbing and obstacle course. Staff were patient and nice and were very safety conscious which is good. Many thanks to the ladies who attended to us like Christina and Kelly. They were lovely, polite and smiley, made the whole experience very nice. ❤️",
      "time": 1744968852,
      "translated": false
    },
    {
      "author_name": "Sarah Sandys",
      "author_url": "https://www.google.com/maps/contrib/117867554509069060119/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVd10CHGRtDq1RbQctzAyri0sfXgnvLCcmOhFCmN76gEvoaDdWG=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Compact set up but lots of fun. Two flumes where one is for inflatable rings, a high ropes course and climbing walls! Pool is small but sufficient to cool off. The staff are great, very health and safety conscious and I liked that they organised a group game similar to water polo in the middle of the session which was fun to join in with. Changing rooms were clean and the locker system was free and easy to use. Really good that you could wear a wrist band and go in and out all day on a public holiday so we took our lunch down to the reservoir and then came back in for a bit more fun. I imagine if it gets busy there could be a bit of waiting around but we arrived at 10am and did everything easily in a couple of hours with no queues.",
      "time": 1746094973,
      "translated": false
    },
    {
      "author_name": "gyn onc",
      "author_url": "https://www.google.com/maps/contrib/105718206286529538648/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL5oL0vuIsytDyetxaDTbKFCjnBQ9QpknCQg43G0OYsgJkmgw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Held a birthday party for my son on 29th Dec. Staff was very helpful and the room was very spacious! Thoughtful touches included shelves in room bags and swimming stuff; modular tables to arrange birthday cake/ food. The boys were guided through the activities by friendly specialists and throughly enjoyed themselves. Our booking was from 330-8pm and it was just enough for them to enjoy themselves doing all the different activities at the place. Although the venue is small, it is not crowded and the boys were looked after at all times. The briefing given for the obstacle course was very thorough and the specialist even demonstrated what to do if they accidentally slipped and how to use the harness to get back on the track.\nAs for the venue - the drop off area made it easy for the kids to be dropped off and picked up by parents for the party.",
      "time": 1735478988,
      "translated": false
    },
    {
      "author_name": "astronomy",
      "author_url": "https://www.google.com/maps/contrib/103598784307214259921/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVdPtI86qB2GF4nu06j3xKu1CfAuYN4dHYQeSvUBs9a4d2WfAsg=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "Pros:\n\n- The main best fact about this waterpark is that it is indoors, my skin burns under direct sunlight so it was great that I finally didn’t have to put on sunscreen and worry about my skin.\n\n- The staff are leaning towards kind and understanding, not super strict.\n\n- This park was built more towards children and family, if you are a thrill seeker and tall like me (192 cm) this waterpark is most likely not for you.\n\n- I like how they combined the concepts of high elements and water, the high elements I would say is quite fun.\n\n- I played Captain’s Ball and it was insanely fun especially because I was tall, but it only happened once, they should utilise the pool with more activities.\n\nCons\n\n- This is the biggest con, there is so little variety of slides. Two slides, a “level two” section, and a pool, that’s it. It’s honestly made for people who don’t mind the little variety.\n\n- The ticket is $30+, which I personally think is overpriced, I would say it’s worth more $15-20 instead. Quite expensive, so if you prefer thrill seeking I would still recommend you go WWW.\n\n- The high elements harness tend to be very rusty, if you rub your eyes instinctively or touch any wounds high chance you would get an infection of tetanus.\n\n- Imagine you came out of salty water, sweating, freezing, and you climbed a rope section that has mold and other people’s sweat and dirt. Not really hygienic in my opinion.\n\n- The “level two” section consists of the high elements, a rope section with elements, and a rock climbing section. The thing is they’re small and the rope climbing is really tight for people who are bigger and tall like me (192 cm), the elements was obviously designed for little children, so I understand that.\n\n- They should have more activities in the pool, maybe they could beg to differ.",
      "time": 1743405542,
      "translated": false
    },
    {
      "author_name": "Jeremy Jayden Liu",
      "author_url": "https://www.google.com/maps/contrib/103363976141669975429/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjULbnef1XE7KUzgKUe4QgaxGlb0ZHU-RF2udJo-Eiw0qjx_lyU=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Had great fun with kids! Good bonding time. Staff here are very friendly and helpful, will give introduction for every section.",
      "time": 1744964173,
      "translated": false
    }
  ],
  "types": [
    "amusement_park",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5775529839900477544",
  "user_ratings_total": 1845,
  "vicinity": "900 Bedok North Road"
}