{
  "formatted_address": "33 Mount Sophia, Singapore 228481",
  "geometry": {
    "location": {
      "lat": 1.3017837,
      "lng": 103.8470942
    },
    "viewport": {
      "northeast": {
        "lat": 1.303297630291502,
        "lng": 103.8486072802915
      },
      "southwest": {
        "lat": 1.300599669708498,
        "lng": 103.8459093197085
      }
    }
  },
  "name": "House on The Hill Mount Sophia - Montessori Pre-School",
  "place_id": "ChIJjd6bCb0Z2jERV8qR8X-FjlA",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Mark Toh",
      "author_url": "https://www.google.com/maps/contrib/106664504524976819986/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocINf8wh1l9BB69S9J256RjlIv2ymHsP6NG6SDa7pW8wqtWVnw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "House on the hill has looked after my 2 children from playgroup to K2. I have seen the school grow from strength to strength since 2016 and would like to commend them on their constant efforts to improve the curriculum and teaching methods especially in the area of Chinese. Would also like to give a shout out to teachers like Mr Sa, Ms Nash and the Chinese Language team for preparing my children for the rigors of the local education system.\n\nHouse on the hill has an excellent prep program to aid transition into the next school be it a local or international school. My children are currently doing well in local schools and have no difficulties coping with the curriculum.\n\nWould highly recommend HoTH regardless of whether your next stop is a local or international school :)",
      "time": 1735635968,
      "translated": false
    },
    {
      "author_name": "Nihala K V",
      "author_url": "https://www.google.com/maps/contrib/116068360883720485152/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLcn5H14tz0o5DOCvsybg-rF1hYzvpZ2259CNxHyD9Y3t6QMxGX=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "My daughter enjoyed going to House on the Hill everyday. It was here that  we first started drop offs and the teachers and staff  helped  with a smooth transition . She thoroughly enjoyed the activities at school.\n\nUndoubtedly the preschool helped build confidence in my daughter and she has been a little helper at home after she has learnt all the basic skills at school.The best part is that the kids get play time in the morning so that there is enough energy spent . Moreover , parents get to read a story for the kids which we think was so thoughtful.\n\nWe had to say goodbye to the school as we relocated and we realise  how much we miss House on the Hill .\n\nThank you so much House on the Hill team.",
      "time": 1732176534,
      "translated": false
    },
    {
      "author_name": "Hung La",
      "author_url": "https://www.google.com/maps/contrib/109093359283019701366/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIYlfs93DKVGPc4DH7-9fFFHzR0CIC2BP8Jsbioxrxh4I59fMLR=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "My daughter attended HOTH Mount Sophia for 4 years and loved every single moment of it. We couldn't have found a better school for our daughter, who had some speech developmental challenges in the early years, as she prepared for Primary school.\n\nWe always liked the Montessori method and it was definitely instilled at HOTH in everyday curriculum. We also liked the community that they built and my daughter continues to socialise with her \"lifelong\" friends made there.\n\nFrom the teachers to the staff that makes everything run smoothly, we couldn't recommend this school (HOTH) and campus enough.",
      "time": 1726126990,
      "translated": false
    },
    {
      "author_name": "Neal Jha",
      "author_url": "https://www.google.com/maps/contrib/111942901808390844064/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXOeQ-8z6rwFU_esDiHhfMQfSWCXRHTvfoiGFXRBg6HuVv7oHDb=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "Our daughter went to HotH for 2.5 years starting at 18months. We and she, had a lovely experience on all fronts. The engaging teachers follow the Montessori approach quite closely. The administrative team is always accommodating, responsive and ready to help.\nThe atmosphere is always warm and friendly, even during the difficult COVID years and the entire team really, genuinely cares about kids.",
      "time": 1720926098,
      "translated": false
    },
    {
      "author_name": "Theresia Mmasi",
      "author_url": "https://www.google.com/maps/contrib/111648900659938567526/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVDoFo8IBKv3WO92d-BU8jGCCAOsdRe6P9wupxtWuU82XLwJGU=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "We were specifically looking for a Montessori school and were not disappointed! House on the Hill made the transition seamless for us upon moving to Singapore. Aside from a fantastic menu, their facilities were incredible for a school situated in the city centre.\n\nThe classrooms were big, well ventilated, and had lots of light. Our child enjoyed being around the mix of kids from multi nationalities. We also appreciated that Chinese was present in the school environment as learning new languages is so important to us. By a month, our child was familiar with his classmates names, and was excited during drop-off.",
      "time": 1680688426,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5804723754287352407",
  "user_ratings_total": 22,
  "vicinity": "33 Mount Sophia"
}