{
  "formatted_address": "9003 Tampines Street 93, Tampines Industrial Park A, #04-192, Singapore 528837",
  "geometry": {
    "location": {
      "lat": 1.3399611,
      "lng": 103.9413186
    },
    "viewport": {
      "northeast": {
        "lat": 1.341198580291502,
        "lng": 103.9427620802915
      },
      "southwest": {
        "lat": 1.338500619708498,
        "lng": 103.9400641197085
      }
    }
  },
  "name": "HRD Professional Handyman Pte Ltd",
  "place_id": "ChIJ0Z_FvT492jERuaT5mKH7ncM",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Multazam Hj Mohamed Hassan",
      "author_url": "https://www.google.com/maps/contrib/105794805467148176950/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLpAu4bNggY-zdVveP0wlCp8gxenVNEVBH_T3KsU2AKVzQXdw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "I wanted to extend my heartfelt thanks to Mr Raye, my ex- polytechnic mate & your workers for the incredible job. We couldn't be happier with the results. Your professionalism and dedication to your craft were evident throughout the entire process, and we are grateful for your expertise and hard work. We will certainly be recommending your services to our friends and family.",
      "time": 1722743369,
      "translated": false
    },
    {
      "author_name": "Mary Ann",
      "author_url": "https://www.google.com/maps/contrib/103078576893150266714/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocICRQ3onsQCINnHsCVZZ__kAtkzIqkWmP7BI9mwCIPAOKy60w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "A big thank you to Mr Thann and his team from HRD. My kitchen cabinet and wardrobe looks new and beautiful. He is meticulous and fast at his work. Reliable, resourceful and helpful.\nCommend Ms Ng for her professionalism and patience.\nMr Raye had sound advice and tips.\nThankful for their willingness to do small jobs that many contractors would rather not do.\nRegards,\nMr & Mrs Justin",
      "time": 1743316395,
      "translated": false
    },
    {
      "author_name": "April Lai",
      "author_url": "https://www.google.com/maps/contrib/111707133099921828069/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXOOCDitBGzrhK9JuLVxUVxCBFc6Is3l-8Mptu2KgG6fkZM_-nl=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "We had a great experience with HRD Professional Handyman Pte Ltd and their team, including Ms. Ng, Mr. Raye, and Mr. Thann. They were helpful, made sure everything was clear, and provided valuable advice for my home renovation. It's wonderful that my renovation journey went smoothly. We were happy with their service, it's a fantastic idea to recommend them to our friends and family. Good communication and expert insights can make a big difference in a home renovation project!\nMany thanks to Ms Ng, Mr Raye and Mr Thann!!!",
      "time": 1694139487,
      "translated": false
    },
    {
      "author_name": "Walter Goh",
      "author_url": "https://www.google.com/maps/contrib/110009334682302364979/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL0eIVKpmX-w2ZHCBg9npSVomcsa7cM5HVFFSFOPrAOd3L2Ww=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "The team of Mr.Raye, Ms Ng, Mr. Thann was professional from day 1. The site survey was conducted by Mr. Raye with confidence and experience. Good suggestions were raised and realistic timeline was given. The work was challenging and I have even drew up a project plan with some buffer. The team finished the job on time! The price was reasonable and the quality of work was great! The team knows their job well and the whole experience was great! Will recommend to my friends and family for sure! Tks again to Mr. Raye and team for ensuring I can move on time and with no worries!",
      "time": 1690196329,
      "translated": false
    },
    {
      "author_name": "Samantha Lin (Sammie)",
      "author_url": "https://www.google.com/maps/contrib/109496834083251821799/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUymhs7_iTEFa-dHTXU0pM_NWAxO3KYqJ6gBhK2IrGv2b-1pg1GeQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "My kitchen tiles popped and I was looking for handyman services. Compared at least 4 to 5 companies and decided to go with HRD. Raye came for site survey and he is professional, patient and honest.\n\nInitially we thought it’s just simply removing the popped up tiles. However Raye prep us that there’s a probability that the other tiles will start loosening once they start remove the damaged ones, especially when there’s a lot of hollow tiles. He cannot tell us how much will be removed, it will depends on the situation. In the end 3/4 of the tiles were loosen during the removal, so we decided to remove all and replace with vinyl tiles. At the same time, we get them to replace our basin, mixer, toiletries tray, bidet hose, toilet roll holder and assemble one set of Ikea shelf.\n\nRaye also mentioned that their handyman are their own staff hence there will be no sub-contractors. On top of that, they are HDB licensed and BCA registered contractors (important to know if you are going to do flooring works). Jaherul and Muru are the 2 main handyman onsite throughout, Raye will come by to help them before he heads to other jobs. Thanks to other guy who came to help with the cement screed. All works are done in 3 days!\n\nThe quoted price is reasonable, after seeing their work, it is really value for money. They will also be doing some works at my in-laws place in the coming weeks. Definitely recommend them and will find them for future works.",
      "time": 1599792527,
      "translated": false
    }
  ],
  "types": [
    "painter",
    "electrician",
    "plumber",
    "home_goods_store",
    "general_contractor",
    "store",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14095699080214324409",
  "user_ratings_total": 207,
  "vicinity": "9003 Tampines Street 93, Tampines Industrial Park A, #04-192"
}