{
  "formatted_address": "Blk 269A Punggol Field, #01-197, Singapore 822269",
  "geometry": {
    "location": {
      "lat": 1.4032487,
      "lng": 103.8989162
    },
    "viewport": {
      "northeast": {
        "lat": 1.404556730291502,
        "lng": 103.9002228802915
      },
      "southwest": {
        "lat": 1.401858769708498,
        "lng": 103.8975249197085
      }
    }
  },
  "name": "Huang Hong Ji Porridge",
  "place_id": "ChIJq0v2SOIV2jERdkRvrmfyeY4",
  "rating": 3.9,
  "reviews": [
    {
      "author_name": "Jason Ng",
      "author_url": "https://www.google.com/maps/contrib/103405563195010248727/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVVAXytrk16qxTdaX95b2fEiM3PpX_2o8x5C2LPZhghI-0smRvP=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Best canto porridge you can get in Punggol. Well cooked and good consistency. Always have the signature as the ingredients are all nice. Condiments of spring onions and ginger Are enough to always refresh the palette.",
      "time": 1738578869,
      "translated": false
    },
    {
      "author_name": "oXRYSTALo Ong",
      "author_url": "https://www.google.com/maps/contrib/114556064085815871377/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSTtKcF9FYMbh-XNbDu8f7Whl3gi-ZY6T8pFPOm3v9Y98Ws7jL=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "Alright, folks, listen up! Donkey and I have been regulars at Huang Hong Ji Porridge for a while now, but this time we decided to write a review to share our experience. We usually visit during the weekdays when it's less crowded, but today we went on a Sunday morning at 10:00 am. We were surprised to find a long queue - I am fifth in line, but the queue stretched out to 10-20 people behind me! It seems like many people were buying 4-5 portions of porridge for their families. The wait was definitely longer than we expected, even though there were only 5-6 people in front of us.\n\nWhat We Loved:\n\n• The Porridge: The porridge is their main highlight! We usually get the minced meat and century egg porridge. They don't come with minced meat, but with meatballs. I don’t like meatballs, so Donkey usually tries to convince me that they're similar to minced meat by mincing them up for me.\n\n• The Yam Cake: Today, we also tried their yam cake, which is available only on Saturday & Sunday. It comes with a delicious orh kueh sauce, chili, and it's so flavorful and nice. It was served cold, but I was afraid it would sell out because I really wanted to try it. Luckily, we managed to get one.\n\n• The Service:  While the wait was a bit long, we were impressed by the friendly service. There's a very helpful uncle who manages the crowd and helps set up tables for customers. He even makes sure you have a seat before taking your order, which is a thoughtful touch. He does a great job of ensuring the queue moves smoothly and efficiently, even if he doesn't take orders in advance.\n\n• The Value: The pricing is also very reasonable for the coffee shop.\n\nWhat We Didn't Love:\n\n• The Wait: The wait was definitely longer than we expected, even though there were only 5-6 people in front of us.\n\n• The Economic Beehoon: We tried the economic beehoon on a previous visit, but it was just okay, not our favorite.\n\nDonkey's Take: The yam cake was delicious!  I'm glad we waited in line for it!\n\nMy Take: The porridge is good, but I prefer minced meat over meatballs.\n\nRating:\n\n• Food: 4/5 (Delicious porridge and yam cake)\n\n• Service: 4.5/5 (Friendly and helpful)\n\n• Atmosphere: 3/5 (Cozy coffee shop setting)\n\nOverall:  4/5\n\nOur Verdict: The porridge is usually a hot favorite among residents, and the food is good overall. The porridge is served hot, and while it's not the best we've ever had, it's still acceptable. If you're looking for porridge near Punggol, this is a good option as there aren't many other porridge stalls around. However, be prepared for long queues on weekends, and it's best to go during the weekdays if you want a faster experience.",
      "time": 1730617008,
      "translated": false
    },
    {
      "author_name": "Doraemon",
      "author_url": "https://www.google.com/maps/contrib/112665277904119154671/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX2VSCcaT9axvOwx2nD8XD3PgZ8V5VFnv420aocMSfLa6GlcEmN=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "Kitty and I have been regulars at Huang Hong Ji Porridge for a while now, but this time we decided to write a review to share our experience.  We usually visit during the weekdays when it's less crowded, but today we went on a Sunday morning at 10:00 am.  We were surprised to find a long queue—Kitty was fifth in line, but the queue stretched out to 10-20 people behind her!  It seems like many people were buying 4-5 portions of porridge for their families.  The wait was definitely longer than we expected, even though there were only 5-6 people in front of us.\n\nWhile the wait was a bit long, we were impressed by the friendly service.  There's a very helpful uncle who manages the crowd and helps set up tables for customers. He even makes sure you have a seat before taking your order, which is a thoughtful touch.  He does a great job of ensuring the queue moves smoothly and efficiently, even if he doesn't take orders in advance.\n\nHuang Hong Ji specializes in porridge and economic beehoon, and they are the main attraction in this tiny coffee shop.  The whole place is really small, just this stall and a drink stall, and it's located right below a HDB block.  The coffee shop is simply renovated, but it's still cozy and has a nice, homey feel.\n\nWe tried the economic beehoon on a previous visit, but it was just okay, not our favorite.  However, the porridge is their main highlight! We usually get the meat ball and century egg porridge.  They don't come with minced meat, but with meatballs.  Kitty doesn't like meatballs, so I usually convince her that they're similar to minced meat by mincing them up for her.\n\nToday, we also tried their yam cake, which is available only on Saturdays and Sundays. It comes with a delicious yam cake sauce, chili, and it's so flavorful and nice.  It was served cold, but Kitty was afraid it would sell out because she really wanted to try it. Luckily, we managed to get one.\n\nThe porridge is usually a hot favorite among residents, and the food is good overall.  The porridge is served hot, and while it's not the best we've ever had, it's still acceptable. If you're looking for porridge near Punggol, this is a good option as there aren't many other porridge stalls around.  The pricing is also very reasonable for the coffee shop. The service, while a bit slow on busy days, is friendly and helpful.  However, be prepared for long queues on weekends, and it's best to go during the weekdays if you want a faster experience.",
      "time": 1730616160,
      "translated": false
    },
    {
      "author_name": "HP Tan",
      "author_url": "https://www.google.com/maps/contrib/110934298946011370634/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUVL23R8lskZJxR3Zod_sdqm7spXJuUfHxFQufLeL2PF89ec44d=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "5 months ago",
      "text": "Used to patronize this stall. But notice lately their queue is getting shorter and not so popular as it used to be. I cut down patronizing them because the stall is filled with angry and unhappy people servicing. Rude, loud and angry (especially if you bring your own container or added ur own eggs in the container). The food is so so and the Chee Cheong Fan is not as nice as it used to be. Probably changed supplier . It’s not as silky smooth. Fish porridge is filled with bones.",
      "time": 1734489371,
      "translated": false
    },
    {
      "author_name": "KKT",
      "author_url": "https://www.google.com/maps/contrib/110399770588752359508/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWe8ewYYCASou-y-fvUVRGOO7Wv_u40R-JimqVNb3qzZ_1oCmjRWA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "The chee cheong fun here somehow is simple but always taste nice, I don't find any better ones for this type. Porridge looks plain but tasty, the typical dishes also look normal but tasted well. Likes their chillie sauce, soak yr fried chicken or fish fillet in it, reminds me of my primarys school canteen 30+ years ago. 😆",
      "time": 1705726675,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10266503352689837174",
  "user_ratings_total": 673,
  "vicinity": "Blk 269A Punggol Field, #01-197"
}