{
  "formatted_address": "6 Raffles Blvd, #02-100 Marina Square, Singapore 039594",
  "geometry": {
    "location": {
      "lat": 1.2923886,
      "lng": 103.8565709
    },
    "viewport": {
      "northeast": {
        "lat": 1.293843580291502,
        "lng": 103.8577747302915
      },
      "southwest": {
        "lat": 1.291145619708498,
        "lng": 103.8550767697085
      }
    }
  },
  "name": "HWA International School @MSQ Campus",
  "place_id": "ChIJE7RLsfsZ2jERp5PwghqCuls",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Hannn",
      "author_url": "https://www.google.com/maps/contrib/116822212427919904090/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKYdlwmc8FtRaic3ZrBETLCBP_Jhyz0cLu0N-qsymkC1Y9lkA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "The facilities are impressive!\nThe classrooms, science labs, and sports areas are all modern and well-maintained.\n\nThere’s a great emphasis on safety and security, which gives us peace of mind.\n\nAs international students, my child felt welcomed from day one, with orientation programs that helped my kid adapt quickly.👍",
      "time": 1729928704,
      "translated": false
    },
    {
      "author_name": "Christine Zhang",
      "author_url": "https://www.google.com/maps/contrib/112295647686780772576/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ45mCnfsU4PLhXBD0gRyn78RL5oVXHpoDfUgK8OExm1R0lRg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "\"We couldn’t be happier with our experience at HWA International School. The bilingual program is exceptional, allowing our child to excel in both English and Mandarin. The staff’s dedication to fostering a well-rounded, inclusive atmosphere has truly enriched our child’s learning journey. Highly recommended for families who value bilingual education!\"",
      "time": 1734660172,
      "translated": false
    },
    {
      "author_name": "Taiguo Liu",
      "author_url": "https://www.google.com/maps/contrib/105385220994830150038/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLW3Yql0IZO-8wFh7OG96L35alYaxbPUHZNQapKPfX4PWrywQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "My son studied at Hwa International School Marina Square. The school offers a supportive environment that balances academic excellence with the holistic development of students. The dedicated faculty and innovative educational programs motivate students to excel academically and develop a sense of global citizenship. The emphasis on cultural diversity and a wide range of extracurricular activities creates a dynamic learning community where students can flourish. We have seen significant positive changes in our son’s academic performance and personal growth since joining the school.",
      "time": 1722435823,
      "translated": false
    },
    {
      "author_name": "Ivan Yee",
      "author_url": "https://www.google.com/maps/contrib/104802946052624345942/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV2uulx5COuCcsh7UrZV93O3aUhXIz3fZVVIuzepn2S9J8rTOAX=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "My child has had a wonderful experience at Hwa. The teachers are really caring and attentive, always making sure the students are well looked after. Since joining, my child’s academic performance has significantly improved, which I’m really happy about. The supportive environment at Hwa has truly made a positive impact on our lives. Highly recommend this school!",
      "time": 1719886567,
      "translated": false
    },
    {
      "author_name": "吴知之",
      "author_url": "https://www.google.com/maps/contrib/103498360288760939811/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLgqHnfF7qvbya4ZOEuvhRhatkra6Y4oXjYVVI6IJ309Z4GiA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "HWA INTERNATIONAL SCHOOL is located in the most central area of Singapore, which is home to the financial center, cultural center, and tourism center. It is adjacent to the F1 racetrack and has the quickest access to the seaside. Therefore, studying here allows one to experience the rich national characteristics of Singapore and the convenience of multicultural exchanges where people from all over the world gather. HWA provides an education philosophy that keeps pace with the times, and my child can learn many realities here that cannot be experienced from textbooks. This is what we often say, reading thousands of books is not as good as traveling thousands of miles, and practice is the ultimate goal of learning. HWA offers an excellent team of teachers who will tailor the best learning plan for my child, allowing them to start from their own interests and love learning from the heart. HWA also has multiple campuses, providing a comfortable classroom environment for students of different ages. Most importantly, I feel that the team of HWA school is dedicated to education, and this lifelong career philosophy is the source of the school's long-term progress. For those interested in understanding Singapore's education and receiving education in Singapore, I highly recommend it.",
      "time": 1727336211,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6609738453497189287",
  "user_ratings_total": 53,
  "vicinity": "6 Raffles Boulevard, #02-100 Marina Square"
}