{
  "formatted_address": "6 Irrawaddy Rd, Singapore 329543",
  "geometry": {
    "location": {
      "lat": 1.3262077,
      "lng": 103.8456258
    },
    "viewport": {
      "northeast": {
        "lat": 1.327614180291502,
        "lng": 103.8470614302915
      },
      "southwest": {
        "lat": 1.324916219708498,
        "lng": 103.8443634697085
      }
    }
  },
  "name": "ibis Singapore Novena",
  "place_id": "ChIJL4rX8d8Z2jERuW0CLTq4ybI",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Juvita M",
      "author_url": "https://www.google.com/maps/contrib/115797796363835288345/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXRcl1dj5Y_xVaDyqHRISqzSqvndc377EF4V1XmOWBcNJfl33eE=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 4,
      "relative_time_description": "3 weeks ago",
      "text": "Overall, Ibis Singapore Novena is a pleasant place to stay. The receptionist was friendly, and both the check-in and check-out processes were smooth. However, communication during busy hours could be improved. I tried reaching out via phone and email to request a 30-minute late check-out, but didn’t receive a response until shortly after I arrived back at the hotel, which made the return a bit rushed. With better responsiveness, the overall experience would have been even better.\n\nOne thing to note: the rooms are not very soundproof, so it might be less suitable for very light sleepers.",
      "time": 1745812352,
      "translated": false
    },
    {
      "author_name": "Yusuke Iwase",
      "author_url": "https://www.google.com/maps/contrib/108391995438947452277/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWeGrZg5a_r1sxYlGcVVkU4VzcxKepfKbSDAag4rjl-P0wfPhkGlg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "2 weeks ago",
      "text": "Good rooms and bad rooms are clearly separated in this hotel.\nBalestier road side has a nice view, but on the other side, there is no privacy at all due to the condos.\nThe building is old but well cleaned.\nWhen we stayed at the hotel, there were many tourists from India staying there.",
      "time": 1746522658,
      "translated": false
    },
    {
      "author_name": "Jatin Lamba",
      "author_url": "https://www.google.com/maps/contrib/102065319003365465037/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVApG63AgHKevdcGXKib-RH9_xtBpXOA347QUTUB8HtULQf6DPd=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Very nice Hotel in a calm and an upmarket location in Singapore.  Hotel Staff is very hospitable and quick in response.  Rooms are very nice with all requisite amenities for a comfortable stay.  Buffet Breakfast offers a wide variety of good food to cater to food habits and tastes of international guests from across the globe.  Have taken wonderful memories of our stay in Ibis Novena.",
      "time": 1743930379,
      "translated": false
    },
    {
      "author_name": "Sze Mei NG",
      "author_url": "https://www.google.com/maps/contrib/110691822088620237996/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ2tFTVB9FZquZudejFEwbjrqcwLNQov7zOp6MiKlqtEEpBsw=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "3-starred Hotel\n26 February - 1 March 2025\n- Location: 9 minutes walk uphill downhill from Novena MRT station.  Very close to bus stops (multiple bus routes) on Balestier road. Bus is better transportation. Different hospitals/health centres, shopping malls, and temples around this area. --- 7/10\n\n- Lobby and common area: Small lobby as the old fixed structure of the building. There are only 4 chairs besides the big vase and the entrance. Old style of interior design. The corridor, carpet and wall are a bit old. --- 6.8/10\n\nFront Desk Staff: nice, helpful, flexible, effective, polite, and welcoming. Early check is possible depending on the availability. We checked in at ~9:30 and got a room that someone had cancelled.  Arranged late checkout (12n -> 2pm) for us. --- 7.5/10\n\nFacilities : Only one small restaurant  \"Oopen\" provides welcome  drinks, breakfast  buffet, and lunch (nice and efficient staff).  Fee Payable Self-help laundry on 10 floor. A water dispenser besides the lifts provides cold and hot water. Free WiFi. Free carparks--- 7/10\n\nRoom: 10/F with expansive street view only. Typical Singapore IBIS interior design. Larger and more comfortable than IBIS in Japan. Air-conditioned. Only heard some people moving (very low voices) in the corridor occasionally. More space for us to place our luggage than other ibis hotels.  No carpet, have a small area of water strain on the floor near the bathroom.\n*Bathroom with towel racks and a hair dryer. The shower with a 3 in 1 showergel, sink, and toilet functioned well. Needed to take a shower carefully to avoid flooding or leaking.\n*No drawers like other Ibis hotels. There are TV (various languages channels, TV programs from various countries), desk, mimi sofa, digital safe, iron, kettle, and mini fridge. Provided slippers and limited sachets of intant coffee and tea bags. Ask front desk staff for amenities if needed. Comfy beds with one pillow for each bed. An extra quilt on the shelf.  --- 7.3/10\n\n- Housekeeping: Polite smiling staff. Effectively do the bed making and clean floor. Changed towels daily. refill sachets of coffee or tea. --- 7.7/10",
      "time": 1742117952,
      "translated": false
    },
    {
      "author_name": "Cristian Mapa",
      "author_url": "https://www.google.com/maps/contrib/108724982549014725797/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXDLcj2178XPbvi-6rt_fzOS5CH3zn-HPrywSckEgsgiHDWXS13=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "As a member of the All Accor community, I always make it a point to book hotels within this group, thus during our family trip to Singapore, I booked in Ibis Singapore Novena. The room is reasonably enough or sufficient for a family of 3. Coffee and tea were provided and filtered water dispensers are provided on every floor which was really nice. The shower was also okay with dryer provided. Facilities wise, location wise, we loved it here. What maybe something that needs to be considered in the future is how \"friendly\" and \"accommodating\" the reception staff are. When we checked in, although it was in the middle of the night, the receptionist was not the friendliest. Working in a hospitality business would also require friendliness and should accommodate the guests well. Overall, we liked it (will probably book again if we ever visit Singapore). Though room is quite expensive (even more expensive that the rates in Europe, at least for Ibis level) but it's Singapore so it's a bit expected already.",
      "time": 1738752695,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12883030769072762297",
  "user_ratings_total": 2733,
  "vicinity": "6 Irrawaddy Road"
}