{
  "formatted_address": "50 Jurong Gateway Rd, #B1-01 Jem, Singapore 608549",
  "geometry": {
    "location": {
      "lat": 1.3334715,
      "lng": 103.7430161
    },
    "viewport": {
      "northeast": {
        "lat": 1.334391280291502,
        "lng": 103.7445874302915
      },
      "southwest": {
        "lat": 1.331693319708498,
        "lng": 103.7418894697085
      }
    }
  },
  "name": "Ichiban Boshi (JEM)",
  "place_id": "ChIJn8GaAw8Q2jER9hdThzT0Mf4",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Joel Ng",
      "author_url": "https://www.google.com/maps/contrib/109667459538364189257/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVO5SGjc7iwuB8JPtu6XNRM1F5cw0CATtvRLubxAGCBROgkQxE=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "4 months ago",
      "text": "Extremely disappointed. The prices are not equal to the quality of food, service, or atmosphere.\n\nFood quality:\nFood quality is average, around same taste as the Japanese food in food courts.\n\nAlternatives:\nFor Japanese food and sashimi, try bento and sushi sets from Fairprice or Donki. If you are in the mood for tonkatsu, consider Tonkatsu by Ma Maison @ Westgate that offers unlimited rice(brown and white), soup and finely sliced raw vegetable salad with unlimited condiments (sauces for the salad). Compare that to ichiban which charges 3 sgd for a small bowl of white rice.\n\nService:\nThe poor staff are squeezed to the brim by the upper management in pursuit of greater profits for RE&S group. Understaffed, and even the manager is helping out with chores around the restaurant. Had to attract the attention of staff to even get basic service, otherwise it is basically the same as self service at the food courts.\n\nAlternatives:\nIf you are looking for attentive service, consider din tai fung. Din tai Fung staff are busy but they hire way more people and their staff are much better trained. Whenever they see your tea cup empty, they will approach your table and offer to refill it, even if you are sitting at a corner. Staff is extremely attentive and friendly and despite the recent increase in prices, they have maintained their excellent service. Compare that to ichiban where you have to attract the attention of the staff to receive even basic service, it is literally food court with restaurant pricing at ichiban.\n\nAtmosphere:\nReasonably nice decor and general clanking of dishes is to be expected of restaurants around this price range.\n\nAlternatives:\nAny restaurant. Din tai Fung has nicer decor, Xiang Xiang has free flow ice cream and snacks.\n\nI will be avoiding all restaurants under RE&S due to their exploitative business practices of seeking profit at the expense of the consumer and workers. Won’t be returning.",
      "time": 1735741376,
      "translated": false
    },
    {
      "author_name": "樱木花",
      "author_url": "https://www.google.com/maps/contrib/103988529191663290937/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWjy5ah7OFhTiKGlcSOs_sZT9_CIwiXAfFC1787WarSQSO2zjg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Came here for Japanese late lunch. Non peak hour at about 230pm.\nHad smoked moriwase, pork bowl and katsu bento. Food was really tasty.  Order ocha hot or cold and it’s refillable.\nTuna sashimi wasn’t available. But the sashimi we ordered was good. Could taste the smoked  flavoured.",
      "time": 1737690178,
      "translated": false
    },
    {
      "author_name": "Dyan Goh",
      "author_url": "https://www.google.com/maps/contrib/112236214418326312846/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK0SeUUw_elBnCQeISveKK--P0mlUE1UX0dAyoEcb7TUHJRDw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "Wanted to rate 0/5 stars but Google does not allow.\n\nOrdered a takeaway for a platter of sushi (includes some raw toppings as well) and 3 set of sashimi, total price was $91.12. Lady staff told us that the wait will be about 15 minutes for the sashimi and will bring our order to us once done.\n\nOur platter of sushi was left on a table behind the counter with no ice pack or even placed in the nearby fridge while waiting.\n\nWaited over 20 minutes, walked over to the collection table area to check and our 3 set (15 slice) of sashimi was not done yet. Our platter of sushi still sitting on the table.\n\nAfter 30 minutes, went up to the counter to check with the staff again and our takeaway was done and sitting at the collection table.\n\nReally horrible service. I expected that all Ichiban Boshi would have the same standards throughout all their branches. But my experience here at JEM was super disappointing. Not one of the words stated by the staff were true.\n\nWhen we collected our order, the platter was no longer cold and it was at room temperature. Additionally no ice pack were given, only 1 was inside the sashimi. The sashimi for the swordfish (5pc, white colour) was also very thinly sliced not worth a $21.80. No apologies were said as well. Hopefully we do not get any stomach issues after eating.",
      "time": 1735046555,
      "translated": false
    },
    {
      "author_name": "Giselle",
      "author_url": "https://www.google.com/maps/contrib/109870691315767875090/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL-1KXC2GPXBzKpcB8nE81Nlb1OgipBbYyn2-_gldCnV4GE2Q=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "\"You can often judge the quality of Japanese food by their pork katsu don,\" Christopher Whistopher 2024. Ichiban Boshi is an OG Japanese restaurant as I have fond memories of enjoying their dishes years ago. Unfortunately, they’ve lost a bit of their magic. The pork katsu don is decent, but nothing remarkable. My favorite, the chicken nanban, is still delicious, but it didn’t quite live up to the nostalgic flavor I remembered. That said, they remain one of the better spots for Japanese cuisine in my book.",
      "time": 1732883287,
      "translated": false
    },
    {
      "author_name": "L",
      "author_url": "https://www.google.com/maps/contrib/104175188433964634269/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX3VlJ6-3X4GpdA4kPkCTrU85Q5p83JCmtwkFy0Q831TVEWl3Mb=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "If you’re looking for variety and quality this is somewhere there and price is pretty fair too.\n\nMost important the kids fed themselves.\n\nStaff was attentive and service was speedy.\n\nWill visit again.",
      "time": 1737688284,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=18316689665938364406",
  "user_ratings_total": 603,
  "vicinity": "50 Jurong Gateway Road, #B1-01 Jem"
}