{
  "formatted_address": "517 Jurong West Street 52, #01-101, Singapore 640517",
  "geometry": {
    "location": {
      "lat": 1.3457809,
      "lng": 103.7197873
    },
    "viewport": {
      "northeast": {
        "lat": 1.347050430291502,
        "lng": 103.7211747802915
      },
      "southwest": {
        "lat": 1.344352469708498,
        "lng": 103.7184768197085
      }
    }
  },
  "name": "Icon Medical",
  "place_id": "ChIJg11xfd0P2jERFegJb3S25go",
  "rating": 3.3,
  "reviews": [
    {
      "author_name": "Isabella Ren",
      "author_url": "https://www.google.com/maps/contrib/107554396773268949429/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKl2lbcDhudRolTXPypIg5SIdIUbxg6QNJJdZsajQxNEkp4xg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "7 months ago",
      "text": "Went there for a skin checkup since apparently the doctor is an expert in the field, was given 2 bottles of the clinic’s own medicine product with spelling mistakes and contradictory instructions. Medicine didn’t work (which itself is ok, happens sometimes), but the instructions just sounded so unreliable.\n\nA separate issue: my mom went there for some skin irritation and the doctor went to call the next patient hastily without listening completely to what she had to say. They gave her a cream which actually worsened the swelling. Guess we are never going back again",
      "time": 1729501877,
      "translated": false
    },
    {
      "author_name": "Leon Ng",
      "author_url": "https://www.google.com/maps/contrib/117341377061553137605/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLCE7hvI3jsjYfzu0k9QomPzexNblh2f0XUkRo8R91QoC17ug=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Do not ever visit this clinic. Dr is highly unprofessional, rude and impatient. Just read what other people comment here will suffice. You are warned.",
      "time": 1741410396,
      "translated": false
    },
    {
      "author_name": "A FY Ou",
      "author_url": "https://www.google.com/maps/contrib/113964685765269639953/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIUGpDRW_atYt8xLafeICQHGF2nc_A638zJTsosyEArulNdrA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Did not provide GPfirst form to refer my 75 yr old mom who is having high fever for several days to hospital. Instead, prescribed a whole bunch of medication and changed her an exorbitant $60+ (after pioneer generation subsidies) for fever/ vomiting/ diarrhea.\n\nEven when I called to inform that my dad has been diagnosed with dengue, doctor was unwilling to refer and instead asked me to bring my mom back to clinic for blood test (results would only be out at night & we were having this convo at noon time).\n\nI insisted to be referred and he only gave a generic memo to my mom and charged her $10 for the referral memo to a&e.\n\nWhen we reached hospital a&e, the staff informed that the generic memo is not GPfirst referral so we could not get the $50 off. I called the clinic again and finally the doctor agreed to issue the GPfirst referral. But he made it clear that his view is that there is no need to refer her and I am the one who wanted the referral form. He also said that a&e will not admit my mom.\n\nAnyway in the end it got busy at a&e as my mom was put on drip and admitted IMMEDIATELY. So I didn't go back to the clinic to pick up the form. In the end, my mom was warded for 6 nights in the hospital!",
      "time": 1714370893,
      "translated": false
    },
    {
      "author_name": "kl k",
      "author_url": "https://www.google.com/maps/contrib/107662342525466061232/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLeCzmDX8P92Yh-yj_4wZyjm6v0A5Ul6hFWVXVJ8FD_EVmlhQ=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "a year ago",
      "text": "Have been to several clinics around the area, but this is definitely one that i will not re-visit again. Doctor speaks with a condescending tone and shows the slightest empathy. I do not want to dismiss that there are reviews that state that the doctor is good, but seeing the bad reviews here definitely is an echo of my experience. I hope its just a bad period that the doctor has where the bad reviews are coming in, and i do hope things change for the better!",
      "time": 1708953591,
      "translated": false
    },
    {
      "author_name": "yahuei Lee",
      "author_url": "https://www.google.com/maps/contrib/100878290380677760894/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKhiGAUkRS3dniGhEN7MReEnd3VYEkbYVjyzvh4GoyYeAd5Vg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "We usually go to other clinics around this area , however this is very few that open on Sundays so we had to visit this one yesterday. My child was prescribed with antibiotics. However , when it’s time to take medicine, I carefully read  the pamphlet of the medicine and realised we were not given enough medication for the entire antibiotics course. I had to go back today to check with them . At first they told me it was right amount , then I questioned them it should be at least 5-7 days and you only given me 3 days which may very likely to cause the reoccurrence for the symptoms. Then they reluctantly agreed to give me another bottle . Then they had the audacity to ask me to pay again for register fee.I told them I refused to pay for their mistake then they let up . I could not believe what happened and told one of the friends in the same condo ., then she told me they went there once and came home found out they were given expired medication ! This clinic is sketchy as hell . AVOID THIS CLINIC AT ALL COST !",
      "time": 1711330359,
      "translated": false
    }
  ],
  "types": [
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=785515796218112021",
  "user_ratings_total": 63,
  "vicinity": "517 Jurong West Street 52, #01-101"
}