{
  "formatted_address": "9 Lock Rd, #02-21 Gillman Barracks, Singapore 108937",
  "geometry": {
    "location": {
      "lat": 1.2783029,
      "lng": 103.8043741
    },
    "viewport": {
      "northeast": {
        "lat": 1.279570880291502,
        "lng": 103.8056558302915
      },
      "southwest": {
        "lat": 1.276872919708498,
        "lng": 103.8029578697085
      }
    }
  },
  "name": "Ida's Bar",
  "place_id": "ChIJ33F055Mb2jER92X9Ap_-Pdo",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Janice Lee",
      "author_url": "https://www.google.com/maps/contrib/106560684916099273567/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXQf-OHJi6CmZ_ZCgS1ck62TLUXsdPM_tA8CZ1BYdORFLFtMt4R7g=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I had just discovered the Dempsey of the South, which is Gillman Barracks! And Ida’s Bar is right in the middle of this quaint place of scenic nature. Walking to the Ida’s Bar during the cool evening or night is an enjoyment in itself, where I am surrounded by lush greenery and cool breezes.\n\nIda's Bar has this idyllic, rustic, nature-embracing feel with the lots of potted plants, clay potteries, rattan chairs, wooden furniture and lots of amber transparent bowls with candle lights. Given its alfresco nature, I can really chill at this warm, comfy place while enjoying the scenery of nature at Gillman Barracks. At the same time, the bar is playing vibrant Caribbean music to add liveliness to the atmosphere. Dining here is really one of the relaxing enjoyments in life.\n\nThe food is very good and ranges from unique surprises to lovely good old familiar classics, with a bit of twists.\n\nThe service here is very warm, friendly and helpful, making the experience a totally enjoyable one.\n\nMy favourite here is definitely the Iberico Pork, straight from the grill. It features this lovely familiar meaty sweetness with char, completed with juicy good bite. This is so good and satisfying to savour.\n\nPotato Gnocchi here retains the starchy, slightly stretchy goodness that I love about gnocchi and add in some refreshing twists, such as the fluffy texture and the special sauce. The sauce is creamy, tangy with a hint of spiciness. This dish is full of exotic, balanced, nuanced distinctive flavours\n\nIda’s Semi Freddo Doughnut is a must-try here. It is so unique and blissfully good. The taste is creamy rich sweet with a hint of tangy taste. The texture is like ice cream, albeit finer, more complex flavours. Almond adds the savoury nutty kick and the contrast in texture, making it even better.\n\nI also love the floral theme of the cocktails here.\n\nThoughts: Awesome place to chill amid the lush greenery and enjoy good food",
      "time": 1739974829,
      "translated": false
    },
    {
      "author_name": "Julia Gumpl",
      "author_url": "https://www.google.com/maps/contrib/112329728654844945185/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJkT-zdMU565r6Kg62fM6kAJhtVJkgivoam0_EnPA1rYM03xw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Please go here!\nAmazing drinks, incredibly nice atmosphere and wonderful service.\nThis doesn’t feel like Singapore - in a very good way. The beautiful lighting, great music and tropical plants put you in a kind of holiday island mood (take away the street and you could be in an elegant beach bar in Koh Samui).\nThe staff has a lot of knowledge of the drinks, the food and even the glasses in which the drinks are served.\nSo please go here and support a place that is all about great service in a very unpretentious and just super nice way!",
      "time": 1735914199,
      "translated": false
    },
    {
      "author_name": "Aye Mon",
      "author_url": "https://www.google.com/maps/contrib/112191940225769800057/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWP0N2NJ3dOwWzF-HboSMqE4_kgma42SepDY6R1c-uZz8z7EI1u=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Beautiful bar in Gilman Barracks with lovely interior - the outdoor area had really great vibes. Bar bites were pretty good, and the cocktails had unique flavours that we’ve not had elsewhere; would love to come back and try different drinks.",
      "time": 1726055841,
      "translated": false
    },
    {
      "author_name": "Gabriel Teo",
      "author_url": "https://www.google.com/maps/contrib/107134605189876484204/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJx6aowktjm5-d9xh14M0o6zPcYa7glEBzRmEGxbpTIrP6jew=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "We recently had our wedding at IDA’s, and it was a wonderful experience :) The venue was spacious and comfortable, making it perfect for our guests to relax and enjoy the day. A big thank you to Asyraf, who was incredibly helpful during both the rehearsal and the actual day!",
      "time": 1731945266,
      "translated": false
    },
    {
      "author_name": "Priya Joseph",
      "author_url": "https://www.google.com/maps/contrib/113707704112982769760/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU3oIJH4Nc4P7NDYlpwuy_wuIt08ISZ-XhFLNsEyucfFAy8SKw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "A new hidden gem at Gillman barracks\nExcellent hand crafted cocktails\nWhite Sangria is a must\nLoved the cocktails by Virat and Nikki\nVery friendly staff\nLamb toasties were very good",
      "time": 1729503008,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15726005432751056375",
  "user_ratings_total": 42,
  "vicinity": "9 Lock Road, #02-21 Gillman Barracks"
}