{
  "formatted_address": "12 Aljunied Rd, Singapore 389801",
  "geometry": {
    "location": {
      "lat": 1.3138831,
      "lng": 103.8821815
    },
    "viewport": {
      "northeast": {
        "lat": 1.315234380291502,
        "lng": 103.8835451802915
      },
      "southwest": {
        "lat": 1.312536419708498,
        "lng": 103.8808472197085
      }
    }
  },
  "name": "Impact Family International School",
  "place_id": "ChIJW3GeZlUZ2jERfEoUzQTMjB4",
  "rating": 3.4,
  "reviews": [
    {
      "author_name": "lkuko Saito",
      "author_url": "https://www.google.com/maps/contrib/112217169856752294857/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKINrJf19Iay_GDEKAyPh2nHD6aiSMsOMzz8JRI19ahrwAluw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "I had scheduled a school tour at this international school for potential enrollment. My husband and I brought our two young children and arrived at the scheduled time, only to find that no one was there to meet us — with no prior notice or follow-up.\n\nLater, the school apologized, explaining that there was a “system issue” and our booking had not been recorded. However, at such an important stage where trust should be built before enrollment, this kind of response left us feeling extremely uneasy.\n\nTrust between parents and the school is absolutely critical. Based on this experience, I do not feel comfortable entrusting my child’s education to this school.\n\nIf you are considering enrollment, I would recommend proceeding with caution.",
      "time": 1745833650,
      "translated": false
    },
    {
      "author_name": "Zhi Zhang",
      "author_url": "https://www.google.com/maps/contrib/114226551683865596194/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocImVS8SKOEGSYB4zZ4p7RUMexVXGyYfA_pm222tXx7rIbvs1g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Parent Review:\n\nOur child is in Grade 2, and we wanted to find a school that offers both English and Chinese learning opportunities. We discovered that Impact Family International School provides a bilingual program, so we decided to join the school’s Chinese Culture and Art Experience Class. The activity was creating a Lunar New Year greeting card for the Year of the Snake, and the school thoughtfully prepared a variety of snacks and drinks for the children.\n\nMs. Kou and Ms. Mei were incredibly patient and guided the kids throughout the activity. Our child was completely immersed in the hands-on craft-making experience and had a wonderful time. We are excited to participate in more activities, and we have already completed the enrollment process for this year. We are kids look forward to growing together with Impact Family International School!",
      "time": 1740456908,
      "translated": false
    },
    {
      "author_name": "高田美穂",
      "author_url": "https://www.google.com/maps/contrib/108827560288398140106/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ2gWU5sY06MJf-_3e-bmNZHpRoSSJzC2UtJF7BE0E9mG40_Wg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "We journeyed all the way from Japan to Singapore for one reason: to explore the quality of education at Impact Family International School. After discovering a trial class on their website, we eagerly booked a session as part of our search for the perfect school for our five-year-old daughter. What we didn’t realize was that our chosen date fell right in the middle of the Chinese New Year holiday.Imagine our dismay when, after flying in and heading straight from the airport with our entire family and all our luggage, we arrived to find the campus closed. Our hearts sank — we had come so far, only to be met with locked doors. However, when we reached out to the school for help, the administration responded immediately. To our astonishment, the school director personally came to the campus to welcome us and even gave us a quick tour. Incredibly, within 20 minutes, they had contacted the entire teaching team, and everyone came together on short notice to organize a private trial class just for our daughter.Our daughter had a wonderful time in this impromptu class. She took part in a special Chinese New Year craft activity and, most excitingly, enjoyed a hands-on robotics lesson led by the STEM teacher. Using LEGO bricks to build models, she was introduced to STEM education for the very first time – and it instantly sparked a keen interest in her. It was the highlight of her day and an experience she hasn’t stopped talking about.                                                                                                   We also had the opportunity to meet Dr. Guo, an education expert, who kindly took the time to explain Impact Family International’s educational philosophy to us. During our visit, the school management clarified why the campus had been closed: an unexpected plumbing issue over the holiday had forced them to cancel all trial sessions. They had attempted to notify all registered parents, but unfortunately we never received that message and thus arrived as scheduled. The administration sincerely apologized for the inconvenience and misunderstanding. They even went above and beyond by arranging transportation to our hotel to help us settle in, and as a thoughtful gesture, they recommended some of Singapore’s best local eateries and sightseeing spots for our family to enjoy during our stay.We were truly impressed by the school’s professionalism and integrity, and by how sincerely and efficiently they handled this unforeseen situation. Their dedication reassured us that Impact Family International is an institution where children receive outstanding education and genuine care. We wholeheartedly recommend Impact Family International to any parent seeking a high-quality, nurturing educational experience for their child!",
      "time": 1740711768,
      "translated": false
    },
    {
      "author_name": "Sophia Hao",
      "author_url": "https://www.google.com/maps/contrib/109741445338120325238/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIHMTO-wjy1bfacr3GE4tBFEaKGPtH9ow5-UyMrjH4KO7sCEA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "During our tour of this new school, the teacher walked us through a typical day combining Cambridge and IPC approaches. Their clear understanding of child development and international education standards gave me complete confidence in this new venture.",
      "time": 1740493776,
      "translated": false
    },
    {
      "author_name": "Meredith",
      "author_url": "https://www.google.com/maps/contrib/112654158556517551574/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKa92hKBTIH4XPIqSp6oezVFFmrVrMIFH6oj8dShCjLnVGSzA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "If I could give this school zero stars, I absolutely would. My experience started out positive because of the excellent principal and teacher—both were clearly experienced and very well-qualified. Unfortunately, they seem to have left the school, and everything has gone downhill since then.\n\nDealing with one of the staff members has been incredibly frustrating. Communication is a nightmare, and they turned out to be the director. She was more interested in promoting irrelevant camps and overseas courses than addressing actual concerns. My experience with her was nothing short of terrible. I would strongly recommend avoiding this school altogether.",
      "time": 1737012578,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2201358638869924476",
  "user_ratings_total": 20,
  "vicinity": "12 Aljunied Road"
}