{
  "formatted_address": "111 Somerset Rd, #02-14 TripleOne Somerset, Singapore 238164",
  "geometry": {
    "location": {
      "lat": 1.3001685,
      "lng": 103.8372952
    },
    "viewport": {
      "northeast": {
        "lat": 1.301334930291502,
        "lng": 103.8385019802915
      },
      "southwest": {
        "lat": 1.298636969708498,
        "lng": 103.8358040197085
      }
    }
  },
  "name": "Imperial Treasure Steamboat Restaurant",
  "place_id": "ChIJHVkc_RgX2jERsfJ-jm83y0Y",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Lucas Ho",
      "author_url": "https://www.google.com/maps/contrib/103969490725511134614/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVcUV-x6DPgztXzZUR0WTk7vRFc-3yryY_KHvePGmKbdcUQ-3eWyw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Imperial Treasure Steamboat Restaurant elevates the steamboat experience to a level of refined dining. From the moment you step inside, the elegant ambiance sets the stage for a truly special meal. During my recent visit, I was particularly impressed by the quality of the ingredients and the depth of flavor in their signature Pork Bone Broth. The broth itself was rich and comforting, a perfect foundation for the array of premium ingredients we selected. Additionally, the crisp, fresh vegetables provided a delightful contrast to the rich broth.\n\nWhat truly stood out was the impeccable service. Our server was attentive, knowledgeable, and always ready to assist, ensuring our dining experience was seamless. They were very helpful in explaining the different broth options, and also gave great advice on the cooking times for the different food items. The restaurant was clean, well organized, and provided a very comfortable dining atmosphere.\n\nWhile Imperial Treasure Steamboat is undoubtedly a premium dining experience, the quality of the food and service justifies the price. I highly recommend this restaurant to anyone seeking a luxurious and memorable steamboat experience. It's perfect for special occasions or simply indulging in a truly exceptional meal.",
      "time": 1739931941,
      "translated": false
    },
    {
      "author_name": "Winston Ho",
      "author_url": "https://www.google.com/maps/contrib/109087882208981210478/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLpYx85U5FJwEDY5Qr79-M2uYMSC36deCpgp6tlw_xhR9Dugw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Had a gathering here during Chinese New Year.\nHad a platter of appetizers to start, followed by a salmon lo hei.\nWe had 3 different soup base for the steamboat. The standout soup base was the drunken chicken broth and chicken broth.\nAustralian lobster was done sashimi style and the shell was used to prepare a lobster porridge which was served at the end of the meal. Very tasty.\nOrdered a variety of ingredients which the staff cooked in the different broths.\nYou can customize the dip to fit your taste buds.\nYou can do your own cooking or ask the staff to assist.\nThey also have a good wine and alcohol (sake and whisky) list to choose from.\nRecommended!",
      "time": 1739238744,
      "translated": false
    },
    {
      "author_name": "HC L",
      "author_url": "https://www.google.com/maps/contrib/105381120259821237733/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL4AjoHyLWrgn0mQ9-z1eTIeRS1rdp--VFcDNRoBhx7ZLS0FL8=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "First time trying and we chose the set dinner for 2 ($88++ pax). We were given a choice of 2 soups out of three. We chose the spicy mala and pork bone soup. You can see the tip of the bone sticking out of the broth! The portion was very generous and we had difficulty finishing them. The simple bean curd skin was outstanding. Soaked in the soup, it was still crispy to the bite. Really good with hot steaming rice. The seafood was very fresh but it was strange to use marble goby fillets. Wasn’t this fish more suitable for deep fried? The squid was sliced thickly and I had difficulty cooking to the doneness I liked. A little longer and they tasted chewy. We were given two cuts of pork (no pictures) Both were sliced thinly and easy to cook. One complaint was that drinks were not free flow (like their competitors) and came in small glasses. The desserts given were delicious though. We had to bring back because we were too full by then. Don’t feel it’s really value for money as no beef was given.",
      "time": 1735482233,
      "translated": false
    },
    {
      "author_name": "Maria Conceição",
      "author_url": "https://www.google.com/maps/contrib/108924569633346531232/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ91yjvqxp7aso19pIAAbpGC2DWYASCvVuiTt2SflC9CVFqBQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Nice place to go for steamboat. Wide variety to pick from. Generally good service however it took us some time to get our tea delivered and the bill. I guess they were busy and we were in a side room with not so many waiters. It is located in a shopping mall, so you get that vibe (large overlooking windows to the corridor).",
      "time": 1738136768,
      "translated": false
    },
    {
      "author_name": "jessica bizzoni",
      "author_url": "https://www.google.com/maps/contrib/113876980671370458439/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJjwXsVgjKwxMgNRcmv5T0IkUHPweZM6SG_J2jBM8UM_nYGHjc=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "My favourite steamboat place. Soup base feels clean and light, ingredients are fresh and service is great! Drunken chicken soup was the highlight 🫰🏻",
      "time": 1743670647,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5101231955198800561",
  "user_ratings_total": 152,
  "vicinity": "111 Somerset Road, #02-14 TripleOne Somerset"
}