{
  "formatted_address": "290 Orchard Rd, #05 - 42 / 45, Singapore 238859",
  "geometry": {
    "location": {
      "lat": 1.3034034,
      "lng": 103.835489
    },
    "viewport": {
      "northeast": {
        "lat": 1.304655230291502,
        "lng": 103.8367803302915
      },
      "southwest": {
        "lat": 1.301957269708498,
        "lng": 103.8340823697085
      }
    }
  },
  "name": "Imperial Treasure Super Peking Duck",
  "place_id": "ChIJye26KJIZ2jERQ-cRCW2All0",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Timothy Lim",
      "author_url": "https://www.google.com/maps/contrib/103773064420955939275/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWfy3at0BtzK_kuAovzm9YQE75OqNLqSnGsAB3bGJlfuqpJq6l6=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "They truly serve the best Peking duck in Singapore!! Tableside service for carving the duck is rare these days but Imperial Treasure does it professionally and was truly aamzing to watch the skill of the chef as he cut it up.\n\nThe duck skin was light and crispy and the duck meat very tender. Overall the other dishes were also pretty good with the deep fried Soon Hock and chicken being strong runner ups to the duck in terms of quality. Service was excellent as well, with our teas constantly refilled without asking. Only down side is that they can be pretty pricy.\n\nHighly recommend to try their duck if you have not!",
      "time": 1746773882,
      "translated": false
    },
    {
      "author_name": "Sophie Jiang",
      "author_url": "https://www.google.com/maps/contrib/110681808418031823652/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXH8SGXtQTgCbq12k3K_T2HRaraDR7d6ZVuNT-RdYMUcGXn9zI=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "4 months ago",
      "text": "Suppose to be a very decent place but the space is not so spacious, which makes it very noisy. Peking duck was not served after ordering for 40min and required us to ask a few times. Poor service that do not really meet its reputation. Peking duck was quite good. But several other dish was so poor, eg the noodles was too much terrible that was probably the worst of the year I ever ate. I was so regretful to choose this place for my birthday as it was so disappointing for not even serving anything for birthday. Probably spending the same amount of money we could find way better satisfying service elsewhere. Will never visit this place anymore.",
      "time": 1737302108,
      "translated": false
    },
    {
      "author_name": "S.Tan",
      "author_url": "https://www.google.com/maps/contrib/111562369977749883730/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJoJHfSjf0Rp779vYFyJKKDgqRLwZ4WsET56dAvygOCIgoqMQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 2,
      "relative_time_description": "3 months ago",
      "text": "I had high expectations for Imperial Treasure Peking Duck at Paragon, but the experience was underwhelming. The duck lacked sufficient crispy skin, which is the highlight of a good Peking duck and instead felt more like a regular roasted duck. While the presentation was nice, the flavor fell short. The tofu dish was bland and lacked flavor. The service was ok, but the overall experience didn’t justify the premium price. A disappointing visit, especially for a dish as iconic as Peking duck.\n\nTotal bill $400 for 5 adults and 2 children.",
      "time": 1737733192,
      "translated": false
    },
    {
      "author_name": "Wong Teck Jung",
      "author_url": "https://www.google.com/maps/contrib/115500349786770672418/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUdO6mRsxCLVC2048wQtIWaS0v-nVpQH1kaE3wX0RfFrArcLv5Y=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "This is my first review after several visits, and I must commend this location's superior Peking duck; it surpasses other branches in both size and flavour (or maybe it's my delusion).  The sweet and sour tofu is also noteworthy, offering same taste to the sweet and sour pork.",
      "time": 1743397510,
      "translated": false
    },
    {
      "author_name": "Skye Cai",
      "author_url": "https://www.google.com/maps/contrib/103575601236373049278/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWSjDcHZGcZoHJjoIs673qwJVkKO70N2D2zt9jORKf2UTSuRocJ=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Definitely one of the best roasted Peking duck in SG.\nThe skin is crispy and very thin.\nStaff carefully sliced off the breast part of the skin to dip with the sugar served in the saucer plate.\nIt’s amazing that the cracking skin goes perfectly well with the sugar.\nThe duck meat is lean and very tender. Juicy and the meat juice is lightly rosy color.\nThe thin pancake is made of flour, not the egg pancakes. Dip the duck meat with the sweet and savoury sauce and wrap inside the pancake is great.\nThe deep fried frog is a must to order to. Well covered with a super thin layer of pepper and salt. The frog legs are big and tender. The crackers are lightly peppered too.\nThe sautéed prawns with dry chilli is very disappointing. The sauce is too salty, while over covered the original taste of the prawn pieces.\nStewed eggplant with minced pork is great to go with rice. Not that salty and the eggplant is very fresh.",
      "time": 1742264827,
      "translated": false
    }
  ],
  "types": [
    "meal_delivery",
    "meal_takeaway",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6743718697825855299",
  "user_ratings_total": 1442,
  "vicinity": "290 Orchard Road, #05 - 42 / 45"
}