{
  "formatted_address": "1 Orchard Blvd, #10-02 Camden Medical Center, Singapore 248649",
  "geometry": {
    "location": {
      "lat": 1.3031034,
      "lng": 103.8238957
    },
    "viewport": {
      "northeast": {
        "lat": 1.304287880291502,
        "lng": 103.8251456302915
      },
      "southwest": {
        "lat": 1.301589919708498,
        "lng": 103.8224476697085
      }
    }
  },
  "name": "Implantdontics Cosmetic and Implant Dentistry",
  "place_id": "ChIJ____j4kZ2jEREaf0yPxNTvI",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Sheela Devi Supparayan",
      "author_url": "https://www.google.com/maps/contrib/100108334063851360481/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIs4mcR3JK3P2DY_pNvf8ftTEC-Q5W_gtUraH-SMoUsnZvb9w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I recently had the pleasure of visiting Implantdontics Clinic in Singapore, where I underwent several procedures, including an implant, under the care of Dr. Leong.\n\nFrom the very beginning, Dr. Leong exhibited a high level of professionalism and expertise. He took the time to thoroughly assess my dental issues and provided me with a detailed treatment plan. I was impressed by his attention to detail and his ability to explain complex concepts in a clear and understandable manner. Dr. Leong's thoroughness gave me confidence in his abilities and reassured me that I was in capable hands.\n\nOne aspect that truly stood out during my time at Implantdontics Clinic was Dr. Leong's commitment to completing my treatment within the limited time I had in Singapore. Despite the tight schedule, Dr. Leong and his team worked diligently to ensure that all procedures were completed efficiently and effectively. This level of dedication and efficiency was truly remarkable and greatly appreciated.\n\nIn addition to his exceptional clinical skills, Dr. Leong went above and beyond by providing guidance for some treatments I needed to undergo in the US. His willingness to assist me even after my visit to Singapore showcases his genuine care for his patients and his dedication to ensuring their long-term oral health.\n\nI feel incredibly fortunate to have found Dr. Leong and his team at Implantdontics Clinic. Their passion for dentistry is evident in every aspect of their work, and the level of care and attention I received was truly remarkable. I would like to extend my heartfelt gratitude to Dr. Leong, Dr. Aidan, and the entire team at Implantdontics Clinic, including Shan and Lydia. Their professionalism, expertise, and compassion made my experience truly exceptional. I highly recommend Dr. Leong and Implantdontics Clinic to anyone seeking top-notch dental care.",
      "time": 1709106058,
      "translated": false
    },
    {
      "author_name": "Lok Meng Chang",
      "author_url": "https://www.google.com/maps/contrib/111147712145347758773/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJwAWwTwKbAcOLIxxqt2bVqEC-LJbPzlBXv21IvjlWs5t8Eug=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I recently completed a multistage dental implant at Implantdobtics. I had a very good experience with both Dr Aiden and Dr Dennis throughout this 1 year journey.\nDr Dennis performed a comprehensive assessment of my condition and provided me with a detailed treatment plan. He was clear and patient in the entire planning phase and laid out the stages and estimated total cost. Dr Dennis also built my implants and was very skilful and gentle in his treatment. I felt completely at ease during his treatments.\nDr Aiden was my dental surgeon. He was very efficient in the few operations. The inoculations he did during my surgeries was less painful than expected.\nI am really grateful to Dennis, Aiden and the assistants at Implantdobtics Clinic. I am now able to enjoy my meals and smile confidently. Thank you very much!\nI highly recommend Implantdobtics Clinic for dental treatment especially for patients considering starting their implants journey.\n\nChang Lok Meng\n🙂🙂",
      "time": 1714198492,
      "translated": false
    },
    {
      "author_name": "Amanda Spinks",
      "author_url": "https://www.google.com/maps/contrib/112865561360667550434/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJSAbHkWzRoXmO9gNgXNEImCyRQzNQo6tRb0kEbUUlzEpy35Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "Dr Dennis Leong custom made my veneers to perfectly suit my skin, hair and eyes. They are such a perfect color they look so natural. I am over the moon about my veneers and very grateful. I highly recommend Dr Dennis Leong.",
      "time": 1719525243,
      "translated": false
    },
    {
      "author_name": "Loh Par Hong",
      "author_url": "https://www.google.com/maps/contrib/101044655917786085628/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIiNRgbZVbXFrg7lXbAniMeoNQd2qDfah-uh6nhWVjSNhnayA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Dr. Dennis Leong’s team was doing dental plastic surgery for my wife. I am worried that my wife need to do several tooth extractions and implants. After Dr. Dennis assistance and Dr. Aidan’s  tooth extraction and implant surgery, my wife has not been affected in pain and discomfort symptoms, now she can enjoy delicious food, sincerely thank Dr. Dennis and Dr. Aidan for taking care of my wife. I wish Dr. Dennis and his teams good health and everything goes well!",
      "time": 1687791436,
      "translated": false
    },
    {
      "author_name": "Paul Gosling",
      "author_url": "https://www.google.com/maps/contrib/104577069850954387058/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLazG8vYnpfkVQBdOYVaXddtk9tflXXW9abiUxeIeFlmFEHyQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "When I required very significant work to rebuild/raise my bite and crown my teeth due to severe wear because of grinding, Dr Dennis Leong was recommended.\n\nRight from the initial consultation, I was struck by his no-nonsense approach and clarity in explaining options, procedures, timeframes and cost.  In particular, I had been warned that the total process would take many weeks.  As I expressed disappointment at this, Dr Leong explained how this could be shortened (if I was willing to do long sessions in the chair) and he did his best to rearrange his schedule to accommodate that. I was keen to “get it over with” and we completed the work in just 3 weeks start to finish (including an overseas trip).  I really appreciated this willingness to be flexible and move at speed.   This was aided by the fact that his clinic has the equipment to produce the crowns on-site and this allowed “on the spot” involvement of his ceramicist which speeded things up.\n\nI was very satisfied with the results of work, functionally and cosmetically.   Dr Leong has a focus on detail and quality.  His clinic staff are efficient and friendly.",
      "time": 1695267147,
      "translated": false
    }
  ],
  "types": [
    "dentist",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17459978553460565777",
  "user_ratings_total": 19,
  "vicinity": "1 Orchard Boulevard, #10-02 Camden Medical Center"
}