{
  "formatted_address": "10A-E, Yio Chu Kang Rd, ICB SHOPPING CENTER, Singapore 545524",
  "geometry": {
    "location": {
      "lat": 1.3545874,
      "lng": 103.8776779
    },
    "viewport": {
      "northeast": {
        "lat": 1.355867880291502,
        "lng": 103.8790619302915
      },
      "southwest": {
        "lat": 1.353169919708498,
        "lng": 103.8763639697085
      }
    }
  },
  "name": "Infusion Roastery Cafe",
  "place_id": "ChIJ0UNzVcUX2jERczU6exaNTSw",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "CN Ong",
      "author_url": "https://www.google.com/maps/contrib/108844616295407702519/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLTqSr72kgq0vn1-7ACEcqNmbFLuw818a7W2cU-lIiNsv9yrg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "A great place to study, work or have a gathering. Great drinks and food with free limited parking lots in front of the cafe. One of our favourite cafes near home.",
      "time": 1744296604,
      "translated": false
    },
    {
      "author_name": "A Y",
      "author_url": "https://www.google.com/maps/contrib/111543376738303589301/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWEkdS3wusqnDApiJw0Uoxf0BUBJyDCSn8f8E9kk2ETY9QkNlVp=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "rated the cafe's atmosphere as the highest component as it is spacious and conducive for the individual's relaxation or work.\n\nas for its food items, I had the key lime tart with chia seeds and a long black. I decided to give the tart a shot as I saw that the shell is thin. its taste was better than expected, the citrus sourness is pronounced and the curd was smooth and thick. what I find lacking is some fresh zest to impart fragrance and complete the tart. there could be more chia seeds for an even better crunch. the long black had both acidity and nuttiness which I was satisfied with.\n\nfunnily enough, I actually came for the éclair after looking at reviews but found out from the staff that they stopped serving it 2 years ago.",
      "time": 1740304999,
      "translated": false
    },
    {
      "author_name": "Chim Mei",
      "author_url": "https://www.google.com/maps/contrib/101044726506569224192/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIUQgDxdKg0gjpKqtY6DQkwZ2EtKlYuEDuGICAl4HPDIwMDow=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I randomly chose this spot to spend some Me Time and get a bit of work done. The space is roomy, and I really enjoyed the ambiance. I ordered a flat white and a yuzu croissant, which had a unique twist. The coffee was on the pricier side, but thankfully, it had a smooth taste. I wasn’t expecting custard inside the croissant—normally, I’m not a big fan—but this one was exceptional, not too sweet or overpowering. I plan to bring my husband next time to try their egg breakfast. Until then, see you again!",
      "time": 1742097788,
      "translated": false
    },
    {
      "author_name": "Zackery Goh",
      "author_url": "https://www.google.com/maps/contrib/109405400403426765330/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUGQsp237p9vNHb-uS9FyMoz0Z-zK6zy1GCgCTEXQuCxwKVbMg-=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I recently visited Infusion Roastery Cafe, and I must say, it was an excellent experience! The first thing that struck me was the spacious layout of the cafe. It’s perfect for both solo visits and gatherings with friends. The comfortable seating arrangements allow you to relax and enjoy your time without feeling cramped.\n\nOne of the highlights of my visit was the free Wi-Fi, which made it easy to catch up on some work while enjoying my meal. It's a great spot for remote work or studying, with a pleasant atmosphere that keeps you motivated.\n\nNow, let's talk about the food. I ordered the seafood risotto in broth, and it was nothing short of amazing! The flavors were rich and well-balanced, with generous portions of fresh seafood. The broth added a depth that elevated the dish to another level. It’s definitely a must-try for anyone who loves seafood.\n\nOverall, Infusion Roastery Cafe offers a lovely combination of a spacious environment, reliable Wi-Fi, and delicious food. I highly recommend it to anyone looking for a great place to relax or work while enjoying a fantastic meal. I can’t wait to return!",
      "time": 1740488091,
      "translated": false
    },
    {
      "author_name": "Kyle Tan",
      "author_url": "https://www.google.com/maps/contrib/101849616545988861547/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWsv9E6MFCBlXdd6NOWQ297SHOM_H8yeY_MB3QhW3eeayTAQKFl=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "Love love love this place! The space and the food! Finally a cafe that’s not cluttered with tables and chairs for more revenue. I’ll gladly pay more for such setting! Came here on a weekday morning. Love the serenity and comfort. Just personal preference, I prefer the big breakfast to the Guacamole toast. Pork sausage is one of the best I’ve tasted in Singapore. Juicy, not dry unlike other breakfast cafes.",
      "time": 1721792877,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3192362838571758963",
  "user_ratings_total": 459,
  "vicinity": "10A-E, Yio Chu Kang Road, ICB SHOPPING CENTER"
}