{
  "formatted_address": "3 Mount Elizabeth, #10-09 Medical Centre, Singapore 228510",
  "geometry": {
    "location": {
      "lat": 1.304921,
      "lng": 103.8354181
    },
    "viewport": {
      "northeast": {
        "lat": 1.306196730291502,
        "lng": 103.8369646802915
      },
      "southwest": {
        "lat": 1.303498769708498,
        "lng": 103.8342667197085
      }
    }
  },
  "name": "International Urology, Fertility & Gynaecology Centre",
  "place_id": "ChIJg5Qu3pIZ2jERP5OMLGezrXg",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Ying Hong Jin",
      "author_url": "https://www.google.com/maps/contrib/111826650751787096310/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW9euSvs7SAfYG-OX4dpoL98xyxHadTo0VhH3RD-ApYmFebOM8=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "I would like to express my deepest gratitude to Dr Michael Wong. He has been very professional and kind to me throughout my surgery and post-op. I have been visiting several clinics for my condition before I finally got an accurate diagnosis from Dr Wong, his knowledge seen from the fact that all I did was to tell him about my symptoms and he knew exactly what the issue was. I would also like to give my thanks to the nurses at the clinic as well. They had been extremely professional and friendly too. Thanks to them, my stay was extremely comfortable. I would definitely recommend Dr Wong and his clinic for urology-related conditions. Great doctor, great team!",
      "time": 1600401009,
      "translated": false
    },
    {
      "author_name": "Ek Meng Gan",
      "author_url": "https://www.google.com/maps/contrib/105174901661878891877/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLGfZ5gylTGkaR9dbVA9S6JGSbaVHyh_vWyDA7MY_niHVek4A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "HI, Consulted Dr Michael Wong once i had diagnosed with a tumor in Jun 22. Dr Michael Wong was very professional, confident and calming to explain my option and treatment plan. He had given me some light and hope despite the surrounding darkness of this terrible illness embedding my life. Thus my wife and i put our trust with him and his clinc for my treatment. Eventually, one kidney was surgerically removed by Dr Michael Wong and his professional team. I still recall the day of surgery where he still joke to calm my nerve on the operating table. Amazing feeling then. The surgery was done in hours and i manage to walk after 3 days. The aftermath feeling and how well the wound heal convince me how well the surgery went. Thanks to the amazing team. :-) Since then, i had married my wife, enjoying and appreciate a little of 2nd chance of life better than the first one. i will been following up my treatment plan with Dr Michael Wong and his team for sure. Thank you Dr Michael Wong, the clinic and the surgerical team. P.S. Beside Dr Michael Wong, I also want to thanks Diana and the other 2 front desk ladies (forgive me for not recalling your names). Thank you too.",
      "time": 1666670029,
      "translated": false
    },
    {
      "author_name": "Charis Sim",
      "author_url": "https://www.google.com/maps/contrib/100388780584208567492/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVrcvy1TxT3uXNmSKrNI4ZuPlYv81F_EH_j6rAmKIIRBkHeq1x8FA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "I've spent so much time and money on other doctors who gave me generic diagnoses and meds that don't work long-term. I'm so thankful to have found Dr Wong - he is extremely knowledgeable and got to the root of my issue quickly, all while remaining ever so humble. The nurses at the clinic have also been very pleasant and helpful.",
      "time": 1563359489,
      "translated": false
    },
    {
      "author_name": "Jan Ba",
      "author_url": "https://www.google.com/maps/contrib/104949341200685178985/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUf8DNR7CmKwFVe6VVCibAdoTv7wAmGk9_gScTk8lTMWKFav2KD=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "7 years ago",
      "text": "I traveled all the way from the Middle East to take a second opinion and it was done by Dr Michael Wong in this center. Dr Michael and the staff are very friendly, approachable and helpful too. They got all the best latest facilities under one roof and it was very fitting to a traveler like me to get done the tests faster and conveniently. At the end I had my doubts cleared and I felt I was treated professionally, conveniently and friendly manner.",
      "time": 1500256802,
      "translated": false
    },
    {
      "author_name": "Marc Drolet",
      "author_url": "https://www.google.com/maps/contrib/113904494420839929508/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWcAbW2ws4m0afxCKG5gjLWX44yPQDP7mllmTeYPviIKwaSVyw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 years ago",
      "text": "just to finalize my previous comment which went out before completion by mistake;\nDr Wong took the time to explain to myself and my wife the surgery I had to have, and during the pre-surgery and post surgery, he and his nurse visited me and provided follow up visit to ensure all was OK.\nThank you Dr. Wong and your staff for this exceptional service.",
      "time": 1449497697,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "hospital",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8695803711232709439",
  "user_ratings_total": 11,
  "vicinity": "3 Mount Elizabeth, #10-09 Medical Centre, Singapore"
}