{
  "formatted_address": "80 Middle Rd, Singapore 188966",
  "geometry": {
    "location": {
      "lat": 1.2984504,
      "lng": 103.854865
    },
    "viewport": {
      "northeast": {
        "lat": 1.299982830291502,
        "lng": 103.8568040802915
      },
      "southwest": {
        "lat": 1.297284869708498,
        "lng": 103.8541061197085
      }
    }
  },
  "name": "InterContinental Singapore",
  "place_id": "ChIJZRZ9yroZ2jER4R3Hm0_9Phs",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "CR Ruan",
      "author_url": "https://www.google.com/maps/contrib/101226301063816460086/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWi8BSWdCT68LOjaMc1i_pkWqotm_mIU2npgezd-HTmmVidQ_DChw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "in the last week",
      "text": "Restaurant service is excellent. The level of English spoken by staff is excellent. Food is very good though not great. I haven't tried all their restaurants yet so, that rate may improve. Ambiance is lovely, combining the late 19th Century Mayoral Neoclassical colonnade building feel, with touches of Chinese trading post. Definitely built before the days of AC, it has a lofty feeling throughout. They also have live music performances and those are very good. Bring your business friends or significant other. You'll have a good, relaxing time.",
      "time": 1747387676,
      "translated": false
    },
    {
      "author_name": "Taz Tatt",
      "author_url": "https://www.google.com/maps/contrib/106252418632801929289/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWvaRMCvWyzIQQZUsfSFiPoFvoW5blmLw2U4zzY3RPPdr_XqPvp=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "A Classic Stay with Mixed Breakfast Experience – InterContinental Singapore\n\nAfter 10 years away from Singapore, I chose to stay at InterContinental Singapore for its timeless, classic architecture and convenient location — easily accessible to many parts of the city. The hotel truly lives up to its 5-star status in terms of comfort and quality. The room was well-appointed, and I especially appreciated the luxurious BYREDO bathroom amenities, which added a relaxing and elegant touch to the stay.\n\nI stayed over a Saturday, Sunday, and Monday. The breakfast experience, however, varied greatly depending on the day.\n\nOn the weekend (Saturday and Sunday), breakfast was extremely crowded and felt quite messy. We queued up to get in, and once seated, the table looked like it had been rushed to prepare — not fully cleaned, and missing cutlery. I politely asked a staff member who was passing by if I could have some utensils, and to my surprise, she pointed to another table that hadn’t been fully set up yet and told me I could get them from there myself. I was quite shocked and asked again, and thankfully another staff member — the one who had originally shown us to our table — quickly stepped in and said he would bring the cutlery over shortly.\n\nOver the three mornings I had breakfast at the hotel, I found the weekend service chaotic and stressful, with the staff seeming overwhelmed and disorganized. The environment didn’t feel relaxing at all. On Monday, however, the experience was much smoother — fewer guests, more attentive staff, and overall a more professional atmosphere.\n\nThe breakfast spread offered a good variety, though I found the hygiene standards lacking in some areas, especially in how food was handled and how tables were reset.\n\nOutside of the breakfast experience, I have to say the hotel staff were generally helpful, and the overall stay was comfortable and enjoyable. I would consider staying again — but perhaps avoid breakfast during peak weekend hours.",
      "time": 1747126148,
      "translated": false
    },
    {
      "author_name": "FRANK FU",
      "author_url": "https://www.google.com/maps/contrib/114046287167653767312/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJiBkeeR2uczuGiT-M_qM_cFmzJ5MksM--yP6Y6ppQVyvzj2A=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I am giving 5 stars for this review but why there are only 4 stars?\n\nAmazing hotel with the comfy bed! Has been staying in this hotel for quite a few times. The elegant design with local Peranakan flavour is unforgettable. I always come back to this hotel for staycation.\n\nThe pool is quiet and offers a good view of the national library building nearby.\n\nThe dim sum buffet in Man Fu Yuan is a good pick too. Currently they have promotion for the lunch and dinner buffet in LUCE Italian restaurant. Good price and spread!\n\nThe room service staff serving 10th floor, Su Na, is very friendly and understandable. She is helpful in accommodating our request.",
      "time": 1742354209,
      "translated": false
    },
    {
      "author_name": "James Peck",
      "author_url": "https://www.google.com/maps/contrib/108489381715875902542/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWDO-7bngDGb6GkKTFdZvayVhaD8yC5UqMa8VtJK5zkhSLYV5S7=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I've stayed here 3 times. Every time has been excellent. The service is top level, the rooms are spacious and quiet. The location is as good as it gets, being right next to Bugis station. Of course it is quite expensive but you do feel like you get what you pay for.",
      "time": 1744619301,
      "translated": false
    },
    {
      "author_name": "Bux Shayeb",
      "author_url": "https://www.google.com/maps/contrib/102289404379408275296/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXD1yTYgokcCSSghohT9PzlfSoeuS_yWMdTTmaQK98z-UqJY2JThA=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "Polite and expedited service from the front house and concierge. They knew I was a returning client from the minute I got off the taxi.\n\nRooms are large clean and full of amenities with a nice view of bugis Singapore",
      "time": 1747362593,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1963285005937876449",
  "user_ratings_total": 5072,
  "vicinity": "80 Middle Road"
}