{
  "formatted_address": "2 Ang Mo Kio Dr, Singapore 567720",
  "geometry": {
    "location": {
      "lat": 1.3777917,
      "lng": 103.8563337
    },
    "viewport": {
      "northeast": {
        "lat": 1.379051330291502,
        "lng": 103.8574091302915
      },
      "southwest": {
        "lat": 1.376353369708498,
        "lng": 103.8547111697085
      }
    }
  },
  "name": "ITE Headquarters & ITE College Central",
  "place_id": "ChIJRSQ2TOgW2jERlbZuxFxYN1w",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Wan Ilhan",
      "author_url": "https://www.google.com/maps/contrib/101416780496497347584/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUgNFnTLPsK6B09NbF2iUBwy9-LQ38LWt0IXynloSCV4qFVcXVD=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "2 weeks ago",
      "text": "Overall, I’d say that my time in ITE College Central over the past 5 months has been nothing but exciting and stressful.\n\nThe positives are the food (mostly, but avoid Good Day Cafe), the lecturers, the lifts, escalators, a visually pleasing environment, a musollah at Blk H Level 1, and the Bridge Leaders from orientation.\n\nThe negatives, where do I even start. Student Icons, the most annoying of all the Leadership CCAs. The toilets, especially the back end ones. The bad reputation of smokers and vapers in the toilet and at stairwells. Teenagers risk suspension by vaping in toilets right beside Foodgle! The aunties and uncles that work here. I greet them politely and get no response, not even a smile. It is as if they are heartless robots. The worst of them all, some classmates in class. I will not name call but it is my own kind, Malays, and some Chinese students who are against me for no reason. It is as if they are talking to a brick wall! Hilarious! Their attempts are so desperately bad to poke fun at me that it is funny. I stand my ground and made a statement that I am not afraid of them.\n\nShould you go to ITE College Central? Yes, but be wary of the culture and toilets here. It is not the best that I have seen.",
      "time": 1746445217,
      "translated": false
    },
    {
      "author_name": "Agalia",
      "author_url": "https://www.google.com/maps/contrib/110993236996896054674/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ7WPn25r9d7mOjZNeS4ID6kqQwvcDjDSElT2Mzdlx_rzdhZQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Hi, I visited your campus at Central.  I realised your direction board, as shown in the attached photo, is not pointing in the right direction for public (visitor) capark. Isn't it supposed to be on the left when we drive in? The limited open carpark on the right, is with many red lots. Thank you.",
      "time": 1740509778,
      "translated": false
    },
    {
      "author_name": "Louis Chua",
      "author_url": "https://www.google.com/maps/contrib/117782437474545961841/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXUbRK2AjhFNV3iIPCXK6y2VETwzONw7fj5SB3E_KxRtNdOeA85RA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Came here for a 360 video course. The building is very nice with great amenities. There’s a Sheng shiong supermarket, bookshop and even a Chinese restaurant. It is also very pleasant to walk around as it is airy and well ventilated.\nThe two day course was well conducted and instructor very professional.",
      "time": 1694927848,
      "translated": false
    },
    {
      "author_name": "LuminousHalalSquad",
      "author_url": "https://www.google.com/maps/contrib/102401152834153131326/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXLO-rCp7S3ybT_i9_nUv288UKtkU78P1hc9m0ceCtX3rC-t3Y=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I am a 45 -year -old father, probably one of the oldest people playing this game. I am a single father raising my son, who is now 14 years old. My son won this game from his uncle, so we installed him on his computer and he started playing. Until the end of the week he had 24 hours in this game. This was horrible for me, because it was hard to find ways to spend time with my son, because he is always with friends or just watching Youtube. So I decided to do a Steam account and get this game to see if I could play beside him. I bought the game, chose my skin and world and started playing, but I was stuck in what you should do. I asked my son for help and he organized a game for me to participate. I loved it, because it was the best time I spent with my son since my wife died. Since then, this game has approached me and my son again and now we spend time together away from home as well. This game reminded me that there is fun in everything, and I brought many happy memories to me and my son.",
      "time": 1738505103,
      "translated": false
    },
    {
      "author_name": "Chee Hao Lim",
      "author_url": "https://www.google.com/maps/contrib/113586563688886522097/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKDDjkNz6lQK-8bDGl68miNtCZEwr1muB-KoHeDNgHjNsfsMg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Shop name: Makan Star\n\nBest Quesadilla and Snacks Food at Foodgle Foodcourt. One of the best in whole of ITE Central. Very unique.\nLong queues daily.\n\nDelicious food and all food is served hot and crispy. Their friendly service is one of the best too!\n\nHighly recommend!!",
      "time": 1713065115,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6644876930664281749",
  "user_ratings_total": 746,
  "vicinity": "2 Ang Mo Kio Drive, Singapore"
}