{
  "formatted_address": "9 King Albert Park, #02-15, Singapore 598332",
  "geometry": {
    "location": {
      "lat": 1.3370239,
      "lng": 103.7794324
    },
    "viewport": {
      "northeast": {
        "lat": 1.338156280291502,
        "lng": 103.7808113802915
      },
      "southwest": {
        "lat": 1.335458319708498,
        "lng": 103.7781134197085
      }
    }
  },
  "name": "Iven Betta",
  "place_id": "ChIJ______wR2jERCvT7P8hwS3g",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Siambuddhas",
      "author_url": "https://www.google.com/maps/contrib/111674103831778752169/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXKvxi_YX7a26cv-GmNoqMGfeFdg4jDLfEvr04f_xaB5fN8vVFS=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "everything is ok..just that repeat again and again from me...it's a live stock and fish can't tell you he or she got any pain or sickness...how you treat the water..the pH... anti C.. age water.... temperature shock and many more to go...went to their shop..the staffs are  helpful and can chat with... only thing is some miscommunication between Thai and local side so I had to scold Thai side for not clearing my doubts on the issue...overall worth going but prepare a thicker wallet ..hahahaha...",
      "time": 1744290334,
      "translated": false
    },
    {
      "author_name": "Jevan Tan",
      "author_url": "https://www.google.com/maps/contrib/106897179178757565818/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLORW01B_BEPMXQ3Jcw1YXv1V1VCU90xrj2uaf2AgW6hQdx=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Would give this 0 stars but Google dosen't allow it.\n\nOrdered 5 Altums online last week and waited patiently only for them to text me yesterday that they have hiked up the price and can only provide me with 4. So I generously complied and agreed, but it dosen't end there.\n\nGot another message today that they have hiked up the price yet again by a whole $10 per piece and can only provide 3 now. Absolutely outrageous, as an avid fish keeper and hobbyist I would strongly not recommend this place, no integrity for customers and greedy. False advertisements, thanks for wasting my time. Even had the audacity to ask me for a 5 star review after delivery, this is not how you do business",
      "time": 1745144462,
      "translated": false
    },
    {
      "author_name": "J Ji",
      "author_url": "https://www.google.com/maps/contrib/114503867402290678383/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLTt08J6zL4UxsQb3sFe6pgVyAM6rmJ6naaq-pdEohTMGVa-Q=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Their response rate is just like the wild betta they sell—close to extinction.\n\nI would not recommend buying from this aquatic store due to their terrible customer service. They are very responsive on Telegram and WhatsApp when you are looking to make a purchase, but once the transaction is complete, any follow-up inquiries are completely ignored in the future.\n\nIt seems like they only care about making a sale—money = response, anything else = silence. They don’t even reply with a simple yes or no, just a last seen. If you value good after-sales support or genuine fish community store, I’d suggest looking elsewhere. They only care about sales, not the betta.",
      "time": 1742872478,
      "translated": false
    },
    {
      "author_name": "DY",
      "author_url": "https://www.google.com/maps/contrib/104004134518958403721/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUlV5HW_KolEcFm98-Pmr3s-ThUpe5w1Nv4tci090m5f4stDad6=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "a year ago",
      "text": "Visited 4-5 time now.. Have some great bettas with good price. But as many reviews say, the customer service is not great. But some staffs are very kind. Also avoid getting any plants from them. Not in good condition. This was my first time buying plants from them, and bunch of larvae came out. They did offer me exchange when I asked them about it.",
      "time": 1706516579,
      "translated": false
    },
    {
      "author_name": "Adrian Heng",
      "author_url": "https://www.google.com/maps/contrib/116444736906223701300/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW1nrHYc6ZHpJyzHaUQXNokOQsbZZ4xNdzEI-wFy_b0jrdtv4DM=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "I usually head to 328 Clementi for my tropical fishkeeping go-to shopping fix which is great. First impressions of Iven: he was tremendously knowledgable, friendly and willing to share information about all the different fish stocks he has and also advanced care tips. He didn't rush around trying to do his own things, but took time to engage and converse with me and my friend.\n\nHe has a pretty solid selection of small fish species. What's really impressive is that his fish stocks look like they are in great health. Their fins are intact, their activity levels are high and coloration is bright. No sign of fungus, finrot or dirty substrates.\n\nMost other shops I've been to don't display the healthy levels that Iven Betta has on display. I picked up a few lampeye for my nano tank and they look really well adjusted after simply dropping them into my tank. I've gone to many other shops and got fish that died mysteriously within days (not due to any care or water parameters on my part)\n\nWhy trust me? I've been keeping and rearing fish for the past 33 years of my life and I've been seldom impressed with local fish shops. I've been to at least a 100 shops over the course of this hobby and set up and tore down countless tanks for discus, aquascaping, CRS shrimp\n\nIven Betta is a must-go place for betta enthusiasts, who might be willing to splurge 3 figures to get exotic rare bettas. Iven also stocks specilaity shrimp, corys, tetras and essentials to get a medium size tank up and running.",
      "time": 1584691169,
      "translated": false
    }
  ],
  "types": [
    "aquarium",
    "store",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8668145913173898250",
  "user_ratings_total": 92,
  "vicinity": "9 King Albert Park, #02-15"
}