{
  "formatted_address": "1A Cuscaden Rd, Singapore 249716",
  "geometry": {
    "location": {
      "lat": 1.3043525,
      "lng": 103.8239831
    },
    "viewport": {
      "northeast": {
        "lat": 1.305565180291502,
        "lng": 103.8253452302915
      },
      "southwest": {
        "lat": 1.302867219708498,
        "lng": 103.8226472697085
      }
    }
  },
  "name": "J65",
  "place_id": "ChIJMXEfN4oZ2jER-BqARJv_VR4",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "shazmeer zhaswan",
      "author_url": "https://www.google.com/maps/contrib/107111942553303730226/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVeuNYBVeu7I3kUAJTTrv9LiA1SBG932YPaVwU1iKBTim7ylQ87pg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "One of the best buffets we’ve gone to. May not have the widest range of food, but definitely one of the better tasting line-up. Superb customer service from Yun En and other staff. Very informative on their menu as well as table clearing service is amazing. Thank you J65 for such a pleasant experience on my wife’s birthday. We apologize we couldn’t finish the complimentary cake as we were already extremely full from the multiple trips we made around the scrumptious buffet spread!",
      "time": 1745323855,
      "translated": false
    },
    {
      "author_name": "YT",
      "author_url": "https://www.google.com/maps/contrib/116335289933602715039/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVSx0tz-qw4QskVbpYXe4V_L4o3aFYxa3ZZsugq73pGTwz8dHZA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Visited this seafood buffet for the first time to celebrate my boyfriend’s birthday, and it was such a fantastic experience! The selection of food was amazing—there was a wide variety to choose from, and the seafood was incredibly fresh. The staff were very attentive, constantly topping up the food whenever it ran low, which I really appreciated.\n\nI also had the pleasure of meeting the manager, an Indian man who was super friendly and excellent with customer service. Not only did he check in on us to ensure we were enjoying our meal, but he also brought us a free cake to celebrate my boyfriend’s birthday and even helped us take some pictures, which was such a thoughtful touch. It really showed how much he cares for his customers and made the experience even more special.\n\nOne of the highlights was the chocolate fountain they offered, which was a cool and interesting treat. It tasted absolutely delicious! Overall, the experience was fantastic, and the prices were very reasonable for the quality and variety of food offered. Highly recommend this buffet!",
      "time": 1734431484,
      "translated": false
    },
    {
      "author_name": "Hart Ong",
      "author_url": "https://www.google.com/maps/contrib/103865008435461106957/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXUe1mT7LTi3fn5dufnKgAp_Bb1J7mjEfZIiCsmtkDQKvGsI2iV=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "It was my husband's birthday and our second time here. Just as the first time, everything was good and it gets better.\nUpon entering the lobby of the hotel, we were greeted by the huge festive sign.\n\nWhen I entered the restaurant, I was amazed by the deco, beautiful setup. Even the servers were using traditional costumes in conjunction with the festive season.\n\nThe food as usual were scrumptious, there was even a grilled whole lamb served with Briyani.\nThere were also outdoor live stations such as Laksa, Roti Jala and Prata besides the Air Balang (self served drink from a huge tumbler.\nI would like to say my special thanks to our servers for the night who were very attentive, Ms Vera (she remembered me even after 6 months) her fellow server Mr Pasang and also the restaurant manager Mr Dennis.\n\nWith such an ambience,  great service; food and pricing, my family and I would definitely come again.",
      "time": 1743211936,
      "translated": false
    },
    {
      "author_name": "Nadya H",
      "author_url": "https://www.google.com/maps/contrib/101713308113278436614/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUHFbSqz1WtpVEmAeqNbPLS13LkkLouRnJZ9qNgovKGNlgxEnbh=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Seamless reservation through their website. The food spread was great, filling. I really like their variety of desserts as well. Ben, our food server was very friendly and warm, asking about our day and all. Really appreciate all the staff there. Overall, such a nice and relaxing lunch, will definitely come back soon.",
      "time": 1745560338,
      "translated": false
    },
    {
      "author_name": "Arkades lek",
      "author_url": "https://www.google.com/maps/contrib/109968477022293678692/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWpUCF-cW9p7O3HMnpZemTpOWIvJbx2xag9eaxMdrR34Hdg2lw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "Chef Kim Perry is very friendly , he cooked the laksa with his passion . Have many bowls of laksa even im eating buffet with other mouth watering food around. Staff are friendly too , good place to hang out with your family and friends.",
      "time": 1745212464,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2185934236492503800",
  "user_ratings_total": 1210,
  "vicinity": "1A Cuscaden Road"
}