{
  "formatted_address": "333 Boon Lay Way, Jurong, #2A, #01 SAFRA, Singapore 649848",
  "geometry": {
    "location": {
      "lat": 1.3349032,
      "lng": 103.7058618
    },
    "viewport": {
      "northeast": {
        "lat": 1.336329430291502,
        "lng": 103.7072191302915
      },
      "southwest": {
        "lat": 1.333631469708498,
        "lng": 103.7045211697085
      }
    }
  },
  "name": "Jack's Place",
  "place_id": "ChIJdzGUJvMP2jERvyYteznGcVc",
  "rating": 3.9,
  "reviews": [
    {
      "author_name": "Ng Elsie",
      "author_url": "https://www.google.com/maps/contrib/110736867539825389388/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLjFOKEwlkaLi-GV6Hbtiz2LpPUXDa1bdvO1gJ41fddt9ewykO1=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "A big shout-out to Mr Herman for his extra ordinary fast efficient quick minded flexibility service even though I am just claiming the great eastern complimentary executive set meal on a busy dinner hour at almost full house  capacity. His special thoughtful replacement of gelato to a slice of chocolate cake as I was unable to take cold food has been a really touching gesture which I had not encountered in the other outlet at clementi. Will definitely be back for more👍🤗keep up the great job and you are definitely a role model in the service industries👍😊The rest of the service team at this branch is also very hardworking and a highly recommended Jacks Place outlet👍👍👍😄😄😄😊😊😊Thank you very much for a great meal and great service. Keep up the great job!!!👍👍👍☺️☺️☺️",
      "time": 1742565393,
      "translated": false
    },
    {
      "author_name": "Billy Lim",
      "author_url": "https://www.google.com/maps/contrib/109558301923399742564/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVbVi9uODQtCS1mLZ6YAvAX732ucnQgsLUj7k2xn14whTdM_oQA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Went to Jack's place at Jurong Safra branch for dinner using the Great Eastern voucher.\n\nUpon reaching the store, it was slightly crowded and the staff put us on the waiting list and took down our contact number.\n\nHowever we waited for almost 45 mins and they didn't called, went to check and saw the remark no response. We were dumbfounded as there is no call received. Didn't want to argue with the staff as we understand it's peak period for them.\n\nManaged to get a seat after, the staff that took our order are friendly and efficient.\n\nFood came pretty fast as well.\n\nOverall it's a good place to dine.",
      "time": 1743174825,
      "translated": false
    },
    {
      "author_name": "Martin Yeo",
      "author_url": "https://www.google.com/maps/contrib/107217464996017596553/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLULn6HiFSHgEsNjD1xBSQGkPxegpNVIJOwA90Swjw2MeGHhQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Visited this restaurant and had a very warm welcome and great customer service throughout our entire meal.\n\nNot a stranger to Jack’s Place and have been patronising JP’s chain of restaurants for many years now. Food is deliciously good and always appetising, and my good-to-place for great western food. A must try is their baked whole potatoes with their special concoction of mayonnaise cream, bacon bits and chopped spring onions. Goes well with any main dish or simply as a side dish or even on its own.\nApart from good food and a satisfying meal, this outlet’s staffs have a unique warmth in their customer service desires, and always able to extend their courteous hospitality towards their customers, unseen in other outlets. From the warm welcome (Mr. Wan) when coming into the restaurant to the fine details of meals recommendations (Ms. Marilou), their professional service is so satisfying and relaxing, you will feel the urge to want to go back again and again, to experience the great food and their staffs’ “pampering”.\n\nA must try for great Western food and excellent customer service if you are in the vicinity, but for me, I will definitely come back again when I have craving for Jack’s Place’s menu.",
      "time": 1734330942,
      "translated": false
    },
    {
      "author_name": "Chung Wai Yan",
      "author_url": "https://www.google.com/maps/contrib/110828936830004158890/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIZQ8PZkizeeZikAs6D9sEHoB7pW133e9lL0ufViFSgtbTnVg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Mr Alan Yong asked really helpful, courteous and proactive.\nMs Marilou was equally helpful and diligent.\n\nMy family has a lovely and pleasant dinner at Jurong Safra Steak house. Thank you.",
      "time": 1744968656,
      "translated": false
    },
    {
      "author_name": "Tham Willie",
      "author_url": "https://www.google.com/maps/contrib/115757309133353560038/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXgKDUKVnnlMbbetBh2glhcL0NgTw12IOzmWgbIWP2fwFgyCWn3=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "10 months ago",
      "text": "**Moderate Review of Jack's Place, SAFRA Jurong**\n\nI recently visited Jack's Place at SAFRA Jurong and found the experience to be quite mixed. The location is convenient and offers a pleasant ambiance, ideal for a casual meal or a family gathering. The decor is warm and inviting, adding to a comfortable dining atmosphere.\n\nThe menu has a good variety, featuring a range of Western dishes, from steaks to pasta. I ordered the sirloin steak, which was cooked to my preference, though it lacked a bit of seasoning. The accompanying sides were decent but nothing exceptional. My dining companions had mixed feelings about their dishes; some found them satisfactory, while others felt they were a bit underwhelming.\n\nService at Jack's Place was another area where the experience was mixed. While the staff were generally polite and attentive, the service was somewhat slow, especially during peak hours. This wait time can be a bit frustrating if you're hungry or in a hurry.\n\nPricing at Jack's Place is reasonable, considering the portion sizes and the overall quality of the food. However, given the inconsistencies in food quality and service, it may not always feel like great value for money.\n\nIn summary, Jack's Place at SAFRA Jurong offers a decent dining experience with room for improvement. It's a good spot for a casual meal, but there are areas, particularly in food seasoning and service speed, that could use some attention. If you're in the area and looking for a reliable place to eat, it's worth a visit, but don't expect to be blown away.",
      "time": 1721640902,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6301035303850026687",
  "user_ratings_total": 641,
  "vicinity": "333 Boon Lay Way, Jurong, #2A, #01 SAFRA"
}