{
  "formatted_address": "3 Ang Mo Kio Street 62, #03-17, Singapore 569139",
  "geometry": {
    "location": {
      "lat": 1.3858946,
      "lng": 103.8454928
    },
    "viewport": {
      "northeast": {
        "lat": 1.387298280291502,
        "lng": 103.8469286802915
      },
      "southwest": {
        "lat": 1.384600319708498,
        "lng": 103.8442307197085
      }
    }
  },
  "name": "Jai Muay Thai",
  "place_id": "ChIJdysc_toX2jERwpvW3bpBQro",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Fabian Lloyd",
      "author_url": "https://www.google.com/maps/contrib/109717328721603758657/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWNrh_rFDBrLs03B0ccd3zOeJ_L2aJ1nA-X7UBjvNzN0VAfyYA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Exceptional Training at JAI Muay Thai!\n\nI can't say enough good things about JAI Muay Thai! From the moment I walked in, I felt welcomed by a community of passionate and dedicated fighters. The instructors are top-notch—each class is not only challenging but also incredibly rewarding. They have an amazing ability to tailor the training to all skill levels, ensuring that everyone gets the attention and guidance they need to improve.\n\nWhat really stands out to me is the quality of instruction. The trainers are not only experts in Muay Thai but also genuinely care about your progress. They break down techniques clearly, push you to do your best, and create an environment where you feel motivated and supported. Whether you're a beginner or more advanced, there’s always something new to learn.\n\nThe gym itself is clean, well-equipped, and has a great vibe—energetic, yet supportive. It’s clear that JAI Muay Thai fosters a culture of respect, discipline, and community, which is so refreshing. I leave each class feeling stronger, more confident, and eager to come back for the next one!\n\nIf you're looking to improve your Muay Thai skills, get in shape, or just try something new, JAI Muay Thai is the place to be. I highly recommend it!",
      "time": 1736768520,
      "translated": false
    },
    {
      "author_name": "Jasmine Kaur",
      "author_url": "https://www.google.com/maps/contrib/113783500822917949908/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLAn6NRGxcEHNZO-efkHGW3-DHsuGJ8FMp6jR76IUcE_uWHuw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Can’t recommend Jai Muay Thai enough—especially for a beginner like me who started with almost no skill and low fitness level. The coaches are incredibly patient, non-judgmental, and know how to make every session engaging. Each class is a full-body workout that pushes you but never feels overwhelming. An absoultely fun way to get fit. And if you struggle to sleep at night, the great workout after class guarantees a good night’s sleep! Perfect place for anyone looking to improve their fitness.",
      "time": 1745412988,
      "translated": false
    },
    {
      "author_name": "Gary Lim",
      "author_url": "https://www.google.com/maps/contrib/101638899952712749794/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVnJ_6_yeS_cNFYA0Xo_PnM0VdDymPZWNvBSqRTPlbtjPICvKZ5=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Jai Muay Thai is an outstanding gym for anyone looking to train in authentic Muay Thai Jeremy is patient, and dedicated to helping each student improve their technique and fitness. The atmosphere is welcoming, and the training sessions are both intense and rewarding. The gym is well-equipped, clean, and provides a great community for those passionate about the sport. If you're serious about Muay Thai or just looking for a great workout, Jai Muay Thai is the place to be!",
      "time": 1738291335,
      "translated": false
    },
    {
      "author_name": "Patrick Yap",
      "author_url": "https://www.google.com/maps/contrib/100463883128385962727/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWIpmREvWoKO35XmitNxT5YxhiqS7mRm_kNz7P0j2I3cQM4T1RznQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I’ve always wanted to join a fitness class to stay active, and I stumbled upon Jai Muay Thai while searching online. Since it was conveniently located near my home, I decided to give it a try and convinced my wife to join me for a trial class. At 44 years old and having been inactive for a long time, I wasn’t sure what to expect or if we could keep up with the training.\n\nAfter the trial session, we were so impressed that we signed up for a 3-month program. The environment was welcoming, and the training sessions were well-structured. What stood out was how the trainers allowed us to progress at our own pace as beginners, without any pressure. Jeremy, who greeted us, was incredibly friendly and helpful, setting a great tone for our experience. All the trainers were knowledgeable, approachable, and made the sessions enjoyable.\n\nEven though the training was tiring for us, my wife and I had a lot of fun. The friendly classmates added to the sense of community, making it feel like we were training with family. Now, we enjoy it so much that we attend classes at least twice a week and are even planning to increase our frequency.\n\nI highly recommend Jai Muay Thai, whether you’re aiming to compete or just want to adopt a healthier lifestyle. A big thank you to Jai Muay Thai and the trainers for creating such an enjoyable and motivating experience!",
      "time": 1732895128,
      "translated": false
    },
    {
      "author_name": "Dominic tan",
      "author_url": "https://www.google.com/maps/contrib/117941894614052439202/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUmKpoL1Fp72AOkhfKHF5ylH5sqWEgW3vkVIH8gWXPYaGrj6_5U=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Overall excellent experience here,\nCoaching is simply top tier,\nThis should be the gym of the year~\n\nVery pleasant and homely community. Those who fight are passionate and helpful, those who train for various reasons are friendly and welcoming. It's a great place for anyone who wants to do muay thai.\n\nPremier coaches that would pay attention to guide you through the classes. You know they are genuine from how fast they would remember the names of everyone, and how they cater to your technique flaws for improvement\n\nThankful for them (Jeremy, Caleb, Isaac and Halim)\n\nAlso 10/10 cleanliness",
      "time": 1738723376,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13421362110359051202",
  "user_ratings_total": 73,
  "vicinity": "3 Ang Mo Kio Street 62, #03-17"
}