{
  "formatted_address": "8 Jln Batu, Singapore 431008",
  "geometry": {
    "location": {
      "lat": 1.302235,
      "lng": 103.883272
    },
    "viewport": {
      "northeast": {
        "lat": 1.303573330291502,
        "lng": 103.8844251302915
      },
      "southwest": {
        "lat": 1.300875369708498,
        "lng": 103.8817271697085
      }
    }
  },
  "name": "Jalan Batu Park",
  "place_id": "ChIJIZCiu0IZ2jER_lVW0Tx3wIE",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "SM Shanto",
      "author_url": "https://www.google.com/maps/contrib/107533084589622880207/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWrtgBEnnt-2hYp1-S05Dl1vxKY0Pul1U6HdAVr-qE-1qU38iUO=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Jalan Batu Park, a serene oasis nestled in the heart of the city, beckons visitors with its timeless charm and a host of attractions that cater to all ages. The park is a haven of natural beauty, with its crowning glory being the venerable old tree, its gnarled branches providing welcome shade and an invitation to relax beneath its leafy canopy.\n\nFor those seeking an active adventure, the playground and three-quarters gym equipment offer ample opportunities for physical recreation. The air resonates with the joyous laughter of children as they frolic on swings and slides, and the rhythmic clinking of weights provides a backdrop to the visitors' fitness endeavors, the playground and three-quarters gym equipment offer ample opportunities for physical recreation. The air resonates with the joyous laughter of children as they frolic on swings and slides, and the rhythmic clinking of weights provides a backdrop to the visitors' fitness endeavors. Cycling enthusiasts can pedal along winding paths that wind through the park, with the whisper of the breeze and the rhythmic hum of rubber on pavement guiding their way. The park's outstanding fountain, a majestic centerpiece, delights the senses with its cascading waters, offering a tranquil respite in the midst of urban life. As you stroll through the park, the songs of birds provide a soothing symphony, and the sight of colorful flowers in the garden ignites the senses with vibrant hues and fragrant aromas. the songs of soothing symphony, the senses with vibrant hues and fragrant aromas. Finally, a thoughtful touch for the elderly, serene sitting areas are scattered throughout, where they can reflect, surrounded by nature's beauty. Jalan Batu Park is a multi-sensory delight, where nature and recreation seamlessly blend to create a haven for all.Finally, a thoughtful touch for the elderly, serene sitting areas are scattered throughout, where they can reflect, surrounded by nature's beauty. Jalan Batu Park is a multi-sensory delight, where nature and recreation seamlessly blend to create a haven for all.",
      "time": 1697042824,
      "translated": false
    },
    {
      "author_name": "茶柱タツ子",
      "author_url": "https://www.google.com/maps/contrib/104950464093711576018/reviews",
      "language": "en-US",
      "original_language": "ja",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVOp3ONHlGYw8OaIH1XIy6BQTOTFvZ9SyZDb_Ve57o1J5EqlFQ=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 3,
      "relative_time_description": "a year ago",
      "text": "There was a good wind blowing at night. It was unusually cool. It's a fountain surrounded by quite old HDBs.",
      "time": 1708172897,
      "translated": true
    },
    {
      "author_name": "Giang Trần",
      "author_url": "https://www.google.com/maps/contrib/116448695787724192296/reviews",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVaNvWLNz_P1I8e_kpLiKkvDxBSh4pTlZpK2MKuydfB_j3SmC8=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "",
      "time": 1715216982,
      "translated": false
    },
    {
      "author_name": "Irfan Oomsk",
      "author_url": "https://www.google.com/maps/contrib/118386546372014302757/reviews",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVTOFXCZTaIfQ136PqTrYdZtIP0Zj9XEqMIHIvM-hJjKGbWpdUWYg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "",
      "time": 1710638157,
      "translated": false
    }
  ],
  "types": [
    "park",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9349603929514989054",
  "user_ratings_total": 4,
  "vicinity": "8 Jalan Batu, Singapore"
}