{
  "formatted_address": "149 Sims Dr, Singapore 387380",
  "geometry": {
    "location": {
      "lat": 1.3158725,
      "lng": 103.8758073
    },
    "viewport": {
      "northeast": {
        "lat": 1.317598630291502,
        "lng": 103.8775499802915
      },
      "southwest": {
        "lat": 1.314900669708498,
        "lng": 103.8748520197085
      }
    }
  },
  "name": "James Cook University in Singapore",
  "place_id": "ChIJV0EzszEY2jERrXesJlWaK-8",
  "rating": 3.8,
  "reviews": [
    {
      "author_name": "Λαυρέντη Serles",
      "author_url": "https://www.google.com/maps/contrib/103581354969754396293/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVYY8l2nY6FYB_zi1ioqJDCVYzXWJhoACTxVGKygzsEDJRQOZqT=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "JCUS (known as James Cook University Singapore) is an excellent and reputable private institution! There’s many awesome majors they offer and there’s practical labs where you can hands on (depends on which major!) They offer different supports (eg. Counselling) as well as even learning support too! The canteen food is pretty average and prices are affordable as well! Recommended to go to the nearby hawker centre & market to have more food options! The professors & lecturers are okay! :) Assignments can be pretty heavy and it can be pretty cramp as the deadlines may be close to each other :) Otherwise, studying here in JCUS is a wonderful option! To those who plan to come here to study, this is the place :D",
      "time": 1737253912,
      "translated": false
    },
    {
      "author_name": "VISHWANATH TAWARE",
      "author_url": "https://www.google.com/maps/contrib/117070764436494668613/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWQkfpwVMWxpnbN8TF2aSV-gg5WS5J3qbPlFhl5smts65ydi5R1=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "My visit to James Cook University in Singapore was a wonderful experience! The guided tour was well-organized and provided a comprehensive look at the campus and its impressive facilities. Our guide was friendly and knowledgeable, sharing valuable information about the programs, campus life, and the supportive academic environment. The university’s commitment to student success was evident throughout. It’s a beautiful, well-equipped campus.",
      "time": 1730563477,
      "translated": false
    },
    {
      "author_name": "Jody Love",
      "author_url": "https://www.google.com/maps/contrib/115961295105099323493/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIeCpH9j74sg4KWitJQcz0T6hX790XCS_VV9bu22Uemkk4EQw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "The lecturers are great. They're very passionate about their field of study and are always enthusiastic when teaching and attending to questions. The lecturers always strive to improve and they always ask us to give feedback so they can learn from our experience and be better for our juniors. One even took another Masters so he could be a better lecturer for us both from an academic knowledge POV and from being able to relate to us, therefore knowing how to better support our studies.\n\nHaving lecturers from various countries enhanced our learning experience as the lecturers would often share case studies from their respective countries and share a POV different from ours.\n\nThe facilities and service are great. We have lots of study area options, friendly customer service, helpful staff, a wide variety of healthy food, clean classrooms, clean toilet with actual bidet in every stall, sports area, lots of activities and student clubs to attend, and more.",
      "time": 1728439794,
      "translated": false
    },
    {
      "author_name": "Trieu Hoang",
      "author_url": "https://www.google.com/maps/contrib/111786418045553628857/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWLORsctY3HVWgntQYF-boFE72aS5dA0KweiKOLMnXuKHzuIWME=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Studying at James Cook University Singapore was one of the best decisions I’ve ever made. The university provides an outstanding learning environment, with a strong emphasis on academic excellence, industry connections, and personal growth. As a former President of the Vietnamese Community Club, I had the opportunity to engage with a diverse student body, develop leadership skills, and contribute to a vibrant student life.\n\nOne of the biggest highlights was the incredible support from the university’s community, especially from Vietnamese Ambassador Selena. Her dedication to helping Vietnamese students adjust, connect, and succeed made a huge difference. Whether it was guidance on academics, career advice, or simply making new students feel at home, she was always there to support us.\n\nJCU Singapore doesn’t just provide education—it offers a life-changing experience. If you’re looking for a place that values both academic and personal development, this is the right choice! Highly recommended",
      "time": 1741319925,
      "translated": false
    },
    {
      "author_name": "God Of Earth",
      "author_url": "https://www.google.com/maps/contrib/104296429830676370299/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI9R52-B9OsmTFk59srtkL2sU8K-uEYeTOfnNI0e0GVQmxPEA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "The university’s current system is completely a mess. Students are required to attend campus daily, even on days when they do not have classes, for a minimum of three hours.  This is a waste of time most of the people.\n\nUniversity’s ceo must know every person is not free to come everyday. Choosing the school timetable for what ? waste of time.\n\nDon’t waste your time applying to this university.\nNo grants for work after you graduate from this uni.\n\nJust to clarify, there’s still an online class system for every subject. But remember, paying the school fees is to attend the class, not just the online class.\n\nThe two-hour tutorial session at the campus proved to be unproductive,as it lacked comprehensive explanations of the lecture slides. Furthermore, the online class did not teach detailed insights into the lecture notes.",
      "time": 1738742494,
      "translated": false
    }
  ],
  "types": [
    "university",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17234038089575069613",
  "user_ratings_total": 210,
  "vicinity": "149 Sims Drive"
}