{
  "formatted_address": "507 Yishun Ave 4, #01-07 NTUC Foodfare, Singapore 768454",
  "geometry": {
    "location": {
      "lat": 1.4155504,
      "lng": 103.8396956
    },
    "viewport": {
      "northeast": {
        "lat": 1.416931680291502,
        "lng": 103.8409670802915
      },
      "southwest": {
        "lat": 1.414233719708498,
        "lng": 103.8382691197085
      }
    }
  },
  "name": "JIN Kimchi Express (Yishun)",
  "place_id": "ChIJHUV-EgAV2jERcDln-onHJ9A",
  "rating": 2.6,
  "reviews": [
    {
      "author_name": "Yvonne Q",
      "author_url": "https://www.google.com/maps/contrib/103587866005920182342/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXjVXuK9HV7ZuGv5l3Zw9fC0-BCTcBrVWxsIRdGpGrkFwD4F8OvRw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 2,
      "relative_time_description": "4 weeks ago",
      "text": "Located at Kopitiam foodcourt opp naval base primary school. Was excited to try because of the hype. The food price is not cheap and taste is so so. Food was lukewarm. The side dishes are not fresh too. Won’t recommend or come back to this outlet again. Not sure if the food taste is consistent across other outlets.",
      "time": 1745218962,
      "translated": false
    },
    {
      "author_name": "Shaun Choo",
      "author_url": "https://www.google.com/maps/contrib/107389027488795210544/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKmMgNErbh-SoJaTbI7m6tGCbFsjVaid4lnFN023D_PYEGo4Q=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Missing one whole set meal when I ordered from grabfood and contacted the restaurant about it. Person that picked up the phone sounded like he couldn’t be bothered and just told me to contact grab about it. Didn’t even offer any sort of apology. If you’re too tired to do business. Just close your shop and take a good nap. Stop making TikToks as well, you need a good rest alright :)\n\nUPDATE: we decided to cook up some shin ramyun to make up for the missing food, and let me tell you the best dish of our dinner was the instant noodle. Tangsuyuk was like rubber, bulgogi stew was just sweet water with some rubbery meat. And the kimchi stew? I’ve never drank drain water before but if I were to imagine what it would taste like, it would taste exactly like how this kimchi stew tasted. Sour tasting water with not a hint of kimchi or spice. In hindsight, I’m glad they didn’t choose to deliver the missing item to me and I’ll be getting a refund instead (yay). If this is the “aUtHenTic” Korean food that the owner wants to bring to us, then on behalf of all Singaporeans, you can kindly bring it back to Korea or wherever this disaster came from and leave it there. Thank you",
      "time": 1745150340,
      "translated": false
    },
    {
      "author_name": "Liew Zheng Seong",
      "author_url": "https://www.google.com/maps/contrib/104693488358022877362/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLHfTmW6CZKqOS6nhpw0hFKJWE_cNLBtGST-0Y_ZO1VZkW1Vg=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "2 weeks ago",
      "text": "Saw their TikTok video and was near this outlet so wanted to try\nHad their grill pork belly for $7.90\nThe meal don’t come with a soup though the serving for the kimchi n cucumbers are generous. The meat is well marinated very flavourful but dry as it’s my very first time here I am not very sure if there is a sauce for it\nRead some of the past review about the lukewarm meat no improvement made kimchi is at room temperature too , I believe the meat is pre cooked and heated up when serve but It not well heated up , I don’t know if it’s intentional but had 4 slices of full fats ,\nMy verdict is the food is not very worth the price you are paying for",
      "time": 1746597410,
      "translated": false
    },
    {
      "author_name": "Rashidan Shane Tian",
      "author_url": "https://www.google.com/maps/contrib/110314411027697321585/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKC2jT5RctngGmM1xwGczL7s-83hqTKBkpPRy0LcJYB3sr7aA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "I hardly leave bad reviews but the service here could be improved. I was there at 10.50am and saw the lights were on. I wanted to do an advance order (to collect 2 hours later) for a family gathering. I called out if anyone was there but no one answered. I peered in and saw 1 guy in the corner using phone and blatantly ignoring me (At least tell me the stall haven't opened yet or something right). Even after I saw him, he side eyed me and shooed me away by saying they are not opened yet. I told me I'm doing an advanced order - thinking that he take note of it to prepare when the stall opens - but he just repeated curtly that stall was not opened yet. I gave up and walked away. No point shoving my business to a stall that obviously doesn't need it. But judging from the reviews I read from this stall on the quality of food, I guess I wasn't missing out on much.",
      "time": 1746933404,
      "translated": false
    },
    {
      "author_name": "Wee Xin Yi",
      "author_url": "https://www.google.com/maps/contrib/110782643450935056204/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV2SKe3lB-B5mRXm7praamiKwHRAobE2pRIbeXBqqbwviRrtwIo=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "2 weeks ago",
      "text": "i ordered Grab from here due to seeing the Tiktok & thought it would be nice to try. Ordered twice, first time was ok, soup was abit blend but ok. Both times, the packaging was impossible to open unless I used scissors. The spicy squid rice was way too spicy, it was impossible to be eaten & had to be thrown away. Despite the price, banchan was not sufficient & also does not taste \"authentic\" like the tiktok emphasized. even kimchi was too bland & watery. Will not buy again.\n\n3 stars is generous.",
      "time": 1746083527,
      "translated": false
    }
  ],
  "types": [
    "grocery_or_supermarket",
    "cafe",
    "store",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14999176479406242160",
  "user_ratings_total": 15,
  "vicinity": "507 Yishun Avenue 4, #01-07 NTUC Foodfare"
}