{
  "formatted_address": "625 Elias Rd, #01-328 Elias Mall, Singapore 510625",
  "geometry": {
    "location": {
      "lat": 1.378441,
      "lng": 103.94193
    },
    "viewport": {
      "northeast": {
        "lat": 1.379793680291502,
        "lng": 103.9431953802915
      },
      "southwest": {
        "lat": 1.377095719708498,
        "lng": 103.9404974197085
      }
    }
  },
  "name": "JL Recruitment - Indonesian, Filipino, Myanmar Maid Agency in Pasir Ris | Tampines | Bedok | Sengkang",
  "place_id": "ChIJZdXwlb492jERjuwsOgumNVk",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Shazia Shaikh",
      "author_url": "https://www.google.com/maps/contrib/103692966976389929986/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKdbkXPTUvuAudb4XLrRmI07iIKvqwnc70ZQMbT1NZOQqR2Nw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "I got to know of Cathy through two of my friends who highly recommended her, and I am so glad I took their advice. True enough, Cathy is an absolute gem of an agent. From the very beginning, she took time to understand our family's needs and recommended a helper who fits in perfectly with us. Her experience and intuition in matching the right helper to the right home is truly impressive. What sets Cathy apart is her dedication that goes beyond just completing the hiring process - she continues to assist even after everything is finalized. She's always ready to help, clarify and even communicate with the helper to avoid any misunderstandings. Her helpful nature, professionalism and genuine care make her someone I wouldn't hesitate to recommend. Thank you, Cathy, for making the entire process so smooth and reassuring!",
      "time": 1746694172,
      "translated": false
    },
    {
      "author_name": "Marvin Harris",
      "author_url": "https://www.google.com/maps/contrib/104678680555923170214/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVBXr3nko5OBqtEqeePhsEtyZrkMq3rBhLkATNvv70uM2Ymw6JOdA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "I would like to express my heartfelt thanks to Cathy from JL Recruitment for providing excellent service during our direct hire process  She helped our maid process all the necessary papers very smoothly and efficiently. Throughout the entire journey, Cathy was incredibly attentive, patiently answering all my questions and addressing any concerns. I did not experience any hiccups at all — everything was handled professionally and with great care.\n\nI highly recommend Cathy and JL Recruitment as your go-to maid agency. You truly can't go wrong hiring her for all your maid agency needs! Thank you once again, Cathy, for making this such a pleasant and worry-free experience!",
      "time": 1745745811,
      "translated": false
    },
    {
      "author_name": "Aileen Crystel Santos",
      "author_url": "https://www.google.com/maps/contrib/114727666284715803913/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUMtaOUqFYYE1Bp3QIMs5MMo6GtwSQaNbWfa060A4OjUGQU5BZh=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Cathy has been helpful in finding our current two helpers. We faced an unexpected challenge with a helper and Cathy was responsive, understanding, and actively worked with us to find a suitable replacement quickly. We highly recommend her services to anyone seeking reliable and supportive assistance in finding domestic help.",
      "time": 1747111101,
      "translated": false
    },
    {
      "author_name": "Muhammad Afiq",
      "author_url": "https://www.google.com/maps/contrib/111824548722554383884/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocItzneRRov6DAFwuyZvGwAEYmq8K4XHfEkb68dALFqRAKxwZg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "A quick search for a maid agency listed JL Recruitment with positive reviews.\n\nMe and my wife walked in, got in touch with Cathy, and wasn't turned away. In fact, she immediately attended to us (No other customers then) and was patient and professional throughout.\n\nThere were some hiccups with the first helper we chose, and she was quick to assist and come up with the next suggestion.\n\nShe's readily available to answer our queries, no question is too complicated for her to assist.\n\nOverall, appreciate the honesty ans sincerity of the staff at JL Recruitment!",
      "time": 1741697328,
      "translated": false
    },
    {
      "author_name": "HKC Lestari",
      "author_url": "https://www.google.com/maps/contrib/104666561499141828356/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocICAq2EytifNFM0F2CN1LSkePRPZNqjZ5FNelm15lhc5KOrLA=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Cathy provided great service in helping us to get a Myanmar helper. She even stayed late, after her official working hours, for assisting us in interview session of helpers. The helper has been with us for 2 months and she has helped us with many things. Thanks Cathy for your assistance and providing smooth arrangements for the helper so that she can work with us.",
      "time": 1740962158,
      "translated": false
    }
  ],
  "types": [
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6428226610292124814",
  "user_ratings_total": 319,
  "vicinity": "625 Elias Road, #01-328 Elias Mall"
}