{
  "formatted_address": "510 Thomson Rd, #04-01A SLF Building, Singapore 298135",
  "geometry": {
    "location": {
      "lat": 1.3330281,
      "lng": 103.8389255
    },
    "viewport": {
      "northeast": {
        "lat": 1.334286530291502,
        "lng": 103.8402161802915
      },
      "southwest": {
        "lat": 1.331588569708498,
        "lng": 103.8375182197085
      }
    }
  },
  "name": "Julia Gabriel Preschool, Thomson",
  "place_id": "ChIJOfm3cNMX2jERflADnPELvPg",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Fidi Hassim",
      "author_url": "https://www.google.com/maps/contrib/102166368148227301819/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK137CbJOXQEGOVwRi8WCpVrP8YvLb2wROX-kNj3GqaCtVPcw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I'm thrilled to share my positive experience with Julia Gabriel Thomson where my 3 year old attends! From the moment we stepped through the doors, we were greeted with warmth and enthusiasm by the staff. The space itself is absolutely wonderful, providing a safe and inviting environment for children to learn and grow.\nThe layout of the preschool is thoughtful and conducive to learning  the classrooms are bright and spacious with plenty of educational materials and age appropriate toys to stimulate the young minds.\nBut what truly sets this preschool apart is its incredible staff. The teachers & other staff are not only highly skilled and experienced but genuinely caring and compassionate individuals.\nI couldn't be happier with our experience at Julia Gabiel Thomson. It's a place where my daughter feels happy, safe and loved and as a parent, there's nothing more I could ask for.",
      "time": 1713424678,
      "translated": false
    },
    {
      "author_name": "Al. L",
      "author_url": "https://www.google.com/maps/contrib/113347660454757545633/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJSaZYRdhXb9RIg7JW_ogL2Og6XVRK1ZG_elVLrEG8__j8rDg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Our experience at the Julia Gabriel Pre School (Thompson) has been nothing short of exceptional. From the moment we enrolled our son, we knew we made the right choice. The teachers are incredibly warm and loving, providing not just education but genuine care and support for each child.\n\nOne of the highlights for our son has been the drama program. Not only has it been incredibly enjoyable for him, but it has also played a significant role in boosting his confidence. It's heartwarming to see him grow in such a nurturing environment.\n\nThe school goes above and beyond with its diverse range of activities. From cookery classes to book week celebrations and exciting outings, there's never a dull moment. We appreciate how JGPS embraces all occasions, making every day special for the children.\n\nOverall, JGPS is not just a preschool; it's a vibrant, fun-filled haven for children to learn, grow, and create lasting memories. We couldn't be happier with our choice and highly recommend it to any parent seeking an enriching experience for their child.\n\nThank you to the entire team at JGPS Thompson for all that you do!",
      "time": 1712805453,
      "translated": false
    },
    {
      "author_name": "Poh Hui Chia",
      "author_url": "https://www.google.com/maps/contrib/101342786269538282626/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL2efLvKrDJwsWwgKXe0EqRFaODBldUG7MouKTsWTp4lCC4kg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "A school with a great program and very loving teachers. Our little one loves going to school and enjoys the healthy and delicious meals provided. Their speech and drama program is amazing and children develop a strong sense of confidence through it.",
      "time": 1714620137,
      "translated": false
    },
    {
      "author_name": "Shoba Sivam",
      "author_url": "https://www.google.com/maps/contrib/116005170744747631875/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLATwBReXPXHCDxVpa0n4WBLrCLzwOOyH36YsxsB2PWCmZofg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "If you see someone without a smile,  give them your smile that's what Thomson Julia Gabriel Preschool is all about. All my 3 children grew in Julia Gabriel Preschool. I am a proud parent.",
      "time": 1713428218,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17923213749360218238",
  "user_ratings_total": 4,
  "vicinity": "510 Thomson Road, #04-01A SLF Building"
}