{
  "formatted_address": "60 Jurong West Central 3, Singapore 648346",
  "geometry": {
    "location": {
      "lat": 1.3408631,
      "lng": 103.7045787
    },
    "viewport": {
      "northeast": {
        "lat": 1.342350780291502,
        "lng": 103.7059036802915
      },
      "southwest": {
        "lat": 1.339652819708498,
        "lng": 103.7032057197085
      }
    }
  },
  "name": "Jurong Medical Centre",
  "place_id": "ChIJsb79QJMP2jERJCl3szIIBsM",
  "rating": 3.4,
  "reviews": [
    {
      "author_name": "SeungJun Kim",
      "author_url": "https://www.google.com/maps/contrib/100958975977925692266/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUhEAorS3l-1-W-X2FYrpnDwwK2xAbVYJYgAxOEB6kYNi1bOB6K=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "A very spacious medical centre near Boon Lay MRT station which requires appointment/referral from doctors/Polyclinics prior to visit (no walk-ins). I visited on a weekday afternoon and it was quite empty and less waiting time. Doctor and Nurses were friendly too. Next time I need to see a specialist, I might ask for JMC",
      "time": 1714031351,
      "translated": false
    },
    {
      "author_name": "Melissa Grey",
      "author_url": "https://www.google.com/maps/contrib/103101426252139913301/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU3pTqo1830ZQ19qpijbtdw2EKjnquqhKRnTMibSU6oLe4qyp6O=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "2 weeks ago",
      "text": "Never visiting here again even if was recommended by polyclinic. I was referred here for my pregnancy check-ups. Everything was fine, it was fast and not crowded. But the doctor is always rushing to check me cause she need to go. Every scan checks wasn't fun because it's rushing. But i wasn't informed about any infection until i gave birth. The doctor at NUH who helped me during labour told me i have infection going on for awhile. While the doctor who frequently check me at JMC was there, she didn't even check or speak to me. Just gave a quick glance and left. 3 days after i gave birth, the nurses from JMC called me and ask if I'm going to come for my next appointment. I was confused as i already give birth so why shld i come again. Doctor sarah was there and she saw me. Felt like she didn't communicate with the nurses.",
      "time": 1746246860,
      "translated": false
    },
    {
      "author_name": "Karen",
      "author_url": "https://www.google.com/maps/contrib/110538936036774232087/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL2KRtz7In_61K15-JeeH21ll9u_0dGV-UP-F6dVB5TG7EeUw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "I brought my mum for her eye check up on 20 Mar 2025 to review the status of her cataract in both eyes.\n\nUnfortunately, we had a bad experience with the doctor, Dr Hao Lei who attended to my mum. He mentioned that my mum delayed her cataract op and further delaying will result in failure of the op. However, my mum has been going to JMC for her regular checks for the past 5 years, and never once did the JMC doctors recommend for her to go for cataract op. Also, how can a doctor mentioned that the surgery will fail, causing unnecssary alarm to the patient. In addition, Dr Hao Lei said my mum's cataract cannot be delayed any longer, but he never folllow up to schedule any appointment for the op.\n\nTherefore, I requested the doctor to refer my mum to SNEC for op if JMC is unable to handle her case. To my shock, Dr Hao Lei's attitude changed. He said \"ok loh, its your choice and that he could only write a discharge letter.\n\nFor now, I am planning to bring my mum for her cataract surgery via the private route as I have lost confidence in JMC's doctors' professionalism.",
      "time": 1743859874,
      "translated": false
    },
    {
      "author_name": "Liza Asri",
      "author_url": "https://www.google.com/maps/contrib/114314608268489597003/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIwycME7mL7E7hxpLZnINX3VJbgXRmYaNHI3alXxNuxAWjo0Hk=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I went for a colonoscopy on 14 Jan 2025. From my pre-procedure consult to the day itself, everything was done professionally, efficiently, meticulously and with care. I even received a courtesy call a day after to check on my wellbeing.\n\nThank you Dr Daniel Tan and the team from JMC! You guys are truly healthcare professionals 💐🎉",
      "time": 1736930481,
      "translated": false
    },
    {
      "author_name": "Nabilah H",
      "author_url": "https://www.google.com/maps/contrib/114874752090384031155/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKvU6vG3h39J4f1nhQCkDurnkHa0KsIhHrI8_JoVu17qmjliw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Never encountered such horrible service by a healthcare professional until today. Was at JMC today, 26 July, 9am to accompany my mom for her 9th mthly check up. As usual, we would take the Q and my mom will head to room 61 for preliminary check. Nice and friendly nurses. Then it was at the imaging room that my mom encountered a very rude (specialist/nurse?), MS ANG JUN JIE. no morning greetings, nvm.. but she doesn’t have to shout at my mom who can’t hear well!\n\nI usually do not enter with my mom to the imaging room 53 bcuz it’s usually a fast procedure. (Luckily), the door was opened so I could hear their convo. I heard Ms Ang asking for my mom’s IC number twice (soft and mumbled btw) but my mom didn’t get what is required of her. She apologised to get her to repeat but was shouted at by Ms Ang. I was so shocked; I stood up and check in with my mom in the room. Never have I spoken to my mom in that tone eventhough she has a little bit of hearing issue!\n\nShe later gave instruction to turn left which my mom did and only then I realise she meant to move to the left without turning her body. “put ur chin and ur forehead there”- another (unclear) instruction she gave to check the eyes on the machine. My mom didn’t understand, probably still embarrassed/in a shock state for being shouted at like that. She placed her chin wrongly and Ms Ang “tsk” with an irritated look and said “put ur chin on the left side….and rest ur forehead” . I purposely repeat and explained to my mom gently using my normal tone; pointing exactly where to put her chin and forehead. Knowing that my mom could follow my instructions, Ms Ang in defence told me that my mom couldn’t hear well. I firmly said to her that my mom can hear okay if she ask/say things clearly and properly. Doesn’t help especially when you are masked- words generally becomes muffled! She even pointed to the door to get me to close the door. There were no “please” and no “sorry”. Was that rude?\n\nMs Ang doesn’t show enthusiasm/care at work, and doesn’t empathise with her patients. Working with mostly senior patients (I believe), she needs to learn to be patience and guide/show patients proper (eg, where to place chin etc) and speak gently with respect. Not sure if it’s because of her pregnancy that she is acting such way but it was very unprofessional. No one should be unfairly treated - rude and condescending!\n\nPlease, if there is no motivation to work in such industry, leave. Put away personal issues and take leave if you are unwell. Be professional, period.",
      "time": 1704328842,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14052928701108529444",
  "user_ratings_total": 67,
  "vicinity": "60 Jurong West Central 3, Singapore"
}