{
  "formatted_address": "61 Jurong West Street 65, Singapore 648348",
  "geometry": {
    "location": {
      "lat": 1.3358625,
      "lng": 103.7016785
    },
    "viewport": {
      "northeast": {
        "lat": 1.337485430291502,
        "lng": 103.70521635
      },
      "southwest": {
        "lat": 1.334787469708498,
        "lng": 103.70029015
      }
    }
  },
  "name": "Jurong West Secondary School",
  "place_id": "ChIJibwBko0P2jERY3OuWOHJMtI",
  "rating": 3.8,
  "reviews": [
    {
      "author_name": "Rewardfors2 Official",
      "author_url": "https://www.google.com/maps/contrib/106005527641033882114/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX73LrsdzQ91o9KKTDadPQ91TJPcWjuSe6DvNZbnL2CCykmY6Ci=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Librarian kicked us out when we went in for 4 minutes we just wanted to go to the other side then the librarian said we were causing trouble, we did nothing wrong besides just walking and there were literally people shouting at the back and they got to stay. Never coming back to the library again after this😔",
      "time": 1740786377,
      "translated": false
    },
    {
      "author_name": "Hong Cheng Yi Mikkiel (Jwss)",
      "author_url": "https://www.google.com/maps/contrib/110962911221122602523/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocINvVrIh3P8VlgrJqpML4l-m6Igz43qIv_DRNRoefORjxlMdA=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "there are good things that happens to the school but I know some teachers are bad but honest experience was fun as the friends we made and the teacher was kind for example teachers like mr william hong, miss maggie, mr benjamin low and don't forget mr rayner goh. the teachers there help me to improve on myself and my result changed too, I used to be in all NT but with all of there help, I am now in 3 express and rest NA. I am currrently in sec 3 and I reccomend you to send your school here. There are 2 leadership role u can have, if you like to do in school event like sport day, prom and cross country you should join student council (SC) but if you like to help people from outside of school and help with the environment u can join the student ambassador (SA). we have 3 camp in total in our sec life, sec 1 will have orientation camp, sec 2 will go for outdoor camp and sec 3 will go for OBS which will increase the friendship bond and know how to survive outdoor. In sec 3 we will also get to go for osep which they will bring you to other country to learn more about there culture and don't forget when N/O level is coming, they try there best to help you as much as possible and will never give up. There are many points I can say and if you want to learn more please go to my ig account Dr2ppy_me to know more about this school and I hope when it is time for your child to choose a secondary school you will choose this school.\n\nig account: Dr2ppy_me",
      "time": 1736428883,
      "translated": false
    },
    {
      "author_name": "Naufal Hadi Razali (Jwss)",
      "author_url": "https://www.google.com/maps/contrib/114257269558539304431/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL3YnnEq6o61gPOtanxeUGxioRYUAqTUsg-8QyjN4j45p7ByQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I voted for a school president but nothing changed lowkey kind of a waste time sometimes",
      "time": 1737593689,
      "translated": false
    },
    {
      "author_name": "sad timr",
      "author_url": "https://www.google.com/maps/contrib/112495620604366119000/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUsRufq4iYuG7K7ludDBWH_d1Ged9i08OMIPo_VWY5tS5jI4To=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Replying to the earlier reviews abt the sch having horrible trs and staff and abt ur daughter being \"depressed\", just so you know, firstly, I am in the same class as whoever your daughter is as I also had to copy 10 times for failing my chem exam. The teacher did this as a strategy to help us make sure that we understand the topics in the exam and so that we would not mess up these questions again next time. And for the scolding part? Literally most teachers would scold if someone fails their exam. The teacher would literally want the best for the student so that the student can do good for their N/O Levels and be able to secure a spot in whatever school they want, and literally have a good future.\nAs for the horrible trs, well I sort of agree with you on that because there are some teachers there who are bias. BUT there are also some teachers there who are NOT Bias and literally are super kind and helpful. For the staffs in our sch, honestly, I have never rlly met a rude staff before, as most of the GO staff I met is kind and is helpful to me.\n\n(i love writing 1 entire paragraph 😆😆)\n(sounds abit cringe ngl :/ )",
      "time": 1698805669,
      "translated": false
    },
    {
      "author_name": "husna jamal",
      "author_url": "https://www.google.com/maps/contrib/109433489398892427070/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIBKYl6-sOZaM3zMfkmblsutefHVulM9IA8uHHaFv74QMqw0Q=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Not recommended to join at all! Teachers are rude and mean, ever since my daughter came to this school, she's been getting more and more depressed.. everyday, she would complain to me about the school.. No early dismissal, come home at 4pm everyday... and teachers care more about attire then the student's mental health.. Recently, my daughter told me that she got scolded for failing her Chemistry exam.. and was told to rewrite the entire thing including corrections on foolscape 10 times. Please don't consider this school if you don't want your child to become depressed.. absolute worst!..",
      "time": 1687352615,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15146390466493051747",
  "user_ratings_total": 65,
  "vicinity": "61 Jurong West Street 65"
}