{
  "formatted_address": "88 E Coast Rd, #02-06, Singapore 423371",
  "geometry": {
    "location": {
      "lat": 1.304869,
      "lng": 103.90442
    },
    "viewport": {
      "northeast": {
        "lat": 1.305919380291502,
        "lng": 103.9058679302915
      },
      "southwest": {
        "lat": 1.303221419708498,
        "lng": 103.9031699697085
      }
    }
  },
  "name": "Kaboodle Pte Ltd",
  "place_id": "ChIJ2fHpD2UY2jER2ccgrYn66iA",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Regina Anthony",
      "author_url": "https://www.google.com/maps/contrib/101247578404862924179/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVZ5e-pP40gld4uNxPGdPN8x7BDOD4qHIBsnqsHFnaa2M1WhkzL=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "My son’s 5th birthday party was conducted at Kaboodle. And it was a memorable party, with lots of fun, play and food. Even with large guests list (around 70), the kids had the space to enjoy their open ended games and the adults enjoyed their conversations and beverages. As hosts, i enjoyed the party while the Kaboodle Team took care of the logistics. An aspect I liked about the Kaboodle party is the attention given to the adults , with specific menu and unlimited coffee/tea. I am thankful to the Kaboodle Team for making my son’s party a grand success 👍",
      "time": 1746351448,
      "translated": false
    },
    {
      "author_name": "calista chan",
      "author_url": "https://www.google.com/maps/contrib/104982203388219211719/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWiqUQbFQLwrhp7BwEVAwgK02P3WoVnmYYpGWdxEwpTvMr1roE=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "I had my daughter’s 3rd Birthday party here and we had such a wonderful, ease free time! Not just the many kids but the big kids (parents) as well. The kids love the open play toys (the set up was awesome), food was colourful n yummy and not to mention the service crew were responsive and lovely! Kudos to the Kaboodle team :)",
      "time": 1745747266,
      "translated": false
    },
    {
      "author_name": "Pooja Gopal",
      "author_url": "https://www.google.com/maps/contrib/107588061462926747474/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUCXVBxxIPDQ8ox41Irenrg4SfMjfEUv92EVWWwas44KcD7P-xMnw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Celebrated my daughter's third birthday at Kaboodle and was certainly a memorable experience for the adults and kids alike. The kids had a blast with all the available play material in a safe and calm space. The staff were kind and extremely efficient at accommodating our requests and wanted to ensure everyone had a good time . Not to forget, the food was amazing too and beautifully arranged for us!",
      "time": 1742117149,
      "translated": false
    },
    {
      "author_name": "Sachiko S",
      "author_url": "https://www.google.com/maps/contrib/110764224178723393567/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKMXuXvzjGw_OY9FIkGTjDqNMn0LPRfTHxh7dHGlp41hpp_0Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Kaboodle is my son's favorite playground and we decided to have a birthday party there one week before the party date. Even though it was a super last minute, Kaboodle kindly helped us make it happen!\n\nWith 45 children and adults, we were expecting some issues will arise but the entire party was as smooth as possible. Amazing!\n\nThe block playing area was beautifully arranged before the party started so that the children were super excited when they arrived. While they were busy constructing and destroying blocks, adults could enjoy the fresh snacks and drinks. Many of our guests commented how wonderfully Kaboodle prepared the food. The home-made hummus was a winner 🏆\n\nAfter 1.5 hours into the party, we had a cake ceremony followed by kids' food. Kaboodle took care of everything - taking pictures, singing the happy birthday song, blowing candles, distributing pasta, cutting the cake and make sure everyone could taste it, etc. so that we could relax and enjoy the party 👍\n\nThank you, Jin and the staff at Kaboodle, for making our special day even more special! We will be back 🥰",
      "time": 1737873801,
      "translated": false
    },
    {
      "author_name": "Dawn Sin",
      "author_url": "https://www.google.com/maps/contrib/111775448506188967948/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW-2xeA68AolKkQnZmpDuA7u8m1i990IiYZsbGtqXnqiXZ-kxU=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We held our son's birthday celebration at Kaboodle and it was a really good experience. The space is already a cosy and beautiful set-up, so we didn't feel the need to add on anymore decorations save for a happy birthday bunting. Jin and team did a great job with the food, which was wholesome yet tasty! Several of my boy's guests lauded the baked pasta while I personally really liked the hummus and the beautiful, fresh fruits. Not to mention, the drinks were plentiful too.\n\nI was worried at first that the boys might get bored of the blocks play area after a while, but by the end of the party, I honestly believe they could have gone on for another hour or two. It was a great 2.5 hour session of screen-free play. I also wasn't expecting Jin and her team to set up the blocks so beautifully at the start, knowing that the blocks would surely be knocked over by the children in no time. But they took the effort to set up the blocks in a really inviting manner, and I was really impressed by their dedication.\n\nMy boys and their friends had a really good time at their Kaboodle party, thank you to the team!",
      "time": 1742829919,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2371983622986057689",
  "user_ratings_total": 141,
  "vicinity": "88 East Coast Road, #02-06"
}