{
  "formatted_address": "9 Thong Soon Ave, Singapore 787436",
  "geometry": {
    "location": {
      "lat": 1.3973019,
      "lng": 103.8187356
    },
    "viewport": {
      "northeast": {
        "lat": 1.398669330291502,
        "lng": 103.8201990302915
      },
      "southwest": {
        "lat": 1.395971369708498,
        "lng": 103.8175010697085
      }
    }
  },
  "name": "Kaizen 4 Dogs Training & Daycare (formerly Ginny & Friends)",
  "place_id": "ChIJS8dKiVQR2jER3Cq17O-L9xo",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "wenlin tan",
      "author_url": "https://www.google.com/maps/contrib/102614000997597188589/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocITd-x9Ou30dbQNQM_TpzNRkPnc2rIsXLa4KBPbl9a9tQb03g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "Honestly, meeting Candy and the Kaizen team has been such a comfort. As a first-time owner with a young rescue pup, I was feeling pretty overwhelmed with things like mouthing, barking, lunging, even a bit of resource guarding. Thanks to Candy's guidance, I’ve grown a lot more confident, and my SS has improved so much — especially with leash walking and learning how to play properly with other dogs. We’re definitely still a work in progress, but what makes Candy so special is that she doesn’t just care for the dogs — she really cares for the owners too. She shares her knowledge with so much patience and understanding, and it means a lot to have that kind of support, especially when things feel tough. I’m really grateful to have found a community like this, and a safe, happy space for my pup when I’m away.",
      "time": 1745225464,
      "translated": false
    },
    {
      "author_name": "lisa leong",
      "author_url": "https://www.google.com/maps/contrib/111367233798063373078/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVr5RAox87GYQyBLKC1SfE1rVNkmKN87M1m03xMY2HV0b_xLXIP4A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "We are so grateful to have had Candy from Kaizen 4 Dog guide us through the training process with our new puppy. As first-time pet owners, we adopted an 11-week-old Singapore Special and had little experience in caring for or training a puppy. Thanks to Candy's expert guidance and support, we've gained the confidence we needed, and our 20 weeks old puppy is thriving. Candy’s patient and encouraging approach, paired with her knowledge of positive reinforcement training, has made the process smooth and stress-free. We highly recommend Candy and Kaizen 4 Dog to anyone seeking professional, supportive dog training!",
      "time": 1734774788,
      "translated": false
    },
    {
      "author_name": "Loretta Tan",
      "author_url": "https://www.google.com/maps/contrib/114847868929361736425/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ0UFcbCtVxYDChXJzH3CzU3PcT4JlkHLvMdgGez8JaeQqSJg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Ginger has benefitted SO MUCH from learning and staying at Kaizen, the trainers and staff at Kaizen are so loving and caring of all the dogs' safety and needs. I have learned so much about dog behavior, what signals to look out for to understand why dogs do certain things and what they are telling us with their body language. I'm so grateful to Candy for the very informative training sessions, and so happy that I can always rely on Kaizen for daycare, I know the Ginger is in the best care.",
      "time": 1742973176,
      "translated": false
    },
    {
      "author_name": "Julian Soh",
      "author_url": "https://www.google.com/maps/contrib/109134988895788784844/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJm4Jieb9hTXjcGjBBjsgtNil6hZU4Vq6_oHQLBgscKeMRNKQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "If you're looking for a top-notch dog training experience, Kaizen 4 Dogs Training & Daycare is the place to go!\n\nAfter I recently adopted a Singapore Special puppy and enrolled with Kaizen, we noticed a significant positive change in my dog's behavior. Trainer Candy is incredibly knowledgeable and patient, and truly care about every dog's well-being. My dog is becoming more obedient, confident, and well-behaved. The training sessions were engaging, effective, and tailored to my dog's specific needs.\n\nCandy offers valuable tips, advice and support every step of the way. It's clear that she and her team are passionate about what they do, and I am so grateful for their guidance.\n\nJulian Soh",
      "time": 1743265356,
      "translated": false
    },
    {
      "author_name": "Leon",
      "author_url": "https://www.google.com/maps/contrib/101411911311166950470/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUX37nw8hKqCv-3S_U-8lj3pgElaQDAjCbHiuwWL0_jh73SJiWm=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "First time trying out boarding my dog at Kaizen4Dogs and it was a great experience. Candy looked after my Labrador and she was very knowledgeable and trustworthy. Felt completely comfortable during my travel with the understanding that my lab is probably enjoying his boarding more than his own home! Highly recommended for anyone looking for an absolute safe haven for their dogs to be in the care of qualified professionals.",
      "time": 1674567009,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1943175626818398940",
  "user_ratings_total": 37,
  "vicinity": "9 Thong Soon Avenue"
}