{
  "formatted_address": "167 Jalan Bukit Merah, Tower 4, #03-15 Connection One, Singapore 150167",
  "geometry": {
    "location": {
      "lat": 1.2827221,
      "lng": 103.8184563
    },
    "viewport": {
      "northeast": {
        "lat": 1.284090080291502,
        "lng": 103.8197315302915
      },
      "southwest": {
        "lat": 1.281392119708498,
        "lng": 103.8170335697085
      }
    }
  },
  "name": "Kaleidoscope Therapy Centre Pte. Ltd.",
  "place_id": "ChIJXdnfeOYZ2jERAwxhuHyXr8g",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Catherine Hu",
      "author_url": "https://www.google.com/maps/contrib/113747990489074408888/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKm7A727m1Q3QuTL29OmZR4RgCH8u9SW7xFNQbK77LQ8VFAYQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Therapists and staff are very friendly, helpful and professional. They offer good advices at all times and are very responsive.\nMy  child first attended speech therapist and had good results. Therapist is very experienced, patient and observational. She suggest for occupational therapist for other developmental needs. All the therapist are very knowledgeable and able to prescribe activities suitable for child based on their assessments.",
      "time": 1682311195,
      "translated": false
    },
    {
      "author_name": "Raghavan Nagarajan",
      "author_url": "https://www.google.com/maps/contrib/105356267930889241853/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWECmOycK4i0CUSPAomnnafvALuAnGGUQ6L0KXAdv_mrcvVgqmw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "My daughter attends the Early Intervention Program (EIP) at Ready Let's Go (RLG), which is run by Kaleidoscope. In her 18 months since joining,  she has made tremendous progress in her abilities to speak, socialise and learn, all credit to the unique non-ABA based pedagogy followed by them. Its been an amazing experience for my daughter here, she most importantly enjoys going to her RLG school everyday,  the therapists and teachers are very accommodative of every child's unique needs and the weekly regular updates they provide are very insightful.  With several special school and therapy centers mushrooming around Singapore (mostly for business prospects due to higher rates of diagnosis these days), Kaleidoscope is one of the most trustworthy institutions I can vouch for! They go by following the child's lead, which I believe is the right strategy. The gyms and classrooms are very big and spacious and clean, well lit up and cozy!  The program leads Zanel and Judith are amazing too! As the parent of a special child, it gives me an extreme sense of satisfaction that my daughter is in the best hands at her school! Kudos and hats off to the Ready Let's Go team at Kaleidoscope for their unique EIP program and their accommodative, loving approach to working with the kids!",
      "time": 1684028771,
      "translated": false
    },
    {
      "author_name": "FL Ow",
      "author_url": "https://www.google.com/maps/contrib/106064618902700247492/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUfUdk6xSAvR7mKkRj5CspcaOlPsvQHVK6NYnEAPjoOev8l8ik=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Been sending my child there for almost a year and I’ve seen amazing improvement in terms of their ability to communicate. The teachers there are amazingly committed and it really comes across. Of special mention are Ms Judith, Ms Zanel and OT Kris, who have given my child so much attention and has led to so much tangible improvement. It’s a long journey and I’m just glad the team is there to help guide my child along.",
      "time": 1684066051,
      "translated": false
    },
    {
      "author_name": "Aparna Ravi",
      "author_url": "https://www.google.com/maps/contrib/115132857668658845779/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUe0YZHO4T7tzJWc1sgUTDCZSFmyNaPZXh8x2R1rGTa1e84FT7P=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Our son has bene attending early intervention program at Ready Let’s Go for almost 2 years. He has seen significant progress with his communication and physical development. The teachers and therapists at RLG are experienced and supportive of working with each child’s strengths and areas of development. They are very responsive work closely with the parents for the areas of development.",
      "time": 1684117047,
      "translated": false
    },
    {
      "author_name": "Gayatree Gupta",
      "author_url": "https://www.google.com/maps/contrib/108514097423248987068/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK7gPC4oyVauTKgwJ8QRocJSTGmMmn8aEHElFW5W4L12ssM-Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "I have been going to Kaliedoscope with my daughter for the past 2 years\nIt has been one of the most caring and kind places with very experienced therapists.\nHaving a child on the severe end of the spectrum is not easy, but their therapies and their devotion has seen a huge change in her.\n\nFrom a child who sat in a pitch dark room on a swing with her mother, to confidently attending their Ready Let’s Go program….\nI never thought I would have the luxury of time to eat or work during therapy sessions. But I am so delighted and amazed with her steady progress.\n\nI have been around the world, NYC to LA to India, but having CONSISTENT, EXPERIENCED therapists has been a game changer for our family.\n\nI would insist that families allow for every child to deal with their disabilities and issues in a caring and supportive environment.\n\nIt’s wonderful to be able to think there a possibility, that my child can be happy, independent and healthy.\n\nI cannot recommend them and their therapists enough.\n\nPS - it also great they have a huge space on two floors with so many gyms!",
      "time": 1660629272,
      "translated": false
    }
  ],
  "types": [
    "physiotherapist",
    "health",
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14460943490435058691",
  "user_ratings_total": 18,
  "vicinity": "167 Jalan Bukit Merah, Tower 4, #03-15 Connection One"
}