{
  "formatted_address": "383 Jln Besar, Singapore 209001",
  "geometry": {
    "location": {
      "lat": 1.3131713,
      "lng": 103.8597062
    },
    "viewport": {
      "northeast": {
        "lat": 1.314482530291502,
        "lng": 103.8611282802915
      },
      "southwest": {
        "lat": 1.311784569708498,
        "lng": 103.8584303197085
      }
    }
  },
  "name": "Kam Leng Hotel",
  "place_id": "ChIJ8dyT1s4Z2jERlSPZfnkDtPk",
  "rating": 3.6,
  "reviews": [
    {
      "author_name": "Manuel Stasi",
      "author_url": "https://www.google.com/maps/contrib/100840359643565342649/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUNJdniAUvbY1ItJSl0CJguQocoFTJvRz9-1bke5HNWPeho8PtYjA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "The Kam Leng Hotel is currently undergoing renovations, which is something to be aware of. Unfortunately, during our stay, the elevator was out of service, and our room was on the fourth floor. The view while walking up the stairs wasn't particularly appealing, with stacks of tiles and various odds and ends visible, along with some questionable taste in dividing curtains along the way.\nHowever, don't let the initial impressions fool you. Once inside the rooms, they are actually quite nice and well-equipped with everything you might need, including a hairdryer, shampoo, shower gel, and a lovely spacious shower with three different spray settings. The rooms were also clean. We appreciated the welcome water, and the air conditioning was modern, quiet, and worked very well.\nWhat truly stood out was the kindness of the staff and the manager. They were always very accommodating to our needs. Despite the ongoing renovations and the elevator issue, the quality of the rooms and the excellent service make for a positive stay overall.",
      "time": 1747149565,
      "translated": false
    },
    {
      "author_name": "Ritendra Chinari",
      "author_url": "https://www.google.com/maps/contrib/102489920351871589457/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ6X4IwS9opg2dCO8rfPNFoS8wdHZ5cxpOutOkKsB02tpFD_Q=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "The rooms are very tacky. So small that you can't even open a suitcase. Size not suitable for a family of 3. There is no wardrobe or any sort of storage space.There is no window in the room. There is a window in the bathroom. I don't think it will be classed as \"room with window\". The AC is not working. It was hot the entire night even when the AC was set at 16 degrees.  The room inside was clean.",
      "time": 1744146024,
      "translated": false
    },
    {
      "author_name": "khanza aulia",
      "author_url": "https://www.google.com/maps/contrib/102050862113813070236/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV35FQHXuKPFOYNBSR3FuIBCR-COG4vsgh_65OVkvUR53TC0Sk=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Had a pleasant stay in here for three nights. Near the bus stop and 711. The check in time was 3pm yet turns out we can get in earlier. We got spacious room, enough space for pray and stuff. Thank you, Kam Leng Hotel!",
      "time": 1746751004,
      "translated": false
    },
    {
      "author_name": "KiD Warr",
      "author_url": "https://www.google.com/maps/contrib/100543091533303513588/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWa8Zq7sASm_74RlghW6N26lu4v3wE45IVcfzdM8ouzG_MaGybH=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "The property offers excellent value with good staff and well-maintained facilities. The bathroom was clean and functional especially rinsing spray!, and the location is convenient for walking to nearby spots. 7-11 just opposite the hotel. While the room size could be improved for added comfort.\nOverall, a pleasant stay with good amenities.\nLocation is good for stay but not close to tourist spots.\nI’ll book this hotel again when I come back Singapore.",
      "time": 1741805759,
      "translated": false
    },
    {
      "author_name": "Henricus Angga",
      "author_url": "https://www.google.com/maps/contrib/109034905141299114572/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXDI2H4cStuhC9KJJ961LNFVZfoNDKrF_IFVr4xP1lu63oEUnM=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I recently stayed at this hotel in Singapore and had a pleasant experience. The best part is the affordable price, making it a great option for budget-conscious travelers. The staff were very kind and helpful, always ready to assist with any requests.\n\nThe atmosphere around the hotel was peaceful, which made it comfortable to rest after a long day of exploring. Despite being in a quieter area, finding food was not a problem—there are plenty of options nearby.\n\nOne of the most convenient aspects is that the hotel is right in front of a bus stop, making it easy to get around. However, the MRT station is a bit far, so if you prefer traveling by train, you might need to take a short bus ride first.\n\nOverall, if you're looking for a budget-friendly and comfortable place to stay in Singapore with friendly service and good accessibility, this hotel is one of the choice.",
      "time": 1742529245,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17993010231606059925",
  "user_ratings_total": 733,
  "vicinity": "383 Jalan Besar"
}