{
  "formatted_address": "17 Bussorah St, Singapore 199438",
  "geometry": {
    "location": {
      "lat": 1.3012493,
      "lng": 103.8599309
    },
    "viewport": {
      "northeast": {
        "lat": 1.302580180291502,
        "lng": 103.8612536302915
      },
      "southwest": {
        "lat": 1.299882219708498,
        "lng": 103.8585556697085
      }
    }
  },
  "name": "Kampong Glam Cafe",
  "place_id": "ChIJnwMTELEZ2jER4WqhksUDLFA",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Jon Wan",
      "author_url": "https://www.google.com/maps/contrib/100955139997659919511/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWFy-wrUI_67EGCOWgbj1sNgpYvWkiCgvYYNwDmK7Kw6zsPQr-4=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "This alfresco cafe opens from morning and closes after midnight. Enjoy local Malay food and beverages here. Some food dishes cost less than SGD5. Watch the world go by in this area where there is a lot of history and culture.",
      "time": 1746267314,
      "translated": false
    },
    {
      "author_name": "Josh Kuek (#jkgourmets)",
      "author_url": "https://www.google.com/maps/contrib/111255682252678932891/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUqVntXY9rRgsu5esC0sYCyu4fgNk5JQ_D7N3H5uiCwLrGIVaP2=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "💥 Welcome to my food sharing Instagram: jkgourmets. 欢迎游览我的美食IG: jkgourmets\n\nThis local Malay Café has been here for few decades, popular among local and neighboring. Variety of foods from mixed rice and dishes selections, and lots of local cuisinesike Mee Siam, Mee Rebus, Lotong and many Stir-fry foods.\n\nYou can also find lots of local Malay desserts and kueh-mueh, including crackers and local tidbits etc. Surely, all beverage are local flavour and selection are great, you definitely will have one that you like.\n\nPrice is depends on your selection, sometimes can be quite expensive especially if you chose rice with dishes. Others foods and beverages on the menu are fixed price, order as you like.\n\nOverall, this Café was located at the perfect central of this popular Arab street, seating beside the small inner lane with lots of classic unique heritage old shop houses. This definitely a good place to stay relax and hang around. Highly recommended.",
      "time": 1732089207,
      "translated": false
    },
    {
      "author_name": "stevanie yuliana",
      "author_url": "https://www.google.com/maps/contrib/117560802446580643256/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUQkyY1rEoxOWAl_P9T0C0nz5eiUG4u-WkNk8ogu5TQooIcrr7I=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "5 months ago",
      "text": "This place can get quite crowded and order your food first on queue.\n\nDespite the crowds, the prices are reasonable and the food and drinks, particularly the tea and snacks, are quite enjoyable. It's a good option for a quick and affordable bite.",
      "time": 1733584644,
      "translated": false
    },
    {
      "author_name": "owen",
      "author_url": "https://www.google.com/maps/contrib/101656162678057556658/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUL4mqJn-s0oPY97gFKaeB1XnOkDAHEtOqVLGzUYcpHbb_6krYtkg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "Highlighted reviews of this place were on its affordability, which made me excited. However, I must say such claims were either of the past and untrue now or purely false.\n\n$7 for a 3 dish nasi padang and teh tarik - is the affordability in the room with us?\n\nWhile I understand the opaque nature of nasi padang pricing, I could not wrap my head around the price for my dishes (picture for reference) Calling this place affordable is akin to calling this place a cafe, its a cafe in name but has no features of a 'cafe' whatsoever.\n\nNow despite the initial set back I was still willing to be open to the taste as a form of redemption. However, I was left sorely disappointed.\n\nLong beans were great, probably the best out of the three. Bergedil was average but the chicken wing. The chicken wing was blatantly frozen, and being left out in the open made it a sorry state. There was no element of my meal being a 'Muslim meal', rather cheap components of frozen food placed together. I came at about 10:30 am so I don't think the time argument can do much justice here.\n\nTeh Tarik was okay, nothing out of the ordinary\n\nOverall, I was disappointed and the high price definitely added to this feeling of disappointment. An added word of caution, the person before me ordered a 4 dish nasi padang (with fish as one dish) and a gado gado which added up to $25.\n\nBe aware of the transparency pricing issue and if you're feeling frisky, don't order their seafood. Then again if you go for their seafood I probably wouldn't count it on them to be delicious and well worth the price either.",
      "time": 1737515075,
      "translated": false
    },
    {
      "author_name": "S C",
      "author_url": "https://www.google.com/maps/contrib/113273299880380601002/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXfDnmwsIVq7dWcGK4L6Ns1aLMfHj2h3XFdpQIo4cB8vnBVY3-29g=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Nasi Lemak with 2 chicken wing , small slice of egg for $10, and I have to say, I was highly disappointed. For that price, I expected a fulfilling meal, but what I received felt like a complete rip-off.",
      "time": 1740614604,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5776996569112996577",
  "user_ratings_total": 2937,
  "vicinity": "17 Bussorah Street"
}