{
  "formatted_address": "28, JALAN EKO BOTANI 3/3, TAMAN, Persiaran Eko Botani, 79100 Iskandar Puteri, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.4380377,
      "lng": 103.6198118
    },
    "viewport": {
      "northeast": {
        "lat": 1.439366530291502,
        "lng": 103.6211456302915
      },
      "southwest": {
        "lat": 1.436668569708498,
        "lng": 103.6184476697085
      }
    }
  },
  "name": "KARA VIRUNTHU INDIAN CUISINE",
  "place_id": "ChIJN5eQeWUL2jERmTv5ebNqPNw",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "vaasugi batumalai",
      "author_url": "https://www.google.com/maps/contrib/107629618125210446260/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUtEfTSDbqwxfNDbNjZqr8Ghqnwrnv6Inl2PaEfTCLT9947RzqB=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "We ordered Chicken Satti Sooru, Mutton Thiruvila Sappadu, and a Vegetarian Meal Set for 2 pax with Gobi Manchurian. The food was absolutely delicious — every dish was flavorful and well-prepared. The restaurant had a very clean and welcoming environment, which made our dining experience comfortable and enjoyable.\nHowever, one minor downside was a female staff member who was communicating quite loudly with her colleagues, which was even louder than the background music. It would be great if the staff could maintain a quieter tone to preserve the ambiance.\nOverall, we had a great experience and would definitely visit again for the amazing food!",
      "time": 1736927697,
      "translated": false
    },
    {
      "author_name": "suba guna",
      "author_url": "https://www.google.com/maps/contrib/101138117004040327035/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL5dZshj3Vhfw6hssvMPPAbHc1BCCQuMBeXBMlqFLSDftdmQw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I recently dined at Kaara Virunthu, and I must say, it was an exceptional experience from start to finish! The food was absolutely delicious—every dish was fresh, flavorful, and beautifully presented. The ENNAI KATHIRIKAI was a standout, bursting with taste and perfectly cooked.\n\nWhat truly made the experience unforgettable, though, was the outstanding service from Bharathi. From the moment we walked in, Bharathi greeted us with a warm smile and ensured we felt comfortable throughout our meal. They were attentive, friendly, and had excellent knowledge of the menu, making great recommendations that turned out to be spot on!\n\nIt’s rare to find such genuine hospitality, and Bharathi’s dedication to making guests feel special was truly commendable. Because of the amazing food and top-notch service, I will definitely be coming back soon!\n\nHighly recommend this place—and if you visit, ask for Bharathi! 😊",
      "time": 1743558557,
      "translated": false
    },
    {
      "author_name": "Arun Kumar",
      "author_url": "https://www.google.com/maps/contrib/108567501375076196980/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWEQhDX4Wema_uIzEaNmKjpu8RZEsXUvMtxutAN4TAuYjsLdsk=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Visited Kara Virunthu at Eko Botani for dinner, and I must say, it was an exceptional experience! The Briyani Lollipop was a standout—perfectly spiced, tender, and packed with a flavor that’s truly unique. It’s something I’ve never tried before, and it was a delightful surprise. The chocolate shake was another highlight—rich, creamy, and just the right amount of sweetness, making it the perfect end to the meal.\n\nThe ambiance of the restaurant was warm and inviting, and the service was friendly and attentive. It’s clear they take pride in delivering not just great food, but a great overall dining experience. If you’re looking for something different yet delicious, Kara Virunthu is definitely worth a visit!",
      "time": 1734879850,
      "translated": false
    },
    {
      "author_name": "Appabbma Appabb",
      "author_url": "https://www.google.com/maps/contrib/117113076482732960783/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKy8Q3uZ6ax2T3oMfdjK9RTEgchbzBRyfdzy4Q9fAZL2SWeHQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 2,
      "relative_time_description": "2 months ago",
      "text": "I have been here earlier last year the taste is so good  and given 5 star but unfortunately not the same this time , orders mutton thruvilla sapade for 2 pax and keerai curry set , mutton curry very very thick the mutton is tender but the gravy doesn’t absorb the gravy so the meat is tasteless , staff is seems clueless also not hygenic , saw the staff took papadum using bare hand another hand holding the tong suppose to use to take the papadum .. then another staff use his hand to put the cabbage , he just pick and put it in the bowl back .. very disappointing",
      "time": 1741414680,
      "translated": false
    },
    {
      "author_name": "Prakash Preeth",
      "author_url": "https://www.google.com/maps/contrib/113240539935752113695/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK4YmJaxYd_2DNdlxTSG9yPU_t4VsydjWwZP7ugffrknU2-vA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "We just went there by looking at their TikTok. Awesome foods and staffs are friendly. The price also reasonable for that area. Hope to have more choice of South Indian cuisine like thali set.",
      "time": 1741395360,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15869676506024852377",
  "user_ratings_total": 198,
  "vicinity": "28, JALAN EKO BOTANI 3/3, TAMAN, Persiaran Eko Botani, Iskandar Puteri"
}