{
  "formatted_address": "1H Figaro St, Singapore 458322",
  "geometry": {
    "location": {
      "lat": 1.3157781,
      "lng": 103.9259321
    },
    "viewport": {
      "northeast": {
        "lat": 1.317035180291502,
        "lng": 103.9273089302915
      },
      "southwest": {
        "lat": 1.314337219708498,
        "lng": 103.9246109697085
      }
    }
  },
  "name": "Katong Delights",
  "place_id": "ChIJJ3NcS6Ui2jERtxV50wQbnpY",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Shelley Ho",
      "author_url": "https://www.google.com/maps/contrib/108859281135876340047/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVjyXSxgdcqaINT-Wz8n8uDkZFhgOZk2tMSA4s1uavuYWP4yM4=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "in the last week",
      "text": "Very unusual set up for a dining outlet. It feels more like a home that has extra tables and chairs to serve customers.\nFood was mildly flavored and not overpowering.\nOtak Otak is one of the signatures. While it’s good, the taste and texture is quite similar to what I would get from the Muar Otak.\nHae Chor has an interestingly soft filling while crispy on the outlet.\nThe Assam fish gravy has a good balance of spicy ness and tanginess. It’s a shame the kind of fish used is not to my liking.\nMy favourite has got to be the Hee Peow soup. It has a home cooked flavor. If you are not a fan of balls (meatballs fishballs squidballs), perhaps ask for less of those.\nThe lady manning the shop was very friendly and gave us information on their mini-buffet (self pick up). Good reference for home parties.",
      "time": 1747286066,
      "translated": false
    },
    {
      "author_name": "Lorelai D",
      "author_url": "https://www.google.com/maps/contrib/110563036404967613068/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjULKw5VTdsgo88mrtjy3ko391WqBerSbG_wLgbfLvMBWvlGZtQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Have been thinking of trying this place for quite a while as it is a bit far from home however once we tried it, we went back there again within a week to try out other dishes and started to explore the neighbourhood.\n\nOur first encounter was dinner, started with something we craved for - curry.\n\nRendang beef was so flavorful, it comes in pulled beef style versus big chunks that you may get from other places, and also we got a lot of tendons portion instead of the meat.\n\nHae cho which is little prawn and meat rolls with I believe chestnut is in it was divine, I can taste the crunch in every bite and not the pasty kind that sometimes you eat in restaurant.\n\nOtah was good but I would prefer it to be in a drier version, this one is steamed so it feels more like steam fish patties, would love for it to have the smoky flavour, but the taste was good and is definitely one of the popular dishes here that people ordered.\n\nCurry mixed veggies was great! The curry was flavorful and coconuty, I can probably finished another plate of rice with it.\n\nWithin span of a week I returned because we need to try out their nonya curry chicken and it was the best!\n\nComes with generous amount of potatoes and chicken, the curry was fragrant and so addictive, it will go so well with roti Prata, reminder to myself to take away next time so that I can make that happen.\n\nThe owner was highly recommending honey plum pork ribs and deep fried shrimp which we ordered.\n\nFried shrimp was perfectly fried and I can understand why it is so popular since this goes really well with curry, I will say order this when you have 3 or more pax coz the portion size is quite big and by the time if only two of you, the oiliness does gets you. But I must say the chef skills indeed is very good to cook this to perfection.\n\nThe plum ribs were good but similar to the fried shrimp, you can tell the chef is very skillful cooking it, light coating and moist inside, what I like about this dish is they do not doused it with the sauce but just a light coating.\n\nSayur Lodeh curry flavour was on point but it was so light that I find myself taking it like it is some vege soup.\n\nI have my eyes on their oxtail stew next as they said is one of their best seller, gave me another reason to try other dishes that I have not explored.\n\nThe owner and serving staff there were super nice, they do try to share a lot in terms of their buffet which is $20 per head at 10-15 pax, they told us that is their original business but they serve at this shop house which I find it so eccentric with all the old school decorations in an organized chaos way.\n\nThird time going back, for sure I will.",
      "time": 1740309650,
      "translated": false
    },
    {
      "author_name": "Kewlguy tan",
      "author_url": "https://www.google.com/maps/contrib/116358027005399132924/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKdkBACuMFoXfwffz5IKAI8XFA2KUbeXg5audVoVt9VV419hQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "This is definitely a hidden gems dining place in Singapore!It has a heritage feel too!\n\nWhen I first arrived I was attracted by the appearance of the decoration in the dining place.Full of touch details(see pictures)\n\nThe owner’s thoughtful recommendations and detailed introductions, combined with the friendly interaction with the owners afterward, made the entire dining experience truly unique. Even though we have ordered a bit more than expected, leaving some dishes to try on our next visit.\n\nThe absence of background music was made up by me playing “如燕” adding a personal touch to the atmosphere. The song’s mood and vibe perfectly matched the occasion! Also, despite the lack of air conditioning, it didn’t feel hot at all, which must be a testament to the restaurant’s design or the comfortable ambiance it creates.\n\nFinally, that handwritten receipt was the perfect finishing touch, as if the owner’s care was conveyed through every word. A restaurant like this not only offers delicious food but also delivers a heartwarming experience, making it a place you’d want to revisit for sure!",
      "time": 1734914114,
      "translated": false
    },
    {
      "author_name": "Wei Peng Chionh",
      "author_url": "https://www.google.com/maps/contrib/101204338706727601290/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUAQjMkoSZ_as6evYsSTWTSbUVuPwtIXADNulji9-UNPsK17bTmUA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Had a wonderful lunch at this place with lots of  old school ambience. It feels more like visiting a friend's home having a meal with their folks than a restaurant. The curry chicken, sayur lodeh and the fried prawn are absolutely tasty! Will be back again.",
      "time": 1742541567,
      "translated": false
    },
    {
      "author_name": "Elaine Neo (梁雁婷)",
      "author_url": "https://www.google.com/maps/contrib/101260680686655265157/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVmGs-tzVMK5ETi5d0w8HJzOeL9tmS8n57E9M6QB36Hy-QXUERdQQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "This cute little eatery is tucked away in a quiet corner and run by an elderly couple, which already sets the tone. It’s unpretentious, heartfelt, and feels like you’ve stepped into someone’s home. The space has a retro charm, with old-school furniture and warm, familiar energy.\n\nWe had the Sayur Lodeh, Ayam Buah Keluak, Otah, and Fish Curry. Everything tasted like it came from a kitchen that’s been doing this for years. It’s the kind of place you’d bring someone who misses home cooked food. Nothing fancy, just honest food made with care. Worth a visit if you’re in the area and craving something familiar.",
      "time": 1744427872,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10853141859551221175",
  "user_ratings_total": 92,
  "vicinity": "1H Figaro Street"
}