{
  "formatted_address": "2 Choa Chu Kang Loop, #03-02 Keat Hong Community Clu9, Singapore 689687",
  "geometry": {
    "location": {
      "lat": 1.3841193,
      "lng": 103.745094
    },
    "viewport": {
      "northeast": {
        "lat": 1.385434780291502,
        "lng": 103.7464298302915
      },
      "southwest": {
        "lat": 1.382736819708498,
        "lng": 103.7437318697085
      }
    }
  },
  "name": "Keat Hong Family Medicine Clinic",
  "place_id": "ChIJgeN16ekR2jER_PxOHA9Wno0",
  "rating": 3.1,
  "reviews": [
    {
      "author_name": "Yan Wei Cheng",
      "author_url": "https://www.google.com/maps/contrib/111086014645381710831/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUVQJUuAok4alUYSbKFxxunhfUwWFvFntXqJVxBGoNYAzcjlJGW=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "The standard of service has significantly declined. While the doctor was kind and patient, the customer service needs improvement. When I called to reschedule my appointment, the staff member only asked for my name once and then quickly informed me that my appointment would be rescheduled without confirming any other details. I felt unsure whether they had the correct information.\n\nThe staff seemed eager to end the call without clarifying the new appointment time. Fortunately, I managed to stop and ask before she hung up. The interaction felt rushed, with no clear information provided, and no confirmation to ensure that I fully understood the new appointment date and time.\n\nAlso, the waiting time for a blood test with appointment still need to wait for more than an hour. Then, payment wait another 20 mins. Horrible wait time rather go polyclinics.",
      "time": 1737076001,
      "translated": false
    },
    {
      "author_name": "eswari ram",
      "author_url": "https://www.google.com/maps/contrib/115626396947807642856/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKuF9SXFJq1WFnGJDNFPxA7sQIosqG4p7tCvaPZYXFy_y6SOg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "Pls educate your staff on customer service. If they unable to accommodate for patient's enquiries when called in, pls don't let them seat at the reception. I called in to check on my referral letter given and the staff at your clinic I think a malay woman not sure as she never mention her name. She was very rude on her tone and I asked her if doctor referred to correct clinic, she just said it already stated in the letter. I asked her if can check with doctor again, she just slammed the phone down on me. Such a terrible and worst attitude. This happened on 17 Feb 2025 at about 12pm",
      "time": 1739765253,
      "translated": false
    },
    {
      "author_name": "Anthony Ting Huong Ee",
      "author_url": "https://www.google.com/maps/contrib/100461009274454673102/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIwVJqleCzDmnGilZXdi7M0HnJo36T8I9jt29uEpreXcXfR7A=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "I believed should be the same person, one chinese long hair receptionist without name tab - very rude and has attitude problem. Although I am late for the appointment but she is a receptionist and should understand her own role and responsibilities. The way she replies during the registration process as though you owe her million dollars like that. Please send her for more customer service or consider to remove her duty in order not to tarnish your clinic's reputation.",
      "time": 1664270842,
      "translated": false
    },
    {
      "author_name": "Sheena",
      "author_url": "https://www.google.com/maps/contrib/110778282985233768209/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJjlNHaS2bAlLKdZoWcjVEfgp_N-vxFqseb4o3xXT_OuLMYxg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "7 months ago",
      "text": "The charges is getting more expensive now. Was charged $40 + for a very short consultation less than five minutes ( getting health report). Normal blood test also charged $40+. Was told that the charges depend on what color Chas card and no standard consultation fees. Omg then what about ppl without any Chas card then? Worst clinic without any receipt issue 👎",
      "time": 1729485857,
      "translated": false
    },
    {
      "author_name": "Lee JI",
      "author_url": "https://www.google.com/maps/contrib/113582053690694725740/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKzYtpNs17YRlNAMRup76-7-pdHpWv1M-4dEe28TBvJYO9eC9g=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Clinic used to be good when it started but standards have dropped drastically over the years. On my last visit, I made an appointment for a health screening I thought I require. The staff didn't verify or tell me that I actually do not require that screening over email and hence, I rushed down to the clinic for the appointment. Ended up wasting my time as the receptionist didn't communicate the reason why I showed up to the doctor.\n\nHave another bad visit here many years ago where a doctor just looked so done with his job and didn't seem to take my concerns seriously. Going to polyclinic is way better than this place.",
      "time": 1713356297,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10204688428567559420",
  "user_ratings_total": 78,
  "vicinity": "2 Choa Chu Kang Loop, #03-02 Keat Hong Community Clu9"
}