{
  "formatted_address": "33 Westlake Ave, Singapore 574244",
  "geometry": {
    "location": {
      "lat": 1.34325,
      "lng": 103.8378613
    },
    "viewport": {
      "northeast": {
        "lat": 1.344629880291502,
        "lng": 103.8393064802915
      },
      "southwest": {
        "lat": 1.341931919708498,
        "lng": 103.8366085197085
      }
    }
  },
  "name": "Kiddiwinkie Schoolhouse @ MacRitchie Park",
  "place_id": "ChIJtSitI0cX2jERoqFkAGV7fKY",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Liz Yin",
      "author_url": "https://www.google.com/maps/contrib/113989863161980350778/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWYO4PcUb0kEMHj7f0XaKFCScid8m5VfGCbuzIykGGwguAo20elYg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "We couldn't be happier with our experience at Kiddiwinkie (MacRitchie) for both our 5 yo son Max and 1.5 yo daughter Mia. The teachers--Ms Su, Baohui laoshi, Dong laoshi, Ms Hanna and others--are not only caring and patient, but also truly dedicated to each child’s development. We’ve seen so much growth in both their confidence and curiosity since joining the school.\n\nThe environment is nurturing, safe, and full of engaging activities that spark creativity and a love for learning.\n\nHighly recommend KiddieWinkie MacRitchie to any parent looking for a warm and enriching place for their child. It’s been a wonderful start to Max and Mia’s educational journey!",
      "time": 1746427790,
      "translated": false
    },
    {
      "author_name": "Sheryl Lim",
      "author_url": "https://www.google.com/maps/contrib/107542318242830333605/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWhGwhFqiORapR9HgeZu6UEeH6Y83UJdkt-hZNpC4i2XTpzAXMG=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "This used to be Our Juniors' Schoolhouse and it was a great school. It was bought over by Babilou and renamed to Kiddiwinkie and almost the entire team left. We kept our kids through the buyout and continued until graduation. The great thing about this school is the outdoor - you will never find a school with better outdoor that is held 2x a day with monthly walks to macritchie. But the good part stops there. They do have some good teachers who have stuck around (dong laoshi, ming ai, Rebekah and Ms Su are amazing), but my main issue was the administrative and management of the team. Communication is a big problem. The centre is not supposed to be air-conditioned fully and this is emphasized to parents, but it's turned on almost all the time. I gave feedback all the way up to HQ and still the situation did not change. The principal is always blaming HQ but in reality it was not true ( I had to call their hotline to get through to someone in HQ because the principal made it difficult to talk to anyone higher than her). We had issues with teachers as well - using English to teach the kids Chinese, using dirty clothes to wipe my child down etc. Despite many feedbacks to the principal, nothing changed. In the end, I realised that there is a problem with the school management. The teachers simply do not listen to the principal/principal isn't strong/strict enough to drive the team. Overall the school is okay, my complaints may be very specific and pertain only to me, but this is a very expensive school so at this price point no one should have complaints. Even questions can go unanswered for a week. In the end we pulled our youngest out even before he started. I felt like no one was listening to me (we have 3 kids so I think we fully understand and appreciate how most teachers/schools are) and it was just so tiring going back and forth. Also note that everything else (photos, concert etc) are all charged at very high prices which is what you will be charged if you enrol your kids here.\nThere are other great KW with great administration though, this review is only for this centre.",
      "time": 1736069038,
      "translated": false
    },
    {
      "author_name": "Rajiv Ramachandran",
      "author_url": "https://www.google.com/maps/contrib/107168812934152164888/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUOrMnARbgLP0uGrlAkOe33yQFeW92qndeTxbdoxFr7wy6uvk-U=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Thoroughly happy with the school, the principal and the teachers and the facilities. Wouldn't have it any other way. Thanks for being patient & taking great care of Rose.",
      "time": 1745933098,
      "translated": false
    },
    {
      "author_name": "Jocelyn J",
      "author_url": "https://www.google.com/maps/contrib/111400154036475425563/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJUPUQJ3m0SVJLIgbGmc6LkPY9YK7CT3cj9DBQfupmV3Lv3eg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "We are very glad to have placed our child in Kiddiwinkie which has caring teachers like Ming Ai, Dong Laoshi & Huang Laoshi. Thank you for tirelessly looking after the kids! We appreciate your regular updates on our child’s progress during the initial transition period and now weekly updates on the school activities. We also appreciate your efforts in creating an interactive and fun-filled environment for the kids to explore the world around them!\n\nOur kid went from crying everyday at drop-offs to asking to go school now. :)\n\nThank you, Principal Elle, teachers & staff of Kiddiwinkie for looking after and caring for the kids!",
      "time": 1724768585,
      "translated": false
    },
    {
      "author_name": "noorul huda",
      "author_url": "https://www.google.com/maps/contrib/113968967687597409253/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKp2BtkVEkNVb3TOFucd71cyMBuVPHzacPIchosTAIivpRzkw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "I would like to make a heartfelt appreciation to my daughter's teachers who is currently in pre-nursery - Ms Rebecca and Wei Wei Laoshi.\n\nAfiya have always spoke fondly of them and telling me all kind of stories about her teachers and friends. How much she loves playing and learning colouring, painting and reading etc. This make us reassured we have made the right choice in enrolling her in kiddiwinkie at Mac Ritchie. Oh yes, they have the same teachers since day 1. That says alot of the place! 💪💪\n\nFrom the start, we have always seen smiles in teachers faces and always so patience in answering our questions (lol). I totally salute them for their utmost tireless dedication in doing what they do. Bravo, teachers! Not forgetting lovely place. They have renovated the place and it's really beautiful.\n\nOnce again, I want to thank you Ms Rebecca and Wei Wei Laoshi for always making Afiya happy going to school. Thank you dearest Principal, Ms Elle who is always making Afiya feel comforted and happy. We are grateful.\n\nHAPPY TEACHER'S DAY! ALL OF YOU DESERVE IT. ❤️❤️❤️❤️❤️",
      "time": 1724042129,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11996599181136667042",
  "user_ratings_total": 12,
  "vicinity": "33 Westlake Avenue"
}