{
  "formatted_address": "3 Harbourfront Pl, #02-01 HarbourFront Tower Two, Singapore 099254",
  "geometry": {
    "location": {
      "lat": 1.2649375,
      "lng": 103.818727
    },
    "viewport": {
      "northeast": {
        "lat": 1.266287480291502,
        "lng": 103.8200666802915
      },
      "southwest": {
        "lat": 1.263589519708498,
        "lng": 103.8173687197085
      }
    }
  },
  "name": "Kiddiwinkie Schoolhouse @ Harbourfront",
  "place_id": "ChIJ5-kytOMb2jERzCrfLvvy614",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "JeansMomAdventures",
      "author_url": "https://www.google.com/maps/contrib/118203948723973349802/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWcEVt23YTxZ-LoBMqo-lNW0t6OKQLbDmJYHVyloftMNQbnYAY=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I can’t say enough good things about this infant and toddler school! The learning program is incredibly thoughtful, striking the perfect balance between structured activities and play. Teachers provide regular, detailed updates, ensuring families are always informed about their child’s progress. They also offer valuable support tools to help parents stay engaged and assist with learning at home.\n\nAlthough there’s no dedicated outdoor space, the team more than compensates by organizing regular walks and field trips, ensuring the children still get plenty of exploration…the indoor gym is our kids favorite probably because they don’t get hot running around. The staff handles illness with professionalism and care, and they are always open to finding or offering accommodations to meet the individual needs of each child.\n\nThe infant program and nursery are thoughtfully separated, giving each group the attention and environment suited to their age and development. Above all, the teachers are incredibly caring, making sure every child feels valued, supported, and loved. This school truly provides a nurturing, enriching experience for both children and their families!",
      "time": 1734826405,
      "translated": false
    },
    {
      "author_name": "Josephine Park",
      "author_url": "https://www.google.com/maps/contrib/111390820409867696276/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWNG9bsWXTJA8GMDa1Hhki4Aifsy0gcc32nJ16MK1pHMHrAMUBM=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "We absolutely love Kiddiwinkie Habourfront, and more importantly, so does our daughter. :)  She has been attending for over a year now, and we’ve seen such amazing growth in her. The school provides a warm, nurturing, and fun environment where she feels safe, happy, and excited to learn every day. The teachers and staff are wonderful—dedicated, kind, and always going above and beyond to support the children’s development.\n\nA very special thank you to Teacher Felicia, Wai Laoshi, and Jingjing Laoshi for their patience, love, and genuine care. It’s clear how much they adore the children, and we are so grateful for the positive impact they’ve had on our daughter’s journey.\n\nOne of the best things about this school is the incredible group of friends she has made. She comes home every day with memories and stories about the fun she had with her classmates, and it’s heartwarming to see her build such meaningful friendships. The sense of community here is amazing, and it makes such a difference in her happiness.\n\nOn top of all that, the location is super convenient, making drop-offs and pick-ups easy for us as parents.\n\nWe couldn’t be happier with our experience at Kiddiwinkie and highly recommend it to anyone looking for a loving, supportive, and enriching environment for their child!",
      "time": 1739323182,
      "translated": false
    },
    {
      "author_name": "D_Traveler _",
      "author_url": "https://www.google.com/maps/contrib/104196149211749000819/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWZOUeg4dkwd1VvS4x0X6S6bYjNkzQM3n_utDddKxGX-g-ZSiUz=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Our child has been attending Kiddiwinkie HarbourFront for 18 months, and we’re absolutely delighted with the experience.\n\nWhile the school’s convenient location and modern facilities are certainly a plus, it's the passion, dedication, and warmth of the teachers that truly make it stand out.\n\nFrom the early days with Ms. Chong Peng, Teacher Sally, and 韦老师, to the later year with Ms. Jeslyn, Teacher Felicia, and 静静老师, we've watched in awe as they’ve helped our little one grow and develop through fun, engaging learning experiences.\n\nWe’re also deeply grateful for the entire team of teachers who are always kind, patient, and caring. Kudos to Yi Ling老师, Jin Yee老师, Yi Yun老师, Teacher Debie, Teacher Kavita, Teacher Miya, Teacher Kate, Teacher Dexy, Teacher Wendy, and everyone involved — including the wonderful cleaning staffs. Together, they’ve created a nurturing and inspiring environment that makes every day a new adventure in learning.\n\nWe’re constantly amazed by the growth we see and the genuine affection our child has for the teachers. We couldn’t be more thankful for the care, enthusiasm, and dedication they bring to this learning journey!",
      "time": 1739539327,
      "translated": false
    },
    {
      "author_name": "Kiara Kaur",
      "author_url": "https://www.google.com/maps/contrib/106085654649280417635/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKPSy8xR-eH3_adLBcULoVdqGdW2guQdXtZYz7Rh5wVQ1u_sw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Ms Kavita Mogan was my teacher previously at Carpe Diem Juniors at Pico. She was sweet and kind. It was because of her I was able to read and write at the end of my K2. I am forever thankful for her. She is a fantastic teacher! 🤗",
      "time": 1738753379,
      "translated": false
    },
    {
      "author_name": "Gabriel Hong",
      "author_url": "https://www.google.com/maps/contrib/100142019895342486089/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLs_dCm2aVFPZu3e82WDPY-UDgiPmodcu69nWQU7nzcJ4B3CQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Our son Ethan Hong has been with Kiddiewinkie Harbourfront since Feb 2023 and must say it has been an enriching experience.  We can see Ethan developing well on all front, both physically and intellectually.  Special thanks to the previous teacher group led by Chong Peng / Sally and now 韦老师 / Felicia for all the care and guidance.  We particularly appreciative of the regular development progress / assessment, and as parents we can reinforce some of the observations / assessments back home.  The learning curriculum is highly inclusive, with emphasis too on cultural diversity and global connectivity.  Recent excursion (our 1st) to cat paradise was really impressive and memorable.  Thanks to the teachers for looking out for Ethan and keep us updated on his health well-being.  Only suggestion is the lack of outdoor activities which perhaps the school can consider partnering the new Kiddiewinkie East Coast school which offers outdoor facilities.  This can be in the form of periodic trip to the east coast school as part of PE activity.\n\nKeep up the good work teachers....and a happy Teachers Day!",
      "time": 1724729613,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6839827619729320652",
  "user_ratings_total": 11,
  "vicinity": "3 Harbourfront Place, #02-01 HarbourFront Tower Two"
}