{
  "formatted_address": "74 Whampoa Dr, #01-338, Singapore 320074",
  "geometry": {
    "location": {
      "lat": 1.3250903,
      "lng": 103.8579832
    },
    "viewport": {
      "northeast": {
        "lat": 1.326451830291502,
        "lng": 103.8592711802915
      },
      "southwest": {
        "lat": 1.323753869708498,
        "lng": 103.8565732197085
      }
    }
  },
  "name": "Kids First Clinic",
  "place_id": "ChIJqaBW7ucW2jERS5niN4W-mmI",
  "rating": 2.4,
  "reviews": [
    {
      "author_name": "Shee Reen Ong",
      "author_url": "https://www.google.com/maps/contrib/103984896198439504478/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLca2gc8Jwd7oQY_c2M6kHve62in469mCtMwygTwXxi4MfNvA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 years ago",
      "text": "It was an upsetting experience for us. Please see all google review before visiting this clinic.\nWe brought our 2yo with some skin related issue on her thigh and tummy area. The Dr only treated her thigh & said her body was fine without properly examining. But my 2yo body had flaky /dry skin. And she would always scratch herself while sleeping at night. But we didn’t get any treatment on that and Dr insisted it was fine. Then Dr started explaining on the medicine she was prescribing & mentioned it will take 4 weeks to recover. So, I asked “how often should we applied?” Dr sounded annoyed and said “I’ve already told you earlier “. what she told me was how long it takes to recover NOT how frequent it we should apply. I did mentioned my 2yo is at a full day childcare & if the medicine needs to be applied more frequently then the teachers would need to help. Dr said “ Don’t expect the Teachers to help you with your daughter’s problem”. She made it sounds like we are such irresponsible parents by pushing the responsibility to the Teachers. I felt we were judged. Then Dr asked us why our 2yo is still wearing diapers not once but TWICE! I couldn’t really gave an answer when she 1st asked us. Then she asked us again putting us in a difficult spot. I felt she is just putting us down or shaming us for letting our 2yo wearing diapers. Again, we were judged. Then she went on repeating the same thing over and over again. The medicine (cream) was $10 but her consultation was $60. The “consultation” we had was being shamed by Dr, repeating the same thing over & over again by Dr … To all parents, to avoid any humiliation from this Dr, avoid this clinic. I would rather go to any GP than visiting this clinic ever again!",
      "time": 1639416922,
      "translated": false
    },
    {
      "author_name": "Karen Lung",
      "author_url": "https://www.google.com/maps/contrib/104162626616742376122/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV7QFMwAWzVscSgaJnujfaa3TxRMH__qxvwwnCd2pCG3wjJUnlDhw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "4 years ago",
      "text": "Went to clinic twice and we decided Dr Ho's clinic is not for us.\n\nThe clinic is owned by Dr Ho, and she prided herself for being a caring doctor. She's the kind of doctor who is motherly and chatty like a friendly elderly neighbour.\n\nThe clinic's waiting time is definitely very long. I waited for at least 20min for my turn despite I was only 2nd in queue.\n\nWe went to see her to obtain a fit letter for our baby to attend childcare centre as he was recovering from 5 days of cough and runny nose with no fever. It's the requirement by the childcare centre to produce fit letter. Instead, we had gotten MC and medicine. Dr Ho wasn't paying attention to what we needed and communicating the necessary. Instead, she went about what childcare centres can or cannot do. Our exchanges ended with quite an unpleasant note and she was still defending herself. I had to reassure her a few times that we were okay if she thought our baby was not fit to attend childcare centre.\n\nWith all due respect, I value a doctor's professional judgment on medical matters, but not a doctor's opinion what childcare centres can or cannot do just because parents of patients shared their own childcare experiences with the doctor.\n\nTL;DR No doubt Dr Ho is a nice and caring doctor to some parents. However, it would be nicer if she considers how the long waiting is affecting the patients and parents, and she listens better to the needs of parents.",
      "time": 1611594581,
      "translated": false
    },
    {
      "author_name": "Richie Wong",
      "author_url": "https://www.google.com/maps/contrib/110524038139197125697/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ7-he74gqEZSF8sDV_Igv55aHwh7jkwEn-TY6MXcPSGQboYg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Visited this Clinic on a Sunday with my 2yr old daughter. she was having post covid fever without flu symptoms, am worried for MIS-C. The Doctor was patience and very very experience! i came to understand that we need to be patient when consulting her. She may repeat things once or twice but her recommendation was spot on and her explanation was very detailed. I am very fortunate to have found Dr Ho Ling and her clinic.",
      "time": 1660468821,
      "translated": false
    },
    {
      "author_name": "Wanxin Lau",
      "author_url": "https://www.google.com/maps/contrib/116701514148476534245/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW7vOBhqVjfUMuQCfqMmjKTeyXc5D4RFRmaSyeF_87RXXrGqlX_=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 years ago",
      "text": "This is one of the worse experience. Doctor is a nice lady but she repeated the same questions (“do you want the cream?”)  and statements (“the uncle in the market opened his stall until 10pm and he was very nice to sell us cloth diapers”) at least 8 times each! When I told her that she already asked me the same question many times, she said she don’t remember. She also did not check my daughter’s diaper rash properly, claiming that she had seen many rash bums.  We had to see another PD after her and turns out that my daughter had fungal rash instead of the usual. I am not sure which organisation to flag this up to but I am suspecting age is catching up with her…",
      "time": 1652760815,
      "translated": false
    },
    {
      "author_name": "Lim Jesslyn",
      "author_url": "https://www.google.com/maps/contrib/115786819309393047470/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLvRI57-Q9dz4cXJ-ZMj3SCzB66p8yRcEh0pkkMzaJdtSIugQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "Brought my daughter to see the doctor, as we suspected she has HFMD. Set the context for Doc (we understand how doctors are busy, and try not to waste their time).\nDoc cut me off and said not to hurry.\nDrew a family tree on my daughter's info sheet, and started asking qns on our jobs and if she's a single child, and which hospital she was born in. Is this her way of trying to better understand us, I have no idea.\nWhen she finally got to asking what happened, we tried to explain her condition (mild fever the last night, and rashes on hands and feet).\n1. Doctor did not ask to take her temperature.\n2. Doctor asked to check her hands, and when my daughter cried and tried to remove her hands (stranger anxiety), she was exasperated and said she \"cannot see/check\".\n3. Doctor went into her supplies room and told us that she has no supplies for the medicine. She mentioned that there are spots on my child's feet but it is not clear if she has HFMD.\n4. Doctor kept repeating that she can try to order medicine supplies. It's a sunday, not possible to get supplies. She will try but the supplier may not have stocks.\n5. With regards to points 3 and 4, it is very disappointing to hear. We came because we aren't the experts, but whatever she said is not assuring. We were initially open to picking up any medicine she may have, another day. But her responses just signalled to us - lets try to see another doctor who can help for our case. I'm just very surprised that there's no medicine to help my child? And she was very ready to drop our case.\n6. We shared with doctor that we have some paracetamol at home which aided in relieving the fever. The instructions as per polyclinic said every 6-hourly. She cut us off, said that as per protocol, should be every 4-hourly. We appreciate that she gave her suggestions, we aren't here to argue, but it was the manner that she shared that really made me feel unwelcome\n7. Seeing that there is no help for our case, we decided to leave. Doctor mentioned that \"as a token...\", consultation fees will be charged, and we will just pay $30. At this point, all we wanted to do, is to leave, and never be back.\n\nIn all honesty, it's upsetting that there's no proper diagnosis since she said she cannot assess my child who was struggling throughout the examination (she tried to shine a torchlight into my child's mouth to see the ulcer, and barely touched her hands to see the little spots). No proper diagnosis, no medication, no assurance.",
      "time": 1658028123,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7105200841507903819",
  "user_ratings_total": 45,
  "vicinity": "74 Whampoa Drive, #01-338, Singapore"
}