{
  "formatted_address": "979C Buangkok Cres, #01-105 Block Block 979C, Singapore 533979",
  "geometry": {
    "location": {
      "lat": 1.3795676,
      "lng": 103.8798704
    },
    "viewport": {
      "northeast": {
        "lat": 1.380990030291502,
        "lng": 103.8811843802915
      },
      "southwest": {
        "lat": 1.378292069708498,
        "lng": 103.8784864197085
      }
    }
  },
  "name": "Kidz Meadow Childcare @ Buangkok Crescent",
  "place_id": "ChIJZ990MkMW2jER9RhNFTT7Pek",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Ina Adi07",
      "author_url": "https://www.google.com/maps/contrib/103203097034449970072/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocImrWqpSka9dx_vMlhUqYTx-oq3bL2P4ok76gpb6TbtOJ-W1w=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Kidz Meadow was like a second place/home for MayaSuhaSafurah since she was an infant. The teachers have cared and nurtured her with her needs,love and care towards her.She was taught to be independent and learnt different skills holistically from the teachers when time goes by when she was promoted to toddlers till she is in Kindergarten 2 now.We are very happy to see Suha enjoying learning to socialise, learning to care for her peers ,learning numeracy,writing,language skills and exploring nature with her Teacher Fara. She enjoyed learning and speaking Malay language and know the Malay Warisan Budaya with clear understanding by her Cikgu.We are glad that Kidz Meadow have lovely,awesome,caring and wonderful teachers who have made Suha to be active learners and you teachers will be missed by her.Thank you teachers for giving us opportunity to  make our children have a pleasant journey in yr Kidz Meadow.",
      "time": 1699542555,
      "translated": false
    },
    {
      "author_name": "Nurul Alifah",
      "author_url": "https://www.google.com/maps/contrib/111216616807741209771/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXJE-9LAOBGMujszJmJRPgxPml_rW7u26qV9BVzqxIumukWhdFJhw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Kidz Meadow has been the greatest childcare that I have enrolled in for my babies. They are very cautious, concern, loving and compassionate towards our children. The other thing that I like about this childcare is that they teaches Malay Language which is important for me too. Also, their field trip is very enjoying especially for our children. I would recommend parents to enrol their children in this centre.",
      "time": 1727137631,
      "translated": false
    },
    {
      "author_name": "Hafiz Mamat",
      "author_url": "https://www.google.com/maps/contrib/100189055011744493643/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIY3JVTN9kjBPU0t0tEtMqQ7N3zq7Sb0YNJ9r9hGMGJw4eaMQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Both of my daughters have been enrolled at this center since their time in infant care. The teachers are highly trained, and the curriculum is thoughtfully managed. The staff consistently shares updates on my children's progress. Thank you to the wonderful teachers at Kids Meadow, Buangkok Crescent.",
      "time": 1728283429,
      "translated": false
    },
    {
      "author_name": "Nashata Isa",
      "author_url": "https://www.google.com/maps/contrib/105704367471652848951/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJogNqOINnbxuFDZs7_-O7tLw38mqmnfhuewg_aExufOEs1Ow=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "We send all our 3 children to KMBC and will definitely recommend KMBC to parents. Our eldest son is in K2 and has been with KMBC since he was in N1 while our second son is in N1 and has been with KMBC since he was an infant. Our daughter recently started at KMBC infantcare too.\n\nThroughout the years we have had only good experiences and praises for the staff :) Our children's form and co form teachers all have passion and so much patience in guiding, taking care of and nurturing our children.\n\nCikgu Su has been part of our eldest son's growth since he was 3 years old. She has been such a wonderful teacher not only in terms of his intellectual development in the Malay Language but also in instilling values and skills for his social development. Her passion and patience is commendable and we cannot thank her enough.\n\nWe are so grateful to Teacher Siti for her creativity and dedication in making learning so fun.  Our son looks forward to going to school and for us that is definitely a good sign!\n\nOur 2nd son can be a handful at times, Teacher Daiyana remains so patient with him and provides him a safe space to be himself while also learning and developing. He also looks forward to going to school. Teacher Daiyana is also very prompt in providing us with updates and gives us assurance.\n\nWe are also thankful to Cikgu Dee for her patience and affection towards our son. She is very gentle with our son and we truly feel that he is well taken care of. It makes us feel that our son is always safe and protected.\n\nNo words can express our gratitude to Teacher Zee, Teacher Yaya and Teacher Syaza as they are very patient when handling our children. Our son had and daughter is currently having issues with transitioning to bottle feeding, the teachers including Teacher Umi and Teacher Liah are all so patient and have provided valuable suggestions to make transition easier. The infantcare teachers seem to be very bonded and work very efficiently on top of being kind and gentle with the babies. We feel very assured and are very thankful!\n\nAll the other teachers and staff who do not directly teach our children (such as Teacher Nur, Teacher Ruth, Xiu Lao Shi, Teacher Lorna) are also very caring and kind towards our children, we have had many good comments from our children ",
      "time": 1727957418,
      "translated": false
    },
    {
      "author_name": "Huda Rahim",
      "author_url": "https://www.google.com/maps/contrib/117609160838613683254/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIsqdd0-tQrGkFc8GE2goPODFc0SqFmPL2ZbLq6au1j-0pmcQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My child spent four years at this school. She is independent, has developed excellent motor skills, is excellent at socialising with her peers or adults, and the topic lesson is appropriate for her age.\n\nThe school is not air-conditioned. So you won't have to worry about your child being unwell too frequent as the classroom has excellent airflow.\n\nOverall, I'm pleased with the school service; enrolling my child in this school was one of the best decisions I've ever made.",
      "time": 1699245871,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16806865585530804469",
  "user_ratings_total": 10,
  "vicinity": "979C Buangkok Crescent, #01-105 Block Block 979C, Singapore"
}