{
  "formatted_address": "1 Jelebu Rd, #03-20, Singapore 677743",
  "geometry": {
    "location": {
      "lat": 1.3796223,
      "lng": 103.7643532
    },
    "viewport": {
      "northeast": {
        "lat": 1.380785230291502,
        "lng": 103.7657680302915
      },
      "southwest": {
        "lat": 1.378087269708498,
        "lng": 103.7630700697085
      }
    }
  },
  "name": "Kimage Hair Salon (Bukit Panjang)",
  "place_id": "ChIJUXhrN6MR2jER-SoQtzFx42E",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "C ZL",
      "author_url": "https://www.google.com/maps/contrib/102678322897644629345/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIerMfyqoGeNiDKO4obYXMGZU8nAAIcxlwk4NQ5VS_Twr_Qmg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Went for a haircut here recently. The leading stylist Felice was very friendly and experienced. Impressed by how detailed/meticulous she was in cutting and making sure the final result is what I wanted . Loved my haircut & fringe perm from her. She was also really nice and gave me tips on how to take proper care of my hair. There was also no hardselling here which I appreciated.",
      "time": 1744683123,
      "translated": false
    },
    {
      "author_name": "Renny Nenpari",
      "author_url": "https://www.google.com/maps/contrib/100661900921747874840/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXIj7FWlkzCCjl6kua5JyK7xcYnkuAZ_1p2QxEHlEHzi_WOIqA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I love coming here for my regular trims & treatments. The staff are always welcoming, pleasant and friendly. I have always been satisfied with their service. They are also not pushy with their services & products. They will respect your refusal with a smile. Keep up with the service!",
      "time": 1733320302,
      "translated": false
    },
    {
      "author_name": "Joanne",
      "author_url": "https://www.google.com/maps/contrib/104103279725284843337/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWw8bmmOaSUNlAGKpNG4rEgF30hAZ3TpWSEELQSL85R-N3f-6K5=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "If I can indicate 0 star for service I will after today’s visit. I am not sure if the reason is undermanned or office politics that all of hairstylists are tasking the same newbie guy to wash and blow dry hair for their customers but it is definitely unacceptable to blow dry my hair halfway and got instructed by another hairstylist to leave immediately to wash hair for another customer whom treatment just ended. Came back to me for a short while and did that again. Not once but twice (leaving my hair to dry naturally). I even have to pick up the hair dryer on my own to blow dry the front segment when I am left unattended the second time and saw another hairstylist snickering when i did that. Am a long term customer (over 10 years) and the amount that I have spent here is definitely no less than any other customer to deserve this treatment. Even a first time customer doesn’t deserve this. The only saving grace is probably Dollyn’s hair cut skills but that is not going to make up for this poor service.\n\nNo need to reply asking me to email for more details (saw that this is the standard reply to all poor rating). The details are stated (didn’t mention names not because I don’t know who they are but just don’t want to go to the extreme). Sort out these issues, else you will lose more customers.",
      "time": 1742118641,
      "translated": false
    },
    {
      "author_name": "Hula Nez",
      "author_url": "https://www.google.com/maps/contrib/110506062012325216349/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKADmWwBjxraov2R2CjV-EVDaM9zAP-G_iGpCXVzpfToBRdEw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "My first visit for a haircut at the Bukit Panjang outlet. Stylist is Dollyn Tan, patient and meticulous. Satisfied with the cut she did for me. Will definitely revisit.",
      "time": 1747322601,
      "translated": false
    },
    {
      "author_name": "Qijia Law",
      "author_url": "https://www.google.com/maps/contrib/107384427579713715100/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJSWq7HcLes56rb1scAny0cuUOiF_scoOxY3URfVVs1NMNcXw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "It was my first time stepping into a well known saloon like Kimage and I had the most wonderful experience! I told Dollyn about the needs of my hair and told her to just cut the hairstyle that she feels will suit me best and she did an amazing job! The shampooing was very comfortable as well as I could really feel the pressure as she massage the scalp. I have a lot of hair and she was really patient to take her time to help me cut my hair layer by layer. I am amazed with the results! There was a lucky draw right before payment and I got a discount off their products but there was no hard selling even though I decided not to buy the product. Really pleasant experience! I would recommend this place to anyone and I would visit again :)",
      "time": 1733237227,
      "translated": false
    }
  ],
  "types": [
    "hair_care",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7053605899730955001",
  "user_ratings_total": 292,
  "vicinity": "1 Jelebu Road, #03-20"
}