{
  "formatted_address": "38 Jln Pemimpin, M38 #01-04, Singapore 577178",
  "geometry": {
    "location": {
      "lat": 1.3483408,
      "lng": 103.8416915
    },
    "viewport": {
      "northeast": {
        "lat": 1.349760130291502,
        "lng": 103.8430609802915
      },
      "southwest": {
        "lat": 1.347062169708498,
        "lng": 103.8403630197085
      }
    }
  },
  "name": "Kimly Coffeeshop (38 Jalan Pemimpin M38)",
  "place_id": "ChIJaeXsEhIX2jERN9kmhvAz7uk",
  "rating": 2.2,
  "reviews": [
    {
      "author_name": "shaik hafeez",
      "author_url": "https://www.google.com/maps/contrib/100869800523875719324/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK9-G4EHAXfOw9M82Vt6EDxoDXn_iVZbp-q6Ultg1dvQz7Gqw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "2 weeks ago",
      "text": "Wanted to buy a iced tea on 07/07/25. The lady cashier was so hostile and spoke in an unfriendly tone when I queried if they had kaya toast. When I ordered my tea, she spoke in an inpatient tone if I wanted takeaway or having in(after telling her takeaway). However, her tone changed as she addressed the customer after me with \"ah boy.....\" If she doesn't like serving other races, maybe she should consider working elsewhere. Lastly, she generously filled up my cup w more than 3/4 ice......",
      "time": 1746581717,
      "translated": false
    },
    {
      "author_name": "Jennifer Lin",
      "author_url": "https://www.google.com/maps/contrib/110227662191701375107/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJph_5S8d-WfHl3R-hdjQZTgoK3IR58Kyrh9gixOCCRd_urpQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "The drink stall 2 aunties attitude damn seriously very bad and unfriendly. Attitude problem.. Like customers owe them billion of dollars.. when ask people what drinks they wants her tone so unwilling (不甘愿).  Some more customer give coin and saw her just throw the coins in the cash box.",
      "time": 1746859294,
      "translated": false
    },
    {
      "author_name": "pB",
      "author_url": "https://www.google.com/maps/contrib/111147778722940108138/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWBK5Ij0rh63HQk4cf34RWpnfHE_o21vZSlbbpF2x8Yx9WTgBx6=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Poor attitude and hygiene standards of cleaning staff. They're far more interested in avoiding any responsibility than actually maintaining a high hygiene standard necessary for food safety. Dirty food court with a lack of convenient trash bins for diners to use. The economy rice also has inconsistent quality and pricing.",
      "time": 1742792111,
      "translated": false
    },
    {
      "author_name": "Ignatius Ong",
      "author_url": "https://www.google.com/maps/contrib/114836817850477694638/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKEO4DYtbiBMRj9DounxcYaAJOXyTqdaY34kiwVt1SGtq_x8Q=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "The customer experience at this coffee shop was unbelievably terrible. We were rudely chased away just because we were doing some light work, even though our coffee time didn’t exceed 15 to 20 minutes. The cashier aunty had the audacity to blame us for issues caused by other customers in the past, treating us as if we were personally responsible. How is that fair or professional?\n\nThe shop was almost empty, with plenty of vacant tables and chairs, yet we were treated with such shockingly bad attitude it left us speechless. Even though we had purchased drinks, we were treated worse than stray animals—completely disrespected and made to feel unwelcome. Honestly, it’s no wonder this coffee shop is nearly always vacant; it seems like the staff are actively pushing customers away.\n\nThe cashier aunty, in particular, is in a league of her own when it comes to rudeness. Her hostility was so extreme that it felt like she was trying to provoke us on purpose. Her attitude was so toxic that we even tried to ease the tension by buying more drinks, and making jokes with her, thinking that maybe she felt we hadn’t spent enough. But no—our efforts were met with even more aggression and disdain.\n\nWith her level of venomous behavior, I wouldn’t be surprised if one day a patron loses their patience and punches her out of sheer frustration. It’s clear that her attitude is completely unsuitable for someone working in customer service.\n\nWe will never step foot in this coffee shop again and strongly advise others to avoid it too. Save yourself the misery and visit the other coffee shop nearby, where you’ll be treated with basic respect and decency. This place doesn’t deserve anyone’s business.",
      "time": 1737556800,
      "translated": false
    },
    {
      "author_name": "Jasper Padua",
      "author_url": "https://www.google.com/maps/contrib/116494321837661250830/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUumz0X9kW743cPZKfmrEXaViBYe9W2C0u-MYD6NArddqE35GHMFQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "Your cleaner uncle is very unfriendly with the customers.\nLike today, We havnt sit down to eat , he approached us and telling us that the  water bottle my friend was carrying is not allowed even if they never drinking it. We explain to him that we will all order drinks but still he is not happy. Every time we come to eat , he is telling the customers ...cant do this and that . I also try to explain to him that he should be friendly with the customers. And many of our friends are not happy coming back on that place already because of his attitude. And maybe, that will be our last time to eat in that place.\nI also tried to communicate to the foods shop crew to tell their uncle that he should talk to customers in friendly manners but they all reply me that they cannot understand english. Hope you will explain to your staff that he must be friendly with customers and not always angry and not looks like he wants to scold all customers.",
      "time": 1735468910,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "store",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16856467563430205751",
  "user_ratings_total": 21,
  "vicinity": "38 Jalan Pemimpin, M38 #01-04"
}