{
  "formatted_address": "6 Lakme St, Singapore 456903",
  "geometry": {
    "location": {
      "lat": 1.3167723,
      "lng": 103.9275352
    },
    "viewport": {
      "northeast": {
        "lat": 1.318106630291502,
        "lng": 103.9288510302915
      },
      "southwest": {
        "lat": 1.315408669708498,
        "lng": 103.9261530697085
      }
    }
  },
  "name": "Kinderland Preschool @ Siglap",
  "place_id": "ChIJ_f24dbAi2jERFpCyN9-5aB0",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Kyler Neo",
      "author_url": "https://www.google.com/maps/contrib/111123642259724505785/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUf506LWBhCGzukCLtZISe3uD0XPCrgMajvjnYYxtOFSzxKJFhw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "My 28 month old son has been attending preschool in Kinderland Siglap for almost 10 months now and I couldn’t be more pleased to see the tremendous growth and improvements in him. My son has never been an easy child as he has serious reflux issues and I have always been very stressed about it. I was desperately looking for a preschool with experienced teachers who can pay extra attention to him and I was impressed by how well he adapted to the food and routine there the first week! The principal and teachers at Kinderland Siglap have been very patient with him and I am extremely grateful to them who have did a wonderful job guiding him on his eating habits and educating him well to prevent him getting frequent refluxes. The teachers are very thoughtful and we often share school and home incidents so that both teachers and parents can nurture the child positively. The principal and teachers are always very responsive whenever I request for updates and they were never stingy sharing photos and videos to assure me that he is doing fine in school. This gives me a peace of mind and enables me to focus on my work obligations at ease. On top of that, his speech ability has accelerated and become more expressive. The school and their outdoor area are clean and classes are organised which fits my OCD criteria as well. All the principal, teachers and children in Kinderland Siglap adores him and best of all, he loves attending school so I do not need to deal with morning tantrums. The children there seem very happy and well-mannered and gives him hugs whenever he comes and goes. It is wonderful to know that he is in a caring and nurturing environment while he isn’t home. What makes a good school are the principal, teachers and environment and these are what parents should look for. I am very glad and thankful that I found Kinderland Siglap and it is the best choice I have made for my son. I highly recommend this school to all parents who are looking for a good preschool.",
      "time": 1744619931,
      "translated": false
    },
    {
      "author_name": "Celeste Lok",
      "author_url": "https://www.google.com/maps/contrib/113279615122878223843/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL8xnCNSPPY1NvcD_QPXFKJ4cw9LzH-VWRcVdksv0HrAD4MqA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Kinderland Siglap deserves recognition for their warmth, professionalism, and love for each student. Every interaction—whether it’s during drop-off, pickup, or school events—reflects their genuine love for what they do and for the children they care for. My girls enjoy going to school and have grown to be happy and confident kids. The environment feels safe, welcoming, and academic curriculum proved robust as my elder girl was adequately prepared for her primary school education. The regular music class was an icing on the cake as it laid foundation to their interest for piano. We were especially appreciative of the commitment of the teachers especially Teng laoshi – her commitment to excellence meant that she took extra care in personally mentoring each student even after the end of their Chinese lesson.\n\nThe combination of an outstanding leadership led by Principal Crystal, exceptional teachers and earnest sincere caring staff makes Kinderland Siglap a place where children thrive in every way. We are grateful for the positive impact they’ve had on my girls and would recommend any parent to consider this center!",
      "time": 1742635171,
      "translated": false
    },
    {
      "author_name": "Poh Jing Xuan",
      "author_url": "https://www.google.com/maps/contrib/100512277435166057494/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIBO9NszgA10vmFaNu5jSCm2up9MjVJymvR3P73GIOnCqPUVA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Kinderland Siglap has been a wonderful place for our child to have crossed paths with many nurturing, dedicated and caring teachers. They are truly hard to come by. I am thankful to have seen how their warmth and thoughtful ways have shaped my child’s growth. My heartfelt thanks and gratitude to Teacher Cynthia, Huang Laoshi, Teng Laoshi, Teacher Mary, Teacher Liena, and all the other amazing teachers who have always gone out of their way to be there. Thanks also to Principal Crystal for creating a supportive environment for the children to grow and learn in.",
      "time": 1741333780,
      "translated": false
    },
    {
      "author_name": "Jerry Lim",
      "author_url": "https://www.google.com/maps/contrib/116962476075537496155/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKocWeJRLVwnBT8tkooj6kyalTKDHfNIGaG27DOoJlUOSB_iQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Our son, Jacob attended Kinderland Siglap since he was 2 years old till he left for Primary 1.\n\nJacob thoroughly enjoyed his time at Kinderland Siglap making so many friends along the way. The schools family days and other events ensured that parents could form relationships allowing us to support each other and socialise with the children along the way.\n\nWe are a non-mandarin speaking family at home and Kinderland Siglap has provided an enviornment that has sparked Jacobs's interest in Mandarin which has resulted in him now wanting to learn at a high level. Big thanks to Teng laoshi guidance.\n\nThe preparation that the school has made to prepare Jacob for primary school has been very effective, Jacob has started P1 with a skip in his step!\n\nPrincipal Crystal has done a good job managing the school and ensuring that it is well run and that the students are safe. Communication channels  are always open and any issues are always promptly dealt with.\n\nWe would like to give a special shout out to all of his teachers from Nursery until K2! Every single teacher has played a vital part and role in his journey to being primary school ready!\n\nThank you Kinderland Siglap 🥰",
      "time": 1738919095,
      "translated": false
    },
    {
      "author_name": "Serene Puah",
      "author_url": "https://www.google.com/maps/contrib/113766542545206422037/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJX5blBU0gLzgz-bO3Y3qhgLNRiwJ_Rb862RBtCgj_JWCBO3w=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Kinderland Siglap has been an incredible journey for our family, and we are beyond grateful for the positive impact it has had on our child’s growth and development.\n\nThe teachers and staff in school genuinely care about each child's individual needs and milestones. They take the time to know each child personally and provide a learning environment that fosters curiosity, creativity, and confidence. We’ve witnessed our child grow into an independent and curious learner, and we attribute much of this to the structured environment at Kinderland.\n\nThe curriculum strikes a good balance between academic learning, social skills, music, and play. Our child has had the opportunity to explore various subjects, including music. We love how Kinderland emphasizes the importance of values such as respect, empathy, and kindness, and we see these attributes shine through our child.\n\nWe also truly appreciate the open communication between the teachers and parents (a big must for me!). Regular updates and feedback on our child’s progress make us feel deeply involved in the educational journey.\n\nChoosing Kinderland Siglap was one of the best decisions we made for our child, and we couldn't be more thankful for the safe, engaging, and loving environment they've experienced. Thank you, Kinderland Siglap, for being such a wonderful part of Caelan's childhood!",
      "time": 1739161479,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2119147993041113110",
  "user_ratings_total": 41,
  "vicinity": "6 Lakme Street"
}