{
  "formatted_address": "140 Upper Bukit Timah Rd, #01-02 Beauty World MRT Exit A, Beauty World Plaza, Singapore 588176",
  "geometry": {
    "location": {
      "lat": 1.3420541,
      "lng": 103.7759083
    },
    "viewport": {
      "northeast": {
        "lat": 1.343388280291502,
        "lng": 103.7771557802915
      },
      "southwest": {
        "lat": 1.340690319708498,
        "lng": 103.7744578197085
      }
    }
  },
  "name": "KINGSWAY MEDICAL CLINIC (BEAUTY WORLD)",
  "place_id": "ChIJERZAaFUb2jERBvdILyyAQwM",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Christopher Toh",
      "author_url": "https://www.google.com/maps/contrib/107522530225718312759/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJmX5nYle2IeW76eh6NR8PHLqZ27boDyG-avXBQd2z2PZaw0g=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "Probably one of the most expensive clinic I been in Bukit Timah! Went to see Dr Andrea on Wednesday for the first time, I was prescribed with quite a few medications, yet third day after the visit I’m still feeling horrible. Went in today to ask if I could get antibiotics straight. Yet I was told to pay consultation to see the doctor again. Already paid $159.80 after Chas rebate on the first visit. Can’t even solve a command flu virus. Took a look at their Google reviews, seems like this clinic likes to push medications. Don’t be scam by their cheap consultation fee of $18 and Chas registered! Just take a look at my bill many other clinics can do better not even half the amount charged.",
      "time": 1745581119,
      "translated": false
    },
    {
      "author_name": "Cat Wang",
      "author_url": "https://www.google.com/maps/contrib/101106365552552410626/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLpYFeK1rEKa4ZnD7Y4PYa7t2T4AjA0-TLQ8Q4z5xmVo1wO3g=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Waited for 1.5hours even though they told me only 20-30 min. That caused my other arrangement late.\nThere was a lady here and took her 2 babies. They were very loud for 1 hour, and the lady didn’t ask her kids lower the voice. No people in the clinic reminded them as well.\nThat is the third time doctors had a lot of medicine to me, even though I told him I still have those at home.\nThe reception girls took another 20 min for the medicine check.\nWon’t come here anymore.",
      "time": 1742471288,
      "translated": false
    },
    {
      "author_name": "Baiying Li",
      "author_url": "https://www.google.com/maps/contrib/111561561577696778488/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLZJWUidG_EYTwy-Ho8HxyVTNcOGQus-0FgarINkHgaGgjOog=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "Very unprofessional and bad experience. I brought my 5 yr old daughter to check her throat and reasons for cough. She looks well, active as normal, no fever, no pain, no breathless condition.A female doctor listened to her lung and diagnosed it’s lung infection, caused by virus or bacteria, and prescribed 7 days anti biotics, and warned its contagious. I asked her why did she think it’s bacteria as it doesn’t look like it. She said because there’s noise in her lung, so my daughter needs to take anti biotics, it’s very common for this case. She was very impatient and didn’t explain from professional perspective. She said if I don’t want to prescribe anti biotics, she will write down it’s me who refuses. I would like to consult another children doctor or do further X-ray, she said confidently it will be the same answer. I’m at early 30+ and she called me auntie, Ayi,阿姨，during conversations, I’m also very shocked. So I decided to see another nuh children doctor, even it’s late, who then gave different and reasonable explanations and choices for me, very professional, Xray shows her lung is normal. luckily she didn’t overdose and takes anti biotics.Ps, this female doctor still prescribed many medicines, including an anti inflammation medicine, which other doctor doesn’t recommend my daughter to eat at all. lastly, I got a call from this clinic that they mistakely gave me a medicine which is not covered in the insurance, and I came back to return it.I can understand mistakes happen sometimes. But being an unprofessional and irresponsible doctor especially for kids, is what I couldn’t accept.I will not come to this clinic again.",
      "time": 1745911942,
      "translated": false
    },
    {
      "author_name": "CNT",
      "author_url": "https://www.google.com/maps/contrib/117480972620690857317/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIgeVW_dj2w2drZqsXaRIg3bFaWh_rWnZ1jTDJPP4FXIJrkGV8=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "The doctor was flustered this morning when I went in for consultation. She didnt seem settled to receive a patient. Throughout the consultation, I didnt feel like I was being listened to.  Eventually I was given many medication, one of which was something i was severely allergic to. I asked the doctor why she thought i had a viral infection, she said she would give me antibiotics just in case.\n\nI have seen so many gps in my life. I must say the female doctor I saw this morning was one of the most insincere.",
      "time": 1745037963,
      "translated": false
    },
    {
      "author_name": "Claire Lim",
      "author_url": "https://www.google.com/maps/contrib/112878502680704888582/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIjme1AmsDWzq4q5G3EesrKZZdCB1HTYBva88i4bEmlLaJTrA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "I have my reservations about the female doctor who saw me this morning, very unprofessional and I would advice all going to this clinic to look out for what medicines you’re being prescribed.\n\nI came in for a sore throat and fever. She wanted to prescribe cough medicine, phlegm medication, anarex (fever medication), lozenges and throat spray. When I told her multiple times that I had all of these over the counter medication in stock at home, she insisted should take these, saying that the last time I had come to the doctor was quite some time back. I told her whatever she was prescribing was easily obtainable at a pharmacy and I had stock aplenty at home. She then suggested that I took Arcoxia for my fever. That’s when alarm bells rang for me, because arcoxia is a strong drug for pain that is usually used for arthritis and backache. I declined, and also asked her what the cough mixture was for since I did not have the symptom. She said the last bottle I was prescribed was quite some time back and I needed it to cough the phlegm out. As an afterthought, cough mixture is for prevention of cough, not to cough phlegm out. She also told me that ‘since you’ve Medisave and Chas, don’t worry you can pay for all these medications using it’. This is not the right approach at all.\n\nI left this clinic feeling quite confused. She had only spent 3 seconds each looking at my throat and on the stethoscope. I have no clue what’s the diagnosis except ‘it may be a viral infection’ and worst still, did not get any useful medication for my sore throat, since all she could prescribe was lozenges and throat spray.\n\nDo be careful all.",
      "time": 1745983443,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=235172532813625094",
  "user_ratings_total": 463,
  "vicinity": "140 Upper Bukit Timah Road, #01-02 Beauty World MRT Exit A, Beauty World Plaza"
}