{
  "formatted_address": "60 Fairways Dr., Singapore 286966",
  "geometry": {
    "location": {
      "lat": 1.3456607,
      "lng": 103.7962067
    },
    "viewport": {
      "northeast": {
        "lat": 1.346867980291502,
        "lng": 103.7976658802915
      },
      "southwest": {
        "lat": 1.344170019708498,
        "lng": 103.7949679197085
      }
    }
  },
  "name": "KiwiAuto Exports",
  "place_id": "ChIJc55T-TIa2jERGqVJWG5PCIw",
  "rating": 3.3,
  "reviews": [
    {
      "author_name": "Advantage Cars",
      "author_url": "https://www.google.com/maps/contrib/109011877547338949275/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVV879JAJjE2r0vlF0vOt8-MUEgboXzUGCeJ_FsgCCBQUgwV6qS=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 years ago",
      "text": "We are a large car dealership in Auckland NZ, and I chose Kiwi Auto Exports to purchase a rather expensive personal vehicle for myself. I found Jerry and Kevin to be fantastic to deal with. They answered every question I put them, answered them honestly, and gave me great advice. I would have absolutely no hesitation in recommending them and their company. They did absolutely everything they said they would. No issues at all.\n\nI was concerned as anyone would be to read some of the reviews on here, but I think a lot of the reviews on here speak more about the person writing them than the company receiving them. These are second hand vehicles, and just like back in NZ, sometimes there are issues that are completely unknown at the time of delivery, that may arise later. Jerry allowed me to get my car checked out in Singapore, and even chipped in to help fund a few issues that arose from it. These aren't brand new cars, and some people on here need to maybe lower their expectations a little. In my regards, this was the first time I had dealt with them and they exceeded my expectation. You don't earn a good reputation like Jerry Clayton has by upsetting people. Jerry and Kevin, I wish you all the best for the future, and rest assured that you have one happy customer in me. Thanks You.",
      "time": 1553811270,
      "translated": false
    },
    {
      "author_name": "Alexander Watson",
      "author_url": "https://www.google.com/maps/contrib/101734021041385183628/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ_ny45oJdxr4ZYPDtNl-mwHIIdqtRQ68dt54hRjQtdRmXElw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 years ago",
      "text": "Top of the class to Kiwi Auto Exports. Jerry Clayton owns and operates it. I brought a 4 x 4 Volvo off Jerry. Great car, good price, but the brakes would not stop squeaking (sounded like ex-wife), any case next visit to Auckland Jerry comes to our house and says no problem, stop driving it like a girl!!!! So off we went for a blast and the squeak disappeared. Good work Jerry, we would not hesitate to buy another car off you",
      "time": 1521186495,
      "translated": false
    },
    {
      "author_name": "Christopher Gibbs",
      "author_url": "https://www.google.com/maps/contrib/114164906316912281505/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLD27DUt2BuyaolC8dlFMzyzJFDowuQc5fhIzHTrP3LmRqPjg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "6 years ago",
      "text": "My name is Chris Gibbs, Owner of Royale Cars in Hamilton. I have been in the Used Car business in NZ for 40 years.\nI have had industry dealings with Jerry Clayton, owner of Kiwi Auto Exports, on and off for 37 years.\nI started testing the NZ market with cars imported from Singapore,  withJerry Clayton several years ago,  and because I had had previous dealings with Jerry, I felt that a familiar face, and a familiar name, I would be safe. I was assured by Jerry that all his cars were extremely carefully inspected prior to shipping to New Zealand and that I could rely on his experience and name.\nCars sent originally were as described and I was quite happy with the quality. If only things could have stayed that way. Unfortunately we started to recieve some vehicles that were definitely not as described, some with quite serious faults that looked like they had been intentionally covered up prior to shipping. Faults that were glaringly obvious and any basic inspection would have them noted. Shortly thereafter we recieved 4 cars from Jerry with absolutely major faults. I approached Jerry for assistance to have these faults rectified by his company or recieve a refund.\nSadly Jerry refused to reply to my emails or phone calls.\nAfter several weeks, I realised that my efforts to get a response from Jerry were going to be fruitless, and that his original promises and word were worth nothing.......just hot air.\nWe have not purchased from him since.\nI still have all the emails, so if he does reply to this review and attempt to play this review down....I can prove what I am saying is true.....and prove his ZERO response.\nThis review is not intended to be maliscious and I only post this review as a voice of warning. It is certainly buyer beware. So be extremely careful dealing with Jerry Clayton and Kiwi Auto Exports.",
      "time": 1557904580,
      "translated": false
    },
    {
      "author_name": "Inderjit Singh",
      "author_url": "https://www.google.com/maps/contrib/109928444567101737515/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVeFamM7qLwHeoITm46Kk9-0hgD77Zj62pSkxRH-q3exBMlvOUg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 years ago",
      "text": "Unfortunately, never looked at reviews before buying. Very dodgy and fake person the moment you report any problem in the car you received, or it cannot comply in NZ, Jerry will go in hiding, your emails will never be answered. If  he answer your call by mistake then he will strat making false promises. On most of their cars the cost of repairs or to get officially complied for nz will be more than price of car. Now, in minutes Jerry will straightway lie and deny your comment. He is big fat liar. But now I believe those negative reviews. Worst person to deal with. I suggest everyone not to buy a car from him",
      "time": 1591685759,
      "translated": false
    },
    {
      "author_name": "John Shaw",
      "author_url": "https://www.google.com/maps/contrib/101812448081046630835/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKSooKKw3j1Ygagj4-yEZXzsRFHEDQrmRjua249eHGu8sOhVA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "7 years ago",
      "text": "I too had a poor experience with the last car from Jerry Clayton, bought A 2005 Volvo I was assured it was a nice example as it was owned by an associate of Jerrys, this car was for my brother in law, Jerry assured me it was a great example, well cared for and well serviced .   We paid for it and then didn't hear anything, tried to get hold of Jerry but struggled to get a reply, he claimed he had his email hacked.  Anyway after nearly 2 months we finally got the car.   What a disappointment, it was all scratched up, the interior photos we saw didn't show the stains or wear on the leather seats or broken trim, had 4 different tyres on it, the car was almost undrivable, the main engine stay bushes were so worn the torque reaction opened the throttle as you drove off, suspension bushes so worn the car rattled and banged over every bump. $ 2000 later and it was usable.  Then the ABS light came on, and then the trans failed, on a genuine 80000 km car!!!!!!! Tried to contact Jerry but never got any reply to  the problems.   All in all a very poor experience, it would appear I was very much deceived on the condition of this car or it just wasn't inspected.  Being a fellow kiwi and businessman One would think Jerry would be a trustworthy character and know what he is doing but unfortunately it would not appear to be so. Over the years I have bought a total of 3 cars from Jerry, the first two were fine and as described. But the last one an utter dog.  And the worst thing Jerry wouldn't reply and discuss the situation .     Very very disappointed in Kiwi Autoexports and suggest all future buyers think long and hard before doing buisness with this company.\n\nHi Jerry Thanks for the reply and offer----------My comments were a little late but its the first time I have seen this forum and the situation with the Volvo REALLY bugged me all this time later! Mainly because I bought the car for a relative and it turned out to be a dog!!.     But moving forward its good to hear you have changed your system for inspection which will weed out the stuff that shouldnt be sold by your company.  I think communication too is very important and the measure of a company is how it deals with complaints.   All the best      John Shaw ( Shaw Motorcycles NZ)",
      "time": 1524026227,
      "translated": false
    }
  ],
  "types": [
    "car_dealer",
    "store",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10090402300469814554",
  "user_ratings_total": 18,
  "vicinity": "60 Fairways Drive, Singapore"
}