{
  "formatted_address": "33 Tras St, #02-01, Singapore 078973",
  "geometry": {
    "location": {
      "lat": 1.278454,
      "lng": 103.8446269
    },
    "viewport": {
      "northeast": {
        "lat": 1.279979630291502,
        "lng": 103.8456011802915
      },
      "southwest": {
        "lat": 1.277281669708498,
        "lng": 103.8429032197085
      }
    }
  },
  "name": "Kko Kko Na Ra 꼬꼬나라 (Hansik Dining Collective)",
  "place_id": "ChIJnbZALm0Z2jERqM4NvFkehe8",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Flo Yeow",
      "author_url": "https://www.google.com/maps/contrib/101597484841229205770/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUCED0nHINoONtoIhYrg_037nt9gzG8G4ZOxJ3RLinEhCioWYU8hrs=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 3,
      "relative_time_description": "4 months ago",
      "text": "This is a solid spot for gathering with friends or colleagues after work, especially if you're craving Korean fried chicken. It's located amongst a strip of other Korean restaurants, likely under the same management.\n\nTheir fried chicken is definitely the star of the show, and they offer a variety of other standard Korean dishes as well. The food is all well-prepared and satisfying, but nothing particularly innovative or memorable.\n\nThe service is efficient but could be more attentive. While they get the job done, they weren't as proactive or helpful as I would have liked. Overall, it's a decent option for a casual Korean meal, but don't expect anything extraordinary.",
      "time": 1735976963,
      "translated": false
    },
    {
      "author_name": "Viva La Vida",
      "author_url": "https://www.google.com/maps/contrib/101978204761063024043/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXnif1gUjvT53YuJBbg0WsJ2MgM381b6rdnL_rOebXv44iaMuAC=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "The star of the night was the side dishes, really good. Kimchi was not sour and pretty authentic, and the anchovies was one of the best we've had. Was craving for Korean fried chicken and tried this restaurant for the first time, not as good as I've expected but not too bad. The spicy chicken was very crispy but a little dry, sauce was too little. Skip the kimchi soup, overly priced for sure, $25 or $28 but felt like food court level. The kimchi soup was on the sour side, unlike the side dish. Ample space but there was a big group that's rather rowdy and noisy. Price point is slightly on the high side, each pax about $35 for 2 dishes.",
      "time": 1746667975,
      "translated": false
    },
    {
      "author_name": "Ruby S",
      "author_url": "https://www.google.com/maps/contrib/113136595480459522801/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVtU91GVsA9FahL50_7b6jXYGyrdFVJTx78WJWTvhzheA-KMRlE=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Food is not as good as it was, before they moved to Tras Street at least. The sweet and spicy chicken we ordered is very dry, except for the chicken wing part which was abit better. We expected it would be juicy but was disappointed. Not sure if the cuts are same for every table’s order, but a lot of the 8-pieces we got were non-thigh parts, apart from the one drumstick.\n\nThe seafood pancake is also a letdown. The squid cuts were those that you can find frozen in supermarket. And the shrimps were those pre-peeled mini shrimps that u can easily find in supermarkets too. Paying $33 for this is really not worth it, there are many better pancakes, with fresh seafood served, in other korean places we have tried.\n\nVisited three weeks ago but unable to post the review back then.",
      "time": 1745035323,
      "translated": false
    },
    {
      "author_name": "Shirley Lim",
      "author_url": "https://www.google.com/maps/contrib/110430313389823015589/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWpNv-yhyqbBhnvJ2ptfCv2IncXGfi_wwrWxcntcqGqYpdCE2CPTw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "One of the best korean fried chicken i have ever eaten in Singapore. Their stews are also tasty. Side dishes are free flow and delicious. Will be back to try other dishes.",
      "time": 1735775634,
      "translated": false
    },
    {
      "author_name": "Qing Sheng Goh (Sam)",
      "author_url": "https://www.google.com/maps/contrib/105900313167707583082/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIgbCL6H5tJqMUpDICEfJQ7r2iED7yqTMeCWnpEO4ODTjVKaw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "The meal was rather disappointing. The zha jiang noodles were salty but not savoury, nothing like the Korean style—more like they were made with instant noodles. The kimchi soup has only a sour taste, and the meat doesn't taste right and too fatty , making it completely unlike authentic kimchi soup.\n\nThe Korean fried chicken was worse than McDonald’s fried chicken—dry, overly spicy, and not juicy at all.\n\nThe rice wasn’t even Korean rice. The food is like a normal hawker center standard, doesn't worth the price.\n\nI completely regretted it. This experience was totally different from what we had a year ago, before they move to this new place.",
      "time": 1735623311,
      "translated": false
    }
  ],
  "types": [
    "meal_takeaway",
    "grocery_or_supermarket",
    "meal_delivery",
    "restaurant",
    "food",
    "store",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17259234517723238056",
  "user_ratings_total": 1216,
  "vicinity": "33 Tras Street, #02-01, Singapore"
}