{
  "formatted_address": "682 Hougang Ave 4, Block 682, Singapore 530682",
  "geometry": {
    "location": {
      "lat": 1.3745572,
      "lng": 103.8857568
    },
    "viewport": {
      "northeast": {
        "lat": 1.375832280291502,
        "lng": 103.8871287802915
      },
      "southwest": {
        "lat": 1.373134319708498,
        "lng": 103.8844308197085
      }
    }
  },
  "name": "Klang Bak kut teh ( 肉骨茶 )",
  "place_id": "ChIJO0VowMEX2jERyw4p_Q_1KQg",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "YL",
      "author_url": "https://www.google.com/maps/contrib/117623755190840857500/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocItirpS_dWu0EHu2BMjDuCi0NzfaTXu2ock0NdmXwt2M1g_fw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Taste great and happy to have a decent Bak Kut Teh in the area. The ribs are tender and soft and soup is fairly rich. Prices is ok also will definitely come again hopefully to dine in.",
      "time": 1742613271,
      "translated": false
    },
    {
      "author_name": "oXRYSTALo Ong",
      "author_url": "https://www.google.com/maps/contrib/114556064085815871377/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSTtKcF9FYMbh-XNbDu8f7Whl3gi-ZY6T8pFPOm3v9Y98Ws7jL=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Klang Herbal Bak Kut Teh (Hougang): A Delicious and Hearty Feast (4.5/5 Stars)\n\nRating:\n\n• Food: 4.5/5 (Delicious and flavorful Klang Herbal Bak Kut Teh, with tender pork ribs, tasty meatballs, and a perfectly balanced broth)\n• Service: 5/5 (Incredibly friendly and efficient service, with a generous refill and thoughtful touches)\n• Atmosphere: 4/5 (Lively coffee shop setting, with a bustling atmosphere that suggests delicious food)\n• Value: 4.5/5 (Reasonable prices for generous portions and high-quality ingredients)\n\nOverall: 4.5/5\n\nDonkey and I were on a cycling adventure in Hougang, searching for a satisfying dinner. We stumbled upon a lively coffee shop with one stall that had a long queue.  That's always a good sign of something delicious, so we decided to give it a try.\n\nI had been craving dry Bak Kut Teh, a dish I absolutely love from Klang Bak Kut Teh in Kuala Lumpur, but sadly, it was sold out. Donkey, too, had his sights set on the pig’s trotter rice with pig intestines, but those were also unavailable. The boss explained that their popular dishes usually sell out early in the evening. If we wanted to try those, we’d need to come before 6 pm, though even then, many items might already be gone.\n\nIn the end, Donkey ordered their signature Klang Herbal Bak Kut Teh. The boss mentioned they had run out of lean pork and only had pork ribs left. To make up for it, they replaced the lean pork with meatballs. With little choice left, Donkey went for the large portion ($14), along with salted vegetables and you tiao as sides. We also asked for an extra bowl to mix chili padi and garlic with their soy sauce.\n\nService was impressively fast. The lady boss and the guy preparing and serving the Bak Kut Teh were incredibly friendly. Our dishes arrived within two to three minutes of ordering.\n\nThe Klang Herbal Bak Kut Teh was fantastic. The broth was aromatic and flavorful, perfectly balanced with herbs and spices. The pork ribs were tender and fell off the bone, clearly simmered for hours. The meatballs were flavorful too and added a nice textural contrast. The soup itself was hearty, filled with plenty of ingredients that made it even more satisfying.\n\nOnce Donkey finished the soup, he brought the clay pot to the counter for a refill, and they happily obliged—such a nice touch!\n\nThe you tiao was crispy, and the salted vegetables turned out to be a delightful surprise. Unlike most stalls that serve regular salted vegetables, this stall used mei cai (preserved mustard greens). It was so tasty! The preserved cai bo mixed into the mei cai added another layer of flavor, which we both appreciated.\n\nEven the soy sauce stood out—it was thick, rich, and concentrated, unlike the watered-down versions you often find elsewhere.\n\nOverall, the meal was an absolute delight. The flavors were on point, and we left satisfied despite missing out on the dishes we originally wanted. We’re definitely coming back to try their pig’s trotter rice, pig intestines, and dry Bak Kut Teh next time. This place has definitely won us over!",
      "time": 1737828395,
      "translated": false
    },
    {
      "author_name": "Doraemon",
      "author_url": "https://www.google.com/maps/contrib/112665277904119154671/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX2VSCcaT9axvOwx2nD8XD3PgZ8V5VFnv420aocMSfLa6GlcEmN=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Kitty and I were on a cycling adventure in Hougang, looking for a satisfying dinner. We stumbled upon a bustling coffee shop, with a long queue at one particular stall. It was a sure sign of deliciousness, and we knew we had to try it.\n\nKitty had been wanting to try the dry Bak Kut Teh, a dish she loves from Klang Bak Kut Teh in Kuala Lumpur, but unfortunately, it was sold out. The same was true for the pig's trotter rice with pig intestines that I had my eye on. The boss explained that their popular dishes usually sell out early in the evening. To get those dishes, we'd have to come before 6 pm, but even then, many others were already gone.\n\nI ended up ordering their signature Klang herbal Bak Kut Teh. Even with that, the boss mentioned that the lean pork was gone, only pork ribs were left. They would replace the lean pork with meatballs. I had no other option but to comply. I ordered the large portion for $14, along with the salted vegetables and you tiao as a side dish. I also asked for a bowl so I could add more chili padi and garlic to their soy sauce.\n\nThe service was incredibly fast. The lady boss and the guy who served and cooked the Bak Kut Teh were very friendly. We got all our dishes within two to three minutes of ordering.\n\nThe Klang Herbal Bak Kut Teh was delicious. The broth was flavorful and aromatic, with a perfect balance of herbs and spices. The pork ribs were tender and fell off the bone, showing they had been simmered for quite some time. The meatballs were also flavorful and added a nice textural element to the soup. The soup itself was packed with other ingredients, making it a well rounded and satisfying dish.\n\nAfter finishing the soup, I brought the clay pot to the counter and asked for more. They happily refilled it, which was a lovely gesture.\n\nThe you tiao was nice and crispy, and the salted vegetable was a delightful surprise. Kitty commented that it's not common for stalls to serve mei cai (preserved mustard greens). Usually, it's just salted vegetables. But this stall used mei cai, which was really tasty. There was also some preserved Cai bo in the mei cai, which added another layer of flavor.\n\nThe soy sauce they served was rich and flavorful. It wasn't watery at all, which meant they hadn't added extra water to it. It was concentrated and delicious.\n\nOverall, we had a very enjoyable meal, and we're definitely looking forward to trying their pig's trotter rice, pig intestine, and dry Bak Kut Teh in the future. The food was delicious and we'll be back to try more of their menu soon.",
      "time": 1737827561,
      "translated": false
    },
    {
      "author_name": "Gratto Scotto",
      "author_url": "https://www.google.com/maps/contrib/102842962790607868497/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUpdGeEkchiP60Q5KtTVXydPSEKhq5apzlqb2iDHse8pE2JwpA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "As far as local coffeeshops go, this 泳记 takes the cake (no cake here). Braised Pig's Trotter has the right amount of flavours, texture and softness that elderly and adults love to enjoy. The gravy that comes with it has that right amount of condiments to go with rice. Staff is efficient and polite. If any food influencers want to do a \"rare gem\", then this is the place.",
      "time": 1740451407,
      "translated": false
    },
    {
      "author_name": "Sunny M",
      "author_url": "https://www.google.com/maps/contrib/116788322544213433170/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKnvR8R6MkeZyovzlw_JHlRWzs1iglF5_bR4GdZDK8yekpt5w=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "7 months ago",
      "text": "Date of visit :  Mon 21 Oct 2024\nTime : 9.10 pm\n\nHappened to be here and trying this stall for the first time.\n\nOrdered the signature bak kut teh and the braised large intestines and 1 rice.\n\nBoth are good. The intestines are soft and tasty due to the excellent sauce.",
      "time": 1729558958,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=588270675369201355",
  "user_ratings_total": 18,
  "vicinity": "682 Hougang Avenue 4, Block 682, Singapore"
}