{
  "formatted_address": "21 Choa Chu Kang North 6, B1-11 YewTee Point, Singapore 689578",
  "geometry": {
    "location": {
      "lat": 1.397085,
      "lng": 103.7464709
    },
    "viewport": {
      "northeast": {
        "lat": 1.398564580291502,
        "lng": 103.7479190802915
      },
      "southwest": {
        "lat": 1.395866619708498,
        "lng": 103.7452211197085
      }
    }
  },
  "name": "Kleen Wash",
  "place_id": "ChIJ2xwx_PMR2jERIaDFHuYFZyE",
  "rating": 2.4,
  "reviews": [
    {
      "author_name": "Faith",
      "author_url": "https://www.google.com/maps/contrib/100533378757177204438/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVZHZN-vnHewlitlrgKp2xum-T_OekuiezQUdvNME1wNk6yeX0=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "No complaints with my winter duck down jacket. $48 for dry cleaning. Ready after 7 working days. Came to collect after 5pm. No damages, smells soo good. Came packed neatly with hanger and plastic cover.\nI Will definitely come back again.\n\nLast time, I came for suit alterations too and lady said it's cheaper if I buy a new suit elsewhere than to alter but I said it's ok since it's hard for me to get my size anywhere, so I might as well just alter it. Handy work was well done too.",
      "time": 1733238547,
      "translated": false
    },
    {
      "author_name": "Des Chew",
      "author_url": "https://www.google.com/maps/contrib/112173845438494631807/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK40c1GQKJPFhw8kUd3RsnwL3nHwUvzz0iL26RlPOWNxbB8hw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "I had a very disappointing experience with the service at Kleen Wash Yew Tee Point today. I purposely tried to avoid the lunch hours to ensure that the staff would be available. I arrived at 2:30 PM, and found out the staff was having lunch halfway through at the front counter. When I approached her for assistance, she glanced at me and simply said, \"30 minutes,\" before continuing her meal without saying anything else.\n\nI understand that staff are entitled to their lunch breaks, but I was surprised by the lack of professionalism and customer service. It was only a few minutes task, and as a regular customer of many years, I was disappointed by the attitude. I didn’t mind waiting 30 minutes if the staff had actually been on break or unavailable, but the fact that she was physically present and still asked me to return later. frustrating, especially since I was on a tight schedule for an appointment. Where is the customer service??!",
      "time": 1732089231,
      "translated": false
    },
    {
      "author_name": "Felicia Han",
      "author_url": "https://www.google.com/maps/contrib/113848602117672788690/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWWW5Vd9z3o019DEClsWEP9k7zInD4MCdAbhbEp-C_LTjLOniYu=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "11 months ago",
      "text": "came here to dry clean my wedding gown & suit! was quoted $172. during collection, i informed the lady that i misplaced my receipt, & asked if i could provide my phone number instead. she was very aggressive, very angry because she said without the receipt, she has to go search for it, & told me to wait 30 mins. i accepted it. i waited outside her store, & she told me to wait another side. i waited another side, but she told me i will block the other person’s business & told me to wait outside her store. waited outside her store then she asked me to go shopping first, although she could see i was holding two big ikea boxes. very difficult. upon payment, i provided her with two numbers & upon collection, i only gave her one of the two numbers, assuming it will be ok. she was also angry at this. can’t comment on quality since it’s my first time dry cleaning, but i’ll never return. paying to get scolded.\nupdate: i realise the dry cleaning did not clean my gown properly — noticed it’s still dirty at the bottom. disappointing :(",
      "time": 1717917759,
      "translated": false
    },
    {
      "author_name": "jenny sim",
      "author_url": "https://www.google.com/maps/contrib/114960148579597862095/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKINVu1r9dVOdqJAwZBi179a0BpdstZ36BBiwG6Y_5mI3HJug=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "The lady boss(from China) got attitude problem. She is very proud,  arrogant, aggressive, nasty attitude towards the customer who comes to her shop.  She only wants money from them but give bad services. Hopefully her shop will close down  soon because of her bad services .",
      "time": 1703980786,
      "translated": false
    },
    {
      "author_name": "Angeline See",
      "author_url": "https://www.google.com/maps/contrib/105088646979612563047/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK2IrHpJZ8bidQKzjpNZ2j-SUYaKrOzYxjn1HrTwC4cZm4Xs44=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "8 months ago",
      "text": "Rude and complete disinterest in doing any business. Whether tailoring or laundry. Not sure why they bother to run a shop here at all with the attitudes they have.",
      "time": 1724987815,
      "translated": false
    }
  ],
  "types": [
    "laundry",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2406899011769704481",
  "user_ratings_total": 27,
  "vicinity": "21 Choa Chu Kang North 6, B1-11 YewTee Point, Singapore"
}