{
  "formatted_address": "3 South Buona Vista Rd, B1-44 Viva Vista Shopping Mall, Singapore 118136",
  "geometry": {
    "location": {
      "lat": 1.279714,
      "lng": 103.7860135
    },
    "viewport": {
      "northeast": {
        "lat": 1.281140830291502,
        "lng": 103.7874766802915
      },
      "southwest": {
        "lat": 1.278442869708498,
        "lng": 103.7847787197085
      }
    }
  },
  "name": "KW SHRIMPS",
  "place_id": "ChIJjWComxMb2jERn2ArWOiqpYg",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Handri Kent",
      "author_url": "https://www.google.com/maps/contrib/109466238023624380729/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVCY025mPfa7E-NrlV1-NFQWEFIJeEVVfNIy8M7ryosreY0jSl1=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I had a great experience buying Kelvin’s shrimp from Indonesia and had my friend who visit Singapore and get the shrimp for me.\n\nThe shrimp quality is very good. As a beginner I start with PRL (Pure Red Line) & PBL (Pure Black Line).  VERY BEAUTIFUL SHRIMP!!!\n\nAnd I want to thanks to the shop owner, Kelvin Wong. He is a very nice person who are very patient teaching a beginner like me.  He taught me a lot how to be a shrimp keeper, from choosing soil, water parameter, and the maintenance.\nHe a a great person to learn from.\n\nEven I didn't visit the store and picked the shrimp myself, Kelvin choose a very good color shrimp for me. He also gave me 10  culled shrimp for me to test my water. It tooks almost 24H from getting the shrimp which put in the flask until I got it in Indonesia. All shrimp survived, no death. Very beautiful and healthy shrimp.\n\nNo wonder his Reputation and Trustworthy makes him a Champion in Caridina Shrimp Breeder.\n\nI can not wait to visit and meet Kelvin when I go Singapore.  Thank you Kelvin Wong !",
      "time": 1736331456,
      "translated": false
    },
    {
      "author_name": "John Eames",
      "author_url": "https://www.google.com/maps/contrib/108636092559530311335/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKrGpbrQvU0rd37ccCANTnkWc4UL2oG8p2h3lUYRtfdDkLs8A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Kelvin has thee best bacteria I have ever used hands down. You’ll get green walls up fast during cycling and maintain a healthy balance to your shrimp tank. His Lubao balls are fantastic as well. Tons of biofilm!!",
      "time": 1734236222,
      "translated": false
    },
    {
      "author_name": "Bob Wang",
      "author_url": "https://www.google.com/maps/contrib/114829016232177689098/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK_cDAsYBpSzTa-fDcDlhmz8X-Lq5dwtaLtzgH8otNgfpvzsQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "The amiable owner treated this customers cordially and tended to each one, veteran and beginner alike. As i was fairly new to shrimp keeping, i was hesitant to ask about the hobby however Kelvin gracefully shared his knowledge and personal experiences, giving pointers along the way. Not to mention, the shrimps are stunning and online photos do not do them justice when you see them in the store. Would definitely come again and recommend anyone who is interested in the hobby to check out  his vibrant menagerie. Thanks Kelvin once again!",
      "time": 1736082066,
      "translated": false
    },
    {
      "author_name": "Eric Soh",
      "author_url": "https://www.google.com/maps/contrib/110672012905710670293/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIT5jJr6guTyOWTxsmY06-U26us6pqi4cZ_ayBRoh8nOFzUlw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Hands down, the best shrimp shop in singapore. Kelvin has so much knowledge and yet he shares and guide me every step in starting the right way to keep shrimps without hesitation. I'm very grateful and thankful for his advice. He's is really friendly and helpful to noob like me.\n\nMust support his store! I have nothing but just amazed by the shrimps that he has! Thumbs up!\n\nBest advice! Keep it simple!\n\nUpdate review 18/04/25\n\nWent back and buy even nicer shrimps. Kelvin really give you best advice. From 1 cull tank now i have 3 new tank. 1 Sunset 1 Wicked 1 Red stardusts x boa. From water parameters to green wall. Kelvin really is very knowledgeable. I will continue to support his business.\n\nThumbs up!",
      "time": 1744974426,
      "translated": false
    },
    {
      "author_name": "Johnny Chua",
      "author_url": "https://www.google.com/maps/contrib/114302441614305260055/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKikvCOvbgGK30Pkuy4CItGC3t5XYIBEPrK3CF9AhWPGWebBw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Quality shrimps, knowledgeable and humble breeder. This is what you can expect to find at KW shrimps. Kelvin has been breeding quality shrimps for many years, and also willing to share his experience with people who are interested to start shrimp keeping. Everytime I need some advice, I never feel afraid to drop Kelvin a text and he is always happy to share his knowledge. Definitely recommend newbies and breeders who want to go into high grade shrimps to patronise his shop!",
      "time": 1737126239,
      "translated": false
    }
  ],
  "types": [
    "aquarium",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9846464075203829919",
  "user_ratings_total": 15,
  "vicinity": "3 South Buona Vista Road, B1-44 Viva Vista Shopping Mall"
}