{
  "formatted_address": "56 Tanglin Rd, B1-02, Singapore 247964",
  "geometry": {
    "location": {
      "lat": 1.3054519,
      "lng": 103.8230471
    },
    "viewport": {
      "northeast": {
        "lat": 1.306908680291502,
        "lng": 103.8243967802915
      },
      "southwest": {
        "lat": 1.304210719708498,
        "lng": 103.8216988197085
      }
    }
  },
  "name": "Lad & Co",
  "place_id": "ChIJIQLgawcZ2jEROFNz_R_IMNk",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Otgoo Bayar",
      "author_url": "https://www.google.com/maps/contrib/102357615578282527115/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXIX6tMNSqZmRkz5WSi41rtvJtBxbWyl2NBbu6mMOPj02Kjd_k7=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Having visited this delightful spot for many years, I can wholeheartedly say that the quality remains impeccably consistent. The fish is always cooked to perfection, boasting a taste that simply doesn't waver consistently fresh and utterly delicious. It's the kind of taste that keeps you coming back for more, year after year.\nBeyond the fantastic food, Lad & Co offers a warm and welcoming atmosphere. The staff are consistently friendly, always greeting you with a smile and providing excellent service. What's truly amazing is their thoughtful attention to my fur son, my male Golden Retriever! Even before we receive our own drinks, they've already brought him a refreshing bowl of iced water. This level of care and consideration for our furry companions is truly heartwarming and makes the idea of bringing him for a weekend lunch even more appealing.",
      "time": 1744201612,
      "translated": false
    },
    {
      "author_name": "fairil yeo",
      "author_url": "https://www.google.com/maps/contrib/117974678594803411120/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUMVF0JSAf1fc7HoM0c_2HLsOVb9AOsKxgzQCqCTO4J72x4LuE=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Overall: if you’re hankering for a good fish and chips that flaky inside, feels less oily but most importantly comes with and amazing crust - this is the place to go. Even their chips, thick cut or thin and their onion rings are awesome.\n\nWalk-ins are not easy, usually a wait time of about 15 to 20mins. So try and get in with reservations.\n\nTip: if it’s available, you should really get the scotch eggs. You’ll get a molten eggs with really amazing outer coating. Also, their scampi prawn and nuggets are also worth ordering to share.\n\nThe only slight downside is the seating, it’s pretty warm in the day so come in comfy clothing!",
      "time": 1744978301,
      "translated": false
    },
    {
      "author_name": "ZX Tan",
      "author_url": "https://www.google.com/maps/contrib/101490290461210565383/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKbY0bf6ukUlj6idx-5pgpAv5dRhb26BiAho_3w5-ZRT4HU1FI=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Great fish and chips, one of the best in Singapore with the right balance of fish meat and batter. Scotched eggs tasted good too but we liked the purple slaw which came with it even more. Seating is alfresco style, lots of people drinking beer too. Nice atmosphere overall.",
      "time": 1745754360,
      "translated": false
    },
    {
      "author_name": "Emersius Lau",
      "author_url": "https://www.google.com/maps/contrib/107623120949543889490/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVCD0uWIVUiROJjNEkUoiu5OR3QnXNSMIVEFgvZSlucLwatwx5m=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "One of the best places to go for fish and chips in my opinion. Love the mushy peas that come with them. Also liked the oyster and scampi nuggets very much - very well fried. However do not over order as it can get a bit too surfeiting. Coleslaw was fantastic to cut through the grease from fried food.",
      "time": 1744796474,
      "translated": false
    },
    {
      "author_name": "TL C",
      "author_url": "https://www.google.com/maps/contrib/104587586301089226461/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLVjMOkKgiNYa14kpTuq14afu0YNE83HO76LYpv4XwC2IRkIw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Been craving for an authentic British Fish and Chips for a while and finally made a visit to Lad & Co. Had 150g fish and chips to satisfy my craving. The crust on the fish was amazing; light and fluffy with flaky juicy meat. Exceeded my expectations. The chips were a regular well done chips. However I am missing the scraggly, partially soggy chips doused in vinegar and salt like in the UK. The mushy peas as well was not as mushy as those in the UK. It is an irony, that the poorly made sides is what a customer wishes for but realistically, not all Singaporeans would like appreciate this. Hope they can offer this type of lousy sides as specials sometimes (probably might even go viral too). I'm sure there is a small group of customer who appreciates the nostalgic sensory experience in an old British chippy.",
      "time": 1746235186,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15650228744834208568",
  "user_ratings_total": 485,
  "vicinity": "56 Tanglin Road, B1-02, Singapore"
}