{
  "formatted_address": "44 Bendemeer Rd, #01-1436, Singapore 330044",
  "geometry": {
    "location": {
      "lat": 1.3218041,
      "lng": 103.8664067
    },
    "viewport": {
      "northeast": {
        "lat": 1.323118980291502,
        "lng": 103.8678124302915
      },
      "southwest": {
        "lat": 1.320421019708498,
        "lng": 103.8651144697085
      }
    }
  },
  "name": "Lai Wah Restaurant",
  "place_id": "ChIJuZfHmdQZ2jEROUKKNzDb0ew",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Jack",
      "author_url": "https://www.google.com/maps/contrib/106288565584051666357/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWAz__X8LkfzCSM6CtMEV009262f_gpetU5m9GJjEGYH28gnOyv=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "Made our reservation online without much fuss. A shame that we got a table right next to the door and very warm throughout the entire dinner. Order was also made through mobile which is commendable for a restaurant that pride on traditional food.\n\n1. Things didn't get off to a good start with the signature platter being the fried items very oily.\n2. Didn't expect a dish like Garoupa fish in 2 styles in a traditional restaurant like Lai wah, but glad we ordered as it's really nice either way. Even the kids who don't usually take fish willingly obliged.\n3. Yam pot is delish with generous cashew nuts and prawns.\n4. Chinese spinach with 3 egg was rather lacking in the eggs and perhaps too watery.\n5. Roast duck with sweet sour sauce is pleasant surprise and has the crispiest skin I've ever had. Not too overwhelming with the sauce and the meat is tender.\n6. Sweet sour pork was fantastic and one of the best that I remember. Glad it came out from the kitchen of a Cantonese restaurant.\n7. Bee Hoon comes in a really large portion and small shd really suffice. It's tasty but also rather saltish at the same time.\n8. Venison hor fun also too big a portion, couldn't really taste much as every spoon is filled with just black bean sauce.",
      "time": 1746881522,
      "translated": false
    },
    {
      "author_name": "Julius Tan",
      "author_url": "https://www.google.com/maps/contrib/113038098593710664705/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIa8nSkRc5RidhEspn9h2QrKuK8W4W2TH2gqkElwTmk_-1ZCg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Old school Cantonese restaurant that has been around for decades, used to remember that they had old grumpy auntie waitresses. It’s more of a taste of nostalgia rather than the food being fantastic. The best dishes I had here were the stewed chicken and the golden dragon chicken, both were delicious and executed very well. Their fried dishes are usually quite good. But it is a little disappointing that some traditional Cantonese dish such as the pipa tofu and the steamed red grouper weren’t up to mark. The pipa tofu tastes bland and so did the accompanying gravy. I am not sure why they decided to toss fried shallots onto the Cantonese style steamed fish and the whole gravy reeked of shallots and the taste of the shallots overpowered the taste of the dish. One time we ordered the peanut cream and it came chao tar(burnt) but the restaurant waived it off. Still, a good place for a traditional Cantonese meal.",
      "time": 1742221363,
      "translated": false
    },
    {
      "author_name": "Hiang Ar",
      "author_url": "https://www.google.com/maps/contrib/101185220797498251612/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUA05b2dpLoNwt-jBfaQ_M3lhk3zmyIFiO4vtMThzlTzYvUGfcR=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "The food was excellent, particularly the pork chop, venison, spinach, and yam paste. The meats were tender and richly flavorful, while the yam paste had a distinct, aromatic fried onion flavor and wasn't overly sweet. However, the cleanliness of the restaurant was a concern. Before we even started our meal, we noticed dust and food remnants underneath the food rotator.",
      "time": 1731238682,
      "translated": false
    },
    {
      "author_name": "Clara Tey",
      "author_url": "https://www.google.com/maps/contrib/108210649079812913090/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUKGf985Z_xrL_pht2yCuF5Ix6ZaLEgKIYKNswr44r1nYq3o1nKQw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 2,
      "relative_time_description": "3 months ago",
      "text": "I was looking forward to the food but it was not as delicious as I thought. I felt thirsty after eating here. The portion served was not very generous either. Glutinous rice was too wet. Sad to say I will not return again.",
      "time": 1737863819,
      "translated": false
    },
    {
      "author_name": "Klint Thian",
      "author_url": "https://www.google.com/maps/contrib/103563586038157975960/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX3w8i3IBirDFz0fdMPtjPNiLEH9BtChC6rEi-guy9FnKWuLTQSVQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Had roast chicken, deep fried fish, asparagus with prawn and fried rice. As u can see, all plates is cleared. Food is old school but very yummy",
      "time": 1740659944,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17064661463220240953",
  "user_ratings_total": 645,
  "vicinity": "44 Bendemeer Road, #01-1436, Singapore"
}