{
  "formatted_address": "Laifaba, 02-02 Bukit Batok Cres, Prestige Centre, 71, Singapore 658071",
  "geometry": {
    "location": {
      "lat": 1.3383983,
      "lng": 103.7559432
    },
    "viewport": {
      "northeast": {
        "lat": 1.339857780291502,
        "lng": 103.7573519802915
      },
      "southwest": {
        "lat": 1.337159819708498,
        "lng": 103.7546540197085
      }
    }
  },
  "name": "Laifaba Authentic Wood-Fired Roast & Noodles",
  "place_id": "ChIJYyF0fNAZ2jERR4kjryo0H3Q",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Jen Chan",
      "author_url": "https://www.google.com/maps/contrib/116613161278680717890/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXSq893h-IpPU2m9mbz9zihQKx3SKUW3vGaDkjp9kTFqq6Sy3Zm=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "A pleasant surprise to be presented with two stalks of carnation for two mothers in our group plus a complimentary dessert.\n\nA little noisy combine with nostalgia. Great family makan place but booking is essential we waited for 45 min.\n\nMeat and soup and wanton is the best ever and the pork lard is heavenly. Highly recommended but parking can be an issue with limited parking.\n\nService staff is thoughtful and accommodating. Overall a nice joint that is becoming more popular. Photos similar to actual food served.",
      "time": 1746965602,
      "translated": false
    },
    {
      "author_name": "xinhui",
      "author_url": "https://www.google.com/maps/contrib/101363551580571496303/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXW8YOpTE8HVvAGbLKei-UXssui-174sL8Ps4W0_SnX_7WwwUW_=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "first time here, the food is delicious! the roast pork is perfectly caramelised and you can choose between lean/fatty/mixed. i enjoyed it even though i'm not usually a roast pork person. it also comes with soup which is refillable. the service is really good too :)\nthe only downside is that the drinks are a bit expensive ($5 teh beng 😭)",
      "time": 1747110322,
      "translated": false
    },
    {
      "author_name": "Garry Lew Your Estate Advisory Realtor",
      "author_url": "https://www.google.com/maps/contrib/105743413921995535737/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWb7179myGiSwhCqElVA2wkcfVkmxQNrBJF8iLwknDa4fbkC97bOA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Visited 08 March 2025 Sunny Saturday. The following sharing are based on our unbiased personal opinion and experience\n\nKnown there is this restaurant some time back but never had the opportunity to try it out. So today happened to be the stars align and here I am.\n\nArrive around 1230pm around lunch time and there were 06 groups in the queue ahead of me. Waited for a good 30mins before the table was ready.\n\nNostalgic decor with music from 80s/90s playing in the background. Service crew was efficient and attentive to your needs. Rather a homely and cosy place with less than 15 tables.\n\nSignature Noodles 招牌面 $12.80 before gst\n⭐ ⭐ ⭐ ⭐\nPick the half lean char siew part. Noodle was spring and cooked to the right texture. Char siew was fat proportion was just right. Dumpling was full and the onsen egg was almost perfect.\n\nI had a good time with my noodles today*\n\nFollow us for a gastronomic experience and discover the world finest in its purest form",
      "time": 1741410740,
      "translated": false
    },
    {
      "author_name": "klein ng",
      "author_url": "https://www.google.com/maps/contrib/103068541645823333604/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUzPBwU1JYOH9KzfmkUnBaaN2cbdc8aLoZ-SA7uoc5H19cSb0nzag=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "What I tried:\n\nMeat Platter with char siew and sio bak\n\nWhat I liked:\n\nThe serving plate was warm — a small touch that makes a big difference.\n\nThe meat was served warm too, not cold like some other places.\n\nI personally preferred the sio bak over the char siew. The skin was delightfully crispy, and the seasoning was just right — not too salty or overwhelmed by five-spice powder.\n\nThe place has a nice ans cosy atmosphere\n\nWhat I wished was better:\n\nIt would be great if they offered a char siew + sio bak noodle option.\n\nPrices are slightly on the higher side.\n\nWould be nice to have the option to choose a fattier cut for the meat platter.",
      "time": 1742725555,
      "translated": false
    },
    {
      "author_name": "Michelle Vass",
      "author_url": "https://www.google.com/maps/contrib/104797767043928260828/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWmo4vVXhHclmJ7fB0lq9DiEms3cxS3tQFgK8HU0W0yX5wclkx2=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "We are so happy we made the effort to take public transport from Chinatown (where our hotel is) to Bukit Batok to try them out when we saw Dr Leslie Tay's reviews. It was certainly not a wasted trip, and no wasted calories there!!  **RESERVATIONS HIGHLY RECOMMEND**\n\nWe ordered the signature noodles, the combination platter (char siew and crispy roast pork), and Tau Pok Meat Pockets. When you order the signature noodles, you can choose from lean/fatty/mixed char siew and we picked the mixed. However, in the platters, they will only offer a mix of lean/fatty. Either way, we were sooooo in love with the char siew. The cut of pork is BJT (bu jian tian), loosely translated to \"the part that's not exposed the sky\", i.e. the pits. They wood-roasted it to perfection - tender, juicy, tasty, with perfect amount of char. The noodles were springy, and the sauce was also very very yummy. I could easily wolf another bowl of noodles. You also get 2 pieces of fried wonton in the noodles, and 2 pieces of poached wontons in a bowl of scallop collagen broth that is delectable and refillable (not the usual clear tasteless broth served as a token of dried wonton noodles).  So don't go comparing the price of this bowl of noodles with your hawker centre ones. The quality of ingredients and the effort that goes into making them is just incomparable.\n\nThe crispy roast pork is like the name suggests - crispy. Not thick crunchy skin, but thin and crispy. The pork is also tender and juicy, no dried and tough bits. The taupok meat pockets also goes very well with its dipping sauce too!\n\nTheir service team is extremely attentive, cheerful and polite. I even witness one of them trying to stage the dishes prettily on the table for a group of ladies when they asked her to help them take a group pic! It just felt like they want your experience to be as memorable as possible.  Not to mention the nostalgic deco in the restaurant! I had the best lunch there despite the long trek to and fro. It was most definitely worth the trip!!",
      "time": 1745419784,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8367463990609283399",
  "user_ratings_total": 1244,
  "vicinity": "Laifaba, 02-02 Bukit Batok Crescent, Prestige Centre, 71"
}