{
  "formatted_address": "BLK 517 Jurong West Street 52, #01-81, Singapore 640517",
  "geometry": {
    "location": {
      "lat": 1.3453495,
      "lng": 103.71941
    },
    "viewport": {
      "northeast": {
        "lat": 1.346668530291502,
        "lng": 103.7208836802915
      },
      "southwest": {
        "lat": 1.343970569708498,
        "lng": 103.7181857197085
      }
    }
  },
  "name": "Lakeside Eatery",
  "place_id": "ChIJYc224NwP2jERbGWRSbHzftY",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "Thahsin Rumana",
      "author_url": "https://www.google.com/maps/contrib/111315041802575258660/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJN_upddxt956FVFCTnfaQ6zt668yABNN3XQSOxmAAAR_SDzA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Very delicious food catered by the lake side eatery. The flavours in the curry were perfectly balanced. The fried chicken was finely cooked with a crispy exterior and tender inside .Delivered on time and beautifully presented. Highly recommended 🤩",
      "time": 1744605059,
      "translated": false
    },
    {
      "author_name": "Rashidah Mohd Sadik",
      "author_url": "https://www.google.com/maps/contrib/101133812407902456116/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJlmFHy0jqXLutexmgF4bZqbzHZx6083rsd_SPLgsp1C3Oy8Q=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "4 weeks ago",
      "text": "I have been patronising your shop for the past year and truly enjoy your food, especially the prata — it’s consistently crispy and delicious. However, I would like to share some concerns regarding the service, which I hope you will take as constructive feedback to improve your operations.\n\nOver time, I’ve observed recurring issues with how food orders are taken and processed. It seems there is no clear system in place — sometimes the person taking orders is the one making tea, cooking, or manning the cashier. Orders are often passed through multiple people, leading to confusion and errors. I’ve personally experienced having to repeat my order multiple times, and I’ve seen the same happening to other customers.\n\nThis not only causes delays but also wastes your staff’s time and effort and frustration to customers. A simple solution could be implementing a basic ordering system — for example, labeling tables and having the order-taker write down the order along with the table number. The order slip can then go directly to the kitchen. When the food is ready, simply calling out the table number (since it’s self-service) will streamline the process and reduce confusion amongst customers. There are times where the food are just left there and no one call out the customers. By writting down the order, it also lessen the burden of the customers having to remember their own orders and having to list them down for the cashier to key into the cash register.\n\nAnother point of concern is consistency in food preparation. Specifically, your mee goreng varies quite a lot — sometimes it’s not spicy at all, and other times it’s extremely spicy and impossible to eat. Please consider maintaining a standard spice level or offering options for different spice preferences.\n\nI’d also like to highlight an incident that left a negative impression. One afternoon, this was sometime late last year (between 3–4 PM), I ordered prata and noticed a Chinese lady sitting nearby looking upset. When I spoke to her if she has been waiting for her food, she told me she had ordered prata but was told it wasn’t available, and was asked to choose from the displayed dishes instead. She was disappointed, especially when she saw prata being served to my table. I offered to help her reorder, but she declined. It was an awkward and unpleasant experience for both her and us.\n\nLastly, I’ve noticed that your staff often shout across the shop — sometimes joking, sometimes arguing about orders. This creates a chaotic atmosphere and affects the dining experience. A more calm and professional environment would certainly be appreciated by your regular customers.\n\nI hope you take this feedback in the right spirit, as I truly appreciate your food and want to continue supporting your business. I believe that with some simple improvements, your service can match the high standard of your food.",
      "time": 1745331099,
      "translated": false
    },
    {
      "author_name": "lontongstroong",
      "author_url": "https://www.google.com/maps/contrib/112708452931686187176/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIGL4TilfhYmnv66DwIz3eDOGEeLdHIAXoJyV4pmEI2w1bf6Q=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "Neighborhood mamak shop that is popular among the locals in Jurong Lake and Jurong Spring areas, regardless of ethnicities. Tend to be pretty crowded during breakfast time. The shop is run by a funny uncle who often jokingly multiplies the price of the dishes by a factor of 1000 (lol).\n\nIt has an extensive menu, ranging from standard Tamil trade like dosa, sambar, roti paratha, fried briyani, Chicken 65, and poriyal, to Malay gravy (gulai), nasi goreng, maggi noodle, and cakes (kuih). The price tend to be fair and of standard mamak shop. The dishes taste alright, but does the job done.",
      "time": 1693656351,
      "translated": false
    },
    {
      "author_name": "Shir YH",
      "author_url": "https://www.google.com/maps/contrib/117043071908719855487/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocItAkNFH8FzORaaBReGMyQaJt6Tn9Ejuy_5E9odv8xkjwgAvFLF=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "11 months ago",
      "text": "Tucked in a corner just opposite of Jurong West HDB branch office and I was wondering if they accept cash.\nIf so I will be in big trouble.\nFortunately in this air conditioned eatery they had the QR code so I was relieved.\n\nOrdered kosong & bawang prata with fish curry and a teh panas. I also bought a packet of crackers. Total cost was $5.70.\nIt was freshly made and it is yummy!\nCould not capture pics of  prata as I was really hungry!\n\nI guess I will not frequent this eatery since I was at branch office for an appt.\nIf I do, will definitely swing by here again for sure.",
      "time": 1719272000,
      "translated": false
    },
    {
      "author_name": "Anthony",
      "author_url": "https://www.google.com/maps/contrib/116725963171108596037/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK6z8O0rgoXQx-cfcg2ThB-9DhKaZ0BI_c55TwCHao76FgK0Ktf=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "(Beware that the fried rice (or nasi goreng) by default would be spicy)\n\nI like the mutton coin prata here. The plain coin prata also tastes good, it is like a smaller but more crispier prata with caramel (from sugar).",
      "time": 1680609150,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15456058913951147372",
  "user_ratings_total": 55,
  "vicinity": "BLK 517 Jurong West Street 52, #01-81"
}