{
  "formatted_address": "99 Irrawaddy Rd, Level 33 Courtyard Marriott Singapore, Singapore 329568",
  "geometry": {
    "location": {
      "lat": 1.3205847,
      "lng": 103.843232
    },
    "viewport": {
      "northeast": {
        "lat": 1.322035880291502,
        "lng": 103.8445444802915
      },
      "southwest": {
        "lat": 1.319337919708498,
        "lng": 103.8418465197085
      }
    }
  },
  "name": "Las Palmas Rooftop Bar",
  "place_id": "ChIJ7z1PPucZ2jERgUCfk4GTEHg",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Kirthi Kashini276",
      "author_url": "https://www.google.com/maps/contrib/104956012386968367657/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLitTbyBideGLTs7Dg75qh2BKOOLvWn3ro3HoW_6ux6KhDoEQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "A Must-Visit Bar with Exceptional Cocktails!\n\nI had an amazing experience at Las Palmas Bar, and a huge part of that was thanks to Karenthyna, the incredibly talented bartender. She didn’t just serve drinks—she crafted her own signature cocktails, each one more delicious and addictive than the last. You can tell she has a deep knowledge of mixology, as she explained every ingredient and technique with passion.\n\nThe atmosphere at Las Palmas is vibrant yet cozy, making it the perfect spot for a night out. But what truly sets it apart is the top-notch service and the creativity behind the bar. If you’re looking for a place with unique, expertly made cocktails and a bartender who knows her craft inside out, Karenthyna is the one to look for!\n\nI’ll definitely be coming back for more! Highly recommend!\n\n-Victoria ♥️♥️♥️",
      "time": 1743325868,
      "translated": false
    },
    {
      "author_name": "amanda yung",
      "author_url": "https://www.google.com/maps/contrib/100943485666222641813/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIyXkRxajHqWFs8cT4IPDkf3XZTB_EQBGiKsqKobB_yABDxyQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "The view, atmosphere, drinks and service especially were top-notched. The staff there were all professional yet accommodating and friendly.\nKaren the bartender is extremely skilled and knowledgeable in crafting out the perfect drinks.\nSpecial mention to Ron, Sean and staff!\nMy most recommended place to go for special occasions or even just for a quick drink whilst enjoying the sunset or the late night view.\nDefinitely will be back 🤭\n\nHowever as a vegetarian, it would’ve been more perfect if there were more vegetarian options that’s available.",
      "time": 1739864596,
      "translated": false
    },
    {
      "author_name": "Michael Wu PhD",
      "author_url": "https://www.google.com/maps/contrib/105061099394492403376/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXwdq0XBvy8sPQixE2K7PpSonX2HLNjOsKMAc_dLZVp26zMsnbtIA=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "the pool is not big, but the restaurant and bar area are very nice. If you stay at the hotel you can use the pool and the cabana, otherwise you will have to spend a minimum of 300. The food was ok, but the drinks and the view are great.",
      "time": 1742095827,
      "translated": false
    },
    {
      "author_name": "Kean // keanmono IG & TT",
      "author_url": "https://www.google.com/maps/contrib/110201119911939984946/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXFZjhombxKzkjBCcVYmX8mjPD_YJ-kQxmy4IQzinQiRosbMgKqVA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Chill out at one of the best rooftop bars with an amazing panoramic sunset view of Singapore's cityscape!\n\nAs part of Las Palmas 2nd Anniversary, we were treated to a Magic After Dark party where it was an evening of fun, spectacular drinks and delectable bites.\n\nReally loved the limited edition Tropical Spell cocktail which comes in a pretty bronze cup in the shape of a pineapple and you can even bring it home! Taste features dark rum and other tropical flavours fit for a refreshing drink by the infinity pool.\n\nDuring the party, we took part in an engaging hands-on Cocktail Masterclass and a DIY Gin and Tonics selection, learning about the different spirits and of course enjoying the drinks! These delightful activities can also be arranged for private events.\n\nIt was a totally wonderful experience at Las Palmas and you have to gather some friends to come enjoy the awesome vibes, sip stunning cocktails while soaking in the beautiful sunset view!",
      "time": 1737000806,
      "translated": false
    },
    {
      "author_name": "Kate Pal",
      "author_url": "https://www.google.com/maps/contrib/109614878444857265377/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWqIABqelegK2L2md6598jU0BBfrDdi0lYm3SJpO8fH9Z1SoyFv=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Las Palmas Rooftop Bar – A Stunning Sky-High Experience in Singapore!\n\nLas Palmas Rooftop Bar is an absolute gem in Singapore! From the moment we arrived, we were captivated by the breathtaking panoramic views of the city skyline. The ambiance was chic, vibrant, and relaxing, making it the perfect spot to unwind after a long day.\n\nThe cocktails were expertly crafted, and the menu offered a great selection of drinks and bites that perfectly complemented the stunning setting. The service was top-notch, with the staff being attentive and knowledgeable about recommendations.\n\nWhat made the experience even more special was the laid-back yet sophisticated vibe, making it an ideal place for a date night, casual hangout, or even a solo retreat to enjoy the view. If you’re looking for a great rooftop bar experience in Singapore, Las Palmas is definitely a must-visit! I’ll be back for sure!",
      "time": 1741511767,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8651577068915474561",
  "user_ratings_total": 293,
  "vicinity": "99 Irrawaddy Road, Level 33 Courtyard Marriott Singapore"
}