{
  "formatted_address": "10 Bayfront Avenue, Marina Bay Sands, Hotel, Level 57 Tower 1, Singapore 018956",
  "geometry": {
    "location": {
      "lat": 1.2824615,
      "lng": 103.8600908
    },
    "viewport": {
      "northeast": {
        "lat": 1.283726830291502,
        "lng": 103.8613707302915
      },
      "southwest": {
        "lat": 1.281028869708498,
        "lng": 103.8586727697085
      }
    }
  },
  "name": "LAVO Italian Restaurant And Rooftop Bar",
  "place_id": "ChIJsRrnPwQZ2jERmUK_SYyLwTs",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "PINAR T.",
      "author_url": "https://www.google.com/maps/contrib/113897231333933061971/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU9fs9n5L0nqCrOSPy7sOstyRXxv8KwFRc30ir3bfIT9pZ8YpjA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "We visited this restaurant with a reservation during our short stop in Singapore between two flights. After exploring the city, we wanted to enjoy a nice meal and take in the view from here — and it turned out to be a great choice! Everything went smoothly from the moment we entered. Due to the heat, we chose to sit inside, but we still managed to take some great photos of the view outside. The layout and atmosphere of the restaurant make it perfect for tourists like us, and we saw quite a few others there too.\n\nThe food, service, and overall ambiance were excellent. We ended up ordering more drinks and dishes just because the atmosphere was so pleasant. One of the most memorable touches was when they brought out a dessert for our wedding anniversary — such a thoughtful gesture! We had originally planned to grab coffee elsewhere, but thanks to their kindness, we happily stayed and had our coffee there too.\n\nIf you’re a tourist with limited time and want to enjoy both a great meal and a beautiful view, this place is definitely worth a visit. I truly hope they maintain this high standard — we’ll be sure to return on our next visit!",
      "time": 1746258955,
      "translated": false
    },
    {
      "author_name": "Aries Dee",
      "author_url": "https://www.google.com/maps/contrib/115020628844244733972/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVH_WJQSvQ_3lHim51JX364YapOSJkVhk3RcqQbtef8wsk7Mo1_=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "I had a truly memorable dining experience at LAVO Italian Restaurant, thanks in large part to the outstanding service provided by Rani and Esther. From the moment we arrived, they welcomed us warmly and made sure every detail of our meal was perfect.\n\nRani was incredibly attentive, knowledgeable, and gracious—always ensuring our glasses were full and that we had everything we needed without ever being intrusive. Esther complemented this with her warm demeanor and efficient service, making us feel well taken care of throughout the evening.\n\nThe food, as always, was top-notch—beautifully presented and rich in flavor. But it was the personalized and genuine hospitality from Rani and Esther that truly elevated the experience. Their professionalism and heartfelt service made our visit not just a dinner, but a delightful occasion to remember.\n\nHighly recommended for anyone looking for great food paired with exceptional service!",
      "time": 1746584788,
      "translated": false
    },
    {
      "author_name": "William Lim",
      "author_url": "https://www.google.com/maps/contrib/115111836329685242741/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWJzbL298O85VK-inWDmeWlkR7ljbdmB11uH7aADLbggJyvCTX-yg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Service was top notch, we were greeted once I stepped in and confirmed my reservation. Although I was 30 minutes early the service crew was very accommodating and professional. We were escorted to our preferred sitting and also our server Cecilia was courteous enough to suggest proper portions for our company's capacity. She knows what serves for how many very well. I also enjoyed the sunset, Spectra water and light show and the night city skyline view from up top. The ambience is amazing for the most part. Be wary of noisy kids running around at times though. Will definitely visit again soon. Oh ya on a side note, the food is catered mainly for western food palates. Lots of cheese, pasta,  pizza and alcoholic beverages.",
      "time": 1744953825,
      "translated": false
    },
    {
      "author_name": "Domi Mayoral",
      "author_url": "https://www.google.com/maps/contrib/103571566741886488225/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKJ7k5wtl1HPcQRBua13dz_KO5iOtnlwn17SCkrXsHKa51ZrQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Came here for my birthday dinner and it was lovely! Amazing views all around outdoor seating area. Food was delicious and portion sizes are good. The staff were very attentive kind. At first we felt a bit rushed to order but after explaining we wanted some time to have a couple of drinks and enjoy the views, they gave us some space. As a standard you have 2 hours but they were accommodating when we said we’d like to stay longer. Make sure to book your visit though as it gets very busy. A great way to visit and experience the hotel if you’re not staying there!",
      "time": 1743721354,
      "translated": false
    },
    {
      "author_name": "House Jerrine",
      "author_url": "https://www.google.com/maps/contrib/106256921618768730940/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL1lnW01w_1kCDu2Twh_Rbqmk1YtaR0qSsLa6AolORDn4I13zs=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "I loved the service and scenery 👍.\n\nOutdoor seating, which near the glass (where it is nearer to the restaurant), can be quite warm if there is no wind and after some alcohol.\n\nOrdered Chicken Parmigiano, LAVO Meatball, Scallops alla Livornese and pair with Menabrea Draught it's pretty decent dinner.\n\nThe direction to the washroom is right at the entrance. Will see the sign easily but need to take note if there's elderly/ young children as have some steps to walk down.\n\nReservation is preferable if you mind waiting.",
      "time": 1745299578,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4305876153391858329",
  "user_ratings_total": 5350,
  "vicinity": "10 Bayfront Avenue, Marina Bay Sands, Hotel, Level 57 Tower 1"
}