{
  "formatted_address": "333A Orchard Rd, #04 - 01 / 31, Singapore 238897",
  "geometry": {
    "location": {
      "lat": 1.3018632,
      "lng": 103.8369979
    },
    "viewport": {
      "northeast": {
        "lat": 1.303330080291502,
        "lng": 103.8383898302915
      },
      "southwest": {
        "lat": 1.300632119708498,
        "lng": 103.8356918697085
      }
    }
  },
  "name": "Lawry's The Prime Rib Singapore",
  "place_id": "ChIJnwvSIJIZ2jERpSK-8lcGiPk",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Beary Beary",
      "author_url": "https://www.google.com/maps/contrib/101788329090998743221/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI4c2NSXCVpPqWeJNO4XiwiWBvnhqSIFx7cGpITOjTupBTZ3A=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "A Great Place for Prime Rib\n\nHad dinner on a weekday evening. They were efficient and prompt in showing us to the best seats in the restaurant.\n\nThe place is has a lavish English feel to it. Chandeliers, red chairs and a wooden floor gave it that feel. On a weekday evening, this place appeared half-filled was quiet and pleasant.\n\nAccompanying the beautiful decor were efficient and very pleasant service staff who were eager to endure our experience there was one to remember. They helped us take photos and patiently advised on our queries from the menu.\n\nThe beef was of superb quality and was extremely well prepared. Top compliments to the chef ! Both medium-rare and medium-well were done to perfection. This was accompanied by a salad, bread and butter, meat sauce and a Yorkshire pudding. A perfect combination.\n\nA top place for prime rib with top decor. A great place for that special occasion.",
      "time": 1742491989,
      "translated": false
    },
    {
      "author_name": "Kian Huang Lim",
      "author_url": "https://www.google.com/maps/contrib/102588145922998581626/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW_-SU0C6sLYB2OfMjmcc7Su_AD5ODFnt7nMaf6cipOoSJ9gI18=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Visited Leary’s The Prime Rib, and I have to say the service and atmosphere were absolutely exceptional. From the moment we walked in, the staff made us feel right at home with their warm and attentive hospitality. The ambiance of the restaurant was classic and elegant, perfect for a relaxed yet upscale dining experience.\n\nThe spinning salad on ice not bad\n\nFor the meal, I started with the mushroom soup and the baby back pork ribs, which were delicious! Tender, flavorful, and cooked to perfection – a definite highlight of the evening. However, I was a bit underwhelmed by the signature Lawry’s Cut Prime. While it was good, I was expecting a bit more flavor and tenderness, especially given the restaurant’s reputation. It didn’t quite live up to the hype, but overall, the meal was still enjoyable.\n\nIf you're looking for top-notch service and a great atmosphere, Lawry’s is definitely worth a visit.",
      "time": 1738842618,
      "translated": false
    },
    {
      "author_name": "Wee Kiat Chua",
      "author_url": "https://www.google.com/maps/contrib/104649633100473810589/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ1wulMIKDWQDIrdBSa5U7NAqhc6vxIn02x2Uhuo7zu0CSH3w=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "Brought my wife to Lawry’s for her birthday, and also our first time having prime rib in Singapore. It is dissapointing to say that the food doesn’t live up to the 4.4 stars review in google.\n\nSalad - the vegetables dont look fresh at all. Taste is mediocre to me but wife likes the dressing\nOyster - fresh, good size but lack of taste.\nBun rolls - mediocre\nPrime rib - the biggest dissapointment to me. Both of us had prime rib for medium rare but somehow it is overcooked. Wife had hers changed but i kept mine. The texture is so chewy AND dry, au jus is bland and tasteless. Most of the part has no taste (I couldnt believe it when i read some comments prior to the lunch). Theres nothing good from this prime rib.\n\nHonestly, such food quality and price, I wonder how they could survive the business and retain customer in Orchard Singapore. There are only 4 tables (2 customer each) throughout the whole lunch and I finally understood why after tasting the prime rib.\n\nThe only good thing I would comment on was the waitress Jazz, her warmth welcome and hospitality is the only reason i gave additional star. Unfortunately im never coming back for the food anymore.",
      "time": 1744131847,
      "translated": false
    },
    {
      "author_name": "CW K",
      "author_url": "https://www.google.com/maps/contrib/113964909672435499888/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUeBDSP2pPSbIhoE_WsxRQPdxi2uOQhORboL1U0LBVcAiKLouQD2g=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "The ambience and staff are very friendly. The roast beef is well cooked to the correct doneness. There’s a promotion for birthday celebrations where the third person dines free. They will give the person a free cake and sing a song for him/her. We had a great time enjoying the view of Orchard Road and the food. The prices are on the higher sides. We spent $700 for 4 pax.",
      "time": 1746442224,
      "translated": false
    },
    {
      "author_name": "Ariza Zainudin",
      "author_url": "https://www.google.com/maps/contrib/108078378942387161073/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWtSP3EJZqvi-ZDDTX8D7Djm3KrCVBJV4iWCPOfCTaGPQmrCeM=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Dropped by with my family coz they were raving about it. We now understand why:\n\n1. The food were all delicious. Had the steak (was tender), the mussels and garlic bread was a superb combo, the mashed potatoes and cream of corn was lovely. Their dessertsssssssss was soooo exceptionally delicious. The brownies is a MUST try.\n2. The manager, Imran was very welcoming and went out of his way asking if everything was okay. So friendly, hospitable and knowledgable on the food.\n3. Ambience was very cozy. Clean and worthy of 5 stars.\n\nAll in all, a must visit for those who want halal beef!",
      "time": 1746684575,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17980628487081173669",
  "user_ratings_total": 1528,
  "vicinity": "333A Orchard Road, #04 - 01 / 31"
}