{
  "formatted_address": "151 Upper Paya Lebar Rd, Singapore 534851",
  "geometry": {
    "location": {
      "lat": 1.339333,
      "lng": 103.885792
    },
    "viewport": {
      "northeast": {
        "lat": 1.340704130291502,
        "lng": 103.8871658802915
      },
      "southwest": {
        "lat": 1.338006169708498,
        "lng": 103.8844679197085
      }
    }
  },
  "name": "Le Café Vie5",
  "place_id": "ChIJ095LLa0X2jERHunPZRETlMY",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "kar fuen",
      "author_url": "https://www.google.com/maps/contrib/100752167703559426034/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJPZdAqVHj3lr-Mi0aRnSJZVPcT0ddLYdafe2k6_H08jcmVLw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Favourite cafe since we moved into the Bidadari estate, they serve good coffee and we love their coconut coffee shake, food also good from banh mi, pho to their must try prawn noddle.. was blown away by the prawn noodle the soup was clear and generous with the prawns (2 big tiger prawns and some small springy prawns). Fresh spring roll is pricer at 8.90 but is fresh and one of the best in Singapore coz other places the spring roll skin is tough. No GST only 6% service. Join free membership for points system to offset. Cafe has a nice rustic cosy vibe and decoration. Nice place to chill with aircon.",
      "time": 1745143232,
      "translated": false
    },
    {
      "author_name": "Kimberly Chew",
      "author_url": "https://www.google.com/maps/contrib/101479522983369779631/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWKj1NsCCpDvGR2nBg1BiAohhLSm8pOkL_i_PYIuBMWRfZhe2Zb=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "This was our first time visiting a northern Vietnamese cafe and never expected that it was such a hidden charms thats makes us enjoyed our meals so much!\n\nThe ambiance is great with music and the atmosphere is very comfortable, we were also amazed by their wide selection of food & beverages and their dessert display.\n\nWe took quite some time to decide what we want and got;\n\nDrinks;\n🍹Street Style Tea (TRÀ VỈA HÈ) - love this tea without any sugars, very refreshing.\n🥤Chocolate Milk Shake - Chocolatey taste with milk\n\nMain;\n🍜 Grilled Pork Noodles. - The noodles is rice noodles, definitely must dip with their specialty sauce which makes a good combination of sour and spicy, their grilled pork is well seasoned.\n🍲 Braised Pork Rice - this is new in menu and their pork is tender and flavourful, my girl enjoyed it!\n\nDessert;\n🍰 Pistachios Cheese Cake - have been a fans of Pistachios and could not resist of this when i saw one on the display, luckily for this, not super sweet, matches with the cheese.\n🧇 Mochi Waffles with Mango Passionfruit Sorbet - the waffles is freshly made and combination of sweet and sour ends the day.\n\nIf you are nearby or simple looking for Vietnamese cafe, this cafe is definitely worth a visit, we had such a wonderful experience here!",
      "time": 1743999612,
      "translated": false
    },
    {
      "author_name": "MITHILESH MISHRA",
      "author_url": "https://www.google.com/maps/contrib/117882085291937325018/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVm3PwucSlchxca4eVHMZ5YVBRZW_RWKzdN6TaPTK3ueCCLMEF97A=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "A Cozy Corner and a Delightful Duo: My Visit to Le Cafe Vie5\nStepping into cafe felt like a welcome escape from the city bustle. The décor was rustic and warm creating a relaxed and inviting, chic and sophisticated, fun and energetic.\n\nThe Signature Latte arrived first, presented beautifully in a handle less cup. The latte was rich and robust, with a noticeable unique flavor notes\nThe milk was perfectly steamed, creating a velvety smooth texture that coated my palate. It wasn't overly sweet, allowing the quality of the coffee to truly shine. This was a latte crafted with care and attention to detail, and it definitely lived up to its \"signature\" status.\n\nShortly after, the Waffle with vanilla graced my table. The waffle was a golden-brown masterpiece, boasting a delightful crisp exterior that gave way to a light and fluffy interior. It was generously dusted with powdered sugar, adding a touch of sweetness without being overwhelming. The scoop of vanilla ice cream perched atop was creamy and of good quality, melting slightly into the warm waffle and creating a delightful contrast in temperature and texture.\nThe combination of the warm, slightly chewy waffle and the cool, smooth vanilla ice cream was simply classic and executed perfectly. The waffle itself had a lovely buttery flavor, and the vanilla ice cream wasn't overly artificial, allowing its natural sweetness to complement the waffle beautifully. It wasn't a complicated dish, but it was undeniably satisfying and a perfect accompaniment to the rich latte.\nThe service at was also noteworthy. The staff were friendly always ready with a smile and ensuring I had everything I needed without being intrusive.\nOverall, my experience at Le Cafe Vie5 was thoroughly enjoyable.",
      "time": 1743250939,
      "translated": false
    },
    {
      "author_name": "Tim Wee",
      "author_url": "https://www.google.com/maps/contrib/102658873358579406822/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXAZtWZXuejdhBvqhinXDY50D2XtY78yiuw1dbaLJ2IQJNU4cVG=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "We spotted this cafe while buying sourdough breads nearby. Had a light lunch there as we’re fans of Ban Mi. Ordered the grilled pork ban mi & fresh spring rolls. Very tasty & well presented Vietnamese dishes. Both dishes were small on portion size but big on quality ingredients. Will definitely visit again to try their other dishes & also their coffees.",
      "time": 1741679935,
      "translated": false
    },
    {
      "author_name": "Oktaviani Fen Fen",
      "author_url": "https://www.google.com/maps/contrib/113027020288912250854/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV6ea_faDAmZVfImz6-Ip-bS1sUDM2PIx49FYKVFuCxGSI55TkqSA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Le Cafe Vie5 was such a pleasant surprise! I didn’t have high expectations at first, but the food completely won me over—authentic, flavorful, and so affordable. Their dishes are inspired by Northern Vietnam (Hải Phòng & Hà Nội) and taste just like home-cooked meals—fresh, light, and absolutely delicious.\n\nFrom appetizer to dessert, everything we had was so, so good!\nThis place is definitely a must-visit for authentic Northern Vietnamese food and coffee lovers! Can’t wait to be back! 🇻🇳💛",
      "time": 1743225763,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14309082881506404638",
  "user_ratings_total": 407,
  "vicinity": "151 Upper Paya Lebar Road"
}