{
  "formatted_address": "673 Bukit Timah Rd, Hall D Hwa Chong Institution Boarding School, Singapore 269735",
  "geometry": {
    "location": {
      "lat": 1.3249853,
      "lng": 103.7997397
    },
    "viewport": {
      "northeast": {
        "lat": 1.326314330291502,
        "lng": 103.8010312802915
      },
      "southwest": {
        "lat": 1.323616369708498,
        "lng": 103.7983333197085
      }
    }
  },
  "name": "Learning Vision Hwa Chong Institution",
  "place_id": "ChIJ-b9b7goa2jERaNDixhYc6Qw",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Kwok Jayne",
      "author_url": "https://www.google.com/maps/contrib/106529026025380163083/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKj0-vU9HFjuyHVRAwkUeu1WWxwECyLZVnPFEZkxfde0Vj5GA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "What makes it safer and comforting in mind to know that your child is in a safe, friendly, welcoming and loving environment.\nStaff greets children by name (which is amazingly they can remember all of them)\nPrincipal Joen and Teacher Hani never fails to check on my children when they are away from school.\nWhat is pleasing to know is that in this difficult time, school never fails to update parents promptly on the situation at school.\nAdmin Ros is always prompt in updating parents and keeping us reminder of school administrations.\nI look forward to every event that school celebrates, they always beautifully display children’s work and culturally items in an engaging and interactive way.\nI love the curated junior athlete and junior reporter program. 👍🏻\nMy child always sing along to the song and requests to find the piece of song teacher plays in school.\nHighly recommended, regardless of curriculum or a safe school to have your child in.\nKudos and thumbs up to every staff in LV@HC 💪\nThank you for your hardwork!",
      "time": 1647856696,
      "translated": false
    },
    {
      "author_name": "Amanda Goh",
      "author_url": "https://www.google.com/maps/contrib/110466022606025812133/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVURk-RF6O3j0CAHUbXPSU2HRM-mWHlRIJtmiptbMcpeeSG5WGV=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "The staff at LV@Hwa Chong are amazing! They are very friendly & supportive. My son had a rough start for the first few days in playgroup but the teachers & vice principal there were very patient and he grew close to them quickly. It is very comforting to know my child is in good hands. Their curriculum also have a good blend of activities and my son enjoy himself in school a lot.",
      "time": 1647501552,
      "translated": false
    },
    {
      "author_name": "Lim Yong Ping",
      "author_url": "https://www.google.com/maps/contrib/106465564896286607784/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKkK3aiEQcsciseMn-G9c0b9uIekY6nAOp_G5FWAPLpHQu6Sw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Our experience with Learning Vision has been nothing short of awesome. Our son started with their toddler care when he was 17 months old and has started K1 this year. The teachers (including even the non teaching staff) are attentive and caring, with great emphasis on hygiene and quality of meals. The curriculum is comprehensive as we noted our son is developing well in early literacy, bilingualism and mathematics. He absolutely loves going to school, meeting his teachers and friends. This is indeed a great pre school to put your child in.",
      "time": 1647605527,
      "translated": false
    },
    {
      "author_name": "Dawn Yin",
      "author_url": "https://www.google.com/maps/contrib/107110387779111927636/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUoGCI82dK6la5FXStEar65Zj4w64oQGPizJ88UK278OOpVCFkpVA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Lovely staff and teachers in this center. All childcare centers have been hard hit by the pandemic, and everyone at LV@HC has always remained cheerful, positive and warm. My children are thriving under the teachers' care, and I appreciate how patient and loving they all are. Any center can offer a myriad of programmes and curriculum, but it's the people that make all the difference. Those at LV@HC definitely do.",
      "time": 1647495300,
      "translated": false
    },
    {
      "author_name": "Farhani Rosli",
      "author_url": "https://www.google.com/maps/contrib/108593963306385519851/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWl9FPoYyYZcF-2oe_FaH0BOir6ZOfnnaexClSD_yvNe-hQm0M=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "I love the curriculum at Learning Vision!\nIt meets the different learning needs of my children.\n\nBut nothing beats the lively environment that the teachers provide my children with!\nThey are always very nurturing, patient and passionate. There is nothing more satisfying for parents than knowing that their children are in good hands.\nThank you for caring and educating my children!",
      "time": 1647526811,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=930305682180329576",
  "user_ratings_total": 14,
  "vicinity": "673 Bukit Timah Road, Hall D Hwa Chong Institution Boarding School"
}