{
  "formatted_address": "Margoliouth Rd, Singapore 258541",
  "geometry": {
    "location": {
      "lat": 1.3199954,
      "lng": 103.8243022
    },
    "viewport": {
      "northeast": {
        "lat": 1.321217630291502,
        "lng": 103.8256250302915
      },
      "southwest": {
        "lat": 1.318519669708498,
        "lng": 103.8229270697085
      }
    }
  },
  "name": "Lee Piano and Violin Music Studio",
  "place_id": "ChIJzZY5hd0Z2jERRNEUOpPsTZI",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Anna",
      "author_url": "https://www.google.com/maps/contrib/111691926544840166092/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLA_dFyjki0DKQ8uRhqPVLO8m9vJvBBUpR0gSYml5w_IHYdPg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "We started our son on the preschooler program at Lee Piano and Violin Music Studio in July, when he was 2 years and 10 months old, to introduce him to music beyond what he experiences in school. After four months of weekly lessons with Ms. Mary, we’ve seen remarkable growth in his love for and engagement with music.\n\nRecently, his school evaluation highlighted significant progress in his “Artistic and Creative Expressions,” particularly in music. His teachers noted that he actively explores musical instruments, responds well to different tempos, and shows a keen interest in singing. At home, we’ve noticed him humming nursery rhymes or breaking into song spontaneously, often swaying or dancing to the music he hears.\n\nWhile he does attend music sessions at school, we strongly believe that the additional weekend lessons with Ms. Mary have sparked his curiosity and accelerated his passion for music. Ms. Mary’s patient and creative teaching style makes all the difference. She introduces fresh ideas to every lesson, such as tying in relevant storybooks with the week’s activities, creating a multi-sensory learning experience.\n\nWe highly recommend Lee Piano and Violin Music Studio to parents looking to nurture their child’s interest in music. Ms. Mary’s dedication and innovative approach truly set her apart, and our son absolutely looks forward to her lessons every week!",
      "time": 1732456520,
      "translated": false
    },
    {
      "author_name": "Jasmine Ong",
      "author_url": "https://www.google.com/maps/contrib/111836779227014917485/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKYoJRt3Z-JpH6vkOTJ3hHbHbXIH-CNGbS5mP5xv3fU8pS4Sg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Finding the right piano teacher for my daughter was incredibly important to me, and I feel fortunate to have found Ms Annette. Her patience, encouragement, and attention to detail have made piano lessons valuable and rewarding for my girl. Ms Annette has a wonderful way of connecting with children and fostering a genuine love for music. I have seen remarkable progress in both my girl’s skill and confidence since she started lessons, and she now even initiates practicing on her own without any prompting from me. Thank you Ms Annette for being the most nurturing and effective piano teacher!",
      "time": 1724857970,
      "translated": false
    },
    {
      "author_name": "Grace",
      "author_url": "https://www.google.com/maps/contrib/114040286925077046236/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK3WB5mbYLadl_OUT_S1F3pOOOk-QJJM-ewNADfB8HC0GqXog=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "My daughter started the Preschooler Musician class before she turned 3. She has learnt so much since she started 6 months ago. Ms Marie and Ms Annette have introduced and explained music theory concepts to the young children in a manner that they can easily relate to by using different toys and props. The lessons are lots of fun and very engaging while still focused on teaching the fundamentals. We’re so glad to have found this class through another friend’s recommendation. We’d highly recommend this class for children!",
      "time": 1726382113,
      "translated": false
    },
    {
      "author_name": "Shu-En Lim",
      "author_url": "https://www.google.com/maps/contrib/111461345480131581978/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWAE9yyVX4M3c3DvZCntdEJxDKyEFpgYrVrcrMoJMNNqTqMDL-q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "We've been with Ms. Annette for about a year learning violin using the Suzuki method. Ms. Annette, is patient and engaging and modifies her teaching techniques based on the child and current level of progress. She modifies each lesson based on what the current difficulties are, for example, working on beat and rhythm, or bow hold/technique, and evening exercising listening skills. Each lesson changes based on challenges that we face in each new song. My daughter's progress has been significant over the past year; most importantly Ms. Annette nurtures the love of music, and learning the violin is an extremely enjoyable process for my daughter.",
      "time": 1691212544,
      "translated": false
    },
    {
      "author_name": "em :D",
      "author_url": "https://www.google.com/maps/contrib/115313081836067553952/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU9oMClwt49gU0j0LD2VdA7edGcj2bLuksaSWLl1yzfAgoWjisB=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Learning under Aunty Mary really has been such an enjoyable experience. Having been under her tutelage for about 7 years, she has helped me tremendously in shaping my growth both as a person and in my musical journey. With an insurmountable amount of patience, I really do feel that piano lessons with her have helped so much in my development. She has been so detailed and meticulous is catering to the needs of her students, and I would highly recommend her to anyone and everyone who wishes to start their own musical journey, whether it be piano or violin lessons!",
      "time": 1689950138,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10542342419822989636",
  "user_ratings_total": 13,
  "vicinity": "Margoliouth Road"
}