{
  "formatted_address": "30 Victoria St, #01-24 CHIJMES, Singapore 187996",
  "geometry": {
    "location": {
      "lat": 1.2953183,
      "lng": 103.8523584
    },
    "viewport": {
      "northeast": {
        "lat": 1.296834180291502,
        "lng": 103.8535869802915
      },
      "southwest": {
        "lat": 1.294136219708498,
        "lng": 103.8508890197085
      }
    }
  },
  "name": "Lei Garden Restaurant (Chijmes)",
  "place_id": "ChIJNfw8b6QZ2jERDj-WK2kAsPw",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Ribeye",
      "author_url": "https://www.google.com/maps/contrib/108129213100021627372/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVjsX2wodqm6tcuK3xSM4kccm8YMuGCBLmxd8sf2EhtIKIdDPW5=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Lei Garden elevates Cantonese dining with its elegant, open-concept space in the historic CHIJMES—think high ceilings, bright lighting, and a serene yet sophisticated vibe. The crispy roast pork belly is a must-order: crackling skin, succulent layers, and perfectly seasoned. Equally impressive is the thick-cut char siew, glazed to caramelized perfection. Standout mains include the fish in stone pot (tender, aromatic, piled with crispy leeks and onions) and Kurobuta pork, rich and velvety.\n\nDim sum holds its own— fluffy liu sha bao oozes golden custard, and har gow boasts plump, fresh shrimp. The pumpkin and pork soup is a masterclass in Cantonese broth: deeply layered, sweet-savory, and soul-warming. Skip the $9 soft drinks (overpriced even for CHIJMES) and splurge on tea or soup instead.\n\nThe overall execution is polished. Ideal for special occasions or business meals, where the refined ambiance and culinary finesse justify the premium. Focus on the classics and savor the roast meats—they’re why this place remains a Cantonese icon.",
      "time": 1742651908,
      "translated": false
    },
    {
      "author_name": "Prudence Cheong",
      "author_url": "https://www.google.com/maps/contrib/117080347328966371045/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKzIJE_WIfu7SU7GaqT3Cqk4R6IxT_nzY21S3k61sMS1Z-aaw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Best HK Dim Sum available here! The portion is appropriate for family sharing. Love their food so much, the service provided is excellent and the atmosphere is relax for dining. Please note, there is time limit for dining on weekend. And do call in for reservation, so, no need to queue.",
      "time": 1746348970,
      "translated": false
    },
    {
      "author_name": "Jerry Tang",
      "author_url": "https://www.google.com/maps/contrib/115888625563267924954/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUnFvL10EUGJIL7pZw_FFl3giNO_RmBG77kJs89D50r3hjDf6l7=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "My favourite Cantonese restaurant in Singapore. I've been here for more than a decade. Food quality is always consistent and good. Service top notch and friendly and the place clean and nicely decorated.",
      "time": 1740120151,
      "translated": false
    },
    {
      "author_name": "Ian Li",
      "author_url": "https://www.google.com/maps/contrib/103602047879226708518/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV0y3WenEktwADErZshq780v0OxRHspypUeRCgMugBc1d_q5tbY=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "We visited Lei Garden for our CNY celebration, and the festive atmosphere was delightful. The restaurant was filled with joyful CNY songs, and the warm, attentive staff made us feel welcome—always a good sign.\n\nLocated in Chijmes, right in the heart of town, Lei Garden is easily accessible and surrounded by plenty of things to do, making it a great spot for both dining and sightseeing.\n\nLei Garden serves Chinese cuisine with a local touch, offering generous portions and quick service.\n\nRoasted Pork – Absolutely delicious! The meat was juicy and tender, while the skin was perfectly crispy—a standout dish.\n\nPeking Duck – Decent, but what we enjoyed most was the stir-fried duck bones. The sauce was rich and flavorful, and the meat was juicy, making it hard to stop eating—we finished it within 10 minutes!\n\nCrab Meat Fried Bee Hoon – Another amazing dish! It had a strong wok hei and a wonderful seafood aroma, making it incredibly flavorful. The portion was also generous.\n\nOther dishes – Consistently delicious across the board.\n\nDessert: Mango Pomelo Sago – Refreshing and well-balanced, with fresh mango and pomelo. Not overly sweet, making it the perfect way to end the meal.\n\nWe thoroughly enjoyed our meal at Lei Garden and will definitely return. Highly recommended for a great dining experience with authentic flavours and generous portions!",
      "time": 1738601026,
      "translated": false
    },
    {
      "author_name": "Byung Hun Kim",
      "author_url": "https://www.google.com/maps/contrib/111646225219254774729/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX6Gd_TBeU1n4uwveSRv_l2k-njHpBztZoA2bifsDmP5i0P1p5j=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "I was catfished by their tasty looking photos. But in reality, looks like something you can find in the corner of any dimsum spot in Chinatown. Ex. The photo attached is suppose to be mango sago. And note, I take food photos as a passioned hobby.",
      "time": 1743828909,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=18208053745161748238",
  "user_ratings_total": 1042,
  "vicinity": "30 Victoria Street, #01-24 CHIJMES"
}