{
  "formatted_address": "80 Marine Parade Road 01-41/42 Parkway Parade, Singapore 449269",
  "geometry": {
    "location": {
      "lat": 1.3015876,
      "lng": 103.9050758
    },
    "viewport": {
      "northeast": {
        "lat": 1.303101230291502,
        "lng": 103.9066693302915
      },
      "southwest": {
        "lat": 1.300403269708498,
        "lng": 103.9039713697085
      }
    }
  },
  "name": "Levi's Parkway Parade",
  "place_id": "ChIJZ9rFpXEY2jERXY9hOHV35iA",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "Mike Kao",
      "author_url": "https://www.google.com/maps/contrib/105099526002875628912/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKm08KbxUSiWGd9j-gd6xLZtF-H_yXNpNls_LJwyBXpcra5tw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "Two years ago I came to buy a pair of pants,  it the tailoring was so bad it came out short. Two years later in 2025, I came and bought two new pairs of pants and they came out short again. They said they can help alter and I said alter 2cm longer and they say cannot cause they only measure by inches? OMG! I am completely disappointed by this store now compared to last time when it first opened.",
      "time": 1737202171,
      "translated": false
    },
    {
      "author_name": "Ravi Shrivastava",
      "author_url": "https://www.google.com/maps/contrib/103800107631404505285/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXPbXImUE-hgc7eoaPwAqnSmP0I8Wwdlv5vL-QVeuM3ntJwdYt0=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "I have recently bought 6 trousers from Levi's Parkway Parade store. I tried couple of them and bought few more of same size and style with different colours. Then I gave it to store for length alteration. After collection of these trousers in a week, I washed and ironed, thereafter I noticed one trouser was damaged. Since it is altered and washed, store has refused to replace it. Although I should have also checked each and every pair before payment, I did not anticipate that store will sell damaged trouser. Levi's store at Parkway, you have certainly lost me as customer forever.",
      "time": 1735473388,
      "translated": false
    },
    {
      "author_name": "ayaan sameer",
      "author_url": "https://www.google.com/maps/contrib/112820420964688058765/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWYtHEDK7bD_nB2Fio8Xsd7wCZHWR_CecmzF1ucYleNBIJL5zI6=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "In this particular situation, the encounter with the male cashier at the store was marked by a distinct lack of courtesy and professionalism. As I attempted to purchase a shirt for my father, with a budget of $35 in mind, the experience took an unpleasant turn. After selecting a T-shirt and expressing my uncertainty about it by saying, \"looks okay,\" the cashier responded with a remark that carried a condescending tone.\n\nRather than offering assistance or providing helpful insights about the product, the cashier chose to make a sarcastic comment. His response, \"Best one for your small budget,\" not only lacked the expected customer service etiquette but also came across as dismissive and disrespectful. Such a remark could make any customer feel undervalued and unappreciated, especially when navigating choices within a specified budget.\n\nEffective customer service involves not only facilitating transactions but also ensuring a positive and respectful interaction between the customer and the staff. In this case, the cashier's response fell short of these expectations, leaving a negative impression on what should have been a routine and straightforward shopping experience. Such incidents can significantly impact a customer's perception of a store and influence their decision to return for future purchases.",
      "time": 1701669147,
      "translated": false
    },
    {
      "author_name": "Lucy Ho",
      "author_url": "https://www.google.com/maps/contrib/114042407701657171828/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJE-vI4XLgSgdAt2YF4TF0wEhGLIsz4iTNPKr7YUZlUtGKy=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "The sale person Prince Rai was above and beyond. I have been fat shaming at pretty much every Levi's store I have been to in Singapore but not at Levi's Parkway Parade. Prince Rai was so patient and his customer service was exceptional. His recommendations are spot on for my body type. He was attentive without being pushy. He was caring without being judgemental.\n\nMy husband and I entered the store to kill time and ended up buying 4 pairs of jeans. We'll definitely be back for more. Thank you for such a wonderful shopping experience.",
      "time": 1669467037,
      "translated": false
    },
    {
      "author_name": "Gary McRae",
      "author_url": "https://www.google.com/maps/contrib/113913951590541527912/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVknd2X77jKu1-oXgooS71MAnhupPodxjrhyvUPdijWC7K5TfW1IQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "9 years ago",
      "text": "A standard Levi store at SG prices which seem much more than back home in SF. Not surprising since Levi is a SF company.\nThere is a paid membership that gets you a discount and on a regular basis Citibank customers can get a discount if using a qualified card - worth checking out the latest promotions before paying full price.",
      "time": 1452079220,
      "translated": false
    }
  ],
  "types": [
    "clothing_store",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2370713599197941597",
  "user_ratings_total": 19,
  "vicinity": "80 Marine Parade Road 01-41/42 Parkway Parade"
}