{
  "formatted_address": "273C Punggol Pl, #01-884, Singapore 823273",
  "geometry": {
    "location": {
      "lat": 1.4023496,
      "lng": 103.9012804
    },
    "viewport": {
      "northeast": {
        "lat": 1.403741280291502,
        "lng": 103.9025542302915
      },
      "southwest": {
        "lat": 1.401043319708498,
        "lng": 103.8998562697085
      }
    }
  },
  "name": "Li Li Cheng Supermarket",
  "place_id": "ChIJo9sY6-IV2jER16JxVW7stl8",
  "rating": 3.4,
  "reviews": [
    {
      "author_name": "Jeremy W",
      "author_url": "https://www.google.com/maps/contrib/114907660355589815176/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKlBNL5oQSoiFbBAuirqiEfCQ9WzJ5ayOhW4gcOGB_NIpTnOg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "It's a nearby supermarket, so is handy. They do cram a lot in the limited space, so most items I need are available. Though, it's very crowded. I have to say, some of the staff are pleasant. A couple of the younger ladies at the counter are friendly and there is also a pleasant middle-aged lady with glasses that makes the effort to say, \"Good morning.\" However, and this is a big \"however,\" there are two aunties who let the rest down. One - with coloured hair - is rude, condescending and vitriolic. Keeping in line with her bitter constitution, she regularly tosses change at me, snaps, or simply glares at me throughout the transaction as if I'm from another planet. I once heard her scold a man who works at the nearby Kopitiam for buying alcohol: \"Why you always come in and buy beer?\" As if it's her business! If he wants to come in ten times a day to buy beer, he can. Leave him the alone! He's a paying customer. There's also another auntie with short, wavy grey hair. Never smiles and is also rude, loud, and somewhat anti-social. My advice my friends, steer clear of this gig. These two older women have a way of putting you in a sour mood. And to the two women concerned, if you don't like the job, move on and do something that doesn't involve dealing with the public.",
      "time": 1742368171,
      "translated": false
    },
    {
      "author_name": "Chung Teck Chye Eric Staff",
      "author_url": "https://www.google.com/maps/contrib/107769544958258896852/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLaB1KGgXzGTVehCI-Y6w8kM-xmkCJRPW9Fyd7kjDg-6ax0Ng=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "5 months ago",
      "text": "Hi All, I have been visiting this store since May 2021 when i started working nearby. So my experiences are all during the daytime (working hours)\nI do notice that 1 of the aunties recently was a bit rude but I just ignore her. Also it is the store's policy that you need to buy a certain amount before using Paywave or NETS. So they might get agitated if they have to repeat it several times a day. Overall, I will still visit to get necessary stuff but its not a terrible experience. I do hope the management can help address the bad reviews by sending the cashiers for some customer service courses.",
      "time": 1733809527,
      "translated": false
    },
    {
      "author_name": "YingQing Liow",
      "author_url": "https://www.google.com/maps/contrib/103827057342297752973/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJcWb_70TZLgxIMjzTuTAfCQpjNMFwSSnbdKopg4T75GY5b0Q=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "2 months ago",
      "text": "I usually support local but the redish short hair auntie cashier (with spec) might make me change my mind about supporting them. She is always Rude with bad attitude. There are already quite a few complaints about her. To the mgmt, with her attitude, luckily u are the only minimart around that area.",
      "time": 1742086765,
      "translated": false
    },
    {
      "author_name": "Siang ming Wong",
      "author_url": "https://www.google.com/maps/contrib/115605788527168307330/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKq3DnuLOa_-_bHaYebKrk8z3VbtwALJE4gLVjnGRzwbDCEgw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "To the auntie with the short hair, wearing spectacles with small eyes and the hair a bit coloured. On 10th Jan 2025, morning 10:10am and other separate occasions I buy stuff like cigarettes. She don’t smile never mind, but please don’t throw the cigarettes at the counter, slam the NETs machine when I making payment. I never done anything wrong or show any attitude but this lady want to show attitude. I don’t know what is her issue with customers but please ask her watch her behaviour. Otherwise she won’t be so lucky.",
      "time": 1736475236,
      "translated": false
    },
    {
      "author_name": "No nickname",
      "author_url": "https://www.google.com/maps/contrib/115975825494422026456/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXEGoa-eub2PxUWWECQ054R20-K43sWuNN0nb6viiFkEHlWXo0=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "2 years ago",
      "text": "You may discover Li Li Cheng Supermarket from within Singapore’s Punggol area, at 273C Punggol Place.\nThe Supermarket & Grocery Store offers the local community a great destination for buying all the daily necessities from foodstuff to other everyday items. Popular items on the supermarket shelves include, for example, breakfast cereals, fishcake snacks, chocolate snacks ^_^",
      "time": 1683551919,
      "translated": false
    }
  ],
  "types": [
    "grocery_or_supermarket",
    "store",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6896959837988561623",
  "user_ratings_total": 268,
  "vicinity": "273C Punggol Place, #01-884"
}