{
  "formatted_address": "277 Orchard Rd, #03-12 / #04-11 orchardgateway, Singapore 238858",
  "geometry": {
    "location": {
      "lat": 1.3005304,
      "lng": 103.839655
    },
    "viewport": {
      "northeast": {
        "lat": 1.302106980291502,
        "lng": 103.8414187802915
      },
      "southwest": {
        "lat": 1.299409019708498,
        "lng": 103.8387208197085
      }
    }
  },
  "name": "library@orchard",
  "place_id": "ChIJay5CK5EZ2jERAPWDcZxzKyo",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Olivia LZ",
      "author_url": "https://www.google.com/maps/contrib/111575454013833516207/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXkH_4agipezYqJiPUZIVQMY0Tyw2YRj02_8eGvF6tSIkaf-gwT=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "2 weeks ago",
      "text": "I visited the Orchard Library before it closed for renovation, and I always loved its calm and cozy atmosphere.\nThe modern design, quiet corners, and wide selection of books made it a great place to read, study, or just take a break from the city.\n\nThough it’s temporarily closed, I’m looking forward to seeing how they improve it. Hoping the refreshed space will bring back the same peaceful vibe—with even better facilities.",
      "time": 1746381154,
      "translated": false
    },
    {
      "author_name": "Gabriellius Le",
      "author_url": "https://www.google.com/maps/contrib/116576851611807790661/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVWyRpVJTAq--xrso9LGHodgz_exHXJkpAmUcsxi8qXq0RBBcer=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "The Library @ Orchard is a hidden gem in the heart of Singapore, offering a serene escape amidst the bustling shopping district. Located in Orchard Gateway, this library is modern and thoughtfully designed, with a focus on lifestyle, design, and the arts. Its spacious layout, cozy reading corners, and floor-to-ceiling windows create an inviting atmosphere perfect for reading or quiet contemplation.\n\nThe curated selection of books, magazines, and digital resources caters to a wide range of interests, with an emphasis on creative and design-centric topics. The library's unique shelving, arranged in a flowing, wave-like pattern, adds to its contemporary aesthetic. There are also dedicated areas for exhibitions and workshops, making it a vibrant community space.\n\nWhether you're a book lover, a design enthusiast, or just looking for a peaceful place to unwind, the Library @ Orchard is a must-visit destination in Singapore.",
      "time": 1725191518,
      "translated": false
    },
    {
      "author_name": "Experience Seeker",
      "author_url": "https://www.google.com/maps/contrib/105964436614790211794/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW9Zt_xKJJ8s21pFr7WX_jlAJGe2uHLf_0sDOQ3ZByX7nlvTcqJdQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "A gem inside the busy orchard area. I really love their collection and athmosphere. It is very calming yet beautiful and Instagram able",
      "time": 1745319153,
      "translated": false
    },
    {
      "author_name": "Leo Martin Ababa",
      "author_url": "https://www.google.com/maps/contrib/113163496752186462892/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXiJQDd1ITvTiIJT_C-c7AyfmB9tZp-uyw-kZwOcGgXy18O-lowmQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Library@Orchard in Singapore offers a unique library experience, merging design and literature with innovative features. This public library focuses heavily on design, housing extensive collections across themes like \"People,\" \"Space,\" \"Product,\" and \"Visual\" on its upper floor, where non-fiction and design resources are highlighted. The lower floor features fiction and multimedia, creating a distinct vibe where visitors can choose between exploration or quiet study. One of the library's standout features is its \"book trees,\" floor-to-ceiling installations where users can select books and even interact with digital recommendations on adjacent screens.\n\nThe library also offers creative seating options, such as pod-like \"cocoons\" for cozy, uninterrupted reading with scenic views. It encourages social interaction in spaces like its open-plan seating area inspired by ancient Greek agoras, where visitors are welcome to converse and share ideas. The library even includes an interactive Kinect Glass wall for browsing digital content through gestures.\n\nLibrary@Orchard hosts regular workshops and activities, making it more than just a reading space. The Resident Maker program, held monthly, showcases artists and designers, adding a dynamic layer to its offerings. Located in Orchard Gateway Mall, the library is easily accessible, providing a quiet retreat amidst the bustling Orchard Road.",
      "time": 1730640797,
      "translated": false
    },
    {
      "author_name": "jennita nita (Jejenjourney)",
      "author_url": "https://www.google.com/maps/contrib/111565668904003124106/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX9gM0EwMfHLT-ykCXOwyW64isKiQ-lRkcZszJLd54fx5lVKkrPtg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I've visited Library@Orchard a few times, and it’s one of my favorite places for reading and mindfulness. The space is spread over two levels, and it’s always super quiet, clean, and well-organized. The atmosphere is calm and relaxing, making it perfect for getting lost in a book or just unwinding. A great spot to recharge!",
      "time": 1731542431,
      "translated": false
    }
  ],
  "types": [
    "library",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3038649489348097280",
  "user_ratings_total": 660,
  "vicinity": "277 Orchard Road, #03-12 / #04-11 orchardgateway"
}