{
  "formatted_address": "Jurong Lake garden, Singapore",
  "geometry": {
    "location": {
      "lat": 1.3358997,
      "lng": 103.7261741
    },
    "viewport": {
      "northeast": {
        "lat": 1.337275180291502,
        "lng": 103.7273694302915
      },
      "southwest": {
        "lat": 1.334577219708498,
        "lng": 103.7246714697085
      }
    }
  },
  "name": "Lights By The Lake @ Jurong Lake Garden",
  "place_id": "ChIJQe0HfgAP2jERRnTesGjbF70",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Benedict Correya",
      "author_url": "https://www.google.com/maps/contrib/113292377967743781974/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVGGK89xGI0xzaALnRSueP9q_XEKHVc_VzRg-FwAWXsA37LqP5y7A=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "8 months ago",
      "text": "Lights by the Lake 2024 at Jurong Lake Gardens is a mesmerizing celebration of the Mid-Autumn Festival, running from September 8 to September 22, 2024. This event is a visual and cultural feast that promises to enchant visitors of all ages.\n\nLantern Displays\nThe lantern displays are the highlight of the event, featuring intricate designs that reflect the biodiversity and iconic landmarks of Jurong Lake Gardens. The floating lanterns and origami-inspired creations are particularly stunning, casting a magical glow over the lake.\n\nCultural Performances\nThe cultural showcases and performances add a vibrant touch to the festival. The NParks Concert Series in the Park: Rockestra® is a standout, with local artists delivering captivating performances of popular Mandarin and English songs.\n\nFamily Activities\nFamilies will find plenty to enjoy, from carnival games and arts activities to free movie screenings. The event also supports a good cause, with charity booths benefiting the President's Challenge 2024.\n\nFood and Refreshments\nNo festival is complete without delicious food, and Lights by the Lake does not disappoint. The variety of street food available ensures that there is something to satisfy every palate.\n\nOverall Experience\nLights by the Lake 2024 is a must-visit for anyone looking to experience the magic of the Mid-Autumn Festival. The combination of beautiful lantern displays, engaging performances, and a wide range of activities makes it a perfect outing for families and friends. The event is well-organized, ensuring a safe and enjoyable experience for all.",
      "time": 1726458244,
      "translated": false
    }
  ],
  "types": [
    "park",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13625600440323175494",
  "user_ratings_total": 1,
  "vicinity": "Jurong Lake garden"
}