{
  "formatted_address": "931 Yishun Central 1, #01-107, Singapore 760931",
  "geometry": {
    "location": {
      "lat": 1.4265538,
      "lng": 103.8375314
    },
    "viewport": {
      "northeast": {
        "lat": 1.427854980291502,
        "lng": 103.8389747802915
      },
      "southwest": {
        "lat": 1.425157019708498,
        "lng": 103.8362768197085
      }
    }
  },
  "name": "Lion Health Clinic & Surgery (Yishun)",
  "place_id": "ChIJUwD4BgQV2jER5rfMCzKaOrg",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Evelyn Png",
      "author_url": "https://www.google.com/maps/contrib/109246735196620580445/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLCUUKeP1e7A6HW3f9-DjqwKwjN3Z3gSMs4jeghA6Kz-qbDkQ=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "I have been visiting this clinic whenever my child is sick as I always had a good experience with the doctors. Especially Dr Mohan who was very patient with children and he was also very knowledgeable and professional. However, my recent visit was a nightmare. The doctor who was on duty that day; Dr Vincent Oei seems very inexperienced in dealing with sick children. My child was crying and instead of trying to calm her down or at least wait for her to calm down, he just forcefully tried to hold her hand down several times to put on the oximeter. He also forcefully tried to put in the tongue depressor twice to check her throat, causing her to gag and vomit thrice. He still wanted to prescribe medicine for vomiting when we told him my child didn’t have any prior vomiting episodes. It was all caused by him and no apology was given. He just bothered about cleaning himself up. Hence, I would suggest that if you have a sick child, please do call in to check who is the doctor on duty. If it is Dr Vincent, I would suggest you go other clinics unless you are desperate. Dr Mohan deserve a 5 stars but this is based on my poor experience.",
      "time": 1744008745,
      "translated": false
    },
    {
      "author_name": "Catherine Catherine",
      "author_url": "https://www.google.com/maps/contrib/108342014175114030064/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKMg0foH3pMwzQSvOkDsQhp1IEi3tYiskUsKazyRniHcLvdsms=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I visited pre-christmas night 2024 10 p.m. for my son's lung infection. The doctor is fast in diagnosis, the front counter receptionist is so friendly and quick. Everything settled in less than 25 minutes. We are so grateful your doctor and all staff are still working and still are open tonight! Happy Merry Xmas and may you be blessed :) ! 💝 Such cute turtles !",
      "time": 1735051250,
      "translated": false
    },
    {
      "author_name": "Arshini _zx",
      "author_url": "https://www.google.com/maps/contrib/118380219120841914626/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVRXARGVdNPOtnNxAbdc-84PdG7ed3Jd_qf7nxc2RTLP95cgq6n=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "I came in for a consultation and was truly impressed by Dr. Ng Wei Kiat Gilbert. He has a remarkable ability to explain medical information clearly in simple, layman terms, which made it easy for me to understand my diagnosis. Even when the clinic is crowded, he takes his time with each patient, showing genuine care and attentiveness. His professionalism, patience, and dedication truly stand out. I’m very grateful for the excellent care I received.",
      "time": 1747133605,
      "translated": false
    },
    {
      "author_name": "Chloe Chin",
      "author_url": "https://www.google.com/maps/contrib/106392812033096886175/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKM-JlLMAUWEbDCUysRDN-DQBobSENjBm9iVCzGDzldaD8F4Q=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I recently visited lion health clinic and had an outstanding experience. DR Mohan was incredibly knowledgeable, patient, and took the time to thoroughly address my concerns. They explained everything clearly and made sure I understood my treatment plan.\n\nThe clinic assistant, was also wonderful—they greeted me with a warm, positive attitude and helped answer all my questions about medications and follow-up care. Their kindness and professionalism made the visit stress-free.\n\nThe clinic itself was clean, well-organized, and efficient. I highly recommend lion health clinic to anyone looking for compassionate and attentive healthcare. Thank you to the entire team!",
      "time": 1744630914,
      "translated": false
    },
    {
      "author_name": "Kholillul Talha",
      "author_url": "https://www.google.com/maps/contrib/101585648530246700779/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXYjw8Qj69QYcJkO1xIyNmPd_WVRblel0kAjPrZrHShgJXy-O-U=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "My 1 year old daughter was having a high fever and the front desk (initially confirmed that there's no one in the queue. But the next thing I know, the doc called the queue no. after mine and the front desk had no initiative to alert the doc in time before the patient entered the room. Both girls just acted blur when I asked why my queue no. was skipped. Pls be ALERT and look more ALIVE front desk.!!! Pls understand your duty and responsibility!! Stop DAY DREAMING!!!",
      "time": 1736858050,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13275092391364966374",
  "user_ratings_total": 263,
  "vicinity": "931 Yishun Central 1, #01-107"
}