{
  "formatted_address": "48 Jalan Merdu, Singapore 548675",
  "geometry": {
    "location": {
      "lat": 1.3934727,
      "lng": 103.9004817
    },
    "viewport": {
      "northeast": {
        "lat": 1.394685230291502,
        "lng": 103.9018308302915
      },
      "southwest": {
        "lat": 1.391987269708498,
        "lng": 103.8991328697085
      }
    }
  },
  "name": "Little Oxford Schoolhouse @ SK48",
  "place_id": "ChIJgxDOkIkX2jERwodJ4c8s7WA",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Claire Yue",
      "author_url": "https://www.google.com/maps/contrib/107396280280126148324/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVTSnL8hh8VxJsCU4_wsXwtyNAxRJox-4Ra9_vjnrLQwENKe2f0rQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Highly Recommended Preschool – A Gem at Little Oxford SK48\n\nWhen my best friend recommended Little Oxford SK48, I was initially hesitant. Several childcare options were closer and cheaper, just 3–5 minutes from my house. However, after my daughter attended Little Oxford for 2.5 months, I can confidently say it was the best decision we’ve made.\n\n⭐️Outstanding Teachers and a Loving Environment⭐️\nThe teachers at Little Oxford are exceptional—professional, caring, and genuinely kind. From the very beginning, they showed immense dedication. During my daughter’s first two weeks, the teachers constantly updated us on her activities, sharing delightful photos and videos that captured her precious moments. Their warmth and attentiveness helped my daughter transition from being reluctant about school to eagerly anticipating it. Within 10 days, she was fully settled and now looks forward to school every morning with excitement. Thanks to Tr Evelyne, Chai Laoshi, Tr Charlotte and Sun Laoshi❤️🙏\n\n🍀Beautiful and Tranquil Campus🌷\nThe school’s location is peaceful and homey, nestled in a terrace house with ample outdoor play areas. The serene environment feels safe and welcoming, making it a wonderful space for children to learn and grow.\n\n👍Experienced Leadership and Structured Curriculum🤩\nThe principal, Ms. Shermaine, is a gem—kind, experienced, and highly capable. She addresses parents’ concerns effectively and ensures the school is well-managed. The structured curriculum is thoughtfully designed, and parents receive bi-weekly updates and class summaries, which are incredibly helpful. In just a short time, we’ve seen significant improvements in our daughter’s discipline, communication, and responsiveness.\n\n💰Exceptional Value for Money👍\nDespite its private childcare status, Little Oxford SK48 offers incredible value. After government subsidies for working mums and their latest promotion, we pay less than 1K monthly. The quality of education and care rivals the bigger names in the industry but at a much more affordable rate.\n\n❤️Final Thoughts☺️\nWe’re so grateful for my friend’s recommendation and for choosing this school despite initial concerns about distance. Little Oxford SK48 has exceeded our expectations in every way, and we feel completely at ease entrusting our daughter to such a caring team.\n\nA huge thank you to Ms. Shermaine and all the wonderful teachers for making this an unforgettable experience. Little Oxford SK48 truly deserves 5 stars ⭐ and our highest praise. Highly recommended!👍👍👍",
      "time": 1733673497,
      "translated": false
    },
    {
      "author_name": "Sock Kian Lim",
      "author_url": "https://www.google.com/maps/contrib/114765003363753237624/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW85IOH8qWfpOAwIgZxBPNjw5plRkfD-1unCrFxJWXHWX_EPIIyFg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "My son has been attending this wonderful school for slightly over a year and I am amazed at the progress he has made in such a short amount of time. The teachers are incredibly dedicated and passionate about their work, and it shows in the way they interact with the children. There is also plenty of space for the children to play and learn.\n\nThe staff are warm and welcoming, and I am grateful to have found such a nurturing and supportive environment for my child’s early education. Thank you Little Oxford Schoolhouse!",
      "time": 1683626807,
      "translated": false
    },
    {
      "author_name": "Sophie Guerin",
      "author_url": "https://www.google.com/maps/contrib/113578060943064368190/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUGkHzo6cknAOuKJLQWcLojftPBy6O2Nvq705gw5x8G1b5VaXE0=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "We are so excited to be sending our daughter back to Little Oxford. Previously she was at the Bartley campus and has recently started in SengKang. Our daughter loves her teachers and we love the school community. Highly recommend!",
      "time": 1651034839,
      "translated": false
    },
    {
      "author_name": "Juliana Rasid",
      "author_url": "https://www.google.com/maps/contrib/108047700677106364168/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIgJIOUXxSlIfcETZhFv5CPdvgc0Db9XqxmlpOq1bCrg3haxQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Choosing a preschool for your child is a really important decision and so when we decided to switch our daughter last year, we were thankful that Little Oxford @ Sengkang was available. We were attracted by the bright, clean and spacious environment which I think is wonderful for children.\n\nIt is clear that the principal, teachers and management are experienced at what they do. I appreciate the updates at the end of the day at pick up which allowed me to have a discussion with my daughter after. In the previous school, I used to get daily updates of small mistakes made that left me anxious whenever I opened the school app. The teachers do a wonderful job in correcting and reinforcing good behaviours.\n\nI have observed the school to be very inclusive in their enrolment and I am glad that my daughter is able to experience this. Being a smaller school, the students and teachers seem to be familiar with students, even those they do not teach. The school culture and environment is an entirely positive one.\n\nMore importantly, the teachers are kind, patient and loving to our lil' ones. My daughter enjoys her lessons, crafts and outdoor play. The school is highly recommended.",
      "time": 1684154162,
      "translated": false
    },
    {
      "author_name": "LH SM",
      "author_url": "https://www.google.com/maps/contrib/112424739729314684869/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJSTFWo04rCBqKNiU9nrqfNZs48sqXv5gnD-b2BH9jX7bPEfQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "My husband and I discovered Little Oxford some time ago while searching for a playgroup for our 18-month-old son. We were immediately drawn to its location, nestled in a quiet neighborhood off the main road. Our son joined Little Oxford about 3 months ago, and we've been thoroughly impressed with the dedication and passion shown by the headmistress, Ms. Shermaine, and his class teachers, Ms. Evelyne and Chai Lao Shi. They have taken a keen interest in his development and ensured a smooth transition since his arrival. Their genuine care for his wellbeing and growth is evident; it's been just one term, and we're amazed at how much he has progressed.",
      "time": 1719971058,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6984287868471052226",
  "user_ratings_total": 18,
  "vicinity": "48 Jalan Merdu"
}