{
  "formatted_address": "Blk 168D Punggol Fld, #02-663, Singapore 824168",
  "geometry": {
    "location": {
      "lat": 1.3937489,
      "lng": 103.9139919
    },
    "viewport": {
      "northeast": {
        "lat": 1.395019080291502,
        "lng": 103.9152829302915
      },
      "southwest": {
        "lat": 1.392321119708498,
        "lng": 103.9125849697085
      }
    }
  },
  "name": "Little Footprints Preschool @ Punggol 168",
  "place_id": "ChIJT5xrLqsX2jERYue16Um1R7g",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Doodle Muse",
      "author_url": "https://www.google.com/maps/contrib/104246069567410572831/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK-dxVzHsFvU6PUp-AQuxPGT0QciTIxT-Re_-v9YjLQlo3JBw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Happy teacher’s day to all teachers, aunties and principal Lynn~! I would like to compliment Teacher Jennifer (Jen), for her kind, gentle, understanding and positive approach to my little ones. She recognizes the pace of my kids (gives fair attention to every kid), very calm, friendly and assuring to them. Apart from Teacher Jen, my kids also feel very at ease with Zhang/ Lin Laoshi and Teacher Max. Younger kid is relaxed around Chen Laoshi too. Kids get scared easily by adults who scold, I really appreciate these teachers for consistently making all the kids feel respected and comfortable in school with your impartial opinions and warm speech with kids… Thank you for boosting my kids’ confidence each day. I am so grateful for your footprints in their lives.",
      "time": 1725340774,
      "translated": false
    },
    {
      "author_name": "QinXia Wang",
      "author_url": "https://www.google.com/maps/contrib/106083387827359057734/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXQycGFvo91de3CJa93YLGsWA8r_gyhaaGbfZkinvFgBsI3oTnH=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "My two kids really enjoy the time in school.Every staff in Punggol 168D is very kind, principal Ms Nai is reachable at any time even public holiday.My Son was with teacher Lynn about two and half years,I really appreciate her help on my Son, she not only take care of student’s study, also the development of personality. Ms Tini is very warming, we like to see her smile in morning upon enter school.张老师is very hardworking,Teacher Min,Ms Lina ,teacher Xuefang and 罗老师is very nice and easygoing. Thanks to all Teachers",
      "time": 1566024286,
      "translated": false
    },
    {
      "author_name": "Hannah Lim",
      "author_url": "https://www.google.com/maps/contrib/115601276217575650704/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJhG9hCJMahFprxu_rC5pYQzlRMvDMX51Scl3oqQVxLlAzbAQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "The Principal Ms Nai is very detailed with all aspects of running the school, be it our Children’s education, well-being, or character  building. Really appreciate all the updates and reminders she send us on school matters, and all on her own accord.\n\nI would like to mention Teacher Lynn as well, she is a loving teacher who teaches my child English and Maths. She really cares about our children’s progress and their personalities.\n\nAnother teacher to mention is Zhang lao shi who teaches Chinese in K2. She is also a loving teacher who genuinely cares about the Children and their upbringing.\n\nOverall, I am grateful to the teachers and staff of this school, and that both my children had a chance to attend this school and have the experience that they did. Well done to all!",
      "time": 1566017899,
      "translated": false
    },
    {
      "author_name": "Esther Tan",
      "author_url": "https://www.google.com/maps/contrib/106970216208827500612/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIV-ZwwI8EGoAnjFRkEbxRoP4U3JZS8QmUBJFGzi6Nt9xGZcw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "An awesome centre, with a team passionate about nurturing kids. I have 3 kids all enrolled with LFP punggol 168D, in PG, PN and K2 currently.\n\nLFP wasn't the first school for all my kids -(they attended infant care elsewhere and up to PG for my first two kids), I can see the difference in quality of the team and the impact it has on my children. Things really took a change for the better after Ms Nai took over as the principal, the curriculum improved with more involvement of the kids in activities outside of just academic subjects. I appreciated the excursions that the school arranged, creating wonderful and unforgettable memories for my children.\n\nThe team that made such a difference in our lives:\n\nTr Lynn - my son's favourite teacher, who seen him grow from PN to K2 now. 张老师 also helped my son to develop such great interest in Chinese language.\n\nTr Min, Tr Lina and 罗老师 of PN did an exceptional job with my daughter. Thank you for your patience and affection.\n\nMs Tini, whom I observe, to never fail to greet all the kids and parents with a warm smile.\n\nEven Tr Angeline, who has only started taking care of my youngest boy since August. I was impressed that she took effort to make a personal call to me before my boy started school, simply just to understand his preferences, medical history and all, rather than filling out a generic form.\n\nThank you to the dedicated team at LFP Punggol 168D.\nYou are all a blessing to both children and parents!",
      "time": 1565969005,
      "translated": false
    },
    {
      "author_name": "Kanyaphat Junthanirs",
      "author_url": "https://www.google.com/maps/contrib/104201396338982913459/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWQLMI1QXQJt16vd6O_Fllu0TKoN-71__dXRvswnipfXPbXFlqn=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "The kids are really enjoying the school and that makes us decided to let all the children attending this school, even though we have moved to further place.\nBeside a very good foundation curriculum that offers in school, I like the December K2 Primary 1 preparation curriculum that my eldest boy attended last year. The kid is well- prepared for Primary 1 and know what he will be expecting to see when he go to P1. This makes him easier to adapt to the new school.\nTeacher Joanna is very attentive and friendly teacher that has been teaching my children from the beginning till now. She also keeps the parents updated on the child’s progress. So it makes the kids easy to adapt to the school environment easier. My children are looking forward to go to school everyday",
      "time": 1566012796,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13278781355383449442",
  "user_ratings_total": 59,
  "vicinity": "Blk 168D Punggol Field, #02-663"
}