{
  "formatted_address": "12 Aljunied Road #03-01 & #03-02, KH Plaza @ Aljunied, Singapore 389801",
  "geometry": {
    "location": {
      "lat": 1.3141267,
      "lng": 103.8822202
    },
    "viewport": {
      "northeast": {
        "lat": 1.315434530291502,
        "lng": 103.8835242302915
      },
      "southwest": {
        "lat": 1.312736569708498,
        "lng": 103.8808262697085
      }
    }
  },
  "name": "Little Green House @ Aljunied",
  "place_id": "ChIJ52ddqjcZ2jEReb8x_mPWL7Q",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Katherine Wong",
      "author_url": "https://www.google.com/maps/contrib/117687194256115509544/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW840iFCx8zVq6CDvvT6d3hQcaf6QBemh1lhn2uFkYowMsWMrAW=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "My little one has been attending Little Green House @ Aljunied infant care and I have been pleased with the attention and services that the principal and educarers have shown.\nDuring the days of a daycare search (last min!), principal Yvette had been welcoming and proactive with the onboarding process to make it less anxious as a first time mother.\nI am able to experience the love and nurturing of all the professionals in the centre being translated to the wellbeing of my child. Thank you!",
      "time": 1742444749,
      "translated": false
    },
    {
      "author_name": "Ember Sulaiman",
      "author_url": "https://www.google.com/maps/contrib/112624111992028530384/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUAfvfGwKZHEf0VE8wruSgclDLpQLKCIircPR8ff4rLTQMUmMDM=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "We are so grateful for the incredible care our baby has received over the past two months at Little Green House. The team is kind, professional, and genuinely loving toward the little ones. They have created such a nurturing environment, and it’s clear that our baby feels safe and happy there.\n\nWe appreciate how communicative the staff is, keeping us updated on our baby's activities, milestones, and overall well-being every day. The facility is always clean, well-organized, and equipped with everything needed for the babies’ comfort and development.\n\nThank you for your dedication and hard work in providing exceptional care. You’ve given us peace of mind as new parents, and we couldn’t be happier with our decision to trust you with our child!",
      "time": 1733156849,
      "translated": false
    },
    {
      "author_name": "Aik Teck Yan",
      "author_url": "https://www.google.com/maps/contrib/116555234376460558073/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXQbpKd79stucX-HF9zsfdRMyX8LirqJCAUPnFgIG0qDjJbtYm9=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "“A wonderful infant care with dedicated teachers and leadership.”\n\nI can truly feel the genuine love and care that the teachers have for my son. Special thanks to Lan Lao Shi, Teacher Shah, Teacher Shika, Teacher Angel, and Teacher Florence for their dedication and warmth.\n\nI also appreciate how Principal Yvette is deeply committed to the welfare of the children while maintaining a balanced and impartial leadership approach that considers the well-being of the teachers as well.\n\nOverall, I’m very happy with how the school is run. We’ve had no issues and I highly recommend this infant care to other parents!",
      "time": 1736160368,
      "translated": false
    },
    {
      "author_name": "necs aw",
      "author_url": "https://www.google.com/maps/contrib/117355133583063388444/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIATMtnP65bApmjDzSKoEO3j-mWJc-PwjRE3UTBC-FI9Inrrw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Since 2023, My daughter have joined LGH from infant to N1 now, I can truly feel the genuine love and care from the teachers, like QIQI LAOSHI, LAN LAOSHI (called Shuang Shuang LAOSHI), teacher Florence, teacher Sha, teacher YILIN, HUIHUI LAOSHI, teacher angel, teacher shika, teacher angel and teacher jojo for their dedication and warmth.\n\nI also want to said thank you and appreciate how principle Ms Yvette, it’s really big different after Ms Yvette joined the school, she’s takes everything into her own hands, she is very interactive with parents, open to feedback and responsibility.\n\nOverall, we are very happy with the school, teachers and everything. We are highly recommend this LGH to other parents.",
      "time": 1740651452,
      "translated": false
    },
    {
      "author_name": "Jacqueline Tan",
      "author_url": "https://www.google.com/maps/contrib/104192817969010373159/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLLBSuXkJM2Ic0AaUGo-D_k2Do-jUQcT3ccQC1zvaBeMMqE_A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "Recently moved my kids over to LGH @ Aljunied in June 2024 after detailed considerations of a handful of schools. What drew me to move (and the school has proven right after just 2 weeks into school):\n\n- A very dedicated principal who takes everything into her own hands. She is very interactive with parents, open to feedback and most importantly, action on them.\n- Good profile of teachers with very different teaching style to handle different student needs\n- Clean, neat and well kept learning environment with big floor area for kids to explore.\n- Good curriculum to promote lifeskills as well as maintain BAU education.\n- Strong believer of outdoor activities to enhance kids exposure to the outside world.\n- Tchs, principal and parents engagement is strong. Parents are kept updated on students progression.\n\nPlus Points:\n- Shuttle service pick up at various locations from 7am to 10am.\n- School able to cater to students needs eg. shower to kids with eczema\n- Principal makes the effort to understand every single child and assess their strengths and weaknesses\n\nMinus Point:\n- Driving is a test to skill as school is located in an aged industrial with narrow driveway and parking.\n\nOverall, am happy with the move to the school and I believe with the change in the new principal, LGH @ Aljunied will leave your kids with a memorable childcare experience.",
      "time": 1718366811,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12983831975687208825",
  "user_ratings_total": 39,
  "vicinity": "12 Aljunied Road #03-01 & #03-02, KH Plaza @ Aljunied"
}