{
  "formatted_address": "163 Tanglin Rd, #02-136, Singapore 247933",
  "geometry": {
    "location": {
      "lat": 1.3050246,
      "lng": 103.8235685
    },
    "viewport": {
      "northeast": {
        "lat": 1.306323580291502,
        "lng": 103.8247291302915
      },
      "southwest": {
        "lat": 1.303625619708498,
        "lng": 103.8220311697085
      }
    }
  },
  "name": "Little Farms Market, Tanglin Mall (Grocer)",
  "place_id": "ChIJJ6SpJdwZ2jER3cMcWGFXnTc",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Nadir Benaissa",
      "author_url": "https://www.google.com/maps/contrib/101504364362323385159/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJHAMYnXmJTnR7rj8B5ibyGgbWpMwRJ2YBGEPjUYFZqUiaGyENs=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Little Farms isn’t just a grocery store — they sell health. Every product they offer feels thoughtfully chosen, from organic vegetables to grass-fed meats, high-quality dairy, and clean pantry essentials. You’re not just buying food; you’re investing in better living.\n\nI shop here regularly because the quality is consistently outstanding. You can truly taste the difference, and it’s reassuring to know exactly where your food comes from.\n\nThe staff is fantastic too — always welcoming, knowledgeable, and happy to help. Whether you’re shopping for daily basics or special ingredients, they make the whole experience smooth and enjoyable.\n\nLittle Farms is more than a store — it’s a real partner in a healthier lifestyle. Highly recommend!",
      "time": 1745761678,
      "translated": false
    },
    {
      "author_name": "Parth Arya",
      "author_url": "https://www.google.com/maps/contrib/108225490787926235000/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJy7hVp8399sM7IqbNa05161ycYqsvaj8S0q_DqdV9wEqspWg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Little Farms is a fantastic go-to spot for fresh, high-quality groceries and specialty products. The produce is consistently fresh and their curated range of international and organic items makes it easy to find unique ingredients. The staff is friendly, helpful, and knowledgeable, always ready to assist.\n\nThe in-store café is also worth a visit—great coffee, healthy meals, and a cozy ambiance. If you’re looking for a more boutique, personal shopping experience compared to large supermarkets, Little Farms delivers on all fronts.",
      "time": 1746345083,
      "translated": false
    },
    {
      "author_name": "Latifa El Kadi",
      "author_url": "https://www.google.com/maps/contrib/116850779544603870055/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocITZKLqwdgpMG3MP5i-c9qZBSjFMBTFEpBl1HvaY_F5dzIZEQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Little Farms is much more than just a grocery store — it’s a place where health and quality come first. Every time I shop there, I feel confident knowing I’m bringing home products that are clean, fresh, and carefully selected, from organic produce to grass-fed meats and premium pantry items.\n\nWhat I love most is that they focus not just on good food, but on nourishing lifestyles. You can really feel the difference in the quality and the care behind everything they offer.\n\nThe team at Little Farms is always friendly and genuinely helpful, making each visit a pleasure. It’s clear they take pride in what they do.\n\nIf you’re looking for a store that values your health as much as you do, Little Farms is the place to go.",
      "time": 1745782082,
      "translated": false
    },
    {
      "author_name": "Jill Tan",
      "author_url": "https://www.google.com/maps/contrib/105008376535412719989/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU4idn6NvM7eqf9yMAOTWCYoYK397nqMq00c1joSpgfssj3ctg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I just want to say a very Big Thank you, to Miss Eva, Tanglin Mall Branch. She noted that I came down twice, (yesterday & today) to get the reusable Kegtop dispenser, but the stock had not been delivered yet. She called me, during her break & took the initiative to make delivery arrangements, for the items, to be delivered to my home, today. She told me \"I dont want to see you, being disappointed.\" Thank you so much, Miss Eva! You made my birthday, extra special, this year! You are a gem!",
      "time": 1743156127,
      "translated": false
    },
    {
      "author_name": "LiV3 LiFe",
      "author_url": "https://www.google.com/maps/contrib/112429413622143366667/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXtrg9T8voglJq_831z4em62JS9waz7N5urlL1gdwDaACv502nK=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 3,
      "relative_time_description": "7 months ago",
      "text": "Little Farms Market at Tanglin Mall is not just any other grocery stores. It has imported many groceries from countries such as Australia, Italy - fresh, frozen, wine. It is very interesting but be prepared to pay a higher price than from the country itself. It would be a good indulgence from time to time no matter. Cashier Staff are average - they do their due diligence of asking if a plastic bag is required. Overall, it is ok.",
      "time": 1727531611,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "grocery_or_supermarket",
    "store",
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4007455319031333853",
  "user_ratings_total": 167,
  "vicinity": "163 Tanglin Road, #02-136"
}