{
  "formatted_address": "22A Teban Gardens Rd, #01-01 Teban Vista, Singapore 601022",
  "geometry": {
    "location": {
      "lat": 1.3234852,
      "lng": 103.7399135
    },
    "viewport": {
      "northeast": {
        "lat": 1.324796480291502,
        "lng": 103.7412670302915
      },
      "southwest": {
        "lat": 1.322098519708498,
        "lng": 103.7385690697085
      }
    }
  },
  "name": "Little Footprints Preschool @ Teban Gardens",
  "place_id": "ChIJuR645KUa2jER_GNLhTmyv-0",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Quinn Loon",
      "author_url": "https://www.google.com/maps/contrib/114923334633118333139/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIktbWtFCG1vGVWV5KhC72aay4QlaS4uTdHqyyCj5bP6et5Bw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I am truly grateful for the wonderful teacher, Li Yuanyuan lao shi who has had such a positive impact on my children. She treats them like her own, providing not just academic instruction but also emotional support and guidance.\nHer patience and kindness, create a nurturing environment where my children feel safe, valued, and encouraged to grow.\nShe takes the time to understand their individual needs and works tirelessly to help them. I feel fortunate that my children have had the opportunity to learn from her.",
      "time": 1741704379,
      "translated": false
    },
    {
      "author_name": "Claire Chua",
      "author_url": "https://www.google.com/maps/contrib/117052065950095108971/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJfJtBuVxc_62oVLmuaytCaTfIB8Zf4MRJ4E1MOJpe_wCXSJw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "My son enjoys going to school every day and has been attending since playgroup. The teachers are friendly and always helpful with our inquiries, and they remember every parent's face. I would especially like to recommend Li Lao Shi, who has been teaching my son for the past three to four years. She goes the extra mile to ensure he gets the best possible experience from school. The school is well-organized, allowing teachers to follow students throughout their growth, except in cases where a teacher leaves.",
      "time": 1740064112,
      "translated": false
    },
    {
      "author_name": "Scarlette Coeur",
      "author_url": "https://www.google.com/maps/contrib/101553142465861661638/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJOT6IYEaczp55b3y6zv2WspGh2zPZG2jhqF5tFJsK13KkasA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "A big thank you to all the wonderful teachers in Little Footprints @ Teban Gardens, especially to Li Lao Shi, Fu Lao Shi, He Lao Shi and Teacher Regina.  Fu Lao Shi taught my child and she was very kind and patient to her, when she was in PG - this takes a lot of effort and she never lost her temper. Li Lao Shi is a very caring mummy figure to my child since N1, and she is extremely encouraging and patient - there was once during an excursion, I observed how she was taking care of the young children but she was also making sure they were drinking enough water, kept them dry and doing what a mummy would do to care for their children - she takes care of them like they are her own. She goes out of her way and recognises the young children for their positive attitude and they love her just like my son does! Teacher Regina and He Lao Shi taught my girl from end of N1 until K2 - and she, together with the rest of her class, has blossomed under their dedication and care - they loved to perform, sing and dance, learnt to care for the elder, plant trees and fruits - just like how gardeners take such good care of their seedlings, the dedicated, hardworking (they stay until late and come back on Sats) and passionate teachers are the key to the success of the school. The teachers make an extra effort to connect with the children, and inform the parents on the children's progress. We're so blessed to have the very loving teachers taking care of our little ones - a big thank you again!",
      "time": 1741010601,
      "translated": false
    },
    {
      "author_name": "tamyiz online",
      "author_url": "https://www.google.com/maps/contrib/102299318293378239465/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWOA0ntCW5Z4Rurvj7rZZ_7Zvqn-IeIjxoOa-hFTRaI2im0ripx=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "\"I'm absolutely delighted with Little Footprints Childcare! We've had the pleasure of being part of their community since their second year of operation at Teban. All three of my children have thrived under their care, and I'm grateful for the nurturing environment they've provided. I highly recommend Little Footprints Childcare to any parent seeking a trustworthy and loving space for their little ones.\"",
      "time": 1739841180,
      "translated": false
    },
    {
      "author_name": "Shirley Sim Si Li",
      "author_url": "https://www.google.com/maps/contrib/115262966052069780838/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKuJnAf_5qdqjoVLWSlSfl2VkbbQWHvZjPSHa69ERgIn7OpKw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "My son enjoy very much during his journey of pre schooling at, little footprints Teban garden since 2018.\n\nHis teacher, Teacher Cindy & Fu Laoshi has been very tedious and patience when handling children. My son do love them a lot. I really are thankful to met such teachers.\n\nMy schedules are always very tied and tense to forget things at time, but teacher Cindy would always drop reminders and newest updates of happening of my son to me, which I felt really warm.\n\nAfter most the admin and principal are also very patience in guiding him and helping him throughout these year. Thanks you 💕 I really appreciate it 👍🏻",
      "time": 1667623708,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17131607467659846652",
  "user_ratings_total": 51,
  "vicinity": "22A Teban Gardens Road, #01-01 Teban Vista"
}