{
  "formatted_address": "163 Tanglin Rd, #02-138, Singapore 247933",
  "geometry": {
    "location": {
      "lat": 1.305035,
      "lng": 103.823845
    },
    "viewport": {
      "northeast": {
        "lat": 1.306505530291502,
        "lng": 103.8251393802915
      },
      "southwest": {
        "lat": 1.303807569708498,
        "lng": 103.8224414197085
      }
    }
  },
  "name": "Little Farms Table, Tanglin Mall (Restaurant)",
  "place_id": "ChIJaXz5QqgZ2jERrq2spRELQ4c",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "GG K",
      "author_url": "https://www.google.com/maps/contrib/113182488876013163119/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJFHYPU6LcVzIMoSpThTDTStOqFYRiAlEmNoAPCaEDEixj2eg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 2,
      "relative_time_description": "2 weeks ago",
      "text": "This review is based off their desserts solely, not too sure how their mains will fare. In general, I would recommend avoiding their desserts completely as they miss the mark by quite a lot.\n\nWe tried the mango passion fruit entremet (sourced from Patisserie Cle if I remember correctly) and the Cheesecake. Both were really disappointing, they tasted way too sweet. The mango passion fruit entremet in particular lacked complexity and tasted kind of artificial. As for the drinks, the coffee and hot chocolate were average, but nothing special.\n\nOverall, I would not recommend this place for afternoon tea. Prices are quite high as well which is completely not worth the quality you're getting. Somehow, the business here is pretty good, so it's also not easy to get a table even on a weekday (and definitely not worth the wait).",
      "time": 1746525802,
      "translated": false
    },
    {
      "author_name": "Michele Yap",
      "author_url": "https://www.google.com/maps/contrib/111170749139953218592/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJerHLlF-6fjAKfWYOLM3b4v-ttyrLs0VYf3yXOsax-GBsAKg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We had a delightful dinner with excellent service by our server, Ling.\n\nThe portions were very generous for the Sesame Tuna Tataki and also their signature Garlic Prawn & Avocado Sourdough Flatbread, which was yums! This is coming from a non-veggie eater.\n\nOn the contrary, the cheese board had only 2 types of cheeses, hardly a cheese board… it could have been more generous with at least 3 types.\n\nLovely chill ambience, will definitely be back again!",
      "time": 1744464322,
      "translated": false
    },
    {
      "author_name": "Yu Quan Yeo",
      "author_url": "https://www.google.com/maps/contrib/109504835113397432635/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUO10ZDooZdAENb0gxSGrkdt5Q8EvBNJv-1ypA3bo4sXgl908oEgw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Little Farms is a gem for fresh, high-quality food that highlights the natural flavours of its ingredients. Their Spiced Cauliflower is a one of my favourite dishes, with perfectly cooked cauliflower complemented by yoghurt, pomegranate, and flavourful sauces that create a delightful harmony on the palate.\n\nAnother must-try is the Avocado Quinoa Feta Bowl, an excellent blend of savoury and sweet elements with a refreshing touch of acidity. It's a satisfying and wholesome meal that never disappoints.\n\nThe café also boasts a tempting selection of pastries and beverages, making it an ideal spot for a quick snack or leisurely meal. Little Farms consistently delivers a great dining experience for those who appreciate simple yet flavourful food.",
      "time": 1736949237,
      "translated": false
    },
    {
      "author_name": "Jean VB",
      "author_url": "https://www.google.com/maps/contrib/116915504065255507954/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLX2_RAeTltPh0vewnO1V9kZ3xnNHXFXLiVOV2xX2WeK4lktQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Super fresh healthy food choices. Great portions and worth every penny. Did a little food shopping in their diverse market after dinner. We had the mushroom beef pasta, caesar salad, and broccoli. Excellent and plenty for two.",
      "time": 1740575964,
      "translated": false
    },
    {
      "author_name": "JOANNE GUO",
      "author_url": "https://www.google.com/maps/contrib/106245054040263558943/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJRuLKW1bMf4Wa41uWalRi4n6jq-BcatzAAih8KAyqLa_jYNA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "If you're looking for a cozy and delightful dining experience in the heart of Tanglin Mall, Little Farms Table is a hidden gem that offers a perfect blend of fresh, high-quality ingredients and a warm, inviting atmosphere. The menu features a fantastic variety of wholesome, farm-to-table dishes, with options for all tastes, from nourishing salads to hearty mains. The food is beautifully presented, and each dish is bursting with flavor, thanks to the use of locally sourced, organic ingredients.\n\nThe service is attentive and friendly, making you feel at home the moment you walk in. The open, airy space adds to the relaxed vibe, making it an ideal spot for both casual meals and special occasions. Their coffee and fresh juices are also a must-try!\n\nOverall, Little Farms Table is a perfect spot for anyone looking to enjoy clean, delicious food in a comfortable setting. Whether you're a local or visiting Tanglin Mall, it's definitely worth a visit!\n\nMerry Christmas!",
      "time": 1735108866,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "cafe",
    "bar",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9746646188981792174",
  "user_ratings_total": 209,
  "vicinity": "163 Tanglin Road, #02-138"
}