{
  "formatted_address": "662 Yishun Ave 4, Block 662 Block 662, Singapore 760662",
  "geometry": {
    "location": {
      "lat": 1.4202897,
      "lng": 103.8400826
    },
    "viewport": {
      "northeast": {
        "lat": 1.421590230291502,
        "lng": 103.8414638302915
      },
      "southwest": {
        "lat": 1.418892269708498,
        "lng": 103.8387658697085
      }
    }
  },
  "name": "Little Seeds Preschool (Praiseland)",
  "place_id": "ChIJDU-WNWsU2jERgEZzmT49Xhg",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Hsuenchi Chen",
      "author_url": "https://www.google.com/maps/contrib/111269330332703371516/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJBSrVnRy4vNep0Ux1rqq_9wgTSBXpgJqflMi3Q5UmU5bIN-Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Enrolled my 2 boys, 2yo & 4yo early this year and they have adapted very well. Special thanks to Ms Jane whom is very experienced and passionate when it comes to teaching the little children. Along with Yuan laoshi & Sun laoshi. Li laoshi & Ms Nena are also my children’s class teacher. The school has a holistic curriculum planning and provides weekly update on their classroom learning. The principal, Ms Anne & admin, Charis are also very friendly and approachable.\nThumbs up to all the aunties & staff at Little Seeds(Praiseland).",
      "time": 1742347256,
      "translated": false
    },
    {
      "author_name": "Isabel Teo",
      "author_url": "https://www.google.com/maps/contrib/109890039365403537506/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKvUw4FFYKTS9Ka90LkaZuPiV5eF6kg8Qr8tIyIOOnDRgPpPA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We have enrolled our girl to Praiseland when she was 20 months old. We are glad that the teachers (Ms Jane, Sunwei laoshi, Hannah and Chu laoshi) with the rest of the team of teachers are very patient and caring towards the children.\n\nAs parents, we are not worried as we know our girl is well taken care of by the school.\n\nMost importantly, there is effective communication between school and parents. Thank you for the leadership of the principal Ms Anne.\n\nMother and father of Amelia.",
      "time": 1743150564,
      "translated": false
    },
    {
      "author_name": "Marvin Tham",
      "author_url": "https://www.google.com/maps/contrib/110456738002116907091/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXNmwBQ3B27x7xz2Gre0tNgtrR66KqHV_Da_4hYYCGIAx-Rj7WZ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "My son recently started attending LSP, and we’ve already witnessed such incredible progress. In just two weeks, he’s been babbling more than ever—a clear sign of how effective and engaging the holistic curriculum is. The teachers are not only attentive but also radiate and warmth that my son instantly connected with. This made his adaptation process so smooth and heartwarming to watch. He now eagerly looks forward to going to school every morning, excited to play and learn, without a single tear at drop-off. It’s truly a joy to see him thriving in such a nurturing environment. We couldn't have asked for a better start to his preschool journey!",
      "time": 1742343083,
      "translated": false
    },
    {
      "author_name": "DazxleMakeup",
      "author_url": "https://www.google.com/maps/contrib/114980066980241314124/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXWC8GUcDFmbp86QZ2dbblJpnuQwBkdG2k1gJiAE_4BjDfI89aV=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Nurturing teachers in a faith-based school setting. My girl is 3 and has been in the school for 8 months. Her mandarin has improved tremendously thanks to her class teacher 李老师. She comes home to share that she enjoys herself in school and how teacher Hannah cares for her. Kudos to teacher Soon who is ever so patient with class operations and all the teachers whom I observed looking out for one another. Highly recommend here as a safe and nurturing environment for your buds!",
      "time": 1724900544,
      "translated": false
    },
    {
      "author_name": "Yvonne Chng",
      "author_url": "https://www.google.com/maps/contrib/103216958204206122163/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV1j2OFs9cwBg3WDfGMDP9aoHalt9FjMnNiq03a9YlN_9wj-EMxQw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I came across this preschool while searching for a school for my 18-month-old child, and I'm so glad I did. Our priority was a Christian-based preschool as we are Christian ourselves, and this school fit the bill perfectly. From registering to enrolling, everything has been a breeze. The principal and admin staff have been incredibly proactive in replying to parents' inquiries.\n\nI enrolled my two kids into this school this year, and the transition for my PG Tod and N1 Tod has been incredibly smooth. They love going to school every day and not once have they complained about not wanting to go.\n\nI've personally witnessed the love from the teachers, principal, and even the cooks there. I couldn't thank the school enough for giving so much care and attention to the students and providing them with healthy meals. My N1 Tod is a picky eater, but she never fails to finish her meal and often asks for more.\n\nIf you're looking for a loving, Christian-based preschool where your child will thrive, I highly recommend this school. Thank you to the entire staff for all that you do!",
      "time": 1709695634,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1755908243792807552",
  "user_ratings_total": 52,
  "vicinity": "662 Yishun Avenue 4, Block 662 Block 662"
}