{
  "formatted_address": "631 Senja Rd, #01-228, Singapore 670631",
  "geometry": {
    "location": {
      "lat": 1.3865825,
      "lng": 103.760386
    },
    "viewport": {
      "northeast": {
        "lat": 1.387911030291502,
        "lng": 103.7618061302915
      },
      "southwest": {
        "lat": 1.385213069708498,
        "lng": 103.7591081697085
      }
    }
  },
  "name": "Little Footprints Preschool @ Bukit Panjang 631",
  "place_id": "ChIJD2-555YR2jERB5redAVLl-U",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Lim Cai Yi",
      "author_url": "https://www.google.com/maps/contrib/101273974709939429657/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIZY_i1FuhOsgNwfMpUWT70lGvszvTZX0zBoP3NraAhLKjM=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Thank you Ms Christina, Bai laoshi and all teachers at LFP @ BP631. My son loves going to school and I know he is in good hands - teachers are passionate in receiving the kids every morning, proper checks are done at entry, kids well being are monitored closely during the day, feedbacks are given promptly on developmental growth and milestones as well as daily behaviors.",
      "time": 1724601152,
      "translated": false
    },
    {
      "author_name": "Jason Han",
      "author_url": "https://www.google.com/maps/contrib/113228344417831721259/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKVGGRRVVQjtGUTWKUGSuWiao5NpBpegwmdSrCZ2Dk__ZIXlA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I would like to thank Principal Christina, Guo laoshi, Tr Devi, Sun laoshi, Tr Nana, Aunty Jenny and all other teachers and staff at little footprint school BP631 for organising every parental involvement events. All events were thoughtfully planned and beautifully executed. It was evident how much effort went into making it both educational and enjoyable for both students and parents! Keep up the good work!",
      "time": 1738039912,
      "translated": false
    },
    {
      "author_name": "Yuan Jun",
      "author_url": "https://www.google.com/maps/contrib/110943055838922253036/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKZJGNx2ImZsrhffJpA5MF85QNMCMXcrOdFUiZklDSHowyXcw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "Love this preschool so much! Teachers are super attentive to my sons needs, updating us regularly during pick ups and drop off. Principal is always in school, readily available when we need to speak to her.\n\nMy eldest son always fall sick in previous CC so we decided to change school. When he first transferred here, Teacher devi and bai laoshi was the first teacher that taught him. Ensuring that he adapt well to school. Absolutely no cries during drop off and i can see he enjoy school so soo much! Hygiene here is good as well. After transferring to this school, my son absentism rate went down and he did not fall sick as frequent as before. This year his teachers are guo laoshi and teacher hazel. To which both teachers are fantastic! Guo laoshi is super attentive, knowing that he fall sick easily she make sure that he is not under the AC, when weather is hot she ensure that my son drink lots of water. Regularly updating us whenever she sees me outside school/during drop off/pick ups 🥰\n\nSent my 2nd son to this school because why not! 18month old, his weight is 10%, the smallest in class! Teacher Nurul and bai laoshi are super gentle and patient towards him. Fast forward to 6months later, he is adapting so well in class right now! ❤️ Talking and smiling so much! Weight had significantly improve as well.\n\nReally thank you to all the teachers, principal and aunty jenny here. Being a teacher isn't easy furthermore a preschool teacher. I thank all of you for the dedication and hardwork you had put in for my sons! 🩷\nHappy teachers day!",
      "time": 1724309217,
      "translated": false
    },
    {
      "author_name": "karyan ky",
      "author_url": "https://www.google.com/maps/contrib/102739280211523548352/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWu3_Tq9_negBR3jVQEsT5gFx77Ve9BIjE3KVyrK4TCwQWHvAxh=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My son has enrolled to PG class of Ichiban Montessori (Bukit Panjang 631) since Jan this year. He enjoys going to school everyday and I appreciate all the efforts, love and care from the teachers in the centre in helping my son to grow happily and build his character.",
      "time": 1693921803,
      "translated": false
    },
    {
      "author_name": "Karen Lim",
      "author_url": "https://www.google.com/maps/contrib/102041211549869719466/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLxt4xomJ5GwgJQlWNTa38_Y2yyFpSWjb0flfTcc5wsAULC6A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Teachers in this school are patience and passionate. My girl enjoys school daily. Thank you for making learning fun and enjoyable for the kids. Big shout out to Teacher Devi, Nurul, Kenny and not forgetting Principal Christina. Also to Aunty Jenny for making healthy yummy food for the kids daily.",
      "time": 1692699517,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16543774242976471559",
  "user_ratings_total": 6,
  "vicinity": "631 Senja Road, #01-228"
}