{
  "formatted_address": "1 Beach Rd, Singapore 189673",
  "geometry": {
    "location": {
      "lat": 1.2950939,
      "lng": 103.8534594
    },
    "viewport": {
      "northeast": {
        "lat": 1.296916380291502,
        "lng": 103.8549420802915
      },
      "southwest": {
        "lat": 1.294218419708498,
        "lng": 103.8522441197085
      }
    }
  },
  "name": "Long Bar",
  "place_id": "ChIJr3wRuKUZ2jER6s2v4lk2y8o",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Wisanu Tuntawiroon",
      "author_url": "https://www.google.com/maps/contrib/109243125213682583986/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUrfUqdK9jg1neT66INv3fn-OhjMZGPoRz3PGdxHKVCv9uEVeb8Wg=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "A must-visit for anyone wanting a taste of Singapore’s cocktail history. Long Bar is the iconic birthplace of the Singapore Sling, and sipping one in its original home is a fun, nostalgic experience. The colonial-style decor, rattan chairs, and ceiling fans add to the charm. It’s a bit touristy, but that’s part of the appeal. Don’t forget to toss your peanut shells on the floor — it’s all part of the tradition!",
      "time": 1744635953,
      "translated": false
    },
    {
      "author_name": "Phil Marinucci Multimedia",
      "author_url": "https://www.google.com/maps/contrib/108656421577656987627/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX7mDcb7u1OdnE1gxvvNreo-DmjCZ0qLqlk_69mMlCaR_UiZYF0=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Had a chance to visit the Raffles Long Bar in Singapore. Beautiful bar, great atmosphere. The bar is historic and known as the birthplace of the Singapore Sling drink. Obviously we had to try their (very expensive) Singapore Sling. Like the bar, the drink was beautifully put together and presented. Taste wise... meh... I've had better. But if you're in Singapore, the Long Bar is a must visit.",
      "time": 1742824703,
      "translated": false
    },
    {
      "author_name": "Kenneth Yeo",
      "author_url": "https://www.google.com/maps/contrib/111153740218915905371/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIR08S8GO_sGxRDmQMOIU79vW9E7PQWTQOc9Ccc5wPA5ESyog=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Came here yesterday for just a couple of cocktails. For the experience and atmosphere, I guess it somewhat justifies the high price of the drinks but I most definitely will not come here often. Ordered the Singapore Sling and the Duke and both were indeed to my liking (though are of completely different categories of cocktails) but they were by no means affordable or particularly stands out from any other cocktails. Would definitely recommend others to try this place at least once and I did thoroughly enjoyed the experience of sipping on drinks and throwing the nut shells on the floor. Having said that, pricing is not competitive but of course if one can afford it, then this is indeed a great place to relax no doubt.",
      "time": 1746942795,
      "translated": false
    },
    {
      "author_name": "Richard W",
      "author_url": "https://www.google.com/maps/contrib/100281625767956045510/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK8pTEhTeuPQaEhYpnvKDdAjPY4sJudUoeZWMfubrr--wp9eA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Expect to wait in line for this walk-in-only tourist attraction, the birthplace of the Singapore Sling. The exorbitant $41 Singapore Sling itself is worth it, a balance of bittersweet with fresh pineapple that will stick in my mind as one of the best cocktails I’ve had even though fruity drinks aren’t my style. The other cocktails weren’t delicious enough to command the price. The place comes with a complimentary bag of shell-on peanuts as bar snack. You’re encouraged to throw the shells on the floor.\n\nIts location though, the Raffles Hotel, gives me the major ick. Yes, it’s opulent and beautiful, but if you look a bit closer, the place celebrates British colonialism. It’s not talking about colonialism through an academic historical lens. No, the hotel thinks colonialism was cool. From the Sikh culture being used as a token prop, to gaudy tea souvenirs labeled “Gentle Conqueror” with an image of a British dandy (really???), and quotes from Rudyard Kipling plastered on the wall talking about how “exotic” Singapore was… it’s kinda gross.",
      "time": 1745994451,
      "translated": false
    },
    {
      "author_name": "Orange",
      "author_url": "https://www.google.com/maps/contrib/115900498086127531781/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW5tfzap08xM-_ghBNR9UH-FOlPCSbMwthIp4UY27Q3SIPDPs1G=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Long Bar in Singapore, located at the historic Raffles Hotel, is famous as the birthplace of the Singapore Sling cocktail. The bar has a colonial-style charm with rattan furniture and a relaxed vibe. A unique tradition there is tossing peanut shells on the floor. Visitors come to enjoy the iconic Singapore Sling and the bar’s nostalgic atmosphere.\n\nService wasn’t attentive as they serve you free water but wasn’t attentive for refills.",
      "time": 1742480814,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14612833175616867818",
  "user_ratings_total": 2620,
  "vicinity": "1 Beach Road"
}