{
  "formatted_address": "19 E Coast Rd, #01-02, Singapore 428746",
  "geometry": {
    "location": {
      "lat": 1.3045739,
      "lng": 103.90244
    },
    "viewport": {
      "northeast": {
        "lat": 1.305848930291502,
        "lng": 103.9038367802915
      },
      "southwest": {
        "lat": 1.303150969708498,
        "lng": 103.9011388197085
      }
    }
  },
  "name": "Lower East Side Tacqueria",
  "place_id": "ChIJgbEAhm0Y2jER0rYnsAS1fRE",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Paul",
      "author_url": "https://www.google.com/maps/contrib/113376130903250627758/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVkfy4TFdWV7r0vYhMdsCWdbnHukShlPuMMbzYrdTFV32KuElWL=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "5 months ago",
      "text": "Authentic Mexican street tacos are antithetical to Singaporean economics.  Everything here has to be bigger and better if only to justify the necessary expense.\n\nThat being said, the food here is quite delicious.  Start with their corn chips and 3 dips.  The tortilla chips are pleasantly crispy and light with a respectable saltiness.  Delicious enough to eat on their own.  But you get three dips.  I asked for the spiciest options, and was convinced to substitute one of them for guacamole - a decision I don't regret.  The waitress recommended the salsa verde and something else, which turned out to be a Velveeta-esque cheese dip that was oddly sweet, but which did end with a little bit of heat.  The salsa verde also had a bit of heat but it was quite mild.  Perhaps feeling bad for me, she brought me a ghost pepper bottled hot sauce which had more than enough heat.  Way more.  But I appreciated the effort!  The guacamole was very respectable, with a pleasant layer of cilantro leaves over the top.\n\nI opted for their barramundi tacos, which are served in pairs, and had mine with soft tortillas instead of hard shells.  The fish was grilled or broiled and seasoned perfectly.  This was atop a massive bed of pickled cabbage.  As someone who prefers a simpler, drier taco this was overkill.  But it was really good.\n\nPair this with a cocktail.  Their selection of tequilas was much more limited than I had hoped, but they had Don Julio as well as Patron.  I opted for the Don Julio upgrade for my tequila sunrise and I was not disappointed.  Good proportion of OJ and tequila to grenadine resulting in a refreshing experience.  They also have beer and wine and other spirits, plus sodas and non-alcoholic options.\n\nOther menu options ran the gamut of fusion experiments to more traditional Mexican-y fare.  I'd definitely be willing to go back and check out other options on future visits.  Sit outside if you like to people watch.  Or face the big-screen TV if you want to keep track of the game.",
      "time": 1732447716,
      "translated": false
    },
    {
      "author_name": "Selva Prabha",
      "author_url": "https://www.google.com/maps/contrib/105459571507968747294/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVdg-yROb1GDoa6yEae70RdSp-_c2pk-DAjJcbY8HrZw5fmP9Zu1Q=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "10 months ago",
      "text": "Lower East Side Taqueria in Singapore stands out as one of the top destinations for Mexican cuisine. Their food is an absolute delight, featuring authentic flavors and fresh ingredients that transport you straight to Mexico. Each dish, from their savory tacos to their hearty burritos, is crafted with care and precision, making every bite a memorable experience.\n\nThe service at Lower East Side Taqueria is exceptional. The staff are friendly, attentive, and knowledgeable, always ready to recommend the perfect dish or drink to complement your meal. Their dedication to providing a great dining experience ensures that every visit is enjoyable and hassle-free.\n\nThe atmosphere at Lower East Side Taqueria is vibrant and inviting. The colorful decor, lively music, and cozy seating create a warm and welcoming environment that’s perfect for both casual dining and special occasions. Whether you're dining with friends, family, or colleagues, the ambiance adds an extra layer of enjoyment to your meal.",
      "time": 1720283031,
      "translated": false
    },
    {
      "author_name": "Denis",
      "author_url": "https://www.google.com/maps/contrib/107269275231105198912/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXGcb2XjZu3-SFeDVPGJrkwVnEF4Uv62jV2ZynRo-y070N2TgazBA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "Absolutely love the food here!\n\nService staff are very helpful in recommending what I want to try but not sure the name of the item on the menu.\n\nThank you for customising the mocktail for me tonight too!\n\nThank you for playing the happy birthday song for our dear friend too",
      "time": 1720186858,
      "translated": false
    },
    {
      "author_name": "Harsh Saxena",
      "author_url": "https://www.google.com/maps/contrib/116668155420990919817/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIFC7iyzntAKfz4qesCHxiyxhET-qDW8uHiJQSX7z6apYAfWTg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 2,
      "relative_time_description": "4 years ago",
      "text": "This is only a review of the drinks. We went for a quick drink this afternoon. They had Happy hour for sangria....we were expecting that they would pour from an overnight pitcher but seemed that the bar tender mixed some ginger ale & fruits and made some concoction that was truly abysmal. I didn't even take a pic of the damn drink!!\nHopefully the food is better...till the next visit or maybe not!",
      "time": 1615648979,
      "translated": false
    },
    {
      "author_name": "Fernando",
      "author_url": "https://www.google.com/maps/contrib/111507664989615395080/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKCrg2x7gOd3I5lDy_5PjOtfZhIi6GWo5zD1kzmNyMjsdtqvts=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "A very welcoming restaurant serving flavorful Mexican delicacies. The staff there were extremely approachable and helpful in recommending dishes and constantly checking in on us. A must visit if you are craving Mexican cuisine and I recommend the Pork Carnitas. Worth the travel to go back again 😊",
      "time": 1689986462,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1260362502473496274",
  "user_ratings_total": 387,
  "vicinity": "19 East Coast Road, #01-02, Singapore"
}