{
  "formatted_address": "PTD 200682, Jalan Medini Selatan 1 Bandar Sunway Iskandar Puteri 79250 Iskandar Puteri, Johor Darul Ta'zim Bandar Sunway Iskandar Puteri, 79250 Johor Bahru, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.3960989,
      "lng": 103.6239624
    },
    "viewport": {
      "northeast": {
        "lat": 1.397315430291502,
        "lng": 103.6254024302915
      },
      "southwest": {
        "lat": 1.394617469708498,
        "lng": 103.6227044697085
      }
    }
  },
  "name": "LS X Park Restaurant",
  "place_id": "ChIJkxZgsXoJ2jER4UA9WOrEbN0",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Gator",
      "author_url": "https://www.google.com/maps/contrib/114331842318070680564/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUf5N0YPQocYYralVhzxgKqHfnlJgSiXhs54DUya0oFIumc-54QVA=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Nestled by the tranquil lake, LS X Park restaurant offers a dining experience that is as visually stunning as it is flavorful. The restaurant boasts a beautiful ambience, with serene water views and a relaxed atmosphere that makes it an ideal spot for both casual gatherings and special occasions.\n\nThe menu features expertly prepared Chinese-style seafood, with fresh ingredients and bold flavors that truly stand out. Signature dishes like the salted eggs fried prawns and the teochew-style fish are particularly noteworthy, showcasing a perfect balance of seasoning and freshness. Each dish is thoughtfully presented, enhancing both the taste and dining experience.\n\nService is another highlight, with friendly and attentive staff who are always smiling, making guests feel genuinely welcome. Their promptness and warm demeanor add to the overall pleasant experience.\n\nWhile prices are on the higher side compared to local standards, the combination of quality food, excellent service, and a picturesque location justifies the cost. For those looking for a memorable seafood dining experience by the lake, Lakeside Seafood Delight is well worth a visit.",
      "time": 1740586612,
      "translated": false
    },
    {
      "author_name": "Brenda Chong",
      "author_url": "https://www.google.com/maps/contrib/108622247868539113095/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX6swezE59SRzcbIbhCRNiTjROlBfFzJSA3dHwyAkG1Li0HEr8K=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "LS X Park Restaurant is a gem. The service, food, and atmosphere were stellar. The thoughtful touch of providing candlelights to keep flies away greatly enhanced our dining experience. No more swatting at flies, just enjoying great food.\n\nThe sesame chicken was a delight, the Ma Po style tofu with minced chicken and spicy bean sauce was flavourful, and the stir-fried kailan with garlic hit all the right notes. The dessert premium snow ice strawberry is really wonderful and pleasing to our tastebuds. Highly recommend this place for a memorable meal.",
      "time": 1728734146,
      "translated": false
    },
    {
      "author_name": "jessica tan",
      "author_url": "https://www.google.com/maps/contrib/104267244311782995659/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWAPCIPcVDknUWuy8pt2sKNCnOWSDUwvfAGQwUv_9dc24lnyO0e=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Food is good n portion is generous! With mim spend of rm300, u can book the private boat which comes with an attached toilet and karaoke (jus that the songs are not updated). Boat ride is charged by hour (rm100/hr). Service staffs are all friendly.",
      "time": 1735320955,
      "translated": false
    },
    {
      "author_name": "Mr simple “Mr Simple”",
      "author_url": "https://www.google.com/maps/contrib/109481264163185680677/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVEgPyouT2zh7s68w-ZiXPwbRnh_89vO5tZfhOIvalOh3Doa14=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "Price is on the high side. Waiting time for food is also on the high side. But quality is moderately on the high side only. Finally lighting is no where on the normal side. Bring your own torchlight if you're dinning for dinner.",
      "time": 1743333553,
      "translated": false
    },
    {
      "author_name": "Roger Zhen Fu",
      "author_url": "https://www.google.com/maps/contrib/110395590799297728883/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU61TtDv5ke6SWmnVPoXnVbvrkz-RvfBNPBZzAGjF0Vd4M3R6Pf=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Food was really good and tasty. Dining on the boat cruising slowly on the lake was a memorable experience. Karaoke and toilet are available on the boat. The service both on ground and boat was good and overall experience was really great. Excellent. Will be back again.",
      "time": 1702193708,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15955344090648625377",
  "user_ratings_total": 55,
  "vicinity": "PTD 200682, Jalan Medini Selatan 1 Bandar Sunway Iskandar Puteri 79250 Iskandar Puteri, Johor Darul Ta'zim Bandar Sunway Iskandar Puteri, Johor Bahru"
}