{
  "formatted_address": "3 Ang Mo Kio Street 62, #01-38, Singapore 569139",
  "geometry": {
    "location": {
      "lat": 1.3859679,
      "lng": 103.8455076
    },
    "viewport": {
      "northeast": {
        "lat": 1.387347330291502,
        "lng": 103.8469278302915
      },
      "southwest": {
        "lat": 1.384649369708498,
        "lng": 103.8442298697085
      }
    }
  },
  "name": "Mad Charcoal",
  "place_id": "ChIJ3zkq6S4X2jERN2AwB9eKoKw",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Yun Yi Thiam",
      "author_url": "https://www.google.com/maps/contrib/117032018297036757369/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUH89AcFzDtSmDpsrDd_7AA0tXHtVGE2izfDs6yLnfWS3YI5tKyLQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Tried Mad Charcoal recently and had a great experience!\n\nBeef Brisket: This was amazing! It was beautifully tender and the perfect meat to fats ratio! Rich and smoky flavours in every bite. I would highly recommend it to anyone visiting.\n\nPork Ribs: Unfortunately, the pork ribs were a bit of a letdown. The portion size felt underwhelming for the price, and the meat lacked the tenderness I had hoped for, making it rather tough.\n\nSides: The sides, however, were a highlight! The mashed potato was wonderfully smooth and velvety, almost melting in the mouth, while the sweet potato cubes were perfectly cooked with a subtle sweetness that complemented the meal beautifully.\n\nAt $20.50 per main, the beef brisket was well worth the price, though I can’t say the same for the pork ribs. Despite this, the coffee shop was well ventilated and airy, coupled with the exceptional sides and brisket. I will be back for another visit. Mad Charcoal is definitely a place worth trying!",
      "time": 1738009532,
      "translated": false
    },
    {
      "author_name": "Jeremy Khoo",
      "author_url": "https://www.google.com/maps/contrib/101975552015179312270/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVfnnxOpjXUlSmoDu1Iaj6w1RxG2W1EmHsEr-3z8O3-mjTLH2nGkA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Found this chill place while visiting the industrial park next door. We had the chicken chop and pork belly which were both restaurant level quality and very delicious. Both had the awesome Smokey taste that comes from a charcoal fire with just the right amount of char. The portions were also huge and well worth the price! The mashed potatoes were creamy and tasty but French fries were plenty but were a bit hard. The slaw was also good. Will come again to try the other meats like their beef brisket in the evening with beer on tap from the nearby stall. Feeling full and satisfied 😊.",
      "time": 1734762977,
      "translated": false
    },
    {
      "author_name": "mentaik.o",
      "author_url": "https://www.google.com/maps/contrib/110086868863323086741/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU9M6zefm12ut5_kqcut596MjpWpwykeJq8_hQXkc0nPhy4fIyB=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "1h wait despite being told it was 30min wait only… arrived at 6pm 🥲 First pic was my recent visit, last 2 pics from 2 months ago. The difference LOL….\n\nThey were busy handling some catering order and no one had food on their tables for a good 1h. Perhaps don’t accept large orders during dinner hours if the kitchen can’t cope?\n\nFirst time I came here the food was great with lots of sides to choose from. Sadly it seems they have changed menu and choices were much limited. The pasta looks tragic and tasted q plain. Will not be back.",
      "time": 1746866711,
      "translated": false
    },
    {
      "author_name": "Fa Ming",
      "author_url": "https://www.google.com/maps/contrib/111501496363242117732/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWP_ziSOx8Aqk6eD0SoCB_ekJ8rmMULo9BXuj5mJprNqR_G-8sf=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Today I had the pleasure of trying the BBQ pork belly and chicken chop at this restaurant, and it was one of the best meals I’ve ever had! The pork belly was perfectly marinated and cooked to perfection, retaining its moisture and tenderness. The chicken chop was equally impressive, with a delightful charred flavor that added a wonderful depth to the dish.\n\nWhat really stood out was the charcoal fragrance that enhanced the overall experience. The balance of flavors, the quality of the ingredients, and the skillful preparation truly made this meal unforgettable.\n\nIn addition to the fantastic food, the atmosphere was cozy and inviting, and the prices were very reasonable for the quality and portion sizes.\n\nI would give this place a solid 5 stars across the board – from the food to the service and ambiance. If you’re a fan of BBQ, this is a must-visit spot!",
      "time": 1739017688,
      "translated": false
    },
    {
      "author_name": "Terry Lim",
      "author_url": "https://www.google.com/maps/contrib/105605429605507070635/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVTuhIdDi_RmhUn--tNLY3tKNz23y7l5norEzZxKjSw634OONU=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Had their rabbit leg and pork belly. Pork belly was amazing and accompanied with the char tasted great. The rabbit legs was a little on the dry side but similar to chicken taste. Had the aglio for sides and was okay with a poached egg on top as well as another mash potato on the side. Good texture but not very creamy. Overall was a good meal and would visit again",
      "time": 1734707340,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12439094826940522551",
  "user_ratings_total": 712,
  "vicinity": "3 Ang Mo Kio Street 62, #01-38"
}