{
  "formatted_address": "277 Orchard Rd, Level 10 JEN Singapore Orchardgateway by Shangri-La, Singapore 238858",
  "geometry": {
    "location": {
      "lat": 1.300459,
      "lng": 103.8393516
    },
    "viewport": {
      "northeast": {
        "lat": 1.301765630291502,
        "lng": 103.8410491802915
      },
      "southwest": {
        "lat": 1.299067669708498,
        "lng": 103.8383512197085
      }
    }
  },
  "name": "Makan@Jen",
  "place_id": "ChIJSbV4K5cZ2jER4EusbAqJiaM",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Lam Tan",
      "author_url": "https://www.google.com/maps/contrib/105799201839089842941/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWy1Q5cGJDroCkNbIcj7s5qsSRTUp3LylwQlKh07j3MQHLWVKSpUA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "3 weeks ago",
      "text": "Came for the 1 for 1 dinner promo....\nHotel and restaurant atmosphere is good...clean...\nDining time from 6.30pm to 9.30pm...\nStaffs are friendly and nice...especially Charlene...\nBuffet spread is not so wide....\nCordial fruit drinks are available at the dispenser machine...\nStarting with some fried rice, noodles, etc...\nThe grilled fish sambal seabass with acar is nice...\nThen the next section is the chilli crab, prawns and clams mix with mantou buns on the side.\nCrabs are limited. Refilled but not that many crabs available....\nNext is some pasta...soup and breads section.\nMoving on next is the pork knuckles and Angus beef Rump.... you need to carve it yourself.\nNext is the live BBQ section....with scallops, bug head river prawns and Angus beef patty to choose from.\nOther sections are the norm...cold dishes with some snow crabs legs...sashimi and sushi and cold soba....some fried drummets and onion rings.\nLastly are the dessert and fruits.\nFood tasted ok and not too bad...worth the 1 for 1 but not worth the full price for 1 pax.",
      "time": 1745935040,
      "translated": false
    },
    {
      "author_name": "Xin Hao",
      "author_url": "https://www.google.com/maps/contrib/101038177603319548234/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU6c44XsILjRE2Islw02Z6jqIpGV_4urvZ0lGOy57c-ErkANHqe=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "Visited them for their weekend lunch CNY buffet as there was a 25% off. Pretty decent range of choices as it was CNY specials, including a DIY Yu Sheng area which was quite unique. The chinese roasted duck,bak kwa pasta, collagen soup (although abit salty), kueh pie ti, dim sum, were all really good too. Salmon sashimi and assorted seafood selection is fresh. The chefs work hard to top up each item as readily as possible and are all freshly prepared. Deserts station is average in my opinion with a couple of sweet cakes and ice cream. Very standard and nothing really stood out. Service was otherwise efficient - they cleared our plates quickly and always ensured requests are attended to. Washroom is not too far away as well and dining area on overall is spacious and conducive. Very suitable for large groups or families. Parking coupon not provided.",
      "time": 1737280849,
      "translated": false
    },
    {
      "author_name": "Charis Koh",
      "author_url": "https://www.google.com/maps/contrib/111661568119533771765/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJoCR5EuDRQ06lvVyq60OvbBwKqz3HWZktEzcu7nZ20QN5KOQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Seafood was fresh. Loved the crab. We got a 1 for 1 so it was very worth it. Might not be worth full price for the selection available. Food was pretty yummy. The grilled food takes awhile to cook so the refill rate wasn't fast enough to keep up with the demand but other cooked food was fine. They clear your plates really quickly too.",
      "time": 1745933394,
      "translated": false
    },
    {
      "author_name": "Trantran",
      "author_url": "https://www.google.com/maps/contrib/101880446743203437792/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKQj_k4mFXo7M416Xg8S_aD1EBHgR4ymqw_exKgIkm2qDGWOg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Had an amazing buffet at Makan @ Jen! The variety of dishes was impressive, with a great selection of fresh seafood, flavorful local delights, and delicious international options. Everything was well-prepared and beautifully presented.\n\nA special shoutout to Manager Jimmy, who provided outstanding welcome and made sure we had a fantastic dining experience.\n\nHighly recommend this buffet for anyone looking for quality food and excellent service. Will definitely be back!",
      "time": 1741839098,
      "translated": false
    },
    {
      "author_name": "Zackery Goh",
      "author_url": "https://www.google.com/maps/contrib/109405400403426765330/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUGQsp237p9vNHb-uS9FyMoz0Z-zK6zy1GCgCTEXQuCxwKVbMg-=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I recently had the pleasure of dining at Makan @ Jen Buffet, and it was an exceptional experience from start to finish! The variety of dishes available was truly impressive, featuring a delightful mix of both local and international cuisines.\n\nThe freshness of the ingredients was evident in every bite, and the flavors were vibrant and well-balanced. I particularly enjoyed the seafood section, where the prawns and oysters were simply divine. The live cooking stations added an exciting element, allowing us to customize our meals just the way we liked them.\n\nThe ambiance was warm and inviting, making it a perfect spot for both family gatherings and romantic dinners. The staff were incredibly attentive and friendly, ensuring that we felt welcomed and well taken care of throughout our visit.\n\nOverall, Makan @ Jen Buffet exceeded my expectations. I can't wait to return and indulge in more of their delicious offerings. Highly recommend for anyone looking for a fantastic buffet experience!",
      "time": 1731756451,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11784100577857522656",
  "user_ratings_total": 737,
  "vicinity": "277 Orchard Road, Level 10 JEN Singapore Orchardgateway by Shangri-La"
}