{
  "formatted_address": "2 Highgate Walk, Singapore 598754",
  "geometry": {
    "location": {
      "lat": 1.3399726,
      "lng": 103.7665311
    },
    "viewport": {
      "northeast": {
        "lat": 1.341320930291502,
        "lng": 103.7678376302915
      },
      "southwest": {
        "lat": 1.338622969708498,
        "lng": 103.7651396697085
      }
    }
  },
  "name": "MapleBear Highgate",
  "place_id": "ChIJ638Z7owT2jERjJO79JZ7Jns",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Vicky Zhang",
      "author_url": "https://www.google.com/maps/contrib/112942853733105477995/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKPD3QTzlQVXV02BfH79CjRLM4XQMQBft3R_y9J6d1KS-ktBShP=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "We sent our daughter to MB HG since she was one year old and now she is 3 years old. There are many teachers we wanted to thank to, like ms Annie and Ms Evon from infant care team. And Ms  Wai Ling , Ms Cherry , Sun Laoshi and Wu Lao shi from Child care team. Very sad the infant is closed down recently so I couldnt send my second kid.\nI always love the environment of school and it is always clean and bright. It has one outdoor area on the back , and one out area in the front where they grows plants. The kids get a lot of outdoor time which is good for them. The teachers are always polite and showing their positive energy in front of kids and parents even though their job is very demanding and tiring. My daughter learnt so much from the school and grew to be a playful and outgoing girl.\n\nThe only thing I had doubt was the change of managements as mentioned in other reviews. And some teachers would leave without school informing the parents. But recent months, I feel i have seen the situation getting better. I hope MB HG will thrive to be a better school!",
      "time": 1700039993,
      "translated": false
    },
    {
      "author_name": "Jass Juju",
      "author_url": "https://www.google.com/maps/contrib/106029303888651665068/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKtaO8YY4FpbiWDgA6m-tCjfrDHln3kBUVa92WqgS9CulNDlw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Our experience at MB Highgate has been amazing so far.\n\nEspecially grateful and appreciative towards Teacher Annie, Ya Qi, and Zhao laoshi, whose experience, and dedication to their job shines through when we receive regular updates and advice on our daughter. It is really telling from daughter's fondness towards them, that they understands our daughter's needs well, and this gives us a peace of mind when we send her to MB each morning.\nTeacher Annie also remains responsive even after working hours. This is testament of her dedication towards her job.\n\nWe can also see that the other staff like Joey, ting ting, Cecilia, Bai laoshi are all happy to play with our daughter and she also enjoys the company. Some days, she's even a little reluctant to go home!\nAt times, the other teachers will also give updates on our daughter accompanied with pictures and videos that we really appreciate. It's good to know my daughter is well loved and has ample support around her.\n\nSometimes when we are unsure about certain things at home, the teachers can give tips or give insights into my daughter's interests and behaviours, or how other parents may handle a similar situation.\n\nWe're very happy with the dedication of the staff at MB and we have no regrets putting our daughter here! Under the guidance of principal Shu Xian, we believe the school, teachers, and students will continue to grow. Good job MB HG!",
      "time": 1683869576,
      "translated": false
    },
    {
      "author_name": "WenWei X",
      "author_url": "https://www.google.com/maps/contrib/103749098690309651529/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJiFBOWxH7DsVZtczEYoV5fnVrPVWfO6DjFM7Rj2VJEspKOCLA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Exceptional Infant Care Experience for Our 10 month Baby Girl!\nWe cannot express enough how grateful we are for the exceptional care provided to our baby girl at Maplebear Highgate. Being first time parents both working, we were anxious seeking an infantcare that would replace our role in caring our baby while we were away for work. Highgate brach is our first choice collecting information for long time. From day one, Ms Annie has confirmed our right choice as she was extremely patient answering any questions and concerns we had back then. I still remember her comforting smile when we handed over our baby and she hold it as if she's her own daughter. She and Ms Yaqi listens to our concerns, and promptly take additional actions for either additional milk feeding request or extra care providing solid food feeding during lunch time. They help promptly escalate issues of your concern to principles or HQ and get feedbacks soon. Our parents also are surprised of and highly appreciate the amazing cares Ms Annie and the school provides. You can tell directly from the daily check-in and out photos taken by teachers from both infanct care and toddler classes, which always captured our girl smilling(We didn't know this was exceptional until we changed the school due to relocation), not to mention other exciting and funny moments, growth milestones Ms Annie and Yaqi shared. We stayed for 8 mths and after transiting to toddler class, we were very happy to see the quality of care is consistent from Wu laoshi. Wu 老师 would update us in detail daily highlights how our girl did in school when we picked her up end of the day.  Wu 老师 also shares their coping mechanism regarding our girl being picky for food and gives practical feedbacks how we as parents can help to train our girl. The festival gifts we recieved from the teacher are all very personal to our baby girl's characteristics and Ms YaQi provided photos takend of our girl on the first day of school and latest, pretty well illustrating the change our girl experienced from being shy, afraid of people around at the day one, to being more open and always smiling happily.\nThanks again to Ms Annie, Yaqi, Wu 老师 and all other teachers for creating a safe and loving environment for every child in their care. Our daughter formed strong bonds with them, and their warmth and affection made her feel right at home",
      "time": 1685142637,
      "translated": false
    },
    {
      "author_name": "Dez W",
      "author_url": "https://www.google.com/maps/contrib/116673952956623343384/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIHE9xznoBTdaz1Y9qZq8dpi_o2dexvwF9umjJCImwxIkvrYA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "I love Maplebear Highgate! They have an awesome team of dedicated, nurturing and lovely teachers(Teacher Annie and Zao laoshi), principals and cluster quality manager, Joey.  I have sent my girl in when she was 2.5 months. She is turning 8 months soon and loves going to school! Never once have I seen her crying when checking in for attendance. Always on all smiles and excited to partake in all school activities. Teachers would always update on my girl’s day to day activities, important milestone development and captured all the beautiful photos for us to see. I have never once regretted sending my girl to Maplebear and it was the best decision ever! She is acing very well and achieving her milestones way ahead. I also love all the efforts and sensory play activities that the teachers planned on a weekly basis for our babies. I really love how dedicated Teacher Annie is towards the babies. She even bought berries(raspberries, blackberries and blueberries) out of her own pocket for the babies to try. She treats all the babies like her own grandchildren. She is definitely a gem and should be recognised by the management team. We shifted house last month but we still chose to stick with Maplebear highgate even though it is around 15-20 mins drive to ensure our girl continues to get the best care from the team at Maplebear Highgate. Kudos to the team at Highgate! Way to go!",
      "time": 1683768765,
      "translated": false
    },
    {
      "author_name": "Alpha Chen",
      "author_url": "https://www.google.com/maps/contrib/106123977172361523314/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJy_ppEYErBUh-t34eSR2cKc-IR4GctNLXQBwsO-wMFV_M_ug=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "I think Maplebear Highgate deserves a 5 star in the midst of all the poor reviews given by others. In the last 2-3 years, we have seen 3 principal change, multiple teachers coming and going. However, we have also seen some long standing teachers in the school. Change is the only constant and change is inevitable.\n\nI dont hear any complaints from other parents, or from the kids, so i think that's good feedback.\n\nFirst of all, we wanna say a big congratulations to Miss Shuxian being promoted to Assistant Principal. She's a responsible teacher from the day she came and we are sure she will do better as an AP!\n\nWe also want to take this time to thank Miss Bernie, the former principal for her dedication and love to the kids. We wish her our best endeavours! Thank you Miss Joey for being the cluster quality manager while doubling up as the stand in P!\n\nJust wanna say that everyone is not perfect and we can see the hard work the teachers put in, the dedication in their work, the patience and love they shower upon the kids, I trust that our kids are in good hands!\n\nKudos to all teachers in Maplebear HG! Good job!",
      "time": 1681207193,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8873916004061385612",
  "user_ratings_total": 9,
  "vicinity": "2 Highgate Walk"
}