{
  "formatted_address": "21 Yung Ho Rd, #02-01 The Agape, Singapore 618593",
  "geometry": {
    "location": {
      "lat": 1.3268832,
      "lng": 103.7249805
    },
    "viewport": {
      "northeast": {
        "lat": 1.328147980291502,
        "lng": 103.7263607802915
      },
      "southwest": {
        "lat": 1.325450019708498,
        "lng": 103.7236628197085
      }
    }
  },
  "name": "MapleBear Jurong Lakeside",
  "place_id": "ChIJLYnM8xQF2jERQ8me7le9o50",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Kw L",
      "author_url": "https://www.google.com/maps/contrib/102623641012280756456/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUykeLike6NWlOcaHiqaP2Aj8mjzm0Gn60kcpbDMm0zsrLWVsJM=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "My son has been attending MapleBear Lakeside, and I couldn’t be happier with our experience.\n\nThe school is spacious, clean, and provides a warm, welcoming environment for the children. The teachers are truly dedicated to their craft, ensuring that each child receives the attention and guidance they need.\n\nOne of the standout features is the enrichment classes, which are both engaging and thoughtfully integrated into the school fees—no hidden costs!\n\nCompared to my son's previous school, this has been a significant step up in terms of quality and overall experience.\n\nI highly recommend MapleBear Lakeside to any parent looking for a top-notch preschool in the area!",
      "time": 1739533469,
      "translated": false
    },
    {
      "author_name": "S Koh",
      "author_url": "https://www.google.com/maps/contrib/105880257313790824899/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI5G84SEOOhwiBgEOx_bXe_SHpALqgNEwa6sBrjhVLeC_Bc5w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "My husband and I visited many preschools before deciding to enroll our daughter in Maplebear Jurong Lakeside. Despite being a relatively new school, the principal and teachers are experienced and professional. Beyond that, they are nurturing, patient and truly care about the children’s well-being and development. My daughter is rather shy and the staff did all they could to support her when she started school and helped her adapt quickly to the new environment. She really enjoys going to school now and returns to tell me excitedly about what she has learned in school. So grateful to have found Maplebear Jurong Lakeside and I feel assured every time I drop off my daughter that she will be in safe and capable hands.",
      "time": 1740539897,
      "translated": false
    },
    {
      "author_name": "Terry Giam",
      "author_url": "https://www.google.com/maps/contrib/107347519988668167401/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVaot_UgCbKGIYe-2pqK5QYOQ_pQslkUZJRM12itLTR2j_7J90=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "As real as it gets, we unknowingly registered our 5 months old baby to MapleBear Lakeside infant care because after a series of unfortunate events we are left with little choices.\n\nFortunately, the teachers, principal as well as the team at MapleBear Lakeside not only explain to us how well versed they are in this field, they even showed and proved to us that they are capable of handling our child, leaving us with a peace of mind to focus on our work and such.\n\nA big shoutout to Joelynn and her team for being super patient with us, explaining all the details and every questions that we asked.\nShe even go the extra mile to update us with all the necessary details even before we could ask about.\nThe team at MapleBear Lakeside showed me and my wife as well as our son that not only they care, but they also give their 101% as well as their heart and soul into taking care of our child as well as other infants/toddlers etc in the school.\n\nThey are super transparent during open house as well as during the orientation and also very detailed to all our request be it written or spoken directly to the teacher in charge.\nLeaving almost zero room for mistakes.\n\nMe and my wife can now trust on Joelynn and her team at MapleBear Lakeside to educate our son to be a better and a wholesome boy-to-be!\n\nThank you and we appreciate Joelynn and her team at MapleBear Lakeside! ❤️",
      "time": 1713360987,
      "translated": false
    },
    {
      "author_name": "nur s",
      "author_url": "https://www.google.com/maps/contrib/105220433988447035304/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL0cdG9JlOgLfWJZpmTczz-MkYWuUq8vUhJTfYu_dmKES7_AA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Our family is very fortunate to have discovered Maple Bear Lakeside at the start of the year. Nurturing staff, a clean and spacious facility, and a well-rounded curriculum - what more can a parent ask for in a center.\n\nThe teachers are patient and caring. Our daughter comes home daily telling us how much she loves the teachers, even those who do not teach her class. They are also very considerate, and more importantly careful when handing my daughter’s allergies. They proactively source for alternative ingredients and always check with us when in doubt,  so that my daughter can participate in the cookery lessons. Miss Joelynn, the center principal, leads by example and has been nothing but kind and helpful. When our daughter was first settling in, Ms Joelynn took the time and effort to make her feel safe, and constantly updated us on how she was doing to ease our worries. She takes any concern and feedback shared (few and far in between) seriously.\n\nThere are regular updates shared in the school app and we always look forward to the pictures/videos. The children are meaningfully engaged with the various themed activities/events. The weekly water/sand play sessions at the huge and green outdoor area are a bonus. The centre’s bilingual programme appears to be quite effective as our daughter has developed a keen interest in Mandarin, even though it is not our mother tongue.",
      "time": 1726030439,
      "translated": false
    },
    {
      "author_name": "Gwen Ng",
      "author_url": "https://www.google.com/maps/contrib/107895538507053493295/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJcJJsv5gQn9skVOYo4p0TWVoIimHnxbgDTtqPrnQne7v1hFg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "MapleBear Jurong Lakeside is a hidden GEM - throughout the process of enquiring > school tour > enrolment > attending school, they are 100% and even more! Being working parents, having found such a great IFC provider, is truly a blessing.\n\nDespite the short timeline for us to secure an IFC for our LO, we are very particular about the curriculum, safety, cleanliness, passionate educators (not just nannies like many other IFCs), MB Lakeside checked all our boxes. Our LO, from being shy from strangers to being a very sociable girl and her motor skills, language (albeit gibberish) skills, senses are developing really well. It also heartening to have edu-carers like Ms Joelynn (principal), Teacher Annie, Liang Laoshi, Xiao laoshi, Teacher Wan, etc ...who are there for her every step of the way. Their passion and love for all the students are heartfelt ♥️ To add on, the school is of a good size, large outdoor play area, really clean and comfortable for the children.\n\nAs our LO is sleeptrained, they also tried their best to cater to her schedule + habits and are patient to allow her to adapt in school, so it could be a seamless transition for her good night's sleep at home - we are sincerely grateful. The timely updates via the app, pictures n videos are also really appreciated. Lastly despite their really busy schedules, they must have put in extra hours before or after work to handmake teaching materials or even materials to celebrate occasions like mothers days n fathers day which is really going above and beyond.\n\nIf you're residing in the west and looking for a credible n trustworthy school for your LOs, I can say look no further, the school fees are absolutely justified.\n\nThank you 🍁 🐻  Lakeside, we can't thank you enough for the extraordinary work and support!",
      "time": 1721272485,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11359130870521710915",
  "user_ratings_total": 8,
  "vicinity": "21 Yung Ho Road, #02-01 The Agape, Singapore"
}