{
  "formatted_address": "407 Havelock Rd, #04-01, annex@furama 169634",
  "geometry": {
    "location": {
      "lat": 1.2878758,
      "lng": 103.8356664
    },
    "viewport": {
      "northeast": {
        "lat": 1.289280130291502,
        "lng": 103.8369970302915
      },
      "southwest": {
        "lat": 1.286582169708498,
        "lng": 103.8342990697085
      }
    }
  },
  "name": "MapleBear Havelock",
  "place_id": "ChIJzZiMtncZ2jERWE6KZRtRUJI",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "A K",
      "author_url": "https://www.google.com/maps/contrib/108862832903069389554/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLn1G1zEbwEX6nsVT0nLpUvvdWi63NZklFKNb_EVcT5jVvQdw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "We’ve had a fantastic experience at Maplebear Childcare, and I couldn’t be more grateful for the care my daughter has received. The huge indoor playground keeps kids active regardless of the weather, and the classrooms are bright and inviting with plenty of natural light. ✨\n\nThe facilities are always clean and well-maintained, which gives me peace of mind knowing my daughter is in a safe environment.\n\nMaplebear also offers an option for swimming lessons at the Furama Hotel pool, which is connected to the school. The outdoor garden at the hotel is another favorite. The music classes are professionally taught, and we look forward to see those cute music videos edited by Ms. Pam. 😆\n\nA huge shoutout to the wonderful teachers: Yan Lao Shi, Ms. Denissa, Ms. Roselle, Ms. Pam, Zhang Lao Shi, Ms. Pearlyn, Ms. Siti, and Ms. Audrey. 💯 They put so much effort into preparing engaging lessons, creating fun materials, and decorating for every holiday event—making the learning experience both nurturing and exciting.\n\nThank you to the entire Maplebear team for everything you do. We are so appreciative of the warm, creative, and safe environment you have created for our daughter! 🥰",
      "time": 1732584578,
      "translated": false
    },
    {
      "author_name": "Vincent Tham",
      "author_url": "https://www.google.com/maps/contrib/110814913782768097373/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLpMH2YR4A9iOUN9Cnp1A7WUi-aHqOrjSTaGXbb1WoLaRq17A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "We would like to express our heartfelt gratitude to MapleBear, Havelock and the dedicated team of teachers for the incredible care and guidance they have provided to our son over the past two years.\n\nOur journey to find the right childcare was not an easy one, as our son had previously attended two centres that underwent management changes which did not align with our expectations. As he was about to start K1, we knew we had to find a stable and nurturing environment for him, especially with primary school on the horizon. A trusted friend, whose three children attended MapleBear, Havelock highly recommended the centre to us—and it turned out to be one of the best decisions we’ve made.\n\nThe teachers at MapleBear, Havelock are attentive and patient, helping our son work through some areas of delayed growth while ensuring he feels supported and encouraged. They kept us updated on his progress, and it was heartwarming to see how he quickly grew to like and interact well with his teachers. The principal and centre director are hands-on, actively involved in teaching and shaping the children’s development, which speaks volumes about their dedication.\n\nWhile our son initially was afraid of one of the teachers due to her strict approach, we came to appreciate the importance of instilling discipline and preparing him for the transition to primary school. That balance of care and discipline has been invaluable in helping him grow into a confident and capable child, ready to take on the next stage of his education.\n\nAs our son graduates from K2, we look back with immense gratitude for the school’s unwavering efforts in nurturing him and providing such a positive experience. Thank you, MapleBear, Havelock for your exceptional work in shaping young minds and giving our child a strong foundation for his future! 😊",
      "time": 1734394907,
      "translated": false
    },
    {
      "author_name": "Gloria Ng",
      "author_url": "https://www.google.com/maps/contrib/109826684789348348210/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWSDNyPXejbD0ykaoqN_sji5wNoRRlSjVfxr20f_SaLgdv69BvC=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "We are incredibly happy with MapleBear Havelock. The principal, Miss Audrey, is very hands-on, always visible and engaged, which gives us a real sense of trust and security. The teachers are compassionate and dedicated, creating a nurturing environment where my child feels valued and excited to learn. She absolutely loves spending time with her friends and teachers, and we couldn't ask for a better place for her to grow and thrive.",
      "time": 1736251449,
      "translated": false
    },
    {
      "author_name": "Lorraine Pereira",
      "author_url": "https://www.google.com/maps/contrib/105584407009923277311/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLZuJSHTWMAYCkWWfhRx2i4LFBbba3PlWp828GeO3uNp7n2BA=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "5 months ago",
      "text": "Our experience at Maplebear has been great. The environment is warm and welcoming. The teachers and principal are compassionate and care about each child's development. My daughter loves going every day and has made significant strides in her social and emotional skills.\n\nThe communication between staff and parents are great with updates on my child's progress and any classroom activities.\n\nOverall very happy with the curriculum and development of my child.",
      "time": 1733193735,
      "translated": false
    },
    {
      "author_name": "Jade Griffin",
      "author_url": "https://www.google.com/maps/contrib/102564811245866932912/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUnJLT0SIZMMovxDyU5VOzHux2HbAT4R0qGYLjU82HextQ1QgGW=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Mrs. Audrey is an exceptional principal and a true gem at Maple Bear Havelock!! I wholeheartedly recommend her as someone you can trust to oversee your child’s wellbeing. Her standout qualities include her authenticity and her non-judgmental attitude, especially towards my unique journey as a single mom.\n\nWhat truly sets her apart is her dedication as she always takes time out to ensure that my daughter is progressing well in her learning. Mrs. Audrey’s genuine care ( and humour) make her an invaluable leader for both parents and children. Super grateful for all the help and support from you and the school in successfully graduating my daughter! Thank you so much",
      "time": 1733801260,
      "translated": false
    }
  ],
  "types": [
    "health",
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10543015905783860824",
  "user_ratings_total": 22,
  "vicinity": "407 Havelock Road, #04-01, annex@furama"
}