{
  "formatted_address": "Blk 50A Marine Ter, #01-289 Food Centre, Singapore 441050",
  "geometry": {
    "location": {
      "lat": 1.3056712,
      "lng": 103.915579
    },
    "viewport": {
      "northeast": {
        "lat": 1.307228930291502,
        "lng": 103.9169010302915
      },
      "southwest": {
        "lat": 1.304530969708498,
        "lng": 103.9142030697085
      }
    }
  },
  "name": "Marine Fish Soup and Porridge",
  "place_id": "ChIJH5MkWgcj2jERq-RnH5KC8qI",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Jeremy Yong",
      "author_url": "https://www.google.com/maps/contrib/117865972442313059844/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWGuIMf5cRXZCIMR2X12lVRwjW8guhzMfU3966pvpNy9UrXWiLS=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I recently had the pleasure of dining at Marine Terrace Congee, and I must say, it was a delightful experience from start to finish. The stall, named Marine Terrace Congee, #01-289, offers a wide range of delicious congee options that cater to different palates.\n\nDuring my visit, I opted for the Sliced Pork Congee, while my aunt enjoyed the Batang Fish Congee. Both dishes were exceptionally flavorful and exceeded our expectations. We even added extra meat portions and eggs, which elevated the overall taste even more!\n\nThe stall owner and her daughter, who serves as the cook, were both incredibly friendly and welcoming. Their warm demeanor added a personal touch to our dining experience and made us feel right at home. It's evident that they take great pride in their food and genuinely care about their customers' satisfaction.\n\nI highly recommend Marine Terrace Congee to anyone seeking a comforting and flavorsome congee experience. Their menu has something for everyone! Visit this hawker stall and indulge in their mouthwatering dishes—you won't be disappointed!\n\nThank you, Marine Terrace Congee. We look forward to returning soon.\n\n⭐⭐⭐⭐⭐",
      "time": 1685600149,
      "translated": false
    },
    {
      "author_name": "George Mui",
      "author_url": "https://www.google.com/maps/contrib/101440658094773891245/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXyYLO55-SeFedTgMVqL9UdaPweLgzgtxuogsxgitjvLcALBMsg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "It was unfortunate that I did not manage to try their fish porridge as it was sold out by evening due to its high demand. What I managed to try was their traditional seafood soup which was savoury and had very fresh juicy prawns. The soup did not have any traces of MSG and tastes natural. I heard that their porridge tastes special and not your standard fare porridge. My family and I also thoroughly enjoyed their fish and sambal stingray which were fresh and had tender flesh. The sambal chilli sauce complements and enhances the overall flavour of these seafood. Hope to try their fish porridge in the near future.\n\nUpdate: 6 Dec 2020. They have changed their stall front signage and revamped their menu to include an array of porridges, including oyster porridge. Their oysters are fresh and palatable. The consistency of their porridge is very smooth and easy on the tastebuds. Definitely worth a try.",
      "time": 1607229234,
      "translated": false
    },
    {
      "author_name": "Blackraven",
      "author_url": "https://www.google.com/maps/contrib/114385515451710838076/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXqctQ7jglxaOLANFQWOxhRwei1zo_uXlcIsm-EaC0KcTMg774f=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Just discovered a hidden gem in this busy hawker centre, found out that it’s been here since 2019! The stall name is “Marine Terrace Congee”, and its congee tastes really good!",
      "time": 1666756532,
      "translated": false
    },
    {
      "author_name": "HuyenLy Nguyễn",
      "author_url": "https://www.google.com/maps/contrib/112662903049952941403/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV62SQfteFtJq_xsD-m8wE9gBRmTkWzUvN3vK-_KpKOvn0oatM=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Wonderful soup and porridge option in the neighbourhood. I absolutely love their oyster porridge: smooth, tasty and nutritious. The fish soup is in the clear soup style and nice too. They use all fresh and premium ingredients for all their dishes. Nice auntie and uncle at the stall, auntie always wears sporty clothes - very cool.\n\nThe neighbourhood obviously love this stall with long queue every day, especially in the morning, so prepare to wait 10-15 mins for the order.\n\nUpdate: By Jan 2022, the stall has been closed for months, though the signboard is still there. Hope they'll be back and re-open the stall soon.",
      "time": 1641483617,
      "translated": false
    },
    {
      "author_name": "Sofina Ng",
      "author_url": "https://www.google.com/maps/contrib/102023261487696362856/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLkAtznhlETO7h2mlES_Gm7j2Sz6qqwSAaW_BsS71kWrsKBy_I=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Had their oyster congee and sliced fish congee today. The oyster congee is a must order! Oysters are so plump and juicy that I slurped them all up in no time 😚 we added minced pork to our porridge because we love how the minced pork here tastes. I’m not sure how to describe it, but give it a try if you like pork porridge! It is my third visit and the ingredients taste consistently fresh. Great place to have breakfast/brunch before/after visiting ECP! Take note that they sell out pretty early - they were sold out at around 10.15am today, so come early to not be disappointed! 👍🏼",
      "time": 1682822594,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11741590742612042923",
  "user_ratings_total": 24,
  "vicinity": "Blk 50A Marine Terrace, #01-289 Food Centre"
}