{
  "formatted_address": "10 Bayfront Ave, B1-67 The Shoppes, Marina Bay Sands, Singapore 018956",
  "geometry": {
    "location": {
      "lat": 1.2837869,
      "lng": 103.8591171
    },
    "viewport": {
      "northeast": {
        "lat": 1.285317130291502,
        "lng": 103.86115775
      },
      "southwest": {
        "lat": 1.282619169708498,
        "lng": 103.85823635
      }
    }
  },
  "name": "MARQUEE Singapore",
  "place_id": "ChIJs7z7vNsZ2jERh9cyPNNLFiQ",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Ram Pravin Kumar",
      "author_url": "https://www.google.com/maps/contrib/111555649190361953466/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVCDfZB61kUX-v8I7BrE-kaZVl658jEcDtDIpeyIRAf9lRqu6i5=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Marquee is hands down the best club in Singapore! The ambience is top-notch and the music is always on point. I had the absolute pleasure of visiting on Marshmello night, and it turned out to be the best night of my life. The energy was unreal, the crowd was vibing, and Marshmello absolutely nailed it. Can’t wait to go back!",
      "time": 1744970345,
      "translated": false
    },
    {
      "author_name": "Sebastian Richard",
      "author_url": "https://www.google.com/maps/contrib/107352363332958754336/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIK_YajwCT9zLM1pe3vXNROqpdnhiibPPANSuQC08Z8Kg0Umw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "FIVE FULL STARS! Music is sick! I’ve went to Marquee at least more than 10 times and they have never disappoint me! I’ve even celebrated my birthday last year there!\n\nService is definitely better than other clubs! Even if you don’t open table their service is still not horrible! Bouncers are also not rude unlike other clubs!\n\nOnly club in Singapore with Ferris wheel and slide for you have a great time! Guest dj comes once in a while to spin too!\n\nI’m going for their 6th anniversary where Dimitri will be spinning! Totally looking forward!",
      "time": 1745220875,
      "translated": false
    },
    {
      "author_name": "Neera",
      "author_url": "https://www.google.com/maps/contrib/112290638685596332624/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKTt3L3wleRQ8J-GV07mzXhg2NEO6rOiI3hIPt7FmMYHcz7bg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "i have been to Marquee multiple times and i always have so much fun with my friends! From the amazing visuals, fun atmosphere and attentive security, its a must to visit Marquee. Especially Danish, who always greets people with a smile and make us feel welcomed. The bartender was quick to attend to us as well despite the large crowd.",
      "time": 1744811182,
      "translated": false
    },
    {
      "author_name": "Laura Nicholson",
      "author_url": "https://www.google.com/maps/contrib/114914131344581373440/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXNzgn40dkChvpakiur7RckXVBpwLAHdvjGlimU_dLkp2Zuhl-a=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "MARQUEE is THE night out in Singapore.\n\nThis country has so many amazing things to see and do  - but if you are looking for a nightclub look no further on this planet.\n\nMARQUEE truly has it all - from the best music, to guest performances, light shows, indoor slides, Ferris wheels and the absolute best vibes - I’m telling you do not skip this place.",
      "time": 1744370065,
      "translated": false
    },
    {
      "author_name": "C",
      "author_url": "https://www.google.com/maps/contrib/108121427451405924195/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUVEFBMqVdde84YgM7RmJUjTlK2YyphjppNJiT0NgrZFZyAG6RYYA=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "MARQUEE Singapore is one of the most iconic nightclubs in the region, bringing a blend of scale, spectacle, and sound to the heart of Marina Bay Sands. Spanning over 2,300 square meters with soaring ceilings and state-of-the-art lighting, it’s designed to deliver an unforgettable nightlife experience.\n\nThe club stands out for its unique attractions: an eight-armed Ferris wheel with photo booths in each pod offers panoramic views of the dance floor, while a three-story spiral slide adds a playful, adventurous twist to the night. MARQUEE also regularly hosts top-tier international DJs and performers — names like Steve Aoki and Afrojack have headlined here, bringing global energy to the decks.\n\nI attended MARQUEE’s 6th Anniversary featuring Dimitri Vegas and it was absolutely amazing. The energy was electric, the crowd was buzzing, and the production was next-level. Dimitri Vegas had the whole place jumping from start to finish. Pro tip: get there before 11pm if you don’t have a reservation — it helps beat the queue and secure a good spot near the stage.\n\nWhile it didn’t make the Nightlife Association’s Top 100 list last year, MARQUEE remains one of the most talked-about venues in the world — bold, immersive, and built for a big night out.",
      "time": 1744440016,
      "translated": false
    }
  ],
  "types": [
    "night_club",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2600349205473187719",
  "user_ratings_total": 1007,
  "vicinity": "10 Bayfront Avenue, B1-67 The Shoppes, Marina Bay Sands"
}