{
  "formatted_address": "2 Lewis Rd, Singapore 258590",
  "geometry": {
    "location": {
      "lat": 1.3207225,
      "lng": 103.8225769
    },
    "viewport": {
      "northeast": {
        "lat": 1.322168880291502,
        "lng": 103.8239656302915
      },
      "southwest": {
        "lat": 1.319470919708498,
        "lng": 103.8212676697085
      }
    }
  },
  "name": "Masjid Ba'alwie",
  "place_id": "ChIJXYPHlfgZ2jERe5AveQeC7_0",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "sgsalih2008",
      "author_url": "https://www.google.com/maps/contrib/108543164644721223823/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLRgGF6HL92V1QE3OgSTCmrf1zZEi8tbAXxEgAbB21vZdVDhA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "MashaAllah, it was really a nice experience visiting Masjid Ba’alwie and delighted by the warm hosting of Imam Sayed Hasan Bin Muhammad Al-Attas. He showed us all the artefacts collections of the masjid and explained us the history of the masjid. And we had a delicious iftar with other invitees of Imam. Love to visit this masjid again InshaAllah.",
      "time": 1742101128,
      "translated": false
    },
    {
      "author_name": "Noor Aufa Shiddiq",
      "author_url": "https://www.google.com/maps/contrib/107593909707887597236/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVwEv_7_D2Uugs7Pd97pAd7D4lv2YIY6AgYjT9hGcnKQPLejemR=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "there is a mini museum. visitors can lay down / take a nap. there is also shower room. Wow nice.",
      "time": 1739332489,
      "translated": false
    },
    {
      "author_name": "Jasim uddin",
      "author_url": "https://www.google.com/maps/contrib/102739945804248884111/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU_ZkQLqIW0ule77tSPywA0r-JZA9ltFWegCkQzbHtxgGNfW3hh=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Very nice and old mosque.\nBuilt in 1952 by a prominent and well-respected imam from the Alatas family, this old generation masjid has served the needs of university undergraduates in Bukit Timah before the campus was relocated to Kent Ridge. Today, the one-storey masjid, which is located in the Central, can accommodate up to 400 worshippers for daily and Friday prayers. It is also crowded during Hari Raya prayers. On Thursday evenings, many Muslims gather for recitation of praises to Allah.\n\nHow to get there?\nBus Services:\n171, 67, 700, 700, 77, 851, 852, 960, 961, 970, 980\nNearest MRT Station:\nNEWTON",
      "time": 1738568697,
      "translated": false
    },
    {
      "author_name": "Suhail Ahmed",
      "author_url": "https://www.google.com/maps/contrib/106299231867709696747/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWELIg1nG7JW9efGNGdor5DQq7lrniydELw34DqVQCL_FiSaanPCg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Masjid Ba'alwie, with its integrated museum, offers a unique and enriching experience for visitors interested in Islamic history, culture, and heritage. Nestled within the serene ambiance of the mosque premises, the museum provides insights into the rich tapestry of Islamic traditions and contributions.\n\nThe museum showcases a diverse collection of artifacts, manuscripts, and exhibits that highlight the cultural and religious significance of Islam. From ancient manuscripts and calligraphy to historical artifacts and religious relics, each display offers a glimpse into the rich history and heritage of the Islamic world.\n\nOne of the standout features of Masjid Ba'alwie's museum is its interactive exhibits and multimedia presentations, which engage visitors of all ages and backgrounds. Through immersive experiences and informative displays, visitors can deepen their understanding of Islamic art, architecture, and spirituality.\n\nIn addition to its cultural and educational value, the museum also serves as a place of reflection and contemplation for worshippers and visitors alike. The serene ambiance of the mosque surroundings enhances the spiritual experience, allowing visitors to connect with their faith and heritage on a deeper level.\n\nOverall, Masjid Ba'alwie's integrated museum is a testament to the enduring legacy of Islam and its contributions to humanity. Whether exploring the exhibits, participating in educational programs, or simply enjoying the tranquil atmosphere, visitors are sure to find inspiration and enlightenment within the walls of this exceptional cultural institution.",
      "time": 1709782725,
      "translated": false
    },
    {
      "author_name": "Elisha Md",
      "author_url": "https://www.google.com/maps/contrib/100870155576755395799/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJvqf0KRwvXIly8P0L2HnwbIrDi5Cpg7lBJiIZ8GWCeGOMBOw=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "3 months ago",
      "text": "Went in specially to meet Habib as having great disturbance, Things dropped for no reasons hv not been cooking for months ,all in house shattered by itself,few ustaz & perawat came by far still no diff,When told Habib Hassan of something his name unsure,\nhe just took things lightly ,the way he put it was so wrong he did not emphatized.\n\nThat's why we were told not to rely on human,Me & Family believed in Allah s w.b.r of coz,\njust trying luck, with Allah's permissible, This Habib told us stuff drop daily ,anywhere !???\n\nSeriously???\nIn the mosque while waiting the chair fell ,he\nis just another guy in white and talking tru his S this old fart!\nUtterly a disappointment. After the visit from the mosque  a jar of jam smashed in the supermarket  hit my sis' hand n feet,So now\n\nis this normal ,Habib? A so called Habib ,pls don't waste ur time guys ,we ask from Allah for a Good way out !Aminx3 Ya Rabb.\nI saw a guy walked away aft queueing too\nAft a few seconds liasing with the so Called Habib,and the way he utter doa like ,unconvincing too.,a swift and super short\nWell only he knows, what can I say.",
      "time": 1737689032,
      "translated": false
    }
  ],
  "types": [
    "mosque",
    "place_of_worship",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=18297986779639156859",
  "user_ratings_total": 404,
  "vicinity": "2 Lewis Road"
}