{
  "formatted_address": "8 Chu Lin Rd, Singapore 669898",
  "geometry": {
    "location": {
      "lat": 1.3578458,
      "lng": 103.7599737
    },
    "viewport": {
      "northeast": {
        "lat": 1.359149380291502,
        "lng": 103.7613227302915
      },
      "southwest": {
        "lat": 1.356451419708498,
        "lng": 103.7586247697085
      }
    }
  },
  "name": "Masterminds Montessori Hillview",
  "place_id": "ChIJsz7OKUkQ2jERkjmP0Z_9ulc",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Kwok Amanda",
      "author_url": "https://www.google.com/maps/contrib/109687514411917564172/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWOkl8D8yOUXruD61ILAORxhFXlNAMs787vy5A6AuUQr6IoqGyVAA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "4 years ago, when I was searching for a childcare around the vicinity, Masterminds Montessori Hillview was the most ideal choice for my family. 4 years down the road, I have all my 3 kids still attending the same childcare.\n\nMasterminds Montessori is a great place to be in and the environment is lively and welcoming. The teachers and principal are all dedicated to their job and treat every child with love and care. They are approachable too should we have any concerns.\n\nI like that we receive regular updates on our children’s progress and I look forward to seeing their learning and growth through their Biannual portfolios. In addition, the teachers will also share monthly curriculum web, so that we are aware what the kids are learning in school.\n\nIn November 2024, Masterminds also had a year end graduation concert performance and all the kids had put up a good show! Thank you to the wonderful teachers for guiding and teaching them patiently. We enjoyed it very much!",
      "time": 1733807502,
      "translated": false
    },
    {
      "author_name": "Sandra Bozic Koduru",
      "author_url": "https://www.google.com/maps/contrib/114012538219963691598/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIxljZm1_oUE8Be9mQz-v578bDtur8rlCk9yLpTSrm0gaYomg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Our daughter started last January 24 in N1. After a year in the school, we made the right decision. She is happy every single day to be with her friends and teachers.\n\nThe director, the principal and the teachers, who are working at Masterminds for many years, are so dedicated to provide a loving, welcoming, safe, caring and fun environment for our children. They are very approachable and open to discussion about our concerns.\n\nThe curriculum is well communicated to the parents every months to help and continue the learning at home. Each festivals, organised with lots of efforts, are celebrated with a lot of care and joy.\n\nThe environment is clean, well organised, safe. The facilities, learning material and toys are great and well maintained to spend a beautiful day in school. The meals are cooked in the school and healthy (and delicious according to my daughter).\n\nThe highlight this year was the graduation show. A fantastic concert was organised by the team. From the costumes to the songs, dances, decor, everything was magical and my daughter enjoyed it so much. I was impressed by the performances and the dedication of the children, even at a young age.\n\nI highly recommend the school for your little one.",
      "time": 1734668202,
      "translated": false
    },
    {
      "author_name": "Ravinder Singh",
      "author_url": "https://www.google.com/maps/contrib/104504489287707475550/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV2l0p_DBTT5UBim61zIxtj4TnBes-3Q1nzbDqAyL4X689Bgt8m=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "Masterminds Montessori is a good preschool. It has provided my son with exceptional support throughout his nearly three-year enrollment. The teaching staff is highly approachable, dedicated, and committed to fostering a nurturing learning environment.",
      "time": 1720578890,
      "translated": false
    },
    {
      "author_name": "milan saxena",
      "author_url": "https://www.google.com/maps/contrib/110965225919878082102/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX_JDP5ve0Cpc4Z1FJP4AhfGhYxGz89qFAr95I7N4cX5qIFLhsE2Q=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "We are quite happy and satisfied with Mastermind Montessori preschool having taken care of both our kids especially due to its great teacher student ratio, kind and loving environment and personal focus on every child. They have stable group of teachers who are efficient educators whom kids love and adore. Highly recommend it ...",
      "time": 1719894665,
      "translated": false
    },
    {
      "author_name": "Ligia Marcela Tarazona Alvarado",
      "author_url": "https://www.google.com/maps/contrib/111255996237850398296/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXKNk49RoJDBDKOBY7_nD_xpHX3qvLPU3GzRihzGbNhCToenovT=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "10 months ago",
      "text": "Kindergarten Masterminds is a wonderful place to begin the school journey. The environment is warm and welcoming, providing a great foundation for young learners. The staff consists of highly skilled professionals who are dedicated to the development and well-being of each child. Parents can feel confident that their children are in good hands at Kindergarten Masterminds.",
      "time": 1719908289,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6321643889825364370",
  "user_ratings_total": 13,
  "vicinity": "8 Chu Lin Road"
}