{
  "formatted_address": "160 Robinson Rd, #14-04, Singapore 068914",
  "geometry": {
    "location": {
      "lat": 1.2784077,
      "lng": 103.8477835
    },
    "viewport": {
      "northeast": {
        "lat": 1.279712130291502,
        "lng": 103.8492180802915
      },
      "southwest": {
        "lat": 1.277014169708498,
        "lng": 103.8465201197085
      }
    }
  },
  "name": "Math Coffee - Secondary School Math Tuition",
  "place_id": "ChIJQUuh1cYW2jERX3Y4uK1Xoao",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Evelyn Fong",
      "author_url": "https://www.google.com/maps/contrib/117914046086781083372/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLw5dg780DVtdTJo7IULP7DcdDdL48tIU4V8ITbzfsgNPYgUw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Both my children were enrolled for Teacher Kangie’s A Math Classes.\nMy girl Jewel is currently in JC1 and was able to score consistently over 90 for her A Math confidently when she was under the tutorship of Teacher Kangie for her entire Sec 4.\nMy son Joshua is currently in Sec 3 and  has been enrolled in her class since Sec 2. Similarly, he has been a me to tackle his Maths qns confidently ever since he joined her class. Teacher Kangie is firm and ensures the students take ownership and do their homework. The setting is ideal for them as they can solidify their foundation and progress from where they are. They could also approach her whenever they faced challenging qns during their own revision.",
      "time": 1741182679,
      "translated": false
    },
    {
      "author_name": "shirley tan",
      "author_url": "https://www.google.com/maps/contrib/103685138078760078004/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXoa0JIgImVOKEHnaArjw83EdgzSFjCyRp5JI2NxUiDnJL0ikw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I am extremely grateful to Math Coffee for the amazing support they’ve provided my daughter, Ashley. Ashley had been struggling with Math since Sec 1 and was even failing, which caused a lot of anxiety. In Sec 3, I decided to enroll her in Math tuition, and thanks to Teacher Kangie, everything changed for the better.\n\nTeacher Kangie took the time to understand Ashley’s background and her anxiety issues. What stood out the most was her patience, kindness, and ability to create a safe and encouraging environment for Ashley to learn. Teacher Kangie was able to make each session engaging and productive while still being firm in ensuring no nonsense was tolerated.\n\nWhat truly touched me was how Ashley started to open up and express how much she liked Teacher Kangie. It’s a huge transformation, especially since Math had always been a subject Ashley dreaded. Thanks to Teacher Kangie’s dedication, Ashley not only overcame her anxiety but also managed to pass her O-Level Math last year – a huge milestone for someone who had never passed Math before.\n\nI am forever thankful for Teacher Kangie’s guidance and approach, which made all the difference in Ashley’s Math journey. I highly recommend Teacher Kangie and Math Coffee to anyone looking for help with Math – they truly care about their students and their success!",
      "time": 1742187183,
      "translated": false
    },
    {
      "author_name": "Weebling Here",
      "author_url": "https://www.google.com/maps/contrib/116109864317761673027/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVpCLBbF235s7DLPLsq5MrIcHed61goIAGWSfIer6l1xsyRN9o=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Tuition with teacher Kangie was very helpful, she has really helped to scope out all my weaknesses in both A math and E math, ensuring that I fully understand the concept before moving on to a more challenging problem. The way teacher Kangie plans my homework also helps me to keep track of my progress in both maths, and it made me feel like I was improving with every lesson. I’m quite glad to achieve As for both maths! :)",
      "time": 1736920664,
      "translated": false
    },
    {
      "author_name": "Charlotte Fong",
      "author_url": "https://www.google.com/maps/contrib/100751116797555076254/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX5sVodMM7awTAuBJ4pL2NCf-RAFZSQLmSkytuTq-96cS2W1dD_=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Teacher Kangie has changed my perspective of online learning. Not only is it engaging, the teaching methods are customised to the individual and my son has benefited tremendously from this independent learning style. It forces him to be responsible and takes charge for his own successes. Highly recommended!",
      "time": 1737021567,
      "translated": false
    },
    {
      "author_name": "Sharon Chen",
      "author_url": "https://www.google.com/maps/contrib/100416000555540654928/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLrhd7CjlPmvvdEH73sxPMrak9iqVH5vr1wYhYSKlpsYhhsEw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "My son Math result improved alot after with teacher Kangie for just 3 month. Her explanation was clear and easy to understand. My son enjoys attending her class.",
      "time": 1739784918,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12295204861329831519",
  "user_ratings_total": 58,
  "vicinity": "160 Robinson Road, #14-04"
}