{
  "formatted_address": "Blk 152A Bedok S Rd, Singapore 461152",
  "geometry": {
    "location": {
      "lat": 1.3179399,
      "lng": 103.9476757
    },
    "viewport": {
      "northeast": {
        "lat": 1.319376680291502,
        "lng": 103.9491868802915
      },
      "southwest": {
        "lat": 1.316678719708498,
        "lng": 103.9464889197085
      }
    }
  },
  "name": "MATHGICS",
  "place_id": "ChIJTzbWHNIj2jER6t8I54SvMEA",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Liyi Liu",
      "author_url": "https://www.google.com/maps/contrib/104437533327143326442/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK0v2JK0d-E76IAiocgFU8xyPyF7pK1ndqiC_lkhEVkN5GtAw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "After being with Teacher Desmond for the past  two years of my O level journey, I would say it is really unforgettable and life changing process.\n\nRemember the first time I have lesson with Teacher Desmond , I thought he would be the same as rest of the tuition teacher out there who only teach and rush off the lesson, but turn out I was wrong. He is a teacher who not only  cares about the student  academically but also their personality. During lesson time, he  will not only teach  but at the same time observe my facial expression to ensure that the I really understands the lesson. And if I don’t,  Teacher Desmond  would explain to me over and over again patiently, just to make sure that I fully understood before he would proceed to the next part of the lesson.\n\nTeacher Desmond teaching is also fascinating , He would  “break “ the chapter in to pieces and teach the students according to their learning abilities. I am a slow learner and some lessons I just can’t understand when I was in school which make my learning difficult and failing my school exam horribly, but after having lessons with him, my learning much more easier and I don’t have to struggle in class or fail my exam like I used to, as he would explain to me in another ways to make it simple for me which make the learning process less suffocating and stressful.\n\nBesides, Teacher Desmond’ s wonderful teaching skills , he also taught me many important lessons about my life and even change me into better person. During the two years, he spotted many of the mistakes that I made which slow down my learning process, and one of which was me having, procrastination. I tried to quit this habit many times but it didn’t seems to be like a bubble gum sticking to me, even me myself feels like giving up and just rot, but after he never and  talk to me, trying to helping me at the same time, this gum start to loss it’s sticky and I have more freedom and have clearer mind to focus on my studies.\n\nAnd now I have finish my O level, time really flies, flashing back the two years, without Teacher Desmond  I am sure I will never cannot make it, with all the things I learned from him and being a better of myself. Last but not least, I really appreciate the efforts he had put in for me, thank you Teacher Desmond!",
      "time": 1735717064,
      "translated": false
    },
    {
      "author_name": "Roz",
      "author_url": "https://www.google.com/maps/contrib/118081784576252957490/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWQcBC6BAh7aw9-_pYK-d4e8wFsuocE1r6oFBNJgaYmG5_Ikcsw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Desmond came to us by accident, when the original tutor we engaged was unable to continue due to ? reasons. So naturally, we were a little 'sus' about him, because we knew nothing about him other than what the other tutor said. In any case, we were already quite despondent due to our daughter's poor academic performance.\n\nWhat really struck us about Desmond was how willing he was to connect with our child beyond just tutoring her. He took the time to listen and talk to her, and in turn, also ended up 'counselling' us on how to better support her. In fact, he even attended her PTM session together with us because he wanted to find out more about her struggles at school. He was firm, held our daughter accountable for her schoolwork and learning but also very kind and generous with his time and treats for the whole family.\n\nDesmond was a great mentor for our daughter, in ways that we, as busy parents, sometimes could not be. Somehow, he also brought the family closer together, and honestly, how many of us can say that about a MATH TUTOR? She made good progress under his tutelage (but really, it was a TEAM EFFORT).\n\nSometimes when you have a good thing, you want to keep it to yourself...but we cannot recommend Desmond enough. Thank you for being there for us during a challenging time!",
      "time": 1705751152,
      "translated": false
    },
    {
      "author_name": "Mum Ng",
      "author_url": "https://www.google.com/maps/contrib/106479925851951012990/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIN546DWYAiz3nEMx51wSsm9e0ByMV3lGbC0rGS18avGE0eAg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "I sent my daughter to MATHGICS, and absolutely love how patient and knowledgeable Desmond is! The environment is also very ideal for learning, very clean, organised and comfortable.\n\nDefinitely recommending MATHGICS to my friends who are looking for an experienced Mathematics and Science tutor👍🏼💯",
      "time": 1675949793,
      "translated": false
    },
    {
      "author_name": "dingding",
      "author_url": "https://www.google.com/maps/contrib/112702629782795547519/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUj952C5lzteRdvAkz2sNyJr7i_5SyoHNcxL0SG7qQHqXq3GPSt=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Mr Desmond is really good and patient teacher , he is not only teaching my son how to focus on his weakness and improve on it , and also help to build up his confidence level to do better in his subjects . His preliminary result for both science and math got AL3, for PSLE , he got AL 1 for math and AL2 for science. Total he got AL 6 D to have good chance to go for his dream school . Really appreciated Teacher Desmond’s effort on my son , highly recommended his teaching 👍👍👍",
      "time": 1669205951,
      "translated": false
    },
    {
      "author_name": "Ng Irene",
      "author_url": "https://www.google.com/maps/contrib/104852068204610697351/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJlW1oGA_gGj38YOPm1m7De63ZEQWompxfCSfe6i2hqznscIw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "My daughter has fallen behind in her Mathematics and Chemistry.\nWith Desmond’s guidance, my daughter has been making great progress and now she is more confident in these subjects.\nHe is very dedicated and efficient as well as patient towards my daughter.\nI’m so grateful that I have Desmond as her tutor. His expertise in teaching has put my mind at ease.\n\nThank you so much...\n\nHighly Recommended!",
      "time": 1675767305,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4625389802656161770",
  "user_ratings_total": 8,
  "vicinity": "Blk 152A Bedok South Road"
}