{
  "formatted_address": "4 Queen's Rd, Singapore 260004",
  "geometry": {
    "location": {
      "lat": 1.3188648,
      "lng": 103.8080396
    },
    "viewport": {
      "northeast": {
        "lat": 1.320399730291502,
        "lng": 103.8095215802915
      },
      "southwest": {
        "lat": 1.317701769708498,
        "lng": 103.8068236197085
      }
    }
  },
  "name": "Math Mavens Bukit Timah (HQ)",
  "place_id": "ChIJT7csug8a2jERuxJmldaX6lw",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Florence Neo",
      "author_url": "https://www.google.com/maps/contrib/113921523026502872906/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJdm0cJkJIQDypHODL7bU3CRZFPmYAJNaHz5khN4SY4eh5Oig=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "We had an excellent experience with Mr Wong as our son’s math teacher. He has a remarkable ability to explain complex math concepts in a simple, clear and concise manner that is easy for students to learn and understand.\nOne standout aspect of his teaching style is how he keeps students on their toes by calling on them to answer questions. This approach ensures that students remain attentive and actively participate in the lesson. My son attended the online lessons and found them both enjoyable and highly effective.\nMr Wong's dedication is evident as he regularly checks on the progress of his students. He will find out how my son has performed in his tests and prelims and will do a thorough analysis of the mistakes my son has made in his papers. I highly recommend Mr Wong to anyone looking for a dedicated and talented math teacher who can make learning math easy and exciting.",
      "time": 1735391870,
      "translated": false
    },
    {
      "author_name": "Ruth Zheng",
      "author_url": "https://www.google.com/maps/contrib/109278203842523166267/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKi84WY7GBNe1Fdxk6qXH-yPywbmsZpGJT8bYXrRX0ztFqGDA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "My son has been with Mrs. Lum at MM since Primary 5. Back in Primary 4, his math grades had dropped to around AL4-5. A good friend, whose three children all studied with MM, highly recommended their teaching methods. Encouraged by her glowing reviews, I decided to enroll my son. He thoroughly enjoyed the classes, and within six months, his results improved significantly.\n\nThe systematic teaching methods, regular practices, and well-structured mock exams at MM were instrumental in his progress. I have since recommended MM to many of my friends with children in primary school.\n\nI’m thrilled to share that my son achieved an AL1 for math in the PSLE, and I strongly believe MM played a crucial role in this success.",
      "time": 1735535979,
      "translated": false
    },
    {
      "author_name": "Estella Soh",
      "author_url": "https://www.google.com/maps/contrib/115459010280472111297/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ-xPOEM0EQov1UjIwbVzvegHP4LyguwqNx6a7mKsNDWED93w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "We are certainly happy with the progress that our child has made under Mr Wong, the teaching was clear, help is readily available and we agree with all that has been done. The format of each lesson where past concepts are constantly revised, new concepts are introduced and regular practice is provided in the form of tests and drills is exemplary, especially when it also doesn’t feel rushed. The worksheets are well planned  and provide for easy revision. Mock exams are helpful. Another great practice is the availability of both physical and online lessons where the child does not need to travel and can remain in the comfort of their home. That is a real winner. Great thought has been put in every part of the teaching process, including the holiday arrangements and rescheduling of classes due to the exam dates. Struggling with Math since P4, our child performed very well for PSLE after joining Math Maven for Semester 2 in P5, the turn-around observable at the P5 year end exams.",
      "time": 1732090866,
      "translated": false
    },
    {
      "author_name": "xiaowei wei",
      "author_url": "https://www.google.com/maps/contrib/110540855043905980034/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLISR4zjh5MIzbuLbURkverOQFkABvXnTl4rP3GKIbd1IDCAg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "My daughter started her math journey at the Bukit Timah campus at the end of Term 2 in P5 and achieved good results in P5 SA2, P6 Prelim and PSLE. Mr. Wong, who taught her, is a very patient and responsible teacher. He teaches each child in accordance with their aptitude, often encourages children, and keeps in touch with parents at any time. After each class, no matter how late it is, Mr. Wong will complete the homework revision of the previous class with each child. My daughter has benefited a lot here. After a few months, her class was upgraded from the normal class in the school to the fast class. And her grades have been stabled at AL1 in Grade 6.\n\nThe course arrangement here is relatively flexible. If you are unable to attend the class on the same day due to illness or other reasons, you can switch to another class within a week to make up for the class or communicate with the teacher in charge of the class and change to Zoom class on the same day. The holiday course is also very flexible. The course in June is module mode. As long as you complete three (P5) or four (P6) face-to-face or online courses in your own time, it will not affect your travel at all. There will be a holiday in December. There will be mock exams in grades 5 and 6, which are very formal, and the questions are a bit difficult. My daughter did not get high scores in the mock exams, but it will not affect her school's test results.\n\nIn the first few months, there were many mistakes in her homework (careless or don’t know how to do it), so the lesson learned is that if she started earlier, my daughter’s basic math skills would be more solid. As a parent, I basically don’t have to worry about math after a few months, and I am very grateful. For my daughter, P6 left only careless mistakes and less questions cannot be answered due to don’t know how to do it.\n\nAnd interestingly, although Olympiad math questions are not formally taught here, and my daughter has never studied Olympiad math specifically, she completed several Olympiad-related questions in the pre-Sec 1 exam. Of course, she got all the basic questions and difficult questions in primary school correct in this exam. This 1.5 year should have laid a good foundation for her math and trained her ability to learn independently. Thank you.",
      "time": 1735469779,
      "translated": false
    },
    {
      "author_name": "LC Tan",
      "author_url": "https://www.google.com/maps/contrib/101847920214091796968/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLlvJYTg-hzn_vJ9Ou1XOKeBzB5fiILcMn50haTKyTo22Rh=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "We love Math Mavens. Both the teaching and admin teams are great. Our experience with them has been pleasant from beginning to end. We only have praises for them. Have tried a few teachers (replacement classes) and my daughter had only positive feedback for each and everyone of them. The admin is very helpful, efficient and professional. They even arranged to mail the last bit of marked materials to us. We leave Math Mavens with a heavy heart. We hope to return eventually when our schedule is freed up.",
      "time": 1726735850,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6695330743924953787",
  "user_ratings_total": 64,
  "vicinity": "4 Queen's Road"
}