{
  "formatted_address": "Blk 433 Clementi Ave 3, #01-250, Singapore 120433",
  "geometry": {
    "location": {
      "lat": 1.3140171,
      "lng": 103.7618194
    },
    "viewport": {
      "northeast": {
        "lat": 1.315407230291502,
        "lng": 103.7630732802915
      },
      "southwest": {
        "lat": 1.312709269708498,
        "lng": 103.7603753197085
      }
    }
  },
  "name": "Matt's Education",
  "place_id": "ChIJMTw2chob2jERXS3mun-wb5U",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Clara Chua",
      "author_url": "https://www.google.com/maps/contrib/100379857370146560862/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIrgOOIJc9M3Unagw9nWjh-vwtoCKyuFWSEuqIxPjiXrXsqV2M6=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "i’ve always thought that i’ll never be good at mathematics nor find it easy and interesting until i joined matt’s education. i’ve been a student with them for the past 3 years (almost 4 years) and it has been an amazing journey with my teachers at matt’s education. because of my teachers’ patience and dedication into helping me to improve, it made me motivated and worked even harder to get where i am today. i received my N level results yesterday, and got an A (grade 1) for my math along with a B (grade 3) for my english. nothing can describe how grateful i am for the teachers here. parents and/or students, i highly recommend to join this tuition center to kickstart their learning and improve on their weaknesses in a subject/subjects. ☺️",
      "time": 1734432983,
      "translated": false
    },
    {
      "author_name": "Buranda Mok",
      "author_url": "https://www.google.com/maps/contrib/118186945171631585339/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVUwGiyJ9_YBe4LmV95xNlTdaaNGTOASQ-bRbESRBk5cUEM4SLh=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "I had the privilege of being tutored by Matthew Lim for A and E Maths. I can confidently say that he was the best teacher I had during my schooling days. His ability to break down difficult mathematical concepts made learning enjoyable and engaging. He was patient, approachable, and always willing to go the extra mile to ensure his students grasped the material.\n\nHighly recommend Matt's Education, the quality of teaching here is top-notch, helping me to score A1 for E Math and A2 for A Maths.",
      "time": 1726113712,
      "translated": false
    },
    {
      "author_name": "russell leong",
      "author_url": "https://www.google.com/maps/contrib/110389563974901234760/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUeFIc5TzloGqx1tvQbMjWuaKQnQ6dwovJq0c90qsfQNoI6FKs=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "From the very beginning, it was clear that Mr Matthew genuinely cares about his students' success. He consistently goes above and beyond, taking the time to explain complex concepts in ways that are easy to understand. His thoughtful approach ensures that no student is left behind, often providing additional resources or spending extra time to make sure everyone is on the same page.\n\nWhat really sets him apart is his dedication to seeing his students excel. Whether it’s staying late to help with a challenging problem or offering words of encouragement during tough moments, he is always there, supporting us every step of the way. His passion for teaching is evident, and it has made a significant impact on my learning journey. I feel incredibly fortunate to have such a caring and committed tutor. Thank you Matt’s education!",
      "time": 1724235040,
      "translated": false
    },
    {
      "author_name": "Jasper Wong",
      "author_url": "https://www.google.com/maps/contrib/113827826569551925510/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVPtphtXv7mcSlhcsrsEzXr2isvR3l1lv69ZBVg3-UKP5iZ6Khw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "Learning from Matt's Education was a very enriching time asI have learnt a lot and improved my grades for the few years I have learnt under them. They incorporate fun and engaging learning methods that allow us to have fun and not feel like tuition is a chore. The teachers also build rapport with us students and this allows us to have a closer bond and we as students feel more willing to accept and learn under them. Overall Matt's Education really changed my perspective of tuition classes and I would highly recommend it to parents who wish to enrol their children into tuition!",
      "time": 1724215523,
      "translated": false
    },
    {
      "author_name": "chong ivy",
      "author_url": "https://www.google.com/maps/contrib/108219516075865355858/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUVx8iWDty-uyB7rUA-vYjUg7zU_bjo-aUK-ZAr0B4zfM_SC9iW=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "After joining Matt's Education for 2+ years, my daughter has not only improved in her mathematics, she has also formed many new bonds there. She has improved from failing in sec 1 where she has not joined yet, to getting As in sec 2 and beyond after joining. I have heard that she has been doing a lot of drills in class, and the teacher would make sure that they fully understand what was going on in class. Not only that, the teachers and staff there are also very nice, and she has even told me that she feels very fortunate and happy to be in Matt's Education, since her teachers treat her with a lot (and I mean a lot) of care and kindness. So, if you are looking for a fun yet focused on education kind of tuition for your child/children, Matt's Education is just for them :)",
      "time": 1709472218,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10768019296709127517",
  "user_ratings_total": 30,
  "vicinity": "Blk 433 Clementi Avenue 3, #01-250"
}