{
  "formatted_address": "200 Ang Mo Kio Ave 5, Singapore 569878",
  "geometry": {
    "location": {
      "lat": 1.3766994,
      "lng": 103.8431573
    },
    "viewport": {
      "northeast": {
        "lat": 1.378224530291502,
        "lng": 103.8444314802915
      },
      "southwest": {
        "lat": 1.375526569708498,
        "lng": 103.8417335197085
      }
    }
  },
  "name": "Mayflower Primary School",
  "place_id": "ChIJucev32cX2jERp0SR_MUTVp4",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "Ng Yu Xuan Ariel (Zhenghuass)",
      "author_url": "https://www.google.com/maps/contrib/113160130410254943857/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIIgrbFdDFGOm_W7ssJcWoHtGUe6gRIHkzD-5q8WpDKBqmBhg=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "This school is very modern and its very rich. Especially most of the teachers are very caring and considerate, but there are some teachers who will pick on some students especially if they don't like the students. These particular teachers are the best in my opion: (Mr Cher, Mdm Ong, Ms Wong, Ms Ho(She left) and Ms Kok and Yang Lao Shi.) You are very lucky if you have these teachers as your teachers. Also, some of the teachers I've listed down are fierce, they have a gentle and kind  heart. I don't know why other people commented that the school does not provide spaces to keep your books in school, that is so not true! At the start of the year, every student will have to store your workbooks or whatever in the class cabinets, so your bag is not so heavy. Mostly, students with very heavy bags are very messy and they have all sorts of rubbish in their bags, so irresponsible and even blame it on the school. Of course, we still have to bring our textbooks and worksheets to school, It's normal resposibility! Other than that, the school has wonderful facilities such as a ton of music rooms, Computer Lab, Indoor Basketball Court, Garden, ISH, Outdoor basketball court, super big Reading area,  Carpark, Cinema/Theathre (And many more) and the library is HUGE! Even with laptops which you can use, the librarian is also very friendly and kind. There is also a kindergarden and 2 playgrounds for them to play in. We also have an upper canteen and lower canteen with tons of stalls. The tables and chairs are clean but can be dirty sometimes. Some of the students are very rude and use vulgar words, there is also some cases of bullying in the school which the handbook says is against the rules but most students don't care and the principle also never do anything. But overall, quite a good school, the teachers which I listed down can teach so parents need not worry if your child have these teachers, but even if the teachers can teach, the student must also play a part in focusing on your studies.",
      "time": 1742799185,
      "translated": false
    },
    {
      "author_name": "Suria abdul rahim",
      "author_url": "https://www.google.com/maps/contrib/103889856965518855723/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUW7b8tXFNdb-gmPwQ2sSgcqQ2XSzC42NtzwuJ_QU2whteULkVu=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "I would like to lodge a complain against your security. Which im not really sure his name i think hes an indian guy. Date happened on 27/3/2025 at 0745hrs GATE D, during i send my girl to MOE KINDERGARTEN. When i entered the school usually my 4yo daughter will hold the card and show to the security and this is the first time the security shouted at my daughter by saying \"eh eh hello. Show me the photo\" is this how he approached a little girl? Or maybe he approaches me that way? No manners at all. Usually your security will ask my daughter nicely and ask can i see the photo? Instead of shouting at my daughter. Im not happy the way he approaches at me. When i say he troublesome in malay \"leceh\" again he shouted at me, And trying not to explain anything. So is this how a security behaved? Please get back to me or do something. I dont think this is a good manner and all my kids all is in the same school from 2021 till now.and im so shocked when this thing happened to me for the first time. When he can treat to me and my daughter with this manner im not suprised he can approach the kids in worst manner.",
      "time": 1743036173,
      "translated": false
    },
    {
      "author_name": "Geralynn Geralynn",
      "author_url": "https://www.google.com/maps/contrib/105915676968614060172/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVvvFZ9-Tj41Pfrvk8xIvOn731p3nLrfhVsxlWMpS3PIh2gYoaV=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Because the Teacher are the Best and My Favorite teacher is Mr Cher and Mrs Wong and mdm Au and Mr Shy and like the school because they help me Lot so 5 star",
      "time": 1743927570,
      "translated": false
    },
    {
      "author_name": "Froggo",
      "author_url": "https://www.google.com/maps/contrib/106973789543338965245/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWtT97wCNHshMEQF79NoKHMkIZ2xMXxeHBevQ481ERRrPnge4aQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "I am a Primary 6 student of Mayflower Primary School. Some teachers are genuinely nice, and helped me to study better. However, there are teachers whom are unable to even complete the syllabus, which happened to me when I was in Primary 3. There are teachers who pick out students who are rude. You may think that is good, but they target specifically those few people and leave the rest alone. So, they do not even care if other students are being naughty, even when they are called out. The students are very dirty-minded, and many of them are spoiled due to being very rich. Some students are nice, but I feel that there are many bad influences in the school as there are many troublemakers which distrupt lesson time. There are also many steep staircases as the steps are very slanted DOWNWARDS. I advise you to not bring your child to this school if they do not have any leg problems (As there are lifts ONLY for those people) but do fall down easily as the steps are also severely tiny, and I once nearly fell off the stairs as the steps' lengths are smaller than my foot. The stairs also do tend to be very slippery. Also, one of the school bus drivers is very rude. I do not recommend this school overall, but if you can handle all of these, sure. Also, one more thing, teachers require you to bring a lot of books and things, thus SUPER HEAVY bags.",
      "time": 1730275409,
      "translated": false
    },
    {
      "author_name": "Tristynne Lee",
      "author_url": "https://www.google.com/maps/contrib/105978927187471924230/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLO1DbGqDIyZXhoiFU6YLG_nFWSG1kbhq8bryEpAUWtTToMyQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I am a old student from this school now in ITE, this school is the best atleast they serve chicken rice, all teachers know me well until now the school looks so much better than it was 5 years ago they really did a good job on the construction, I envy them because they now have 2 halls more space for sports during recess and pe lessons, I will still remember you mdm szetoh, mdm zaha and other teachers names I forgot 😅",
      "time": 1738461473,
      "translated": false
    }
  ],
  "types": [
    "primary_school",
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11409328447056594087",
  "user_ratings_total": 23,
  "vicinity": "200 Ang Mo Kio Avenue 5, Singapore"
}