{
  "formatted_address": "1 Hougang Street 91, #01-26/39 Hougang 1, Singapore 538692",
  "geometry": {
    "location": {
      "lat": 1.3753774,
      "lng": 103.8797023
    },
    "viewport": {
      "northeast": {
        "lat": 1.376629530291502,
        "lng": 103.8810143302915
      },
      "southwest": {
        "lat": 1.373931569708498,
        "lng": 103.8783163697085
      }
    }
  },
  "name": "McDonald's Hougang 1",
  "place_id": "ChIJOamELlsW2jER_pQ9AbIdJZo",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "John Low",
      "author_url": "https://www.google.com/maps/contrib/114007888691845610380/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIDsopzO84ke9KK4kIRkSYQkXMM06BQcRyEo5TVtB-NMIWouw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "I had an extremely frustrating experience at the McDonald’s outlet at Hougang 1. I waited an unbelievable 65 minutes for my order to be fulfilled. Apparently fast food is no longer fast at McDonald.\n\nWhat made the situation worse was seeing later order numbers being repeatedly fulfilled while I and several other customers were left waiting. It’s clear that something is very broken in the system. Eventually, the manager stepped in and personally filled my order, but the damage was already done.  What is more, I realise when I got home that a Chicken McSpicy burger was missing.\n\nThis level of inefficiency and disorganization is unacceptable, especially for a fast-food chain that should pride itself on speed and accuracy. I hope the management takes serious steps to address these operational issues and ensure this doesn’t happen again.\n\nOrder Date: 11 Jan 2025\nOrder Time: 6.46PM\nOrder No.: 9705\nOrder Fulfilled: 7.51PM",
      "time": 1736656214,
      "translated": false
    },
    {
      "author_name": "johnnykuochung",
      "author_url": "https://www.google.com/maps/contrib/110803765536711118720/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUIozbWPxugGZODavXWfBzv6f1AhKvSbLwscJ8qwdTiYAac9DJ3=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "5 months ago",
      "text": "Walking into McDonald’s after working in F&B felt like stepping into someone else’s kitchen—a place where I wasn’t responsible for anything. For once, I could just sit back and enjoy a meal prepared for me.\n\nThe Triple Cheeseburger Cheesy Truffle caught my eye on the menu board, its layers of cheese and truffle sauce promising a decadent escape from my routine. I didn’t hesitate to order the meal set, complete with  Potato Pops and Ice lemon tea.\n\nI started with the burger. The unwrapping alone felt satisfying—like uncovering a treasure at the end of a long day. The smell of truffle oil hit me first, rich and inviting. The burger itself was a masterpiece of indulgence: three thick beef patties layered with melted cheddar cheese and drizzled generously with creamy truffle-infused cheese sauce.\n\nThe first bite was everything I had hoped for. The patties were juicy, the cheese gooey, and the truffle sauce added a touch of luxury to the familiar McDonald’s flavor. It was indulgent without being overwhelming, comforting without trying too hard.\n\nWould I recommend this to fellow foodies? Definitely. The Triple Cheeseburger Cheesy Truffle offers indulgence in every bite, while the Potato Pops are the perfect snack for those who crave something crispy and fun.\n\nAs I walked out of McDonald’s, feeling recharged, I realized that food doesn’t have to be fancy to be fulfilling. Sometimes, it’s the simplest meals that leave the biggest impressions on a foodie like me.",
      "time": 1732857805,
      "translated": false
    },
    {
      "author_name": "Ah Pin",
      "author_url": "https://www.google.com/maps/contrib/105770978205717562530/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWr2SThkQzT4mqPDRLDTNTcoLeUWigTYrcIKsADRnnzNYPc_YXFJw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "9 months ago",
      "text": "I am writing to express my disappointment with the service I received at your establishment recently. After discovering that all ordering machines were down, I queued at the counter to place my order. Despite waiting for approximately 20-30 minutes, no one approached the counter to assist me.\n\nWhen I finally managed to ask a staff member, a young boy, how I could place my order, he simply went into the kitchen. Initially, I assumed he was seeking assistance on my behalf, but he continued to go in and out several times, seemingly preoccupied with other tasks, and completely ignored my request for help.\n\nAfter an extended wait, a very kind Chinese gentleman approached me and offered to take my order. However, as he was taking down my order, the lady handling the pickup counter loudly informed him that the manager had instructed that no more orders would be taken at that moment. The gentleman then kindly went to clarify with the manager, only to confirm that, due to an overwhelming number of orders, they could not accept any more at that time.\n\nWhile I understand the challenges your team may have been facing due to the high volume of orders, I am frustrated by the lack of communication. There was no signage or notification to inform customers that the kitchen was overwhelmed and could not take additional orders. This lack of communication led to a frustrating experience, as I waited nearly 40-50 minutes for nothing.\n\nI strongly suggest that in situations where the kitchen cannot handle more orders, clear communication should be made to the customers, either through signage or an announcement. This would prevent situations like mine, where customers are left waiting indefinitely without any understanding of the situation.",
      "time": 1724158692,
      "translated": false
    },
    {
      "author_name": "Daniel Ong",
      "author_url": "https://www.google.com/maps/contrib/102171149331811240738/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX5sWSaVMUjtkjW9AcgKqpLTv78h0G6p248fo9yT-s6Y58hIsk=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "This outlet must be the biggest joke. I sometimes wonder if the management or branch manager even bothers to look at the reviews. I placed an order through the McDonald’s app while on the bus at 7:21 PM, and the food was only ready at 7:45 PM 24 minutes to prepare the order. Seriously? Nothing has improved since 2023. Please step up your game!\n\nA small tip -After placing your order on the app, feel free to take a 25 minute nap before heading to the outlet to pick up your food. Because seems like this outlet requires a MIN 25 mins to get the food done.",
      "time": 1736337234,
      "translated": false
    },
    {
      "author_name": "Nuzhar Yar Khan",
      "author_url": "https://www.google.com/maps/contrib/117102746610943886421/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW9yrNXVSQNkhvULo_5U1nnIGfIpUyJC9Kpe-ky4uXHsnTIcS0=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "This outlet takes a lot of time to prepare your order even if it’s simple last time they also forgot to put the down bun on my mcspicy! I was really shocked and why I gave one more star is for the quality and taste of the food. Out of this world! If u agree pls leave a thumbs up",
      "time": 1744587064,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11107316706341393662",
  "user_ratings_total": 1466,
  "vicinity": "1 Hougang Street 91, #01-26/39 Hougang 1, Singapore"
}