{
  "formatted_address": "1 Marine Parade Central, #01-01 Parkway Centre, Singapore 449408",
  "geometry": {
    "location": {
      "lat": 1.3019931,
      "lng": 103.9061192
    },
    "viewport": {
      "northeast": {
        "lat": 1.303184130291502,
        "lng": 103.9072719802915
      },
      "southwest": {
        "lat": 1.300486169708498,
        "lng": 103.9045740197085
      }
    }
  },
  "name": "McDonald's",
  "place_id": "ChIJKbUddHEY2jER6bWngQVoewE",
  "rating": 3.6,
  "reviews": [
    {
      "author_name": "Cheryl Tan",
      "author_url": "https://www.google.com/maps/contrib/111651330595153268417/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVDEoPQekR42VNVMnTOtNmHmi7ibh570Raqprj7FqezZmkWBhU=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "When this sundae was delivered, I immediately felt this deep disappointment at the pathetic amount of chocolate fudge that was given. I started on this sundae then realised we should ALL not be settling for a sundae like this. This is not even a half decent sundae, no effort was put into it, and the owner of this establishment did not give two fuks about how customers paying $2.50 for this piece of crap would feel. Mixue is right by the corner - do yourself a favour and get your dessert order there (or anywhere else) instead",
      "time": 1746955488,
      "translated": false
    },
    {
      "author_name": "JC L",
      "author_url": "https://www.google.com/maps/contrib/114121906186956083113/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLx-TVplwhAZUfppUmBR02m4XHmdYZzBKCjanL-p4o_uygeOQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "This is the first time I have ever given a one-star rating, and honestly, I don’t even think it deserves that.\n\nI placed my order at 11:18 PM and pick it up at 11:50 PM. However, despite arriving on time, I noticed that your staff prioritized delivery orders, only serving dine-in customers after all the delivery drivers had left.\n\nI ordered two meals, one burger and one chicken nuggets, but I ended up waiting for over 30 minutes. The reason we chose fast food late at night was because everyone was already starving, yet we experienced unfair treatment and an unreasonable delay. This was extremely disappointing. Obviously, the food wasn’t treated well either.",
      "time": 1742486630,
      "translated": false
    },
    {
      "author_name": "tristanv95",
      "author_url": "https://www.google.com/maps/contrib/103633191033421851215/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJoNocmUwCPaDDyCRvn0s2i92AdPKmwvWqfCn0cZpZw0XQytw=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "Ridiculous. Staffs all standing around packing food but none is being served. Ai was at the counter and while the “Now Preparing” status keeps increasing, no one got served for at least 5 mins. Food were packed and place at the counter but none, NONE of the staff came up to serve. They either come to the counter put down food and walk away or be there to do other stuffs then walk away. My number also magically disappeared straight from the screen, from “Now Preparing” to just disappeared. Had to go up and ask then they hand me my bag among the many bags that were there.",
      "time": 1744108871,
      "translated": false
    },
    {
      "author_name": "Di Di",
      "author_url": "https://www.google.com/maps/contrib/115312472597557433866/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocINqiGLTNwzpLATUMYSd6Xqe-x7dmcespvlf6NpThmbpMpOnQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "6 months ago",
      "text": "I waited 15 min for two ice cream cones. When I finally got my ice-cream, it was coated with chocolate. Both the pineapple and vanilla flavoured ones started melting. My younger son and I decided to throw them away as the rate at which the ice-cream was melting was faster than we could consume it. It is not the first time that the ice-cream here has failed us.\n\nPreviously, when the order was already processed, we were then informed that the ice-cream machine was down and there was an offer to change it to something else.\n\nI must be honest, everyone was hard at work. It is a rather busy outlet.",
      "time": 1731138080,
      "translated": false
    },
    {
      "author_name": "Yanling Teo",
      "author_url": "https://www.google.com/maps/contrib/116952033679862728576/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVP1b1xrDAuMaGddkfuchWBG-wBW22kjRoxL1WpXemp0cJF0cg0=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "This was the worst McDonald's experience I've ever had. The staff were grumpy and unhelpful, ignoring our requests and consistently messing up orders. Despite my order number being displayed on the screen, my order wasn’t ready when I approached the counter. I ended up waiting another 10 minutes, only to see orders given to people who ordered after me.\n\nI spoke to a woman who appeared to be a supervisor, and she claimed to be 'just following the system,' but it seemed clear that they were not. Plenty of food sat prepared on the serving tray, yet no one was packing it or managing the orders properly. When I tried to ask several staff members for help, they simply ignored me.\n\nTo make matters worse, an employee scolded a trainee in front of all the customers. It would have been more productive for her to use that time to pack orders and address customer issues rather than publicly reprimanding the trainee, which could have waited until after the orders were handled.\n\nI ordered my meal at 9:50 a.m. and didn’t receive it until 10:15 a.m. — 25 minutes for a single order. Is this really what’s considered standard for fast food?",
      "time": 1731637797,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=106793389032715753",
  "user_ratings_total": 1111,
  "vicinity": "1 Marine Parade Central, #01-01 Parkway Centre"
}