{
  "formatted_address": "57 Anchorvale Rd, #02-03, Singapore 544964",
  "geometry": {
    "location": {
      "lat": 1.3968502,
      "lng": 103.8873924
    },
    "viewport": {
      "northeast": {
        "lat": 1.398246030291502,
        "lng": 103.8886349302915
      },
      "southwest": {
        "lat": 1.395548069708498,
        "lng": 103.8859369697085
      }
    }
  },
  "name": "McDonald's Sengkang Sports Complex",
  "place_id": "ChIJrVN88GAX2jER4CWk_KjBLjs",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Keenan Tan",
      "author_url": "https://www.google.com/maps/contrib/113393950583896734159/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXgeWU8R2CTXDvgBp-_PMvWM3x2II_zwuHBreKPlZ9pQwrgb94R=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "I ordered breakfast early in the morning, and was told to wait for 10-20 minutes, which I was alright with. But to find out a few bites into my meal that my order was wrong, after repeating several times that I wanted ketchup removed from my breakfast wraps, and my drink without ice, I was still appalled to find both wraps with ketchup and my drink with ice. When returning to ask about my order, they told me that they thought I had just ordered my meals as is(Even though throughout the original interaction, I repeated my special requests several times throughout the process)\n\nI understand that your busy, but don’t lie to your guest straight to their face.\n\nP.S thinking back it was one of the higher up workers who handled my order(wearing a darker coloured striped shirt), I don’t know if they were stressed or overworked, but after speaking to them they do seem understaffed.",
      "time": 1742937103,
      "translated": false
    },
    {
      "author_name": "Xin Hao",
      "author_url": "https://www.google.com/maps/contrib/101038177603319548234/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU6c44XsILjRE2Islw02Z6jqIpGV_4urvZ0lGOy57c-ErkANHqe=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Love how spacious this outlet is being right at the centre of Sengkang community centre and sports complex, includes a drive-thru as well with very clear signs and enough space to park/navigate. It’s a really popular spot for residents around the area and families with young kids given the kids party corner is also available. There are plenty of ordering kiosks and service is pretty fast. I’m usually picky on how the milo tastes as it differs from outlets to outlets but this one hits home and was just on point! Thank you to the service crew for the experience at 4am in the morning!",
      "time": 1743301579,
      "translated": false
    },
    {
      "author_name": "Lee Zi Loong",
      "author_url": "https://www.google.com/maps/contrib/113871250701029056120/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJzyEYzXWMpYNJYNuF-NJPPlbxPYyftDEjEYLqpjPLt33eQJw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "I love to buy from this place even there are few bad experiences as I believe that things getting better especially for Macdonal's.\n\nHowever, today is the worse purchase experince. Apps informed me to collect my order and my number is at the top of the now serving list. I am standing in front of the collecting counter waiting patiently as a considerate person while the others keep collecting their food and my food still not ready.\n\nHere's my unhappy points\n1-my happy meal box is a mess, even I am not a child, seeing my box also unhappy. I tru to fix it by myself but too bad.\n\n2-I suspect there is bully to the chinese lady as the other malay female staff standing at the counter dissapear for a while then appear again and ask her to pack my food which already mess up. Instead of doing her job, the malay staff asking me: what are you waiting for? (the attitude create uneasiness to me. Besides, the chinese lady just came back after serving food to table.)\n\n3-the happy meal box messes up but no one care to fix it to me. I thought Macdonald's trained the staffs well? Where is their professional?",
      "time": 1741872281,
      "translated": false
    },
    {
      "author_name": "Aidan Kim",
      "author_url": "https://www.google.com/maps/contrib/116028905044608313565/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUhtSvsibHp3BFmeGNbU38D87KreZZZmvORwDlRRLJYr3fD_swd=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "I ordered breakfast and is missing a BURGER !! We want to freaking eat... We all understand is busy, but most SINGLE TIME  order from there SURELY have missing items ! If once, twice, thrice still can close eyes but this I also don't know how many times. It was like 90%/multiple times. IDC lah McDelivery, GrabFood, Foodpanda all need to be equal and look thoroughly ! Did you double triple check the items ?! Only your outlet is every order surely no miss need to report.",
      "time": 1744512474,
      "translated": false
    },
    {
      "author_name": "b8499 SL1",
      "author_url": "https://www.google.com/maps/contrib/109244671797342154850/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLJ6xgreKtWV_qtaRLgMjexo5cvvcGeTY2ir-FyG-IauvqaC5o=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I order spicy chicken nuggets and potato pops which are non veg which are the yummiest I recommend this for non veg food also has drive-thru the spicy nuggets are actually not too spicy at all this is at McDonald's restaurants unfortunately we don't eat vegetables  actually hot Milo the taste was bad I tried to take a sip never gave us water so I have no choice to drink only by my water bottle",
      "time": 1733477616,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4264558828703720928",
  "user_ratings_total": 1939,
  "vicinity": "57 Anchorvale Road, #02-03, Singapore"
}