{
  "formatted_address": "17 Petir Rd, #B1-25/26/27 Hillion Mall, Singapore 678278",
  "geometry": {
    "location": {
      "lat": 1.3782434,
      "lng": 103.7626054
    },
    "viewport": {
      "northeast": {
        "lat": 1.379313280291502,
        "lng": 103.7639914302915
      },
      "southwest": {
        "lat": 1.376615319708498,
        "lng": 103.7612934697085
      }
    }
  },
  "name": "McDonald's Hillion Mall",
  "place_id": "ChIJLwXNTHMR2jERuaiB6wNMna4",
  "rating": 3.9,
  "reviews": [
    {
      "author_name": "Choco_fudge",
      "author_url": "https://www.google.com/maps/contrib/118397319400282861984/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVmn1a4vNzPvL47-sUU3jLNXGYEqT1llF1yii_DR2QsAGHcNnLa=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "At 2.14pm, on the 2nd of Jan, Thursday, I ordered 2 set meals and an alacarte burger: Fish fillet with prosperity fries and milk, Double cheeseburger with prosperity fries and milk, and an ala carte beef prosperity burger. It was peak hour and the restaurant was crowded with no seats available. My grandmother and I decided to order take-away through the Self-ordering kiosk since we were unlikely to find a seat anytime soon and my grandmother's legs would hurt from standing too long. With great dismay I watched as the screen calling our orders cleared out slowly with our order number, 2591, never being called. We were the last to get our order with over a dozen customers before us received theirs. We waited for 30 minutes before I decided to question the front counter. The lady asked if I would prefer to speak with her store manager, Sabir, instead as he was the expedite. This manager greatly disappointed me. Albeit apologising for the long wait, his tone suggested that he was annoyed. He even cut me off midway as I was complaining about the 30 minutes wait and other customers after us getting their order earlier. I quote and he said, \"I'm sorry ma'am but could you let me finish first?\" And gave me the excuse that the newcomer kicthen crew accidentally dropped the last beef patty and they had to cook a new batch and they were following the order number. He cut me off mid complain with an excuse, giving me an annoyed tone. I understand I may be a teenager and look young but that did not give him, a manager, any right to cut me off and give me a bunch of excuses for poor and slow service. It was only after my insistent questioning and refutes that my order was finally delivered at around 2.43pm. I even saw a prosperity beef burger waiting at the expedite area for 5 solid minutes after my complain to Sabir, and he was nowhere to be seen. He then gave me 3 EXPIRED vouchers for 1 sausage muffin and 2 pancake sausage platters. I walked back into Hillion mall and told the counter lady about it to which she went back in to find Sabir. As I waited once again I asked another counter lady how many kitchen crew were there, she asked her manager standing at the cashier to which the lady told me to wait for a moment as her manager took orders. The problem was, Fatine, the manager at the cashier was unable to give me an answer on the spot of how many kitchen crew she had at lunch period? She never returned to answer me which annoyed me further. How could a manager not know their crew strength at the back of their hand? Nonetheless, Sabir returned with 6 new vouchers, 3 chocolate sundae, 1 orea Mcflurry, 1 Cafe coffee and 1 Apple slices pack which supposedly had \"no expiry date\". I asked him the same question that Fatine did not reply me on and he informed me that they were understaffed with only 4 out of 6 kitchen crew (including a new kitchen crew) and he was the only one expediting. However, it is the management's problem for poor schedule MANAGEment, and slow service. This experience was awful and by the time our order arrived, the store barely had orders and the crowd had left, there were empty seats! We wasted our time had a terrible service! The fish fillet didn't taste fresh either and clearly sat out for several minutes before being used! I would never return to this branch ever again! The front counter staff were helpful in assisting me to get my order out faster, it was a pity that the manager(s) in charge at that time poorly carried themselves, spoke in a tone that was rude, sounded annoyed and condescending. The expired vouchers to make up with the SUPER long wait was a sorry attempt and excuse. He simply sounded unbothered about my complaint! A waiting time over half an hour for 2 meals in a fast food outlet was worse than waiting at a restaurant. Terrible move of making such half hearted apologies. The free vouchers were clearly meant to try and \"subdue\" my disappointment, was NOT genuine if Sabir was unable to CHECK the expiry date of the vouchers before handing it to me. What if I hadn't checked?",
      "time": 1735836354,
      "translated": false
    },
    {
      "author_name": "CHIN ANG",
      "author_url": "https://www.google.com/maps/contrib/106579944402663883280/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK0tSAuMupGW4qepxMr_0ryjR2IFL0VxxfZVkt6dHuFLvWZ6Q=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 3,
      "relative_time_description": "2 months ago",
      "text": "They thought nobody notices but:\nItems shrunk few mm\nRefill tea has plastic smell\nButter is processed beyond\nHeavy traffic store disintegrated\nTable torn, order screens not responsive\nConsolation staff helpful & cheerful",
      "time": 1740372180,
      "translated": false
    },
    {
      "author_name": "LA S",
      "author_url": "https://www.google.com/maps/contrib/116240499733115552937/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLGppFEDMb8sBp121C1HvJEovtcXkPvIGLd0_5jtbS5k-TGDw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Always have to wait quite awhile for orders. Go excited but always end up regretting the trip. Understand that F&B staff are tired and as customers, we try to be understanding. Queue number is flashed but food is not ready. Staff will ignore you when you show them your number as long as the food is not ready at the serving counter. Many times, no apologies, nothing. Witnessed the kitchen staff today threw food boxes with ready food at the kitchen counter. One counter staff tried to appease her and took over her role to prepare food after seeing her stomped out the kitchen and out of restaurant around 11.30pm, 04.04.2025. This can be seen by customers standing near the counter.\n\nYou need to put in more staff if you are short-handed, especially during weekend. Please also ensure staff understand basic service etiquette. Waited more than 30 mins for a 9 piece nuggets. I'll do you a service by not visiting you again because I have been an F&B staff before and I know it's tiring, especially on weekends and peak hours or when it's short-handed. I feel tired as a customer with the waiting and see unhappy/stressed staff working.",
      "time": 1743792111,
      "translated": false
    },
    {
      "author_name": "Furawrr",
      "author_url": "https://www.google.com/maps/contrib/113930804623491395489/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXN1AsnfxewWVnRKIh5JmMOgwhLuOFtn1XKCbhLiKXFqkghWAM=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "Where is my shaker fries? You still have the cheek to send the food out for delivery without checking? Why being so negligence?",
      "time": 1745598973,
      "translated": false
    },
    {
      "author_name": "Wen Xuan Ch'ng",
      "author_url": "https://www.google.com/maps/contrib/108019390867060530246/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVW-gtu8xQUlFYK-DS1IUpr8H4Xfs3GrmVxdKw4mZ8Rtlp1T-6Q=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "This is the 6th time i came here, the number shows \"now serving\", and it takes 30 mins for the order to arrive. Then orders later than the number get served even if the food ordered is the same. People crowding at collection counter and condiments doesnt help at all. They need to come up with a better number ticketing system and order fulfilment this is not working out for customers.",
      "time": 1746976262,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12582296513662789817",
  "user_ratings_total": 1876,
  "vicinity": "17 Petir Road, #B1-25/26/27 Hillion Mall"
}