{
  "formatted_address": "88 Tanglin Halt Rd, #01-03 Commonwealth View, Singapore 141088",
  "geometry": {
    "location": {
      "lat": 1.3020939,
      "lng": 103.7980733
    },
    "viewport": {
      "northeast": {
        "lat": 1.303345280291502,
        "lng": 103.7993256802915
      },
      "southwest": {
        "lat": 1.300647319708498,
        "lng": 103.7966277197085
      }
    }
  },
  "name": "Medical and Dental Centre @ Commonwealth",
  "place_id": "ChIJXchGgDga2jERV145dozGQfE",
  "rating": 2.4,
  "reviews": [
    {
      "author_name": "Belinda Tan",
      "author_url": "https://www.google.com/maps/contrib/103395047177181472483/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKfvzhPx8H_dZzG74_qQujVco6C7Xcyf6bxRh86kDZJxv5Dtg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I have been to the medical clinic for the past 10 years with my family and every visit has been a positive experience. Dr Rachel Gwee is always patience and detailed in explaining the medical report or the symptom that we have.\n\nThe staff is attentive and will always repeat the medicine prescription to ensure you understand how it will be taken.\n\nDefinitely there would be a queue especially if you go in the morning and especially on Sat but isn't that the same for all clinics and/or polyclinics. Will recommend this clinic.",
      "time": 1744706756,
      "translated": false
    },
    {
      "author_name": "Mariel Racelis",
      "author_url": "https://www.google.com/maps/contrib/112098934216554011310/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLM4e8ZFs0XPl1kTf91yDdrOPzJpY4fQWf5AxmgjsSuRpPjyQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "Subject: Complaint Regarding Unprofessional Behaviour at the Front Desk\n\nI am writing to formally express my disappointment regarding the behaviour of the front desk staff Angelyn at Medical and Dental Centre @ Commonwealth.\n\nDuring my recent visit to your clinic, I encountered a level of rudeness and unprofessionalism that I found both unexpected and disheartening. When I approached the front desk to inquire about my appointment, I was met with dismissive remarks and an unhelpful attitude.\n\nAs a patient, I value courteous and respectful communication, especially in a healthcare setting where compassion and professionalism are paramount. The behaviour I experienced did not reflect the standards I believe your clinic upholds, nor did it foster a welcoming environment.\n\nI kindly request that you address this matter with your team and take appropriate steps to ensure that all patients are treated with the respect and care they deserve. I trust that necessary measures will be implemented to prevent such incidents in the future.\n\nThank you for taking the time to consider my feedback. I am hopeful for a positive resolution and look forward to a more pleasant experience during future visits.",
      "time": 1734146526,
      "translated": false
    },
    {
      "author_name": "Syafiqah Salim",
      "author_url": "https://www.google.com/maps/contrib/114014670507414562890/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLQIpWKLvPHvAWL-MMvIC7aE56Idjvnngv4IGW2x_ggfioTTxVb=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "I recently visited this clinic and had a frustrating experience due to the receptionist. From the moment I walked in, she was unhelpful and seemed disinterested in assisting patients. Started speaking with me in a rude tone. It shows their closing time is at 5pm and i came in at 4.15, felt so sick. Receptionist said not to come at 4.15 as they are already close? She then started raising her voice and seemed rushing to pack up and close the clinic which is not professional of them.\n\nThe wait time was excessive, and there was no communication about delays. It felt like the staff didn't care about patient experience at all. I left feeling frustrated and undervalued. I won't be returning to this clinic.",
      "time": 1730451414,
      "translated": false
    },
    {
      "author_name": "Gary Heng",
      "author_url": "https://www.google.com/maps/contrib/108871436805796141949/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKniEG5ecahfZ7blu9IqTLzeYYPb6ToBE64gtDWUwPFPnInyQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "I am 53 years old. In all my years of experience with doctors, they have ranged from extremely pleasant to somewhat ok. However for the first time, I had a very unpleasant experience with a doctor in Dr Rachel Gwee 2 days ago. Terrible bedside manners. Totally disinterested in my telling of my ailment. After the consult, she said she'll prescribe me some medication. When I asked if it was an application or oral medicine, she simply replied \"My nurse will explain\". In and out of the consult in about 5mins. The clinic staff who registered me was pleasant enough though. The clinic is presently the nearest to my home but I'll never head there again",
      "time": 1730909733,
      "translated": false
    },
    {
      "author_name": "Jacqueline Simon",
      "author_url": "https://www.google.com/maps/contrib/111719545721929405441/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV1oWnem9jfeUC1iss3j5wPOsUjP0-VLp9jjc3sMmB8ZjqCqfUF=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "11 months ago",
      "text": "Would not dare to give 1 star only because I cannot deny I feel fine after taking medication as suggested by Dr Gwee. She's also patient and caring when I consulted with her.\n\nThe thing that bugs me is the staff at the front desk. Dunno what her name is, but she's old, short curly haired. During my 1st visit, her service was okay. However, during my 2nd visit, I asked her to print the receipt although it was covered by insurance because I still wanted to understand what the clinic charged as my insurance covers the fee with cap. She coldly turned my request down, saying \"It will be paid by your insurance. Why do you need the receipt? You need the receipt if you pay by yourself. Do you want to change the method to self payment?\" :) Hello Ma'am, this is not my first time going to hospitals or clinics with fees covered by insurance. All this time, they always gave me receipts. So, what's the problem? Was there any fee you anyhow charged me?",
      "time": 1717826087,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17384394343208017495",
  "user_ratings_total": 123,
  "vicinity": "88 Tanglin Halt Road, #01-03 Commonwealth View"
}