{
  "formatted_address": "218, 01-02 Sumang Walk, Singapore 820218",
  "geometry": {
    "location": {
      "lat": 1.4033119,
      "lng": 103.8952978
    },
    "viewport": {
      "northeast": {
        "lat": 1.404581380291502,
        "lng": 103.8966309802915
      },
      "southwest": {
        "lat": 1.401883419708498,
        "lng": 103.8939330197085
      }
    }
  },
  "name": "Medi Healthcare Clinic (Punggol)",
  "place_id": "ChIJRSRYoeEV2jERPZC2Y_SDJMU",
  "rating": 3.2,
  "reviews": [
    {
      "author_name": "Gareth Yeo",
      "author_url": "https://www.google.com/maps/contrib/101509238891013876343/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUFZ5Zgl6bnuk-uMrlTB9amEEx9bpqFTxprjHQM6JwN4lfyFvo=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "No mercy.. despite being listed in the IHP list to open till 1630, they turned me away at 1603, claiming they close at 1600. Staff didn't even have time to flip the \"Open\" sign on the door before they did this. Patient care is clearly not high on their priority list. On the flip side, this kind of go through the motion place is great if you need a quick MC.",
      "time": 1733127989,
      "translated": false
    },
    {
      "author_name": "Chin Hoong Shih",
      "author_url": "https://www.google.com/maps/contrib/118236105444409573976/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXzUi_Q7VcgxVHr82kqLD67P9R2Fmbi7BylK7ik6oITMaWzULg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Edit: Guys... I've been reading all these negative reviews about my dear counter staff and the awesome doctors here and I just have something to say: the energy you project is the energy you get in return. In that vein, the vibe you put out is the vibe you get in return. Newton's 3rd law of motion dictates that for every action, there is an equal and opposite reaction. Simple physics mah, bro. Just be nice lah. Then people will be nice to you. Phrase request as request and not orders. Phrase questions as questions with a question mark;  and not statements with a full stop. Please lah. Very simple. Need to teach you these things one meh? Parents, your children are very impressionable, and emulate your behavior. Do you really want them to emulate your boorish uncouth manners? Think about it.\n\nYour IC number isn't really sensitive info any more. I think the gahmen has made that very clear. Read up ah. You show them your actual IC or screenshot of IC? Screenshots are not allowed, btw. Show Singapore right? Your screen brightness got turn up or not? Resolution leh? Counter staff got 老花眼 one leh. Have some empathy or sympathy lah. So quick to rush to judgement. Shows your lack of critical thinking skills. Epic fail. Sad.\n\nGastic medicine for headache? How you know the gastric medicine is for your headache problem? Got sore throat, right? One of the primary symptoms of GERD or acid reflux issue is sore throat. Besides, the gut system is deeply connected to the rest of the body. Never heard of gut flora and maintaining your microbiome meh? And also, never heard of off label application medicine? No right? You so smart then you be doctor lah.\n\nTaking your temperature and performing ART test doesn't sound like using eye power leh. You know what you're writing or not, bro? Anyhow pilipalah sukah sukah write nonsense. You told him your symptoms are high fever and sore throat. So no cough, not chest congestion. Then use stethoscope for what sia? Need to check your lungs for respiratory collection of fuids meh? You're so odd and strange. Must be hell to know you.\n\nAnd antibiotics is for fighting bacterial infections. Yours sounds like the flu. Viral flu. So supportive care is the best way to manage a viral attack. Not much you can do. Just got to give your body time to fight the infection. But in the meantime, you have to rest well and sleep well and eat well to allow you body to be in the optimum state to fight the virus mah. Which accounts for the NSAIDs and paracetamol. Goodness gracious. The level of ignorance is only rivalled by your sense of entitlement, which is only surpassed by your self-pride -- wholly undeserved, btw. Looked through your other reviews. They are equally negative and embarrassing. Stop. These internet posts are cached and are forever. Don't want your current/future employer to find how proudly ignorant you are. And God forbid your children come across them and just feel extreme cringe.\n\nClosing time means they have to make sure the doctor got enough time to spend with patients. Then they need to prepare the medicine while the doctor make crucial notes. Then they have to explain how to take the medicine for you. And wah, you good ah. You work finish already. See if you want to stay later after work if you're not getting paid. Simple lah, bro\nThey should really peg on Friendli to their clinic's name (i.e Friendli Medi Healthcare Clinic, lol) cuz every one there is so friendly! When you're not exactly feeling your best, the warm and affable reception from the awesome nurses really serve as a soothing balm. Both the resident and locum doctors are kind, gentle, attentive and very competent. Oh! Did I mention that the nurses have a killer sense of humor? Laughter can be real good medicine - I found that out during my last visit. Anyways, I scouted around and finally settled on this clinic for my primary care needs. And so should you. Also, if you want the most affordable flu shot around the area, come here!",
      "time": 1745184414,
      "translated": false
    },
    {
      "author_name": "james yuen",
      "author_url": "https://www.google.com/maps/contrib/102427225165886407659/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVgxJWwSIVVV9xUGZBl0uDgDtCOUhKErYSOfb9TQXrvSTqpgRk=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "Been quite my go to clinic due to nearby my house, but every time you visit this clinic be mentally prepared beforehand to get a dose of attitudeness or rudeness from their counter staffs, they can strike you despite having so little customers. Needing me to read out my full NRIC number despite me showing my ic, counter staff said she cannot see, but needing me to read out my sensitive info that other patrons can hear/memorize.\nDoctor dispensed 3 types of medicine including one for gastric for headache symptom, probably because knowing i'm a corporate customer.\nScrew this place, so bloody squeezy yet so arrogant. bye bye beside them open another clinic that accepts my corporate card.",
      "time": 1682474310,
      "translated": false
    },
    {
      "author_name": "Steven Teo",
      "author_url": "https://www.google.com/maps/contrib/117045679957706502024/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKsggDZoO_ZvicFhG_PkavC3cr5oTbcJ5MsxO0rAm_iqB_Ang=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "Doctor diagnosing using eye power.\nTold him that i am having high fever and sore throat. Took my temperature and performed art test on me. There after, prescribe ibuprofen, paracetamol and lozenges only.\nNot using his stethoscope at all.\nNot sure he is wearing that for what.\nAsk for cough syrup or antibiotic- answered not required.\nAnd im still having sore throat after 5 days.\nOne advice to them - please close the clinic if you are not interested or putting health as priority of your patients.",
      "time": 1663038684,
      "translated": false
    },
    {
      "author_name": "Esther Ho",
      "author_url": "https://www.google.com/maps/contrib/111711680525734942805/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJiijAi7ExwrDWM30tqYCNy3Dxq2er82eJbX_lbjEPbLssOwg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "My son called at 12.25pm to ensure they will accept him for walk in since they are closing at 1pm, they asked him to come immediately, reached 12.32pm, they said he should come 5 minutes earlier, within his call to clinic is only 7mins, u expect him to fly there. Wasting people time and he is terrible sick. Poor services.",
      "time": 1663476536,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "finance",
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14205624210301554749",
  "user_ratings_total": 43,
  "vicinity": "218, 01-02 Sumang Walk"
}