{
  "formatted_address": "14 Kensington Park Rd, Singapore 557265",
  "geometry": {
    "location": {
      "lat": 1.3652241,
      "lng": 103.8661717
    },
    "viewport": {
      "northeast": {
        "lat": 1.366571180291502,
        "lng": 103.8675360802915
      },
      "southwest": {
        "lat": 1.363873219708498,
        "lng": 103.8648381197085
      }
    }
  },
  "name": "Mediline Wei Min Clinic",
  "place_id": "ChIJV4lBuf8W2jERZCRRWMdvbIw",
  "rating": 3.5,
  "reviews": [
    {
      "author_name": "Hern Shung Ang",
      "author_url": "https://www.google.com/maps/contrib/107949392434433530785/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU_J7aXVImoAhI6l3yT_S1aQU_kpP_VDsrkoAUbkY1rxLL-2tdz=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "I was very impressed with my visit here, that I felt I needed to post a review to acknowledge their hard work!\nFirstly, I managed to get an appointment very easily via their app, which was simple to use and very user friendly. Check-in was a breeze too with the app. I didn't have to wait very long because everything was so well organised and the systems worked well.\nSecondly, I saw Dr Eugene Loke, who was very caring and warm, and showed genuine care and concern, and took time to explain in layman terms what he thought I was experiencing. Very comforting amidst it all; i wish more doctors were like him. The other staff were all equally professional and friendly and warm too. And their systems and processes worked well, because I had collected my medication, made payment and was out of the clinic under 30 minutes.\nAnd lastly, this was what impressed me most. Later that evening, I received my lab results for my blood test via a message from the staff, and also a follow up message from Dr Loke who looked through the lab results and gave his feedback/follow through. I was blown away by how they went above and beyond, and extended care to me. A big thank you to Dr Loke and team!",
      "time": 1746366135,
      "translated": false
    },
    {
      "author_name": "Melody Melody",
      "author_url": "https://www.google.com/maps/contrib/107430488992102315283/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUaapBPRfjPo2RYZFFyEYPk0L48adi8Ols2h2T1XzA_v6Yr3ig=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "After experiencing long waits with Dr. Lee and Dr. Sanjay, even with appointments, my family and I decided to consult Dr. Ho Tze Woon. Over time, we’ve been consistently happy by his attentive listening, professionalism, and accurate diagnoses. His treatment plans and prescriptions are on par with those of Dr. Lee and Dr. Sanjay, but without the extended waiting times. The convenience of shorter queues, especially when feeling unwell, has been a significant relief. We are fortunate to have Dr. Ho practicing at a clinic near our home and will continue to book appointments with him whenever we are unwell. Choosing to consult Dr. Ho has been a logical and sensible decision for our family’s healthcare needs",
      "time": 1742633180,
      "translated": false
    },
    {
      "author_name": "Margaret",
      "author_url": "https://www.google.com/maps/contrib/103852835157335466464/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJxuTz2lhZCFzHnY0jKTCmZmpsD8sxLxgN98xGH2qKs-dN-sA=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "System is much better than previously, with the 1doc app. One could check in first & waiting time is shorter. Might be challenging for seniors who do not know how to use the app . Dr Loke is patient, understanding & compassionate. Dispensing of medicine was seamless, although I 'pity' the staff who had to walk from one end to the other because of the layout of the place.\nOverall, a good experience",
      "time": 1739315966,
      "translated": false
    },
    {
      "author_name": "ronnie yoo",
      "author_url": "https://www.google.com/maps/contrib/100617270802140817350/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWDfB1f1I6lzDuWiFWFmf-tMVj9sGhLKVJkGRzRaeqjBwdOmHmH=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "My visit to the clinic was incredibly smooth and pleasant. The facility was clean and well-maintained, making the entire experience a breeze. I particularly appreciated the convenient station for taking weight, height, blood pressure, and temperature, which streamlined the process efficiently. Overall, it was a great experience, and I would highly recommend it to others.",
      "time": 1741745526,
      "translated": false
    },
    {
      "author_name": "MARTIN GOMEZ",
      "author_url": "https://www.google.com/maps/contrib/112366506988856212530/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWY41-QlPH8kMNKRbiYahM8JiSc6nISkiA-SwxiP3EevNN-1H1b=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Dr Eugene Loke is truly a very caring physician. He's attentive to your medical problems and prescribes accordingly. He cares about his patients. Also, credit needs to be given to front line staff at this location (Kensington Park Rd). Always smiling and making sure your vitals are accurately recorded. A great team of professionals.",
      "time": 1740358541,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10118585364765549668",
  "user_ratings_total": 302,
  "vicinity": "14 Kensington Park Road"
}