{
  "formatted_address": "Lot 71-01, Sunway Emerald Blvd, 88, Persiaran Medini 3, Sunway Iskandar, 79250 Iskandar Puteri, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.3955306,
      "lng": 103.6339683
    },
    "viewport": {
      "northeast": {
        "lat": 1.396910230291502,
        "lng": 103.6353420802915
      },
      "southwest": {
        "lat": 1.394212269708498,
        "lng": 103.6326441197085
      }
    }
  },
  "name": "MEETMEAT BBQ",
  "place_id": "ChIJoSg0Bh8L2jERdeN3hSetZBM",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "김윤희",
      "author_url": "https://www.google.com/maps/contrib/102382741725510501509/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX06uFwU5fCxg7IP0mfo0af6xbwgK_cYSA32sZpq3yJbnol4UtTDw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Living in Singapore, I think I’ll be making trips to Johor Bahru just to eat Korean food. We didn’t go to one of the usual famous spots — we just happened to stop by because it was near our hotel, but it turned out to be incredibly delicious and the service was so warm that it really moved us. You could never imagine this level of quality at this price in Singapore — and with such kindness too. The galbi pork belly? Absolutely top-notch. I was craving naengmyeon and got so full that I couldn’t try the fried rice, which I now regret. But I’ll definitely come back for it next time. Even with the weekend traffic between Singapore and Johor Bahru, I think I’ll be making time to come back here again for Korean food.\n\n너무너무 맛있고 친절합니다.",
      "time": 1744967208,
      "translated": false
    },
    {
      "author_name": "현상",
      "author_url": "https://www.google.com/maps/contrib/117857537862025730461/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWLv4aX3v5htyl9-UR2srp3nXfcKBJqXcsQdqzIVf08vgrTT9sp=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Love the Korean vibe!\nEveryone should try this place!\nPerfect grilled, juicy, and full of flavor!\n(every bite was a delight)\nThe warm service and cozy atmosphere made the experience even better!\nHighly recommended for meat lovers out there😃",
      "time": 1744988260,
      "translated": false
    },
    {
      "author_name": "Jc Foo",
      "author_url": "https://www.google.com/maps/contrib/115896580386240513862/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLCDfR4sz9vkozSk-rmURLV1A4IHUF050aRVyjy2g8iKUtfIg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Here you can count on quality fresh pork and aged beef, non seasoned yet delicious and tender. Staff was there to grill meat cooked it to perfection ,at our table.  Naengmyeon is the highlight on their menu too. Worth mentioning, is the excellent service of all staff. Their korean ladyboss is very friendly and attentive to customers especially toward our children. 우리는 꼭 다시 올 거예요. Keep it up!",
      "time": 1735128096,
      "translated": false
    },
    {
      "author_name": "Li Ling Goo",
      "author_url": "https://www.google.com/maps/contrib/108142926825235423549/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocITKOMmotWCqL0J-k8Lo9qtDu2mESqgrW_cY_hDvAfQbxxSNQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "This is probably the best Korean bbq I’ve ever tasted in Singapore and JB. The meats are all not marinated but super tender, juicy and full of its natural favour. The amazing thing is all their dishes from cold noodle to pancakes to cast iron kimchi fried rice are top notch standard. My only complaint is they don’t have big green chilli. The staff and even the boss himself was accommodating and serve us so well. The ambience was cool and chill with Korean songs that kept my 4yo entertained. RM430 for 6 pax. Super worth it. We ordered boneless beef ribs, oyster blade beef, pork belly, 2x pork jowl, 2 cold noodle, 1 seafood pancake and 1 cast iron kimchi fried rice. And was given a potato pancake that blew our mind. Was so glad we chose this place!!!",
      "time": 1734362232,
      "translated": false
    },
    {
      "author_name": "Charlie Chan",
      "author_url": "https://www.google.com/maps/contrib/108888289487646302157/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWy1Gv91ttkTZ7vkczmzbEACPyedumMRruMPYwOCEK-DDJxrNwT=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "The Korean BBQ pork was a symphony of flavors and textures. The sizzling on the grill, filled the air with a mouthwatering aroma. Each bite was a delightful experience, with the tender meat melting in my mouth and the savory marinade tantalizing my taste buds.\n\nThe steamed eggs were a cloud-like delight, light and airy, with a subtle sweetness that complemented the richness of the pork. They were the perfect palate cleanser, refreshing my senses and preparing me for the next course.\n\nThe Korean pancake, crispy on the outside and soft on the inside, was a delightful finale to the meal. Packed with savory ingredients, it was a satisfying and flavorful way to end the dining experience.\n\nOverall, the combination of these three dishes was a culinary masterpiece, a feast for the senses that left me feeling satisfied and wanting more.",
      "time": 1729424792,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1397432169646252917",
  "user_ratings_total": 60,
  "vicinity": "Lot 71-01, Sunway Emerald Blvd, 88, Persiaran Medini 3, Sunway Iskandar, Iskandar Puteri"
}