{
  "formatted_address": "S-22-01, Pusat Komersil Versis Medini, 2, Persiaran Medini, Bandar Medini Iskandar, 79250 Iskandar Puteri, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.4158657,
      "lng": 103.6221964
    },
    "viewport": {
      "northeast": {
        "lat": 1.417199530291502,
        "lng": 103.6235413802915
      },
      "southwest": {
        "lat": 1.414501569708498,
        "lng": 103.6208434197085
      }
    }
  },
  "name": "Mexi-canz",
  "place_id": "ChIJY5_uprUL2jERKjv-AZ902pI",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Xian Nister",
      "author_url": "https://www.google.com/maps/contrib/103588159718027105952/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJYDgBgo27DUREIhRtK9VxOaJnyprsFoQnDBYGmHZGTTPSchA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Great variety of Indian-Mexican food. The butter milk chicken is smooth and creamy with tender chicken thigh meat. Rara lamb was a surprise. Very tender meat and little to no gamey taste at all, pairs very well with the nan. Recommended for people that like Indian and spicy foods.",
      "time": 1732426105,
      "translated": false
    },
    {
      "author_name": "Ganeswaran Dev",
      "author_url": "https://www.google.com/maps/contrib/111790842531065775983/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXdIbhQQg-DyFOybyV0SocLLhkng2vu98ICaUvDAtVjlCgQRWI=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Went for Mexican food but we ordered a mix of North Indian and Mexican food. We found out the restaurant has a mixed menu.\n\nQuesadilla was flavourful and loaded with olives and cheese. The pull was legit. It was so good we wolfed it down and we only managed to get a half eaten photo of it. Althought there were only 3 pieces, they were rich portions. We were expecting more portions because of the price point.\n\nOur favourite was their chicken tikka masala and garlic butter naans. Chicken was so tender we thought it to be fish fillets and the peppers and thick gravy complemented each other. The naan had a generous topping and was fluffy yet crispy thin.\n\nThe chocolate ice blended was too thick for my liking but my partner liked it.\n\nWe ordered add on mexican rice, chicken soup and chilli soup for RM 5 (which got us curious) but I just realised now as I was typing my review that we we not served this.\n\nTheir salsa condiment was rather strange. It tasted more like an Asian ginger chilli paste than a diced tomato salsa condiment we are used to. Maybe this is another style of making salsa?\n\nThe loaded french fries was a portion fit for 2-3 and they had a nice dust of chilli powder though it was not overpowering. I would suggest maybe more paprika /chilli dust  to suit the local palate?\n\nPrice wise, it is definitely not cheap because each dish is between RM 20-30. But you would expect similar price range from other restaurants of this quality.\n\nOther dishes that caught our eyes were their fajitas and rogan josh which we plan on trying next time.\n\nWe liked their taste and although did not order much Mexican food to give a solid review for now, I can easily vouch for their Indian/Pakistani food here. It was rich and flavourful.\n\nThanks to the waiters for being so mindful. He even offered me drinks upon realising I did not order any for myself. I was just too full that day.",
      "time": 1728378306,
      "translated": false
    },
    {
      "author_name": "Maryam Zamberi",
      "author_url": "https://www.google.com/maps/contrib/104760925555612475759/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWtvEzh-paE7-Yam5dFikraDxfZHHs85sVlSUyGg9fKFa1HxS9s=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Very nice dinner experience here. Owner and staffs were attentive, helpful and hospitable. Since we're not used to Mexican food, the staff helped explained which dish is nice and consist of what.\n\nWe really loved the taco dish as our appetizer, the taste is on point, and the condiment (which has cilantro in it) tasted sooo good. The casadillas, and chicken soup with tortilla were all tasty and splendid. Not an expert on Mexican food, but good food is, well, good food. Our casadillas was ordered with mexican rice and chilli as sides. The chili tasted awesome, but the mexican rice is so-so. Personally, I would order the chili dish separately next time to get bigger portion, it was that good. The mexican rice, I would skip.\n\nAs for the cajun chipotle pasta, tasted great but I personally preferred a bit more cajun spices and salt. The heat level is on the upper level, so those who like spicy food, this is for you.\n\nThere are kid menus too, so we ordered mac and cheese with chicken fingers. The chicken fingers were too spicy for my kids (they have zero tolerant to heat unfortunately), but a blessing, because they were really juicy and flavourful, us parents gladly finished them all off. I think cajun spice was used.\n\nBeverages that we ordered; avocado and mango smoothies were great. Very pleasantly surprised the drinks are not packed with sweetener. So we got to let our kids enjoyed the fruit smoothies guilt-free.\n\nOverall, very satisfied with the food and service. Price is in the middle range but totally worth it for the authentic Mexican food experience. All the best and keep up the good work for the owner and crews!",
      "time": 1697729330,
      "translated": false
    },
    {
      "author_name": "lawrence wee",
      "author_url": "https://www.google.com/maps/contrib/118362500278639992674/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU9lQl_qlMS1schQJru43uyLIV9xXBM9yYHlPNPQS3n5bi8Uqd20g=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Very nice Mexican food restaurants with indian food too.",
      "time": 1746261147,
      "translated": false
    },
    {
      "author_name": "Chelsea Lucy Rehman",
      "author_url": "https://www.google.com/maps/contrib/118364867695264085318/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUDBOgwq7f0YgShXKZ1E-W9bd--jqCyvTAfRZYhsq9pBhjP_P4t=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My family and I came here for dinner. What a wonderful place, the staff and owner are very welcoming, and the food is delicious.\nI had a spicy Cajun Chicken Pasta, and it really exceeded any expectations (unfortunately, I didn't get a photo of my pasta, as I finished it very quickly). They truly bring the Mexican flavours.",
      "time": 1693136207,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10581898500742462250",
  "user_ratings_total": 33,
  "vicinity": "S-22-01, Pusat Komersil Versis Medini, 2, Persiaran Medini, Bandar Medini Iskandar, Iskandar Puteri"
}