{
  "formatted_address": "100 Tras Street #14-01, #100AM, Singapore 079027",
  "geometry": {
    "location": {
      "lat": 1.2747431,
      "lng": 103.8435647
    },
    "viewport": {
      "northeast": {
        "lat": 1.276069230291502,
        "lng": 103.8450267802915
      },
      "southwest": {
        "lat": 1.273371269708498,
        "lng": 103.8423288197085
      }
    }
  },
  "name": "MHC Medical Centre (Amara)",
  "place_id": "ChIJ_9SSQmsZ2jERdlVG5EE3iYQ",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Yihui Low",
      "author_url": "https://www.google.com/maps/contrib/107316276736720502998/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXrpDg2X3F9h6cK2CxC60knvCHsQKluLiYTT3SuCkSVlZYtGtjo=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Unnecessarily long wait time when there are only a few individuals here. Staff at registration counter was slow, and can even get simple details like DOB wrong.\n\nSaw Dr Dana who showed absolute no care for the patient and rushed through the entire process. When we said “hello” to the doctor, he responded “sit down”. I’ve never seen a doctor with such bad attitude.\n\nExtremely extremely poor experience.",
      "time": 1740973861,
      "translated": false
    },
    {
      "author_name": "jamie",
      "author_url": "https://www.google.com/maps/contrib/105493896323134997292/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIS_FSxK7MZ2u3tT1snXzAeoyUTYXB1FwBbl0ty0NzQoq0nYg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 weeks ago",
      "text": "Normally not one to leave negative reviews but I had an incredibly poor experience here. Waiting time was incredibly long despite having an appointment, and I was quite faint because I was waiting over 2 hours for a fasted blood test.\n\nDoctors and nurses were a bit brusque, and bothering on rude. I don’t expect medical professionals to be customer service enthusiasts, but basic standard of care shouldn’t exclude being spoken down to or having concerns briskly brushed aside. I had some concerns regarding the biophysical exam, but the nurse impatiently dismissed my concerns and harshly told me to hurry up and comply with her instructions. I understand there is high workload , but still. My experience at the polyclinics has always been decent. This is a private clinic??\n\nFirst time I’ve ever left a clinic with blood running down my arms and my shirt after a blood draw. I have taken many blood tests and donated blood many times, this has never happened before. Asked counter staff for tissue, they asked me to walk all the way back to the same nurse, who scolded me for not applying pressure to the wound. Which I definitely did, I’m not new to these blood tests at all. I chose not to say anything, but I felt I was being treated like a young child.\n\nOverall lack of care, lack of concern for patient well being.",
      "time": 1746158635,
      "translated": false
    },
    {
      "author_name": "dude bugger",
      "author_url": "https://www.google.com/maps/contrib/114720473475931332235/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIwKEFpZ7XP9VQ9Bw0Hso-Ek7QRhUzeh1EZ4_nKpO1GZt4P0g=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "I am writing to express my frustration with the long wait time experience and disappointment with the lack of courtesy and professionalism displayed by the registration staff at the counter during the registration process at MHC at Amara .Despite arriving on time and following all necessary steps, I had to wait for 40minutes before my registration was completed (I have to approach them for a few times)\n\nThis delay was not only inconvenient but also caused unnecessary stress. I believe that a more efficient system should be in place to improve the experience for everyone. I kindly request that you look into this issue and take necessary steps to streamline the process.",
      "time": 1742798167,
      "translated": false
    },
    {
      "author_name": "Sunyoung Kim",
      "author_url": "https://www.google.com/maps/contrib/105551682655167172099/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIycpYel3HIhQTOIZstuw12iP92U-8JRNKVz7E816GalPdNsg=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "2 months ago",
      "text": "The doctor was kind and provided good service.\n\nHowever, the nursing staff needs improvement, particularly in service quality and hygiene practices. I was shocked to see a nurse with long fingernails, who touched me directly without washing her hands beforehand. She only washed her hands after taking a blood sample, which is highly concerning.\n\nIt felt like she prioritized her own comfort over patient safety, which is very disappointing. Proper hygiene should be a top priority in a medical setting. I hope the clinic takes this feedback seriously and implements stricter hygiene protocols for the staff.",
      "time": 1740128740,
      "translated": false
    },
    {
      "author_name": "Jaslyn Ee",
      "author_url": "https://www.google.com/maps/contrib/110542117683485739779/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLe1Fe6d2JrsXDajYw7VCqq5HcwtcjZnZ0YZyiReRIsetJ6iA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "Excessively long waits and completely disregard everyone time.\nAppointment at 10am, register for queue number (with no updates of how long to be called/ was told to take a seat and wait) and waited 2hrs to be called to the counter and proceeded to tell me to come back at 2pm because the doctor went for lunch.\nPlenty of room to improve their service and managing of appointments systemically within their own means.",
      "time": 1734933939,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9550225240958063990",
  "user_ratings_total": 3798,
  "vicinity": "100 Tras Street #14-01, #100AM"
}