{
  "formatted_address": "4 Siglap Ave S, Singapore 456264",
  "geometry": {
    "location": {
      "lat": 1.3166567,
      "lng": 103.9197989
    },
    "viewport": {
      "northeast": {
        "lat": 1.317986730291502,
        "lng": 103.9211183302915
      },
      "southwest": {
        "lat": 1.315288769708498,
        "lng": 103.9184203697085
      }
    }
  },
  "name": "Michelle HuiMin Bridal Veil | Bespoke Wedding Gowns Singapore",
  "place_id": "ChIJeWKOuowZ2jER2f70AkjqC_Y",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Diana Sanchez",
      "author_url": "https://www.google.com/maps/contrib/112561555815926693715/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIqDAbwGkGtBKU4ZYhH0_A3TRvbim2RugasDkXZqTDMjwh8gw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I had a really great experience doing my wedding & evening gown with Bridal Veil. Michelle & Yi Xia guided me throughout the process, they were so kind and fun to work with. Michelle is a fantastic designer and knew what I would look good in. She took the time to get to know me so she could incorporate my personality into the pieces she made. My purple cheongsam was such a great highlight, with lovely crane laces (her idea!). I received so many compliments on both gowns. Not forgetting my husband's dapper suit that was done by Colin from the Men's Club.\n\nThank you Michelle, Yi Xia & Colin for making us look great on our wedding day!!",
      "time": 1745142861,
      "translated": false
    },
    {
      "author_name": "Tan Janice",
      "author_url": "https://www.google.com/maps/contrib/114336214664084389284/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUWeslRYGcaJ7g8iEaSTkTA0TpyULvINkd5rSa9eEY-01tm8-an=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "we are glad that we found Bridal Veil and got our wedding day gowns and suit done by them. as a bride, i was particular about the gown that i would be donning on my big day and had specific requirements. Michelle was professional and her knowledge of bridal couture was evident even from our very first consultation. the bespoke gowns and suit that were tailored by Michelle, Colin and the team matched the brief that we had given them. we were impressed by the end product and would recommend them if you are looking for bespoke pieces for your wedding.",
      "time": 1708487980,
      "translated": false
    },
    {
      "author_name": "Samantha Eng",
      "author_url": "https://www.google.com/maps/contrib/100622465996697975448/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJpWffrX1Uwu6xPCB1Bn_JjHvtA0D2Jqs0wswXtvKI_aEI5Vg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "Bridal Veil was one of the first bridal boutiques we visited when gown and suit hunting, and we instantly fell in love with Michelle, Colin and YiXia's professionalism, friendliness and great eye for detail!\n\nWe decided on them almost straightaway and looked forward to our monthly (and when closer to the wedding, fortnightly) fittings with them.\n\nThe dresses (yes two, a white dress and a stunning blue dance dress) and suit they made for us turned out beautiful as they took the effort at each fitting to understand our needs and make adjustments where necessary. For example, I needed to dance in the blue dress and so Michelle made the effort to ensure that the length of the dress would not restrict my steps and that the material used allowed the dress to twirl beautifully (with a cheeky slit) during the dance!\n\nBeyond the dresses and suit though, what we really love about Michelle and Colin is their socialness and the genuine friendship they have extended to us. It's been a year since the wedding and we still catch up frequently during the amazing parties that this power duo host. Here's to a lifelong friendship with the Bridal Veil gang!",
      "time": 1598414872,
      "translated": false
    },
    {
      "author_name": "Eleanor Lim",
      "author_url": "https://www.google.com/maps/contrib/117825665669149954575/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWiXQxPFlWcvgzwEsX4-YXNyEI90Z88PYNrjYWys0NqZcPb15Gj=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "The gowns at Bridal Veil are one of a kind. You will not regret going to them. My experience with Michelle and her team was simply enjoyable. She will get to know you personally, understanding your needs, wants and style in order to design the gown of your dreams. You can rest assure that her gowns are made with great attention to detail and you will definitely be treated to a beautiful dress on your wedding day. I highly recommend that you check them out!",
      "time": 1618156157,
      "translated": false
    },
    {
      "author_name": "PY W",
      "author_url": "https://www.google.com/maps/contrib/110510292680645495175/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIcjTl6p-8qjwQo7QOB-orOfizPXA1-qTSM-jKwpwViMxnerg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Michelle and Yi Xia are an amazing duo who took care of all finer details to make sure the gown of your dream come true! We are glad that we went ahead with the decision with Bridal Veil to create our gown and suit for our wedding shoot. Even the locals at Santorini commented, \"It is the nicest gown I have seen all years!\" Such affirmation not just from us, but also from the people who saw it.\n\nThank you Michelle and Yi Xia for the entire process, from start to end! The discussion to pull the understanding and ideas together for the final creation. Really love the pants gown so much! 😍😍😍",
      "time": 1738149240,
      "translated": false
    }
  ],
  "types": [
    "clothing_store",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17729521953082244825",
  "user_ratings_total": 31,
  "vicinity": "4 Siglap Avenue South"
}