{
  "formatted_address": "Queens Close 21, 21 Queen's Cl, #01-0141 Block 21, Singapore 140021",
  "geometry": {
    "location": {
      "lat": 1.293258,
      "lng": 103.799986
    },
    "viewport": {
      "northeast": {
        "lat": 1.294590580291502,
        "lng": 103.8012953302915
      },
      "southwest": {
        "lat": 1.291892619708498,
        "lng": 103.7985973697085
      }
    }
  },
  "name": "Milagros de Montessori (Kindergarten) School",
  "place_id": "ChIJoZNdwjUa2jERPcfPh3CCYFY",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Ramya Thulasiraman",
      "author_url": "https://www.google.com/maps/contrib/115410516834653247173/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIQf7fUMOzVsJaDRUsLBCifPvdBqI1HoiDtynT_pTtybMY0z04=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Life's most important phases, just happen. Enrolling our son at Milagros was one such for us. We sent him in as a nursery child at Yew tee center with the usual tears of fear and anxiety.\n\nThe teachers there did a  tremendous job with so much love and care that the school felt as our extended home. Learning and development were holistic and kids were happy, confident and becoming independent. The curriculum and study materials were curated carefully. 'Magic' happened through the years and our son bloomed so beautifully in the safe hands of Milagros teachers.\n\nThey also prepared the kids for primary schooling during the last semester of Kindergarten which I've never seen in other schools. Their Annual/Graduation day is a big day that's been looked forward by both, kids and parents. Overall we as parents, very highly recommend this school. Thank you Milagros and team for doing one of the most beautiful jobs in the world!",
      "time": 1738912928,
      "translated": false
    },
    {
      "author_name": "Sugandha Pandia",
      "author_url": "https://www.google.com/maps/contrib/105033813813405392057/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKCv-t48-y_vJT2QQxyMRw0MpkzvBsZLird-DeQYKh-FeYV7A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "We could not have asked for a better school for our son. He started here when he was 18 months old... over the years we have seen him blossom and grow and learn so much.\nThe stand out part about Milagros are the teachers. The teachers are extremely atttentive and loving. When I see them interact with my son, I feel a huge sense of relief and joy .... because it feels he is safe, cared for, loved and has a lot of fun. They know every little detail about him, including his food preferences (which even I miss sometimes)\nHis confidence and vocabulary has improved remarkably. I cannot recommend this school enough - esp. for a tender age, where imparting values and life skills are so important. It is a home away from home.",
      "time": 1734064288,
      "translated": false
    },
    {
      "author_name": "Simin Low",
      "author_url": "https://www.google.com/maps/contrib/104723990566352415951/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIXsCGd0ELi8MCHuSVXy9GzeNjcWFf67WfcqdnHQVWfabDSaw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "\"Play is the work of a child,\" and learning through play is truly one of the most enriching experiences for kids! At Milagros, children are always excited to go to school, eager to explore and discover something new every day.\n\nThere are no limits to what a child can dream, learn, or achieve! The hands-on activities and creative approaches, like becoming \"multilingual\" through music, inspire creativity, curiosity, and a lifelong love for learning.\n\nA heartfelt thank you to all the amazing teachers at Milagros for your patience, dedication, and guidance toward Rebecca and Isaac. You’ve made deep footprints on their journey, shaping their growth and inspiring their potential!\n\n\"Mighty, mighty Milagros!\"",
      "time": 1733708716,
      "translated": false
    },
    {
      "author_name": "SASA",
      "author_url": "https://www.google.com/maps/contrib/103828265798795088639/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVJd_kuWXhTUpxzgL-DoLKUH3So5ku0ZfVniTsT93UZkzulk-KQkA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "My daughter(Akshara) miss this school badly ☺️.  Highly recommend Milagros is a blend of Love, Compassion, Education and Fun. You can observe the kids confidence level is increase after joining here.  Kids can enjoy the fun learning experiments. 😍🤩",
      "time": 1616295610,
      "translated": false
    },
    {
      "author_name": "Nyka Tan",
      "author_url": "https://www.google.com/maps/contrib/100343454015586188996/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXCWBUNK8GWgpttLX2TfoYALwGbxYOIPntB6VflTUqBnsOlEUT0=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Highy Recommended⭐️⭐️⭐️⭐️⭐️\nWe are absolutely thrilled with our  experience at Milagros de Montessori.  Since joining, my child has become so much more independent ⭐️⭐️⭐️⭐️⭐️ and confident. We’ve noticed remarkable improvements in their social skills, learning abilities, and overall development.\n\nThe teachers are incredibly patient, kind, and attentive ⭐️⭐️⭐️⭐️⭐️. It’s clear that they truly care about each child’s individual needs and progress ⭐️⭐️⭐️⭐️⭐️. They create such a nurturing and supportive environment that helps the kids thrive.\n\nWe’re also impressed by the variety of activities and how they make learning fun and engaging. It’s a joy to see how much my girl looks forward to going to school everyday. It’s such a wonderful place for children to grow, learn, and feel cared for!\n\nThank you TrJill and to all teachers ❤️",
      "time": 1734871997,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6224118104852514621",
  "user_ratings_total": 16,
  "vicinity": "Queens Close 21, 21 Queen's Close, #01-0141 Block 21"
}