{
  "formatted_address": "65 Airport Boulevard #03-22/29, Terminal 3 Singapore Changi Airport, Singapore 819663",
  "geometry": {
    "location": {
      "lat": 1.3563,
      "lng": 103.987354
    },
    "viewport": {
      "northeast": {
        "lat": 1.357612280291502,
        "lng": 103.9887818802915
      },
      "southwest": {
        "lat": 1.354914319708498,
        "lng": 103.9860839197085
      }
    }
  },
  "name": "MindChamps PreSchool @ Changi Airport Terminal 3",
  "place_id": "ChIJD9x1U4w82jER_CyCuY7iR6s",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "HuiFei Xiang",
      "author_url": "https://www.google.com/maps/contrib/107504523182458339993/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUKksscDHoTof3vWf1SpoS1HXBQgG04wGlGA1oxyKcs0-_QY1uC=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "The Natural Literacy Workshop for parents was insightful and engaging! The mystery case and storytelling activities made learning even more exciting and interactive. It was a great opportunity to understand how our children explore and develop their literacy skills in a fun way. This session provided valuable strategies for us to support their learning at home. Looking forward to the next workshop! Thank you Ms Fatin and teachers!",
      "time": 1740660610,
      "translated": false
    },
    {
      "author_name": "Noorhidayah Taib",
      "author_url": "https://www.google.com/maps/contrib/110307936827050783116/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ-J9IhqbXtZ45e8DfpngVk1z6EV4N9YLfyMnZqkBuUHBfUew=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "My child has been attending since PG, and it has been a truly wonderful experience for her. The teachers are exceptionally loving and caring, and she eagerly looks forward to going to school each day. She loves sharing the fun activities and experiences she enjoys there. The workshops conducted were very good and engaging!",
      "time": 1743068150,
      "translated": false
    },
    {
      "author_name": "A M",
      "author_url": "https://www.google.com/maps/contrib/105243269056524641603/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXSANvD8gawFDfNs-gQHF4YXFqf1S98SQmu9wAm2ctgn301VYacIw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Graduation Ceremony Review for K2\n\nThe K2 graduation ceremony was a delightful and heartwarming event that beautifully celebrated the achievements and milestones of these young learners. The event was meticulously organized, offering a perfect blend of pride, joy, and nostalgia for the children and their families.\n\nThe highlight of the ceremony was undoubtedly the performances and musical presentation. The children’s enthusiasm and energy were infectious as they showcased their talents through songs, dances, and a well-rehearsed musical. It was evident that a lot of effort had gone into preparing for the event, with every child given the opportunity to shine on stage. The costumes were vibrant and creative, complementing the overall theme of the musical, while the choreography was age-appropriate and charmingly executed.\n\nThe musical performance, in particular, was a testament to the dedication of the teachers and the children. The storyline was engaging, with a meaningful message that resonated with the audience. The transitions between scenes were seamless, and the children’s confidence and teamwork were remarkable for their age.\n\nThe ceremony concluded with the graduation segment, where each child received their certificate of achievement. It was a proud moment for the parents, who couldn’t help but cheer and capture the memories on their cameras. The atmosphere was filled with warmth and celebration, leaving everyone with smiles on their faces.\n\nOverall, the K2 graduation ceremony was a resounding success. It not only marked a significant milestone for the children but also showcased their growth and creativity through a well-executed performance. A huge applause to the organizers, teachers, and little graduates for creating such a memorable experience!",
      "time": 1734149303,
      "translated": false
    },
    {
      "author_name": "Najia Anwar",
      "author_url": "https://www.google.com/maps/contrib/103540464323450081692/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLJiDjHWlSvggp9b-u7RgK-A6xJSus69sOfqckhHKJNofMRhw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "MindChamps @ CT3 is a great preschool! The space is amazing, and the airport ambiance adds such a fun and unique touch to the environment. The teachers really make the most of the facilities to create meaningful learning experiences for the kids.\n\nThe curriculum is also a big highlight. It’s more advanced, which really helps prepare the children—not just academically but also socially. The teachers are attentive and make sure the kids are nurtured with positive habits that set them up for the real world.\n\nI’d definitely recommend this school to parents looking for a well-rounded and supportive place for their little ones!",
      "time": 1733058371,
      "translated": false
    },
    {
      "author_name": "Dezhi Alfred Qiu",
      "author_url": "https://www.google.com/maps/contrib/100843293268276390148/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIZ7TUprAn6f4FgUQJsORNPK790MJyvFdqfGmlFNyOBOOpmrw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "The MRW workshop is very informative and allow parents to understand what the champs are learning in class. Look forward to more of such workshops in the future!",
      "time": 1740045590,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "school",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12342082406457683196",
  "user_ratings_total": 88,
  "vicinity": "65 Airport Boulevard #03-22/29, Terminal 3 Singapore Changi Airport"
}