{
  "formatted_address": "51 Changi Business Park Central 2, #01-16, Singapore 486066",
  "geometry": {
    "location": {
      "lat": 1.335372,
      "lng": 103.9649552
    },
    "viewport": {
      "northeast": {
        "lat": 1.336790130291502,
        "lng": 103.9662177802915
      },
      "southwest": {
        "lat": 1.334092169708498,
        "lng": 103.9635198197085
      }
    }
  },
  "name": "MindChamps Performing Arts PreSchool @ Changi Business Park",
  "place_id": "ChIJ____T9c82jER0kOpoSgBLOE",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Phoebe",
      "author_url": "https://www.google.com/maps/contrib/109538211867976976245/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJmojfheypYlXnoY51eowFKZD8kp4Y3CQ0-CYI6hEQwm9qlYQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Our family loves this preschool. They recently hosted a fantastic Chinese New Year celebration, inviting all parents to join in the festivities. It was such a joy to watch the children’s performance—they did such a great job! The event was filled with fun activities, including mini games and a lively Lou Sang, making it a truly interactive and memorable experience. The staff put in so much effort to make everything special, and we truly appreciate their dedication. It was a fun and meaningful afternoon for both kids and parents. Thank you for creating such a wonderful learning environment!",
      "time": 1739517569,
      "translated": false
    },
    {
      "author_name": "Terry Daniel",
      "author_url": "https://www.google.com/maps/contrib/102729602675198503816/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKIMSJgY5PW2l2K7Rbe2eY-1_NUUzMBAt3Zqpxa0oeqVCgqFw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "We had a tour of a couple of MindChamps centre, but ultimately settled for CBP. The centre is so well-run, organized, clean and they even recently renovated to ensure everything is new and up to the times. My 2 year old loves his teachers so much and they organize so many engaging activities with the parents. Definitely made the right choice in choosing this school.",
      "time": 1739419831,
      "translated": false
    },
    {
      "author_name": "Yirong Ye",
      "author_url": "https://www.google.com/maps/contrib/104805111404861340857/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLcHgTBVx-yJpCiqwGhuZ0R2P7dRfiQf7DvaHODSIiSyIFHbQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "We’ve sent both our children here (transferred from another kindergarten) and it was the best move we’ve made for their growth and development.\n\nThe teachers have been patient, kind and understanding, and our little ones have always felt at home under their care.\n\nStaffing ratio is extremely generous, with different teachers for reading and writing, english, chinese, drama and music.\n\nImmensely grateful to this wonderful team who gave our children a strong head start in life.",
      "time": 1677501369,
      "translated": false
    },
    {
      "author_name": "Ploy B",
      "author_url": "https://www.google.com/maps/contrib/112408957641047299500/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXalngwJ4efxKXXqYLBYN2TZVP0trUTvabhH6X3xZr8JsrBoes=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Great pre-school, my daughter has huge development from introverted daughter to be outspoken child. She love going to school everyday and come back home with happiness and positive behaviour and mindset. Thanks for all teachers and passion to improve our daughter.",
      "time": 1739415960,
      "translated": false
    },
    {
      "author_name": "Nur'Ashikin Ahmad",
      "author_url": "https://www.google.com/maps/contrib/104063399322000333312/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKwFeoMKOqYeV6U0b9Fh8xWkCnsS0WrT_6Gv87Q__uXcQVY5w=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Wonderful preschool! As a working mum, the staff and teachers at Mindchamps CBP make it so easy for me to juggle work commitments without having to worry about my child's well being and development.\n\nPerfect outdoor and indoor location where kids have a dedicated area for waterplay and their own playground! This was important to us as we wanted our child to spend time in the sun too! Teachers also incorporated learning in the outdoor play to help kids to truly understand concepts.\n\nTeachers are prompt in responding to parents and always see themselves as a team with parents. This is a wonderful way of raising kids. In PG and Nursery, the focus is very much on social skills and interacting well with others while still keeping up with academic developments. In kindergarten, teachers focus on building independence with the kids and preparing them for primary school. Mindchamps CBP also has drama, ballet and music classes so kids are kept actively engaged in their interests.\n\nFood menus are shared with parents in advanced so you know what your kids are being fed. Always lovingly cooked fresh and kids also have sessions where they try their hand at preparing simple dishes.\n\nWe absolutely love having our child here! She's really developed very well and we can see that she really enjoys school!",
      "time": 1677651082,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16225344831531598802",
  "user_ratings_total": 32,
  "vicinity": "51 Changi Business Park Central 2, #01-16"
}