{
  "formatted_address": "512A Thomson Rd, #02-01 SLF Podium, Singapore 298137",
  "geometry": {
    "location": {
      "lat": 1.3331363,
      "lng": 103.8390793
    },
    "viewport": {
      "northeast": {
        "lat": 1.334568730291502,
        "lng": 103.8404313302915
      },
      "southwest": {
        "lat": 1.331870769708498,
        "lng": 103.8377333697085
      }
    }
  },
  "name": "MindChamps Chinese PreSchool @ Thomson",
  "place_id": "ChIJW7XOYlwX2jER1K_29oGHOhw",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Astee K",
      "author_url": "https://www.google.com/maps/contrib/112672888136260615013/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI_BCcVHNsX9pD8U1XyNtJ1cezTYTMrUJeSSGBj4muZ7j-ffQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "This preschool has exceeded our expectations in so many ways! Our child has been with the school since he was 18 months old in their Playgroup class, and we have absolutely no regrets sending him here. When the time comes, our younger child will also be joining this wonderful center.\n\nThe principal, Ms. Jo, is highly responsive and always follows through on any concerns, creating a trustworthy and well-managed environment. Feedback is genuinely valued here and often put into action. For instance, when we requested a year-end memento class photo, Ms. Jo went above and beyond, arranging a fun photoshoot for the kids — a unique and thoughtful touch beyond the usual class portraits.\n\nThe school offers engaging out-of-school activities that my child absolutely loves. We’re particularly impressed with the excellent Chinese immersion program — our child is now confidently communicating in Mandarin, even in out-of-school settings! It’s amazing to see how their language skills have flourished.\n\nThe teaching staff is incredibly devoted, with their passion extending beyond just the classroom teachers to include non-form teachers as well. The preschool also provides great opportunities for parental involvement, helping us feel connected and engaged in our child’s learning journey.\n\nHighly recommend this school for its dedication, exceptional programs, and supportive community!",
      "time": 1747383588,
      "translated": false
    },
    {
      "author_name": "Claire Low",
      "author_url": "https://www.google.com/maps/contrib/113372700602399864715/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLxkbApChATQgYF4mDf6_mZpHlMmc9U2ml0QHyWOH8vqdTg3w=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "My husband and I decided to enrol our child into this Mindchamps particularly for their Mandarin-centric programme, as we are not strong Mandarin speakers at home.\n\nPrincipal Jocelyn, and her team of dedicated teachers truly go above and beyond for each child. They plan meaningful activities for special ocassions like Mother & Father's day, Children's day etc., which visibly takes a lot of time and effort. Every teacher knows each child’s name and are respectful to all parents.\n\nThe school environment is bright and clean, and the gym is a big hit for all the children. Our child also enjoys all the other activities that the Mindchamps curriculum has to offer, like music, gym, and gourmet lessons.\n\nThe only downside is that drop-off and pick-up can be a bit inconvenient due to the location, especially during peak hours in the mornings. But we work around it and park at the SLF/MSF open air or underground carparks, though this will incur a fee.\n\nHowever, the quality of education and care our child receives more than makes up for this minor challenge.",
      "time": 1731167009,
      "translated": false
    },
    {
      "author_name": "Sheryl Ho",
      "author_url": "https://www.google.com/maps/contrib/100367535108702833182/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKREe5A_B7eRFty0CVYwMxD9zqnczOph7hR5SKY9IS4bTAYBQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Switched my child when she was in N2 for the main reason of exposing her to Mandarin. Overall, the school provides a nurturing and stimulating environment. Teachers are knowledgeable, patient, and creative, ensuring that every child receives individualized attention and support. The curriculum is engaging and age-appropriate, promoting holistic development. Communication with parents is excellent, fostering a strong partnership between home and school.  There is some room for improvement as I do note the high turnover rate of the staff.\nOverall, Mindchamps Thomson is a wonderful place for children to learn, grow, and thrive. My child loves school and looks forward to the lessons",
      "time": 1705733060,
      "translated": false
    },
    {
      "author_name": "Serene Ker",
      "author_url": "https://www.google.com/maps/contrib/105998788152113138875/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLIHOnIUQGgYOZLs-6EPqEVmn-DcOb3C8i0KH6A8pQnmhPOcw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "My son joined Mindchamps CPS Thomson since PG, and I will soon be enrolling my daughter. The school is clean, bright and conducive for learning, nestled on elevated ground away from the crowd. The Chinese immersion program is effective to help the little ones familiarise and build confidence in Chinese language. The timetable has a good mix of academic, play and social elements. Best of all, the teachers are caring and deeply vested in the children’s development (even those who are not his class teachers!). Overall, this school gives us peace of mind knowing they are thriving there everyday! Please keep up the good standard!",
      "time": 1722658529,
      "translated": false
    },
    {
      "author_name": "DNA Lim",
      "author_url": "https://www.google.com/maps/contrib/115532893622290990917/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLfgnF2pRcOLnKHUsRJma2_kuWAYcU_5tVj4FaJbarH8LayJg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "We enrolled our first child into Mindchamps Chinese PreSchool since PG and likewise for our 2nd born who is commencing soon.\n\nWe have no regrets and it was an easy decision due to the existing teachers and current principal Ms Jocelyn, as well as the school in keeping the teachers to kids ratio low.\n\nIn the past few years, I’ve seen numerous principal changes but none as hands-on as her. She walks the talk and actively participates in various activities and knows each kid personally. She gets things done efficiently, is very responsive and cares deeply for the kids well being.\nIt’s lovely to see a principal so involved day in day out, especially taking the time and effort to gather teachers to organise and plan special events such as Mother’s Day, Father’s Day etc, was heartfelt.\n\nI’ve seen my kid flourish with confidence in mandarin, when we hardly speak at home. To naturally respond in mandarin, reading & writing and singing songs, poem in mandarin at such a tender age is very impressive!\n\nNo doubt all credit goes to the wonderful teachers and Ms Jocelyn for their patience and care.\n\nI do hope the owners do their best to keep these truly amazing gem of educators !",
      "time": 1719467903,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2034087173975093204",
  "user_ratings_total": 22,
  "vicinity": "512A Thomson Road, #02-01 SLF Podium"
}