{
  "formatted_address": "60 Yishun Ave 4, #01-08 SAFRA Yishun Country Club, Singapore 769027",
  "geometry": {
    "location": {
      "lat": 1.4237399,
      "lng": 103.8407407
    },
    "viewport": {
      "northeast": {
        "lat": 1.425082280291502,
        "lng": 103.8420732802915
      },
      "southwest": {
        "lat": 1.422384319708498,
        "lng": 103.8393753197085
      }
    }
  },
  "name": "Mind Stretcher Yishun",
  "place_id": "ChIJt7hv52UU2jERkQI2UqYvX6M",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Junie Tio",
      "author_url": "https://www.google.com/maps/contrib/108380523226184875925/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX0unpk5ni1FDkdPJ887pakkp_b7qfpgGQgeYAbFquT8gDJhVc=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I am writing to express my deep gratitude and appreciation for Ms. D. Her dedication and passion for teaching have made a significant impact on my learning experience. Ms. D has a remarkable ability to make complex concepts understandable and engaging. Her enthusiasm and commitment to her students go beyond the classroom, as she always takes the time to offer support and encouragement. Her positive attitude and genuine care for her students create a motivating and inspiring learning environment. I am truly thankful for her guidance and the difference she has made in my academic journey, she sacrificed her time to encourage us. Can be in different ways like giving us sticker when we do do well I am truly grateful to have her",
      "time": 1740560087,
      "translated": false
    },
    {
      "author_name": "Nuannuan Liu",
      "author_url": "https://www.google.com/maps/contrib/100944367178153108510/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLkGnwW_IKlRHX7rrGl_P8vfNDPMNzZeACWkguuMB1mAwpmwg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Dear Teacher Alice (from P5 science class on Thursdays),\n\nI just wanted to take a moment to say a big thank you for everything you do. Your support and dedication really mean a lot to me. I’m especially grateful for your help in boosting my science marks from AL5 to AL2. The way you teach makes a huge difference—your clear explanations and enthusiasm make learning so much more enjoyable and effective.\n\nYou’ve not only helped me understand the material better but also sparked a genuine interest in the subject. Your encouragement has motivated me to do my best and has made a real impact on my confidence. I really appreciate the effort you put into making every lesson engaging and meaningful. Thank you for all that you do and for creating such a great learning environment.\n\nBest regards,\nMetis",
      "time": 1724489842,
      "translated": false
    },
    {
      "author_name": "Jaynesh",
      "author_url": "https://www.google.com/maps/contrib/113630889401876679635/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX8Nz2uTS96ykE4U-M4HKTWtC5oPXOvz1cK3A1dLD_SKxkMvro=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Dear Ms Judy,\n\nAs I reflect on my journey in your class, I’m filled with immense gratitude. Your passion for math and science has not only deepened my understanding but also sparked a curiosity in me that I never knew existed. You’ve taught me to approach challenges with a problem-solving mindset and to see the beauty in the logic and patterns of the world around us.\n\nThank you for your patience, dedication, and unwavering support. You’ve made learning an adventure, and I will carry the lessons you’ve taught me far beyond the classroom.\n\nWith heartfelt appreciation,\nJaynesh",
      "time": 1724558345,
      "translated": false
    },
    {
      "author_name": "Valerie Woo",
      "author_url": "https://www.google.com/maps/contrib/114548527195448880948/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJVehW2KRx-9WPH5My7qk0O0L3ZdNz3g6jn8TWDNKVfRBBTDnA=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "8 months ago",
      "text": "My MS teacher is Ms Mala, and she has helped me in math by understanding the topics well and helping me with the questions that I don't know. One thing I really like about her is that she is very patient and helpful, and she is also very kind towards us. Thank you for teaching us and sharing with us about your dog during breaktime, he seems really cute :) Happy Teachers' Day!!\n- Valerie Woo",
      "time": 1724549531,
      "translated": false
    },
    {
      "author_name": "Eric see",
      "author_url": "https://www.google.com/maps/contrib/116617106877832362480/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLM-Z_FVSqL8PnYOgJoIdRd7YzR06EpGPls0pXwO4HafDeDEA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "Dear Miss Dee,\n\nI wish to express my heartfelt gratitude for the wonderful work you've done with my son in both GEP English and GEP Mathematics. Your caring, patient, and personable approach has made such a positive impact on him, and he thoroughly enjoyed every lesson with you.\n\nIt's evident that you pay special attention to each student in your class, making sure they receive the support they need to thrive. Your ability to make the lessons interesting, combined with the enriching materials you provided, has truly expanded his knowledge and understanding. We have seen a tremendous improvement in both his English language and mathematics abilities.\n\nThank you for your dedication and for making such a difference in my son's learning journey. We are grateful for all that you have done.",
      "time": 1724244398,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11772180342360113809",
  "user_ratings_total": 45,
  "vicinity": "60 Yishun Avenue 4, #01-08 SAFRA Yishun Country Club"
}