{
  "formatted_address": "273C Punggol Pl, #01-882, Singapore 823273",
  "geometry": {
    "location": {
      "lat": 1.4022449,
      "lng": 103.9013507
    },
    "viewport": {
      "northeast": {
        "lat": 1.403504730291502,
        "lng": 103.9026905802915
      },
      "southwest": {
        "lat": 1.400806769708498,
        "lng": 103.8999926197085
      }
    }
  },
  "name": "Ming Kitchen Seafood 名厨海鲜煮炒",
  "place_id": "ChIJAQDQv-IV2jER87lDNU4XSwM",
  "rating": 2.1,
  "reviews": [
    {
      "author_name": "Mark Heng (Infosphere)",
      "author_url": "https://www.google.com/maps/contrib/102479625642210396540/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU0SVczwTJ6KtYmF9O8ozf74Prm2VScp4QTg-P6ZVnaY90SxgVX=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "in the last week",
      "text": "Visit date: 15 May 2025\nActual rating: 4.25\n\nOne of the few decent* tze char places in Punggol imho 😆\n\n(Another can be found in the coffee shop near Sumang Domino's...)\n\n*However, #MHTamChiak is shocked to see that this place had garnered a mere 2.0 rating! 🧐\n\nMy \"solo diner\" meal of pork ribs with rice came with 4 sizeable and thick (8-10mm?!) pieces of deep fried meat. These had tangy brown sauce slathered on.\n\nBut as I ate on, the saltiness in the sauce became too much, sadly!\n\nTonight's ribs were less tender than usual, as normally it would require little effort to cut through the meat with a spoon. Still, the meaty pieces -- a couple would be bone-in -- will win you over 😋\n\nThe steamed rice failed to get my #CannotCookRiceProperly recognition, which is actually a good thing 😜 Lol\n\nOverall, a simple but satisfying quick dinner that's served hot 👍",
      "time": 1747312213,
      "translated": false
    },
    {
      "author_name": "Freya Lim",
      "author_url": "https://www.google.com/maps/contrib/107382699346279348622/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUNNdPXHFg30ZWe1FA2k77dzPUkU2ZvtDu_3_4Zr7eVbOSIbX69GQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "I actually like their fried rice. But the texture of the rice is inconsistent. It's always very hard and dry.\n\nI have been a regular customer for years. I'm sure the auntie at the counter recognize me. One time I ordered fried rice (without egg) and went to collect at 940pm. Turned out she gave away mine to a customer who ordered fried rice WITH EGG. Hence the one that was left for me came with an EGG. She said I didn't order egg. I suggested she passed me the wrong one (with egg though I didn't ordered). It was 945pm. No more customers. But instead of making it a goodwill (since it was their mistake), she opened up the fried rice and threw away the egg right in front of my eyes. She would rather the rubbish bin have the egg than to pass it on to a regular customer as a form of goodwill. Nothing wrong. But it says a lot about their lack of EQ.\n\nIt is also the only stall in Singapore that has to ask for the exact payment in what mode IN ADVANCE when we call for order.  For example, if a fried rice with egg takeway is $5.50, I would have to detail the payment to be $5 from CDC voucher and $0 50 by cash. If I happen to run out of cash and requested to make the payment of $0 50 by GrabPay, I would be scolded. Until today, I don't know the logic when other stalls in Singapore do not do this.\n\nSeriously, if there are other eateries in Punggol (which are still few and far between in the yr 2025, with Punggol being the size of AMK, but only one Hawker), I would not have visited this stall.\n\nWorst service.",
      "time": 1743940806,
      "translated": false
    },
    {
      "author_name": "Joanna Jo",
      "author_url": "https://www.google.com/maps/contrib/117264763334436256927/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLYzk1a2qm0a3B_joTPVts5R7aA9qcyYMJ3LEt69ywhTplung=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "food portion so little for breakfast noodles now , look at the box. different people give different portion. Vegetable rice prices keep increasing , 2 packets rice now can cost $10 plus till even $12 plus! i really got a shock that day",
      "time": 1730766104,
      "translated": false
    },
    {
      "author_name": "Alfred ho",
      "author_url": "https://www.google.com/maps/contrib/111847154516022642987/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIeCDR6X4JhV6eCc_dEQZRtL7eN_eSb0EhISiSHPG81B0QLQw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "2 years ago",
      "text": "Generally the food is affordable and the waiting time is short excluding peak hours. Quantity is huge for their single meal ie. hor fun, fried rice and etc. I would not said the taste is fantastic but still can passed. I normally go for their fish head steam boat, prawn paste chicken and seafood hor fun. I would avoid their vegetable dishes as it cost you almost same or more then the meat dishes.",
      "time": 1669507392,
      "translated": false
    },
    {
      "author_name": "G T",
      "author_url": "https://www.google.com/maps/contrib/112595224417139812907/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJlXO8tIssqewoVqqQcJgsNLvTtD6gZVRCP7XN6G-gJxKZOtw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "I ordered fried rice for my son, but when we got home, he complained that it was hard. Initially skeptical, I decided to taste it myself, and indeed, it was inedible. A disappointing experience with this stall's fried rice, especially considering my 9-year-old only managed to take a single mouthful.",
      "time": 1700219167,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=237309030035601907",
  "user_ratings_total": 24,
  "vicinity": "273C Punggol Place, #01-882"
}