{
  "formatted_address": "133 New Bridge Rd, #02-32 Chinatown Point, Singapore 059413",
  "geometry": {
    "location": {
      "lat": 1.2852093,
      "lng": 103.8447228
    },
    "viewport": {
      "northeast": {
        "lat": 1.286747380291502,
        "lng": 103.8461400302915
      },
      "southwest": {
        "lat": 1.284049419708498,
        "lng": 103.8434420697085
      }
    }
  },
  "name": "Minmed Clinic (Chinatown)",
  "place_id": "ChIJEXpDfYcZ2jERHHg177cYy1c",
  "rating": 3.9,
  "reviews": [
    {
      "author_name": "Hye Eun Bang",
      "author_url": "https://www.google.com/maps/contrib/116432610674914476010/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK5jus3UPv2UxEtsyX1mbpYccrIqhWtWsUffdHb9eXBryHqNg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "Do not book appointments at Minmed Chinatown. I don’t even want to put a star but was forced to or else I can’t upload this post.\nMade flu vacinnation appointment for Jun 2024 only to be cancelled the night before the appointment.\nI thought it was a one-off hiccup and gave them another chance in May 2025. This time I booked a health screening with them for two pax, costing almost $500. They even sent me email the day before to remind me of my appointment for the next day. A few minutes before the appointment, I even received notification telling me that it would be my turn soon and I was second in line. But when I reached there, a temp staff told me that my appointment was cancelled!!! When I asked why didn’t anyone inform me beforehand, he said he only knew it that morning and had been making calls to patients. But since my appointment was early in the morning, I don’t understand why he would miss out and didn’t inform me early. We made the trip specially to Chinatown Minmed on a Sunday and no apology was issued at all. This makes us very disappointed with Minmed at Chinatown.",
      "time": 1747041345,
      "translated": false
    },
    {
      "author_name": "ML Tan",
      "author_url": "https://www.google.com/maps/contrib/112148356576757035749/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJyuZK8VUT6dntkYZAW5ROews0zyuYvEnZtn1pJ5-91m809cw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Dr Shermain is quick and precise. Front desk is polite and efficient. A fuss free and quick doctor visit when you are unwell! You can also request queue number via their app.",
      "time": 1747117865,
      "translated": false
    },
    {
      "author_name": "Mac",
      "author_url": "https://www.google.com/maps/contrib/117694066417371703449/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLAer0WeQ4jXmlTFlTl_g5FdAd7SyejGt6CGC88kZcsb_AP-ts=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "This clinic is excellent. From the accommodating receptionist to the outstanding doctor. My doctor made sure only the necessary tests were conducted, which helped me save money compared to other clinics I've visited. Despite spending less, all my health concerns were fully addressed. Highly recommended!",
      "time": 1746333434,
      "translated": false
    },
    {
      "author_name": "KS",
      "author_url": "https://www.google.com/maps/contrib/114264214959994725558/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocITomp9pFZ38svDJbWjFjFAGsDkbZ9qmeTfrIoFpXGm8XUaVg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I went for health screening and consultation during the lunch time today and two days ago. The front desk clinic assistant is patient, friendly and kind.\n\nDespite being the only single person to manage the registration, measurement, urine collection, dispensary etc, she managed to handle everything with swift action and concise communication, without holding the patients for long. She patiently informed each patient the number of patients ahead in the queue.\n\nShe genuinely made a difference and her efficiency makes my visit to the clinic so much easier and more pleasant. Keep up the great work!",
      "time": 1732185653,
      "translated": false
    },
    {
      "author_name": "Austin Hansen",
      "author_url": "https://www.google.com/maps/contrib/114474980915514477518/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUOk-UVJPERPZkjX9o-q_lqCEx4l6qN7mDJPvtMVRfZAR7Y6GPY4g=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "I had a terrible experience at this doctor's office.  Their website clearly states walk-in hours from 6-9pm, which is why I came in tonight.  I'm quite ill and urgently needed to see a doctor. After waiting for 15 minutes, I was abruptly told that no doctor was available.  To add insult to injury, the staff was completely unempathetic to my situation and simply referred me elsewhere.  This is unacceptable, especially when you're feeling unwell and seeking medical attention.  False advertising and a complete lack of compassion.  Avoid this place if you value your time and health.",
      "time": 1739874164,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6326177279843334172",
  "user_ratings_total": 29,
  "vicinity": "133 New Bridge Road, #02-32 Chinatown Point"
}