{
  "formatted_address": "10 Eunos Road 8, #02-122, Singapore Post Centre, Singapore 408600",
  "geometry": {
    "location": {
      "lat": 1.3189418,
      "lng": 103.8944605
    },
    "viewport": {
      "northeast": {
        "lat": 1.320502080291502,
        "lng": 103.8957959802915
      },
      "southwest": {
        "lat": 1.317804119708498,
        "lng": 103.8930980197085
      }
    }
  },
  "name": "Minmed Clinic (Paya Lebar)",
  "place_id": "ChIJM29fx84Z2jER4Av1SB9fHJE",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Nick",
      "author_url": "https://www.google.com/maps/contrib/111943008651073737235/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJduyBuYRcPED4IYJTCbL0bdj3Xu9oC3oZfIgSh9Mw94c2w-Do=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "Very unprofessional medical consultation. Patient was rule out Covid and was only suggested to self-purchase Covid test kits outside when expressed concern with high fever! I hope clinic could review its medical consultation process and ensure sufficient test kits are in stock…",
      "time": 1745914676,
      "translated": false
    },
    {
      "author_name": "FaiTh Lim",
      "author_url": "https://www.google.com/maps/contrib/116118846705505848713/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVXXG1XzePTkj2mf2hB1NQGkoWipR2hODaF4Y98c8hchDS5NSI4=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "7 months ago",
      "text": "Horrible experience. I hope the same will not happen to others (beside doctor and nurses)\n\n1. System failure; we took a queue number via system app but when we reached the clinic at 2 pm, we were told that the queue number was not registered. We had to wait for 9 patients before our turn with my sick 1 year old despite taking a queue number which we took in advance.\n\n2. Lack of empathy; when explained that my one year old is sick and we hope to get our original queue or at least see the doctor earlier. The reply is 'theres nothing we can do and you will need to follow the queue (9 patients before us)\n\n3. Poor solution solving; when requested for a solution, the nurse finally helped me to book an appointment time for 2.45 pm. We didn't manage to see the doctor at appointment time as well. Waited for an one hour until 3 pm and we were the 2nd last patient at that time.\n\n4. No phlegm medicine; although it is a PaedsENGAGE doctor/clinic but the clinic did not have the basic (in my opinion) medicine for children.",
      "time": 1727122117,
      "translated": false
    },
    {
      "author_name": "Vivianna Gwee",
      "author_url": "https://www.google.com/maps/contrib/102606738580457073378/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV25hioYtkcra0Mh7M8WVKxQzmgjLZnxg4gQSRxntTfKo6_DToL=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Horrible experience at Minmed Paya Lebar.\n\nSet an appointment for 11am and checked in at the counter on time, just to be told that the appointment is based on the queue number and the previous appointment is not done yet.\n\nWaited for about 30mins before a notification pop up on the minmed connect app that stated there was 4 pax infront of me. When it was my turn, i went to the counter to confirm that I could go in but the queue number at the clinic counter showed a different number. Thats when the reception told me that the minmed connect app is inaccurate.\n\nAt this point i’ve waiting for about an hr and a half for my turn already. Asked the reception how long more but she just stated there are people waiting longer than you. Gave up and left.\n\nWhats the point in having an appointment system if it cannot be adhered by? Please train your reception to be at least knowledgable enough to provide concrete answers rather than “theres more people waiting”",
      "time": 1741410335,
      "translated": false
    },
    {
      "author_name": "Kim Ricafort",
      "author_url": "https://www.google.com/maps/contrib/110341234126185031244/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWtF2lxaMm0Q2IYE0C5PPcbk-ENv8F15FNLs7s88QMnmVLUGmjukQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "great clinic! counter staffs and dr loh were all polite, professional and thorough. i really enjoyed visiting the outlet despite having to wait for an hour or so. it’s a popular choice for patients but i can completely understand why. extra kudos to dr loh for being dedicated to his work, you’ll really feel well taken care of. thank you dr loh and team!",
      "time": 1696827497,
      "translated": false
    },
    {
      "author_name": "Lily",
      "author_url": "https://www.google.com/maps/contrib/106789603500123914705/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWZii1kPVEV9Y1090gtuv_3D8tQ3y6mTrFPWfWvA1IDygdQhTE=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I had the pleasure of visiting Minmed Paya Lebar with my mother on a weekend, and I am truly impressed with the level of service we received. Despite the high patient load, Ms. Nicole and Ms. Jaslin were both incredibly warm, patient, and attentive, making our experience very comfortable. Dr. Loh also provided an exceptionally thorough check-up for my mother—I'm confident it was the most comprehensive check-up she has had. It’s clear that the team at Minmed Paya Lebar goes above and beyond to ensure quality care for their patients. Thank you for the wonderful service, and keep up the great work!",
      "time": 1736649158,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10456337022820092896",
  "user_ratings_total": 281,
  "vicinity": "10 Eunos Road 8, #02-122, Singapore Post Centre, Singapore"
}