{
  "formatted_address": "200 Victoria St, #02-42 Bugis Junction, Singapore 188021",
  "geometry": {
    "location": {
      "lat": 1.2988597,
      "lng": 103.8555479
    },
    "viewport": {
      "northeast": {
        "lat": 1.300521630291502,
        "lng": 103.8569823302915
      },
      "southwest": {
        "lat": 1.297823669708498,
        "lng": 103.8542843697085
      }
    }
  },
  "name": "Minmed Health (Bugis)",
  "place_id": "ChIJb-x_3EsZ2jER0CjLYX-R6r4",
  "rating": 2.2,
  "reviews": [
    {
      "author_name": "Mike Ng",
      "author_url": "https://www.google.com/maps/contrib/117330341957751761676/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIWn5bAy3tm8UmkxgLx_1qc-LtgQTL8tWb95dWnFFX1ZeQFPQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Visited on Monday 7pm 5th May as my regular clinic just happen to be not available. Malay lady at the counter was very courteous and helpful and registration process was very swift and smooth. Was consulted by Dr Leon. Very knowledgeable and very patient when discussing treatment for my gout. Provided options and alternatives as well as explain symptoms and signs of severity in considering several options. It was a very good session and much appreciated. Dr Leon is very polite and professional.",
      "time": 1746759536,
      "translated": false
    },
    {
      "author_name": "Ell",
      "author_url": "https://www.google.com/maps/contrib/113428556144640889971/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIqglKa-wh-1V1Z3FqaRh9HMPt5rtCxL-LKya42js522fDLRaKn=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "2 months ago",
      "text": "i booked a health screening appointment on a Saturday. On Thursday, the clinic whatsapped me to inform me that there was no doctor on duty that day, so i had to reschedule my appointment. fortunately i didn’t reschedule/cancel as the next day, i received an email reminder about my appointment on Saturday. i was so confused and had to clarify with the clinic. turns out they found a doctor on Saturday so i can have my health screening.\n\non the day of my appointment, the receptionist displayed good customer service, and it was a pleasant experience at the clinic. received the health screening results very quickly the following day.\n\nthe health screening came with a complimentary review of the results. i booked a tele-consultation on Mon 10.30am and waited for the doctor till 10.45am. accidentally exited the waiting screen and it said i “missed” my appointment and had to reschedule to another day 🤡\n\nMinmed needs to improve their system to avoid unnecessary rescheduling, & ensure a doctor turns up for the tele-consultation on time.",
      "time": 1740402659,
      "translated": false
    },
    {
      "author_name": "Chang Allen",
      "author_url": "https://www.google.com/maps/contrib/113082660042380721260/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ6QAGc61xSWmc3JNhsM1uZcIbYbs5cVf3wPCXte56hexuY1A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Luckily, I did not cancel my appointment because of those negative reviews. The front desk lady is very friendly and patient. The doctor who gave me a dose of flu vaccine is also very nice and skilled. I did not feel the pain for the injection.",
      "time": 1742973452,
      "translated": false
    },
    {
      "author_name": "Steve Ip",
      "author_url": "https://www.google.com/maps/contrib/108051086443177564391/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIKCu7ayDbqVwae45fr1miRTkZyIwnq8puuz9avY0--dLgVQA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "I recently booked a medical check-up appointment for my Singapore PR application at Minmed Health Bugis. Their website showed that the X-ray service was available at this branch, and I scheduled my appointment for 6:00 PM, which was confirmed via email.\n\nWhen I arrived, I was informed by the staff that this clinic does not provide X-ray services. They claimed they had no record of my booking, even though I had email confirmation to prove otherwise. Instead of resolving the issue, they simply provided me with the addresses of the other branches offering X-ray services and told me to reschedule on my own.\n\nTo make matters worse, I was told that the radiology department only operates from 9:00 AM to 4:30 PM, which directly contradicts their online booking system allowing me to schedule a 6:00 PM appointment.\n\nAdding to the frustration, I was advised by the staff to call the other four branches to double-check my appointment since year-end demand is high, and each clinic can only accommodate five person at a time. However, this is exactly why I had made my booking in advance — to avoid such issues. It is unacceptable for the company to fail in honoring confirmed appointments, especially during a busy period when reliability matters most.\n\nThis entire experience was highly frustrating and unacceptable for several reasons:\n1.\tWhy was I able to book an appointment for a service that this branch does not provide?\n2.\tWhy does their booking system allow appointments outside the operational hours of the radiology department?\n3.\tNo proactive communication was made to notify me of this issue before my visit.\n4.\tExpecting customers to double-confirm appointments is unreasonable, especially when it is the clinic’s responsibility to ensure bookings are accurate.\n\nI had specifically scheduled my day to attend this appointment and traveled to this location, only to have my time completely wasted. While the staff were polite, the company’s operational system is deeply flawed and poorly managed.\n\nI strongly advise others to double-check their appointments and consider whether this clinic group is worth the trouble.",
      "time": 1733136094,
      "translated": false
    },
    {
      "author_name": "Pearl Goh",
      "author_url": "https://www.google.com/maps/contrib/100589088278757324634/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK1yXjev5GzhIJCMUupq_i4UWF3HJIV1TLhQ2q32F8cQ7g0Yg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "The level of service I have received from Minmed customer service has not met my expectations. I was hoping for a more timely resolution to my issue.\n\nHaving visited the doctor on 7 Dec, I was promised to have the invoice emailed to me. It did not reach me. I contacted Minmed virtual chat and WhatsApp chat on 7 Dec, 10 Dec and 11 Dec but failed to get any updates or responses from their customer care team. I ended up calling the clinic directly to get it resolved.\n\nWould appreciate if service is more positive.",
      "time": 1733910189,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13756967988044179664",
  "user_ratings_total": 13,
  "vicinity": "200 Victoria Street, #02-42 Bugis Junction, Singapore"
}