{
  "formatted_address": "P01-14, Teluk Akua Biru, Jln Forest City - Lebuhraya Tanjung Pelepas, 81550 Gelang Patah, Johor, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.3369164,
      "lng": 103.5937348
    },
    "viewport": {
      "northeast": {
        "lat": 1.338245180291502,
        "lng": 103.5951203302915
      },
      "southwest": {
        "lat": 1.335547219708498,
        "lng": 103.5924223697085
      }
    }
  },
  "name": "MJ Health Care Centre",
  "place_id": "ChIJ8S8Om5cJ2jER3iX6Ex9Dnko",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "milk chewpeng",
      "author_url": "https://www.google.com/maps/contrib/111028700834794960012/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWEs2n4py0fIHTzeFTGjShZCN9XyAQ_1LMlaiF0ez_22JX0GhQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "The center had quite completed test items, and there were doctors and nutritionists available to explain the reports directly. Overall, the service was good, and the nursing staff were very polite.\n\nPersonally, I found the food to be suitable for my taste, and there were vegetarian options available too.\n\nAs for the environment, it was clean and spacious, completely devoid of a hospital atmosphere, very relaxed.",
      "time": 1693670179,
      "translated": false
    },
    {
      "author_name": "Bee Kim",
      "author_url": "https://www.google.com/maps/contrib/111191884152707888995/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXwwyp0Cf-9BF4SkhucQBtBL6Iup8W-bsRwlhNGty_Kh2HTf0UPNA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "6 years ago",
      "text": "I never knew that health screening could be so fun. It was like going from one \"play room\" to another, as we embarked on a series of tests.  The staff and doctors here were well-trained and very friendly. Their energy was mesmerising to watch. I heard a patient say hours she spent here was too long (from completing the tests to the medical consultation), while another said the tests were very basic. However, I was captivated by the flow of things here. At the end of the day, I got my medical report (hard copy) and was told I would be getting the soft copy as well. And the lunch served after you've completed your tests was delectable (it was my 1st meal of the day). The fee was more expensive than going to a clinic, but you get a 5-star experience.",
      "time": 1538855469,
      "translated": false
    },
    {
      "author_name": "Lee Po Ee",
      "author_url": "https://www.google.com/maps/contrib/103565340088371273163/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLHyQHfOtojGgX2doeVQlED41fYr3FFoUejdbgGiN_DLabuXWw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "The environment is comfortable and the staff was so friendly. They have professional doctor and nutritionist who gave me a comprehensive health management plan. recommend!!",
      "time": 1695011833,
      "translated": false
    },
    {
      "author_name": "MAI Teach",
      "author_url": "https://www.google.com/maps/contrib/108178969145803688458/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUtDsBr9BZcAWn5YzGC8Z2307QQKCEQvKhJJEAq8JrNNCTA_ooD5g=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 2,
      "relative_time_description": "12 months ago",
      "text": "I am disappointed with my last session. I had some findings in my report and asked for a referral so I can do the follow up tests with my own doctor. Although they offered their own service, which was not complete, I opted to do the follow up tests in another hospital that is able to do all the test I need. So I asked for a referral from their doctor. I was told they will give it to me late afternoon when the doctor was free. 4 days after and despite messages in their Whatsapp, I received no reply.\nThey used to have a competent agent, Nana, who replies immediately and showed good customer care and professionalism. Now, whoever replaced her takes too long to reply. It might be that the person is overworked and unable to manage the account, but then, the responsibility falls on the management. You should hire more people to address this since it seems the excuse I received is that you are too busy.\nNow, I need a heart related test and considering that this is not a small matter and I take my health very seriously, I expect these kinds of concerns be addressed immediatley.\nI am disappointed and I doubt I will recommend them to my friends who are considering to have their check up done in June.",
      "time": 1716378942,
      "translated": false
    },
    {
      "author_name": "Ashley Wong",
      "author_url": "https://www.google.com/maps/contrib/117938226323701798017/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK0m2yQTDhmMXLZs07i2hyOndScsYMT_LlC5yJbaaI4u3COPdHZ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Doing the health screening here was fun. It was a pleasant experience. The doctors and staff was very friendly.",
      "time": 1693904391,
      "translated": false
    }
  ],
  "types": [
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5376808805885158878",
  "user_ratings_total": 61,
  "vicinity": "P01-14, Teluk Akua Biru, Jalan Forest City - Lebuhraya Tanjung Pelepas, Gelang Patah"
}