{
  "formatted_address": "59 Sungei Tengah Rd, #01-58 The Animal Lodge Blk W, Singapore 699014",
  "geometry": {
    "location": {
      "lat": 1.3818605,
      "lng": 103.7239559
    },
    "viewport": {
      "northeast": {
        "lat": 1.383231480291502,
        "lng": 103.7253292802915
      },
      "southwest": {
        "lat": 1.380533519708498,
        "lng": 103.7226313197085
      }
    }
  },
  "name": "Mobile Pet Cremation Services Pte Ltd",
  "place_id": "ChIJq3UOAYQW2jER_JM6imgS3ds",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Lydia K",
      "author_url": "https://www.google.com/maps/contrib/104787059585966423719/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUjCsmOH0K7J3IQoUYM-UoTfxcpvTVVfCpZDBuY3YI1LsWKlt_pSQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I am grateful to Puven and Titus for being so kind and gracious during this difficult time. Puven was extremely patient with us and allowed us ample time with our baby boy Karl. He also helped with multiple paw prints, clay and ink. Titus helped transport our baby to the facility. They will allow 1-2 people to ride with them to the facility but we didn’t do that as the home euthanasia happened at night, so we opted to visit the next morning.\n\nThe facility is located in a beautiful serene environment that looks like the countryside. It is very clean and quiet and comfortable. They provide chrysanthemum flowers and you’re welcome to bring your own. They print a framed photo that you can keep and decorate the space. It was all very thoughtful and beautiful. We opted for private cremation so we had a viewing room and got to pick the bones later and placed them in the urn.\n\nThe cremation takes about 2 hours and we walked around the countryside while waiting.\n\nI highly recommend them for your precious fur baby’s final journey. I love you forever Karl. Thank you to the team at Mobile Pet Cremation for your exceptional service.",
      "time": 1742528014,
      "translated": false
    },
    {
      "author_name": "Karina",
      "author_url": "https://www.google.com/maps/contrib/104775388104490866999/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWArN0IWf80a-oGkg_awuYk4ioLTt_iERdbNmUXN-v9FqJT_UPzLQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "I would like to sincerely thank Mobile Pet Cremation Services for their excellent and thoughtful service. From the start, Mani was very kind and patient in explaining the entire process clearly, helping me feel at ease during such a difficult time. Throughout, I was kept updated with photos before and after Riceball’s cremation, which brought me great comfort. They also offered a range of beautiful urn options, allowing me to find something meaningful for Riceball’s memory. A special thanks as well to Daryl, who handled the delivery with such patience and understanding, even when I missed the initial call. I am truly grateful for the compassion, professionalism, and attention to detail shown by the entire team. Thank you for treating Riceball with such dignity, care, and respect. I highly recommend Mobile Pet Cremation Services to anyone who requires pet cremation services.",
      "time": 1745722836,
      "translated": false
    },
    {
      "author_name": "Mohana Suppiah",
      "author_url": "https://www.google.com/maps/contrib/105424035123141061714/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJbpgGo6kYQu49IrFbG9Jq8mLj7pehVWeRLs0ejXpo8GPCxLw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "We were fortunate to find a truly compassionate and professional mobile pet cremation service during one of the most difficult times. From the moment they arrived, they treated Juju with the dignity and care he deserved. The team was gentle, respectful, and understanding, guiding us through every step with patience and empathy. The convenience of the mobile service allowed us to say our goodbyes in the comfort and privacy of our own home, making a painful moment a little more bearable. Their thoughtful approach and genuine care gave us peace of mind, knowing Juju was in good hands. We’re truly grateful for their heartfelt service during such a tender time.",
      "time": 1745412760,
      "translated": false
    },
    {
      "author_name": "jxmieee",
      "author_url": "https://www.google.com/maps/contrib/116524137463705651158/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX9fOKYkL0KEfCWXtZK9u8IPsgwI3zydlXP625uCG-F10mezefW=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "This is my second time engaging with Mobile Pet Cremation services, and we opted for the private session on both occasions. Mobile Pet Cremation not only operates 24/7, and has transparent pricing, their staffs are also very friendly and knowledgeable about the services and processes, making all pet owners feel calm and comfortable.\n\nI would like to drop a special shout out to our pickup driver, Titus for being so professional and nice, from picking up our pet dog Dottie, and pet guinea pig Kangy, till the end of their cremation journey.\n\nWe highly recommend all pawrents to engage in their services as they really made us feel reassured and the private ceremony was done up to meet our expectations. Thank you Mobile Pet Cremation for helping us with both our pets cremations, we really appreciate it :)\n\nFeel free to view the 2 pictures attached in this review (ps : the flowers were bought by us 🙂)",
      "time": 1744014117,
      "translated": false
    },
    {
      "author_name": "kiki lala",
      "author_url": "https://www.google.com/maps/contrib/105775701920516140489/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVGA8whKGWrmz3pNGp5Qbom9Tl3PCoDaCSRx7USKwlLCFZle5JyaQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "It is with a heavy heart that we bid farewell to our cherished princess Nini, who passed away today after 20-years , last 2 years battle with cancer.\n\nWe would like to express our sincere gratitude to Mobile Pet Services for their exceptional care and professionalism during this difficult time. This is our third experience with their team, and they have consistently demonstrated compassion and respect.\n\nSpecial thanks to Titus, the driver, who arrived promptly within 30 minutes of our call. The entire staff's kindness and empathy have been a comfort to us.\n\nRest in peace, 我们的小公主 Nini.\nYou will be deeply missed.\"",
      "time": 1741426954,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15842839304364266492",
  "user_ratings_total": 1138,
  "vicinity": "59 Sungei Tengah Road, #01-58 The Animal Lodge Blk W"
}