{
  "formatted_address": "No.34-1, Laman Niaga Sunway Iskandar, Sunway Boulevard, Persiaran Medini 3, Bandar Sunway Iskandar, 79250 Iskandar Puteri, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.3946334,
      "lng": 103.6348355
    },
    "viewport": {
      "northeast": {
        "lat": 1.396019180291502,
        "lng": 103.6361346802915
      },
      "southwest": {
        "lat": 1.393321219708498,
        "lng": 103.6334367197085
      }
    }
  },
  "name": "Monnalisa Italian Restaurant JB",
  "place_id": "ChIJb-xsSYoJ2jERDOOe4JEvv_0",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "NeoFood",
      "author_url": "https://www.google.com/maps/contrib/103088037440014541565/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUrTiJRVCoHMiFDivfO2XQXVtv3wn02ACUtrhOIeR0BnV7Js6E=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "3 weeks ago",
      "text": "Sgrean discovering good food in Johore 😁\nLike & Follow me for more 👍\n\nOverall, some hits, some misses. Prices are reasonable.\n\nI adore Neapolitan pizzas, flavourful, chewy texture, and slightly crispy crust.\n\nTheir gnocchi is pretty good.\nMaybe they wanna keep their pastas authentic, simple not too fancy with ingredients. However, I like a good variety of meat, bacon, veg..etc ingredients to complement my gnocchi.\n\nI'm pretty surprised when they served the steak (see pic) , a piece of cooked meat, tasty but way too plain ~  a piece of meat with zero presentation. no sauce,  no sides, not even a garnish. Lol.\n\nI will come back for their pizzas and maybe pastas if I'm around the area.\n\nTheir server crew are excellent in their services.",
      "time": 1745769285,
      "translated": false
    },
    {
      "author_name": "Jorell Ng",
      "author_url": "https://www.google.com/maps/contrib/116239625105253757360/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLorY-1sGWTshbBIUkP0xZDRd9SaD0RFePaTuVuAIxXtRrtFA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I wish they would open in Singapore! I wish to highlight the Rigatoni which is so unique. Have never tried this before in SG or in Italy. So I learnt the cuisine is mainly south Italy and the Rigatoni dish was a family recipe. I highly recommend yall to try it. You also could tell the pasta is not your usual supermarket pasta but it's an authentic Italian pasta. You'll know when you bite into it, especially if you're into Italian cuisine. I didnt get to try their pizza which I saw others ordering. Oh and their Italian bottled fruit juice was thick and unique haha, nice as well even tho its bottled. Overall really great, I'll definitely come back. Good job to the team here, thanks for having me, I'll be back 😎",
      "time": 1741868908,
      "translated": false
    },
    {
      "author_name": "Fabio Verazza",
      "author_url": "https://www.google.com/maps/contrib/109390995610648968502/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWyOTe3GrIUE030j6x-jLwQdLVLVswSwWi13rc0WFio4biGGe4k0Q=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Monnalisa Restaurant in Johor Bahru, located in the charming Puteri Harbour area, offers an authentic taste of Southern Italian cuisine, with a particular focus on Sicilian dishes. The restaurant itself is refined, beautiful, and romantic, making it an ideal spot for couples or groups looking for a special dining experience.\n\nThe menu is rich with traditional Italian delicacies, and we had the pleasure of sampling some truly remarkable dishes. The caponata, parmigiana di melanzane, pappardelle with sausage ragù, and orecchiette with broccoli were all bursting with unique flavors that transported us straight to Italy. Each dish was expertly crafted and full of character.\n\nAccompanied by a fine Italian red wine recommended by the owner, who was always present and attentive, the service was impeccable. The standout moment was the Margherita pizza, with its exceptional dough that instantly took me back to the authentic flavors of Italy.\n\nTo top off the meal, we indulged in a delicious homemade dessert: a traditional baked cassata. If you’re looking to experience the true essence of Italian cuisine, Monnalisa Restaurant is undoubtedly the best place to visit in Johor Bahru.",
      "time": 1743431299,
      "translated": false
    },
    {
      "author_name": "Vincent Koh",
      "author_url": "https://www.google.com/maps/contrib/100790860144356211925/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLxJK2a9bgi5wEh71IssiEPH26NWQf80goCGT47auAbo9ZJvw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Not the typical Italian Pizza restaurant you find in Asian. Very authentic Italian style I had during my Italy trip.  The crust is self made and tastes not too dry or too soft. Just nice. Cannot describe, you have to try it there.",
      "time": 1733547599,
      "translated": false
    },
    {
      "author_name": "SY",
      "author_url": "https://www.google.com/maps/contrib/105747780294286305616/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJnTdIckGy2vzIRzbg7j2leY0IuUte63NKSwbQ9RO96D5Cm=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Authentic Italian cuisine, friendly bosses and staff, yummy food. Will definitely visit again with wine, as they have stopped serving wine, good thing is there is no corkage charge. They have beer though. The steak was good, charred on the outside, so tender and juicy, well seasoned, I didn’t even need to ask for salt and pepper. Pastas were al-dente and the sauce was made from fresh ingredients. Yum!",
      "time": 1735745317,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=18284385315732775692",
  "user_ratings_total": 183,
  "vicinity": "No.34-1, Laman Niaga Sunway Iskandar, Sunway Boulevard, Persiaran Medini 3, Bandar Sunway Iskandar, Iskandar Puteri"
}