{
  "formatted_address": "431 Clementi Ave 3, Singapore 120431",
  "geometry": {
    "location": {
      "lat": 1.3135803,
      "lng": 103.7631226
    },
    "viewport": {
      "northeast": {
        "lat": 1.314971330291502,
        "lng": 103.7643604302915
      },
      "southwest": {
        "lat": 1.312273369708498,
        "lng": 103.7616624697085
      }
    }
  },
  "name": "Mr Egg Fried Rice - Clementi",
  "place_id": "ChIJOcA2tnEb2jERtaQk_I8jYHc",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Chris Chong",
      "author_url": "https://www.google.com/maps/contrib/110006550653359996461/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKTs1NS1ck1wTfqKGRZ_sjrR7G3Dyth-y0TzzIA473QOjzKPg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Submitting this review after my second visit as I forgot to take a photo last time round. Had the pork chop egg fried rice on my first try and it was pretty delicious. Hence the forgotten photo. Unlike many other places that tend to cook it too hard, their pork chop was just right. Cooked enough and easy to bite. Tried their chicken chop this time and it again did not disappoint. Meat was juicy and the skin was the right amount of charred. Fried rice was consistently good. Will try their tobiko & XO fried rice options in future.",
      "time": 1742888899,
      "translated": false
    },
    {
      "author_name": "Jane chua",
      "author_url": "https://www.google.com/maps/contrib/117815701856011162559/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIF3BKBgCIXahETjrB8nPxFeV92NudabfDVvZ8sS3jLPMuVfg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I had a takeaway with an additional eggpaid for but only to realize much later when I wanted to eat that the egg was missing...it's too troublesome to walk back and ask for refund hence I am writing this review for all to note to make sure check your order and asked again if u have additional items added to your order.thanks.\n\nElse,the fried rice taste good.my toddler loves eating this fried rice.",
      "time": 1735640168,
      "translated": false
    },
    {
      "author_name": "Samuel Ng",
      "author_url": "https://www.google.com/maps/contrib/116466170234652095347/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXFgAxlSIPgIr0J3oZQlTCsoTkrBNAmy2A3nh8D9_u78ZM4r14=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I don’t know what makes this fried rice with pork chops so delicious. I tasted lard and some other thing.. Is it sambal from the wok as I couldn’t take the sambal chilli as I avoid spicy stuff. Anyway I think it’s the best fried rice in Singapore 😎",
      "time": 1741485962,
      "translated": false
    },
    {
      "author_name": "msteak",
      "author_url": "https://www.google.com/maps/contrib/112676575211343727822/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWRyleMigzVCTQZ9Wi0wL0ORHwQPxi1Sgwr-kRfzjDMZuES4quE=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "this review for the take-out... most pathetic tasting fried rice ever... it's all lumpy & tasteless and worst of it all, it's Cold... (max 5 mins walk from consumption). The cook makes no effort to warm up the left over fried rice... what a miserable portion as well for $4.80.... might as well get take out from any kopitiam zhi char stall, guarantee larger portion + pipping hot rather than having shixshow Cold fried rice.",
      "time": 1732795786,
      "translated": false
    },
    {
      "author_name": "Wilson Foo",
      "author_url": "https://www.google.com/maps/contrib/114263857328212431619/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIIh7G1X_JZDJZgIL6xxNoM8CIfjOdDDN6tMUxtTdpzGnximA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "This is a relatively new fried rice stall located in Gourmet Street Kopitiam along Clementi Ave 3. Read some good reviews and decided to give it a try.\n\nArrived at 12.17pm and surprisingly there wasn’t a long queue. My heart sank. Nonetheless we ordered their Egg Fried Rice with Pork Chop and Classic Meat Pie Rice. The stall assistant recommended that we try their fried sambal chilli and proceeded to add some onto the plate of fried rice. Tasted it cautiously and it blew us away. So savoury and fragrant from garlic, it’s better than most chilli used in Ban Mian. Really complements the fried rice very well but it packs bit of heat that builds up after a while so be careful. Wonder if they sell it individually. The fried rice itself got a bit of wok heat so it was nice and the grains were well blended with generous amount of fried egg. Pork chop was a tad dry but the well marinated meat was tasty.\n\nThe Classic Meat Pie rice is actually a bowl of rice with a pork patty on top and it comes with a fried egg. But what sets it apart is the lard bits added to the rice. The broccoli added does help take away the fatty taste of the meat and lard. Rice is drizzled with a sweet sauce so it’s a good blend between savoury and sweet.\n\nSo it’s a nice stall with good offer of fried rice and Chinese style donburi. Total damage was $13 only!\n\nFor this price and quality, I do recommend to try it. And ask for more fried chilli.",
      "time": 1736816204,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8601914389595202741",
  "user_ratings_total": 12,
  "vicinity": "431 Clementi Avenue 3"
}