{
  "formatted_address": "Punggol Wy, Singapore 824265",
  "geometry": {
    "location": {
      "lat": 1.4048421,
      "lng": 103.8983139
    },
    "viewport": {
      "northeast": {
        "lat": 1.406142830291502,
        "lng": 103.8995747302915
      },
      "southwest": {
        "lat": 1.403444869708498,
        "lng": 103.8968767697085
      }
    }
  },
  "name": "Ms Chua | Punggol Piano Teacher",
  "place_id": "ChIJscclF0AV2jERG6vrXEOBScM",
  "rating": 5,
  "reviews": [
    {
      "author_name": "W.ling",
      "author_url": "https://www.google.com/maps/contrib/106987718498601637213/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ73isa9YkMOdSX53BwGiisVX3qFXtHlKyjAPNhDepFWFUAOA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "My 6yo girl has been with Ms Chua for half a year. I appreciate her way of teaching.\n\nShe uses creative methods and language to engage my kid. For example, she would hide music note cards in the room so my girl can find-and-recall the notes. She also has little soft toys to symbolise each of the music notes. She tells my kid stories of animals going up the mountain to correct her arm posture (the arm is the mountain). She tells stories about rabbit in the magic hat to help my girl remember the music symbols. She also uses music bells and iPad to improve my girl's musicality and sight reading. She knows my kid does not like to practice at home, so she got a motivation sticker chart so I can use it at home with my girl.\n\nHer approach is both firm and fluid. If my girl hides behind the curtain during lessons, she will use kid logic/kid language to bring her back to the piano. But she is still particular about posture, hand position and repeats the piece till my girl gets it.\n\nHer heart is in the job and the kids. She organises annual recital and even though she collects a token sum from us, the parents can tell from the rehearsal to food prep to venue rent and prep, emcee, recital booklet to customised trophies, the effort is way more than what I pay. She pays attention to what songs my girl likes and encourage her to perform them (my girl has stage fright). She even convinced my girl to perform 2 songs. For the song my girl chose, she went through multiple scores of the same song (from different books) to get one that suits both my girl and my sister's level to play duet together. When she noticed my girl likes a squishy toy used for piano practise, she got my girl a similar one to play at home.\n\nLastly, her house is near the MRT. Her piano room has soft curtains and nice daylight, with height adjustable seat and raised piano steps, a good environment for learning. No sounds of other piano classes since it is not a piano studio.",
      "time": 1736040662,
      "translated": false
    },
    {
      "author_name": "Shennie Wong",
      "author_url": "https://www.google.com/maps/contrib/111112227332086632206/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUwnWJk02aIX3TtEc2aGb7zSL5cQjfNqF_s1ZJ6qWUfxgqUTOdG=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My girl was with Ms Chua since she was 3.5 yrs old. She engaged well and use different tactic to gain attention from young kids. My girl is very happy and enjoy her piano lessons so much. Ms Chua is a very hardworking, responsible, loving, patient and accomodating piano teacher. She will incorporate feeling expression in piano lesson and let child build up confidence through year end concert. Highly recommended if you are looking for a piano teacher.",
      "time": 1705214879,
      "translated": false
    },
    {
      "author_name": "Lee Christina",
      "author_url": "https://www.google.com/maps/contrib/115220670516952580714/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUUaN29JamD_F3COOwthXZbapgb2Z3y_ppa-PK0e9R0Y2JXIa8OeA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I have Never met such an awesome teacher, lady, friend and sister!!! Always so patient, sweet and understanding!!! Definitely my best choice ever!!! 💯💯💯❤️❤️❤️🙏🏼🙏🏼🙏🏼🌈🌈🌈",
      "time": 1703837869,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14071920637017565979",
  "user_ratings_total": 3,
  "vicinity": "Punggol Way"
}