{
  "formatted_address": "321 Orchard Rd, #01-01/02, Singapore 238866",
  "geometry": {
    "location": {
      "lat": 1.3014691,
      "lng": 103.8379038
    },
    "viewport": {
      "northeast": {
        "lat": 1.302924180291502,
        "lng": 103.8393096802915
      },
      "southwest": {
        "lat": 1.300226219708498,
        "lng": 103.8366117197085
      }
    }
  },
  "name": "MSpace@Maybank Orchard",
  "place_id": "ChIJExUahF0Z2jERiCL1_czsyHQ",
  "rating": 2.7,
  "reviews": [
    {
      "author_name": "Shuren Lin",
      "author_url": "https://www.google.com/maps/contrib/116848753776391265221/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLQZwkscImU79lXk7BzPtkHmMJWx-s8ZxxTgfZvLF82v7wvIA=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "2 years ago",
      "text": "My experience with getting my errand done was quick. Staff was helpful. However, the place was very confusing. There was not a systematic way or structure to direct and inform customer of where to go and what's going on. Apparently this is still a banking facility but according to the staff, this is a \"concept store\". Not sure what advantage does this \"concept\" give though. Suggest to go during off peak period.",
      "time": 1678498343,
      "translated": false
    },
    {
      "author_name": "Bosco Lim Hearted Moments",
      "author_url": "https://www.google.com/maps/contrib/114838669339026162946/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVFOVb4nfbngLJULv6AyJmaNbnaAiJ5bIN2w0GX-kSmKUjVqKBZ=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Great as an event space!\nFriendly staffs, and their mocha is thick and caffeine kicks in really fast.",
      "time": 1701168479,
      "translated": false
    },
    {
      "author_name": "Jay Jus",
      "author_url": "https://www.google.com/maps/contrib/100039869318805379565/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKwsIKcTsZTpmrty0s3kSO9Xn6CgAUsbPd5e6gQaF_Ky3DOEA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "2 years ago",
      "text": "If you arrive before they open and it’s your first time, you might get confused as to where the bank is.  Or maybe it’s just me haha.  The bank is infused with a coffee shop so just enter either the coffee shop or the ATM area.\n\nThis bank is like a pop-up branch so it’s not the conventional type.\n\nStaff is friendly and seem competent.\n\n4-stars only as I was attended to late.",
      "time": 1656148015,
      "translated": false
    },
    {
      "author_name": "Francheska Milo",
      "author_url": "https://www.google.com/maps/contrib/109428802001557760250/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIp19kgVMwDI7RGKbbs1Pyv61IdtFIZkcN-YmtL6pklqdqPDg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "9 months ago",
      "text": "Very very bad experience with Maybank overall. I wanted to get a transaction or e-statement for my account as I need it for legal matters. Hence I called the customer service, they told me that first it can only be done when I go to the branch and that it would cost me $30/ each statement hence if I want 6 months it’s will easily cost me $180. Since I really needed it, I forgo the cost and went down to this branch. When I first arrived the staff already told me that it would take WEEKS, Which I was not told by the customer service. Hence I asked for other options, they offered to give me a piece of A4 paper that has my acct number, name and balance, and without a MAYBANK logo nevertheless. I was not satisfied as I am filing it for legal purposes and could easily foresee that it will not be acceptable. I waited for very long for them to find a solution.\n\nThen after almost half an hour they told me I could log in online and get what I want. They kindly showed me, however when I asked them for a favour to print it out for me they declined. A staff named RICHARD said it could not be done. When I asked why the customer service did not instruct me this way over the phone so I could have saved my time coming down to branch, he simply said he has not idea and instead of apologizing he was insisting it’s not his problem. I agree yes he was not the one who answered the call but he is from the same company, the least he could do is to be apologetic of the scenario.\n\nIt did not end there, when I asked for a favour to kindly help me print out the transaction history he was quick to say that he could not do it instead of offering other alternatives. Personally as a customer I felt that I was mistreated. I don’t deserve to be embarrassed in front of everyone in the bank when all I wanted was to get my transaction history in my bank account that I opened with them.\n\nI have bank accounts in both DBS and OCBC and never once experienced this. They were efficient and valued customer satisfaction.\n\nFrankly, Maybank did not even made me feel that I am their customer. And I am sure Mr Richard will not escalate the matter to his boss and nobody will follow up with me next week like he promised.\n\nSo if you are thinking of banking with them, please don’t. In a world where everything is online and convenient, this bank will make you feel you are back in the 70’s where everything needs to be settled in the branch, which is an awful wasted of time.\n\nI went home with no resolution on hand and much disappointment.",
      "time": 1723874706,
      "translated": false
    },
    {
      "author_name": "Joshua Foo",
      "author_url": "https://www.google.com/maps/contrib/110000868341222767135/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ_pZaGRm9IIGl6E2HvRvroSvbh7xoQbaDK1d0RJ6Cf17K2AJR2=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Great bank and wonderful surprise to get LKY100 without any queue 🥰",
      "time": 1701842047,
      "translated": false
    }
  ],
  "types": [
    "bank",
    "finance",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8415236268919956104",
  "user_ratings_total": 19,
  "vicinity": "321 Orchard Road, #01-01/02"
}