{
  "formatted_address": "3 Mount Elizabeth, #07-03 Medical Centre, Singapore 228510",
  "geometry": {
    "location": {
      "lat": 1.3055003,
      "lng": 103.8357819
    },
    "viewport": {
      "northeast": {
        "lat": 1.306244730291502,
        "lng": 103.8369066802915
      },
      "southwest": {
        "lat": 1.303546769708498,
        "lng": 103.8342087197085
      }
    }
  },
  "name": "Mt Elizabeth Dental Surgery (Dentist at Mount Elizabeth Singapore)",
  "place_id": "ChIJEW8RUpIZ2jERe8OXoF5a8dg",
  "rating": 5,
  "reviews": [
    {
      "author_name": "lim deanna",
      "author_url": "https://www.google.com/maps/contrib/115901434886690693810/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJSqZheZwJt3aRfPP3iTYbw0kKw4EvRS0R9CXVHgwDAu8E38w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Exceptional Prosthodontist\nDr. Christopher Sim is a true expert in prosthodontics. His attention to detail, precision, and expertise are evident in every aspect of his work. He took the time to explain my treatment options thoroughly, ensuring I felt comfortable and informed throughout the process. His skill and dedication to patient care made the entire experience smooth and stress-free.\nA special mention also goes to his incredible team of nurses. Especially Sunny and Marycarr ,their kindness , patience, and efficiency made every visit a pleasant experience.\nThe results of my treatment exceeded my expectations—both functionally and aesthetically. Thanks to Dr. Sim, I now have a confident, beautiful and natural-looking smile. Super Happy!\nIf you are looking for a prosthodontist who combines technical excellence with a compassionate approach, Dr. Christopher Sim is the best!",
      "time": 1742193243,
      "translated": false
    },
    {
      "author_name": "Micmacky Ng",
      "author_url": "https://www.google.com/maps/contrib/114714095895868353058/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ0-dOcf1hA2SyY3jYUTRMUac9Jv64NeuLjLqwKEi8H_-oPMg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I consulted Dr Sim 17 years ago for my veneers and it is still in excellent condition! Recently brought my mum to renew her dentures and was happy to see Dr Sim. 😄 Dr Sim is very friendly and put his patient at ease",
      "time": 1742438771,
      "translated": false
    },
    {
      "author_name": "R Jong",
      "author_url": "https://www.google.com/maps/contrib/108473166185679009026/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWAaqqdd1h6bocdQSEhWvBSl1cpT76_xP2KDXUIPL50tRkuriF9=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I've been a patient of Dr. Sim, a Specialist Prosthodontist, since 2007, and I can't recommend him highly enough. His approach to dentistry is truly exceptional, focusing on preserving natural teeth whenever possible.\n\nDr. Sim's expertise and patient-centered care have been evident throughout my years as his patient. He's always kind, gentle, and takes the time to explain procedures and options thoroughly. His conservative approach has saved me from unnecessary and costly treatments multiple times.\n\nOne standout experience was in 2016 when I had a significant cavity in my molar. Many dentists would have immediately suggested a crown, but Dr. Sim proposed trying a filling first. He was honest about its expected lifespan, saying it might only last six months. To my amazement, that filling lasted an incredible nine years, only recently needing replacement in 2025!\n\nAs a Specialist Prosthodontist, Dr. Sim's skills go beyond general dentistry. His proficiency in addressing intricate oral and maxillofacial concerns is reflected in the thorough and comprehensive care and advice he delivers. Whether it's routine check-ups or more involved procedures, Dr. Sim always ensures I'm comfortable and well-informed.\n\nThe clinic itself is modern, clean, and welcoming. The staff are friendly and professional, making each visit a pleasant experience. They're always accommodating with scheduling when they can and have a knack for putting patients at ease, whether it's their warm greetings or attentive care throughout the visit.\n\nIf you're looking for a dentist who combines expertise with a genuine care for patients' long-term oral health, I wholeheartedly recommend Dr. Sim. His conservative approach, skills and easy chairside manner make him truly outstanding in his field.",
      "time": 1738723568,
      "translated": false
    },
    {
      "author_name": "Kai Ma",
      "author_url": "https://www.google.com/maps/contrib/105763917035216519407/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWbyhrrLXM3oMWto3d_hBrUuBvzL7TZhMbGWf8SnI9bRlmVPkAx=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "I recently visited this dental clinic for urgent care after a fall and was referred to Dr. Sim. Despite their busy schedule, the team was incredibly accommodating and found me the earliest available appointment.\n\nI had to see Dr. Poh for root canal and then Dr. Sim for crown, and I can't express enough how impressed I am. Initially, I was nervous about the root canal and wonder how much more pain I had to go through, but Dr. Poh was the most patient and gentle dentist I've ever encountered. His calm demeanor and detailed explanations on each step made the process much less intimidating and i truly appreciated how he takes time to explain what I was going to be experiencing for the treatment. I was amazed that the treatment was completely painless—only the sound of the equipment was a bit daunting. So impressed that I've already recommended him to friends needing any root canal treatment!\n\nDr. Sim is equally friendly and experienced, and his professionalism shines through! He quickly assessed my needs and provided a solution that worked perfectly for me. The results were fantastic; my tooth looks just like it did before, and no one can tell the difference!\n\nThroughout my multiple visits, the team was consistently responsive and kind. A special shoutout to the triage staff, Mary, Sue, and Grace, who were always sweet and helpful during my appointments.\n\nI’ve never been a fan of dental visits, but my experience here has completely changed my perspective and I would recommend this dental clinic for anyone in need of dental care!\n\nThank you Dr Sim and Dr Poh! ❤️",
      "time": 1729644099,
      "translated": false
    },
    {
      "author_name": "CHARMAINE CHIA",
      "author_url": "https://www.google.com/maps/contrib/107268913334960575557/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKJ5QijSYmr0cSLCpAMW_GfpYVDNhZgrUPiT3J_2-vFq6XctA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "When I had a failed dental bridge last year and in need of an implant and a second opinion, Dr Christopher Sim was recommended. From the first consultation even knowing is an almost impossible mission for my case, he took effort to think through the best possible solution n work out the treatment plan for me. If there is a 6 stars rating, I would have given Dr Christopher Sim for his meticulous work. He is professional, knowledgeable, confident, witty and showed care and concern throughout. The implant journey is a rather long one but with Dr Sim, it was seamless, painless and a smooth journey even to the point of enjoyable process. The impossible mission has become possible with Dr Sim, he makes sure that aesthetically you will look good too and not just having teeth, well planned and thought through. I now not only have my implant, aesthetically it looks natural and beautiful. Dr Christopher Sim is excellent and highly recommended. The nurses in his clinic are all friendly, helpful, thank you for looking after me and assisting in the process.\nMy heartfelt appreciation for Dr Christopher Sim and his team! Thank you!",
      "time": 1700355404,
      "translated": false
    }
  ],
  "types": [
    "dentist",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15632375144047428475",
  "user_ratings_total": 110,
  "vicinity": "3 Mount Elizabeth, #07-03 Medical Centre"
}