{
  "formatted_address": "5 Tanjong Pagar Plz, #02-01, Singapore 081005",
  "geometry": {
    "location": {
      "lat": 1.2763368,
      "lng": 103.8429097
    },
    "viewport": {
      "northeast": {
        "lat": 1.27711325,
        "lng": 103.8443333302915
      },
      "southwest": {
        "lat": 1.27400745,
        "lng": 103.8416353697085
      }
    }
  },
  "name": "Mulberry Learning Centre @ Tanjong Pagar",
  "place_id": "ChIJ7TX0kGwZ2jERwoNvLj0ADek",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Abdul Hadi",
      "author_url": "https://www.google.com/maps/contrib/116258652394753643603/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVOGqyu1knaJvUfPnDDYZ19uyCPDC9dty1VlG5LLFyaKefCaewH=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Me and my wife have been patronising Mulberry @Tanjong Pagar for 2 generations so far and we have been really pleased with the service that is provided at the centre. We get feedbacks from the teachers whenever there is a need and they are also very open to help us in any needs that we may seek from them. On top of that, on the academic side, we felt that the school has been amazing and we have seen the progress coming from our children when they show us at home. We can say that we trust the process of the curriculum at the centre and when we were offered a chance to compare the curriculum of MOE kindergarten with this school, we straight up chose the latter due to the strong curriculum offered here. This school has been pleasant and we plan to send our next generation here as well. Thank you Mulberry and we hope the school will continue developing more amazing curriculum for the future generations. Thank you to all the staff as well for being amazing and supporting our children in school.",
      "time": 1701478041,
      "translated": false
    },
    {
      "author_name": "Jo Yeo",
      "author_url": "https://www.google.com/maps/contrib/107089329747380994907/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV9kUI9TwqRcan1D1N6Ul-MA-QlJiEv9yZOThK9om2p44rDDPA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "both my children attended mulberry childcare and i can say confidently that the teachers at tanjong pagar mulberry learning centre care genuinely for their students and deliver both childcare and teaching with much attention and affection. my older boy still talks fondly of his time there and his younger sister enjoys going to school. no regrets choosing Tanjong Pagar Mulberry Learning Centre for both my kids - it turned out to be the right choice.",
      "time": 1683013029,
      "translated": false
    },
    {
      "author_name": "Ssemaj Soh",
      "author_url": "https://www.google.com/maps/contrib/112755554775946521852/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJeth6pJWT6mPAL1yR6h0M-80CGbYW23QVs4YsPX6iK5nq7sQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "We enrolled our daughter into Mulberry Tanjong Pagar since her PN class and now she's graduating from the school. We feel blessed and very appreciative of the school's dedicated staff and teachers who have educated and natured her to become a confident, responsible, kind and learned individual.  It is a safe and happy environment that we feel secure knowing our kid is in good hands everyday. Thank you Mulberry TP!",
      "time": 1734519178,
      "translated": false
    },
    {
      "author_name": "BT",
      "author_url": "https://www.google.com/maps/contrib/116600642017526132937/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocICSexC6PMJ3HVMTelHDOTzIJgXiRfA82jJpkb8DsCEggMu2X3E=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "We have been blessed to have fantastic teachers for both our kids in Mulberry Tanjong Pagar branch. As other reviews can attest for quality, I shall highlight other aspects of the school/centre.\n\nThe school operates very much like a family-centric centre; by that, I mean how closely-knitted the staff and teachers are both as professional and friends; This is an important aspect that most people don't pay attention to. A vibrant, positive, happy work place will influence how the children in-turn get influenced on their daily-interaction and learning journey. The children formed very strong bonds with their teachers, through the similar staff-to-staff positive relationship they have fostered over the years.\n\nThe bonds from teachers-and-children, are one of many layers: bonds of respect and authority (as caregivers, educators) to bonds of friendship (where the children see their teachers as their best friend and someone they can safely confide in during the school hours).\n\nWe have been to a few different pre-schools across our 2 children's early-childhood years; and I can say that a school/centre that doesn't have the above as a strong bond, operates very loosely as a school that functions as \"just a salaried employee\".\n\nTanjong Pagar Mulberry's teachers are always a mile or two beyond what they are required to do. During some of the parent-volunteer work, I have personally witnessed how the teachers manage the kids, how the kids look-up to their teachers from celebrating moments of happiness, to confiding in sadness shows a lot about their bonds forged.\n\nDefinitely joyful place to grow up at.",
      "time": 1706883963,
      "translated": false
    },
    {
      "author_name": "Sunil Sabnani",
      "author_url": "https://www.google.com/maps/contrib/101663638401244502238/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX_Hx9JYs_7bNFVGlJOiiDBMrctS-AWGWfOoWukrb2dHdtfbGsX=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "My child recently graduated from here and we couldn’t have been happier with his development over the last 4 years.  The level of dedication shown by the teachers like Teacher Hajar and Laoshi and the principal Mdm Lee is remarkable. The lessons are innovative, creative and engaging . The cultural activities  are always very well organised that allow for extensive parent participation. Thank you Mulberry TP!",
      "time": 1734568330,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16793078848306512834",
  "user_ratings_total": 34,
  "vicinity": "5 Tanjong Pagar Plaza, #02-01"
}