{
  "formatted_address": "407 Northshore Drive, #03-02, Northshore Plaza, I, Singapore 820407",
  "geometry": {
    "location": {
      "lat": 1.4166236,
      "lng": 103.9016804
    },
    "viewport": {
      "northeast": {
        "lat": 1.417935180291502,
        "lng": 103.9030121802915
      },
      "southwest": {
        "lat": 1.415237219708498,
        "lng": 103.9003142197085
      }
    }
  },
  "name": "Mulberry Learning @ Punggol",
  "place_id": "ChIJOWp-u2MV2jERzODXeUmi0w4",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Eve Seow",
      "author_url": "https://www.google.com/maps/contrib/100849466716525095934/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWJ8cH43EAoi3TegueKBAz9Og3siedfTPDgVOSZ-m2sk_lIO54=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "I’m so glad that Mulberry is the preschool for my little one. She look forward going to school everyday, happily go in and out. Coming home teaching us all the new things she learnt in school. And what else more important? Is to have a loving, caring and friendly teachers whom you can whole heartedly entrust your kid with. They really love them like their own. Without second thought , I would definitely recommend anyone to go Mulberry preschool.",
      "time": 1678376873,
      "translated": false
    },
    {
      "author_name": "Dickson Yeo",
      "author_url": "https://www.google.com/maps/contrib/106238758437771266395/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIwjS_LWYAv79qZXjO5QKiuYpJYTbOK_7gSs7XojUU8xpKPow=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "Here's a 5-star review for child care:\n\n---\n\n⭐⭐⭐⭐⭐\n\nI cannot say enough wonderful things about Mulberry Punggol! From the moment we walked in, we felt welcomed and joyful. The teachers are incredibly friendly, caring, and professional. They take the time to get to know each child individually, and it shows in the personalized care and attention they provide.\n\nMy child absolutely loves going here. The activities are engaging, educational, and fun. The facility is clean, safe, and well-organized, and I appreciate the regular communication from the staff about my child's progress and activities.\n\nIt's clear that Mulberry Punggol genuinely cares about the well-being and development of each child. I have complete peace of mind knowing my child is in such capable and loving hands. Highly recommend to any parent looking for top-notch child care!",
      "time": 1717081787,
      "translated": false
    },
    {
      "author_name": "Elaine Khor",
      "author_url": "https://www.google.com/maps/contrib/102996562406363214525/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU0YQnYVsN9Q6I9O5C4c1sgwLQsjX89lUrPX8UPXJ1qrh-sFI1E=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I am delighted to share my positive experience with Mulberry Punggol. Our journey with Mulberry has been exceptional, and I am grateful for the nurturing environment they provide. The dedicated teachers have consistently shown genuine care and support for the children. I appreciate the creativity and enthusiasm they bring to the educational programs, making learning a joy for my daughter.\n\nThe facilities are not only clean and safe but also designed to foster a stimulating learning environment. I particularly value the open communication channels established between the staff and parents, keeping us well-informed about our child’s activities and progress.\n\nI’ve witnessed significant growth in my daughter’s development since joining Mulberry IFC. The well-thought-out curriculum and various engaging activities have contributed positively to her learning journey.\n\nOverall, I wholeheartedly recommend Mulberry to other parents seeking a nurturing, educational, and supportive environment for their children. It’s been a wonderful experience, and I’m confident in the positive impact it has had on my child’s early education.❤️",
      "time": 1704819356,
      "translated": false
    },
    {
      "author_name": "RW K",
      "author_url": "https://www.google.com/maps/contrib/115696374442320280499/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK_J8GsmkwqnDRdG0iosBAKW04miyW-IBkqoTqDh9IsipBr6g=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Mulberry Punggol is a wonderful place to send your child. Our firstborn started at infant care there, we were nervous, and hesitant parents. The experience with them was extremely smooth. The teachers took the time to listen to how we wanted our child cared for, they never criticised or judged, and they were receptive to working with us to help our child transition down to 1 nap, off of breast milk and comfortably onto solids. I cannot recommend this school enough for flexibility, peace of mind and quality of care.",
      "time": 1686535992,
      "translated": false
    },
    {
      "author_name": "Lee Ying How",
      "author_url": "https://www.google.com/maps/contrib/101197480737126157400/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXpgmIhcSR2oAAEoTspXOglHXwI0aXUm35bVL315Svvpr9Y7A6n=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "I have been sending my girl to Mulberry @ Punggol for over a year now. She started when she was 12mths old (infant care) and has since progressed to N1. My wife and I both feel that enrolling our girl with Mulberry may have been our best decision to prepare her for the future!\n\nThe centre was newly opened in Jan'22, hence all the facilities are new and in excellent condition.\n\nThe teachers and staff are experienced and caring professionals. I recall when we first sent our girl to infant care, she kept crying. Teacher Mary carried her the entire day and kept reassuring her that Daddy and Mommy will be back later for her. This went on for an entire week before my girl started to bond with her Teachers.\n\nAs she progressed to Pre-Nursery and N1, we are pleasantly surprised by the range of activities planned by her Teachers. There is a good mix of outdoor (playing at the playgrounds) and indoor (art & craft / learning through games / even cooking!) activities. There are also special activities on event days - e.g. eating roti prata on Deepavali; light puppet show to celebrate Thomas Edison day; and they even setup a snow (foam) machine during Christmas!\n\nI particularly like that learning @ Mulberry is conducted in both English and Chinese. For my girl in N1, she has an English teacher ( Teacher Jamie) and a Chinese teacher (Dai Laoshi). Both teachers speak complete sentences to my girl in their respective languages - e.g. Teacher Jamie may teach my girl to wear her shorts by speaking to her in English; while Dai Laoshi may teach her to wear her socks and shoes using Chinese sentences. Having this dual language exposure forges true bilingualism - I.e. able to think and communicate in either language, as opposed to thinking in one language before translating in your mind to another language.\n\nAt home, when I post a question in English to my girl, she may choose to reply in either Chinese or English. But regardless of the choice of language - her answer will be a simple but complete sentence in that language... which I find coming from a 2yrs+ is pretty amazing!!!\n\nFinally, the mall where the centre is located (Northshore) is also new with many amenities like Giant supermarket; Decathlon; eateries such as A&W, McDonald's and Dancing Crab; and it is connected to Punggol LRT.",
      "time": 1678206536,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1068375973077442764",
  "user_ratings_total": 24,
  "vicinity": "407 Northshore Drive, #03-02, Northshore Plaza, I, Singapore"
}