{
  "formatted_address": "235 Bukit Panjang Ring Rd, #02-33, Singapore 670235",
  "geometry": {
    "location": {
      "lat": 1.3786307,
      "lng": 103.7712641
    },
    "viewport": {
      "northeast": {
        "lat": 1.379934680291502,
        "lng": 103.7726865302915
      },
      "southwest": {
        "lat": 1.377236719708498,
        "lng": 103.7699885697085
      }
    }
  },
  "name": "My First Skool at Blk 235 Bukit Panjang",
  "place_id": "ChIJj5EYM6ER2jERJl5Vt-5zXxU",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "Mrdtux Rdtu",
      "author_url": "https://www.google.com/maps/contrib/112603763836683376483/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKSPI6V8fBzrwvRJaLRic85hRH6RTJ5ac6LNK0mHZenyqY-0fr1=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "teachers are not feeling and not understanding. Instead the principal and teacher want us to understand their situation. COMPARE OUR SON WITH OTHER STUDIES WHICH IS RIDICULOUS. Didnt want to calm the kids when they meltdown instead they IGNORED and let them to calm themselves. First day of school teacher didnt share what will they doing. They really want the kids to be so independent within the time frame. NOT ALL KIDS IS THE SAME. treating the kids like a soldier . make kids to understand really took time,  its not easy.  Principal giving so many scenarios but they dont try to make time for the kids settle themselves.\nThe best is vice principal giving so bad expectations asking whether we are still interested to send my child to school just bcs we send about 930-10am. Ridiculous.",
      "time": 1691937500,
      "translated": false
    },
    {
      "author_name": "Grace Fu",
      "author_url": "https://www.google.com/maps/contrib/105335156371127270268/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWCS2abqCedZ8c3m12GEs-dJSgTwelaB0Xcf84Fq-dN-uqSsJum=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "Placed my child on the WL for this sch since she was 20mths old even though we stayed at Keat Hong. First impression of this sch was that it was big, clean and very neat. My child has been here since her PG days and it was the best decision ever.\n\nThe sch teachers we have met hav been so enouraging, nurturing and attentive. My child blossomed from a shy little toddler to a confident and happy K2-er!\nThey helped wean her off pacifier, toilet trained her and helped to spot her socio-emotional development issues at an early stage that we managed to get the right intervention.\n\nThe curriculum is a good balance of inquiry/play based learning and her English lessons are filled with current affairs which my child always come back and share with me. Her Chinese T has a unique way of teaching Chinese tt my child even with her dislike of Chinese, adores him.\n\nThe school is clean, food is made fresh from their in house kitchen w fruits daily, learning outings planned well and parents are welcome during parental involvement day end of terms!\n\nThank you too all Ava’s teachers and Principal! We will miss this school when she graduates.",
      "time": 1747641346,
      "translated": false
    },
    {
      "author_name": "afi wafi",
      "author_url": "https://www.google.com/maps/contrib/107334929548815677968/reviews",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW9ekVoo3_53G2slOykbrDS2RrstDm4GdZcnN6_CEn9ZSxS_dY=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "",
      "time": 1687156713,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1540077066699234854",
  "user_ratings_total": 3,
  "vicinity": "235 Bukit Panjang Ring Road, #02-33"
}