{
  "formatted_address": "8J Yio Chu Kang Rd, ICB Shopping Centre, Singapore 545522",
  "geometry": {
    "location": {
      "lat": 1.3546836,
      "lng": 103.8777623
    },
    "viewport": {
      "northeast": {
        "lat": 1.355940080291502,
        "lng": 103.8790495802915
      },
      "southwest": {
        "lat": 1.353242119708498,
        "lng": 103.8763516197085
      }
    }
  },
  "name": "My Tuition Place",
  "place_id": "ChIJJRhoZaYX2jERiaV_jhVhki0",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Qing hao Goh",
      "author_url": "https://www.google.com/maps/contrib/115396047171807954138/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIrUaw5ZhAndo-zoH1usNNERRflXCdbwezmvn_YSrA5LLI3SQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 years ago",
      "text": "My Tuition Place has a conducive environment to have fun while learning. The teachers  take the effort to make the information relate-able, incorporating them into jokes and everyday events as examples.\n\nAlbeit being a group tuition, the attention given to each student is comparable to that of a \"one-on-one\". Students will never feel left out or lost during the tuition as the teachers do their utmost to include everyone and ensure that everyone is on track.\n\nHighly recommend it to anyone struggling with Math and Science as it has helped me gain a strong foundation in the two subjects.",
      "time": 1404921286,
      "translated": false
    },
    {
      "author_name": "fen goh",
      "author_url": "https://www.google.com/maps/contrib/117732545995268485968/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUDmYVsp0lQt23ULaES-EIk3Unk1_L61s0FIaxTzRWoT3HVZGQs=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 years ago",
      "text": "I approached (well, my mum did) My Tuition Place just slightly into the start of my O'levels year, kinda lazy, lacking in motivation etc. Never regretted attending My Tuition Place, it was a good experience.\n\nMy Tuition Place is a great place to learn with a dash of harmless sarcasm/ reality check from the down-to-earth, friendly teachers. I think the main difference that My Tuition Place have from other tuition centre was the effort the teachers put into giving information to students in \"digestible\" forms, giving us tons of practice questions. Most importantly was that the teachers were really approachable, kinda homely feeling.\n\nThanks Ray! Glad to say, I am less of a bum now!",
      "time": 1404917245,
      "translated": false
    },
    {
      "author_name": "Marcus Lee",
      "author_url": "https://www.google.com/maps/contrib/117030703487315488193/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXiq3lEFZG0PmGWnJaj1FhPa2Zd2pYVPJQ8ViQF2M2PHHlFQUODyg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "10 years ago",
      "text": "My Tuition Place is a tuition centre that is not like any other. What they offer in My Tuition Place is not just results, but also fun and joy in learning. I started attending tuition here back in secondary one. By far, this has been one of the best tuition centres I have been to as the tutors do not only focus on the the academic aspects of learning but also try to connect with the students and make learning fun. In this joy, I have seen many of my of my fellow tuition-mates pulling through and doing well for their O levels and A levels, with the help of the tutors.\nIn summary, My Tuition Place offers what many other tuitions offer, like smaller class sizes and results. However, where it shines is in the teachers, like ray himself, who are so dedicated to teaching and imparting knowledge to their students that it becomes a fun process.",
      "time": 1405691556,
      "translated": false
    },
    {
      "author_name": "Lucas Tang",
      "author_url": "https://www.google.com/maps/contrib/111620395507527432068/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJRAoE9RtIMgZWnYfVzcpEi6U9OtQI48Sz55LJOIu5-vQqNjg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 years ago",
      "text": "What sets apart My Tuition Place from most other tuition centers would be the tutors not only focusing on purely academics but also catching and igniting a students' interest as well as motivating students to always aim higher and allowing them to believe that they can achieve. Lessons, while rich in knowledge, also contains reasonable short break times where tutors have fun pep talks before resuming. My lessons with them have never been dull, and i have gained much from the lessons as well!",
      "time": 1406298706,
      "translated": false
    },
    {
      "author_name": "SacrosanctWind",
      "author_url": "https://www.google.com/maps/contrib/110086455178613419361/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJA4yijUk9Uk9FMElOcedqsqCuOE8RyKvQrRcKrJi9uN6nSrw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 years ago",
      "text": "My Tuition Place is by far the best tuition center that I have ever been to in my life. Previously my experiences with tuition centers were not good due to the big class sizes that would lead to minimal interaction among tutor and student, and hence lead to very little help with my studies. My Tuition Place does the opposite, by shrinking the class size to 10. Doing so greatly increases tutor-student interaction and in turn quickly clarifies any queries from the student instead of the student waiting for his/her turn to ask about it.\n\nI personally recommend anyone with any difficulties in their studies(especially their mathematics) to enroll in here. They helped me to score an A1 in my N levels when I scored C5 in Secondary 1.",
      "time": 1404917390,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3283793823519450505",
  "user_ratings_total": 25,
  "vicinity": "8J Yio Chu Kang Road, ICB Shopping Centre"
}