{
  "formatted_address": "1 Yuan Ching Rd, #01-02, Singapore 618640",
  "geometry": {
    "location": {
      "lat": 1.3260785,
      "lng": 103.7247213
    },
    "viewport": {
      "northeast": {
        "lat": 1.327651080291502,
        "lng": 103.7260773302915
      },
      "southwest": {
        "lat": 1.324953119708498,
        "lng": 103.7233793697085
      }
    }
  },
  "name": "Nam Kee Chicken Rice Restaurant",
  "place_id": "ChIJ_VUOaAAF2jERbM2zzADsUPM",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Cat T",
      "author_url": "https://www.google.com/maps/contrib/115501602868899713032/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVIQ3C1JLYe0OtALwTeYPASGjfa1m1SmsctcLBs_yAU4Agk1QBY=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Needed an air-conditioned place for lunch after walking 2hours in the gardens on a hot morning... think this place just next to McD is new. We were the 1st customers 15mins to noon on Sunday. So food was served super fast after we ordered.  👍👍👍\nOrdered half chicken $16 and they allow mix of roasted and steam chicken.  Chicken rice is $1.20. Hainanese pork chop $12, prawn roll $10, Chinese sausage eggs $10 (for our friends who are experiencing shortage of eggs in C.A, USA), green sprouts $14 (medium). Portions for small are good for 4, we prefer lots of vegetables so upsized the sprouts. Would say that the prices are similar to coffeeshop zichar but the ambience is nicer. Good flavours and not overly salty. Lots of choices on the menu too...\nDrinks are $3... prices are subjected to GST... they don't take credit cards but do have paynow etc...",
      "time": 1743474804,
      "translated": false
    },
    {
      "author_name": "AC Chan",
      "author_url": "https://www.google.com/maps/contrib/112914663109983612841/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWwNBKCO5Ms4Y2lK88n57wi8-GEEiKO7GMVshBia6Lxg2AUolVd=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Took a trip down memory lane to Superbowl Jurong, this one-of-a-kind place that’s been around since the early-Nineties. It’s hard to believe it’s been that long since I first visited this place. 😌💫\nWe decided to try the steamed chicken at  Nam Kee Chicken Rice Restaurant with an old-school charm. Tender and meaty with a delicate layer of skin bathed in light soy-based sauce. It’s simple, yet incredibly comforting!\nP.S. What makes it even more special? All the dishes are served on these beautiful vintage longevity pattern plates, adorned with floral design and the four Chinese characters — 萬 | 壽 | 無 | 疆. Truly in love with these pieces!🥰",
      "time": 1743347811,
      "translated": false
    },
    {
      "author_name": "Isobel Tan",
      "author_url": "https://www.google.com/maps/contrib/114565326728876809259/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXofkM9cPKs8xyZpd85Bu-2sn6hgHkpFK93thNaHtY_yZwzPhuf=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Am not sure why we didn’t know about this place earlier. I love a good plate of chicken rice, and Nam Kee certainly ranks up there for offering precisely that.\n\nWe came here for dinner after a run around Jurong Lake Gardens, since you can park at the open air carpark at Super Bowl.\n\nThe restaurant is air-conditioned and really comfortable, and the staff are very friendly and helpful.\n\nWe ordered half a poached chicken, sweet and sour pork, the home made prawn rolls and the chicken rice.\n\nEverything was delicious. The poached chicken was tender and juicy, and tasty even without any sauce. In any case, the free flow dark soy sauce and chilli were still there to elevate the flavour. The rice was also really flavourful and was perfect to pair with the chicken. As with other traditional chicken rice restaurants, your chicken rice comes with free refillable chicken soup, which was such a comfort for the evening.\n\nThey also do tze char dishes in case you want more variety. The sweet and sour pork and prawns rolls were both good as well.\n\nThe food also came pretty fast.\n\nAll in all, it was a great experience and we’ll definitely be back the next time we have a chicken  rice craving.",
      "time": 1743874744,
      "translated": false
    },
    {
      "author_name": "Richard Cheah",
      "author_url": "https://www.google.com/maps/contrib/116759225490774107700/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVef_QJnebvaDUQhooAeEZleYqFaS7Krt7KXp9az1YOWfL1Nvsa=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 2,
      "relative_time_description": "6 months ago",
      "text": "Our first visit here. Before we proceed to order, we were informed many dishes not available like:\n1) Hainanese Roasted Chicken\n2) Char Siew / Roasted Meat\n... and among others.\n\nWhat and how on earth are the owners going to run their business when it's newly opened. And, it is only Monday.\n\nTo add-on, there are no proper eating utensils. We have to eat with soup spoon, together with the fork for our meal. Boss explanation is the shipment has not arrived! What a good reason to give, considering this not their first outlet after more than 30 over years in business. Wondering if the spoons are specially plated with gold, custom made to serve our locality here?\n\nComing to the prices, portion for a bowl of fragrance rice at $1.20 is an extremely small portion, definitely far over priced considering the location serving housing estate in Jurong here.\n\nSad and sorry to say, you can get a bigger portion, with better fragrance at the nearby FM Food Court.\n\nOverall, the chicken rice is only average at best. The price is far too costly to warrant any customers returning after their first visit.\n\nHard to say if I will ever return but looks like chances are not high.",
      "time": 1731926141,
      "translated": false
    },
    {
      "author_name": "Jeremy Tan",
      "author_url": "https://www.google.com/maps/contrib/116191827592187993639/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW-5kOMz3ZjOE5JXF9gRDhwNmQLSwL1dQZhkmPc-kKkB6sMwcZV=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Now westies do not need to travel all the way to the Thomson stall for nice chicken rice. This outlet is situated just beside Sheng Siong at Yuan Ching Road.\n\nThe chicken meat is tender and is the hainanese version. Goes well with the condiments. The chili sauce is the savoury kind - with a tinge of sweetness.\n\nThe ambience is old school with the metal tables and chairs of old.\n\nOverall, a decent meal.\n\nOpens during CNY (surcharge of 20% applies).",
      "time": 1738232308,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17532772837531831660",
  "user_ratings_total": 68,
  "vicinity": "1 Yuan Ching Road, #01-02, Singapore"
}