{
  "formatted_address": "203 Hougang St 21, #03-77, Singapore 530203",
  "geometry": {
    "location": {
      "lat": 1.3581182,
      "lng": 103.8844493
    },
    "viewport": {
      "northeast": {
        "lat": 1.359429780291502,
        "lng": 103.8859557802915
      },
      "southwest": {
        "lat": 1.356731819708498,
        "lng": 103.8832578197085
      }
    }
  },
  "name": "NannyPro Pte Ltd",
  "place_id": "ChIJpcodKAYa2jERenkuPwPXqTM",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Kwan",
      "author_url": "https://www.google.com/maps/contrib/110111356068878684413/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJbVhrkud7o4Km0nwdzCVp78-17WM3UcsVlr1IigbzU1m-04Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "We were really lucky to have found CM Nika through NannyPro. She took care of our infant son and has been nothing short of amazing. Nika is very attentive and patient. She quickly understood our son’s needs and routines, and we could see he felt comfortable and safe with her. She also kept everything clean and always updated us with how things were going, which we really appreciated.\n\nWe’re very thankful for the care she gave and would definitely recommend her! :)",
      "time": 1746510383,
      "translated": false
    },
    {
      "author_name": "Persephone Kazl",
      "author_url": "https://www.google.com/maps/contrib/100009600998117124455/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWj3Gho8yGY8pBdYXRL32ENYwKQ3n2ZPuae_hLptnAbbGSJHsjc=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "We had a fantastic experience with NannyPro from the initial email correspondence all the way through to the day to day with Nanny Zareena.\n\nMy family was in Singapore for a month and needed extra help with our 14 month daughter while we were there. We were quite nervous as she was extremely active and had recently become a bit clingy to mama.\n\nNanny Zareena was AMAZING, my daughter warmed up to her instantly. We cannot thank her enough and we sincerely hope we get to see her again the next time we are in Singapore!",
      "time": 1745488877,
      "translated": false
    },
    {
      "author_name": "Claire C",
      "author_url": "https://www.google.com/maps/contrib/114143806317592270804/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVWcnfXKi716DE4H2hFH9Qmj-Ka0DCh0LxkvJCpiHzk17sOaNbf=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "We have had the pleasure of engaging Nanny Pauline to look after our son twice - when he was 10 months old and again when he was 1.5 years old. Pauline is incredibly attentive, patient and warm, making our little one feel completely at ease. She is also very punctual, professional and an excellent communicator. She gave us complete peace of mind leaving our son in her care.\nWe were also impressed with the professionalism of Nannypro. The process of finding a nanny was seamless, and their ability to match us with someone so well-suited to our family exceeded our expectations.\nWe highly recommend their services to anyone seeking reliable care for their children.",
      "time": 1735270232,
      "translated": false
    },
    {
      "author_name": "SNB",
      "author_url": "https://www.google.com/maps/contrib/118259410458799300321/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIVW_JJnhmljlcZit7SF2aCxtdsgqNl0BTJxgczXX7P2twbfA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I am very happy that such child minding engagement is made available to parents. It is definitely my preferred option if distance and time had not been crucial factors. I will not shy from engaging a CM in future, on ad-hoc basis.\n\nNiyah is such a wonderful CM. She takes care of Fatimah very well, patient with the baby who was very new to bottle feeding when we first sent to her.\n\nAlthough her service is in a home setting, from her interactions with Fatimah (as observed during drop-offs and pick-ups), Niyah takes great pride in her duty as a child minder, constantly engaging Fatimah in conversation. She takes Fatimah to water the plants in the morning and teaches Fatimah basic skills like kissing the hands of the elderly (a Malay/Muslim customs), among others. It is a pity that we can only send our baby to be under her care for 3 weeks only. We hope other parents will try out her service.",
      "time": 1743143764,
      "translated": false
    },
    {
      "author_name": "Valentine BM",
      "author_url": "https://www.google.com/maps/contrib/102445838413957692970/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIGXAz407r2m7qdJLgl842aWxyBbV04n2poYoc6OYSvK2RMKVE=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We had a fantastic experience! From the very beginning, Annelyn was incredibly helpful and responsive, assisting us in arranging a nanny for our stay in Singapore. Our nanny, Yichin, was not only kind and attentive in caring for our 1-year-old, but also went above and beyond by showing us around and helping us enjoy our time. We’re very grateful—thank you!",
      "time": 1743742484,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3722742975943309690",
  "user_ratings_total": 116,
  "vicinity": "203 Hougang Street 21, #03-77"
}