{
  "formatted_address": "73 Tras St, #01-01, Singapore 079012",
  "geometry": {
    "location": {
      "lat": 1.2775362,
      "lng": 103.8443443
    },
    "viewport": {
      "northeast": {
        "lat": 1.278891880291502,
        "lng": 103.8456553802915
      },
      "southwest": {
        "lat": 1.276193919708498,
        "lng": 103.8429574197085
      }
    }
  },
  "name": "NC Rejuve Care Centre @ Tanjong Pagar 诚德中医产康管理中心 by Nature Concept T&CM Specialist (诚德新加坡丹戎巴葛分院)",
  "place_id": "ChIJ-35JyyYZ2jERXIx7HA-6rSI",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Penny Tsai",
      "author_url": "https://www.google.com/maps/contrib/107629910871754347387/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVwegrMLysEUcEnlHcqcAQ8CdeuW5gYcuSYtUkYWsBZgR3MfjUV=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I would like to express my heartfelt gratitude to Senior TCM Therapist Hui Min for her professionalism and patience. Every consultation with her is thorough and detailed. She takes the time to carefully assess your condition and tailors the treatment accordingly. Hui Min also shares valuable advice on lifestyle changes, including diet and exercise, to help address the root cause of health issues.\n\nAfter giving birth, I suffered from persistent back pain and never expected it to be linked to my weak spleen, stomach digestion issues, and changes in my bone structure. Hui Min’s professional insights and personalized treatment have made a huge difference in my recovery. Her holistic approach and dedication to resolving the root causes of pain are truly commendable.\n\nThank you, Hui Min, for your exceptional care and for helping me regain my health and well-being! Highly recommended!",
      "time": 1736502174,
      "translated": false
    },
    {
      "author_name": "Nicole Yuen",
      "author_url": "https://www.google.com/maps/contrib/114840647611886188609/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLCOv42spfJhDCqxsqjbEy9UerfqNTjTD972A3duWrTdkVnyQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "I had an amazing muscle relaxation treatment with Hui Min! She is incredibly skilled and attentive, focusing on my specific tension areas. Her warm demeanor made me feel at ease, and I left feeling rejuvenated.",
      "time": 1746249718,
      "translated": false
    },
    {
      "author_name": "Daphne Koh",
      "author_url": "https://www.google.com/maps/contrib/114721639611496003053/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXretkKZLJHDVAJ2gNk1R9ra6OE4iixO25iH-_yeKhwD4tQVxZkTw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Got to know NC Rejuve Care Centre from an event and decided to try out today. When I walked in, I was welcomed by their friendly receptionist. After filling up my details, I was brought to the consultation room for consultation by Physician Nick. He was very patient and explain to me my condition after assessment. After which I was brought to another room for postural assessment by Physician Hui Min. She explained my condition and told me about my treatment plan. She led me to one of the treatment rooms and started treatment together with Physician Nick starting off with acupuncture. After my treatment, she provided me with some tips on my posture. She did explain to me about their package but was not pushy for sales. She also did not ask me to book immediately for my next appointment. She only told me to call or sms them should I need their service. 👍👍",
      "time": 1743149770,
      "translated": false
    },
    {
      "author_name": "Sophia Tan",
      "author_url": "https://www.google.com/maps/contrib/101325747797795238571/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVuuS8veDCXVdXXfAW1Bq_kR3ZfCc1xdDZPhfKGsBBhvvQHdRCbNw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Senior Therapist Hui Min has been very professional. She’d make measurements before and after to ensure that the pelvis correction has been effective - and we were able to see the results right after!\n\nMy walking gait and speed have also improved after treatment.\n\nThe advice is also personalised - She also lets me know how I can help myself best - about not crossing my legs, my sleep posture, and also to keep my womb warm with a warm bottle, as I’m prone to being cold.\n\nVery much recommended! 👍",
      "time": 1731564679,
      "translated": false
    },
    {
      "author_name": "Zan Hao",
      "author_url": "https://www.google.com/maps/contrib/107584708820935998905/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIx2uq6VQoBoQLjg2JeKx0Kx1ZHaGAUZAfmMVJAr7siXOxpLg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I sincerely thank you for helping me with my pelvic issues! Your treatment was simple yet highly effective, which made my sister feel very reassured. Every visit felt so welcoming because of your patience and care. You always put yourself in my shoes, and now I’m recovering so well. Thank you so much!",
      "time": 1732883071,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2498857942325627996",
  "user_ratings_total": 9,
  "vicinity": "73 Tras Street, #01-01"
}