{
  "formatted_address": "Blk 214 Pasir Ris Street 21, #01-256, Singapore 510214",
  "geometry": {
    "location": {
      "lat": 1.3678231,
      "lng": 103.961273
    },
    "viewport": {
      "northeast": {
        "lat": 1.369232130291502,
        "lng": 103.9626321802915
      },
      "southwest": {
        "lat": 1.366534169708498,
        "lng": 103.9599342197085
      }
    }
  },
  "name": "New Life Preschool @ Pasir Ris",
  "place_id": "ChIJgeoTqVQ82jER5_eK0Te4aHQ",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Mark Sandra",
      "author_url": "https://www.google.com/maps/contrib/102567069727174519823/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI7vbqSwubTdIhfhvrlBIhpDhljBGaNgx7__qvx-T85K4YzgA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "My 3 boys have been in the warm, friendly, caring and nurturing environment of the school since young.\nI will be enrolling my 4th son as well, to join his brothers in experiencing a superb learning atmosphere filled with love and dedication from all the teachers.\nThe food is awesome as well, with all thanks to the culinary expertise of the school's dedicated in-house Chef.\nLast but not least, all administrative processes and procedures are consistently carried out smoothly through the efficiency of the Head of Centre Mdm Ho!\nThank You!",
      "time": 1732057369,
      "translated": false
    },
    {
      "author_name": "Estella Yu",
      "author_url": "https://www.google.com/maps/contrib/109310386523191819378/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKByxUNGhpHiB9EkukddKR_kX2yRE5gJTetsAhPKU2e9LImiw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "We are so blessed to be in New Life Preschool @ Pasir Ris (Formerly YWCA) for 4 years. Principal Mdm Ho is good and helpful. All teachers there are responsible and well trained. They teach children to pray before meal and worship songs as well. Good and healthy environment for children to grow up. Highly Recommended.",
      "time": 1732533819,
      "translated": false
    },
    {
      "author_name": "James Minqin Lim",
      "author_url": "https://www.google.com/maps/contrib/116185417275925555979/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVMvvE4qKXT2SlgKxwB3b6LPTV1D0HwaJAwN0ktnc_BV374FyMgLQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "New Life Preschool @Pasir Ris has been an incredible experience for my children, Immanuel and Samuel. The teachers and staff have created a nurturing and engaging environment that has fostered my children's growth and development.\n\nI've witnessed my children blossomed into confident, curious, and creative individuals. The preschool's curriculum has instilled a love for learning, and my children are always eager to share new discoveries and experience with me.\n\nThe teachers are dedicated, passionate, and genuinely care about each child's well-being. They've taken the time to understand my children's needs and talents, providing constant guidance and support.\n\nThe staff always ensure that the school environment is clean and tidy. My kids always give praise for the yummy and healthy meals and tea breaks prepared at school.\n\nAm very grateful for the regular updates, progress reports, and opportunities to participate in outings with the preschool. The administration has been responsive, transparent and welcoming.\nI highly recommend New Life Preschool @ Pasir Ris to any family seeking a nurturing, engaging and high-quality early childhood education.\n\nNee Life Preschool @Pasir Ris has exceeded my expectations, and I feel fortunate that my children enjoyed their early childhood education with this wonderful preschool.\n\nSpecial thanks to Mdm Eileen Ho (Centre Leader), Teacher Pan Yong Juan, Teacher Liang Mui Yeong, Teacher Liang Ling, Teacher Faridah Bte Sapree, Teacher A Sushela A Ayyakkuti, Teacher Zhang Sisi, Teacher Chen Dan, Teacher Yu Dafang, Teacher Cynthia Peh, Teacher Elvin Kimberly Mary , Ms Tong Oi Lin, Ms Tan Hiok Lan, Ms Yeo Cheng Leng.",
      "time": 1734085958,
      "translated": false
    },
    {
      "author_name": "Benjamin Lek",
      "author_url": "https://www.google.com/maps/contrib/111926583805220697143/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLYwU4U-Fo_eQXWUImXWt4ISXMZoQ1_QKXOdpSaw5UrBif8dg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "We are incredibly fortunate to have Mdm Ho leading the childcare center. Her dedication and passion for creating a safe, loving, and enriching environment for the children is unmatched. She not only ensures that each child receives individual attention, but also fosters a sense of community that makes my family feel welcome and valued.\n\nWe can genuinely feel she cares about each child’s growth and happiness. Mdm Ho and her Team brings warmth, professionalism, and a unique energy that makes the center feel like an extension of home. Their dedication to creating a nurturing and educational environment has helped my children flourish both socially and academically. I truly appreciate the peace of mind knowing my daughters are in such caring and capable hands. We’re so grateful for everything she does for our children and our family!\n\nNot forgetting the team of teachers in the centre over the years. Special mentions for 潘老师，张老师，陈老师，Teacher Joseph and Teacher Faridda for their dedication and patience towards Hailey & Abby.\n\nWill definitely recommend this Preschool!",
      "time": 1731294855,
      "translated": false
    },
    {
      "author_name": "JuiceTea Nah",
      "author_url": "https://www.google.com/maps/contrib/114417869779171924487/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWdsd6L-rWXii7YPqW6QfIfOdHm9pR5zS3EiIgfZwLClRkLh8Y=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Principal MDM Ho is very experienced and manages the Center very well. My first child was so well taken care of, so I decided to put my 2nd child there too even though I no longer stay in Pasir Ris. Teachers give  regular feedback about how my child is doing and genuinely cares for the children. I noticed that all teachers know all names of children and are so warm and welcoming when doing checks for children before entering the school. My child often tells me how much she loves her class teachers and even some other teachers who do not teach her. She is super picky eater at home but she loves the food in school, always praising the aunty food esp. vegetable soup. IMO what I look for in a good preschool is one that my child is well taken care of and teaches good values which sets my heart at ease. Newlife @pasir Ris did it!",
      "time": 1731299728,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8388156855855806439",
  "user_ratings_total": 21,
  "vicinity": "Blk 214 Pasir Ris Street 21, #01-256"
}