{
  "formatted_address": "297, #01-01 Compassvale St, Singapore 540297",
  "geometry": {
    "location": {
      "lat": 1.3952387,
      "lng": 103.8993194
    },
    "viewport": {
      "northeast": {
        "lat": 1.396610330291502,
        "lng": 103.9006175802915
      },
      "southwest": {
        "lat": 1.393912369708498,
        "lng": 103.8979196197085
      }
    }
  },
  "name": "newEcon - Fair Mart Superstore Seng Kang",
  "place_id": "ChIJfbD4HA8W2jERKdMFvW0fEkk",
  "rating": 3.4,
  "reviews": [
    {
      "author_name": "Phone “Karishad” Thawdar",
      "author_url": "https://www.google.com/maps/contrib/109401064009397372775/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjULDu1iYvLmuPAftU-59JGCmZ-M11ME16UOmJVqdCHjRS1EykhI=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "2 weeks ago",
      "text": "As a student attending a nearby school, it is very convenient for me to buy food from here during lunch breaks and so forth. However, during lunch breaks the shop is very very full. The food is well-priced. However the bubble tea experience is very bad. the boss is very rude when it comes to serving customers.",
      "time": 1746162747,
      "translated": false
    },
    {
      "author_name": "SBH Hanabi",
      "author_url": "https://www.google.com/maps/contrib/110993084734074602600/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJFLXWa9NTE7_LVWpLcMLqnw6q8Wn6TUtkfz_5uzXaktuOAvA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "The old lady cashier was very rude. She has been rude to other customers several times but today it just hit me. I buy things from here all the time and always pay using paywave payment. But just now when I was about to pay she said to me \"next time tell me how you want to pay\" even though I was just holding the phone she should have already known I wanted to pay with. Even if I didn't tell her, couldn't she ask? she is like that deliberately provoking people's anger. I feel like I'm taking something for free from her so she acts like that. never buy anything from here again!!",
      "time": 1733885477,
      "translated": false
    },
    {
      "author_name": "Ed Chua",
      "author_url": "https://www.google.com/maps/contrib/115818807181592198440/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWdbwmVWX-mK-dOF-il48QJKjqGwQsKRqTacF6JGG_3up4ijqo=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "10 months ago",
      "text": "Very upsetting experience ordering bubble tea here. I ordered a peach milk tea and requested that the lady put my drink in my own drink container. Since my container was bigger, she told me to get the bigger cup at $4.50. I told her it was fine. As she was about to scoop pearls, I said “no pearls, thank you”.\nDrink wasn’t cheaper, but it’s still fine. I walked around to see if there was anything else in the minimart I wanted to buy.\nWhen I came back, I was shocked to see my container filled with fresh milk.\nI told her I ordered Peach Milk Tea, in which she replied in mandarin, “Peach Milk Tea and Peach Milk are 2 different things”. WTH 😅 like I don’t know that they’re 2 different things? That’s why I ordered peach milk tea in the first place.\nThen it was just a stare off. And I had to rush off for my class, so I just took my container and left. She had absolutely no remorse and was not apologetic for her mistake at all.\nAbsolutely ridiculous.\nAnyway, the minimart is fine… and it’s frequented by the kids around the area. But this bubble tea ordering experience was absolutely the worst. I will never order bubble tea from here ever again.",
      "time": 1719986059,
      "translated": false
    },
    {
      "author_name": "H2 O",
      "author_url": "https://www.google.com/maps/contrib/114520501314404177965/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocImRgo-7uNuDwxydMXa3NwpN-njgWEh3HPr7eT_fOrOqNfw=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "Comprehensive food household DIY day to day groceries sundries supermarket conveniently located at neighbourhood heartland of Sengkang walking distance to Compassvale Secondary School Modern Montessori Compasvale MMI Kinderland Preschool Sengkang Star Learners @ Rivervale Rivervale Community Centre Compassvale Lodge RC PAP Community Foundation Punggol Sengkang Sculpture Park with breezy greenery away from busy cityscapes and That Coffee Place with hawker delights in clear tidy aircond setting. Freshly prepared food with healthy ingredients tender loving skillful cooking and warm services. Walking distance to Compassvale LRT SE1 one stop to Sengkang MRT bus interchange Compass One with plenty of dinning shopping banking supermarkets library cinemas entertainments groceries sundries postage services community centre and amenities nearby. Friendly cosy comfy welcoming ambience for romantic intimates groups students expats locals visitors and families.",
      "time": 1576130064,
      "translated": false
    },
    {
      "author_name": "Ilah Faadhilah Abdul",
      "author_url": "https://www.google.com/maps/contrib/101140127412308997373/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUrapjfln1AS3Fci0X1p5Gy1AmE0PSBQ1Ep1-5i6_Y_4cduS1T_Sw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "VERY BAD EXPERIENCE\nLADY BOSS WAS SO RUDE.\nSHE SPOKE TO ME IN A HIGH TONED VOICE IN CHINESE SAYING LIKE WHAT DO U WANT. BAD CUSTOMER SERVICE.",
      "time": 1729745861,
      "translated": false
    }
  ],
  "types": [
    "convenience_store",
    "grocery_or_supermarket",
    "store",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5265305470532703017",
  "user_ratings_total": 91,
  "vicinity": "297, #01-01 Compassvale Street"
}