{
  "formatted_address": "9 Mohamed Sultan Rd, Singapore 238959",
  "geometry": {
    "location": {
      "lat": 1.2938585,
      "lng": 103.8418073
    },
    "viewport": {
      "northeast": {
        "lat": 1.295175630291502,
        "lng": 103.8432010302915
      },
      "southwest": {
        "lat": 1.292477669708498,
        "lng": 103.8405030697085
      }
    }
  },
  "name": "Newtonshow Central 1",
  "place_id": "ChIJFb6xm0MZ2jER1bSBERXkwCo",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Vera Ivantsova",
      "author_url": "https://www.google.com/maps/contrib/114313594025443086880/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIIW4suyPBZKA1ltEvsYDEDcN8zQaOUB6MbJ-aiY_mIS_eejQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Thank you for party on 7 December 2024 for Alexandra (3yo)\n\nWe hired Newton Show to organize a dinosaur-themed party for our daughter’s third birthday in December 2024.\n\nWe decided to put ourselves in the professional hands of their Manager, Julia, and ordered a full package N3.  As well as the science demonstration, this included food/treats for the kids, a dinosaur-themed cake, room and birthday table decoration, posters, souvenirs for children, etc.  On the day, everything was ready and prepared as agreed, and we just turned up an hour before the start to add our own personal touches.\n\nWe encouraged parents to drop off their children for the 90 minutes of the party, although some chose to stay, and that was fine too.  In spite of the children being so young (2.5-3.5) they were enchanted by the Newton Show experiments (dry ice, making plastic snow, burning foam, etc.) conducted in entertaining fashion by Mr. Dinosaur.  Like magic, but everything was real.  And safe!  He was able to grab the young audience, keep them interested for a whole hour, and even get them to participate where appropriate.  The proceedings were rounded off with a “volcano” birthday cake.\n\nThe parents who stayed were thrilled to see the enthusiasm and twinkles in the children's eyes as they were watching Mr. Dinosaur’s experiments and jumping up and down while participating in all activities.  We even hope that a few tiny seeds may have been sown for the development of scientists of the future!\nWe had 24 kids at our daughter's party and received a lot of positive feedback from other parents.  The kids enjoyed the party while the parents had a peaceful 1.5 hrs for themselves on a weekend day.  Many thanks to Julia and her team.\nWe wish Newton Show lots of success with Christmas activities and generally developing scientific skills in the younger generations.\nBest wishes,\nVera & Bernard Samules",
      "time": 1734318499,
      "translated": false
    },
    {
      "author_name": "Carol Shum",
      "author_url": "https://www.google.com/maps/contrib/102890181727310102433/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXnxPR6Ob1yOLtCxHoUENFE8gvmFZD2yJ_quOi8hHoSKx2Nhdc=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I want to take a moment to express my admiration for the Newton Show Camp that my son is having this week. The thoughtful selection of camp content is truly impressive, providing a rich blend of hands-on science activities that ignite curiosity and encourage exploration.\n\nThe teachers are not just knowledgeable; their passion for science shines through in every lesson. They foster an engaging and supportive environment, ensuring that every camper feels valued and inspired to learn. Their genuine care for the students' growth and understanding makes a world of difference, creating a nurturing atmosphere where young minds can thrive.\n\nThank you for creating such a wonderful experience for everyone involved. This camp is a fantastic opportunity for campers to develop their skills and love for science!",
      "time": 1733919532,
      "translated": false
    },
    {
      "author_name": "meo my",
      "author_url": "https://www.google.com/maps/contrib/113049762808046515938/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVHxjuObCiD8-Xp0JDurm5z8yXeBuPcgZU8CIxEd_n1G7HjDiXr=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "After the first class at Newtonshow, my daughter asked to return and join more camps as she really love and enjoy it. She said that it is so much fun, the professors are awesome and she immediately made a new friends just after a day. I couldn't ask for more. Happy child happy parents! And of course we'll return after this camp.",
      "time": 1735176783,
      "translated": false
    },
    {
      "author_name": "Gill Loughnane",
      "author_url": "https://www.google.com/maps/contrib/113911780818533172462/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ2ZA6ZMhIi3SZmcP7GrUednRabDkgw_yMfaAVUvGxWMhO5Jw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Fantastic camp! My daughter loved it so much. Great themes each day and she really enjoyed all the experiments. She definitely wants to go back - she loved all the instructors. Thanks :-)",
      "time": 1730780394,
      "translated": false
    },
    {
      "author_name": "Xylia Kwek",
      "author_url": "https://www.google.com/maps/contrib/106839221673518322818/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJen46FQ35qW9Xj-aXywraaZuIeMg6gvy9BEggx__piJ6ktNQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "My girl enjoyed a lot in her one week camp-inside the christmas story\nHave hands on experiment on Science and get to bring back some of their creation.\nA good memories and.experience to have over the school holiday.",
      "time": 1734873610,
      "translated": false
    }
  ],
  "types": [
    "museum",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3080712924260578517",
  "user_ratings_total": 20,
  "vicinity": "9 Mohamed Sultan Road"
}