{
  "formatted_address": "211A Clementi Ave 6, Singapore 121211",
  "geometry": {
    "location": {
      "lat": 1.3234747,
      "lng": 103.7620426
    },
    "viewport": {
      "northeast": {
        "lat": 1.324780180291502,
        "lng": 103.7633951802915
      },
      "southwest": {
        "lat": 1.322082219708498,
        "lng": 103.7606972197085
      }
    }
  },
  "name": "Next Door Coffee",
  "place_id": "ChIJ5-LwTQAb2jERHszCPsRBzM0",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "LiangKoon Lim",
      "author_url": "https://www.google.com/maps/contrib/106877878432749868405/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWg3fEPyQ_mNl9sPRM9Q2cS75P4nusRQKstUe490zwZbAVk0rgT=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "5-Star Review for Next Door Coffee\n\n⭐️⭐️⭐️⭐️⭐️\n\nIf you’re looking for a coffee experience that feels like home, Next Door Coffee is the place to be. The owner, has created an inviting space where quality and passion shine through every cup.\n\nI ordered an Americano, and from the very first sip, I knew I was in for a treat. The balance was impeccable—smooth, rich, and full-bodied without any bitterness. It had deep, toasty notes with a subtle hint of natural sweetness, making it incredibly satisfying. The aroma alone was enough to wake up my senses, and the finish was clean yet lingering, leaving a delightful warmth that made me want to go back for another cup.\n\nBeyond the coffee, the service was warm and genuine, making the entire experience even more memorable. Whether you’re a coffee enthusiast or just someone looking for a reliably great cup, Next Door Coffee is a must-visit. Highly recommend!",
      "time": 1738231758,
      "translated": false
    },
    {
      "author_name": "melissa liew",
      "author_url": "https://www.google.com/maps/contrib/105048789595602916935/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWVRu2VxMO_ToBpnPuCKxKpBYq58bpTw3hRhtlGCmIGiwpHIylP=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "If you're looking for a cozy, home-based coffee spot serving up phenomenal drinks in the west (Clementi), look no further than Next Door Coffee! (conveniently located near the MRT as well; within walking distance!)\n\nI have had multiple tries at her drinks and they impress me every single time :\") You can truly taste the love, patience, and care that Wylie pours into every cup. ✨\n\nOne of the things I love is how flexible she is — whether you’re looking for bottled brews to stock up for the week or a freshly made cup on the go, she’s got you covered. Perfect for busy days or when you just need that caffeine fix/mood booster!\n\nMy personal favourite has got to be the strawberry matcha: she does not skimp on the matcha!! the sweetness and tanginess of the strawberry puree complements the rich and earthy texture of the matcha so well — creating the perfect balance of flavours in every sip! an absolute must try if you ask me!!! 🎉💕\n\nBeyond just serving amazing drinks, Wylie has been incredibly generous — she kindly sponsored drinks for a collaboration with my food account (@breadboidiaries) and even partnered with me for my school fundraiser initiative (@nus.projectiris). Her kindness and hospitality are truly unmatched.\n\nthank you so much wylie! ❤️ for your generosity, love and passion into every cup of drink you prepare ++ the 100/10 hospitality every single time :^) i can't wait to be back already ",
      "time": 1740212249,
      "translated": false
    },
    {
      "author_name": "Hax Mays",
      "author_url": "https://www.google.com/maps/contrib/115776232152336822036/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIEiranvEZfri_n1HyMvDlyKW3Rm8-iDlwrnK7nurtyzFRDvA=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "Found this coffee home-based business whilst in the area. Thankfully it’s opened that day as they don’t open everyday. Order is simple via online and choose a pick up time. There’s no extra charge for choice of oat milk. Got a few cuppas for the family as well. Timing was perfect as the orders were done when parking. My iced white was good though a little milky for me. The hot white and iced oat were also thoroughly enjoyed. So for those in Clementi or its surroundings, please support this home based business.",
      "time": 1713836907,
      "translated": false
    },
    {
      "author_name": "Jia Yi Nyang",
      "author_url": "https://www.google.com/maps/contrib/100833960424798089583/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWpCBsrk6OLbZ2r122MmNEWoD--GKgIpArKrBGfwY9OdzCHsJZOyw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "The coffee is spot-on, and their matcha latte is awesome!! Smooth, not too sweet, and just right. It’s home-based, so it feels super cozy and welcoming. Highly recommend to check it out!! Will order again! 💯💯💯",
      "time": 1723296002,
      "translated": false
    },
    {
      "author_name": "Jenise",
      "author_url": "https://www.google.com/maps/contrib/110266102815901808814/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIoLc2wjYRyQWO8-amvR9ptS7PifF4qmyX_XurTThwJd05iBQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "Ordered their coffee and matcha a few times now and always as good as the last! Coffee and matcha is typically so expensive outside but here it’s very reasonably priced + good quality! Dad had the hot white and really liked it too. Ordering process is simple and owner is really friendly, do support them!",
      "time": 1720223943,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14829299984146549790",
  "user_ratings_total": 33,
  "vicinity": "211A Clementi Avenue 6"
}