{
  "formatted_address": "80 Mandai Lake Rd, Singapore 729826",
  "geometry": {
    "location": {
      "lat": 1.4021872,
      "lng": 103.7880606
    },
    "viewport": {
      "northeast": {
        "lat": 1.406023,
        "lng": 103.7902812
      },
      "southwest": {
        "lat": 1.4009086,
        "lng": 103.7873204
      }
    }
  },
  "name": "Night Safari",
  "place_id": "ChIJ9xUuiNcT2jER49FS2OpE8W8",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Gopi Nallaiyan",
      "author_url": "https://www.google.com/maps/contrib/117717395531505414734/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW7dNjtsuOE1jK0vem8-qvYlrq5f1DI34BiMZ0ZZFLIVU87sR4uYg=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Good way to see the different types of wild animals like in the zoo during the night time. The animals are fed during the visit time and hence it can be spotted. Walking safari trial is the best for the nature and animal lovers to watch them at your own pace amidst the forest like atmosphere. Tram ride provides the same experience in tram. Amphitheater with show also available to get insight about the nocturnal habits of wild animals and what to expect in the safari. It’s ideal to start the Amphitheater show first followed by walking trial and dinner with tram ride at the last. ♿️✅",
      "time": 1747187938,
      "translated": false
    },
    {
      "author_name": "Isaac L",
      "author_url": "https://www.google.com/maps/contrib/103715143213981871749/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW7_o0-zDI4PyZaT3DKWSO0j1QEJkOss6_qP7JQnP6FXlKi1yGSoA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "I caught the show at 7:30 p.m., and the amphitheater was completely packed. Afterward, I hopped on the tram to explore the weather, which was pleasantly cool after the rain.\n\nHonestly, the show didn’t quite click with me. The pacing felt slow, and I just couldn’t get into it. But hey, don’t take it personally it’s not the performers, it’s me! Having visited zoos worldwide and seen countless shows, my tastes might just be a bit particular.\n\nThat said, the park itself was wonderful, with plenty to see even at night. The staff were helpful and stationed everywhere, making the experience smooth and enjoyable.\n\nMega Tip: First, do the trails when there's sunlight and later do the tram. With both, one will be able to cover all the animals. it’s worth visiting and one of kind experience. 😇 give me a thumbs up so I know this helped ya",
      "time": 1745159809,
      "translated": false
    },
    {
      "author_name": "Dayanand Kotian",
      "author_url": "https://www.google.com/maps/contrib/105275854513603746457/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWfW_qtjMyo62Ro0ewEgLtTjxZELRQKAfVXzFcjE3xaE8UafoTQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I must say, I absolutely loved the place, and the wait was definitely worth it. The accessibility was a big plus, as wheelchairs were available for free if needed. Although I had to wait for almost 40 minutes, priority was given to wheelchair users, which was much appreciated . However, we waited for the entire group to queue up, which was understandable.\n\nI completely enjoyed the fire show, and the main performance was fantastic. The show changes daily, featuring five different animals on stage, with fascinating facts shared about them. The visual display was also impressive.\n\nThe tram ride was another highlight, offering a great opportunity to see the animals up close in a setting that closely resembles their natural habitat. Overall, it was a worthwhile experience and very wheelchair-friendly!",
      "time": 1739791914,
      "translated": false
    },
    {
      "author_name": "Arkajyoti Saha",
      "author_url": "https://www.google.com/maps/contrib/112859807975117158993/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLK1-Gaci-IcOuaVRY00T8T-_2vrCdIGEm9wasasNlmPj4E4ww=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "2 weeks ago",
      "text": "Good place for spending the time. Dont expect too much. Its more of show & a tram ride through the zoo (different parts of zoo). During tram ride u may be able to see 50% of the animal as they r still hiding in d dark (expected). The walking trail is better.",
      "time": 1746064729,
      "translated": false
    },
    {
      "author_name": "Mitchell Fraser",
      "author_url": "https://www.google.com/maps/contrib/112728619608967398768/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW3djO7WnA5r-aLW-8f68hbjQR53_C779Sfutex8ppOHzugp71m=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "All I can say is wow. We saw so many incredible animals, me and my friend were absolutely blown away by the whole experience. Animals seem well looked after and the enclosures seem ethical. There is such a wide variety of wildlife it’s hard to keep up! I would allow two hours to complete the trails and 45 minutes for the tram ride. You can easily spend hours here.",
      "time": 1741152588,
      "translated": false
    }
  ],
  "types": [
    "tourist_attraction",
    "zoo",
    "park",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8066304183039611363",
  "user_ratings_total": 32287,
  "vicinity": "80 Mandai Lake Road"
}