{
  "formatted_address": "653A Punggol Dr., #01-05, Singapore 821653",
  "geometry": {
    "location": {
      "lat": 1.3980195,
      "lng": 103.9193741
    },
    "viewport": {
      "northeast": {
        "lat": 1.399221530291502,
        "lng": 103.9206166802915
      },
      "southwest": {
        "lat": 1.396523569708498,
        "lng": 103.9179187197085
      }
    }
  },
  "name": "Northeast Medical Group (Punggol Clinic)",
  "place_id": "ChIJ4TDU2xc92jERZNz31DDPxGQ",
  "rating": 2.9,
  "reviews": [
    {
      "author_name": "Humairah 312",
      "author_url": "https://www.google.com/maps/contrib/110717046364975968096/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWKZfBNei1VV40Qw8xjddvxJBF-wPlgc2B5W8rRdCjFLALe9JED=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "I am deeply disappointed with the unprofessional behavior of Dr. Kelvin at Northeast Medical Punggol Clinic. My brother visited the clinic on three separate occasions due to an ongoing illness. Unfortunately, two out of these three visits involved Dr. Kelvin, who exhibited an appalling lack of empathy and professionalism. His rude attitude left my brother shocked and distressed.\n\nWhile the care provided by an Indian doctor on one occasion was professional and reassuring, the stark contrast in treatment was unacceptable. Dr. Kelvin’s dismissive and unkind demeanor made my brother feel unheard and disrespected. It is unacceptable for a healthcare professional to treat patients this way, especially when they are already vulnerable and seeking help.\n\nThe clinic needs to address this behavior immediately. It is crucial that all staff maintain a standard of respect and professionalism, regardless of the circumstances. I hope the clinic takes serious action to prevent future patients from enduring the same poor experience.",
      "time": 1738657791,
      "translated": false
    },
    {
      "author_name": "nabilla khoo",
      "author_url": "https://www.google.com/maps/contrib/109645728480475730304/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWRnHM5Tytl26USkgqk6EwnM4oJKDTCzxIVIAdElJxK00ugdcQz=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I had an excellent experience at NEMG pgl! Dr. Kelvin Goh is an exceptional doctor who genuinely cares about his patients. From the moment I walked in, the staff was warm, welcoming, and professional. Dr. Goh took the time to listen to my concerns, explain my condition clearly, and provide tailored advice that made me feel confident about my treatment plan.\n\nHis attention to detail and expertise were truly reassuring, and I appreciate how patient he was in addressing all my questions. The clinic itself is clean, well-organized, and runs efficiently, making the entire experience stress-free.",
      "time": 1738811080,
      "translated": false
    },
    {
      "author_name": "Gemini",
      "author_url": "https://www.google.com/maps/contrib/108052035938368103219/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWhYCiQpHOz8N8KgVWZabKZNb-DY3zSSOw3PKJdb0sKVjsqZNl2=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Had my flu jab today by Dr Hayati. She is very skilful and hence, I didn’t suffer any pain. Kudos to her! Clinic assistant is very helpful too!",
      "time": 1741764111,
      "translated": false
    },
    {
      "author_name": "Dawn Seah",
      "author_url": "https://www.google.com/maps/contrib/111275343388801041915/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXxNddu32umBES3FSGsYtZPrBVh9UiZrEmMtHs9_-WRQbb_gxIJBg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I had a pleasant doctor visit with Doctor Kelvin and his staff are friendly and welcoming. Good to have a clinic with such professional and happy staff just right under my block!",
      "time": 1738892774,
      "translated": false
    },
    {
      "author_name": "Shane Lim",
      "author_url": "https://www.google.com/maps/contrib/117107996320796459819/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJmxygAUJI1s_zcK9bbBuq3xRsVtGhtqLvByiC5TPyFriRwng=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "7 months ago",
      "text": "I have been with Northeast for 24 years ever since they started at 531 Bedok North.\n\nRecently, I moved to Punggol East and I was very happy that there is a Northeast Clinic here. I waited patiently for around 8 months before I see my company panel insurance is ready.\n\nAt around 11:30am, there were no patients around, I waited for the doctor to turn up and I was told that he was having a meeting, the clinic assistant kept calling the doctor and I waited 20-30 mins before he came back and realized he was just chitchatting outside the clinic. By the time there were already 3 patients fully registered and waiting.\n\nDuring the consultation, doctor did not start the question by asking where I was unwell, basically I had to start the conversation and lead the entire conversation on my regular medication, the conversation was very one-way, he also did not do any follow up questions. I started to ask him have you taken a look at the symptoms I mentioned to the assistant? Because my purpose is not just replenishing my medication, but I have other symptoms which the clinic assistant had keyed into the system, but no questions were asked, he seemed very uninterested and apethatic.\n\nI received a call 45mins after I left the clinic. I was told that I needed to pay for 2 of my medication when I was covered by my company insurance because I “requested” for it. But I did tell Dr Kelvin Goh that I was having headache and I had a bit of diarrhea after eating the Indian rojak, I even pointed to the coffee shop. How was this “requested” and not consulted and I was told to pay for it because what they cannot take back what was dispensed.\n\nFirstly, why wasn’t I informed at the point of consultation?\n\nSecondly, why was I not informed again at the point of dispensary?\n\nThirdly, I volunteered to return the medication as I am still nearby, however clinic insisted that I pay because they can’t take back what was dispensed. They have 2 chances to inform me that they wanted to charge me but they did not. What is the point having company’s panel insurance when I have to pay for something that I had consulted and should be covered?\n\nI love Northeast Medical Group but this is really not acceptable. Please do something about it.\n\nI truly hope Northeast Medical Group at Punggol East can be improved as the one at Bedok North was amazing and I love Northeast Group so far with Dr Amy and Dr Tan Teck Jack at Bedok North. I thought it was convenient for me that I have a Northeast clinic near where I am staying now, but the difference is way too big, I hope that as a medical group this can be aligned using Dr Amy and Dr Tan Teck Jack as a benchmark or at least somewhere near.\n\nThank you.",
      "time": 1729040496,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7261156307866475620",
  "user_ratings_total": 13,
  "vicinity": "653A Punggol Drive, #01-05"
}