{
  "formatted_address": "30 Simei St 3, #02-01 Simei, Singapore 529888",
  "geometry": {
    "location": {
      "lat": 1.3431473,
      "lng": 103.9534205
    },
    "viewport": {
      "northeast": {
        "lat": 1.344209530291502,
        "lng": 103.9550015302915
      },
      "southwest": {
        "lat": 1.341511569708498,
        "lng": 103.9523035697085
      }
    }
  },
  "name": "Northeast Medical Group (Simei Clinic)",
  "place_id": "ChIJv-YWayI92jERuXnhy641dH0",
  "rating": 2.3,
  "reviews": [
    {
      "author_name": "hong eric",
      "author_url": "https://www.google.com/maps/contrib/109505858531393010890/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXwaDVtvhJKToIqNLkGLGOyFFlA8z12w-MHKDUsrrKuMLTdf0Sq=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 weeks ago",
      "text": "Absolutely unacceptable experience at Northwest Medical Group Simei Clinic. I brought my daughter in as she was sick. We registered at the counter and waited along with a few other patients—three or four before us, and at least two after. Not a single person was called in for consultation. After wasting 45 minutes, the clinic assistant suddenly announced that the doctor was unwell and not coming in, and told everyone to leave.\n\nThis is completely irresponsible and disrespectful. If the doctor was unavailable, why were patients even allowed to register? Why was no one informed earlier? This shows a total lack of basic professionalism, communication, and concern for your patients’ time and well-being. Operating hours are listed as 2pm to 10pm, yet there was clearly no intention to provide care that day.\n\nWasting patients' time like this—especially when dealing with sick patient—is disgraceful. Patients are not just numbers; they are paying clients who deserve transparency and respect. Shameful conduct.",
      "time": 1746357061,
      "translated": false
    },
    {
      "author_name": "Kai Ying Chia",
      "author_url": "https://www.google.com/maps/contrib/101589725728043712978/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVKGtWap_MqRIHLDBlvBt497EqPr9cVnfNpR9alL0k0BDJyu0T9=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "I’m very disappointed with the service at Simei clinic after many attempts of trying to understand why I have not gotten my refund for wrongful charges after waiting for more than a month. I revisited the clinic on after realising they overcharged me due to changes in co-payment. Waited for more than a month, but did not receive the refund as promised. Called in 3 times and the staff all gave empty promises (first even brushed off my query without asking to understand, thinking that I only visited the clinic recently) to contact me after checking with their Finance but there was no attempt to follow up at all. Till date, I have not received my refund and no follow up.\n\nAdvice to future patients: Better check carefully if they overcharge you especially when there’s corporate insurance and copayment, if not you’ll end up waiting, chasing and hearing false claims that they have made payment to you but not own up their mistake.",
      "time": 1740066358,
      "translated": false
    },
    {
      "author_name": "Buddhini Perera (Sue)",
      "author_url": "https://www.google.com/maps/contrib/114813296572492202222/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUwiigd2oBeXVp45FHhMoC_LNIpM-93UmrN_5Ixnix0moZPZtjA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I am amazed with the negative reviews. I kind of like the place. I visited the place on 30 December 2024. I didn't have a booking, but since there were less people they treated me well. There was this nice male nurse in the reception who greeted me and took my details. He said they always check the fever and pressure before I visit the doctor (it is something they do for all). The doctor was straight to the point and gave medicine. I went to the clinic by 12:20pm. Around 1:05 pm. I am done.\n\nThe only negative observation is everyone is so busy. More like multi-tasking. So you might not often get the best welcome there. But I went to a clinic not a hotel. So it's 5/5 star service for me.",
      "time": 1735544182,
      "translated": false
    },
    {
      "author_name": "Sumytha Suresh",
      "author_url": "https://www.google.com/maps/contrib/103163628055680592805/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWVMl7KI4D9SvHZ863Ztjwh37UwwFC86XJAtg0xN34sc8jX2vKqVw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "Went to simei branch on 7th May @5pm.\nWas disappointed with the Indian lady at the reception. A note to the management, Please train you receptionist to address your patients by name, if unsure of the pronunciation a respectful 'Sir' or 'Madam' is basic courtesy and the least can be expected.",
      "time": 1746610714,
      "translated": false
    },
    {
      "author_name": "Grace",
      "author_url": "https://www.google.com/maps/contrib/105720726980608588227/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX8E2XICposAuJMBzAaoVE8oGqQN4W5l5lBrmdbapjhC24PvU8l=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "This place has zero regard for appointment times. It's strictly first come first serve.\n\nIf your appointment was at 2pm and you didn't shove your way past the other sick and elderly clients after lunch then good luck to you getting a later queue number and waiting your turn anyway. There were at least 15 persons in the line on a weekday immediately after lunch. If each person takes 10 minutes and the doctor started consultations at 2.15pm...you do the math.",
      "time": 1734962370,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9039909376900561337",
  "user_ratings_total": 164,
  "vicinity": "30 Simei Street 3, #02-01 Simei"
}