{
  "formatted_address": "81 Marine Parade Central, #01-642, Singapore 440081",
  "geometry": {
    "location": {
      "lat": 1.3025927,
      "lng": 103.9071036
    },
    "viewport": {
      "northeast": {
        "lat": 1.304056580291502,
        "lng": 103.9085172302915
      },
      "southwest": {
        "lat": 1.301358619708498,
        "lng": 103.9058192697085
      }
    }
  },
  "name": "Nova Eye Centre",
  "place_id": "ChIJu56bmoUZ2jERXP6OniZKeTo",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Alan Zhang",
      "author_url": "https://www.google.com/maps/contrib/117547321100113430830/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocILqs4Hl8GnWnJMUmCY9NZzT37yyQaROv_UvIF1mfAB1zH-FA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I recently underwent the SMILE procedure at Nova Eye Centre, and I couldn’t be more pleased with the experience. After 10 years of careful consideration and hearing glowing recommendations from friends, I finally decided to take the plunge. From the moment I walked into the clinic, I felt confident in my decision.\n\nDr. Eugene Tay’s skill and expertise are second to none. His precise technique made the entire procedure smooth and surprisingly stress-free. He has a great ability to calm any nerves, and his thorough explanation beforehand made everything feel less intimidating.\n\nI also want to commend Karen, the clinic manager, who was incredibly helpful throughout the process. She took the time to explain every step of the procedure, ensuring I understood what to expect and how to take care of my eyes for optimal recovery.\n\nWhat truly stood out to me was the attention to detail during the preparation phase. Three nurses conducted independent checks on my eye prescription, making sure everything was perfectly adjusted before the procedure. The level of precision and care involved left me truly amazed.\n\nThe overall professionalism and dedication at Nova Eye Centre made this a positive experience from start to finish, and I’m already seeing the incredible results. Highly recommend this clinic to anyone considering SMILE!",
      "time": 1735974449,
      "translated": false
    },
    {
      "author_name": "Shantel Neo",
      "author_url": "https://www.google.com/maps/contrib/115468407203641853800/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXSj1_NURfMdfW8OmkCbU4E4Og5QIxg-FxpS8o5azpiHd-9xgTt=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "After finishing my final check up here I can safely say it's been such a great experience going through my SMILE Lasik here, I've been putting it off for years but being a dancer it's just been life changing, and knowing I was always in good hands helped! No complications at all, Dr Eugene and the team at Nova Eye Centre takes care of you every step of the way from first consultation, to surgery to last check up. Everything is explained with great care before you go through the process and the surgery itself was painless, professional and over in minutes. Nice that the Marine Parade MRT just opened too so getting to the clinic is even quicker than before. It's crazy to now have 6/6 vision again and I can't recommend this wonderful team enough if you're thinking about getting SMILE. Thank you guys so much!!",
      "time": 1719908558,
      "translated": false
    },
    {
      "author_name": "Shin Poh",
      "author_url": "https://www.google.com/maps/contrib/103432087781306471505/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWp3E6PS5iG6WFd30V_SKYOhXWq1QLSOw7JlROD4RlAmxAphbmX=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I had a great experience at Nova Eye Center for my treatment. From start to finish, both the staff and the doctor were incredibly professional, knowledgeable, and friendly.\n\nThe entire process was smooth, and I felt completely at ease thanks to the team’s expertise and attentiveness.",
      "time": 1740626260,
      "translated": false
    },
    {
      "author_name": "Robyn",
      "author_url": "https://www.google.com/maps/contrib/113141931753413603011/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKKitNXQS4W7aSIXBdhM9ml_BxLO4wqwkL6aTJS2qet0fwVfK4=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Did the SMILE treatment with nova eye centre, and felt very comfortable with them. The staff were all friendly, location of the clinic is near the mrt, procedure was fast and done very professionally. Thank you Dr Tay and team! I will treasure my new pair of eyes, definitely don’t regret doing this.",
      "time": 1739454996,
      "translated": false
    },
    {
      "author_name": "Erica Chen",
      "author_url": "https://www.google.com/maps/contrib/115595405193321810270/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWb8TzFg2RlWW7V3PyUIsiwYNzOKRwdcjzGTPfGzLakhPU-BpQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I did SMILE on Nov 2024 and just had my last follow up check up, from the first consult I knew that I’d go with Dr. Tay, him and his team are very professional, friendly and kind and welling to answer all my questions.\n\nOn the surgery day I was a bit  nervous, Dr. Tay and his team were very patient to calm me and went through with me the steps, in the end it only took about two mins without any pain also no pain during recovery.\n\nI understand different person may face different recovery experience, my vision turned stable around two months after (from 80% to 100%) without any side effect, during the recovery time if I have any question, they respond very fast in WhatsApp and advise my accordingly.\n\nI’m super enjoy my life without glasses and I am highly recommended people to see Dr. Tay.\n\nOnce again, thank you very much Dr. Tay and the clinic team.",
      "time": 1739156374,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4213480456111193692",
  "user_ratings_total": 117,
  "vicinity": "81 Marine Parade Central, #01-642"
}