{
  "formatted_address": "60 Nanyang Dr, Nanyang Technological University, School of Biological Sciences, Singapore 637551",
  "geometry": {
    "location": {
      "lat": 1.3441702,
      "lng": 103.679256
    },
    "viewport": {
      "northeast": {
        "lat": 1.345451630291502,
        "lng": 103.6806323302915
      },
      "southwest": {
        "lat": 1.342753669708498,
        "lng": 103.6779343697085
      }
    }
  },
  "name": "NTU Chinese Medicine Clinic",
  "place_id": "ChIJf0Z573QP2jERDjMyKPv0Zoo",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Liv Go",
      "author_url": "https://www.google.com/maps/contrib/100921999896701693249/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLzvCUtj0tIYLsyaIzMdc_d0C0jua436WpPP7MjIpnQUplsUg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "I have a great concern over the non response of the main investigator Dr Zhong Lidan. As I have queries over the recent study put up by NTU-TCM department, I raised queries with the researcher, Mr Peter Lim who was not able to address my concerns. A contact number to the TCM clinic was provided for me to reach out to Dr Zhong but I was told by the clinic that is not a number to reach the main investigator. After I feedback to Mr Peter Lim, he did not offer me a direct email to Dr Zhong. I found Dr Zhong’s email and wrote her an urgent mail for her to respond. She did not attend to my email since Wednesday, 23/4/25. Due to the non response I emailed QSM of NTU yet my email was also unattended. There was also no follow-up effort from Mr Peter Lim although the issue was as important as the handling of patient’s urine specimen. There was no offer of help from Mr Lim to help reach out to Dr Zhong. I hope the overall in charge of NTU could help reach out to me or get either of them to respond to my concerns.",
      "time": 1745547677,
      "translated": false
    },
    {
      "author_name": "Ger YY C",
      "author_url": "https://www.google.com/maps/contrib/111826653592968734974/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJjBFHaJVpt88dxf1vzJ6Yf3UYm1icR9BSB-l4N9MsbBLv9XA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Dr Steven Loh is one of the kindest and most patient Dr I have ever seen. He takes much care to understand your medical condition. This is unlike many Dr who usually just treats patients like a number to clock in.\nI have seen improvement in my heart palpitations condition (hopefully will get it treated soon) and has also recommended my sister to see him for her sinus condition.",
      "time": 1741152950,
      "translated": false
    },
    {
      "author_name": "Q",
      "author_url": "https://www.google.com/maps/contrib/113357136751055038977/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJsZY7HXncs4qsQ9ogVxea_HmTEQVB1VTlzCJ4eDoa9M2TBYND3=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "This is for people who don't speak Chinese and never visit a TCM before, especially for a matter that is intimate and personal, like fertility, I suggest you to not go here, don't see Tan Siew Buoy. I gave my consent that an intern may be present.  I didn't know there were 3 interns not just one waiting in the room. The doctor and the interns all communicated in Chinese, made you feel excluded, no welcome greeting, maybe it's the TCM way. But the feeling of exposure and judgments were really strong. I suggest you don't come alone, if it is your first visit and you don't speak Chinese. It wasn't pleasant and professional handling from the doctor, I felt very exposed and excluded. Prior to that even though I had an appointment scheduled for 10.30, I could only see the doctor at 11.30, it's better to come early, so you can get early Queue number.",
      "time": 1741751893,
      "translated": false
    },
    {
      "author_name": "Bryan Goh",
      "author_url": "https://www.google.com/maps/contrib/114696086045947836849/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKQgppPQ_ESeuydzKxWHZAu1llXB-0GUSWZNrzDlZnnpbAXpA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "This clinic has some of the best physicians I have ever met.\n\nDr Lau Kah Yong was the first person to accurately determine what was causing my insomnia as I had insomnia for 2 months before I met him. After 2 weeks of treatment, I managed to slowly improve and I was able to fall asleep more regularly from then on. I have went to multiple TCM physicians and doctors before I met him, none of their treatments worked.\n\nDr Yong Choon Lian and Dr Lim Yin Jia are also very caring and they also really do their best to help their patients and are willing to go the extra mile for them.\n\nThe front desk is also very friendly. They do their best to make sure you remember your appointments and help to schedule you in.\n\n10/10 would recommend.",
      "time": 1733558418,
      "translated": false
    },
    {
      "author_name": "Ya Mi",
      "author_url": "https://www.google.com/maps/contrib/110036694632622968661/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU9JWNSGBnLLwO8l14wzxgemMTQa_FVrzoST-UQzVxg1xzRLZI=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "See these comments on the front desk I am also deeply touched! The doctors here are fantastic! But the front desk staff, a Chinese named Lin, has a bad attitude! After the patient visited the doctor and waited for payment, she used vicious language to evaluate the famous doctor here, she said: \"The doctor always forgets to give the list, very tired of bothering her to get it every time!\" Ah, ah, ah, said a lot of unhappy look! I think: you do this job responsibility ah! If the front desk staff is only her alone, it is even more exaggerated, she will chat all kinds of, and then treat the needs of patients is all kinds of can not, anyway is can not!",
      "time": 1732840237,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9972927784406889230",
  "user_ratings_total": 98,
  "vicinity": "60 Nanyang Drive, Nanyang Technological University, School of Biological Sciences"
}