{
  "formatted_address": "123 Penang Rd, #05-12 Regency House, Singapore 238465",
  "geometry": {
    "location": {
      "lat": 1.2995112,
      "lng": 103.8420945
    },
    "viewport": {
      "northeast": {
        "lat": 1.300979580291502,
        "lng": 103.8433102802915
      },
      "southwest": {
        "lat": 1.298281619708498,
        "lng": 103.8406123197085
      }
    }
  },
  "name": "Nu.Reflections Medical Aesthetics",
  "place_id": "ChIJy0HEmZcZ2jERmwYv3mdSEz0",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Spicee Neo",
      "author_url": "https://www.google.com/maps/contrib/115701655002086311089/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKVC0M_5HxOTofITTRZD9d2guVGZPALelWkWSeUPzMel0jEEQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I had an incredible experience at Nu. Reflections with Dr. Ivan Tan. Dr Tan is truly a master with needles—extremely skilled, gentle, and precise. I was impressed by how comfortable I felt throughout the entire process, and the results exceeded my expectations.\n\nDr. Tan is well-known in the industry for their expertise, and after my visit, I can see why. The clinic is beautiful, the staff is friendly, and the entire experience was top-notch. I highly recommend Dr. Tan to anyone looking for aesthetic treatments—whether it’s your first time or you’re a seasoned client.",
      "time": 1739857294,
      "translated": false
    },
    {
      "author_name": "Evelyn Tan",
      "author_url": "https://www.google.com/maps/contrib/108111894501989456716/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLpZPXRVylyElMU7W00hXf29EE_OvF_vIL_ZVppbKhMYrYseg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "✨ Exceptional Aesthetic Doctor – Skillful, Natural Results, No Hard Selling & Zero Downtime! ✨\n\nI have been visiting Dr. Ivan Tan for almost 5 years, and every experience has been nothing short of amazing. His professionalism, expertise, and meticulous attention to detail continue to impress me, and I wouldn’t trust anyone else with my aesthetic treatments.\n\nWhat truly sets Dr. Ivan Tan apart is his unparalleled skill in achieving the most natural results. He has an incredible eye for aesthetics, enhancing features in the most subtle and elegant way—never overdone. Every treatment is carefully customized to complement my facial structure, ensuring I always look refreshed, youthful, and naturally beautiful.\n\nAnother reason I keep coming back is the zero downtime. Every procedure is smooth, painless, and incredibly precise, with no swelling or bruising. I can walk out of the clinic looking amazing immediately—a true testament to Dr. Ivan Tan’s advanced techniques and expertise.\n\nMost importantly, I truly appreciate that Dr. Ivan Tan only recommends what I actually need—there is absolutely no hard selling or unnecessary upselling. He takes the time to listen, assess, and provide honest, tailored advice, ensuring that every treatment aligns with my goals.\n\n⭐ After almost 5 years, I can confidently say that Dr. Ivan Tan is the best in the industry! Highly recommended for anyone looking for natural, flawless results with an ethical, skilled, and trustworthy doctor. ⭐",
      "time": 1739449837,
      "translated": false
    },
    {
      "author_name": "Avy T",
      "author_url": "https://www.google.com/maps/contrib/102299373230048247866/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXaxG9KiYVPf_reeNF9uv8Dkdje5FysUnu-wN-DOZWIFTT2L2j9=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I have been coming to Nu Reflection for a while now. Started seeing Dr Ivan Tan when I was in my early 20s because of my acne problem. He’s very professional and only recommend treatment or products that’s needed. My acne problem is under control now so I just come in for a facial once a month with April. She’s friendly, easy to talk to and doesn’t hard sell packages . Overall the place is clean and the staffs are friendly.",
      "time": 1733824053,
      "translated": false
    },
    {
      "author_name": "Jaime Goh",
      "author_url": "https://www.google.com/maps/contrib/103597929997908294662/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIdoL_d48_zxub-w0xNidc2qSWoyX8XB_H_l3DFEdGFhakUiw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I've been a client of Dr Ivan's for a long time, simply because he is such a responsible and reliable doctor. He isn't pushy and doesn't try to upsell services or products that are not required and I trust his skills. His staff are always friendly and attentive, and give excellent service.",
      "time": 1736153705,
      "translated": false
    },
    {
      "author_name": "Xiao Qian",
      "author_url": "https://www.google.com/maps/contrib/105851332215041679326/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL7IyDXW2HJTaRSXywKQRZZYLjfBoLRJEPXyW238WPyj5UK-pc=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I did eye fillers with Dr Ivan and couldn’t be happier with my decision. As someone new to fillers, Botox, and other invasive treatments, I really appreciated how much I learned from him. He will also recommend things I need to do and advise against what’s redundant to make sure I look as natural as possible. Dr. Ivan is incredibly experienced and uses the cannula method and minimal bruising (his hands are v steady and he’s also gentle). I think this is very important for people who have low pain tolerance or simply new to aesthetic treatments. I feel confident going out bare faced now, as my sunken eyes are no longer an issue.\n\nI also did long-pulsed laser treatment for the blood vessels on my face, and the results were immediate. Highly recommend him for his expertise, professionalism, and integrity!",
      "time": 1735284039,
      "translated": false
    }
  ],
  "types": [
    "beauty_salon",
    "spa",
    "hospital",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4400951866933839515",
  "user_ratings_total": 23,
  "vicinity": "123 Penang Road, #05-12 Regency House"
}