{
  "formatted_address": "5 Lower Kent Ridge Rd, #1 Main Building, Singapore 119074",
  "geometry": {
    "location": {
      "lat": 1.2948294,
      "lng": 103.7836217
    },
    "viewport": {
      "northeast": {
        "lat": 1.296413180291502,
        "lng": 103.7844605302915
      },
      "southwest": {
        "lat": 1.293715219708498,
        "lng": 103.7817625697085
      }
    }
  },
  "name": "NUH Children's Emergency",
  "place_id": "ChIJD9l57L0b2jERbXMXdZdyXJA",
  "rating": 2.3,
  "reviews": [
    {
      "author_name": "Adeline Yeo",
      "author_url": "https://www.google.com/maps/contrib/115673686977234102184/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXUyLqYPsqh0Y05kaJfjmAPWh4tf6Q8G_cGveeTUJVd5bAC7yNa=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Brought my 5 yr old in middle of night for high fever above 40 deg. He had tested positive for influenza A so upon a fast registration we were immediately shown into a children's isolation ward where he was able to sleep comfortably while waiting. Dr Reon Chin attended to us twice - upon arrival and before discharge. He patiently explained the fever symptoms and put us at ease    that it was not something to be unduly worried about. While bringing down the fever was good, it was not the main goal of treatment which is to let the flu run its course without damaging the body. Hence he was more concerned about hydration, shortness of breath and lack of response to stimuli - which wd be signs of the system failing due to the flu. He tested for these and also prescribed medications which we took and cleared at the hospital before discharge. While we spent a considerable amount of time waiting, the child was able to rest and we were relieved that he was under observation as the fever remained high the whole time. The doctor and nurses who attended us were so kind and professional - despite the late hour they were able to give us their best face in excellent and thoughtful medical care.",
      "time": 1739548807,
      "translated": false
    },
    {
      "author_name": "Tianxing Chan",
      "author_url": "https://www.google.com/maps/contrib/109188509515847004911/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKkA-N-pG3hUGGOp82_4tcu4pOatL3gvPklIzxRfPe5lXlKpQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Doctors are good and attentive. It's so obvious that they are under staff or assistant staff which cause  their waiting time too be so. terrible . We waited close to 90 mins for an x-ray report, and waited another 45 mins to find a doc to cast out the boy's foot. The whole process took us 5 hours from registration to discharge. The whole place is quite cramped. Sad to say nothing was improved after 6 years.",
      "time": 1715712777,
      "translated": false
    },
    {
      "author_name": "Ken Peh",
      "author_url": "https://www.google.com/maps/contrib/113975004215945002265/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXSJxn-MN1vy970v-MMcT8F_p28Ghtkh0hnblugxH0puU79a2To=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "8 months ago",
      "text": "Total time taken to have my kid treated within 3 hours. Definitely not a good time range to wait, especially the anxiety while waiting for your turn and watching your kid, concerning their condition. But most importantly, the treatment goes well and all ends well too, that's the most critical factor. Thank you to the doctors, nurses and staff. It's definitely not easy in a restructured hospital especially if there are tempers flaring up from irate patients' family members. But we need to manage our expectations too as we are not the only patient being served.",
      "time": 1726831699,
      "translated": false
    },
    {
      "author_name": "LockeQuote",
      "author_url": "https://www.google.com/maps/contrib/101311756543159432136/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLb8DMkBORfZYdhn66B0i1XcH6LMCKIUjrB6YLHSUEBZBWu=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "11 months ago",
      "text": "My daughter had fever last year, for 5 days her fever was 39.5. They said it could be just the normal virus on top of each other. Just went back twice with the usual ibuprofen and paracetamol. So on the 6th day my daughter still have high fever, I brought her to the GP near my block. Clementi Family & Aesthetic Clinic. Dr. Teo found it she has Influenza and gave her antibiotic. The following day fever is gone.",
      "time": 1717408218,
      "translated": false
    },
    {
      "author_name": "Linda Huo",
      "author_url": "https://www.google.com/maps/contrib/103159826567497092239/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXu7XVc2VULrU9t6_s99GnVuQ9_JPJ8gVU2L98_t4aCe1vChFaw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Super lousy registration. First time here with 3day baby. No one in the Q, registration staff is free but keep me stay for 20 min to wait. During registration, keep asking irrelavant questions but cannot tell what the information for. And I tried so hard to provide information, after all he saif no need… A registration can take more than 40min in an emergency with 0 patient in front of me, I was super shocked by their fantastic work and staff training. After that, when we were transferred to specilists, follow up registration always have problem, system cannot find baby’s information, they need half an hour to make it. The 2nd follow-up, appointment was missing. Another half an hour for registration and cannot get through. NUH, you can never registrate in a patient properly, why not put up a closed board at the beginning!!!!",
      "time": 1705299693,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10402315234149102445",
  "user_ratings_total": 51,
  "vicinity": "5 Lower Kent Ridge Road, #1 Main Building"
}