{
  "formatted_address": "123 W Coast Cres, Located within Seahill, Singapore 126779",
  "geometry": {
    "location": {
      "lat": 1.2990979,
      "lng": 103.7648561
    },
    "viewport": {
      "northeast": {
        "lat": 1.300463580291502,
        "lng": 103.7661969802915
      },
      "southwest": {
        "lat": 1.297765619708498,
        "lng": 103.7634990197085
      }
    }
  },
  "name": "Oasia Residence, Singapore",
  "place_id": "ChIJVdv5mfoa2jERF3GXNJ7AJVo",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "John",
      "author_url": "https://www.google.com/maps/contrib/115351110346415919310/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK6nL7nmxmud3ZcklZAWX1VZFzbCTamhi3V6SVOcuLFDUHR0w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Came to Singapore from Australia with a few friends for a wedding and stayed at Oasia Residence — honestly, it was such a great spot. The views were awesome, super chill vibe, and the pool was a great bonus. Having a 24-hour 7-Eleven and a hawker market just across the road was super handy too.\n\nThe front desk team were genuinely lovely and always happy to help, which made the whole stay even better. Only thing is the train station’s a bit of a walk, but with everything else this place offers, it’s not a big deal. Would definitely stay here again and totally recommend it to anyone visiting.",
      "time": 1744300412,
      "translated": false
    },
    {
      "author_name": "Valdeus Seah",
      "author_url": "https://www.google.com/maps/contrib/109977826379112634640/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIBG2h2H8_K_SDsl0JAAWeB5RGpCdrbH45LHV8NEvD6EjhKqw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "3rd time here so I knew I had to leave a review of this amazing service apartment. Had a late check in at about 2 am on 23 December and the service was superb. There was only one person assisting us but he made check in smooth and efficient. He even went the extra mile to take the trolley to put our baggage. Considering it was late,I was impressed with their service yet again! Would recommend here if you are doing some renovations.",
      "time": 1735112821,
      "translated": false
    },
    {
      "author_name": "Audrey Yu",
      "author_url": "https://www.google.com/maps/contrib/102961863287964940037/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJGPm4nTqC6wevSxC9DVwnYJS7SvJ6_JQU11oolTqG8lOfiXw=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "(Edited review) The place is very calm and tranquil; it is located near West Coast Park, which has views of the sea. Location-wise, it is served by bus 175 (5 stops to Clementi MRT). There is also a wholesome and tasty complimentary breakfast for guests every morning. When I checked in, the room has no hot water due to a faulty thermostat. I discovered this late in the evening; by that time nothing could be done, since their engineer only works until 6 pm. Thankfully, the management responded promptly the next day, first by sending someone to fix the issue, failing which I was offered a different room. I was assured that they would take steps to prevent the issue happening to another guest in the future. I hope future guests can enjoy the amenities and tranquility that Oasia has to offer, without having to go through any mishaps that may mar their stay here.",
      "time": 1737540145,
      "translated": false
    },
    {
      "author_name": "adel alshehri",
      "author_url": "https://www.google.com/maps/contrib/113861506707017782074/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWNd-T86SNSBecvs4Qsjcna4TIpMcWbu3MCXiWWyGVXaPMaH7t5=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 2,
      "relative_time_description": "4 months ago",
      "text": "The room is good, but the breakfast is nothing it is bread, jam and coffee",
      "time": 1737330743,
      "translated": false
    },
    {
      "author_name": "Francis How",
      "author_url": "https://www.google.com/maps/contrib/114772619001040044138/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUhLEOW-ei6k3ML7XwbVkH-tyBlbRCCfwOMLlAxYxRzCHOh6MQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My family really enjoyed staying here over the past few weeks while our house was undergoing a makeover. All the staff are genuinely friendly and sincere in making us feel welcome and at home. The two bedroom apartment is beautifully furnished and well maintained. The daily breakfast spread (weekdays only) is fairly good and the morning greetings by the breakfast staff certainly has helped to brighten up the day! Even though I have checked out well before my birthday, the staff still cared enough to greet me with advanced birthday wishes plus a nice bottle of wine and a souvenir some chocolates! Just want to give a shout-out to the front desk people (Mr Rueben, Ms Sobbana, Ms Komathi n Ms Renugha) as well as the service crew (Mr Harry, Ms May n Ms Bing Bing). Thanks a lot for going out of your way to make our stay there a really pleasant one!",
      "time": 1693708999,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6495809823271514391",
  "user_ratings_total": 253,
  "vicinity": "123 West Coast Crescent, Located within Seahill"
}