{
  "formatted_address": "681 Punggol Dr., Singapore 820681",
  "geometry": {
    "location": {
      "lat": 1.4026301,
      "lng": 103.9129247
    },
    "viewport": {
      "northeast": {
        "lat": 1.403968430291502,
        "lng": 103.9140940302915
      },
      "southwest": {
        "lat": 1.401270469708498,
        "lng": 103.9113960697085
      }
    }
  },
  "name": "Oasis Terraces",
  "place_id": "ChIJo7TzxRkV2jERIHtqiVMqOo4",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Shin Hwee Teo",
      "author_url": "https://www.google.com/maps/contrib/113234873140325754157/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUiW2Cz5zloLKUKIJNtsd2LS5lVTqKgoilCYEoYbA5buF3JP9X1=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Oasis Terraces, Punggol – A Hidden Gem with Great Food & Retail Variety\n\nI had a great time exploring Oasis Terraces in Punggol—this place really surprised me with how much it offers! Nestled along the scenic Punggol Waterway, it's a lifestyle hub that blends nature with everyday convenience.\n\nWhat I liked most was the wide variety of shops and F&B options. Whether you’re craving hearty local meals, Japanese ramen, or artisan bread and desserts, there's something for everyone. I dropped by Anna’s, a warm and rustic café that served freshly baked sourdough and rich chocolate loaves—perfect for brunch or a light snack.\n\nThe mall is also home to familiar names like Crystal Jade GO, Ramen King, and other casual eateries offering value meals and promos. There’s even a Hello Lemón drink stall with refreshing fruit tea deals, great for hot afternoons.\n\nBeyond food, Oasis Terraces has lifestyle and specialty shops like Tay Junction for bicycles and Aqua Petz for aquarium lovers. The layout is open and breezy, and the nearby park connector and waterway view adds to the charm—ideal for families, joggers, and cyclists.\n\nOverall, it’s a perfect spot for a chill afternoon or a weekend outing. I’ll definitely be back to try more food and enjoy the relaxed vibe.",
      "time": 1746249754,
      "translated": false
    },
    {
      "author_name": "Winston Teo",
      "author_url": "https://www.google.com/maps/contrib/103983640077681957103/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV5NzDT0ls7P0VYmKSCa_bJR9a9u_qvM1jhtYf94_gsl0KgUE6I=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Lunch at Ramen King, Oasis Terraces\n\nI recently visited Ramen King at Oasis Terraces in Punggol for lunch, and it was a delightful experience.  The restaurant is conveniently located at #01-12, just steps away from the Oasis LRT station, making it easily accessible.\n\nThe ambience of Ramen King is cozy and welcoming, with a clean and comfortable dining area.  The staff were attentive and friendly, ensuring a pleasant dining experience.\n\nI ordered the Tonkotsu Ramen Set, which included a rich and flavorful pork bone broth, tender noodles, and perfectly cooked chashu slices.  The set also came with a side of Cheese Gyoza, which were crispy on the outside and gooey on the inside—a delightful combination.  To complement the meal, I had the Matcha Hokkaido Milk Tea, which was creamy and refreshing.\n\nThe menu offers a variety of options, including Spicy Miso Ramen, Donburi rice bowls, and other side dishes like Karaage and Takoyaki.  Prices are reasonable, with ramen sets ranging from $16.55 to $25.65, depending on your choice of toppings and sides.\n\nAfter lunch, I took a leisurely stroll around Oasis Terraces, enjoying the mall's serene atmosphere.  The integrated development offers a mix of retail shops, dining options, and a polyclinic, making it a convenient spot for both shopping and relaxation.",
      "time": 1746343721,
      "translated": false
    },
    {
      "author_name": "E",
      "author_url": "https://www.google.com/maps/contrib/103665268796109855493/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVTN62YoOfAvXBFeUmiEh7Gnro8WgHwBGXEee_nbDIT-9PEekQwYw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "2 weeks ago",
      "text": "Went there for the first time. It's not a big mall but it's a decent size.This charming shopping mall offers a delightful mix of retail therapy and dining experiences.  The curated selection of shops provides a unique and enjoyable browsing experience.  Several inviting eateries and restaurants offer a welcome break from shopping. The intimate atmosphere creates a relaxed and pleasant environment.  It's a perfect destination for a leisurely afternoon of shopping and dining.",
      "time": 1746231692,
      "translated": false
    },
    {
      "author_name": "Diyana Taha",
      "author_url": "https://www.google.com/maps/contrib/103414949337249673133/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWd3ua3KAUNAuWCUqNA3vyqGqDz7ZOkiQCSp1-DH_P_hOIF_BuD=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "This small tiny mall is so underrated.\n\nIt has quite alot of Halal options: McDonald's, anna's Dough, Maki-san, KFC, and a Kopitiam at Level 4 i think , with 4 Halal stalls to choose from.\n\nat the same level as the Kopitiam, there's a children's playground outside. If you walk up, there will be more playground.\nHowever, the cleanliness of the ex-water playground is not well-maintained.\n\nThe view of the river is spectacular, especially in the evening.\n\nOasis LRT station is right next to the mall. How convenient.",
      "time": 1709565998,
      "translated": false
    },
    {
      "author_name": "Tan. W",
      "author_url": "https://www.google.com/maps/contrib/103022836553318535151/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUhCwh2k7FYDn9eZq6tZxajCLTC8K0uS2b1ST7By7DmhyhlcL-B=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 2,
      "relative_time_description": "2 months ago",
      "text": "This door next to Baskin Robins has been out of service for at least a quarter, if not longer, but it has finally reopened, allowing short access into the mall from the other end. It’s unclear why it took the mall so long, but it’s open at last.",
      "time": 1740874767,
      "translated": false
    }
  ],
  "types": [
    "shopping_mall",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10248550440311094048",
  "user_ratings_total": 2870,
  "vicinity": "681 Punggol Drive"
}