{
  "formatted_address": "B1M, Equarius Hotel, 8 Sentosa Gateway, Resorts World Sentosa, Singapore 098269",
  "geometry": {
    "location": {
      "lat": 1.2564647,
      "lng": 103.8209869
    },
    "viewport": {
      "northeast": {
        "lat": 1.257607330291502,
        "lng": 103.8227102302915
      },
      "southwest": {
        "lat": 1.254909369708498,
        "lng": 103.8200122697085
      }
    }
  },
  "name": "Ocean Restaurant",
  "place_id": "ChIJJyodxP0b2jERvwv6K_-NPY8",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "ZOE8DESIGN",
      "author_url": "https://www.google.com/maps/contrib/105673431292547849610/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUPmiRi6m3LQ1Fxzlhtn56uACS_K6jR_1mOcwuwc0yBJzCn6LUm=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "The aquarium’s marine life was presented at its finest! Coupled with great smiles and exceptional service from all staff, it made for an unforgettable experience. It would have been even better if we could mute the noise from those who couldn’t speak softly—but of course, that’s out of anyone’s hands. Aside from that, everything else was perfect! It’s rare for me to finish every dish during fine dining, but I thoroughly enjoyed and finished everything served here. Love all fishes!\n\nI thought the combination of chocolate lava tart and caviar would be strange, but it turned out to be a delightful surprise! Kudos to the pastry chef—it was impressive!",
      "time": 1735570446,
      "translated": false
    },
    {
      "author_name": "luckystar luckystar",
      "author_url": "https://www.google.com/maps/contrib/107419821841101855190/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJAX4lRlsqDFAikcw1GTX5Xffvo3ApAV2WKQBTQgzXl4XZ2IQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I had the pleasure of dining at Ocean Restaurant at Resort World Sentosa, and it was an unforgettable experience!\nThe ambiance is both elegant and serene, with soft lighting and tasteful decor that complements the marine theme.\nThe menu is a culinary journey, showcasing a blend of fresh seafood and innovative flavors. I opted for the six courses menu, which featured beautifully presented dishes. Each course was a delight, bursting with flavor and artistry. Notable highlights included the seared scallops—cooked to perfection.\nThe service was impeccable; the staff were knowledgeable and attentive, special recognition to Ms. WINNIE LIEW who is always ensuring that every detail of our dining experience was flawless.\n\nOverall, Ocean Restaurant offers not just a meal, but a memorable experience that combines exquisite cuisine with breathtaking views of marine life.",
      "time": 1734879560,
      "translated": false
    },
    {
      "author_name": "Darc Kuang",
      "author_url": "https://www.google.com/maps/contrib/101573096440607310906/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWVrfMDWmI3svOZISbyVPiEZG3KmcZNkHYWE3HaoGXoyYAJLRU=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "I rolled into Ocean Restaurant excited for an eight-course tasting and it was a real rollercoaster.\n\nFood\n\nThe seafood all felt par-boiled rather than wok-seared, so if you’re after that big, smoky Asian punch, you might leave a little underwhelmed.\n\nMost of the sauces were spot-on (I’m still dreaming of that miso-ginger), but the pea purée? One taste and my tongue threw in the towel. 😰\n\nApple crumble dessert: Cute concept, but they cranked the apple flavor so high it drowned out everything else.\n\nAmbience\n\nMid-meal, it felt like an untightened tap dripped straight onto my wife’s dress—definitely not what you pay for in “elegant dining.” (air con)\n\nA squad of drain flies crashed our party, buzzing around and even landing in the bread basket. Even after they tried to shoo them off, our little guests refused to leave.\n\nService\nHuge props to service staff May for saving the night:\n\nTable Rescue – Spotted the leak and moved us to drier ground.\n\nDish Hype – Walked us through each course like a personal hype squad.\n\nPhoto Assist – Snapped our shots so we didn’t end up looking like lost tourists.\n\nWould I go back?\nMaybe—but only if service staff May is on shift, they swap out that pea purée, dial down the apple in the crumble, and banish the flies.",
      "time": 1747173445,
      "translated": false
    },
    {
      "author_name": "Sky Chia",
      "author_url": "https://www.google.com/maps/contrib/118252133846776299305/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKmjALw248NXU3LRcv7K1VIjQQt0sBoqLNmC_0dJRuixsYxBQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "4 months ago",
      "text": "Bought my wife for the anniversary lunch as she is from oversea. Reservation needs to be done at least a few months in advance as according to the serving staff there.\n\nI did it like 3 weeks in advance due to an impromptu request from my wife to celebrate our anniversary. In additional we had also requested for any seat next to the fishes.\n\nThe location is a bit hard to find from the carpark to another carpark. And finally found the place.\n\nWe were set to a location where there was a super big pillar and yet paying the same pricing as the restaurant customers. The experience wasn't that great despite our advanced information being given to the restaurant. If only this carefully address to.\n\nI think if the restaurant can pay ABIT attention and if the view wasn't available can keep us in the loop as leaving is an options to other restaurants and not with regrets.\n\nLastly we had to wait till 1 of the family tables had finished their meal then we requested to have our seats changed before the serving of the deserts.\n\nSincerely hope the restaurant can be upfront to any patron that visiting base on their request availability instead of only on sales on patrons which this is also too important to the revenue of the restaurant.",
      "time": 1734969822,
      "translated": false
    },
    {
      "author_name": "Chris Southgate",
      "author_url": "https://www.google.com/maps/contrib/108760301217966920397/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVDjmJIUuKGLKKnYByfAvrSMHtL-FckcV09gMc72EABGYcd1JzD=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I wish I could give 6 stars for Atmosphere! Every time we dine at the Ocean Restaurant I'm amazed at how magical it is. Nothing compares in the land of skybars. New menu was great too... well it's  been awhile since we visited, so new to us. The staff were friendly and attentive too. Thank you.",
      "time": 1735045168,
      "translated": false
    }
  ],
  "types": [
    "aquarium",
    "tourist_attraction",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10321562048097029055",
  "user_ratings_total": 681,
  "vicinity": "B1M, Equarius Hotel, 8 Sentosa Gateway, Resorts World Sentosa"
}