{
  "formatted_address": "730 Upper Serangoon Rd, #01-01A Yeley Building, Singapore 534613",
  "geometry": {
    "location": {
      "lat": 1.35339,
      "lng": 103.8780113
    },
    "viewport": {
      "northeast": {
        "lat": 1.354798630291502,
        "lng": 103.8793009302915
      },
      "southwest": {
        "lat": 1.352100669708498,
        "lng": 103.8766029697085
      }
    }
  },
  "name": "Oddity",
  "place_id": "ChIJ6aPyH-wX2jERB9t9Dwf2BqE",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "TheSoloDiner",
      "author_url": "https://www.google.com/maps/contrib/113783246177205272344/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXEHYa61vGusHcX48TBk8FEq_nSd4XJg06hY2IMGl6TPs0Y3DJH=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "4 weeks ago",
      "text": "Oddity Breakfast Platter @ Oddity\n\nLocated beside Upper Serangoon Shopping Center, a bus stop brings you right to it’s doorstep but drivers will find yourselves walking a fair bit. The ambience is nice, abit on the quirky side which befits the name.\n\nOrdered the breakfast platter for lunch, and the first thing I noticed was the really nice bacon, rich, savoury and still moist, it’s great. The mushrooms were alright and scrambled eggs were creamy. Pretty good! The tater tots though, were drizzled with fusion-style miso sauce which had me intrigued.\n\nAfter tasting it though, I felt it was just alright, earthy but somehow a little citrusy to me which was an odd flavor to get with tater tots. It wasn’t bad though, just something to get used to. The other fusion dishes might be better.\n\nThe toast looked alright from the top but was actually really thin, if you were hungry for a nice toast you’ll probably find it lacking. Still, it was toasted well, not at all dry. The salsa was decent but I found it rather confusing, I opted to eat it with the bread and sausage.\n\nThe sausage was pretty normal too, done well but nothing too crazy. Overall it costed 24 dollars, which makes it pretty fancy, but considering it’s a stop or two away from both Joji’s Diner and Kovan which has many more options for the same price or less, you’ll really want to crave the fusion dishes this place is offering if you’re looking to come here.\n\n7/10",
      "time": 1745226118,
      "translated": false
    },
    {
      "author_name": "Chen Ming Fu",
      "author_url": "https://www.google.com/maps/contrib/104184967635186304139/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVY9bbEP1Nf0RC-CszIDf-dUMDR0PIbjWRmyFrkbBUzTLLANh0=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I have to give their service a huge thumbs up! Today marks our 4th wedding anniversary, and we decided to try this place out after seeing it featured in Little Red Note and craving their food. The brunch menu may not be extensive, but the portion sizes are generous and the taste is exceptional. Despite the crowd, the food was served promptly, with no long waiting times.\n\nWe were pleasantly surprised by the huge portions and ended up not being able to finish our meal. The rum and raisin ice cream and sesame ice cream were absolute highlights - I fell in love with the rum flavor, while my wife adored the sesame.\n\nWhat really impressed us, though, was the outstanding service. When we asked them to clear the table and serve our waffle and ice cream, the staff noticed that we hadn't finished our main course and politely asked if we still wanted the waffle. Since we knew we couldn't finish it, we decided to cancel the order, and they voluntarily refunded us on the spot. This level of attentiveness and proactive service is truly commendable.\n\nOverall, we're so glad we chose to celebrate our anniversary here. The food, service, and atmosphere all exceeded our expectations, and we can't wait to come back!",
      "time": 1739690699,
      "translated": false
    },
    {
      "author_name": "Zackery Goh",
      "author_url": "https://www.google.com/maps/contrib/109405400403426765330/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUGQsp237p9vNHb-uS9FyMoz0Z-zK6zy1GCgCTEXQuCxwKVbMg-=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I recently visited Oddity, and I was absolutely blown away by the experience! The moment I stepped inside, I was enveloped by its cozy ambience—a perfect blend of warmth and character. The inviting decor and soft lighting create a relaxed atmosphere that makes you want to stay and unwind.\n\nBut the real star of the show? Their bacon and cheese toast! It was nothing short of amazing. The crispy bacon paired with gooey, melted cheese on perfectly toasted bread was a flavor explosion that I can't stop thinking about. Each bite was a delightful combination of savory goodness.\n\nThe friendly staff added to the experience, making me feel right at home. If you’re looking for a cozy spot to enjoy delicious food, Oddity is the place to be. I can’t wait to return for more of that scrumptious bacon and cheese toast! Highly recommended!",
      "time": 1739232996,
      "translated": false
    },
    {
      "author_name": "Daniel Ng",
      "author_url": "https://www.google.com/maps/contrib/100110035401071252198/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVpKYbbrGGS9yM9hqOt1IH-gtwdoKeJVO0WIG2CeEMu1k1jWW96=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "Fairly crowded & lively when we came by for brunch and the space was warm and inviting.\n\nOrdering was fairly simple & we were spoilt for choice at the extensive menu. Got the Orange Americano which was overpowered with orange vs caffeine. Not a good balance between the flavors. Hot white was good. The miso pasta was a tad salty for my liking. The big breakfast was really good though.\n\nService standards was disappointing. When the waitress came by with our food, she shouted “TABLE 12” 3 times at us (how are we supposed to know our table number) before placing the food down on the table hurriedly. When we made payment, the cashier was also moody & had a can’t be bothered attitude. I mean you’re in customer service at least show some service standards??\n\nCafe space itself had bad acoustics and it got really noisy as the crowd spilled in. There was a table laughing really loudly and the laughter just echoed across the entire cafe. Not ideal if you’re looking for a quiet space.\n\nCame in hopeful, but left disappointed.",
      "time": 1744962086,
      "translated": false
    },
    {
      "author_name": "Janet Chin",
      "author_url": "https://www.google.com/maps/contrib/110080547192156819266/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUtCMELyv1aCL2j0QOxVit7OyXnLuCAq6-QuETpH7mYGDEfkQUg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Friendly staff and pretty chill place to hang for weekend brunch 👏\n\n10/10 and would order again:\n- iced black\n- iced orange americano\n- burrata caprese toast: served with a whole burrata and the sourdough toast is good\n- tomyum pasta: al dente with very 开胃. Love that the pasta is saucy.\n\nWill skip next time:\n- iced strawberry matcha latte: prefer the matcha to be stronger\n- buttermilk chicken strips: portion a bit sad\n\nThey have weekend deal - free scope of ice cream for every mains ordered. We got 2 scoops FOC 💯",
      "time": 1744951037,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "bar",
    "restaurant",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11603232000151771911",
  "user_ratings_total": 225,
  "vicinity": "730 Upper Serangoon Road, #01-01A Yeley Building"
}