{
  "formatted_address": "1 Stadium Place, 01-22/22A, Singapore 397628",
  "geometry": {
    "location": {
      "lat": 1.3034977,
      "lng": 103.8724007
    },
    "viewport": {
      "northeast": {
        "lat": 1.305241130291502,
        "lng": 103.8735963302915
      },
      "southwest": {
        "lat": 1.302543169708498,
        "lng": 103.8708983697085
      }
    }
  },
  "name": "Old Street Bak Kut Teh",
  "place_id": "ChIJERAvwEsY2jERBIvYoeeyuh0",
  "rating": 2.6,
  "reviews": [
    {
      "author_name": "June N",
      "author_url": "https://www.google.com/maps/contrib/100596558711872944013/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJAdnOOmKc8gQFaZbsGyVz5PHSUzM4yzxBwZaQEl3EZfRZX_w=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "I was disappointed with the experience.  When the server served our food onto our table, a little roach crawled out (from the tray or food,  not sure,  too fast) onto our table.  I said \"yee\", and the server quickly smack to kill it, and wiped it away.\nFor this kind of situation, I expected the server to inform her Supervisor or manager about this incident.  However,  I believed she did not as nobody came out to show their concern to the customer to check if customers are fine or needed any assistance.  I believed this should been trained to the staffs.\nI did not want to make a fuss on the spot but I hope that the management should look into this. It happened on 30 Mar, around 11+am, sports hub outlet.\nFor the food,  the quality dropped dramatically.  Especially the dry bak guk teh which i always like in the past. It's no longer the same. It was dry and not umani anymore.  The bak guk teh soup was not so tasty like before too. The minced pork noodle was very very oily.  Sigh... not going back again anymore.",
      "time": 1743418991,
      "translated": false
    },
    {
      "author_name": "HC L",
      "author_url": "https://www.google.com/maps/contrib/105381120259821237733/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL4AjoHyLWrgn0mQ9-z1eTIeRS1rdp--VFcDNRoBhx7ZLS0FL8=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "6 months ago",
      "text": "Ordered the “Dragon” ribs which was the premium pork rib in the menu. There were 2 ribs per serving. It was quite tender and meaty. I liked the soup which was not too peppery. We also ordered the kidney. It was sliced quite thickly and my mother complained it was hard. Problem was if you cooked it too long, it’ll be hard. If you don’t cook it so long, it’s bloody. Perhaps they should slice it thinner so after blanching, we can take it out immediately and eat. The Mei chai (preserved vegetable) was stewed until soft. It was not salty despite cooking with black soya sauce. The small slices of pork belly added were tasty too. We loved the you tiao which was fresh and hot. Tasted heavenly when we dipped it into the soup. Service was ok, not friendly but efficient. Soup was topped up quickly upon request.",
      "time": 1730897739,
      "translated": false
    },
    {
      "author_name": "Ashley Liew",
      "author_url": "https://www.google.com/maps/contrib/115333748318871707993/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVddwioWn2vIWseGeLcQUEr7x5FpokOuwMgLuTFOfWDIXAE46A=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Great food and service here for my wife, toddler and I last night. If you like the soup with more pepper then this is the perfect place; the soup refills are free too and the staff were always coming forward to offer. The meat of the pork ribs is fresh and slides off the bone too 😋 Staff are all friendly. Ideally the floor would be a little cleaner but overall still quite okay for our little one. Value for money too especially the set meals. Thanks! 🙏🏻",
      "time": 1700474782,
      "translated": false
    },
    {
      "author_name": "GK T",
      "author_url": "https://www.google.com/maps/contrib/104290517188989922396/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWf-mLzX5jX9gbEOzzQc9_0o0-KkRTUY77_fJAf4X0Cq_Ms2TnW=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "We ordered the set for 2 pax. Loved the meat which is not dry even if it is sinewy. Meat comes off the bones easily. Soup is light and peppery. Mei Chai is done soft yet with texture. Slices of pork belly can also be found in the dish. The You Tiao is made looking fluff-doughy and the bite into it is heavenly. We could help ourselves to the cut red chillies, chopped garlic and dark soy sauce. Oh, each set also comes with sweet soybean curd — it’s so smooth! Worth going to eat.",
      "time": 1741311607,
      "translated": false
    },
    {
      "author_name": "Sam Yuan",
      "author_url": "https://www.google.com/maps/contrib/100154668198878052584/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXBK7L20QpVDamGgLsckfUMJRk793WvlDRuj8kw9-zQ9FdXqb8J=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 2,
      "relative_time_description": "2 months ago",
      "text": "⭐️ 1.5 Stars / 5 Stars\nDisappointing Experience. Tough Meat & Confusing Payment Process\n\nHad high hopes for Old Street Bak Kut Teh, but unfortunately, it was a letdown. The meat was gamey and tough, making it hard to enjoy. The dry Bak Kut Teh was the biggest disappointment. The texture was so rough, it felt like I was chewing on tree bark. To make things worse, the you tiao was stale and old, lacking the usual crispiness or freshness.\n\nService/ Ordering process was also rather confusing. We ordered from our seats, but was wondering why the food took a while to arrive. After waiting for 4-5 minutes, we were suddenly told to make payment at the counter, on then the food was served. It wasn’t clear to me whether we were supposed to pay first or after eating, which made the process of ordering from our seats via our phone unnecessary😅.\n\nOverall, the main issue I had was with the food quality. I personally think the issue was down to how the meat is cooked and chopped. The texture just doesn’t work well when eaten. I may be no food expert but unfortunately, it made the whole meal quite unpleasant.",
      "time": 1742109171,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2142221280690604804",
  "user_ratings_total": 183,
  "vicinity": "1 Stadium Place, 01-22/22A"
}