{
  "formatted_address": "280 Bukit Batok East Ave 3, #01-323, Singapore 650280",
  "geometry": {
    "location": {
      "lat": 1.3477253,
      "lng": 103.756929
    },
    "viewport": {
      "northeast": {
        "lat": 1.349118130291502,
        "lng": 103.7584246302915
      },
      "southwest": {
        "lat": 1.346420169708498,
        "lng": 103.7557266697085
      }
    }
  },
  "name": "OneCare Clinic Bukit Batok East",
  "place_id": "ChIJKeX2i7gR2jER-JV-1s4i6l4",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "DAYna",
      "author_url": "https://www.google.com/maps/contrib/101483499202397229933/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWVSERhlBJx6eErUSfcFdsl5cYiVaUM7T0TwfChyDOrlABf9paYdQ=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "2 weeks ago",
      "text": "Went in for a flu. Went to register, I haven't even open my mouth, receptionist looks at me and said \"OMG WHAT HAPPEN TO YOU, YOU HAVE RASHES??\" (I in fact, did not. I just have a lot of skin pigmentation). RUDE! if you guys keen to trace, I went in on the 13 April morning. Too bad can't boycott cos it's under company.",
      "time": 1746257496,
      "translated": false
    },
    {
      "author_name": "Drishika Preethi",
      "author_url": "https://www.google.com/maps/contrib/102882013849663421241/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIU7ysF2xOyc6KBo4NRnrrMwC9_XpNe6oB7w6gcSaDrii1gbg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "rude, didn’t want to create a scene but both the Malay ladies who aren’t really fit to be doing this job, had a sulky face and not really happy to serve patients. I have to come to this clinic as I have no other choice. To see the doctor , clearly I don’t have to explain why I have to see the doctor to the nurse. But didn’t know what’s so funny between them. And they could even comment right in front of me, ‘number 76, said it was stomach pain’ like seriously what is so funny? I wasn’t sure what exactly the medicine that was prescribed to me as doctor only said inflammatory medicine. Nurse was not happy as I said I didn’t need the medication. Either you learn how to treat your customers or get a job that’s suits you. Act like adults. Really a horrible service and counter ladies.",
      "time": 1742564258,
      "translated": false
    },
    {
      "author_name": "OS H",
      "author_url": "https://www.google.com/maps/contrib/117992616329170954477/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIRHwgb0CGzSKGy6K0nO4CHHmPFKguL_hX6PTqcMxcgNLF4jQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "I had a fall and hurt my knee, bleed quite badly After a long wait, I finally get to see the Dr Lee Shimin who refused to provide an extra plaster for my wound. I need to replace the plaster after shower as advised by the doctor. I offer to pay for it, she said it is not for sale. I told her I need it because I have to go to work the following day in the early morning and it is nearly 9pm, Guardian at bukit batok east will be closing in 5mins. She still refused to provide, I am helpless. After that, i informed the Indian lady at the counter (she refused to provide her name) that there's no payment as I am covered by insurance. All my personal and insurance details were provided during registration She refused to let me go, I explained to her that I need to rush to Guardian which will be closing soon. She ignored and insisted I must wait. By the time, I rushed to Guardian, it had already closed. The doctor and staff at this clinic don't feel for their patients at all. Will not go to this clinic again.",
      "time": 1736862810,
      "translated": false
    },
    {
      "author_name": "Muhammad Rifqi Amran",
      "author_url": "https://www.google.com/maps/contrib/107902789387607673448/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXkfhq4D4YNo8QdjHOmOhHArbaLpjWwZtbQwPFGb2rgBJN4Sbs=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Dr.Dinesh is excellent—very approachable, informative, and patient. He provided a referral to a specialist when needed. The clinic is clean, and the process is efficient, from consultation to receiving medication. Overall, a fast and smooth experience.",
      "time": 1734415152,
      "translated": false
    },
    {
      "author_name": "rin ramlan",
      "author_url": "https://www.google.com/maps/contrib/111361394113764139618/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKiHMWwZ2WCx86xf3vJ1nc0LmSMpgGpWUnsnn82gNiuHop2Xg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "Visited the clinic this morning. On good days, i will have better and friendlier receptionists. But today, what i got was , Unfriendly, cold-staring receptionists, not one but both of them.\nAt the front , there will be 3 different signs of “not to abuse staff”. Ironic, because if they are being verbally abused or mistreated it is probably because they are asking for it.\nBad energy, unsmiling, and behaving like i owe them money. If not happy doing your job, please get another job. Simple as that. One older staff likes to taichi her service to the younger staff, what is up with that ? Making customers look like a clown, going to her and then to her colleague. Tak faham aku, sama counter kot, tapi aku yang tengah sakit lagi busy dari diaorang gerak2 sana sini. People sick already still can piss people off ?\nBuck up with the customer service experience and standardize, one care BB east.",
      "time": 1732170259,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6839317255872747000",
  "user_ratings_total": 307,
  "vicinity": "280 Bukit Batok East Avenue 3, #01-323"
}