{
  "formatted_address": "802 Bukit Batok West Ave. 5, #01-16 Bukit Gombak MRT Station, Singapore 659083",
  "geometry": {
    "location": {
      "lat": 1.3586128,
      "lng": 103.7518349
    },
    "viewport": {
      "northeast": {
        "lat": 1.360187880291502,
        "lng": 103.7530788802915
      },
      "southwest": {
        "lat": 1.357489919708498,
        "lng": 103.7503809197085
      }
    }
  },
  "name": "OneCare Clinic Bukit Gombak MRT",
  "place_id": "ChIJxy6jHzYQ2jERgvSCL09a5lk",
  "rating": 3.5,
  "reviews": [
    {
      "author_name": "Florence",
      "author_url": "https://www.google.com/maps/contrib/105115441304605860297/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI4Ozz5Ems9KSUaLCw2irF-2s7Og13YgYc7ISHC77ooXOY7YQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 weeks ago",
      "text": "Onecare Bukit Gombak Kari with very rude attitude. I already feedback to the staff that they cannot scold their patients without proper reason. If they just don't want too much work. They have to feedback to their management. They cannot blame their patients. I only follow the instructions I was told to do. If they do not have sufficient knowledge to understand about health examination, please do not provide any health examination services. This just prove your staff are unprofessional.",
      "time": 1746335467,
      "translated": false
    },
    {
      "author_name": "V C",
      "author_url": "https://www.google.com/maps/contrib/114718254788391921880/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIiN7FUdk0YJPOFiClUhwrBK7kobM2M-spi7k9-CBUdFtXQWA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "If I can give a zero star, I will provide it. The time management of this clinic is terrible. They just make people to wait endlessly and they are really slow. Shouldn't they reflect since they have a lot of feedback on their time management? I want to come back later and the nurse asked me to wait. And after the long wait, nurse said maybe you can go back first and come back 45min later since those have earlier Q number has returned! In the first place she should let me go back first and told me to go first when others returned. They should said earlier than to make people waited so long. Very poor management.",
      "time": 1737329266,
      "translated": false
    },
    {
      "author_name": "Sriram divya",
      "author_url": "https://www.google.com/maps/contrib/113703151579184214850/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW9yUCEyzm2Nz2ImiDzpgAzBNw0yGCamW_5HdzWGFoGA6wG6-r5=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "Honestly such a bad experience, clinic closes as per website as 9.30 pm.We reached at 9 pm after just finding out using a influenza kit that our child got Influvenza A.Eventhough we requested to see Dr upon explaining that the child got rare form of Epilepsy and a special need child,the lady staff there said what time can we go home if we keep accepting patients like you,you may go to hospital.\nSuch a rude,inhumane behaviour.",
      "time": 1739972833,
      "translated": false
    },
    {
      "author_name": "Renna Achul",
      "author_url": "https://www.google.com/maps/contrib/115480131773646298297/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX1nhfLexmFzpM8KqPwbbN36SpzvyTzvUM2p8ajHChHPN9w2yPx=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "I had the worst experience ever here in this clinic. The queue is soo long. I have to wait about 1hour plus to see the doc. Waiting time is already a hassle. The doc Dr. Au Kah Kay is not friendly at all. Very arrogant. He think all patient go there just for MC only. I have cough for the past 4days and ulcer on my tongue and gum making me hard to swallow and munch food. Doc check my ulcer and my mouth, he only gave me 1day MC. Upon taking my medicine, i was only given mouth wash, ulcer gel and cough syrup. No antibiotic. I asked the nurse if i can have antibiotic.. she asked me to check with the doc again.\n\nI went back in and before i can asked him about antibiotic, he straight away gave a straight NO. He said cause it was a Flu Virus season, no antibiotic need to be given. Mind u, i dont have flu ok.. i have cough and ulcer. How am i going to recover in a day if there are no antibiotic given. I need to work the next day, i need antibiotic to recover fast. Doc kept saying No No No. I have never experience going to a clinic and request for medicine like begging for it. Normally i will asked and doc will just give it to me. I will never going to this clinic anymore. The queue, the doc, the service.. if i can give zero rating.. i would rate zero for this. And as for the Dr. Au Kah Kay, i think its best u dont work as a doctor anymore. Cause really u dont understand ur patient, u expect ur paitent to understand u when the one that is sick is ur patient and not u.",
      "time": 1734412458,
      "translated": false
    },
    {
      "author_name": "Stephanie Woon",
      "author_url": "https://www.google.com/maps/contrib/110853684658896126619/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJBoaRvtRDy0JKMtdboRhw4mvtrPH6CPDFLWW60K7fjq1O4eQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "Terrible patient management. Queued for over an hour to see the doctor, and after a quick 5 min consultation, was told to wait for the doctor to “clear the queue” before she did a simple ear cleaning procedure. So essentially was bumped to the back of the queue.",
      "time": 1732881668,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6477964410165064834",
  "user_ratings_total": 305,
  "vicinity": "802 Bukit Batok West Avenue 5, #01-16 Bukit Gombak MRT Station"
}