{
  "formatted_address": "218 Sumang Walk, #01-05, Singapore 820218",
  "geometry": {
    "location": {
      "lat": 1.4033078,
      "lng": 103.895282
    },
    "viewport": {
      "northeast": {
        "lat": 1.404580780291502,
        "lng": 103.8966158802915
      },
      "southwest": {
        "lat": 1.401882819708498,
        "lng": 103.8939179197085
      }
    }
  },
  "name": "OneCare Clinic Punggol Sumang",
  "place_id": "ChIJtdh5FS0V2jER_zdoyM9_Yhc",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Lisa Salleh",
      "author_url": "https://www.google.com/maps/contrib/116448608863850996888/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK_yrgmjL_z-KQpCctfZ-R8VggcgZw6KyU-h5_SESXXzkgpTX8=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 weeks ago",
      "text": "Clinic Assistant HASHEEBA - I’m extremely disappointed with the customer service I received over the phone and in person at this clinic. I called to ask a simple question regarding the fees for my helper’s work permit medical check-up. Instead of providing helpful information, the staff who answered gave a cold response: “It depends on the MOM letter what tests need to be done.” When I asked a second question about what documents to bring, she snapped, “I’m telling you, you need to bring the MOM letter and her work permit.” This was only my second question — why the agitated tone?\n\nWhen I arrived at the clinic, the atmosphere was no better. The staff looked up at us with obvious irritation. When I asked if she was the one who answered my earlier call, the same staff answered “it might be me, why?”and then when i said she sounded “tired”she was then complaining about too many phone calls her attitude was still just as unfriendly.\n\nMy helper’s no was called in, i was behind my helper to go in she said “she needs to go in by herself”. Knowing my helper has difficulty in conversing in English, she called out coldly “I’ll be inside with her.” So i sat outside while my helper went in, hasheeba was still sitting outside at the counter. Fine, thinking she might be busy with her duties. I ignored.\n\nWhen i asked about the bill receipt, she said it will be emailed to me. Sure. I wanted to just dbl confirmed the amount after making payments and the receipt was with her, she just slam the receipt paper on counter top so annoyed and looking at her partner. THAT WAS IT. She was clearly having attitude problem! Is she having issues???\n\nIt’s quite ironic that the clinic demands all staff be treated with respect, yet they do not extend the same courtesy to patients or callers. Respect works both ways. Please consider improving your staff’s customer service and attitude.",
      "time": 1746225377,
      "translated": false
    },
    {
      "author_name": "Patricia Costa",
      "author_url": "https://www.google.com/maps/contrib/104565342982119429702/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKWwRSX7AAdx85GUK6n4WIJGDAyRG-Va2iPxOMCG1swhCfksA=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "Prefer this clinic due to Dr. Daniel.\nHe has always been extra caring and always after the well being of his patients.\n\nI only wish the malay recep at the registration is kinder.\nShe was rude to me when i enquire on something. Tone of voice and facial expression matters.\n\n26.03.25\n9:35am",
      "time": 1742959069,
      "translated": false
    },
    {
      "author_name": "Ms. Voo",
      "author_url": "https://www.google.com/maps/contrib/106648013517835264894/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJDwFcF_xBsHoXFsKUzVpwe3K87QBrzK5Afc13P1OZmRobTkUiP=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "On Christmas Day, I was concerned about finding a reliable clinic to handle a complex dressing for my dad. We were incredibly fortunate to be attended by Dr. Darren, and assisted by the kind receptionist, Mdm Nash, who was on duty.\n\nThe procedure took 1.5 hours, and even though it extended beyond their closing time, they never rushed and ensured every step of the dressing was done with care and attention.\n\nThank you so much for providing this exceptional care and gifting us peace of mind during the holiday season.",
      "time": 1735100786,
      "translated": false
    },
    {
      "author_name": "Christie Tan",
      "author_url": "https://www.google.com/maps/contrib/116376020258673498865/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKsxX5MbMg_n5DVTr9n-tjwno5gVw1T2ZKZxD72idZkLyZS4g=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "I walk into this clinic at 1130hrs on a sat. I was very sick. However, a Malay receptionist was very rude and ask me to go off and said the clinic is closing alr. I ask what time is the clinic close, she say 12pm. I told her I am unwell and she demand me to go off and verbalized she also sick.",
      "time": 1744764068,
      "translated": false
    },
    {
      "author_name": "mc",
      "author_url": "https://www.google.com/maps/contrib/104693088154216318783/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIfiQy1Bju6gtIStPN1X0Judx3icfeCYSIVV-ze9Xg0D3Y4tA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "My two boys were having fever for 3-4 days . Brought them to this clinic and was seen by a nice Malay doctor . He prescribed my younger boy with antibiotics as his fever started first . As for my older boy, he told me to return 2-3 days for the antibiotic if he was still unwell.3 days later , my older boy was still having fever and we went back, but this time round was a old Chinese doctor . He refused to provide the antibiotic and told us to go to kkh. The reason provided was that the fever persisted for too many days . He did a check listening to my son’s chest for the first time and he mentioned there was sound . He did a second check on his lungs before we left  and then he mentioned that there was no sound , it was instead phlegm . Although we weren’t charged for the second visit, we were so angry as we wasted so much time and we merely followed the first doctor’s instruction of returning 3 days later .\nWe ended up finding another gp to get the required antibiotic .",
      "time": 1733023026,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1685049740987217919",
  "user_ratings_total": 117,
  "vicinity": "218 Sumang Walk, #01-05"
}