{
  "formatted_address": "8 Tanah Merah Kechil Link, #01-49 Urban Vista Condo, Next to Tanah Merah MRT, Singapore 465420",
  "geometry": {
    "location": {
      "lat": 1.3272456,
      "lng": 103.9449269
    },
    "viewport": {
      "northeast": {
        "lat": 1.328772080291502,
        "lng": 103.9463661802915
      },
      "southwest": {
        "lat": 1.326074119708498,
        "lng": 103.9436682197085
      }
    }
  },
  "name": "OOIISHII",
  "place_id": "ChIJazUfDpIX2jER3XHOtfW5ydA",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "XX Gadget",
      "author_url": "https://www.google.com/maps/contrib/116597087465048963889/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLS0WzaUyvcQ4XXBMEgSAkCWX1Fv4LeNnnuJt9g3spT8bPfpw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I ordered all the flavour of their pie recently. Their pie are definitely different. Its was japanese style Pie. Which u can't find in Singapore.  The taste was so good and full of ingredients. Is juicy , cheesy and tasty. Mentaiko seafood and truffle shabu beef is really a premium pie. Their teriyaki chicken and curry pie are so also very nice. Their staff was very friendly and and show really customer service to the customer and also recommend all their promotion to the customer. Will recommended to my friends to taste this unique pie😊 will ordered again very soon😊",
      "time": 1742466344,
      "translated": false
    },
    {
      "author_name": "j c",
      "author_url": "https://www.google.com/maps/contrib/113959851477906507881/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLAhwlRr_vdwpmFYmrM9cvZIJP5rFpQjzRvawHEosvk8xX6=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 3,
      "relative_time_description": "2 months ago",
      "text": "Tried most of the pies here, and they were rather underwhelming. The star of the pie was the pastry, which was very buttery and flaky, really quite good. I believe they use some Japanese flour. That aside, the fillings were meagre - couldn’t taste much shabu beef (or truffle) nor seafood in those pies. The seafood pie was advertised as shrimp and fish, but was more of a vegetable pie with a few tiny shrimp and almost no fish. Curry beef and teriyaki chicken pie were better as I liked the sauce used, and the latter was more generous with fillings but still had too much vegetables. I would only recommend the teriyaki chicken pie, though the kids really liked the curry beef one. Would rather pay a bit more for more fillings.\n\nIt’s a small, hole in the wall pie shop tucked away in a condo, so the location is quite obscure and I was stuck at the back gate for a while before a resident let me in. Nevertheless, might repurchase again since the kids like these pies and I believe in supporting small local businesses.",
      "time": 1742445303,
      "translated": false
    },
    {
      "author_name": "Pearlyn GYT",
      "author_url": "https://www.google.com/maps/contrib/105538956700519868571/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK6MtdyHHnNAikyD2HSti-z3SVUUh8DEvZlYWHqSKvz56vWkw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "As some other reviewers have pointed out, non-residents are now not permitted to enter the premises. So you either have to call the shop staff to help bring out your preorder or for our case, the staff kindly came to the guard house to bring us in.\n\nWe opted for the frozen option and heated it up the next day. Pie flavours are unique. I loved the Yasai Pie as it's very refreshing with the sweet and light sesame sauce. Teriyaki Chicken is yummy as well. Will be back to try the other flavours.\n\nThe back gate of the condo is nearer to the shop so if you can wait there instead, it's easier for the staff to bring you in too.",
      "time": 1716883972,
      "translated": false
    },
    {
      "author_name": "Fiona Wong",
      "author_url": "https://www.google.com/maps/contrib/115961664755325295306/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLkpxzniRfe4lUuUUDMLh6crYSlWfNuEgcA6EV8iZHeHhmOTw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "A passionate owner who genuinely wants the best for his customers. Very tasty pies and pizza but I feel the pizza base can be a little more crispy. We ordered the truffle Angus beef pizza but there wasn’t much truffle taste nor the beef. Would definitely come back to try out the other pies in the future when the security team knows about the shop! Getting into the condo for pickup was a little bit of a pain when the guard has asked me all my details except my mother’s name, and was scrambling through to find the shops name when I have already told him.",
      "time": 1695451594,
      "translated": false
    },
    {
      "author_name": "LAWRENCE POH",
      "author_url": "https://www.google.com/maps/contrib/103028991604326698573/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV15Hn8mFfjXTYPAhgK6_nsrqpyyR6om44gj3J1qdqtJbRfURFf=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "As new tenants at Urban Vista, we recently tried OOIISHII, and it was fantastic! The pizza crust was crispy and delicious.\n\nAnd the staff were friendly. We can't wait to go back for more! Highly recommend anyone who enjoys Pizza and Pie.",
      "time": 1734266441,
      "translated": false
    }
  ],
  "types": [
    "bakery",
    "meal_delivery",
    "restaurant",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15044760495176184285",
  "user_ratings_total": 46,
  "vicinity": "8 Tanah Merah Kechil Link, #01-49 Urban Vista Condo, Next to Tanah Merah MRT"
}