{
  "formatted_address": "203 Hougang St 21, #01-73 Kovan City, Singapore 530203",
  "geometry": {
    "location": {
      "lat": 1.3582545,
      "lng": 103.8842969
    },
    "viewport": {
      "northeast": {
        "lat": 1.359479180291502,
        "lng": 103.8858775302915
      },
      "southwest": {
        "lat": 1.356781219708498,
        "lng": 103.8831795697085
      }
    }
  },
  "name": "Optic Precise Optical",
  "place_id": "ChIJ1165IbQX2jERNRrQPEG7ngM",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "YX ling",
      "author_url": "https://www.google.com/maps/contrib/106671821780503876368/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJpi-f1BZMwFgKfPcagm-a_t3gYfxbquFHnt3GqrsDAyBGI6A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "My husband Googled optical shops and came across Jeffrey's Optic Precise. We were thoroughly impressed by Jeffrey's expertise. He took the time to explain eye health and vision care in detail when my husband and daughter got their spectacles.\nI had been struggling with constant headaches for a long time, and despite consulting doctors and relying on painkillers, the problem persisted.\nWhen I visited Jeffrey's to address my presbyopia, he pointed out that my headaches were actually linked to poor eyesight—something I hadn't realized before. After a thorough eye exam and selecting a frame, I started wearing my new glasses. To my surprise, after just two weeks, my headaches began to gradually lessen.\nI highly recommend Jeffrey from Optic Precise to anyone in need of excellent eye care.",
      "time": 1743554667,
      "translated": false
    },
    {
      "author_name": "Chewlin Lin",
      "author_url": "https://www.google.com/maps/contrib/101730156680884542870/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ_Ms5ZBcmR39k6dp1rZr402MRxriEzbVPPX7I7JFJcGP85qg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I’ve been exploring around for a good trusted optician to make a pair of progressive lenses for my new frame. Found Precise Optics and saw the amazing reviews from fellow mates who have made their specs there. Decided to pop in and try out the service, so I was a pure walk-in customer into the shop, convinced of the great service and walk away with a pair of good progressive glasses allowing me to see things clearer than ever.\n\nIndeed like what others have shared, Jeffrey is very experienced and well trained in his field. He patiently assessed and tested my eyesight to ensure precision and explained how our eyes function, something that other opticians whom I have visited in the past have never even bother to take time to explain.\nTruly I am really happy to have my lenses done at Precise Optics. Jeffrey also offers after sales service which is another plus to have.\nI would definitely recco his services to those who are looking to make a good pair of glasses. :)",
      "time": 1732335556,
      "translated": false
    },
    {
      "author_name": "roger lim",
      "author_url": "https://www.google.com/maps/contrib/114751012852799355821/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLPg7HnaSQxAYirHdwi-1OYjQK_lHbBHfQh-w-P3ek-pmimdA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I did my spectacles 2 weeks ago at this shop. I am a walk-in case. Before my visit I did not read any reviews. I am a first-time 'coincidental' customer. Jeffery is the odd optician out of the many I have encountered. He takes his time to share his knowledge and is very genuine in giving what you need. I would not say his product is the cheapest but I believe in paying what is worthy of the money. He delivers and exceed your expectation by today optical market standard. His vision checks are much thorough than other checks I have experienced in other shops. Luckily his shop has a pair of frame which I like thus a deal was made. So for 2 weeks I have been wearing this new glasses and is elated to report I am very satisfied. So Jeffery, please continue to maintain your genuine, humble and high standard way of conducting your business.\n\nRoger Lim",
      "time": 1735367250,
      "translated": false
    },
    {
      "author_name": "Phyllis Peh",
      "author_url": "https://www.google.com/maps/contrib/113489301996123349750/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKgrmXF-fWap5Vbdnmvdivzk1OMgNuq1ScRImUKysK6pNy2rQ=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "I have been patronizing Optic Precise Optical for a few years. I made spectacles at the shop twice. I was surprised at the very first time I made a pair of spectacles there when Jeffrey told me that my previous optician did not measure my eyesight properly as he could tell from the lenses of my previous pair of spectacles. He did the correct measurements and prescribed a new pair of spectacles for me. Subsequently, I went to make a second pair of spectacles as a spare pair. When Jeffrey measured my eyesight, there was no increase in degree. This was a relief to me as previously when I made new pairs of spectacles, my eyesight typically deteriorated after a year. But this time, there was no deterioration. Instead, my  eyesight has stayed constant! After making the second pair of spectacles, I made an effort to go and see Jeffrey once every few weeks to get my spectacles cleaned thoroughly by the machine and to seek advice on how to maintain my eyesight. Jeffrey was more than happy to provide this after-sales service! Optic Precise Optical is a trusted brand indeed!",
      "time": 1730281792,
      "translated": false
    },
    {
      "author_name": "Eng hwa Teo",
      "author_url": "https://www.google.com/maps/contrib/112967576419446460200/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLs5tP1hPSkaQzkqHkIJ3JnBEYZslM8Wfkc4N_eDvicYB-S_Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "I have very high myopia (around 1900 on each side, not including presbyopia) and making spectacle has always been a headache, for my glasses is very thick and is difficult to find small frames to eliminate the thick lens at the edge. But now things have changed since I get to know Jeffrey and that he can customize spectacle frame design!\n\nI recently made one, he managed to accommodate almost all my request and I am very satisfied! No more thick looking, professor like lens with rings!\n\nIn addition, unlike conventional frame, this customized frame is made of acetate material, it is rigid and not easily distorted, for I am quite a clumsy person and bang my spectacle against wall at times, causing alignment to be off.\n\nThank you very much Jeffrey!\n\nHighly recommend those with high myopia to consider getting customized frame from jeffrey!\n\nMs Teo",
      "time": 1718290555,
      "translated": false
    }
  ],
  "types": [
    "shopping_mall",
    "health",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=260851717301606965",
  "user_ratings_total": 61,
  "vicinity": "203 Hougang Street 21, #01-73 Kovan City"
}