{
  "formatted_address": "Bedok Food City, 1550 Bedok North Ave 4, Singapore 489950",
  "geometry": {
    "location": {
      "lat": 1.3366759,
      "lng": 103.9437911
    },
    "viewport": {
      "northeast": {
        "lat": 1.338017680291502,
        "lng": 103.9452778802915
      },
      "southwest": {
        "lat": 1.335319719708498,
        "lng": 103.9425799197085
      }
    }
  },
  "name": "Original Botak Jones (Bedok Food City)",
  "place_id": "ChIJVw1H5is92jER9MggkmZG9_I",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "NomNomFables",
      "author_url": "https://www.google.com/maps/contrib/116604684195918553212/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVfSDlho2BUM4uPbl9e4yPD4S5h61LUY3UGVaJ2ODTAChsFgnM=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "If you’re craving big portions of Western food, this is the place.\nLoved the grilled salmon, nicely charred on the outside, moist and flaky inside.The Double Botak Burger was satisfying with thick, juicy patties.\nAlso tried the Whoopass Cheese Fries loaded with beef chili and cheese, definitely shiok and great for sharing. And the Chicken Gumbo? So comforting and full of flavour.\nBonus points for easy kiosk ordering and a wide choice of sides.",
      "time": 1746625772,
      "translated": false
    },
    {
      "author_name": "Kacax",
      "author_url": "https://www.google.com/maps/contrib/103839386838101393779/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJVnKIJEq4I9A-EMFcThMoo1hasfZV5N-sJSFuz9pExlhpVkA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Love the foods a lot, it is a little different from local coffeeshop Western foods, which can taste a tad sweet like the coleslaw, sauces etc. but not here. There is zero sweet taste in the foods but robust seasonings, takes a little getting used to coz I'm used to Singaporean style Western foods. Good pricings, as to me the portion is double to what you get from other local coffeeshop Western foods, fries, coleslaw, size of the chicken, fish is huge. Only thing can improve on is the chicken is not tender, can further tenderise the meat during prepping, also the coleslaw is quite bland, lack of flavour and lack seasoning, hope can improve taste of the coleslaw. Will repeat as to me this is 1 of the better tasting coffeeshop Western, with great quality, competitively priced and great portions.",
      "time": 1744962546,
      "translated": false
    },
    {
      "author_name": "Jovial Tan",
      "author_url": "https://www.google.com/maps/contrib/112596736065399380267/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKTzkl2xwautSfkFJWVinbCkdkSftPVD-YugrNfcy1q2n_ffg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 2,
      "relative_time_description": "2 weeks ago",
      "text": "Ordered regular Cajun chicken set and the portion is small, lots of fried given thou. Food is nice but portion doesn’t justify the price of $9.",
      "time": 1746450810,
      "translated": false
    },
    {
      "author_name": "johnnykuochung",
      "author_url": "https://www.google.com/maps/contrib/110803765536711118720/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUIozbWPxugGZODavXWfBzv6f1AhKvSbLwscJ8qwdTiYAac9DJ3=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "The Original Botak Jones has earned a strong reputation in Singapore for offering hearty American-style food with a local twist. Many fans love the large portions, especially the Botak Burger, Cajun Chicken, and Fish & Chips, which are made with fresh ingredients and have generous, flavorful portions. The Cajun fries are a popular side, adding a unique spice that complements the main dishes well.\n\nAt its peak, Botak Jones operated over ten outlets across Singapore, but in 2013, financial difficulties led to the closure of many of its branches. After a brief hiatus, Botak revived his brand in 2021 with “The Original Botak Jones,” focusing on quality ingredients and customer experience to win back old fans and attract new ones\n\nBLACK PEPPER CHICKEN REG $9.00 LG $15\nThe Black Pepper Chicken is often served with sides like coleslaw and fries, offering a balanced meal with a mix of spicy, savory, and refreshing elements. This dish is a great option for anyone who enjoys robust flavors and appreciates American-style comfort food with a Singaporean twist.\n\nRecommend 7/10 👍👍\n\nTalk about how black pepper itself has a deep history .\n\nThe Rise of Black Pepper in Southeast Asia\n\nBlack pepper, often referred to as the \"King of Spices,\" has a rich history spanning thousands of years. Originally cultivated in India, pepper was a prized commodity in ancient times, traded widely by explorers, traders, and merchants. The spice was so valuable that it was even used as currency and called “black gold.”\n\nWhen black pepper made its way to Southeast Asia through the spice trade, it quickly became a staple in local cuisines, finding its way into dishes across Singapore, Malaysia, and beyond. One of the most popular creations from this fusion of local flavors with black pepper is Singapore's iconic \"Black Pepper Crab\" and, later, black pepper chicken.\nIn Singapore, black pepper chicken became a staple dish. Restaurateurs, chefs, and street hawkers each put their unique spin on the dish, making it more flavorful, bold, and aromatic with the perfect blend of spices. The dish became a favorite among locals and tourists alike, celebrated for its fiery heat and savory, peppery flavor that pairs beautifully with chicken.\n\nAs Southeast Asian cuisines spread globally, black pepper chicken became one of the region's standout dishes. Today, it's a comfort food enjoyed by people from all walks of life and a shining example of how a single spice can inspire a culinary sensation. This story of black pepper and black pepper chicken is a testament to how a humble ingredient can bring flavor, warmth, and even a bit of history to our plates, symbolizing the rich cultural connections that make global cuisine so vibrant.",
      "time": 1730955679,
      "translated": false
    },
    {
      "author_name": "Chiun How Teng",
      "author_url": "https://www.google.com/maps/contrib/110173267101233175211/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXo--tLbokkdnJNjt573WmwVLTMMuAEbiqOwaeu3MYXISZEJgKsSw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "Authentic American Food in the east 😀\n\nGood food, still as good. Not so crowded in the evening. Order from kiosk, service was fast too.\n\nDo check it out if you are near by. Parking is easy too. Nice music and you can get a beer as well.",
      "time": 1730205017,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17507539482778323188",
  "user_ratings_total": 150,
  "vicinity": "Bedok Food City, 1550 Bedok North Avenue 4"
}