{
  "formatted_address": "L2, Crockfords Tower, 8 Sentosa Gateway, Resorts World Sentosa, Singapore 098269",
  "geometry": {
    "location": {
      "lat": 1.2564647,
      "lng": 103.8209869
    },
    "viewport": {
      "northeast": {
        "lat": 1.257607330291502,
        "lng": 103.8227102302915
      },
      "southwest": {
        "lat": 1.254909369708498,
        "lng": 103.8200122697085
      }
    }
  },
  "name": "Osia Steak and Seafood Grill",
  "place_id": "ChIJufG1t1UZ2jERqqP4QaIoTzc",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "LEE",
      "author_url": "https://www.google.com/maps/contrib/100197091380215637681/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXVl9WqwMhv7SJ_22IDcmnz93EeJrILHlSCe7q3KMEpOzhklKtJ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Visited with colleagues for a casual meal, and we had a great time! The food was delicious, especially the sharing platter—perfect for group dining with generous portions. The staff were professional, attentive, and made sure we had everything we needed. The ambiance was relaxed yet lively, ideal for after-work gatherings. Prices were reasonable for the quality and portion sizes. Only minor downside was the slightly limited seating, so arriving early is recommended. Overall, a solid choice for team dinners or friendly catch-ups. Will definitely return for another round of good food and great service!",
      "time": 1746623359,
      "translated": false
    },
    {
      "author_name": "Cha BRN",
      "author_url": "https://www.google.com/maps/contrib/112152274442246309678/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLfMxE-RIHXcEHEyFcNKbDnnP4w5Ak11vw-JQ2yCPmx_Z585q0=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "All waiter and waitress are very nice and full of service mind!!!\n\nWe just back from Universal and get wet from the rain, so we asked for sit at outdoor but staff offer us to sit inside for comfortable warmer, Appreciated!\n\nBut we still wanna sit outside and staff bring blanket/ big towel to make us warm,\n\nSo I would like to share this story, due to It made us feel comfortable and appreciated for this service,\n\nAnyway, food is exactly yummy! My ribeye is very soft and tasty, recommened!!\n\nDon’t miss :)",
      "time": 1742742991,
      "translated": false
    },
    {
      "author_name": "trisha koh",
      "author_url": "https://www.google.com/maps/contrib/111155500445104687971/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW92vCpxZ0q8JZQCVFLrzSEYFxPoYWAuv9NqAmJTX58V5C0Hhcv=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I recently had the pleasure of dining at Osia, and it was truly an unforgettable experience! I took my parents there to celebrate their 27th wedding anniversary, and the evening was nothing short of magical.\n\nFrom the moment we walked in, we were greeted with warmth and genuine hospitality by Harry. The ambiance was perfect—elegant yet inviting, with a cozy atmosphere that made us feel right at home. Our server, Ronny and Eebii, went above and beyond, making sure every detail was perfect without being overbearing. Their attentiveness and genuine enthusiasm for making the evening special were remarkable.\n\nThe food—wow! Each dish was a masterpiece, bursting with flavor and beautifully presented.\n\nAs a special touch, the restaurant surprised my parents with a personalized dessert to celebrate their anniversary. It was such a thoughtful gesture that made the evening feel even more special. The combination of incredible food and exceptional service made for an experience we will never forget.\n\nIf you're looking for a place to celebrate a special occasion or just want to indulge in top-tier dining, I cannot recommend Osia highly enough. It exceeded every expectation, and I can't wait to return for another unforgettable evening!",
      "time": 1735392786,
      "translated": false
    },
    {
      "author_name": "Leonard Choo",
      "author_url": "https://www.google.com/maps/contrib/105528902849760401802/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV9ubnNs4fUvD2TGDjchfjhdfERAfpIhYkK7UvCdu0wrqWf708b=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Came just before last order timing (2.30pm) but the staff were still kind and attentive. They did rush us to order but we understand because the kitchen had to close.\n\nWe got the lunch set with flatbread on the side. They had an option to mix two types of flatbread and I would say it's the highlight of the meal. The bread has a great mix of fluffiness and bite, with delicious toppings. The butter/spread provided goes really well with the bread.\n\nWe got the tomato soup and salad for the starter. The soup is great with a nice taste of tomato but not overpowering. The salad dressing was not to my taste unfortunately.\n\nFor the mains, we got the fish and topped up for a steak. The steak was tender and juicy. Not a fan of the rice on the side. The fish was really good, the skin was cooked to a nice crisp and the meat is tender. Would highly recommend to just go for the fish since there is no topup required and I think it's just as good as the steak.\n\nThey have 1 for 1 cocktails before 2pm so it's great to visit for a simple occasion with your partner.\n\nOverall great experience.",
      "time": 1729661731,
      "translated": false
    },
    {
      "author_name": "G Choh",
      "author_url": "https://www.google.com/maps/contrib/104908827179454178059/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI-znZikd2SHjxDxbMypJDypLxTJKBQH7DDyDNLVYe3zGGD7w=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "We have been going to Osia for the longest time and each time, we have always had an amazing experience with delectable food, and attentive and friendly staff. My husband and I had the Angus Beef Tomahawk from the Festive menu. It was done perfectly as usual,  to medium rare; the meat was succulent and went well with the roasted winter veggies and Parmesan mash. The thyme sauce was very flavourful and the honey wholegrain mustard was so delicious that we had to ask for more. It might seem on the pricey side at $275 before taxes, but it was totally worth it! Kudos to the chefs!",
      "time": 1734262309,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3985448872602805162",
  "user_ratings_total": 495,
  "vicinity": "L2, Crockfords Tower, 8 Sentosa Gateway, Resorts World Sentosa"
}