{
  "formatted_address": "# 02-27 Raffles Hotel Arcade, Singapore 188719",
  "geometry": {
    "location": {
      "lat": 1.29583,
      "lng": 103.8540529
    },
    "viewport": {
      "northeast": {
        "lat": 1.297245180291502,
        "lng": 103.8557230802915
      },
      "southwest": {
        "lat": 1.294547219708498,
        "lng": 103.8530251197085
      }
    }
  },
  "name": "Osler Health International @ Raffles Hotel Arcade",
  "place_id": "ChIJs3TzJngZ2jERk27u15JZ8mk",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Amita Raj-Bauer",
      "author_url": "https://www.google.com/maps/contrib/107614178964763802288/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL1ArlW7UVuWCvjxEqLaPWSTXrSAGvYEURSh8ykNRINN9KuBA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "Unfortunately, I have to give this clinic a 1-star review despite the fantastic service and environment. I was recommended to Osler by a PT at my gym and had heard great things about the doctors' approach—focusing on real solutions rather than just prescribing meds and sending patients on their way.\n\nBefore coming to Osler in February last year, I had already seen multiple doctors, specialists, TCM practitioners, and osteopaths—searching for relief from severe PMS/PMDD. I was desperate for a solution that didn’t involve birth control. But to my disappointment, that’s exactly what I was prescribed here. Trusting the clinic’s reputation, I followed the advice, only to spend six months dealing with side effects that made things worse. I stopped the pill in July, but even now—seven months later—my cycle is still unbalanced, and I’m still struggling with symptoms - the old and the new 🫠\n\nDespite paying over $1,000+ for my visit, no tests were done to properly diagnose whether I have PMS or PMDD. Instead, I was sent generic WebMD articles (which I could have found myself) and told to read up on contraceptive options like the pill or IUD. When I reached out about the new symptoms that emerged after stopping the pill, the doctor’s response lacked empathy and accountability. I was simply told to come in for a \"check-up\"—which, of course, would cost me even more.\n\nIf anyone reading this has gone through something similar and found a real solution, I’d truly appreciate any advice.",
      "time": 1738228263,
      "translated": false
    },
    {
      "author_name": "Stephanie H",
      "author_url": "https://www.google.com/maps/contrib/110494584363523198127/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKGaw1AUhrpcFeQ78w19PNrJa9H3eiOSe5qjrxoNfjIE7Me830=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I was treated compassionately and professionally at Osler Health International. An appointment was quick and easy to book and the office communication was thoughtful, quick and comprehensive.  I highly recommend this clinic.",
      "time": 1732529030,
      "translated": false
    },
    {
      "author_name": "Hannah La Rue",
      "author_url": "https://www.google.com/maps/contrib/101827003647019880734/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIKraZYVGpLZ5V7tb0q9ur0SyqpQOHHonuoEhGEtR1D_MvK=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Always outstanding. Considerate, thorough, knowledgable and so reassuring. It’s always daunting being unwell far from home as an expat, but I receive better care at Osler than I would back home. Incredibly reassuring and reliable.",
      "time": 1734614720,
      "translated": false
    },
    {
      "author_name": "Helen Nash",
      "author_url": "https://www.google.com/maps/contrib/100276158321323189583/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIo5cEzNA3A5FpwLLsyG3Xet4jPm6ohWIxb42m3XQhlgyDiuQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "As a health professional it is so important to me to have a GP surgery who I can trust and a GP who will be honest with me. I can honestly say that this is the best practice I have ever been part of. Each Dr that I have seen or met treats me as I would like to be treated. I feel seen and heard. There is no over referring and I feel looked after.\nI would particularly like to give a big shout out to Louise. Louise is the first person you see at the desk. She is bubbly, kind and compassionate. She deals with difficult patients with ease and she makes the best coffee 😉\nFrom the front desk to the nurses and drs they really are a great team!\nNo I’m not on commission with them. Just praise where praise is due. Thank you Osler🙏🏼",
      "time": 1719461929,
      "translated": false
    },
    {
      "author_name": "Jill Hall",
      "author_url": "https://www.google.com/maps/contrib/112188000567322584317/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLI2eosHLXGITWQTqNY1JOuEHjs5wMf72FDQuOW94aYqMRUMw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Very impressed by Ostler Health. Needed to see a doctor while visiting Singapore and was extremely happy with the quality of the consultation. In addition, when I needed a repeat prescription, for delivery to Australia this was all managed very efficiently by extremely helpful staff. Highly recommend Ostler if you have any medical issues In Singapore.",
      "time": 1713772356,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7634262805569236627",
  "user_ratings_total": 140,
  "vicinity": "# 02-27 Raffles Hotel Arcade, Singapore"
}