{
  "formatted_address": "106 Paya Lebar Cres, Singapore 536186",
  "geometry": {
    "location": {
      "lat": 1.3465691,
      "lng": 103.8828646
    },
    "viewport": {
      "northeast": {
        "lat": 1.347924180291502,
        "lng": 103.8842775802915
      },
      "southwest": {
        "lat": 1.345226219708498,
        "lng": 103.8815796197085
      }
    }
  },
  "name": "Our Children's House International Childcare Centre",
  "place_id": "ChIJixJHpL0X2jERDIMUx4qcL-U",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Dave Reade",
      "author_url": "https://www.google.com/maps/contrib/113950314443998759806/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX5GAUBxYqo-YzRvZmYg7I2TvAyzAy_k6T5pg08OGxNhQ4kn6zz2Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Thank you Ms Nabi for everything you and the staff have done for my kids from day one.\n\nThe way our 2 toddlers were welcomed into the school really meant a lot to us, by staff and the other children, everybody knew their names as we dropped them off and picked them up each day, which is no accident and is credit to how the staff are trained and the culture of inclusivity is encouraged.\n\nIt has been overwhelmingly positive our experience with Our Children's House and we really appreciate how well the school is run, how clean the place is kept and how efficient the school is in it's management of protocols in order to safeguard the children.\n\nThey always came home from school happy each day and the sense of belonging my kids have enjoyed has been so crucial at this stage in their lives.\n\nThey miss the place very much and still talk about their teachers and friends they met at the school.",
      "time": 1744614368,
      "translated": false
    },
    {
      "author_name": "Pingxia Zheng",
      "author_url": "https://www.google.com/maps/contrib/109954297269613181783/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKoVrPNJcgd2dMJ7qdzZorHOvoGP6bNsPGymoaKB63FasFB9g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "My son started joining OCH after he turned 18months, and he has enjoyed the school so much. Teachers spend time with the kids and made the transition to school really smooth.\n\nHad to quit the school because we are moving away from this area. Would definitely recommend the school for anyone living nearby!",
      "time": 1741340337,
      "translated": false
    },
    {
      "author_name": "Ken Y",
      "author_url": "https://www.google.com/maps/contrib/105257163850328655042/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLyVHq6BMdAGlqD1NrL08u1ZmNTCdbBFyQ4y70ipL35cqizOw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "My daughter was at OCH since she was a toddler and has now finished K2. She enjoyed her early learning years at OCH and made many friends (class and school mates). The teachers were passionate, caring and attentive. She is very fond of them. Her English, Chinese and Maths are, I believe, well prepared for P1, due to the excellent Montessori academic programme. The non-academic activities included arts and crafts, physical exercise and excursions, which she and the other children love a lot. There is a large public open playground about 150 meters away from OCH where the teachers took them to play and run about quite often. I am very glad and grateful that she attended OCH which has developed her academically and emotionally.",
      "time": 1734603778,
      "translated": false
    },
    {
      "author_name": "CT T",
      "author_url": "https://www.google.com/maps/contrib/108272968008684809915/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJOaZcfj84csMMFFKLcbC5OKHHZAfPn33ggWHHA3ivnIWUZFw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Both my daughters has been going OCH for years. They enjoyed going to school very much, I never had problems needing to convince them to go to school. The teacher is caring and build good relationships with the kids and also care about helping the kids to build good relationship with other kids. I like that they focus on outdoor play as well, have dedicated time for outdoor play within the school compound and teaching kids to take care of plants etc, not fully indoor child care. Though not advertised as an academic oriented childcare, I’m impressed with my kids academic side whenever I look at the exercise they bring home, quite advanced. And in a lot of cases, my friend who has kids of similar age can also tell me the difference how advance my kids get. What’s more, they never get HFMD in their few years there, contributed by good hygiene school is maintaining and the swift action they take whenever there is any suspicion. Overall I really like the school and very glad we made the decision to send my kids there. What’s more to ask when they are happy, healthy, learning and progressing ?",
      "time": 1725881530,
      "translated": false
    },
    {
      "author_name": "Victoria Zheng",
      "author_url": "https://www.google.com/maps/contrib/102700314189972651150/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUGsjnDHLjBuxWolj7WTh1uifu-AIyKL7MWg_TnuoXxOsoWOX3r=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My daughter has had a wonderful experience at Our Children's House. The teachers are caring and dedicated, creating a warm and nurturing environment for the children. The curriculum is engaging and age-appropriate, fostering both academic and social development. We are grateful for the positive impact this preschool has had on our daughter's growth. While we are sad to say goodbye, we are excited for her next adventure. Thank you to the entire team at Our Children's House for their exceptional care and education!",
      "time": 1713343116,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16514590478450328332",
  "user_ratings_total": 33,
  "vicinity": "106 Paya Lebar Crescent"
}