{
  "formatted_address": "2 Pandan Valley, #01-208B, Singapore 597626",
  "geometry": {
    "location": {
      "lat": 1.3204891,
      "lng": 103.7790434
    },
    "viewport": {
      "northeast": {
        "lat": 1.321930230291502,
        "lng": 103.7803657802915
      },
      "southwest": {
        "lat": 1.319232269708498,
        "lng": 103.7776678197085
      }
    }
  },
  "name": "Pandastori",
  "place_id": "ChIJh_H8vMQb2jERetJnws4hD7U",
  "rating": 4,
  "reviews": [
    {
      "author_name": "M C",
      "author_url": "https://www.google.com/maps/contrib/103865575401877531769/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI_svPpggTxDRKhzh4kP661lS1JkXb9K5_o_vwdUHnwjKRBTxE=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 3,
      "relative_time_description": "2 months ago",
      "text": "I'd been looking for a Mandarin art class where my child could get messy and learn Mandarin in a hands on way for a while, but struggled to find any providers as most only cater to older kids.\n\nMy child loves the hands on learning. Space is cosy, a perfect size for the class, it has many props, art materials and toys for the class.\n\nHowever so far my experience is that the school needs to do more to maintain its quality control over the quality of the teaching. There is a lack of consistency in the quality and experience of teachers being hired/ or at least, what they are trained to teach/ how to interact with the kids. The first teacher we had was really experienced and the teaching quality was good, especially in this more open ended environment. However the latest batch of new teachers seemed quite inexperienced and the content of what was being taught or the quality of interaction with my child dropped alot as a result.\n\nIf they could fix and maintain a consistent level of quality, it would continue to be a good class.",
      "time": 1740992652,
      "translated": false
    },
    {
      "author_name": "Shaowen Ang",
      "author_url": "https://www.google.com/maps/contrib/108120588260686450066/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXFdsSxAx2Z7bkjfZNLW3V_c-gD2eNecrnSwWxWsOq_XpvIDkMW=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "My twins have enjoyed a great term with Pandastori. Teachers are lovely and kind while the classroom is beautiful and cozy. My children are treated respectfully without coercion. The chinese environment is also great for introducing them to a language in a natural setting.\n\nIt says a lot when your toddlers rushed into class every morning and refused to go home.\n\nThank you for being such a wonderful first school for my children!",
      "time": 1702521120,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13046683817424179834",
  "user_ratings_total": 2,
  "vicinity": "2 Pandan Valley, #01-208B"
}