{
  "formatted_address": "35 Windsor Park Rd, Singapore 574141",
  "geometry": {
    "location": {
      "lat": 1.3574147,
      "lng": 103.8263016
    },
    "viewport": {
      "northeast": {
        "lat": 1.358823930291502,
        "lng": 103.8276330802915
      },
      "southwest": {
        "lat": 1.356125969708498,
        "lng": 103.8249351197085
      }
    }
  },
  "name": "P&J Montessori Kindergarten",
  "place_id": "ChIJ5Y024WEW2jER_jSEsdW3Nd4",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Carol Lin",
      "author_url": "https://www.google.com/maps/contrib/106058773528340294309/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJbs1rCZ-Kf-2ZIPKGDV1Lw7BFlFrrLagl9pM7TeFOKw3SpMg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "We are extremely happy to have found this school. It really preserves the essence of education, a children centric school.  My daughter LOVES the school so much that she often asks why I am here so early to pick her up, when it is really her going home time. Lol. It is rare to come by a school that the founder Mrs Ong, is still there to  over look, run and ensure the school is running smoothly and all children are very well taken care of!  She and her team of devoted teachers ensure children are enjoy learning daily  life experience as well as academics that they should have for primary school too. We also absolutely love the fact that the school provides outdoor forest school program for all children to experience outdoors as part of a school program. Everyday, going to school is like a brand new experience.  My child would come home to share many exciting stories of bird, butterfly, monkey and rarely harmless snake visiting.  The children are fully exposed to the nature in a garden settling school in Singapore.  We LOVE it! We can't say enough about how much we love about the school, and we hope more kids can experience the  same schooling childhood experience as my own kid.",
      "time": 1737710225,
      "translated": false
    },
    {
      "author_name": "F McKeown",
      "author_url": "https://www.google.com/maps/contrib/107818666658513778891/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI8RMre7H1YG4LBtZNHiTl9F4DNxasUZNe4NvoeH9flQQ1vUQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "We were lucky to live close by to this beautiful pre-school.\nIt is truly a Montessori preschool with educated and experienced teachers to help ensure a fun experience for each child.\nOur son is non-verbal and this was his first experience of a preschool environment. The teachers and students were nurturing and he thrived! Teachers listened to feedback and put them into practice when it came to understanding and redirecting our son. We really love this preschool and are grateful for a team that actually cared for our son and his experience. Truly a blessing to be here!",
      "time": 1735012512,
      "translated": false
    },
    {
      "author_name": "Yingzhao Kee",
      "author_url": "https://www.google.com/maps/contrib/113559584977535557947/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWnX-86cLuIRaqM0xFfdwkOW9cK-C0OvS3SRwvWKwGL1fqIhFw8vw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "We have 2 kids - our older child went to an international preschool. That place was fantastic - they were nurturing, respectful, and very supportive of the child's overall development; they didn't push when it comes to academics, leaving the child to explore if he wishes to. The only shortcoming for us at that school is the lack of a dedicated Chinese learning environment. Because of this, we struggled so much when said child entered Primary 1!\n\nLearning from experience, we decided to search for another school that had the same kind of ideology but also gave equal weight to learning Chinese.\n\nI am very happy to say that P&J has met and even went beyond our expectations!\n\nP&J Kindergarten stays true to their Montessori foundation. They adhere to the 3-hour work cycle and provide authentic Montessori materials for the children. Having worked in a childcare center before, I knew that not all schools that claim to be Montessori actually follow the Montessori principles and/or provide authentic materials for the children to use.\n\nThe teachers at P&J genuinely care for each child. They treat them with utmost respect and kindness. You can actually see the real joy radiating from the teachers when they interact with the children - the occasional bursts of laughter or the smiles that ride up to their eyes. It's not easy to find teachers who truly enjoy the company of your child(ren)!\n\nMrs Ong, the founder of P&J, still teaches at the school! She has a wealth of experience and you can see the passion in her eyes (and entire body language) when she talks to you about Montessori, about your child's learning, and about the school.\n\nI really should mention the time when she pointed out to me (during PTC) that my child could have dyslexia and dyscalculia. I would have truly panicked if not for her reassuring words. She also has a child who had to go through that. She was able to give me useful tips as to what I could/might have to do. But at the end of it, she told me that we will work together to see how he progresses. She didn't just dump the information on me and expected me to figure it out myself. Hand-in-hand. That's what every parent would wish the teachers at their child's school would do. An education journey that is walked alongside each other.\n\nBeing an authentic Montessori school, most parents would worry that their child(ren)'s transition to Primary 1 would be disastrous. But at P&J, Mrs Ong understands the local education route, she understands parents' worries; she walked the same road before! At P&J, towards the end of their K2 journey, the children would undergo a short programme that helps them understand what Primary 1 life could be like - there will be recess time, there will be homework, there will be lessons and a classroom setup. But they will also learn responsibility - what's it like to own your homework and prepare for school the next day.  The teachers would also take time off their evenings to explain to parents the process, what to do/not do, the change the children might be undergoing, what sort of behaviour they might start displaying and how to approach them. Because they believe, hand-in-hand, we journey together. Hence, out of their own down time, they give parents the resources to support them. Support them so that they may support the children.\n\nEvery child that walks through the gates of P&J are treasured and cherished as individuals.\n\nWe are very grateful we found P&J as the second-home for our child despite it being so far away (we stay in the East!). We highly recommend it to parents seeking a nurturing and respectful learning environment.",
      "time": 1739008359,
      "translated": false
    },
    {
      "author_name": "Daniel Widyanto",
      "author_url": "https://www.google.com/maps/contrib/100197279487472609195/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKv1jP-1aOU3iwoxW_3att8XDZKmJPC0q7gpFZyHQcwDpk_BQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "We have 4 kids, and we are sending all of them to P&J since 2017. At first I don't really know what Montessori is about, but we like the school coz they are not like the other preschools (where the kids are sitting in a classroom and working on their worksheet).\n\nThe activities are led by the children, instead of the teachers, and the social interaction is very casual. The kids, big and small, come together to do their work. The older ones usually help the younger ones to adapt (like helping them to get the materials, show them around and more).\n\nThe school has nice airy space with sunlight and garden. It also has all kind of tiny furnitures, including small toilet bowls. Apparently the younger ones learn how to do chores, like carrying the tray, pouring from the jug, sweeping or wipe the tables, so they can be independent. The older ones starts to do more academic works, like composing letters, counting, etc.\n\nThe teachers are focused on the growth of the child. Like, for our son, he couldn't read well after K2, but Ms Ong insisting on love of reading rather than being able to read. In P2, my son is reading Narnia and the Lord of the Rings, just for fun..\n\nI think P&J has done a very good job to provide a holistic education for our kids.",
      "time": 1737769468,
      "translated": false
    },
    {
      "author_name": "Daisy Daisy",
      "author_url": "https://www.google.com/maps/contrib/101220720750294507187/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ_zG7SMThVFhB_KPdQD4VquIRI9p1CdCS7HHD8uUQna1QiuQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "The best school in Singapore. The school crew are fantastic! Both my daughter and son are having so much fun.",
      "time": 1744249139,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16011906178619815166",
  "user_ratings_total": 6,
  "vicinity": "35 Windsor Park Road"
}