{
  "formatted_address": "101 Bukit Panjang Ring Road, Saujana Rd, Singapore 679910",
  "geometry": {
    "location": {
      "lat": 1.3819061,
      "lng": 103.7655122
    },
    "viewport": {
      "northeast": {
        "lat": 1.383410780291502,
        "lng": 103.7672224302915
      },
      "southwest": {
        "lat": 1.380712819708498,
        "lng": 103.7645244697085
      }
    }
  },
  "name": "Pang Sua Pond",
  "place_id": "ChIJaaC07KIR2jERl3-DgSWf4aE",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Yellow Bear",
      "author_url": "https://www.google.com/maps/contrib/104489311735261065689/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXJw6wU_ViJ96j0KUowLXVVtxYUueaV518tEdvuXXsBsEMiDzjh=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Nice place to have a stroll. The rain water collected in this pond will be pumped to Upper Seletar Reservoir eventually. Please keep our waters clean, do not throw anything into the pond.",
      "time": 1731985358,
      "translated": false
    },
    {
      "author_name": "Forest BK",
      "author_url": "https://www.google.com/maps/contrib/116448453673911455728/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL76LHGcdk_DWwI1Uwpxr5pFf5padq-ZcHhARkF7WFUdeyixQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "🌧️Pang Sua Pond is among the 16 stormwater collection ponds built to collect surface runoff rainwater from the surrounding to prevent flooding during heavy downpour.\n💧The water at Pang Sua Pond will eventually be pumped into Upper Seletar Reservoir for treatment.\nFun fact\n💢Pang Sua means \"weighing sand\"\nin Hokkien dialect.\nThe name is derived from the practice of weighing sand in the area in the past (early 1900s).\nLocal enforcement authority would escort lorries suspected of over carrying sands to Pang Sua for weighing to acertain it's stipulated carrying weight.\n💢Another explanation is that Pang Sua may means \"release sand\".\nThe over-carrying sand lorries were escorted to Pang Sua to release the excess sand.",
      "time": 1739255523,
      "translated": false
    },
    {
      "author_name": "M M",
      "author_url": "https://www.google.com/maps/contrib/114442474015223259254/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW_4QQENzuWN98dtXOT5v3r8LKw1RWpGVWh6IelmJH_Co90yjk9Nw=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "My Personal Review of Pang Sua Pond\nHaving recently visited Pang Sua Pond in Bukit Panjang, I was pleasantly surprised by how much this small urban wetland has to offer. Here’s my honest take on the experience:\n\nFirst Impressions\nAs someone who enjoys nature but lives in the city, Pang Sua Pond felt like a hidden gem. The moment I stepped onto the elevated boardwalk, I was greeted by a gentle breeze and the calming sight of water surrounded by greenery. It’s amazing how peaceful it feels, even though it’s right next to busy roads and HDB blocks.\n\nWhat I Loved\nThe Boardwalk: Walking across the pond on the elevated boardwalk was my favorite part. It offers a unique view of the water and the floating wetlands. I enjoyed stopping at the lookout decks to watch the fish and spot a few birds.\n\nCommunity Vibe: The area was lively but not crowded. I saw families with kids at the playground, joggers making their rounds, and elderly folks using the exercise stations. It really felt like a space for everyone.\n\nAccessibility: Getting there was easy-just a short walk from the MRT and linked to nearby malls. I appreciated that I could grab a coffee or a snack after my stroll.\n\nEvening Ambience: I visited in the late afternoon, and as the sun set, the boardwalk lit up with colorful LED lights. It added a magical touch to the whole experience.\n\nWhat Could Be Better\nSize: The pond isn’t huge, so if you’re looking for a long hike or a deep dive into nature, this might not be the spot. My walk around the whole pond took less than half an hour.\n\nShelter: There’s little shade on the boardwalk, so it can get quite hot during midday. I’d recommend visiting in the early morning or evening.\n\nFinal Thoughts\nPang Sua Pond may not be Singapore’s biggest or wildest park, but it’s a wonderful retreat for anyone living nearby or passing through Bukit Panjang. It’s perfect for a relaxing stroll, a breath of fresh air, or simply unwinding after a busy day. I left feeling refreshed and grateful that such green spaces exist in our city.\n\nWould I recommend it?\nAbsolutely-especially if you’re in the area or looking for a peaceful, community-oriented spot to enjoy nature.\n\nIf you want to include your own specific experiences or feelings, just let me know, and I’ll tailor the review further!",
      "time": 1747220198,
      "translated": false
    },
    {
      "author_name": "Ryan Edward (RyanEdwardFitness)",
      "author_url": "https://www.google.com/maps/contrib/105087236357597244946/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVgME_pMVqoBLFRgtjhKbXygdP6EMkEZBqstpB7jaobS1JWl1VC9w=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Pang Sua Pond in Bukit Panjang, Singapore, offers a serene escape for fitness enthusiasts seeking to combine outdoor activities with nature's tranquility. Surrounded by lush greenery, the pond provides an ideal setting for jogging, brisk walking, or cycling along its well-maintained pathways. The picturesque landscape serves as a refreshing backdrop, motivating visitors to engage in physical exercises while immersing themselves in the beauty of their surroundings.\n\nThe fresh air enveloping the area invigorates the senses, making each workout session a rejuvenating experience. Whether practicing yoga by the water's edge or participating in group fitness classes amidst the serene ambiance, Pang Sua Pond fosters a holistic approach to well-being, promoting both physical and mental health benefits.\n\nMoreover, the opportunity to observe diverse flora and fauna adds an enriching dimension to the fitness journey. Birdwatchers can delight in spotting various avian species inhabiting the pond's vicinity, while nature enthusiasts appreciate the harmonious coexistence of wildlife within the urban landscape.\n\nOverall, Pang Sua Pond encapsulates the essence of an urban oasis, where individuals can escape the hustle and bustle of city life to prioritize their fitness goals, connect with nature, and bask in the invigorating embrace of fresh air.",
      "time": 1711444230,
      "translated": false
    },
    {
      "author_name": "Loh Ricky",
      "author_url": "https://www.google.com/maps/contrib/105538701864779732018/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWz0qjSXYKJs3LPvkmfWi5SeUCRs6DjDuIj3D6vu8uK-t-6l_XS=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Beautiful park located in Bt Panjang Estate, not very big, but just nice to walk around after dinner.\nBridge is built around the pond, and the views are very nice at nite when the sky are clear.\nThe best view during the full moon period, children and elderly can walk and rest as there are bench around.",
      "time": 1700795973,
      "translated": false
    }
  ],
  "types": [
    "park",
    "tourist_attraction",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11664779493301780375",
  "user_ratings_total": 858,
  "vicinity": "101 Bukit Panjang Ring Road, Saujana Road"
}