{
  "formatted_address": "163 Tanglin Rd, #02-142/144 Tanglin Mall, Singapore 247933",
  "geometry": {
    "location": {
      "lat": 1.305035,
      "lng": 103.823845
    },
    "viewport": {
      "northeast": {
        "lat": 1.306505530291502,
        "lng": 103.8251393802915
      },
      "southwest": {
        "lat": 1.303807569708498,
        "lng": 103.8224414197085
      }
    }
  },
  "name": "Pano Kato Grill, Pizza & Deli",
  "place_id": "ChIJO6xj9rsZ2jERpOBCqhjX3Cg",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Rekha Krishnan",
      "author_url": "https://www.google.com/maps/contrib/115414214817730356944/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV1DOWvqs8n02rPZyvMuWZmsnZOeH3q9Al74-ffG7k8MYYVbxn3FA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "A great place for casual dining. The food is tasty and well presented. Service is quick. I went alone for lunch after some shopping and found that it was quite full, mostly other shoppers, some with babies in strollers :)",
      "time": 1747268451,
      "translated": false
    },
    {
      "author_name": "Fab Foodie Swede Malin Nordblom",
      "author_url": "https://www.google.com/maps/contrib/107062657007062713328/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUiibmrdYZC_0njkI_zLGd1hHVC_tIM-stmd1f4F6C2ByhrAra9=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "in the last week",
      "text": "The interior here is really nice, unfortunately it doesn’t match the overall experience. It takes really long to get the food most of the time. So if you are having lunch here, ask how long it will take so that you have time enough to eat. Some of their dishes are really good, like their spanakopita. The souvlaki is great sometimes, and other times not. I would recommend you to ask what they recommend when your there. The restaurant works great for family’s, friends and work.\nI like the place, but it needs a boost of energy..,",
      "time": 1747283040,
      "translated": false
    },
    {
      "author_name": "Isaac L",
      "author_url": "https://www.google.com/maps/contrib/103715143213981871749/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW7_o0-zDI4PyZaT3DKWSO0j1QEJkOss6_qP7JQnP6FXlKi1yGSoA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I'm absolutely delighted with this gem! The bohemian decor creates a relaxed and calming atmosphere, perfect for unwinding.\n\nThe service was impressively swift - our food arrived a mere 5 minutes after ordering! The tomato soup was a highlight, striking the perfect balance between flavor and richness.\n\nWhile the calamari was just average, the Greek burger was a pleasant surprise - its flavors exceeded my expectations! Don't judge this burger by its appearance; it's a hidden gem.\n\nUnfortunately, my daughter's salami pizza was overly salty, which was a letdown. One slice was enough for me - it was that salty!\n\nOverall, I'd give this place 4 stars. Despite the pizza mishap, the atmosphere, speedy service, and delicious burger make it a great spot to visit.\n\nWill be back for their desserts and to try others for sure.",
      "time": 1741347023,
      "translated": false
    },
    {
      "author_name": "GG K",
      "author_url": "https://www.google.com/maps/contrib/113182488876013163119/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJFHYPU6LcVzIMoSpThTDTStOqFYRiAlEmNoAPCaEDEixj2eg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "If you're looking for some tasty Mediterranean food, Pano Kato is the restaurant to go to. The prices are fairly reasonable for the location and ambience as well.\n\nWe tried the Dips with Pita (Hummus, Taramosalata, Melitzanosalata), Loukaniko, and Iberico Pork Ribs. I loved the dips here, it is above average as compared to the ones I've had at most places. Additionally, their pita was surprisingly good even when eaten cold. Unlike most places, their pita was still soft when we came back to this starter after we finished the mains. Both the pork sausages and pork ribs were also really flavourful! In particular, I enjoyed how tender the pork ribs were. While they also didn't have the typical BBQ flavour like that of the American ribs, they had their own tasty marinade.\n\nThe business here was rather good on a weekday lunch, but the ambience was good and not too noisy even with the crowd.\n\nOverall, I'd definitely be back if I'm in the area. Its location is pretty accessible as well, so this is a great Mediterranean cuisine option.",
      "time": 1746106384,
      "translated": false
    },
    {
      "author_name": "Soh",
      "author_url": "https://www.google.com/maps/contrib/112618833143204824221/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJIurc_oHBgJaFYH_W4FZAaI7HdhNLRYe16SW5La8E2TDEuCA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Here to give a birthday treat to my friend.   The ambience and deco of the place were very inviting.   Good place to relax.  I'm not a fan of Greek cuisine, but I was surprised how it turned out, yummy.   I played safe and ordered the spaghetti bolognese which I found so so only.",
      "time": 1734516701,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "meal_takeaway",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2944464757329158308",
  "user_ratings_total": 986,
  "vicinity": "163 Tanglin Road, #02-142/144 Tanglin Mall"
}