{
  "formatted_address": "37 Teban Gardens Rd, Singapore 600037",
  "geometry": {
    "location": {
      "lat": 1.3204625,
      "lng": 103.7428776
    },
    "viewport": {
      "northeast": {
        "lat": 1.321825880291502,
        "lng": 103.7443574302915
      },
      "southwest": {
        "lat": 1.319127919708498,
        "lng": 103.7416594697085
      }
    }
  },
  "name": "Paofan Paradise 泡饭天-T.K Kitchen",
  "place_id": "ChIJ__-PpKUa2jERpF99Ti667F8",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Jason Tan",
      "author_url": "https://www.google.com/maps/contrib/102278742016607759038/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXglR82JfYTv6A052RTMuW1mWCZ5PtQLJVxojJo3UjI1TksZxhkTw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "We came  here for dinner, and since there are only two of us, we can only order ginseng chicken rice and lobster hot pot. The total cost is $78. The ginseng chicken rice is hugh, and we could not finish it. The lobster hotpot is tasty, and we have the option to add vegetables or noodles to the soup but at extra cost. Recommended.",
      "time": 1746106247,
      "translated": false
    },
    {
      "author_name": "franco teo",
      "author_url": "https://www.google.com/maps/contrib/106033859449677169145/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUx_dVkFGiybg1PJKAcKN6I0uDY7tUN8W2zRnhv4rYBrgbtfa0YUg=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "We were excited to visit your stall for the first time after seeing the promotion for 5 small lobsters at $38. However, we decided to try the 4 medium lobsters for $49 instead. Unfortunately, our experience did not meet expectations.\n\nFirstly, we were served 5 lobsters instead of 4, but they appeared smaller than the advertised medium size. Secondly, the lobsters did not seem fresh, which was quite disappointing. We were charged $49, but the quality and portion did not feel justified.\n\nOverall, we spent $83.30 on a dinner that did not feel worth the price. What started as an exciting visit turned into a disappointing experience, and unfortunately, this will likely be our last visit. We wanted to share this feedback in hopes that you can address these concerns for future customers.",
      "time": 1743519175,
      "translated": false
    },
    {
      "author_name": "Yi Ling",
      "author_url": "https://www.google.com/maps/contrib/115707001285123682601/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUlkcK6FpBb-Q_EER2W7ON8uPix2iL97NAPchaAE0TxCULNloBN=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "Dinner here was quite the adventure! The Ipoh Hor Fun dish was definitely a surprise – a raw egg cracked right on top of slippery rice noodles with gravy.\n\nSeriously, huge portion for just $6.80; easily enough for two. And they weren't stingy with the ingredients at all.\n\nWe also grabbed the fried beef stir-fry to go with the rice, and wow, it was surprisingly authentic Chinese style with all those dried chillies, peanuts, and garlic. A real treat!\n\nThe luo han vegetables, though? Honestly, they were a bit of a letdown",
      "time": 1746709910,
      "translated": false
    },
    {
      "author_name": "E’leen Liew",
      "author_url": "https://www.google.com/maps/contrib/112850695929228641904/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJx59ETkBb4XPebf417RwvZ8ePc2Rv2Nbyy9zoQokbyQwe2tA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Paofan Paradise lives up to its name, offering a comforting and satisfying dining experience. The friendly staff and prompt service made us feel welcome. The highlight of our meal was undoubtedly the large lobster hot pot. Generously portioned with three large lobsters, each cut in half, it was perfect for sharing. The broth, while undeniably delicious, was a touch salty on its own, but easily balanced with the other dishes.\nThe sides were equally impressive. The cai pu omelette was cooked to perfection. The sweet and sour pork was a hit with the kids, a testament to its well-executed flavors. The hotplate beancurd, made with homemade tofu, was a pleasant surprise – soft, flavorful, and a clear indication of the chef’s commitment to quality. Finally, the stir-fried dried shrimp with French beans was a savory delight, adding a nice textural contrast to the meal.\nWhat truly sets Paofan Paradise apart is its affordability. Despite the generous portions and quality ingredients, the prices were surprisingly reasonable. If you're looking for a delicious, hearty meal served with a smile, Paofan Paradise is definitely worth a visit.",
      "time": 1743330151,
      "translated": false
    },
    {
      "author_name": "tan adam",
      "author_url": "https://www.google.com/maps/contrib/109188017494978942959/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUjDpCz8J5WRlMp8kPYgNrJBnYssxGSPhpk7FXnDpWdXaZOmADZ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "It's unbelievable! A lobster pot of this level is only $38! I'm sure this is the only place in all of Singapore that offers this!\n\nAnd it's not just one or two lobsters, but 5 whole lobsters, and they're not small either! The highlight is not just the freshness, but also the incredible taste. The lobster is served with a flavorful la la (clams) broth, and the sweetness of the lobster pairs perfectly with the broth, making it a dish that's both delicious and filling!\nTheir herbal chicken paofan is also an absolute must-try! The chicken is tender, juicy, and full of herbal flavor, and when paired with the paofan, it's simply divine! I love it so much! I'll definitely be back to visit them again, and you shouldn't miss out either!",
      "time": 1739364769,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6912104236154970020",
  "user_ratings_total": 158,
  "vicinity": "37 Teban Gardens Road, Singapore"
}