{
  "formatted_address": "3 Mount Elizabeth, Level 1, Singapore 228510",
  "geometry": {
    "location": {
      "lat": 1.3048385,
      "lng": 103.8360498
    },
    "viewport": {
      "northeast": {
        "lat": 1.306211430291502,
        "lng": 103.8373200302915
      },
      "southwest": {
        "lat": 1.303513469708498,
        "lng": 103.8346220697085
      }
    }
  },
  "name": "Parkway Radiologic Clinic",
  "place_id": "ChIJ6ycMV5IZ2jERcCZJrsO9rM0",
  "rating": 2.1,
  "reviews": [
    {
      "author_name": "Flying Molen",
      "author_url": "https://www.google.com/maps/contrib/113209867782143825808/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXoorOWogloQs6l9Imv1chNpScyyLnvHdIM3tcBmqRYMJ6wtBg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "My experience with this radiologic clinic was fantastic! The moment I arrived, I was greeted by a very friendly and soft spoken staff, went through my appointment document, verified my identity, and guided me to the waiting area. The waiting area was spacious and not crowded. They even had a waiting area for female patients! In addition, there was a robot doing the floor cleaning and sanitation regularly with calming music. I was not expecting a great experience before I arrived due to the poor experience with at laboratory service yesterday. But I was wrong 😅 the service here was totally different from lab. The radiologists were also very friendly and professional. Briefed me on the process before starting, deeming the light to make me feel comfortable, advised me every step before they did it. Thumbs up for the service and professionalism 👍🏻\nI have also found a good parking building nearby and it’s Square 2. Plenty of parking lots and reasonable rates.",
      "time": 1746502088,
      "translated": false
    },
    {
      "author_name": "Yellow Bear",
      "author_url": "https://www.google.com/maps/contrib/104489311735261065689/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXJw6wU_ViJ96j0KUowLXVVtxYUueaV518tEdvuXXsBsEMiDzjh=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Accompanied my mom to do her annual mammography examination at Mount Elizabeth Medical Centre.\nFriendly and efficient service, without having to wait too long.",
      "time": 1744165582,
      "translated": false
    },
    {
      "author_name": "Ferlene Tan",
      "author_url": "https://www.google.com/maps/contrib/101055863949320274830/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI_ECuaeUipZveeHitJhAHz1sOD-qAwUfHsJQKt6UCf2Za7nA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 weeks ago",
      "text": "I have posted this review under Mount Elizabeth Hospital, and but the precise operator name is Parkway Radiology. The visit was on 14 September 2023, since then I told my doctor to not to arrange my scan with them after suffering years of poor services. Below is my review:\n\nIf you have option to perform ultrasound or mammogram elsewhere, do not consider here. Even you have appointment, they do not serve you at appointment time, people who appointment time later than you gets ahead of you, I only realized after waiting for 2 hours and started pressurizing them. It is so irony to watch the registration staff negotiating with people whose they promised that they are next in line but have to push back theirs because their appointments were supposed to be 30mins later, and need to slot in me because my appointment has past 2 hours. Imagine I have not done anything, I probably have more people cutting my queue, and continue to wait like a fool. And that is not all, after promising I will get my report before 2.30pm, without surprise they failed their promise, gaining prior experience I pressurized them since being too understanding is not appreciated. After repeated pressure, from doctor is typing the report, to doctor need to approve the report, to the final “reason” doctor has approved the report, but required 15mins to print the report? Type writer era? So if you have to use them, it probably doesn’t pay to be patience and understanding.\n\nIf you do not wish to put up their crappy service, you can go for a nearby radiology center, which is far more professional and efficient radiology centre, Radlink Women Imaging, recommended by my doctor. I also posted my review there.",
      "time": 1746419833,
      "translated": false
    },
    {
      "author_name": "Jessica Tham",
      "author_url": "https://www.google.com/maps/contrib/108675740046127314333/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV4g1Dv4Xn978UYwMLg_ZtdUMLSsnR1JYxx4w2JYXEUAcAuhw8=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "This clinic is ridiculous. I had appointment at 145pm , I came early, registered again 1:15pm. I asked if I could start early since they want me to register early, they say cannot. My appointment slot is scheduled at 145pm, and to come back later. So I went for a quick lunch at Kopi Tarts which was right beside the clinic, and came back at 1:40pm.\n\nWhen I got back, I have to wait until 230pm to get my MRI scan. Which was absolutely ridiculous. Because when I came early, they refused to let me proceed with my MRI scan, and when I came on time after, they did not proceed as per my \"scheduled appontment\" and worst of all, they delay my scans until 230pm. I only completed scans at 315pm.\n\nPoor time management team. Considering everyone who come for MRI scans pay at least 4 digit figures, they should be more professional. Time is money. We have plans too, for other appointment.\n\nRecommend to go OHM Radiology department, is where i did my 1st scan. Super professional, on time, and quick with any insurance payments or claims.",
      "time": 1738903161,
      "translated": false
    },
    {
      "author_name": "Soo Hin Yeoh",
      "author_url": "https://www.google.com/maps/contrib/115725392210756907778/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU2PxZdePLN6KfbRZcCRfadZ-BteadpVWxc9uVeElpTVcapzgAuIA=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "Located at the entrance of Mount Elizabeth Hospital & Medical Centre at Orchard, this is a modern radiology imaging centre doing MRIs and X-Rays.\n\nAlthough staff were generally professional and friendly, waiting times can be quite long depending on the time of visit, up to 90-min to complete X-Rays and Ultrasounds.",
      "time": 1712978539,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14820429121909761648",
  "user_ratings_total": 35,
  "vicinity": "3 Mount Elizabeth, Level 1, Singapore"
}