{
  "formatted_address": "3500A Bukit Merah Central, Singapore 159837",
  "geometry": {
    "location": {
      "lat": 1.2821069,
      "lng": 103.8182785
    },
    "viewport": {
      "northeast": {
        "lat": 1.283491730291502,
        "lng": 103.8195650302915
      },
      "southwest": {
        "lat": 1.280793769708498,
        "lng": 103.8168670697085
      }
    }
  },
  "name": "PASTA PAPA",
  "place_id": "ChIJnf6NNk4b2jERMdthSYmNS2Q",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Madhu M.",
      "author_url": "https://www.google.com/maps/contrib/104475516303642123147/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUa4PMcRqDK-pEGxPsfUp2pK6PsFjkQLIEZVriQrP1VLZUXulZR=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Stumbled upon Pasta Papa at Bukit Merah Central—a delightful hidden gem in our neighborhood. This cozy Italian café offers a variety of classic pasta dishes and even a fun \"Cook Your Own Pasta\" experience. Our family enjoyed an affordable and delicious meal, and the kids had a blast!",
      "time": 1740311081,
      "translated": false
    },
    {
      "author_name": "Qin Hui",
      "author_url": "https://www.google.com/maps/contrib/105641097671049891222/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUK6Y8ahtpGYXLphjBKvxLlKdKpSmUvaggfBSRpzNKFI5VZBC-o=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I recently visited Pasta Papa and it was an outstanding experience! The food was flavorful and beautifully presented, showcasing smoked duck agilo oilo, carbonara and crab meat risotto, that were cooked to perfection. Each bite reflected quality ingredients and careful preparation.\n\nThe service was equally impressive. The staff were attentive, friendly, and efficient, ensuring we felt welcomed throughout our visit. They anticipated our needs without being intrusive and were knowledgeable about the menu.\n\nOverall, Pasta Papa exceeded my expectations with its exceptional food and warm service. I highly recommend it to anyone looking for a memorable dining experience.",
      "time": 1735539754,
      "translated": false
    },
    {
      "author_name": "Trina H",
      "author_url": "https://www.google.com/maps/contrib/113239210373038615446/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI5g5xwBF-BMmtBJNeJujpHnFKmx591KH6Z9MvAp431AK0ndQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Staff were attentive and came to check on us regularly to make sure we’re ready for our next dish! Also opt for cook your own pasta and he patiently guided us along the way. Nice experience!",
      "time": 1735025406,
      "translated": false
    },
    {
      "author_name": "Botak",
      "author_url": "https://www.google.com/maps/contrib/100060791396189603978/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWfsNJL_9MaqRxsVqYx2XckgZM0kYCDmg-psewEikwOtSCoYDb8=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "Opened by a KOL (Lukey) and his Vietnamese wife. Good concept where u could cook your own pasta, but I think it was not appropriate for a weekday lunch crowd since we needed to eat and run. It's probably good for kids and during times when you didn't need to rush\n\nInterestingly, it was located in an isolated sports complex,  which I didn't even know existed.\n\nThe food was tasty, except for the Vongole. My colleague said that the pasta was undercooked and could still taste the raw flour taste, she couldnt taste any white wine, and there was not enough sauce. Also, we felt that the price was a tad bit high in a non air-con cafe.\n\nBut the staff does make every effort to answer your enquiry and serve fast, despite the lack of manpower.\n\nLast note, as of Apr 2025, there is no card payment nor paywave except via qr code scanning (PayLah or Paynow)",
      "time": 1744512601,
      "translated": false
    },
    {
      "author_name": "Jeffrey Ng",
      "author_url": "https://www.google.com/maps/contrib/114361573681952194788/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWvi97y0OofD-sq8htXf_HmWodTJSSuPWnkm1EcBUnAn-U_v0MgHA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "Pasta Papa @ Bukit Merah Central – A Local Spot with Hits and Misses\n\nStumbled upon Pasta Papa at Bukit Merah Central and decided to give it a try to support a local business. The menu looked promising, offering a mix of pasta dishes, risottos, and sides, but the overall experience was a mixed bag.\n\n🔹 Dirty Fries – The last dish to arrive, coming after we had already finished our mains. That said, the fries were freshly cooked, crispy, and paired with a tasty sauce that added a nice touch. A decent side, but the timing of the service could be improved.\n\n🔹 Mushroom Soup – Disappointing. Watery, bland, and lacking the flavor you’d expect from a good mushroom soup. Honestly, don’t even bother with this one.\n\n🔹 Truffle Risotto –Some prefer their risotto soft and creamy, while others like it with a bit of bite. Unfortunately, this one leaned towards the firmer side, which didn’t work for me. The truffle aroma was present, but the texture threw me off.\n\n🔹 Aglio Olio Pasta – Another letdown. The pasta itself was flavourless, with all the seasoning seemingly concentrated on the meat. Aglio olio is meant to be simple yet packed with garlicky goodness, but this version missed the mark entirely.\n\nOverall, Pasta Papa has potential, but the execution of some dishes leaves much to be desired.\n\nHopefully, with some tweaks, they can refine their offerings and improve the dining experience.",
      "time": 1743301780,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7227025647827278641",
  "user_ratings_total": 204,
  "vicinity": "3500A Bukit Merah Central"
}