{
  "formatted_address": "Blk 650 Pasir Ris Drive 10, #01-66, Singapore 510650",
  "geometry": {
    "location": {
      "lat": 1.3788403,
      "lng": 103.937942
    },
    "viewport": {
      "northeast": {
        "lat": 1.380107880291502,
        "lng": 103.9392323302915
      },
      "southwest": {
        "lat": 1.377409919708498,
        "lng": 103.9365343697085
      }
    }
  },
  "name": "PCF Sparkletots @ Pasir Ris West Blk 650",
  "place_id": "ChIJN5n6Ir492jERZcNXFBt9vio",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "Lila Pattinson",
      "author_url": "https://www.google.com/maps/contrib/105667061039367613106/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUghV3pljzEbbEZfvmpj7Bb7vsfs1IcOBCUH3j48fq6RbVL5A05lw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "I enrolled my daughter in this school when she was an infant and continued until she completed half of N2.  Transferring her to another school was a difficult decision for us, especially since we have moved and the travel distance is quite challenging.  My daughter loves going to this school, and the teachers there are wonderful and nurturing.  Another positive aspect is that the teachers there remain consistent, allowing my child to become accustomed to seeing the same familiar faces at school..",
      "time": 1746369072,
      "translated": false
    },
    {
      "author_name": "Brendaa Tan",
      "author_url": "https://www.google.com/maps/contrib/118279855417082426442/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKKlmqNAcRf8S0YOD5m3O92IKSPELPyWzAaHA8YIBgE1fsA6w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Thanks for the great experience. My daughter has been in great care for the past 3 years and counting. She also shared her daily experiences with me and my husband after school with enthusiasm. The Teachers have been working here for many years and are very experienced and patient with the children. Even though we have to travel a little to send her to school everyday, it is worth the trip as my daughter enjoys going to school.",
      "time": 1728280862,
      "translated": false
    },
    {
      "author_name": "Jeanette Leong",
      "author_url": "https://www.google.com/maps/contrib/106096055040980055664/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWoQ_Mx3blqLIElvfKCHPHOf3TWiaygt28hv2kEQLy05g1K3h9O=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "My son attended this branch for a few months. He would cry traumatically every time we brought him there. I've seen and heard caretakers inside telling the kids to \"sit down and shut up\". In the mornings, the kids are forced to just quietly at the table. During dismissal, they are chucked in a room to watch tv while waiting for parents to pick them up.\nDuring outdoor times, I've seen them brought to the void deck and caretakers are generally disengaged. I've seen them made to sit in a line and pass a ball along. Very boring.\n\nI pulled my son out of the school after a few months due to the terrible conditions. It's been 4 years since the experience. I live in the neighbouring block, and as I WFH, every morning without fail, I will hear several children scream and cry traumatically when they are being dropped off. I feel so sorry for the children who are put in this branch of PCF SparkleTots. It must be terrribly traumatic for them. The caretakers put on a show during the parent-teacher meetings and open house, but I've seen the reality of daily operations. I can hear the screams and cries every day.\n\nI know it is normal for some children to cry when dropped off. I heard cries with the new school I placed my son in, but it was never at that level of intensity and trauma / fear.\n\nIn stark contrast, the new school I enrolled my son in allows for open play time before/after classes where they can roam and mingle freely (pre-covid days) with others and enjoy social interaction. Outdoor times are more interactive and genuine.\n\nIs this the level of care and professionalism that government pre-schools offer??",
      "time": 1677115415,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3080036750426882917",
  "user_ratings_total": 3,
  "vicinity": "Blk 650 Pasir Ris Drive 10, #01-66"
}