{
  "formatted_address": "11 E Coast Rd, #01-15/16 The Odeon, Singapore 428722",
  "geometry": {
    "location": {
      "lat": 1.3044863,
      "lng": 103.9019834
    },
    "viewport": {
      "northeast": {
        "lat": 1.305781030291502,
        "lng": 103.9034145802915
      },
      "southwest": {
        "lat": 1.303083069708498,
        "lng": 103.9007166197085
      }
    }
  },
  "name": "Pebbles Kitchen",
  "place_id": "ChIJpc6DwvUZ2jERHkkvB-HSDA8",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Leshel",
      "author_url": "https://www.google.com/maps/contrib/102281125466289921480/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXRQo_lHSlmK1Pm3A2ZCfjHKZE0J9WFpx5dRBYdTRq7C0OlZHvBHA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Pebbles Kitchen is an absolute gem! From the moment we stepped in, we were welcomed by Melvyn and Sharon, who made us feel right at home with their warmth and genuine hospitality. The ambiance is cozy and inviting, creating the perfect setting for a memorable meal.\nTheir signature Mee Siam is simply outstanding! Flavorful, rich, and perfectly balanced, it’s easily the best I have tasted! And don’t miss out on the coffee and desserts, there are plenty of varieties to choose from.\nPebbles Kitchen is a must-visit. I am definitely recommending it to my family and friends for that reliable, satisfying meal!",
      "time": 1729863873,
      "translated": false
    },
    {
      "author_name": "rachel reuben",
      "author_url": "https://www.google.com/maps/contrib/113646565649786115863/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ2mIcJVpuS8nA4ouJO0_RZWM-B_j8tOpzJnZFTynwEqGubrg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Such a cozy little place! We popped by recently and were really impressed by how flavourful the food was. We had the cream pasta and chicken with rice, both were delicious and we enjoyed every bite!\n\nA special shoutout to Melvin for his excellent service. We had ordered coffee and we actually wanted iced. Melvin was super kind and immediately offered to replace them. He even checked if we were okay to keep the hot ones since they would otherwise go to waste.  We really appreciated that thoughtfulness for not wasting it. We were prepared to pay for both, but he didn’t charge us for the hot coffee, which was such a lovely gesture.\n\nBig thanks to both Melvin and Sharon for the warm and friendly service. We’ll definitely be back!",
      "time": 1747181018,
      "translated": false
    },
    {
      "author_name": "Joanna Gabriel",
      "author_url": "https://www.google.com/maps/contrib/109807846443059956622/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX4Cbajq94rUW8fiF-RO7pRMJLEaCz0fBMGRT8mEftifwByfe9T=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Absolutely wonderful place in every way! The owner and staff are welcoming, the space is filled with light and also offers outdoor seating, and the menu has a thoughtful range of Western and Asian heritage dishes as well as a variety of pastries. I had the Lontong soup which was a delicious spicy curry broth with rice cakes, tender steamed veggies, and hard boiled eggs that melted into the soup. It was what dreams are made of! I had trouble deciding between that and the signature Mee Siem soup. Sharon described the difference in flavor, and then offered to let me taste both broths before deciding (photo here). Honestly, tasting both made me want both!!! They were unique - one sweet and sour with depth of flavor, and the other creamy curry with heat. I decided on the Lontong because of all the vegetables in it. Just as I was very happily finishing my bowl, Sharon brought out a small bowl of the other soup for me to try with the noodles and garnish. I wish I could have finished it all and will definitely be back! The hospitality was so warm and genuine, and that shows in how good the food is. A new favorite spot for sure!",
      "time": 1728132227,
      "translated": false
    },
    {
      "author_name": "Manli Y",
      "author_url": "https://www.google.com/maps/contrib/110043937928523914465/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWldosSqRZu6MgbkwWOiJWgDYnNaB0lq2D5qIsxFb5g5GifcaQp=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Home made Garlic bread is a must try! Affordable price and right portion, worth to try when you’re in Katong area! Note on the operating hours!",
      "time": 1743750709,
      "translated": false
    },
    {
      "author_name": "timothy fong",
      "author_url": "https://www.google.com/maps/contrib/106256209625309738452/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKT0lHmeDhy7Hew6umFny-D5kzEBqKt_utNEjEQQ6XnXiJIOQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Melvin and Sharon were cheerful, friendly and welcoming. The food was really tasty and we visited two days in a row! Highly recommend the signature grilled turmeric ginger chicken (amazing sauce), the curry chicken set (weekend special), and the hearty Signature Mee Siam. The prune cheesecake was nice and the slice of coconut cream cake (Sharon generously gave) was really good!",
      "time": 1729418147,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1084473474219460894",
  "user_ratings_total": 79,
  "vicinity": "11 East Coast Road, #01-15/16 The Odeon"
}