{
  "formatted_address": "1 Woodlands Rd, #01-01 Junction 10, Singapore 677899",
  "geometry": {
    "location": {
      "lat": 1.3801217,
      "lng": 103.7603527
    },
    "viewport": {
      "northeast": {
        "lat": 1.381564680291502,
        "lng": 103.7618940802915
      },
      "southwest": {
        "lat": 1.378866719708498,
        "lng": 103.7591961197085
      }
    }
  },
  "name": "Pet Lovers Centre",
  "place_id": "ChIJTXT5XbwR2jERXp2Kfw9T-ng",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Von Ho",
      "author_url": "https://www.google.com/maps/contrib/116251873002912962618/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIzbqbJvuXGpPZYU7cJlHsegKaatzS2kGkzSmD6DXGQqKgQCg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I always come to this outlet even though it is not as well-connected to public transport compared to other outlets, mainly because of the stellar service. Ms Eileen Chan is always friendly, warm and goes the extra mile to help check which nearest outlets have stock if I am looking for something and it is not available here. PLC's prices for many items are honestly slightly higher than other industry players, but Eileen's service excellence gives the shopping experience a human touch that online shopping cannot provide, making me a happy returning customer!",
      "time": 1734441612,
      "translated": false
    },
    {
      "author_name": "Elvin Chan",
      "author_url": "https://www.google.com/maps/contrib/110881221180938039206/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKc8J8B--ryHX70CmUAff5wNMpRS1fbmkvYluUzTd_5HmRMng=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "31/1/2025\nI went to hillion mall to ask if they had hamster but sold out. I asked the staff if she could help me call junction 10 outlet and they said they had 2 left.\n\nI asked the staff wat time junction 10 outlet closed, they replied 930pm.\n\nI walk to junction 10 from hillion and I was very excited to buy for my kids one hamster.\nI reached junction 10 outlet at 9.15pm. It's stated closed. I knock the glass door and asked them to open as I really need to buy one hamster for my kids and I told them hillion staff said that you guys closed at 930pm. After that I reconfirm with the store auntie at junction 10 she replied oh no we close at 920pm. On the spot I see my phone it stated 919pm. I mentioned that I wanna buy a hamster but she said oh sorry we already do settlement and can't sell hamster to me? Other stuff like pets food or items can buy but only paying by cash.\n\nI told them I really need to buy for my daughter one hamster but they said they can't sell.\n\nI am really disappointed as I walked all the way from hillion mall to junction 10 and Google stated junction 10 shop closed at 930pm. I reached there 9.15pm is already closed!\n\nReally bad experience!",
      "time": 1738331168,
      "translated": false
    },
    {
      "author_name": "Jiakali",
      "author_url": "https://www.google.com/maps/contrib/102035125554561466232/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUdEzY9SUqof-thdL19sNIfBDbZKbeChZJRya5j5chBe37SIRz5lg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 years ago",
      "text": "I would usually get my pet stuffs online, but I was looking for some perfume for my dogs as the weather is hot, and my dogs tends to smell easily. so have decided to shop physically and went to this store that near my place.\nWas greeted with a very warm welcome upon entry and ask if I needed help.\nSo I went on to let the staff know what I am looking for. I were introduced to this product called “isle of dogs odour neutralizer” and follow by this range shampoo, “violet and mist” and get to know more of these products, I decided to get it upon I smell it!\nMy needs were addressed and several great recommendations were made for my fur baby.\nI will definitely returned for the top notch service I received!",
      "time": 1543584435,
      "translated": false
    },
    {
      "author_name": "Cheryl Wu",
      "author_url": "https://www.google.com/maps/contrib/110844977872280020051/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJOW91U2A1C9ICm9VdP2hJvJg3qngehy___4B-y11VOZsd8_w=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "9 months ago",
      "text": "Referred from Lotone branch. Before I came down to junction 10 branch, I called in and double confirm on product availability and reserve it.\n\nDrove all the way down, after making payment, realized that the size was wrong. (Within a span of 5mins.) Went back to ask for refund but was asked to bring down to Holland branch to exchange instead.\n\nSpouse who was with me was feeling puzzled and ridiculed when it was your staff who got the item wrong, wasted our petrol and time and parking, and we cannot asked for a void and refund when it was just a 5 mins interval transaction.\n\nEventually, your staff (Dora) gave a call to the manager and void the transaction. Only then we came to realise it was she who did not know how to void the transaction.\n\nThe whole experience did not really leave an unpleasant aftertaste for me. However, I felt that your staff was undertrained (if I did not heard wrongly, she said something about new) and I will not risk going down to this branch again. Time & money is precious for me.\n\nFYI, your branch at Holland were even WORST!!!",
      "time": 1724395737,
      "translated": false
    },
    {
      "author_name": "Seto LEK KEONG",
      "author_url": "https://www.google.com/maps/contrib/111399448474235238583/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJCVhUsLdXEK8F61F5F8YzhTMo0x-Th8ICxzTDLsDjVwUEuYQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "We bought 2 hamsters from this shop and thanks for staff Eileen:) v knowledgeable and passion for animal whom herself keep lot of pet too. Instructions is v clear and pre warned what the challenges of keeping hamster which kids need to know and agree:) Hope she will work there long to be great help to customer:) thanks Eileen!",
      "time": 1661149243,
      "translated": false
    }
  ],
  "types": [
    "pet_store",
    "store",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8717371354758421854",
  "user_ratings_total": 38,
  "vicinity": "1 Woodlands Road, #01-01 Junction 10, Singapore"
}