{
  "formatted_address": "4 Waringin Pk, Singapore 416318",
  "geometry": {
    "location": {
      "lat": 1.3222328,
      "lng": 103.9181562
    },
    "viewport": {
      "northeast": {
        "lat": 1.323511280291502,
        "lng": 103.9195335302915
      },
      "southwest": {
        "lat": 1.320813319708498,
        "lng": 103.9168355697085
      }
    }
  },
  "name": "Pet Care Centre & Clinic",
  "place_id": "ChIJnQnHxasi2jERN03dO5KASk4",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "DeniseSidabian Mahone",
      "author_url": "https://www.google.com/maps/contrib/113095859721448162776/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUprvMbqDhPh4QqDaNvn-qh5zTHuf7FfUPcywkOfo3daOBg1lli=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "7 months ago",
      "text": "Horrendous experience with this entire clinic. Equipments are rusty, place is messy and dirty. We gave it the benefit of doubt seeing the positive reviews and trusted them to the care of our little puppy who’s only 6 months old.\n\nOur baby visited the vet twice in a month. First time was recommended a bunch of medications which we were told by them that our baby’s suffering from this that. We blindly followed the vet’s instructions as we thought our baby was truly ill. After feeding him for 3 weeks, he only got worse.\n\nWe had to go back to them again for further check up. This time, only after 2 days since the visit, our baby was sent to emergency hospital due to excessive vomiting and lost of appetite.\n\nIt was at around 7pm last night that my puppy was admitted to the hospital. Called this clinic up to request for the medical records of my puppy (two visits in one month) the PINOY nurse made it so difficult to retrieve the information, claiming that we have to pay money in order to get the full report.\n\nMind you, I’m not asking for years of report, it’s only been a bloody month and you can’t provide us? Also over the phone she sounded nasty and was telling me that the doctor is having his dinner now and will write the report for us later.\n\nSorry pinoy, I’m just curious. Is my puppy’s life more important or your doctor’s dinner?\n\nVet gave injection to our puppy and made us buy a bunch of medications yet again on the second visit, asked for money to retrieve medical report. Medical report received with no clear indications of what was given to my puppy.\n\nPlease steer clear from this clinic at all costs.\nMy puppy is still in the ICU with infected lungs & on drip.",
      "time": 1727763150,
      "translated": false
    },
    {
      "author_name": "Joeey",
      "author_url": "https://www.google.com/maps/contrib/113758676807910821916/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVvvB3uHrW1snd8cjVtSTVDcUv1QvhLUZaoYm9qr-RYoT7eKAUK=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Went for a vaccine and Dr is very professional and explaining everything in detail. Treating my puppy very well. The nurses are also very experienced and knowledgeable, thumbs up 👍🏻",
      "time": 1742747648,
      "translated": false
    },
    {
      "author_name": "Phong Phan",
      "author_url": "https://www.google.com/maps/contrib/109765435100592142518/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWbj_x-PILXZFFPod531bmebRIpiQ3AqIZfkdPWy4t_0_bB-qwJ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "7 months ago",
      "text": "It’s rare for me to write a review, but I feel compelled to share my experience here, especially since the merchant cannot delete reviews from Google.\n\nI visited this clinic twice. The first time was for heart deworming (ProHeart), and the second was for skin issues and coughing. Both times, they heavily pushed additional medicines and supplements, which I bought and gave to my dog. After the deworming, my dog developed a cough and worsening skin conditions, which led us to return for further examination. The doctor kept reassuring us, saying, “He’s a very healthy dog with a strong heart and lungs—nothing to worry about, just a minor skin issue.”\n\nTwo days after the second visit, my dog's condition deteriorated. He began vomiting non-stop, lost his appetite, and became extremely ill. We rushed him to an emergency vet, where an x-ray revealed he had pneumonia. Half of his lung appeared white on the x-ray. This was shocking, especially considering the previous vet had claimed his lungs were perfectly fine—after just touching him and making casual judgments.\n\nBeyond the misdiagnosis, we encountered further issues when trying to obtain my dog’s medical report for the emergency vet. They could only provide the details from the most recent visit, claiming they couldn't retrieve information from the first visit. To top it off, they asked us to come in, pay a fee, and sign something—without clear explanation. When we pressed them, we were told, \"The doctor is having dinner right now, and he’ll get to your report later.\" This was unacceptable, especially when we were in the middle of an emergency with our pet.\n\nEven after I agreed to take my dog to the hospital and return to sign, they continued to give us a hard time. Eventually, the emergency vet staff had to call them, and they still demanded signatures and made the process unnecessarily difficult. In the end, they only sent over part of the medical report, which was shady and unethical.\n\nThis clinic operates in a dirty, home-based environment in a residential area. Despite living nearby, I will never return, and I will make sure to warn everyone in my network about this experience.\n\nPlease, avoid this place at all costs!!!\n\nRemark: My dog is still in the hospital (see my pic attached), and thankfully, there are no signs of adverse reactions from the most recent treatments or medications given. Unfortunately, I cannot comment on the first batch of medications, as I was not provided with that information. Additionally, the receipt didn’t specify which medications were administered.\n\nMoreover, the communication we received from the clinic staff over the phone was deeply concerning and unprofessional. Furthermore, the misleading statements from the doctor regarding my dog’s condition were not only inaccurate but potentially dangerous.\n\nAccording to the emergency vet, any issue related to the lungs and heart is considered life-threatening—yet the doctor at the clinic reassured us that everything was fine. It's alarming to think how serious the situation could have been given the doctor's casual assessment.",
      "time": 1727766161,
      "translated": false
    },
    {
      "author_name": "Jareth Teo",
      "author_url": "https://www.google.com/maps/contrib/104233028434744184151/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJzOiyUZi2XQ10mk_pleBu04-NGsUX0kMRATwVJCU6SSHOhDg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "I brought my dog to their clinic for a check up as he loss his appetite and was very much less active then usual. Sent him for the check up and the vet said there was nothing wrong with him and just prescribed some medicine. A few months later he was completely lethargic so we brought to another vet which informed us that he had stage four cancer. Due to this vets ignorance and laziness, it was too late for my dog and he passed away. They failed to detect the cancer and instead wasted our money saying it was just small infections and would go away. Unreliable and just horrible morals. No one should go to this vet.",
      "time": 1734592273,
      "translated": false
    },
    {
      "author_name": "Stephanie S.",
      "author_url": "https://www.google.com/maps/contrib/108330575010170098345/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVUEF1DiBhmGolJh6zRj-HUZSa8Kj3EItGfs36tIK3t8jaHYfTRfw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Reasonable price! Brought an injured community cat over for an infected wound as a result of cat fight and fever. Dr Ng, Annie and Sarah are really knowledgeable and friendly. The vet provides hospitalization service which he needed and cared for him well throughout the short stay.",
      "time": 1654866636,
      "translated": false
    }
  ],
  "types": [
    "veterinary_care",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5641462848792907063",
  "user_ratings_total": 59,
  "vicinity": "4 Waringin Park, Singapore"
}