{
  "formatted_address": "26 Jurong West Street 61, Singapore 648201",
  "geometry": {
    "location": {
      "lat": 1.3385876,
      "lng": 103.6990153
    },
    "viewport": {
      "northeast": {
        "lat": 1.339811030291502,
        "lng": 103.7001893302915
      },
      "southwest": {
        "lat": 1.337113069708498,
        "lng": 103.6974913697085
      }
    }
  },
  "name": "Pioneer Polyclinic",
  "place_id": "ChIJg00sHI4P2jERuPe3tEtgCvw",
  "rating": 3.1,
  "reviews": [
    {
      "author_name": "Danial Durham",
      "author_url": "https://www.google.com/maps/contrib/110937775105095219457/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ7FB5hT423Y9a7O7xVuyfnRP8q05pfzsSZd1nNmPgt_q-61g=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "My appointment on 1.3.2025 is at 8.30am. Upon arrival, the weighing and height counter is not functioning. Waited till 8.50 and see the doctor and was prescribed with just one box of lozenges for my sorethroat. Waited almost 40 mins for the pharmacy to issued me the box of lozenges. There were not many people as it was a Saturday. I have to alert the manager (female non hijab wearing malay sitting at the front counter) about the delay in issuing my medication or else i have to wait much more longer for a simple task to be done by the pharmacy staffs to issue just a box of lozenges medication to me. Very inefficient and cannot be bothered attitude display by the staffs. Total ridiculous amount of waiting time for such a simple task !! Should change the whole pharmacy management especially the higher ranking ones. More better outsource the management of this pharmacy to another reliable pool of workforce.",
      "time": 1740812820,
      "translated": false
    },
    {
      "author_name": "Tan Junhong",
      "author_url": "https://www.google.com/maps/contrib/108052765922063773046/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ1oUaWNriZgE_wPk3Ft23-WlEZYU4nVAA7FIcK4WF8_kn_Nw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "My appointment was at 11.10 , arrived at 11.05 . Waited for 20 mins and still no call on my number, ask nurse when its my turn and they twll me still got 4 more patient in front even tho 8 came earlier then them . Pls lah if ya cant fix the system then ya might as well don't ccall ya self a flipping polyclinic .",
      "time": 1747108142,
      "translated": false
    },
    {
      "author_name": "Shazz",
      "author_url": "https://www.google.com/maps/contrib/117925424869874884126/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVc4KjHrtop_VdNOAJIJkyKKK3GqwhCdraxSMQ6F-J6d1KVWmQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "2 months ago",
      "text": "One of the Polyclinic that I could easily get a next day appointment though it a tad too far from where I am. The few visits here I didn’t wait too long for my doc consultation. The young doc who attended to me were all professional and and usually no small banter on the side which means the consultation I had usually lasted just less than 10 mins. The wait to get my medication is a different story. The scan for ID is usually frustrating for me in that it can’t scan my NRIC barcode from the NUHS App. I don’t have any paper registration chit and which means most times I have to fish out my actual NRIC card for the scanning. Perhaps the management needs to look into improving this. I don’t think I am the only having this exasperating experience judging from the people who were ahead of me trying to scan. Today I waited more than half hour to collect my medication. At Queenstown Polyclinic, I would have collected in less than half the time and with leas pharmacy staff working.",
      "time": 1740646104,
      "translated": false
    },
    {
      "author_name": "Wilson Chang",
      "author_url": "https://www.google.com/maps/contrib/102589058598808274925/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL-vSXjFi0PgWtWv9WneTaljLWq2hldwR7n8loebb8nf3h2GWAe=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Update on Tuesday, 5 December 2023\n\n1st time here for both Non-Fasting Lab (level 4) and  Non-Fasting Ultrasound (level 2) tests.\n\nSurprisingly both tests completed in 50 mins including waiting time. Thumbs up to the efficient Polyclinic Staff. Thank you.\n\nConveniently located and short walk to the Pioneer MRT Station.\n\nLatest Update (back home):\nImpressed with the super fast results out in about 2 hours after my tests on my Healthhub and OneNUHS mobile app.",
      "time": 1701757659,
      "translated": false
    },
    {
      "author_name": "Rach",
      "author_url": "https://www.google.com/maps/contrib/100368288078910287205/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLCyLjaBJ2Krp5ZkBJFmd9P94xLudV3Bl_Ov-uPfVITnnQG53M=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "8 months ago",
      "text": "Waiting time is always quite a pain😟 (1-2h on average😵‍💫 after mobile check-in). I realise that fewer doctors are in-clinic on certain weekdays and perhaps the reason for the rather long wait.\n\nBased on my personal experience, there are a few doctors who are professional, caring and kind towards patients, taking the time and effort to listen and address inquiries in detail, while others are completely the opposite i.e unprofessional (giving wrong diagnoses😱), unsympathetic or unable to explain and clarify certain medical-related inquiries.\n\nI did have positive previous experiences interacting with some of the rare few “good” doctors (Dr ZKX, Dr SKR), pharmacists (Ms Tan Shu Kuan) and even clinic staff during my regular reviews here though🙂 - grateful and thankful for these medical professionals especially.",
      "time": 1725614735,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=18161434325595715512",
  "user_ratings_total": 194,
  "vicinity": "26 Jurong West Street 61"
}