{
  "formatted_address": "190 Middle Rd, #02-29 Fortune Centre, Singapore 188979",
  "geometry": {
    "location": {
      "lat": 1.3000802,
      "lng": 103.8523301
    },
    "viewport": {
      "northeast": {
        "lat": 1.301407430291502,
        "lng": 103.8536624302915
      },
      "southwest": {
        "lat": 1.298709469708498,
        "lng": 103.8509644697085
      }
    }
  },
  "name": "Piu M",
  "place_id": "ChIJUfmNQPAZ2jER9YwyoCASFhc",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Alvin Heng",
      "author_url": "https://www.google.com/maps/contrib/109470817406903791328/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI-0__Tffd4akzpGyC0zwR42OYWknKAcymfOsVwi4UBTbuV9w=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Hole in the wall trattoria by Japanese chef.\nMainly bar seating and 1 round table (would have been better if it's a square table with checkered table cloth to complete the look)\nChef is very hospitable and welcoming.\n\nDishes were well prepared and tastey.\nBurrata dashi bread だしパン was our dish for the night; a definite must try.",
      "time": 1739888184,
      "translated": false
    },
    {
      "author_name": "Timothy Lim",
      "author_url": "https://www.google.com/maps/contrib/103773064420955939275/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWfy3at0BtzK_kuAovzm9YQE75OqNLqSnGsAB3bGJlfuqpJq6l6=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Found out about this hidden gem in Fortune Centre from a friend. The whole place felt very homely like you are kinda of stepping into someone’s house for a meal, chef Jun also prepares everything right in front of you if you sit at the counter. Which was a bonus.\n\nThe food here is simple but hearty. For starters we had the tuna tartare, crab and wagyu croquette and they were so delicious!\n\nFor mains we ordered the uni and arrabbiata pasta followed by porcini risotto and a tiramisu. Generally the mains were delicious but my personal favourites were the uni pasta (so umami and al dente!) and the porcini risotto (incredibly flavourful while not heavy). I have to mention the tiramisu which chef Jun wiped up from scratch - the cream was light and yet not too sweet but still had that alcoholic kick. I highly recommend trying this and paying them a visit!\n\nKudos to the team for the great service as well!",
      "time": 1730162642,
      "translated": false
    },
    {
      "author_name": "shannan low",
      "author_url": "https://www.google.com/maps/contrib/118003377492855795541/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXUBOAb-sDilA8dDMBjSfDx4Fdxe_25W_YC9wIxs5T60Nr6jkmV=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "Came here during lunch, not super affordable food and specialises in curry for the lunch. Funny concept, it says the lunch time is from 11-until the rice runs out, with rice upgrade being free. I thought the rice was superb the curry isnt conventional but flavour packed",
      "time": 1736570914,
      "translated": false
    },
    {
      "author_name": "JY",
      "author_url": "https://www.google.com/maps/contrib/105486231286004438682/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKQAlemikRhBJHicrAeJk5x1lM9h0_yA9Wx329ghPBJOlnGQQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Absolutely loved the experience at Piu M! I love hidden gems and this is place felt like stepping into a friend’s home for a meal. It was so cosy and the food was so good that it made Monday feel like a Friday.\n\nThe standout dish for me was the Wagyu croquette, which was juicy and lip smacking good. The 3 dish appetiser were refreshing too (our fave was the dish with chicken strips). The crab pasta was on point and al dente, while chef wiped up the no bake tiramisu from scratch - the cream was foamy and yet not too sweet. We wanted to try the burrata but unfortunately it was sold out as Chef said he imports them fresh every Tuesday (and we had visited on a Monday).\n\nAll guests have to drink a glass of alcohol for dinner service, but it’s worth it for the sangria was really good! Chef froze sweet pineapple cubes which were a joy to bite on, and it added a nice flavour to the liquor base we chose (sake for myself; sparkling wine for my friend).\n\nChef himself is also a reason to visit this little joint, for he made us feel so welcomed. He was whipping up a trial batch of his October menu dessert, and the smell was so good my friend and I were like we need to visit again for it.\n\nWe were a little sad curry is only served during supper & lunch, and hope to be back soon to try those!",
      "time": 1727712217,
      "translated": false
    },
    {
      "author_name": "Sharmaine Tan",
      "author_url": "https://www.google.com/maps/contrib/103226055906808148585/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIfNsNLn_MNIVYerJrLlfqF-Bc87e0uyHnGUyuuUo7C6MO3fg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Truly a hidden gem in Fortune Centre. The food here is brilliant and tastes very homely. We had the burrata dashi crostini, the tuna tartare, crab croquettes, beef tongue stew and uni pasta.\n\nEverything was delicious but my personal favourites were the uni pasta (so simple yet so umami!) and the beef tongue stew (incredibly tender and flavourful). Will be back again to try the rest of the menu.\n\nBonus: You get to see the chef cook right in front of you, which is super cool!",
      "time": 1726760306,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "meal_takeaway",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1663537043695897845",
  "user_ratings_total": 121,
  "vicinity": "190 Middle Road, #02-29 Fortune Centre, Singapore"
}