{
  "formatted_address": "1 Tampines Walk, Our Tampines Hub, Singapore 528729",
  "geometry": {
    "location": {
      "lat": 1.3528935,
      "lng": 103.9405433
    },
    "viewport": {
      "northeast": {
        "lat": 1.353821730291502,
        "lng": 103.9421095
      },
      "southwest": {
        "lat": 1.351123769708498,
        "lng": 103.9393975
      }
    }
  },
  "name": "Pizza Hut Express - Tampines Hub",
  "place_id": "ChIJRR0qmAA92jERxFLqR2biu20",
  "rating": 3.3,
  "reviews": [
    {
      "author_name": "Hartono Harjono",
      "author_url": "https://www.google.com/maps/contrib/102944719141464210600/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU2wzv-R7xAL7WAhbKCcmiEWLKvBAiYt2jMX0nv1l0P-rVzGIU76A=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Pizza express with 4 table for dining tables and some high chairs. Chicken wings are available. Straight forward service. Choose pizza, pay, bring home or eat your pizza. This pizza express doesn't provide plate, metal spoon or fork, or knife like fine dining, or whatever box. Small box for slice, big box for whole pizza. It's pizza time!",
      "time": 1659759671,
      "translated": false
    },
    {
      "author_name": "David Yew",
      "author_url": "https://www.google.com/maps/contrib/101585668685669926056/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLjTzKbZHi2y22RUfAX9DWtcorDx1n6HtN-5jlvEojTdJG3jw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "6 years ago",
      "text": "A small but friendly Pizza Hut.\n\nAt most 5 families of 4 can be housed at any time. The aircon temperature set is just nice.\n\nWill be great to have a handwash area after using your fingers for eating.\n\nIt is amazing that just 2 staffs on a weekend to serve in the restaurant.\n\nThe location is quite prominent as it is a few steps away from the main entrance to Tampines Hub, walking from Tampines Bus Interchange.\n\nI am looking forward to visit this small, cosy Pizza Hut once more.",
      "time": 1549702546,
      "translated": false
    },
    {
      "author_name": "Changhong GAO",
      "author_url": "https://www.google.com/maps/contrib/111277161210907243699/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU04FfkKTJ9NdqrmL8uj4UNY_zFWCIa0igNGU1Ja3GhRXf-xVc5=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "STAFF DEMONSTRATES POOR SERVICE and BAD ATTITUDE\n\nVisited this outlet on 26 June 2022 around 7pm. Ordered 6 slices of pizza. Informed staff that I would like to pack 5 slices for taking away, while consuming 1 slice on the site.\nThe staff refused to give a plate/box/whatever holder for the one slice for eating on site. Kept arguing that is a waste. Kept arguing.\nDoes pizzhut expects customers to eat with bare hands?\nVery bad attitude, very poor service,  as demonstrated by staff",
      "time": 1656242327,
      "translated": false
    },
    {
      "author_name": "Ganesh Kumar",
      "author_url": "https://www.google.com/maps/contrib/100338730132286244285/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVxkDqFwp7T6jQXoMHtfMQIDbld0-NoXjnmcxhEKb0chxuiX9_u=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "6 years ago",
      "text": "STAY AWAY from Pizza hut @ Tampines hub.\nHad a very worst experience at this branch this evening. Went to Tampines hub with family just to spend time, felt hungry and thought of having a meal at Pizza hut. Queue was not really long, just 5-6 ppl. And I noticed few people going out of the queue murmuring something and it was the turn of the person before me. When we thought we are about to make our order after waiting for some 20 minutes, staff told we need to wait for some more time(minimum 15 minutes) as they are busy with outdoor orders. And I learnt that the person before me was waiting for almost 45 minutes. Annoyed totally and staff was giving the reason that they need to take care of outdoor orders first. and she was strict that we must wait. Told her to call her manager who was just giving some lame reasons. After making me to convince them, they accepted to take the order. Story doesn't end here. In my plate, I found a piece of coal. I seriously doubt their hygiene. When I asked this to the staff, they were apologetic, but were not at all responsible. Worst thing was I found a Muslim family waiting there for food(I assume they are there to end their fasting - This happened around 7 PM).\nPoints:\n1. This outlet looks like to be for outdoor delivery - If this is true, shut the doors except for outdoor delivery\n2. Don't jus open the doors and make the customers go out after waiting for close to an hour\n3. Have atleast one senior staff at work. I saw 2 staff, both of them look to be college students and the manager was trying to corner the mistakes on one of the staff saying he is new - Goddamn - If they are new, why are you making them to handle the entire shop without any guidance from any senior staff\n4. Lady(or girl?) staff at the shop was really rude.. When I wanted to have a written note that they agree I spotted a coal in my plate,they didn't even turn back (I have photo and video proof of this)\n-- I expect a proper response from Singapore Pizza hut management - If I don't get any I will need to think about my next steps.",
      "time": 1527957458,
      "translated": false
    },
    {
      "author_name": "kang cheeyuan",
      "author_url": "https://www.google.com/maps/contrib/108016514822158500145/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK5mq_VnxEcXG94z3PsyiS4q9KBKDsERaS6KZo8whIb2kQvTA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 years ago",
      "text": "Worst pizza ever I had in pizza hut today. It tasted\nthe pizza was cold too. rude response from the counter lady meena too where we order. Never going to go there again. before ordering she stack 6 slices put it to the microwave some wasn't even reheated properly and served to us so my mother asked her kindly to reheat the pizza slices to make it warm to eat and she reply with rude voice because of the aircon thats why the pizza was cold .",
      "time": 1611206789,
      "translated": false
    }
  ],
  "types": [
    "meal_takeaway",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7907162499700118212",
  "user_ratings_total": 28,
  "vicinity": "1 Tampines Walk, Our Tampines Hub, Singapore"
}