{
  "formatted_address": "22 Kew Dr, Singapore 467960",
  "geometry": {
    "location": {
      "lat": 1.3195312,
      "lng": 103.9520771
    },
    "viewport": {
      "northeast": {
        "lat": 1.320857280291502,
        "lng": 103.9533390302915
      },
      "southwest": {
        "lat": 1.318159319708498,
        "lng": 103.9506410697085
      }
    }
  },
  "name": "Planet Montessori",
  "place_id": "ChIJC4qACtEi2jER6KI1IGGDit0",
  "rating": 5,
  "reviews": [
    {
      "author_name": "tracy ying",
      "author_url": "https://www.google.com/maps/contrib/113734870965963684878/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKRR990-e2o9H6ddCoW294BeXCTtzPitWuhL4OXui2J_WJ5mQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Also here’s the testimonial!\n\nAs a mom of three kids who have all had the privilege of attending Planet Montessori Day Care, I couldn’t be more grateful for the incredible experience it has provided for our family. The teachers are extremely caring and attentive, yet they foster independence in the children with encouragement. From thoughtfully planned daily activities to programs like Sports Week, festive celebrations, and the awe-inspiring annual concert, it’s amazing to see how much the kids achieve in just a year!\n\nWhat stands out the most is the school’s focus on building character and confidence. I absolutely love that they prioritize outdoor activities, teaching essential skills like water safety, rollerblading, and cycling, which have been both fun and invaluable for my kids.\n\nThe passion and enthusiasm of the principal truly shine through, inspiring the teachers, the children, and even us as parents. It’s not just a school—it feels like a warm and welcoming family.\n\nWe are thrilled about the launch of the new Student Care program, knowing it will give our kids even more opportunities to grow and thrive within this wonderful community. Planet Montessori has been such a special part of our journey, and we couldn’t be happier to continue with them!",
      "time": 1743419482,
      "translated": false
    },
    {
      "author_name": "Mei Yang",
      "author_url": "https://www.google.com/maps/contrib/100284277240190231264/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJVH0XjTR_lA8FUWTSGDcyV1BY3dQDPvcv5Hxf7WuXWUo5qmg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "We are incredibly grateful to the amazing teachers at Planet Montessori for taking such wonderful care of our son since he was just 3 months old. Now, at almost 3 years old, we can see how much he has grown—both academically and physically!\n\nThe nurturing environment and dedicated educators have helped him develop a love for learning. He can count effortlessly in both English and Mandarin, enjoys reading books, and now communicates with us so well. Beyond academics, he has become so active and fit, which speaks volumes about the school’s holistic approach.\n\nThe teachers also helped us discover his excellent motor skills—he can already play tennis and table tennis so well at this age! We are amazed by his coordination and agility, and we truly appreciate how the school nurtures each child’s unique talents.\n\nThank you to all the teachers for your patience, care, and dedication. We truly appreciate everything you do for our little one! Highly recommend Planet Montessori to any parent looking for a loving and enriching environment for their child.",
      "time": 1739085352,
      "translated": false
    },
    {
      "author_name": "Maggie G",
      "author_url": "https://www.google.com/maps/contrib/110513898411918679401/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLFxh0QZh6iAYMc0dJFrOZ2UK3J9BccX8IzOScvI1y4WbIjUA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "We couldn’t be happier with our experience at Baby Planet and Planet Montessori! It is truly a nurturing environment where children are encouraged to explore, learn, and grow at their own pace. The teachers are incredibly patient, knowledgeable, and truly care about each child's development.\n\nOne of the standout aspects of Planet is the emphasis on outdoor play and physical activity. The spacious outdoor play area (which is uncommon compared to other IFCs and CCs in Singapore) allows children to explore nature, develop their motor skills, and build confidence in an open and stimulating environment. It also provides children the opportunity to move, play, and develop coordination through fun and engaging activities. This balanced approach of learning and movement has had a remarkable impact on our kids' independence, problem-solving skills, and overall excitement for learning.\n\nWhat makes our experience even more special is that my sister’s three kids are alumni of Planet, and we have seen firsthand how independent, confident, and self-initiating they have become over the years. Seeing their growth reassured us that this was the perfect place for our own children, and we couldn’t be more grateful for the foundation this Montessori program provides.\n\nAnother thing that speaks volumes about Planet is that, despite having little social media presence, they have been around since 2007. Their reputation has been built purely through word of mouth and referrals, which is a testament to the genuine care, quality education, and strong community they have fostered over the years.\n\nWe highly recommend Planet Montessori to any parents looking for a loving, stimulating, and well-structured environment where children can thrive both academically and physically!",
      "time": 1739256091,
      "translated": false
    },
    {
      "author_name": "Joyce Peh",
      "author_url": "https://www.google.com/maps/contrib/109261669073262644204/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIu6qjHA1QTxmp4r_AOwFN-hUEkv6BmiZhaAOTti2kHLCqi-8A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Both my kids spent their most formative childhood years at Baby Planet and Planet Montessori, and there isn’t a team of early childhood educators and nurturers I trust more than the wonderful team at Planet. Beyond just education, it was a place where they learned to be kind, independent, and to shine in their own unique ways.\n\nAt Planet, our children's learning went beyond the classroom. The school organizes so many fun and meaningful experiential learning journeys throughout the year. For example, bringing them to watch children's play at the Esplanade or Victoria Theatre, taking them on long-distance cycling / rollerblading trips spanning East Coast Park to Marina Barrage, cultural immersion trips to Chinatown (kids are given independence to buy their own hawker food), outdoor activities to Forest Adventure and even a yearly overnight camp for graduating K2 students!\n\nWe love the holistic approach to learning which also focuses on sports, music, speech and drama, arts, character building, and the love and care they receive each day. I know my children are in the best hands at Planet. My kids look forward to going to school everyday, and even after graduating from Planet Montessori and entering primary school, my elder kid continues to attend Planet Student Care. I mean, it was an easy choice - there isn't a better place you can find that has built such a strong team of educators and nurturers the way Principal Hui has done. The dedication of every teacher is sincere and real.\n\nI am glad to be part of this community and will strongly recommend if you are looking to provide your child with a happy, healthy and memorable childhood!",
      "time": 1739517365,
      "translated": false
    },
    {
      "author_name": "Ruth Rodrigues",
      "author_url": "https://www.google.com/maps/contrib/105276868856707705322/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWC4b4XDTguUlPGZ6Uwd2rI5vswyOajGdnTc03imwNgB7iIA4M2=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "As parents of three children who have been part of the BabyPlanet and Planet Montessori family, we cannot speak highly enough of the incredible care, dedication, and quality of education offered by this school.\n\nOur eldest daughter joined BabyPlanet at just 4 months old and continued her journey through Planet Montessori, completing her pre-school education with a strong foundation for primary school. Now, our twins, who have been with Baby Montessori since they were 4 months old, are excited to progress to Planet Montessori in the coming year. This school has been a constant source of joy, learning, and growth for our children.\n\nThe teachers here are exceptional—loving, patient, and deeply invested in every child's development. They take the time to recognise and celebrate each child's unique strengths and help them grow through their challenges, fostering confidence and resilience. The school’s emphasis on outdoor activities has been a huge highlight for us. From bike riding and in-line skating to indoor rock climbing, these activities not only develop motor skills but also instil a sense of independence and accomplishment in our kids.\n\nAs working parents with demanding jobs, we are incredibly grateful for a school that our children genuinely look forward to attending every day. Their laughter and smiles when we pick them up are testament to the warm and nurturing environment the school provides.\n\nWe were particularly impressed with the school’s balanced approach to preparing our eldest for primary school. The curriculum is robust and thorough, yet it avoids over-preparation, allowing children to thrive in their own time. Our daughter transitioned seamlessly into primary school, confident and ready to take on new challenges, while still being engaged by the new learning opportunities.\n\nThe school also emphasises important life skills, encouraging creativity, curiosity, and kindness. They foster an inclusive environment where children learn to appreciate diversity and work collaboratively with their peers.\n\nBabyPlanet and Planet Montessori are not just schools—they are a community that nurtures and celebrates children while providing them with the skills and confidence to flourish in their next stage of life. We are deeply grateful for the positive impact they have had on our family and cannot recommend them enough!",
      "time": 1739163692,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15963716282343596776",
  "user_ratings_total": 9,
  "vicinity": "22 Kew Drive, Singapore"
}