{
  "formatted_address": "18 Sin Ming Ln, #01-04/05/36/37 Midview City, Singapore 573960",
  "geometry": {
    "location": {
      "lat": 1.3586404,
      "lng": 103.8340972
    },
    "viewport": {
      "northeast": {
        "lat": 1.359874730291502,
        "lng": 103.8354012802915
      },
      "southwest": {
        "lat": 1.357176769708498,
        "lng": 103.8327033197085
      }
    }
  },
  "name": "PlayFACTO School @ Bishan Midview City",
  "place_id": "ChIJJYht89cX2jERH5WRplSUj5I",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Karolyn Choo",
      "author_url": "https://www.google.com/maps/contrib/112817968425751452430/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI73fdVQ9ABTEWC_PzfSQC6KaRfO6XwaD6CezLNSJZFggR7fcvr=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "3 months ago",
      "text": "The space is bright and spacious. But I am disappointed how the kids are made to stay at desks after lunch. Perhaps this is something that the parents of this area prefer. But being business oriented. I do prefer my child to have unstructured time between lunch till revision again at 4pm.\n\nI heard from friends, other outlet at Bukit Timah the head of school actually prints toys and allow the kids to have free play and socialise healthily during break times. (Being business oriented, this is our preferred manner of nurturing, encourage kids to have sense of agency)\n\nFeed backed, but was told that our child can leave the quiet classroom for robotics and have a lot of fun. I would prefer in the “basic” class, children are allowed to decompress after a long day of school sitting at desk from 7:30am - 1:30pm. My kid can’t adapt so fast spending one whole day at desk like office worker so we have to leave.\n\nThe staff is indeed very polite and kind. Thank you for having us.",
      "time": 1738979396,
      "translated": false
    },
    {
      "author_name": "Pearly Peck",
      "author_url": "https://www.google.com/maps/contrib/115572975150280237490/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUT92dirj9BSBdzIVhTOh8k9P0K97VYDMweef-eaQ5qtmWMieQT4w=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "My child enjoys attending her student care at PlayFACTO since Primary 1. The teachers and caregivers are patient and nurturing. With PlayFACTO'S after school care curriculum, my mind is more at ease especially when I'm at work knowing that she is in good hands. Even though the Centre's meals are catered, my child enjoys the food provided which is a wide variety of Local, Western, Japanese cuisine and the menu is updated via their app. What I like most about PlayFACTO is their school holiday excursions which have different themes, this broadens my child's experience because it is not only limited to a classroom setting. They also learn art and gourmet cooking in the centre during the holidays. Thank you once again, to the team at PlayFACTO!",
      "time": 1718940642,
      "translated": false
    },
    {
      "author_name": "cing sl",
      "author_url": "https://www.google.com/maps/contrib/114884057568556325181/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUQKYzLh2LT09ZL3H-HVF2suJu56A45jedzni9uW89jlhxWHsxU=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Placed my kids at Playfacto Bishan. All teachers and staffs are very passionate, dedicated, kind and friendly that sometimes I wonder how does the centre maintain such consistency of service at every tier. No matter how many students are there_ they manage to cater individualised attention for every kid. I am grateful that I happen to choose Playfacto in my search for a safe haven away from home.\nCheers to the team at Playfacto Bishan🥂 Best team ever!\n(Always keep the passion and remember every single thing that you did matters alot for the kids and us, parents)\nThank you👍👍👍",
      "time": 1690781557,
      "translated": false
    },
    {
      "author_name": "Edmund Phang",
      "author_url": "https://www.google.com/maps/contrib/101868024625777498845/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW6rYGYrvaq0bvdHJpS9JHRrwX_RvxQDstOz-eJf2moKKEQ9A=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "The staff are very professional and are prompt in updating parents on child's progress and activities at PlayFacto. My child enjoys going to PlayFacto after school. The cosy environment helps to make him feel comfortable in the company of friends and teachers. Not to forget the yummy lunch which he will often talk aboit at home.\nThe experience with PlayFacto @ Midview has been a pleasant one and the school certainly gives working parents a peace of mind.",
      "time": 1597912955,
      "translated": false
    },
    {
      "author_name": "M Ling",
      "author_url": "https://www.google.com/maps/contrib/104658204877270262131/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIrh3cVqZbpw4Tn5fZmzupdImRYMrPsPvvJp1wmGFkQabigzg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "The space of the school is huge, and very conducive for learning and play.  My child looks forward to meeting his friends from different school and his teachers everyday. I would always recommend the school when speaking with fellow mummies.",
      "time": 1598278292,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "school",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10560822742499824927",
  "user_ratings_total": 13,
  "vicinity": "18 Sin Ming Lane, #01-04/05/36/37 Midview City"
}