{
  "formatted_address": "245A/B Victoria St, level 2 Bugis Street, Singapore 188032",
  "geometry": {
    "location": {
      "lat": 1.3007835,
      "lng": 103.8554794
    },
    "viewport": {
      "northeast": {
        "lat": 1.302171780291502,
        "lng": 103.8568955802915
      },
      "southwest": {
        "lat": 1.299473819708498,
        "lng": 103.8541976197085
      }
    }
  },
  "name": "Play By Ear Music School",
  "place_id": "ChIJQbcYjLoZ2jERsQw73i47sLE",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Nina Lim",
      "author_url": "https://www.google.com/maps/contrib/105345156882282050100/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKaxEZ54zNIjPQ4-wEn6pxyC_rKI4yKu9ele_-OvM6wg2WohA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Have been wanting to learn to play my favourite songs but didn't get a chance to learn when I was a child. Glad to know this school through my friend. The teachers are all very patient with me, understanding that I have absolute zero background in music.  You can buy flexible class packages, highly recommended for busy adults who still would like to have a touch with music. :)",
      "time": 1725935999,
      "translated": false
    },
    {
      "author_name": "Avon Lim",
      "author_url": "https://www.google.com/maps/contrib/105966844752917033558/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVYEd2HtLqa95kaUeC5RYtj2vwgrfshaq_ZZVOiz6yW61LkZKMG=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "I have been a paying customer of Play by Ear for the past 6 months and have no regrets choosing to restart my piano journey with them. The location is convenient (directly opp Bugis Junction), and the communication with the admin team have been great. From the moment I started my class, I felt welcomed and supported.\n\nA special shoutout to my instructor, Anna, who has been absolutely wonderful. She has a unique ability to tailor lessons to fit each student’s learning style, making complex concepts easy to understand and enjoyable to learn. She is patient, encouraging, and always goes the extra mile to ensure I get the most out of my lessons.\n\nThanks to Anna and the wonderful environment at Play by Ear, I’ve seen significant improvement in my playing and a newfound confidence in my musical abilities. If you’re looking for a piano school that will nurture your love for music and help you grow, look no further than Play by Ear. Highly recommend!",
      "time": 1717420440,
      "translated": false
    },
    {
      "author_name": "Meiyun Lin",
      "author_url": "https://www.google.com/maps/contrib/115987744056251734114/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL_Kc1QCXncEoXEHtSDjZyuklnoocnV-jQO-PC_VGNINr94ug=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "I attended PBE more than 10 years ago n stopped due to personal reasons. Recently wanted to take piano lessons again n am glad to know tt the sch is still ard :)\nMy instructor Taro is a super amazing musician n he can listen to a song on the spot n immediately reproduce it on the piano/transcribe it onto paper n also add his own improvisations. Very inspiring n I can really feel his passion for piano n music! Have learnt alot from him.\nWould also like to thank Andrew for being so approachable n for helping me with the admin stuff - really appreciate it! Happened to catch his piano-playing on ig live too - super talented pianist as well!\nLooking forward to improve my piano skills at this school :) I also like it that we get to choose the songs that we wana learn from their repertoire of scores/fakesheets :)",
      "time": 1727712261,
      "translated": false
    },
    {
      "author_name": "Michael Chin",
      "author_url": "https://www.google.com/maps/contrib/112952605313823961000/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX1M9uT6Ww9jkN-iLFLVIjtxT5QB6oPTHCnG7amq2mYl5kpMOY=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "An eye opening experience for me! I have been self learning through the internet for a while now but encountered some difficulties. Decided to go for lessons and found Play By Ear is the most suitable and highly reputable.\n\nLearnt a lot from the lessons under Kar Hoe that online ones could never do, such as playing the song in my preferred style and giving me ideas for trying new patterns for the songs I enjoy most. He often uses a lot of amusing analogies to help me understand better.\n\nThe other instructors and staffs are approachable and friendly as well!",
      "time": 1567488679,
      "translated": false
    },
    {
      "author_name": "Celeste Chen",
      "author_url": "https://www.google.com/maps/contrib/111921011714004620327/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKO95DoTn4xcqypLNEFl30L5Sf_W2_G5jAzJBeta3lsqrg9=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "2 years ago",
      "text": "With the school for 4years, it’s a shame didn’t continue. Having zero music knowledge and a day I decided to pick up a new hobby learning piano with the school. Initially choose this school is because of the strategic location. After joining I find the staffs and boss here are also very friendly and responsive too.\n\nMy teacher has been super nice and patience with me, his lesson is enjoyable makes me look forward for my lesson every week. One feature I really like about the school is it allows student to postpone lesson and do make up lesson which is very helpful for me who travel often.\n\nLastly it would be great if the school can service the digital pianos at the practice rooms as many of them are already faulty :p",
      "time": 1667102637,
      "translated": false
    }
  ],
  "types": [
    "school",
    "store",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12803798813097266353",
  "user_ratings_total": 49,
  "vicinity": "245A/B Victoria Street, level 2 Bugis Street, Singapore"
}