{
  "formatted_address": "68 Orchard Rd, Singapore 238839",
  "geometry": {
    "location": {
      "lat": 1.3000678,
      "lng": 103.8447831
    },
    "viewport": {
      "northeast": {
        "lat": 1.30155065,
        "lng": 103.8468654
      },
      "southwest": {
        "lat": 1.29829685,
        "lng": 103.843303
      }
    }
  },
  "name": "Plaza Singapura",
  "place_id": "ChIJR1Fyfr0Z2jERzwO-AZiJ-HM",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Tom",
      "author_url": "https://www.google.com/maps/contrib/114257904445701589187/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKAtkyHQWvN80W1Q8xwD7P13QyLcKORNGDPBIuTKTeSLFN6UQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "Plaza Singapura is a great shopping mall with a wide variety of stores, restaurants, and services. The location is convenient, and the mall is well-maintained with a modern design.\n\nHowever, one downside is the lack of seating areas for resting between shopping or waiting for someone. This makes it less family-friendly, especially for those with young children or elderly companions. Adding some benches or resting spots would greatly enhance the experience.\n\nOverall, it’s a good mall with potential for improvement!",
      "time": 1745034374,
      "translated": false
    },
    {
      "author_name": "K Tan",
      "author_url": "https://www.google.com/maps/contrib/105592887493237423833/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXyP7OR0umslMlymV9dCFaY-ZzThVRDhU54qcjXxI66aOxQs_ZNqQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Plaza Singapura is a shopping mall known for its convenient location and diverse retail offerings. Situated directly above Dhoby Ghaut MRT station, it provides seamless connectivity for shoppers.\n\nThe mall is constantly refreshed with renovations and updates, keeping it modern and appealing.  Anchor tenants such as Cold Storage for groceries, Muji for minimalist lifestyle products, and Haidilao for hotpot lovers.\nIn addition, there is a wide variety of dining options, food court all catering to different tastes and budgets.\n\nWith its strategic location, strong mix of retail, dining,and banking facilities, Plaza Singapura is a popular choice for both locals and tourists looking for a comfortable shopping experience.",
      "time": 1743441405,
      "translated": false
    },
    {
      "author_name": "Alvin Lim",
      "author_url": "https://www.google.com/maps/contrib/118302592391028803090/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjURMF3PiO47_loldhYfYHmBFfmXZidC6KIimgaroOE5-iatqg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Plaza Singapura is a vibrant and well-located mall in the heart of Orchard Road, offering a diverse mix of retail, dining, and entertainment options. With a wide range of stores—from popular fashion brands to electronics and lifestyle shops—it caters to shoppers of all ages. The mall is also home to a Golden Village cinema and a basement-level DAISO, making it a convenient one-stop destination. Food choices are plentiful, with everything from fast food to local and international cuisines. The direct link to Dhoby Ghaut MRT station adds to its accessibility. While it can get crowded on weekends, its central location and variety make it a reliable shopping spot in Singapore.",
      "time": 1743723271,
      "translated": false
    },
    {
      "author_name": "Xoom Too",
      "author_url": "https://www.google.com/maps/contrib/105863133358477079886/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVLRzhuxFKh1jOBQiJLb1bjferwZ-xPRZ7v7ReqgRp2P_uVyh9Y4Q=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "The mall has a ton of stuff to explore and enjoy such as restaurants, jewelry stores, clothing stores, small knick knacky stores, a movie theather at the top, a supermarket, a food court and way more. I’ve come here multiple times and eaten at the food court, restaurants, and bought stuff from stores and I’ve always had a good experience with everything.\n\nIn difference seasons/holidays such as the new year, Christmas, and such they do beautiful decorations that are worth seeing if you’re there. The location is great as well being near the underground MRT and multiple nearby bus stops in front and to the side of the mall. Overall it’s a wonderful shopping mall to visit when in Singapore.",
      "time": 1736128996,
      "translated": false
    },
    {
      "author_name": "Achila Iranga",
      "author_url": "https://www.google.com/maps/contrib/101880117018749073539/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUFBMzMcUkrYM9VHaNSlJEF5BW0NYTLjkgxov5O_hxLQ977a6-B=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "What a beautiful shopping mall.. roamed around for a while I was mesmerized 🫶 absolute beauty.. had so much fun roaming around and buying some Funko pops… plus the Lego Christmas market was the best ❤️🇸🇬",
      "time": 1734972870,
      "translated": false
    }
  ],
  "types": [
    "shopping_mall",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8356580394543219663",
  "user_ratings_total": 21677,
  "vicinity": "68 Orchard Road"
}