{
  "formatted_address": "501 Bukit Timah Rd, #01-05C Cluny Court, Singapore 259760",
  "geometry": {
    "location": {
      "lat": 1.3223608,
      "lng": 103.8141517
    },
    "viewport": {
      "northeast": {
        "lat": 1.323583830291502,
        "lng": 103.8155730802915
      },
      "southwest": {
        "lat": 1.320885869708498,
        "lng": 103.8128751197085
      }
    }
  },
  "name": "PRAIRIE by Craftsmen (Cluny Court)",
  "place_id": "ChIJfyNSrpkb2jERuDCdA58fvTc",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "David M",
      "author_url": "https://www.google.com/maps/contrib/107345381570989890261/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ1U4RkMlNQEo1oSpQU1m-7z75W84oddj0jZnWAlwftR-VADA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "Second time to Prairie. First time all I remember was how bad the food was, but I wrote it off as a fluke and gave it a second chance. After dining here a second time, all I can conclude is that it is no fluke.\n\nFood is terrible. Service is equally bad. Both of the orders we received were wrong. The staff made no effort to make it right.\n\nAnd despite the orders being wrong, we ate the food anyway, and the food was so bad that neither of us finished our dish.\n\nMy omelette had some undisclosed white goop on top, and was filled with what appeared to be caramelized onions, which also were not listed on menu.\n\nMy wife’s dish was covered in smoked salmon, which she didn’t order and she discarded. The rest of the dish was not appetizing.\n\nThe bright spot was the pastry, but it was on par with other good pastry shops in SG.\n\nAll in all, I’m very surprised by how bad the quality and service is given that this is a Craftsmen property. I usually enjoy dining at Craftsmen joints.",
      "time": 1746811104,
      "translated": false
    },
    {
      "author_name": "tricia lee",
      "author_url": "https://www.google.com/maps/contrib/106219755749806403276/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUrE6TYJKATbUbY2qPaz_BNpfQ_e2Da_PUJ1gul8m4jozFuE5yN=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "amazing food & incredibly good strawberry matcha! the quality of the food definitely matches the price & i feel that their standards are better than usual cafes.\n\ni love how this cafe is tucked away, which makes the alfresco seating comfortable. this is a good place to study/ work at on weekdays as it’s not crowded & staff were really friendly 😊\n\nwill definitely come back to try out the other menu items!",
      "time": 1745467791,
      "translated": false
    },
    {
      "author_name": "Holly Huu Nghiem",
      "author_url": "https://www.google.com/maps/contrib/107286838722468142397/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXGKpLifJt8Uxr9nMl8B9B-x6wdd1ASh-t6azQiNNootVMUAwvK=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 2,
      "relative_time_description": "a week ago",
      "text": "A good example of a place which only looks good on the photos.\n\nThe garden view and overall atmosphere are lovely, and the portion sizes are generous—these are the only positives from our visit.\n\nUnfortunately, the food was quite disappointing. We ordered the Duck Leg Confit, but the duck was dry and overly salty, and the sweet potato side was surprisingly tough and difficult to chew. This dish was a big letdown.\n\nThe Omelette & Hash dish was also disappointing. While the omelette itself was fine, the potato hash was severely overcooked—bitter, burnt, and extremely tough. We couldn’t get past the first bite.\n\nOn a more positive note, the free salad bar was fresh and enjoyable—we both liked it.\n\nService, however, left much to be desired. We were seated at a large table shared with another group, which felt awkward. There were multiple mix-ups—two or three incorrect dishes were brought to our table, including one left on an empty seat without asking who it was for. When the waitress brought the Duck Confit, she placed it right at the edge of the table, which felt careless and could easily have caused the dish to fall.\n\nWe sat indoor, when I sat, I noticed there were ants on the table.\n\nOverall, I’m giving two stars only because of the generous portions and pleasant garden setting. Unfortunately, the food and service did not meet expectations. I wouldn’t return and wouldn’t recommend it. With this pricing, there are better options nearby.\n\nIf you read the latest reviews, you will find the similar experience as mine, including reviews and complaints about the food and services.",
      "time": 1746950905,
      "translated": false
    },
    {
      "author_name": "Valerie Ray",
      "author_url": "https://www.google.com/maps/contrib/103854105941353293088/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK85hNIj7uPs-lNLdrJV61bwxrX7dDVAqLURgvwOyA7ocBASrA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "Nice atmosphere with super nice dog-friendly outdoor space, but it was a bad experience because they are super understaffed with just 1 chef in the kitchen.\n\nCame in and was told that the wait will be 25 mins, which turned out be 1 hour 15 minutes long until we got most of our food. We saw tables asking to cancel their order. The servers were very nice about it but\njust be prepared for the long wait and be nice to the servers.\n\nPrairie management should do better.",
      "time": 1744946962,
      "translated": false
    },
    {
      "author_name": "JL Lee",
      "author_url": "https://www.google.com/maps/contrib/116810671521181344125/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXc0QjG2YGfocRlm4spEdHF0Dy9EEw3joz9m-g_-dswSVOKLMyx=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Let’s start with complaint first! First time to this place but it’s really hard to find. But let’s just say it won’t be our last time here! Will definitely be back!\n\nHad the Eggs and Hash in 2 versions - bacon cheese and mushrooms. Both very yummy. Drinks especially matcha latte with sesame was good.\n\nStaff on duty gave good recommendations. They were also accommodative to my family of 4 (including 2 children).\n\nPleasant attentive service with superb food and drinks. Will definitely be back.",
      "time": 1742105474,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "restaurant",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4016401210505244856",
  "user_ratings_total": 1302,
  "vicinity": "501 Bukit Timah Road, #01-05C Cluny Court, Singapore"
}