{
  "formatted_address": "26 Evans Rd, #01-08, Singapore 259367",
  "geometry": {
    "location": {
      "lat": 1.3191095,
      "lng": 103.8205239
    },
    "viewport": {
      "northeast": {
        "lat": 1.320496030291502,
        "lng": 103.8219088302915
      },
      "southwest": {
        "lat": 1.317798069708498,
        "lng": 103.8192108697085
      }
    }
  },
  "name": "Preschool By-The-Park (Evans)",
  "place_id": "ChIJaU5k_SEb2jER6cErSQjBNqg",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Natalie Goh",
      "author_url": "https://www.google.com/maps/contrib/113135875624618439056/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWTo1oHeZosQCL9lFWDjnitHtKJw9aJR6x3vxcULLRn_g6detxIfQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Checked out several preschools with infant care in our area before touring Evans By The Park through a friend’s recommendation.\n\nWhat we like: The teachers across all classes work collaboratively and make it a point to know every child by name. I observed that this helped my kid feel welcomed and settle in.\n\nThey emphasise the teacher-parent partnership. We’re updated on our kid’s progress and can have open and candid conversations with teachers anytime. They’re also respectful and open to adapt to our requests when it comes to some of our preferences and styles as parents.\n\nLots of allocation for open play and time outdoors, with focus on nature, sustainability and community. We are huge believers that young children learn best through imagination and play, and this was a big draw factor.\n\nHappy to have found a childcare partner we can trust for our kid’s very crucial early years.",
      "time": 1701921840,
      "translated": false
    },
    {
      "author_name": "Andrew Tan",
      "author_url": "https://www.google.com/maps/contrib/116769011548491501489/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVzjHn9hTR1Al_QGsT3R5KwS-g-9i2bdbkbI7ncfOUa8a0Qx_E=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Evans by the Park has teachers with the biggest and warmest hearts!\n\nWhen we first visited the preschool for a tour, we saw up close how the children would play and learn in a natural and holistic manner.\n\nSince infant care and now toddler/playgroup, I can see how much and fast our kid has developed and is thriving.\n\nWhat moved us the most was participating in the annual carnival which is a charity fundraiser held at an eldercare centre.\n\nDefinitely recommend BTP to all my friends with little ones starting preschool!",
      "time": 1701915519,
      "translated": false
    },
    {
      "author_name": "Angie Kua",
      "author_url": "https://www.google.com/maps/contrib/109903540791618302618/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJX4a7rCRwed7Zyj7W30vnvuYB8TIfB3yTImSae2NNOU7AIeA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "This school is truly a hidden gem and there are so many things we love about it:\n\n1. Warm, loving and engaging teachers . The teachers really care about the children, and go over and beyond to bring out the best in the children\n2. Truly a place where children learn and discover through play\n3. Authenticity in their approach. It isn’t about fancy facilities/ toys. The teachers are incredibly resourceful and love using natural materials and recycled materials as toys, learning tools and props.\n4. They teach the kids about sustainability and the environment. Their actions speak louder than words, eg bringing in a company to teach kids how to recycle water in the garden, engaging with a company that has sensors/equipment to “talk to trees”, and moving away from parent-packed snacks to reduce the use of plastic wrappers + inculcate healthier snacks ie fruits provided by the school .\n5. Good balance between being play based, but still having an effective method for teaching (eg Spalding for reading) to prep the kids for “big school”\n6. Super collaborative with parents.They are very open to addressing any issues that we as parents have. Parents are welcomed to come into school and see what their kids are up to. I also find that the kids  at BTP are so curious, open, and confident in speaking with parents/ visitors that they meet",
      "time": 1709278906,
      "translated": false
    },
    {
      "author_name": "Ching Jee",
      "author_url": "https://www.google.com/maps/contrib/100748504931652646062/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI6Zc4alljBHhT4aqnfbmCGJiSy0s_B0hssuN7xZNS8FWtAnA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "A preschool where kids can be kids, where the teachers and the environment nurture a love for learning and curiousity.\n\nThe teachers have the ability of turning wooden sticks from their walks, plastic bottle caps crowdsourced from the families and other Knick Knacks into play materials that keep the kids entertained - up-cycling at its best instead of just a buzzword.\n\nIf you want your kids to have wonderful memories of childhood (and not memories of doing worksheets and revising for spelling), this school is for you!",
      "time": 1709255937,
      "translated": false
    },
    {
      "author_name": "TWI",
      "author_url": "https://www.google.com/maps/contrib/112446649112049281946/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWn294eS4KhLnE7ytrUfBK9ljPYhlk_3PsDvJRz81fCpIMNOxwc=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Nice school for children to play but ineffective teaching - son couldn't read simple words even by the end of graduation. Clearly academics are not a focus. Also terribly difficult to get the $2k+ deposit back after graduation.",
      "time": 1705462870,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12121087688445772265",
  "user_ratings_total": 8,
  "vicinity": "26 Evans Road, #01-08"
}