{
  "formatted_address": "80 Marine Parade Rd, #01-68, Singapore 449269",
  "geometry": {
    "location": {
      "lat": 1.3011348,
      "lng": 103.9053355
    },
    "viewport": {
      "northeast": {
        "lat": 1.302650330291502,
        "lng": 103.9069149802915
      },
      "southwest": {
        "lat": 1.299952369708498,
        "lng": 103.9042170197085
      }
    }
  },
  "name": "PriceBreaker",
  "place_id": "ChIJ7dKkunEY2jERuHY95-X8GtE",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "Meg Wong",
      "author_url": "https://www.google.com/maps/contrib/117690222453774501944/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWV-JEvGfN404h7sc7AaAVM7dUA6q-8P_Bq0WPO3LU4Lc8SAgI=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "Extremely terrible and disappointing experience in joining the Pricebreaker Amazing Dubai 5Days tour. Though we had chosen 5* hotel, it was actually a local standard one. The terrible thing is that the location of the hotel was situated in a run down slum-like neighbourhood where we dare not to go out  at night for a walk. Secondly, on the first night, we were crammed with 2 African big ladies inside a sedan car on the way to dinner in which  my husband didn’t even able to wear a seat belt. Then they arranged coach after that. Coaches were old and if there was a rating, I would rate it 2*, far worse than any coaches from SG to KL. Not up to standard. The whole trip was with all Pakistan and Indian visitors and while they were paying in their currency $, we were paying the same trip in Singapore $. It is obvious for me to see that the company made business through supplying poor grade tours and sucking up by providing the cheapest grade hotel as much as they can with the supplier. Due to the poor arrangement by the local guides there, Pakistan and Indian visitors were late everyday during pickups and eventually our city tours cannot cover what should be covered in the itinerary. But I must say, Pricebreaker staff like Shaneal & Angel were helpful, and looks like the company has some kind of conscience and therefore, we were compensated back two sightseeing places that were omitted and were covered back on our last free and easy day. However, we still have to arrange our own transportation to and fro. Overall conclusion is: NOT recommended to go for this tour and must say that I will not try any tours with Pricebreaker again. Really scared!",
      "time": 1735150222,
      "translated": false
    },
    {
      "author_name": "Ferhan Feroze",
      "author_url": "https://www.google.com/maps/contrib/116191683614389191559/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjULYpzMuQjGdkn-UWh-2VIejBpDIxtvr8v7c5jKTAYg93x3wOXr=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "11 months ago",
      "text": "Overall, the staff at PP were good, pleasant, and friendly.\n\nHowever, my recent experience in Switzerland involved booking hotels and transportation (including SBB trains, Glacier Express, and Bernina Express). While everything went smoothly with the transportation, the hotels provided fell short of our expectations.\n\nLugano - Acquarello Swiss Quality Hotel (3-star)\nThe hotel lacked window views, had a limited breakfast, noisy air conditioning, and no basic coffee or tea facilities. The room felt like a run-down apartment.\n\nSt. Moritz - Nolda Hotel (3-star)\nAlthough the room was spacious, the breakfast options were limited. Additionally, the hotel’s location had little around it except for a petrol kiosk with a small convenience store. An early morning checkout at 6 am was challenging due to the absence of a receptionist and a non-operational lift, forcing us to carry our luggage down two floors.\n\nZermatt - Alpen Resort (4-star)\nThankfully, the Alpen Resort in Zermatt stood out as the best experience among the hotels.\n\nInterlaken - Hotel Derby (3-star)\nAfter a long train and bus ride, we arrived at Hotel Derby in Interlaken only to discover there was no lift. Our room was located on the 3rd floor, and carrying (see picture) our bags up caused back pain. Furthermore, there was no toilet in the room; we were directed to an external toilet.\n\nAs a tour agency, it’s essential to conduct due diligence and personally experience accommodations before recommending them to customers. Managing customer expectations is crucial for a positive travel experience.",
      "time": 1718570633,
      "translated": false
    },
    {
      "author_name": "Sharon Lim",
      "author_url": "https://www.google.com/maps/contrib/118377386096134568721/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKQnc4RvS5j7wJAN7dWa21_QvRfqzklTCJq-FzakumfKEJ1_Q=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Ricky provided excellent service in helping me with my air tickets. He was very patient even though the communication was done over WhatsApp, and extremely helpful in pointing out better deals. I would like to extend my appreciation to him. Highly recommend finding him for your travel needs.\n\nDo note that the company’s admin charges for the ticket are slightly high, but I guess that’s a trade off for the service that is rendered… although it would be good for the company to review and lower the admin price for kids since they are not paying full fare ticket.",
      "time": 1738021737,
      "translated": false
    },
    {
      "author_name": "Angela Tran",
      "author_url": "https://www.google.com/maps/contrib/105121710767095784652/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocISTcbWtduDTVYozgmmACBEiX8G4cBzv37wWvyrYdj1NXfjdQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "7 months ago",
      "text": "Terrible service!\nIn June we came in their office in Parkway Parade to book for our cruise in October. Today I tried to do the online checkin as in the ticket stated it was mandatory. I was panic when the system could not find our details. I messaged them and waited until they opened at 11am. I gave them 30min to check for me, so 11.30am I called, they didn’t pick up but messaged me that let them check. It was totally fine. After that from 12pm to 12.38pm I made 5 phone calls but in vain. I messaged also no reply. I called Resort World hotline to check if anything was wrong with my reservation and I was shocked to know my reservation was for cruise on 10 sep which was over. I made a trip to their office and they seemed not to know how to solve the problem until I recommended them to call RW to check. After the call they printed out the new ticket with different reservations ID and never explained, admitted and apologised for their mistake. They didn’t feel sorry at all. On top of that they never informed us that no need to do online checkin even though it was mandatory in the ticket. Being their long term customers I must say that their service has not ever been good, but fine with us as long as no mistake made. And when mistakes made just try to solve it as soon as possible and must communicate with customers and sincerely apologise for the mistake. I was so disappointed with their terrible service.",
      "time": 1728288902,
      "translated": false
    },
    {
      "author_name": "Dolly Chung",
      "author_url": "https://www.google.com/maps/contrib/103672189287297454063/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLOQ3eYe03OTxwrPf4U1cplJNHWyQQe-QJqjcW_Qr36uh5P_w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "Ricky Ngo at PriceBreaker Parkway Parade is a true professional. Knowledgeable about travel offerings, super patient and friendly, full of travel tips. Ricky has been very good to help us with processing refunds from cancellation caused by the Covid pandemic. Will definitely rebook our holidays with him once the situation clears.",
      "time": 1595397289,
      "translated": false
    }
  ],
  "types": [
    "travel_agency",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15067633567678691000",
  "user_ratings_total": 15,
  "vicinity": "80 Marine Parade Road, #01-68"
}