{
  "formatted_address": "249 Beach Rd, #01-249, Singapore 189757",
  "geometry": {
    "location": {
      "lat": 1.3003283,
      "lng": 103.859646
    },
    "viewport": {
      "northeast": {
        "lat": 1.301585480291502,
        "lng": 103.8610603302915
      },
      "southwest": {
        "lat": 1.298887519708498,
        "lng": 103.8583623697085
      }
    }
  },
  "name": "Prince Coffee House 太子咖啡座",
  "place_id": "ChIJ8eNta1QEBBAR-_UZ24PMUVk",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Germain Wu",
      "author_url": "https://www.google.com/maps/contrib/102857384232830970848/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW8eGwMkUDSuFmJPScNxhTi14jgFtK2y31E8MKav3ETkIkESAcE7Q=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "I visited this restaurant for lunch and was instantly transported back to the 1970s. The decor is incredibly nostalgic.\n\nI ordered the sirloin steak set lunch, and it was cooked to a perfect medium-rare. Surprisingly the food was good. Choice of cut wasn’t the best, as the meat was leaner than I prefer. However, I still had a great lunch. The old-school mushroom soup, homemade lemonade, and sliced oranges for dessert were all delicious.\n\nOverall, the food was good, and the restaurant seems to prefer cooking with less oil, which contributes to its cozy and inviting atmosphere. I would definitely return to this place again.",
      "time": 1744351297,
      "translated": false
    },
    {
      "author_name": "Evan",
      "author_url": "https://www.google.com/maps/contrib/115679410006913486590/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXE7W-xUDT83yGvPCwXyKjhwZN1NZ2ALn1Uu9GS6Xwwye4wG2LU=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Dining in this restaurant made me feel like I was travelling back in time! Don’t be fooled by its inconspicuous exterior, come in to give the food a try & support their long-lasting business!\n\nHad the ox tail stew ($32) & grilled pork chop ($15) — both were delicious & tender. At first glance, the prices seemed a little steep but the HUGE portions made it overall worth the value. I loved the simple vegetables provided (boiled cabbage, carrots & long bean) and potatoes (fried for pork chop, boiled for oxtail stew) that came as sides for the main dishes. The gravy was tasty & not too salty.\n\nSoup of the day (mushroom soup) was slightly underwhelming — seems like it’s just Campbell soup, will give it a miss the next time. Soup also came with garlic bread which was ok.\n\nOwners (aunties & uncle) were friendly and constantly attended to us. They provided us free grass jelly & coconut agar! Kopi O had free refill too 👌\n\nWill definitely come back to try other dishes!",
      "time": 1741517301,
      "translated": false
    },
    {
      "author_name": "Darren Yuan",
      "author_url": "https://www.google.com/maps/contrib/118290984423171066603/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIkzAvMytsZ-7p2CU0oQlaMF24YizBhPtUebD_EJZ5mgTRYzw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Ate the pork chop lunch set for about 12 dollars. Came with mushroom soup and half a toast, pork chop, fries, salad, a choice of drink and banana as dessert. The banana was really sweet! Overall, old school experience, decent food.",
      "time": 1747137419,
      "translated": false
    },
    {
      "author_name": "LSL",
      "author_url": "https://www.google.com/maps/contrib/109035648910573676056/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVXaI3N9jC8zXqlbDLNyZXLe9Yk4IIH2U0STZ4IG9SMcH3PjPjkEQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "I initially wanted to try their famous hainese pork chop rice but end up i grab the set lunch deal which is just Sgd11 plus. Generous portion of chicken chop with fries and vegetable; mushroom soup with bread and a big glass of lemon tea and a cup of cut banana as dessert i think is a very reasonable lunch deal you should try! The staff are made up of elderly happy soul and full of energy to also promote their famous yam cake (15) and chicken pie. Boss is already over 80! I bought the yam cake and wow i give a 4.5/5 rate- lots of yam and solid piece you will not regret. Btw they have some chinese sausages in it just in case you dont like. But our family said so nice ;)  I hope to go back for other dishes soon! Support local old restaurant especially they are the happy old one. They be very happy for your support. The shop is next to the beach road famous big prawn noodle establishment.",
      "time": 1747048218,
      "translated": false
    },
    {
      "author_name": "Debbie Wee",
      "author_url": "https://www.google.com/maps/contrib/104074957525518815475/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVSZbRsoux29XdwAiSf9Jy_G-so4eVe7gNZEEg3c7t0Ry4fvDth=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "An absolute gem from the 70s heydays. The steak is incredibly delicious, could tell it’s done by a very seasoned sifu. The accompanying sides and desserts soup is so worthwhile the price. The atmosphere is vintage simple, cozy and the service is so warm and personal. Really the best steak I’ve ever tasted. Will come back for more to try their other signature dishes.\n\nI don’t fancy grilled onions cuz it’s not easy to cook though simple but here’s so good and sweet! I finished everything!\n\nThis is a must visit - those rare gems from the past that’s here and now with amazing foods. Loved the food so much I forgot to take all the rest pictures, finished them all in a go!",
      "time": 1740824015,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6436150209177843195",
  "user_ratings_total": 470,
  "vicinity": "249 Beach Road, #01-249"
}