{
  "formatted_address": "259 Bukit Panjang Ring Rd, #01-19, Singapore 671259",
  "geometry": {
    "location": {
      "lat": 1.3771609,
      "lng": 103.7728841
    },
    "viewport": {
      "northeast": {
        "lat": 1.378443080291502,
        "lng": 103.7744730802915
      },
      "southwest": {
        "lat": 1.375745119708498,
        "lng": 103.7717751197085
      }
    }
  },
  "name": "Prohealth 24-Hour Medical Clinic",
  "place_id": "ChIJByKUI6cR2jERRsbybL1MTUg",
  "rating": 2,
  "reviews": [
    {
      "author_name": "Ray",
      "author_url": "https://www.google.com/maps/contrib/108578922454195442331/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWUpPX4bF6fOpaCxT1Z3sinpj3j8J2vqcBvwPSc1-kXCH_G6tPv=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Enquired about the pricing for Influenza Vaccination for an elderly family member earlier today (15/02/25) at 1300hrs estimated. The staff over the phone mentioned that the cost is only $9 with a Pioneer Card, and that I can bring my family member down ANYTIME of the day.\n\nHeaded down with the elderly family member and had the jab at estimated 1820 hrs, the locum doctor gave the jab. Afterwards when we were due for payment, the staff member - a malay lady told us that the final bill is $40. We were confused and asked why the price was so high and not what was previously quoted with a pioneer card.\n\nThe lady then told us the time slot we have was under a locum doctor. Hence, the $9 offer could not be valid. In addition, she mentioned that she was not around to prevent the locum doctor from giving the jab as the offer would not be valid. The junior staff - a chinese lady was unsure about the protocols as to how the $9 offer goes about.\n\nIf so, why did the caller tell me that I could come ANYTIME.\n\nEdit: Updated as of 17/02/25. My family member received a phone call from a staff by the name of Xris, who was helpful in refunding us the excess of $31 from the initial billing of $40.\n\nGlad to see prompt action being taken to resolve miscommunications and I hope that such occurences do not happen in future.",
      "time": 1739784436,
      "translated": false
    },
    {
      "author_name": "Lee Hong Leong",
      "author_url": "https://www.google.com/maps/contrib/114542141840921746631/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIJr9b0-uedsnxvZ0t4ieWtAqOpWIRcstuojsqXGtA7LXVKpw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "On 11 Jan 2.30am we brought our granddaughter who had a very high fever during a heavy dowpour to this clinic. According to the Internet this clinic is nearest to us. We brought her there just to read this on the door \"CLINIC CLOSED NO DOCTOR\". REALLY FRUSTRATING AND DISAPPOINTING.  CAN'T THEY UPDATE THIS INFORMATION IN THE INTERNET.\n\n13 Jan - I was at Bangkit. Went into the clinic to tell of my experience and what they should have done. Response from the receptionist and another officer was that they had pasted a notice on the door implying that it was good enough. Did she really think? Do they expect us to go all way at 2.30 am just to read this message !?",
      "time": 1736759262,
      "translated": false
    },
    {
      "author_name": "V",
      "author_url": "https://www.google.com/maps/contrib/111052367766857013840/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXqyekcDZ51Yf2z6f63TuYndmYufSjbA6IVh_njGDOcBPqKOQXR=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "7 months ago",
      "text": "I visited this clinic around 2:30 a.m. after landing in Singapore, and the doctor on duty was Beulah Patricia. I know it’s a weird time for a visit, but I really wanted to get checked out. When I registered, I could hear the receptionist telling the doctor there was a patient, and the doctor responded with a pretty frustrated \"HUH? WHAT?\" It was clear she wasn't happy about being woken up.\n\nWhen I saw her, she looked half-asleep and didn’t seem fully engaged. She diagnosed me with a mild infection, which was fine, but when I asked for two days of MC to recover, she just gave me one without much explanation. It felt like she didn’t really care. The next day, I went to a polyclinic for a second opinion, and the doctor there gave me three days MC to rest and prescribed better antibiotics.\n\nRecommendation to the doctor: I get that a 2:30 a.m. visit isn’t ideal, but as a doctor, it's part of the job to be professional and provide proper care, no matter the time.",
      "time": 1727776186,
      "translated": false
    },
    {
      "author_name": "YL",
      "author_url": "https://www.google.com/maps/contrib/107635851269331591315/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLwtxofNzy8p5oXd6gcxTuAxUgapfTo6GeRxePJ_DigJBWEyg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "Don't be fooled by the name. It is not 24 hours. Went after midnight it was closed. If going by car and really sick, don't go to this clinic. The parking is multistorey so if you are vomiting or having diarrhea you won't have energy to walk over. Not accessible at all.",
      "time": 1737796587,
      "translated": false
    },
    {
      "author_name": "Suraidah Hassan",
      "author_url": "https://www.google.com/maps/contrib/109111859315409499536/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUKccNFetbEuLDg0o-BOFzlgwk5AeLqLibrtIckqmI1_PrF6N55ag=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "4 months ago",
      "text": "Been there 3x , and 3x it was the locum doctor.. very hard to get the usual doctor in nowdays.. locum doctor doesn't even listen properly and just dismissed people.. once was asked to leave the room just because i didn't agree with him to go the hospital when i can be handled with just antibiotics as per usual..",
      "time": 1736858969,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5209904720397911622",
  "user_ratings_total": 159,
  "vicinity": "259 Bukit Panjang Ring Road, #01-19, Singapore"
}