{
  "formatted_address": "211D Punggol Walk, #01-667 Punggol Ripples, Singapore 824211",
  "geometry": {
    "location": {
      "lat": 1.400912,
      "lng": 103.8992535
    },
    "viewport": {
      "northeast": {
        "lat": 1.402357330291502,
        "lng": 103.9006210302915
      },
      "southwest": {
        "lat": 1.399659369708498,
        "lng": 103.8979230697085
      }
    }
  },
  "name": "Punggol Ripples Family Clinic",
  "place_id": "ChIJIwvg0AkW2jERnchAzTJRYG8",
  "rating": 2.3,
  "reviews": [
    {
      "author_name": "Suraya Gany",
      "author_url": "https://www.google.com/maps/contrib/114094151276262629594/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIVck0xw6jpyGLiO4hh7-UudoZpmhqxSKlIKinh8IkXjcqlNw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "Always not open according to opening time stated online and clinic door!\n\nReplying to your ridiculous reply!\n\nInstead of running a clinic which is to serve the public as a doctor, why not consider a salon? This can then be really\n“By appointment” only ya! I suggest you spend time analyzing all your one star feedback from actual people who have visited your clinic if you really wanna be considered good! People don’t just waste time giving anyone poor feedback if you are ACTUALLY THAT GOOD BUDDY! Just close the clinic for good! Do everyone a big favour!",
      "time": 1735451927,
      "translated": false
    },
    {
      "author_name": "zuwei -",
      "author_url": "https://www.google.com/maps/contrib/108643121357975442148/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXZa_GLH8f61mIHSyd8erdKr6scXcvgr2GemRrMLy3dnujAsS9neQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "7 months ago",
      "text": "WORST clinic in punggol. Was feeling uncomfortable due to suspected food poisoning and visited this clinic since it was the nearest to my house despite the bad reviews. Was told to “not vomit in the clinic” since it will take 1 hour for them to clean it up. Doctor was not the least bit sympathetic and the clinic seems to have a lack of facilities (unable to run any tests) and just referred us to the ANE. Really disappointing experience and will NEVER EVER be back. Sincerely suggesting all to avoid this clinic as this is DEFINITELY NOT the right way to treat patients.\n\nReply: Can you compare an apple to an orange? One act of “sympathy” to another? While you might have done certain acts of “sympathy” as mentioned above, was saying “do not puke in the room as it takes 1 hour to clean” appropriate in that situation? Perhaps your 20 years of experience as a professional medical practicioner has enabled you to perform your due diligence (which im sure every other doctor will be able to as well). Was the comment made really essential in that situation? Do let me know if im wrong but yes you may be an outstanding doctor but definitely not one I will ever be visiting again (just look at the ton of other reviews that shows your lack of sympathy as a doctor, the number speaks volumes) I do apologise for the misjudgement on the lack of facilities but I firmly stand by my point on the lack of sympathy. Im sure the residents of Punggol can decide for themselves based on the other reviews as well. Thank you for the doctor’s memo you have written but safe to say, this has definitely got to be one of the WORST experience I’ve been through.",
      "time": 1728543063,
      "translated": false
    },
    {
      "author_name": "ZH",
      "author_url": "https://www.google.com/maps/contrib/113156429332289363095/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIz6mK1vmO1VI_TsIxbudINNe0VLDxMSvVoZGfnAIJnJWvOhA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Ridiculous clinic. There are either no doctors or no slots available. Then when I finally booked an appointment for my father, waited for 2hours and still have not seen doctor yet. Simply a waste of space for the nearby residents. Should just give up space for other more legit clinics.",
      "time": 1688633971,
      "translated": false
    },
    {
      "author_name": "Daniel K",
      "author_url": "https://www.google.com/maps/contrib/116203897971068223455/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUyMXv-j11f4C4jaqdhQ0SHFyiJv5o0Ta-4_Pokz0PquiG36Dqu=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "9 years ago",
      "text": "My experience will specifically focus on the long waiting time and unjust treatment prior to consultation. I have no comments on the treatment as it is, afterall, a GP. I waited for >1 hr even though I am second in the queue. My overall waiting experience was terrible as I was carrying a sick boy all these while. With a lack of a proper queue system, the doctor saw another 3 more patients before seeing me.\n\nNot making to make a fuss, I queried only upon payment. It's unjust because she mentioned that patients were queued, based on physical presence in the clinic. Yet there were clearly a family of a mum, 2 children, & 2 grandparents - all of whom appeared last minute and clearly came 30 minutes after I arrived. But they were given preferential treatment to consult the doc before me. Just before they 'pestered' the reception counter more than me?\n\nI am truly disappointed at this clinic. Having called to registered, having told I was second in the queue, having to wait for more than 1 hr, having my turn being 'cut' unfairly =  I strongly do not recommend this clinic.\n\nUnless U are on the right end of this unfair treatment.",
      "time": 1449642733,
      "translated": false
    },
    {
      "author_name": "Clement Kwek",
      "author_url": "https://www.google.com/maps/contrib/113986469755701720821/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWE-eB3Y3iMfuAVOvM3UehSAuC_qxYWosIZlp3KwPhcczBHZVgqhg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "7 years ago",
      "text": "My mother in law had to wait for 5 hours at the clinic. She's almost 80 and clinic has the cheek to tell us we could have download the app and make E appointments. So in short, queue management sucks. Even Hai Di Lao restaurant only save 50% of their capacity for reservations and the rest are for walk ins.  Best is we witnessed another customer flaring up with the staffs there. What can I say..  You can have the best education but still lack common sense.\n\nReply: No, your staff did not ask her to go back. You even said that because her mobile contact is not in your system and she can't go back. And when you found that her number was inside your system after we insisted you check. You gave another excuse that because she waited outside the clinic and did not hear her number being called. Its not just bad service, I question your integrity now.",
      "time": 1523868835,
      "translated": false
    }
  ],
  "types": [
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8025503814608013469",
  "user_ratings_total": 45,
  "vicinity": "211D Punggol Walk, #01-667 Punggol Ripples"
}