{
  "formatted_address": "2 Bayfront Ave, B1 - 01A, Singapore 018972",
  "geometry": {
    "location": {
      "lat": 1.2822577,
      "lng": 103.8574964
    },
    "viewport": {
      "northeast": {
        "lat": 1.28552475,
        "lng": 103.8617777
      },
      "southwest": {
        "lat": 1.280434550000001,
        "lng": 103.8560693
      }
    }
  },
  "name": "Punjab Grill",
  "place_id": "ChIJx4wPggYZ2jER-r1FKfR0iRI",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Hena Shad",
      "author_url": "https://www.google.com/maps/contrib/105324684235747630371/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK06HXjy3T975nxHNP6F-eBBbQPwHwOiJkLvVSAA79doso0Dw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We recently had the pleasure of dining at Punjabi Grill in Singapore, and it was a fantastic experience from start to finish. The team welcomed us warmly the moment we walked in, striking that perfect balance between friendly and attentive without being overbearing.\n\nWe kicked things off with a mix of chicken tikka and kebabs, each one packed with bold flavor and grilled just right. The smoky spice blend was spot-on and really set the tone for the rest of the meal.\n\nFor the mains, we went with the dum chicken biryani, butter chicken, and makhni daal. The biryani was aromatic and full of depth, with each bite bursting with flavor. The butter chicken was creamy and rich, with that unmistakable Punjabi flair, and the makhni daal was beautifully slow-cooked, comforting and indulgent in all the right ways.\n\nDessert was a real standout. The chef’s special paan ice cream was a surprise favourite; refreshing, unique, and full of personality. Every dessert was thoughtfully presented and made the perfect ending to an already memorable meal.\nHis passion for food is palpable, and you can taste it in every dish. It’s rare to see a chef so connected to his craft, he truly cooks from the heart, and it shows.\n\nPunjabi Grill isn’t just about great food, it’s an experience. If you’re looking for rich, authentic North Indian flavors and warm, genuine hospitality, this place absolutely delivers.\n\nHighly recommend it, we’ll definitely be back!",
      "time": 1744618722,
      "translated": false
    },
    {
      "author_name": "Vaneet Taneja",
      "author_url": "https://www.google.com/maps/contrib/118357669181531504067/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKcc4iSYKZS1Qq-5BK-j10JsS0YNA8xxDjbom4kzzzEk4yFkw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Was looking for an ideal place to treat a very close friend who is a hardcore fan of India food. His special request was to have appetizing Indian cuisine so without delay, I realized that for an international-class dining experience with sensational flavours, Punjab Grill at Marina Bay Sands is the place to go!\n\nThe moment we stepped in, we were welcomed with impeccable service and a cozy ambiance that leads to an amazingly unforgettable dining experience. The chef, Gorang Anand at Punjab Grill is surely the master of his craft. What he prepared here is not only delectable but also visually pleasing. Highlights of the feast are Tandoori Jheenga that is grilled perfectly with the optimal smokiness in it, and the soft, juicy, and spice-infused Lamb Chops. Rara Meat and Lamb Shanks are cooked to a fault—bursting with flavours and with complete satisfaction.\nHis Butter Chicken is a requisite order—creamy, comforting, and exploding with bright flavours. We relished it with the extra crispy bullet naan, which is the perfect vehicle for soaking up all that delicious sauce.\n\nTo end the meal on a sweet note, the Badam Halwa is a decadent and pleasing dessert that will not disappoint, and the Paan ki Kulfi offers a cool, creative twist that will linger long afterward.\n\nOverall, Punjab Grill at Marina Bay Sands gave us a fantastic dining experience. With the excellent chef, top-notch service, and sumptuous food, it's a memorable meal that's worth each bite. Surely going back there super soon.",
      "time": 1744100288,
      "translated": false
    },
    {
      "author_name": "Ibrahim Mahudhy",
      "author_url": "https://www.google.com/maps/contrib/111714884463551709306/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUsVO8xKpMUdBovEcmaI5XMT8xHcAdw1rgqLce4CZpStxxEJ04_1A=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Our recent dining experience at Punjab Grill Singapore was nothing short of exceptional. From the warm welcome to the attentive yet unobtrusive service, every detail was perfect. We entrusted our waiter with recommendations, and his suggestions were spot-on!",
      "time": 1746012697,
      "translated": false
    },
    {
      "author_name": "Jia Pin Lee",
      "author_url": "https://www.google.com/maps/contrib/107847450021351030886/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV2kiTzpebKwh5orpcA7XdN2qPxaAa9LarB45zR_ig3mymPvaHD=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "Services were great. The staff were friendly and polite. Plates were changed frequently. Complimentary cracker, palate cleanser, and hot towel were provided.\n\nMany varieties of food and drink to choose from, veg and non-veg, spicy and non-spicy. The food was good, but not to the level to shout about. Taste was balanced, not overly enhanced. Gravy provided was sufficient, too. Prices were above average.",
      "time": 1729815701,
      "translated": false
    },
    {
      "author_name": "Sheetal pandya",
      "author_url": "https://www.google.com/maps/contrib/107153608657496257940/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVGGyPHzQPA-uXNu2SAbnpP6iEtYEFmJExxJPU2_d10RyCEbwfg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "Punjab Grill in Singapore is a fine dining Indian restaurant that offers an exquisite culinary experience. Located in Marina Bay Sands, the restaurant is known for its luxurious ambiance and attentive service. The menu features a blend of traditional and contemporary North Indian cuisine, with a focus on dishes from the Punjab region. The presentation is elegant, and the flavors are rich and well-balanced. Vegetarian options are also available, catering to diverse dietary preferences.\n\nThe wine and cocktail selection is impressive, complementing the robust flavors of the food. Overall, Punjab Grill is an excellent choice for those seeking a sophisticated dining experience with high-quality Indian cuisine in Singapore.",
      "time": 1721674620,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1335727356505341434",
  "user_ratings_total": 1012,
  "vicinity": "2 Bayfront Avenue, B1 - 01A, Singapore"
}