{
  "formatted_address": "74-A, Jalan Eko Botani 3/2, Taman Eko Botani, 79100 Iskandar Puteri, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.4392759,
      "lng": 103.6201949
    },
    "viewport": {
      "northeast": {
        "lat": 1.440665830291502,
        "lng": 103.6216309802915
      },
      "southwest": {
        "lat": 1.437967869708498,
        "lng": 103.6189330197085
      }
    }
  },
  "name": "Q-dees Taman Eko Botani",
  "place_id": "ChIJma5rgTgL2jER5KbQ9CkfVag",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Ying Fanny",
      "author_url": "https://www.google.com/maps/contrib/109095065217005112300/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUjwnayScBuQEVIOy0ZwXeGgVh2vluUSC-R6RxdDYbT5H7Od8X7rA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I sincerely thank the Qdees Eco Botanic for giving my child a happy childhood. Children learn more knowledge and have more fun here . The love of teachers is the greatest motivation for my child to learn.Dont miss out kids first study golden period ,truly recommend the best Preschool at Qdees Eco botanic 😄",
      "time": 1731403545,
      "translated": false
    },
    {
      "author_name": "Ankita Sinha",
      "author_url": "https://www.google.com/maps/contrib/106799770724517909881/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVxLISj2s60TN3rc8uwNZYGnIOw2JA0zdMZXWydfhkWImEkPaNPxw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I enrolled my younger child at Qdees Ecobotanic and have been genuinely impressed by their approach to nurturing young minds. The dedication of the teaching staff, their politeness, and attentiveness truly stand out, making every interaction a positive experience. My elder child attends an international school, yet I find myself even more pleased with Qdees. Their events, such as sports day and graduation day, are handled with great care and creativity, making each moment memorable for both the children and parents. The teachers and staff at Qdees Ecobotanic are committed to excellence, creating a warm and supportive environment that fosters growth and joy in learning. I will highly recommend this school to any parent looking for a quality preschool and daycare for their child. Thank you, Qdees Ecobotanic, for making this journey so wonderful!",
      "time": 1731294403,
      "translated": false
    },
    {
      "author_name": "Baski Shantu",
      "author_url": "https://www.google.com/maps/contrib/115318240984583690188/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ2aB1iCmk-s1E7DY5egE-M6cAAzS3iv6ELca13e_UGyAcOmQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "QDEES ECOBOTANIC It is an excellent preschool. My daughter studied there, and her progress has been remarkable. The teachers are polite, patient, and always welcoming. They strictly follow SOPs, maintain high standards of cleanliness, and ensure a well-organized environment. The management is outstanding.⭐⭐⭐⭐⭐",
      "time": 1736651680,
      "translated": false
    },
    {
      "author_name": "Havienaasherny Shanmugam",
      "author_url": "https://www.google.com/maps/contrib/113846406764087994743/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUcSNzWY1YoxLayOy_iCGUCmRsf8FCpu2guQgKlIOzXABPivF4=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "The staff is truly exceptional. Each teacher is not only qualified but also genuinely passionate about early childhood education. They take the time to build relationships with each child, ensuring that they feel safe and valued. I appreciate how they communicate regularly with parents, providing updates on progress and sharing insights into their daily activities.\n\nSafety is clearly a priority at Qdees Eko Botani. The facility is well-maintained, with secure entry points and a clean environment. The staff follows strict hygiene protocols, which gives me peace of mind knowing that my child is in a safe space.",
      "time": 1722422584,
      "translated": false
    },
    {
      "author_name": "Thurgesswara Shanmugam",
      "author_url": "https://www.google.com/maps/contrib/117635016240132959897/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKUAhDSMzW8e7V-sVSfMzi1DWCYwtzsK2TYp_DnNGuETpKisA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "Qdees Eko Botani fosters a strong sense of community among families. There are regular events where parents can get involved, whether through volunteering or attending special celebrations. This has allowed us to connect with other families and build a supportive network.\n\nOverall, I highly recommend Little Explorers Preschool to any parent looking for a nurturing and enriching environment for their child. The combination of dedicated staff, engaging curriculum, and a focus on community makes it an outstanding choice for early childhood education. My child has thrived here, and I am grateful for the positive impact this preschool has had on their development.",
      "time": 1722422999,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "school",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12129635436453734116",
  "user_ratings_total": 23,
  "vicinity": "74-A, Jalan Eko Botani 3/2, Taman Eko Botani, Iskandar Puteri"
}