{
  "formatted_address": "Blk 467 Bukit Batok West Ave 9, #01-02 Multi Storey Car Park, Singapore 650467",
  "geometry": {
    "location": {
      "lat": 1.3573216,
      "lng": 103.743515
    },
    "viewport": {
      "northeast": {
        "lat": 1.358580730291502,
        "lng": 103.7446898802915
      },
      "southwest": {
        "lat": 1.355882769708498,
        "lng": 103.7419919197085
      }
    }
  },
  "name": "Q & M Dental Surgery (Bukit Batok West)",
  "place_id": "ChIJTWDew_8R2jERkVgbE48GoSk",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Yuanfeng Chan",
      "author_url": "https://www.google.com/maps/contrib/103714175368358376138/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIAZzCUM_6zs5n4AXmw1_EvZAxIXghl6Q4XlWCv0ibNAG_AUg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Dr Charlene is the best dentist I have ever seen! Super nice, patient, friendly and most importantly, skillful! Being someone who is terrified of dentists, she made me feel at ease and comfortable during my visit. Wee is also super nice and accommodating to my appointment requests every time. Thumbs up for Q&M Dental Bukit Batok West👍👍👍👍👍👍",
      "time": 1741149059,
      "translated": false
    },
    {
      "author_name": "Chloe YM",
      "author_url": "https://www.google.com/maps/contrib/110747382598653320515/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUF5Zc0F1YgGpo18ab2kTAfZKsyCWecBzMPHxk5j1tep7ltxn02=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I visited the dentist due to a toothache, and the doctor was incredibly patient, taking the time to explain everything thoroughly. The service was excellent, and this is by far the most patient and attentive dentist I have encountered.",
      "time": 1742632752,
      "translated": false
    },
    {
      "author_name": "Shazali Aziz",
      "author_url": "https://www.google.com/maps/contrib/104170715533478417782/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK3I-m2FekN2oGawrZim1qk-4L_C96PN9Q9ZLaWo03aT9OTDQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I highly commend Dr Ng from Q&M Dental for her exceptional professionalism, honesty, and reliability. Her advice is trustworthy and unbiased, and she consistently demonstrates integrity in her interactions with patients. Having had a previous experience with a dentist for a wisdom tooth extraction, I can confidently say that she is one of the two most experienced and skilled dentists I've met.\n\nWhat truly impressed me, however, was her exceptional skill and efficiency in extracting the tooth. Not only did she complete the procedure in record time - from 1445 to 1500 (less than 15 minutes) - but the actual extraction itself took less than 5 minutes. Moreover, she managed to extract the tooth in one piece, without it breaking, which is a testament to her expertise and precision.\n\nI was also deeply impressed by her thoughtful and informed advice. When I asked her whether to extract one or two teeth, she took the time to thoroughly examine my teeth and provide a well-reasoned recommendation. Her commitment to testing and evaluating my teeth before offering advice demonstrates her unwavering professionalism and dedication to her patients' well-being.\n\nWhat's even more remarkable is that despite her youth, she possesses a level of professionalism and expertise that is truly inspiring. Her advice is always centered on the best interests of her patients, rather than driven by financial gain. This rare quality has earned my deepest respect and trust.\n\nHer exceptional professionalism has not only impressed me but also inspired me. I hope that more young professionals, especially those in the medical field, will follow her example and adhere to the highest standards of professionalism, ethics, and patient care. She is a shining example of what it means to be a dedicated, compassionate, and skilled healthcare provider.\n\nIn the future, I hope to avoid any toothaches, but if they become unavoidable, I will not hesitate to return to Q&M Dental and specifically request for her services. She is, without a doubt, my first choice for any dental needs.",
      "time": 1733738565,
      "translated": false
    },
    {
      "author_name": "Fathi Al-Kamil",
      "author_url": "https://www.google.com/maps/contrib/102017514390064153066/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUE8n-ufxbo0SYnTiHGFdJdZJ2sKzLRriaMS2F8ct4YXRjLjX8t=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Did polishing and scaling for myself and my 2 kids (5 and 3 yo).\nDr Charlene made sure that the kids were comfortable and was very friendly. Did not rush the kids or scare them in any way.\nWould recommend.",
      "time": 1735963127,
      "translated": false
    },
    {
      "author_name": "Tommy Ng",
      "author_url": "https://www.google.com/maps/contrib/108333284987009118312/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXYGeoWm8d18dQhWf3-E6J0Uq413NSou1Z4VSK6-EHtdDHaN81g=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "This Q&M outlet is quite isolated and inaccessible. They are facing Bukit Batok Hillside Park which has an ongoing BTO project. The only public transportation available is bus 991. To avoid getting lost, look for West Plains @ Bukit Batok and look for the multistorey carpark and they are located at the ground floor.\n\nMost Q&M have dentists that are dedicated and professional. They are frequently fully booked thus to avoid disappointment, do not walk-in and make a phone call to their outlets to make an appointment. The receptionist of this outlet was approachable and friendly. I was attended by Dr. Jeffrey whom was attentive and detailed in his works. Definitely make an appointment and come by to maintain the health of your teeth and gums!",
      "time": 1689508967,
      "translated": false
    }
  ],
  "types": [
    "dentist",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2999686038376110225",
  "user_ratings_total": 91,
  "vicinity": "Blk 467 Bukit Batok West Avenue 9, #01-02 Multi Storey Car Park"
}