{
  "formatted_address": "21 Choa Chu Kang Avenue 4 B1-06 Lot One Shoppers' Mall, Singapore 689812",
  "geometry": {
    "location": {
      "lat": 1.3848195,
      "lng": 103.7449224
    },
    "viewport": {
      "northeast": {
        "lat": 1.386124480291502,
        "lng": 103.7462855802915
      },
      "southwest": {
        "lat": 1.383426519708498,
        "lng": 103.7435876197085
      }
    }
  },
  "name": "Q & M Dental Surgery (Choa Chu Kang)-Lot One Shopping Mall B1",
  "place_id": "ChIJax_y2-sR2jER0RV2HI7wkAw",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Choo Boon Linn",
      "author_url": "https://www.google.com/maps/contrib/115885937348109383369/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVd9EOgBduPWZzJID9Gexf14k5mnEpg-BNJcY_BzCTsVNUskLU=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Today I went to Q&M Lot One for the first time ever for scaling and polishing, I'm impressed!! My attending dr was Dr Jeffrey! First time rarely bleed during dental procedures and no bad or unpleasant feeling during or post-visit, except a very little paste-on feel for someone who is highly self-aware or sensitive like me -- I can feel the foreign item, ie: resin used in teeth filling that I will need to adapt with. First time ever get tooth filliing in life, like 6 teeth at one go, but zero pain! Dr in the past never address my gum thinning issue due to overbrushing, and this is the first one ever! And because of my gum loss or to be precise, gum recession, it led to hole near the root canal zone of my teeth, so gotta fill up to avoid decay...\n\nThis dr is really nice, gentle and detail, also, not \"forcy\", and very transparent in telling me about my wisdom teeth conditions too, and alerted me that my bottom wisdom teeth are actually very deep inside and near to nerves, so there is risk in procedure and will need specialist for help.\n(For this, last year Minmed Dental JP just told me that the procedure won't have issue, and I shall consider to do asap .. I compared the x-ray, looked the same.. so Dr Jeffrey today is much better and careful in diagnosing the conditions precisely using the x-ray output. He has the right attitudes which a dentistry practitioner should have!).\n\nDr may looks young, but he is definitely skillful and professional. Highly recommending to pay a visit with him here!",
      "time": 1743262745,
      "translated": false
    },
    {
      "author_name": "Shannon Teo",
      "author_url": "https://www.google.com/maps/contrib/117733692711711687375/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVEJ70Q5b94c01NYy8lPqlQQDnX1kBkChelPWT7yNhC5FYGXfA7=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Booked a last minute appointment to get my wisdom tooth removed the day before. As someone who's paranoid with a low pain tolerance, I am beyond grateful to Dr Kevin Yong for being so patient and checking how I was feeling throughout the procedure.  Thank you for making it so quick and painless! The staff there were very kind and understanding too :)",
      "time": 1744786612,
      "translated": false
    },
    {
      "author_name": "Chonghan Lim",
      "author_url": "https://www.google.com/maps/contrib/114102913037028869397/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ4nyrKjgFY-xkDKnMNOUWTgXe1hPGUSUqksGWnbVjOVn0gnA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Attended by Dr Jeffrey Lim for yearly teeth cleaning, scaling and polishing, did tooth filling as well and he was very professional and meticulous. Ensures you feel well and okay all the time and explains procedures in great detail. Injection felt painless to my surprise, he is very skillful at what he do. Awesome team as well for admin matters and attentive nurse for doctor assistant. Highly recommended and always my first choice for teeth related matters/semi-annual cleaning.",
      "time": 1735359271,
      "translated": false
    },
    {
      "author_name": "Raihanaa Firdaus",
      "author_url": "https://www.google.com/maps/contrib/118445651654016287548/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW8z_7fwbCQWZn6GHWgZy9sywR5x91YM5QpCPpwqMOqJPYNgfU=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Dr Jeffrey Lim and his nurses really put me at ease for my two very large fillings. He told me\nThat he had injected local anaesthetic but I didn’t even feel anything!!! Coming here to Q&M is the best decision I have ever made for my dental care! LOVE YOU GUYS!!",
      "time": 1739611566,
      "translated": false
    },
    {
      "author_name": "Kit Neo",
      "author_url": "https://www.google.com/maps/contrib/104080931301900601841/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVjsxMV449yyPkLgFfRuOX1swYbvTbcvVIwctjKmuCr8MD9xX_B=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I am super scared of going to the dentist. Every time I walked past Q & M Dental at Lot 1, I would just see see but walked away. But finally, I decided that I really must take care of my oral health.\n\nSo, I booked an appointment with Dr. Emma Wang at Q & M Lot 1, and I must say, it was the best decision ever! Dr. Emma was so reassuring and gentle during the teeth cleaning. She really put me at ease and made the whole experience so comfortable.\n\nThe clinic is clean and the staff, think her name is jen, are friendly too. If you have dental phobia like me, I strongly recommend Dr. Emma.\n\nNow, I'm not so scared to go back for my regular check-ups! Thank you for such a wonderful experience.\n\nEdit: Back for 6 months review, still as good!",
      "time": 1743560935,
      "translated": false
    }
  ],
  "types": [
    "dentist",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=905488018254992849",
  "user_ratings_total": 87,
  "vicinity": "21 Choa Chu Kang Avenue 4 B1-06 Lot One Shoppers' Mall"
}