{
  "formatted_address": "10 Tampines Central 1, #04-18 / 19, Singapore 529536",
  "geometry": {
    "location": {
      "lat": 1.3542047,
      "lng": 103.9450223
    },
    "viewport": {
      "northeast": {
        "lat": 1.355491980291502,
        "lng": 103.9466396302915
      },
      "southwest": {
        "lat": 1.352794019708498,
        "lng": 103.9439416697085
      }
    }
  },
  "name": "Q & M Medical & Aesthetics Clinic (Tampines 1)",
  "place_id": "ChIJnS9VIA492jEReapcRLt6osg",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "Meryl Sunglao",
      "author_url": "https://www.google.com/maps/contrib/104544409862305664294/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJpWrGdCq6VUmS-7WzI39vClYSVAqmqn8qVNoUYTogVlEjOuQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "This clinic is truly exceptional! The doctors are not only highly professional but also genuinely compassionate. They take the time to listen, explain, and provide the best medical advice tailored to your needs. Their expertise and dedication to patient care are unmatched specially Dr Chan.The staff is equally wonderful, kind , attentive, and always ready to help with a smile. Whether it’s scheduling an appointment or addressing concerns, they make the process seamless and comforting.When you’re not feeling well, it’s reassuring to know you’re in such capable and caring hands. I’m so grateful for the amazing care they provide every time. Highly recommend.",
      "time": 1732791911,
      "translated": false
    },
    {
      "author_name": "Bernard Tay",
      "author_url": "https://www.google.com/maps/contrib/116576099071814197363/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIDRLod8S5ACytJp1wNWOsQMqAvbEA16nMgHZd_45Sda6xluQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I recently visited Q&M and had an outstanding experience from start to finish. The staff was warm, welcoming, and very professional, especially nurses Jess and Angie, who went above and beyond to make sure I was comfortable and informed. Their kindness and attentiveness made a huge difference, and they were incredibly patient with all my questions.\n\nDr. David Chan was also exceptional—thorough, attentive, and genuinely invested in my concerns. He took the time to explain my treatment options in detail, ensuring I felt both informed and at ease. I never felt rushed, and it was clear the whole team truly values their patients.\n\nThe clinic itself was exceptionally clean and well-organized, creating a calming atmosphere. I highly recommend Q&M to anyone looking for compassionate, high-quality care. Thank you to Dr. Chan, Jess, Angie, and the entire team for such a positive experience!",
      "time": 1731487072,
      "translated": false
    },
    {
      "author_name": "Shaun Sevilla",
      "author_url": "https://www.google.com/maps/contrib/101300542401671723783/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV2NmQVp9A24QieM3uL5PWYyU0sZcOe5N7yBXHTQSURNUcbQr4j=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "My experience with Dr. Aliah, Dr. David Chan, Nurse Jess, and Nurse Angie was exceptional. Their dedication, kindness, and attention to detail made my visit remarkably pleasant. Dr. Aliah and Dr. Chan carefully listened to my concerns and provided thorough, thoughtful responses. Nurse Jess and Nurse Angie showed genuine care, making sure I was comfortable and well-supported at every step. The team’s professionalism and compassion created a welcoming and reassuring environment. I highly recommend them to anyone looking for attentive and high-quality care!",
      "time": 1734530790,
      "translated": false
    },
    {
      "author_name": "Jeremy Dsouza",
      "author_url": "https://www.google.com/maps/contrib/103817362159964358047/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJbCA5JL3pMKIekrFW7pLherVWpLkCe9VEJgqttYk6Og5NTiA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I had an exceptional experience with Dr. Aliah, Dr. David Chan, Nurse Jess, and Nurse Angie. Their attention to detail, warmth, and genuine hospitality made my visit truly comfortable. Dr. Aliah and Dr. Chan were thorough, attentive, and patient in addressing all my concerns, and Nurse Jess and Angie went above and beyond to make sure I felt cared for throughout. The entire team displayed an impressive level of professionalism and compassion, creating a supportive environment that made a real difference. Highly recommend this team for anyone seeking excellent and thoughtful care!",
      "time": 1731144583,
      "translated": false
    },
    {
      "author_name": "G gan",
      "author_url": "https://www.google.com/maps/contrib/102572069955123769708/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJmoPva-JY-yYwU9081lfnSH288pDkVhSqD_cAN_qIzwW8MKw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "I booked a pneumonia vaccine appointment on the MOH website for Jan 3, 2025, at 11:30 AM. However, when I arrived, the staff informed me that they didn't have stock.\n\nTo make matters worse, they didn't return my call after missing each other's calls. The lack of communication and poor management of vaccine stock has caused me significant inconvenience.",
      "time": 1735874833,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14457252698537110137",
  "user_ratings_total": 90,
  "vicinity": "10 Tampines Central 1, #04-18 / 19"
}