{
  "formatted_address": "113 Aljunied Ave 2, #01-11, Singapore 380113",
  "geometry": {
    "location": {
      "lat": 1.3205186,
      "lng": 103.8862216
    },
    "viewport": {
      "northeast": {
        "lat": 1.321794830291502,
        "lng": 103.8874923302915
      },
      "southwest": {
        "lat": 1.319096869708498,
        "lng": 103.8847943697085
      }
    }
  },
  "name": "Q & M Dental Surgery (Aljunied) Pte Ltd",
  "place_id": "ChIJz05oaKkZ2jERrrvy4ArzXDc",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "thitthit mon",
      "author_url": "https://www.google.com/maps/contrib/110698169243937197241/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVixEyQtPuR-HvHzUkIoVF0jn_aP_P1i3ygl41ms6V9AYAQdsOcFg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "I had a very disappointing experience at this dental clinic. They charged me $120 for what they called an ‘AI scan,’ but it was just a regular X-ray, not even 3D as advertised. On top of that, they added an $18 disposal fee, and the 3-minute consultation cost $30. None of the prices were disclosed upfront, and it felt like they were hiding the costs and charging excessively. The entire experience left me feeling like they were more focused on making money than providing honest, transparent service. I definitely won’t be visiting again. On the other hand, I highly recommend Kim’s Dental Clinic for their honesty and transparent pricing. They’ve always been upfront with their costs and genuinely care about their patients",
      "time": 1741516068,
      "translated": false
    },
    {
      "author_name": "Skye",
      "author_url": "https://www.google.com/maps/contrib/106680895839870597031/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVB-OGLzqBn7pPyQNNFpUgoYiuaZqAq6c4gZFR9mF_bBWdrezqU=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Dr Lee is always professional and patient! He is gentle when cleaning teeth and I did not feel any discomfort even during my wisdom tooth extraction. Super recommended! Thank you Doctor and Ms Nurse 🙏🏻",
      "time": 1746953784,
      "translated": false
    },
    {
      "author_name": "Matthew Tan",
      "author_url": "https://www.google.com/maps/contrib/116512282297052990574/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIwD8Wdl53ULxtf-NG-yec4yVxoPQ-QgXlTLRYxLiY8lXSd8A=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "3 months ago",
      "text": "When I walked into the clinic, the first thing I noticed was that the dustbin next to the dental chair was overflowing, which didn’t leave a good first impression. During my session, the dentist (male, whose name I unfortunately don’t know) performed my polishing, but the experience felt rushed. The entire procedure was completed in about 10 minutes, and I felt that my teeth still looked yellowish afterward.\n\nDuring the initial assessment, he mentioned that I needed an X-ray, highlighted that my gums were unhealthy, and insisted my wisdom tooth had decay that required extraction. While I declined the procedure as I wasn’t experiencing any pain, he persisted, expressing deep concern. Despite his insistence, I stood by my decision and asked to proceed with polishing only. Throughout the session, he appeared tired, uninterested, and even rolled his eyes at times, which didn’t make me feel comfortable or confident in his care.\n\nSeeking clarity, I later went for a second opinion at another clinic. The second dentist provided a very different assessment, stating that my gums weren’t as bad as described earlier and could improve with regular brushing. They also confirmed that my wisdom tooth wasn’t causing any issues and didn’t require extraction. On top of that, the second dentist polished my teeth more thoroughly, and they looked noticeably cleaner and less yellowish afterward.\n\nConsidering my experience, I’m left wondering where all the positive reviews for this clinic come from, as my visit was far from smooth. The lack of professionalism, rushed service, and attempt to push unnecessary procedures left me feeling uneasy. I don’t think I’ll be returning, even though the clinic is conveniently located near me.",
      "time": 1737625458,
      "translated": false
    },
    {
      "author_name": "G L",
      "author_url": "https://www.google.com/maps/contrib/106465050424174270879/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJOIK4eta-d3uRkzjtdU1vK9Fg1N1fCA_zDTJLC0-DH4Ds8yQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "So thankful that they managed to slot me in for the same day appointment today due to my son’s toothache. Dr Janet and her assistant were extremely patient and kind and caring towards my boy who was overly anxious over the small procedure. Their patience and creativity in dealing with him and his anxious antics and wailing deserves honorable mention. Truly appreciate very much. Thank you so much to you both 🙏🙏",
      "time": 1736928458,
      "translated": false
    },
    {
      "author_name": "Khun Seng Chew",
      "author_url": "https://www.google.com/maps/contrib/117961031458768058054/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIqpfw3Yb3MZSA7kBkgCi-wbRzsmH1u1XidvM51N8MZ8EnJXw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Doctor Janet (only on weds) is very patient and explained every step of my dreaded dental appointment. Managed to fill up my decayed hole right at the end of my teeth. Assistant Fenny is also very attentive to my “pain” and doing her best to assist.",
      "time": 1733884203,
      "translated": false
    }
  ],
  "types": [
    "dentist",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3989330597992643502",
  "user_ratings_total": 101,
  "vicinity": "113 Aljunied Avenue 2, #01-11"
}