{
  "formatted_address": "10 Sinaran Drive Square 2 #01-09|16, Singapore 307506",
  "geometry": {
    "location": {
      "lat": 1.3209917,
      "lng": 103.8442243
    },
    "viewport": {
      "northeast": {
        "lat": 1.322383230291502,
        "lng": 103.8454481302915
      },
      "southwest": {
        "lat": 1.319685269708498,
        "lng": 103.8427501697085
      }
    }
  },
  "name": "QQ Rice - Square 2",
  "place_id": "ChIJ65R2W-cZ2jERG8d6BOVky8s",
  "rating": 2.8,
  "reviews": [
    {
      "author_name": "Irene Lim",
      "author_url": "https://www.google.com/maps/contrib/105804445185126817371/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXD8DJY2xjJiMEhi1uXEJV0CKGTTCzFF4IUrDs7PZrUcLaukCyh=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 3,
      "relative_time_description": "4 months ago",
      "text": "I have been eating QQ rice for ages. It is always my favourite go-to food.\nI was at this branch at about 1010am.\nAs there was no one at the count, I walked in to ask for help.\nCalled a few times and a lady from the kitchen shouted : what do you want?\nI told her I wanna buy the rice.\nSo out she came.\nSelecting my options is not a problem, although I felt I better hurry as she seems like she is in hurry and has no patience for me.\nWhen paying, I asked if I could pay by paywave. To which she said cannot, and didn’t bother to offer other options.\nI saw on the counter that they accept PayLah Fave. So I thot that the QR code is for pay now. Which it did not work.\nI asked if the QR is for pay now, she rudely ask me “what do you want”. I was shocked.\nI told her I wanna pay via pay now which is the most basic payment. Unwilling she took out another QR code for me to pay.\nShe handle me my receipt and rice, without saying any word or acknowledging.\nI said good bye to her, and she just ignored me. 😅\nI enjoyed QQ but unfortunately the service needs more training.\nI noticed this brand’s reviews were all about bad service. It is sad",
      "time": 1736395447,
      "translated": false
    },
    {
      "author_name": "Bluerie Lin",
      "author_url": "https://www.google.com/maps/contrib/107675250337305200002/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKM6UbdTxY-xfYr3OaGPeIHFJDpxgVE6Ff--APWVjdAoNP9sg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "It’s been a long time since I ate QQ rice. Used to patronise the outlet at Tanjong Pagar mrt station but it has closed many years. Tried the satay rice which is currently on promotion at $6.90 and an option to top up $1.50 for a hot drink. Not the usual satay sauce as it is more watery. The sauce is tasty and a bit spicy. Hopefully, they can open outlets in the northeast areas.",
      "time": 1744944477,
      "translated": false
    },
    {
      "author_name": "Quinn Lee",
      "author_url": "https://www.google.com/maps/contrib/101443991334884427527/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV9gIjpWrsbRHBF-XFiQDSn0klTA7-0g1iyX2O-TOhusSkUjFtN=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "Service staff, seemingly all non-locals, at this particular outlet are unapologetically feisty, obtuse, unprofessional and boorish, particularly when met with in-store issues. They might seem fine in appearance, but they get defensive and sullen when faced with negative customer feedback. They can even be seen squabbling among themselves. Moreover, the brand has serious sourcing issues for their ingredients, so I would steer clear of any promotions or deals they promote online, especially if they come with expiry dates.\n\nI visited on 14/11/24 with some family members to redeem some vouchers for triangular seaweed rice wrap sets that each come with a drink. However, they only had one out of their three options available, i.e. BBQ chicken, when we had set out to have their vegetarian wraps, i.e. mushroom and emperor vegetable. They explained that they are experiencing delays with their supplies from Taiwan, in a frustratingly matter-of-fact way, and could not provide specific information on when their stock would arrive. They did not make the slightest effort to seem apologetic for whatever inconveniences that their company has caused for patrons like us, considering that we have made a dedicated trip to Novena just to have our breakfast there. Moreover, they did not propose any solutions as to how I can properly redeem my vouchers during this internal crisis of theirs.\n\nI then decided to call their outlet on 18/1/24  before making another trip there, now wary of their prevailing stock issues, only to find that they were completely out of rice wraps. I was then told that their stock would be in on 21/11/24. Prior to that call, I sent some some messages to QQ rice's Facebook page, hoping that they would provide some redress or further information on their stock availability as my vouchers got dangerously close to their expiry dates, but all I got was a series of justifications, like \"we tried our best\" and \"sorry for your disappointment\", rather than \"we are sorry to have caused you much inconvenience and trouble...\" and extending the validity dates of my vouchers.\n\nHaving confirmed availability of their stock, I made another trip to their outlet on 21/11/24, and all 3 options were now there. Since I had 4 wrap and drink sets and could not finish all them myself, with the parties that I had last brought and originally wanted to share with now abroad for vacation, I asked the two aunties if I could redeem all the vouchers that day but collect the sets later in December. They refused curtly and could not care less about me having to finish the 4 sets myself, adding that they could only do that last week, when their stock still had issues. However, I was not informed of that back then. Furthermore, they gave a multitude of inconsiderate responses grossly lacking in empathy and tact, such as saying that I can always redeem the vouchers on another day, to which I retorted that I don't stay nearby. I reminded them that I had already spent a fair bit on transport and time to visit their outlet for redemption, before downing all the beverages alone.\n\nThe darker skinned auntie kept responding in English when I first spoke in Mandarin, and was leisurely having breakfast while I stood at the counter.\n\nOn a grand scheme of things, this incident betrays the fact that QQ rice has no backup supplier from neighbouring countries for seemingly simple ingredients like mushrooms. Otherwise, they are more willing to let their image and brand credibility take a hit than to suffer higher supplier costs as stop-gap measures for contingencies. They also do not communicate with their marketing team to take down their listings for online vouchers when they are already facing issues with supply.\n\nNo amount of money, even if their offerings were extended free of charge, would be able to buy them my support in future. To think that this incident poor supply management, communication between their marketing and logistics teams, and online and in-store service recovery, especially after years of patronising their brand, would end so regrettably.",
      "time": 1732166672,
      "translated": false
    },
    {
      "author_name": "dan wee",
      "author_url": "https://www.google.com/maps/contrib/107174841199330946626/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXDSthAIFMAc8yyL4LKu9PU1dA05hdd1L57NfOBq2Yt8HO3zLWozA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "9 months ago",
      "text": "The meal was good. It was hot, tasty and chewy. Front counter staff was helpful and friendly, but cashier was curt. I really dislike their one-time usage of plastic for the meals. They had paper boxes but only for soya drink and selected meals.",
      "time": 1723531608,
      "translated": false
    },
    {
      "author_name": "S Y",
      "author_url": "https://www.google.com/maps/contrib/114569231582940756419/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU_nsdqXxGlOAZaj1nXEJaXdp9N-wLp8QVoLtM6yaOb5zR-T4Tl=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "We had a nice dining experience here. Healthy, yummy food. Great environment and satisfactory service.",
      "time": 1740400909,
      "translated": false
    }
  ],
  "types": [
    "health",
    "store",
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14684941944757077787",
  "user_ratings_total": 86,
  "vicinity": "10 Sinaran Drive Square 2 #01-09|16"
}