{
  "formatted_address": "400 Commonwealth Dr, Singapore 149604",
  "geometry": {
    "location": {
      "lat": 1.3023642,
      "lng": 103.7973187
    },
    "viewport": {
      "northeast": {
        "lat": 1.303650930291502,
        "lng": 103.7986107302915
      },
      "southwest": {
        "lat": 1.300952969708498,
        "lng": 103.7959127697085
      }
    }
  },
  "name": "Queenstown Chinese Methodist Church",
  "place_id": "ChIJr9n8N0ca2jER02GOtg1ikaU",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Joseph M L",
      "author_url": "https://www.google.com/maps/contrib/116922798604007524309/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIP9ZE00ZPjz14o0d9tG_0PwH9OnMGcQ56Ofx3NoupXivUFNg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 years ago",
      "text": "I told one of the pastor about a sick family member, but till now, none of the pastoral staff ever suggested visiting. No one called. No one from the church visited. “Nobody cares how much you know (preach), until they know how much you care.” There is a lack of “weep with those who weep” (Romans 12:15)  or “share each other’s burdens”( Galatians 6:2-3) in this church. A faith that does not love people (John 15:12) and bear no fruit (John 15:4-5) is a dead faith. One review by a family, say this church is a caring church. Maybe the leaders in this church only have time for certain people. Maybe I am not that type of people that the church is interested in. Nevertheless, I believe the Jesus (as portrayed in the bible) still care about me. Many modern churches over emphasize leadership, and are filled with CEO-type leaders, which is in sharp contrast to what is seen in the biblical Jesus. Our English word “pastor” comes from the Latin word pastor, which means “shepherd.” The Biblical writers employed the shepherding metaphor for pastoral ministry. Isaiah provides a good picture of a caring shepherd in 40:11, “He will tend his flock like a shepherd; he will gather the lambs in his arms; he will carry them in his bosom, and gently lead those that are with young”. This type of care would be expressed in the life of the church through pastoral visitation, counseling, and ministry in times of sickness and grief. Shepherds who love their sheep notice when their sheep are hurting and seek to be with them to care for them. Are the pastors in this church really just leaders or real shepherd's ?",
      "time": 1642231229,
      "translated": false
    },
    {
      "author_name": "LeeYong Family",
      "author_url": "https://www.google.com/maps/contrib/103102083675818175685/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKQEvZAZeICpFEgg8RerNsiAQnBYpm74i3-ITS1XgxZInKwGQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "This is our family's public acknowledgment of the church's excellence, in addition to its great location and facilities. The pastoral team and members have faith, hope and servant hearts that continue through all seasons and walks of life, above and beyond ostensible popularity, success and wealth.\n\nOur family is grateful to the pastoral team led by Pastor in Charge, Rev. Lisa. Our (grand)mother attended this church, but she became too weak to attend during the last few months of her life. The church kindly assigned a pastor to visit and chat / pray with our (grand)mother. Pastor Sabrina regularly visited our (grand)mother, and her visits were very much looked forward to by our (grand)mother and parents. When our (grand)mother's health was failing, her faith was strengthened by these visits and words of hope and courage provided by Pastor Sabrina. During the wake, we met Rev Lisa who personally came to the wake once the set up was done, and spoke with our family. Pastor Sabrina and Rev Lisa spoke during the evening services, and Rev Goh provided the final service.  Their efforts to support our family during the evenings of the long weekend are well received and greatly appreciated. Until the end, when we placed the urn at the church, Pastor Sabrina received us and provided a meaningful prayer and speech. The pastoral team and members of the church who attended the wake, honored the passing on of our (grand)mother.  Thank you!\n\nDuring our (often, difficult) lifetime:\nHebrews 11:1-3: \"1 Now faith is the [a]substance of things hoped for, the [b]evidence of things not seen. 2 For by it the elders obtained a good testimony. 3 By faith we understand that the [c]worlds were framed by the word of God, so that the things which are seen were not made of things which are visible.\"\nHebrews 12:1-2: \"1 Therefore we also, since we are surrounded by so great a cloud of witnesses, let us lay aside every weight, and the sin which so easily ensnares us, and let us run with endurance the race that is set before us, 2 looking unto Jesus, the author and perfector of our faith, who for the joy that was set before Him endured the cross, despising the shame, and has sat down at the right hand of the throne of God.\"\nAs we enter a new season:\nPsalm 23:6 \"Surely goodness and mercy shall follow me All the days of my life; And I will dwell in the house of the Lord Forever.\"",
      "time": 1572577412,
      "translated": false
    },
    {
      "author_name": "Louis Ching",
      "author_url": "https://www.google.com/maps/contrib/107998367594318906897/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXltrk0Yckr-Lic4v-72AHTdaKqD3s6vxw6HgEEFdzpgKk3_xM8pg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Beautiful wedding Daniel Pan & Hannah Tan",
      "time": 1726289961,
      "translated": false
    },
    {
      "author_name": "Patrick Chow",
      "author_url": "https://www.google.com/maps/contrib/107156178807189532916/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKevW4cDroDQfGqywxp76r82h1PXYh-d0DFZo6GfYP0yDOJ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "2 years ago",
      "text": "Nice church...  Great place for wedding n Sunday service",
      "time": 1678098138,
      "translated": false
    },
    {
      "author_name": "Tan-Yeo Ellese",
      "author_url": "https://www.google.com/maps/contrib/108980333438513910523/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVuh1FqUyPO7NFW-iX3lynte00pz4SWW_mWzygOKUPCm5tRNaVN=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "6 years ago",
      "text": "Freshly renovated.",
      "time": 1541461243,
      "translated": false
    }
  ],
  "types": [
    "church",
    "place_of_worship",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11930424698918035923",
  "user_ratings_total": 20,
  "vicinity": "400 Commonwealth Drive"
}