{
  "formatted_address": "22 Mount Elizabeth, Singapore 228517",
  "geometry": {
    "location": {
      "lat": 1.3077786,
      "lng": 103.8356738
    },
    "viewport": {
      "northeast": {
        "lat": 1.309093830291502,
        "lng": 103.8369700302915
      },
      "southwest": {
        "lat": 1.306395869708498,
        "lng": 103.8342720697085
      }
    }
  },
  "name": "Quincy Hotel Singapore",
  "place_id": "ChIJqzA1LO0Z2jER6Ekm9CPt76Y",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Wilson Oe",
      "author_url": "https://www.google.com/maps/contrib/101236353262801889765/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUttRkjiv_7o0XRV7YlQf_JV9muok495xA73wqi92OIf1FYLy4b=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "I had a wonderful stay at the Quincy Hotel. The room was spacious, spotlessly clean, and the bed was incredibly comfortable—perfect for a relaxing getaway. One of the highlights was the free flow of drinks and snacks (including popcorn!) available throughout the day, which added a thoughtful and generous touch to the experience.\n\nSpecial thanks to Cheryl at the front desk, who went above and beyond to make us feel welcome. Her warmth and professionalism truly stood out and made our stay even more enjoyable. Highly recommend this hotel for both comfort and great service!",
      "time": 1746884749,
      "translated": false
    },
    {
      "author_name": "Deilika C",
      "author_url": "https://www.google.com/maps/contrib/112052540122537298345/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXYbWEaP4EHxzDNDwRYKAcVMUYlkqVR7W-AhpKdxzyDKPhoFDy1=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "I would say this is the best 4⭐️Hotel in Spore. The service was excellent, they served welcoming ice cream which-seriously delicious, and have 24hours pantry that served coffee, tea, and cereals.\n\nThe room is the big, king-size bed, neat, and has everything we need including Nespresso!\n\nIt even has bath tub (I stayed at premier room), pool, and gym. I love everything in this hotel. The cons I think compare to other hotel nearby Orchard, the distance from the central orchard is quite far when you’re walking. But I wouldn’t complaint since the hotel rate is below other hotel nearby.\n\nI think the best part of this hotel is their staff! They always welcoming us with smile and always passionate doing their work. Will definitely be back to this hotel. Thank you for the service!",
      "time": 1746263095,
      "translated": false
    },
    {
      "author_name": "Estela Serrano Sanchis",
      "author_url": "https://www.google.com/maps/contrib/109078285995187973643/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUrDfDsx5mildHc23OkDx4snoLD8lIR92Z-_a8vEJBiIWQmuH3_Eg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "The hotel has a good location to visit the city, you can enjoy the walk or just take a taxi. The hotel team are very nice and helpful. The rooms are amazing. You have a wide choice for breakfast and snacks and drinks are available 24h. Great experience",
      "time": 1746881950,
      "translated": false
    },
    {
      "author_name": "Chen Wang",
      "author_url": "https://www.google.com/maps/contrib/108746262661891992014/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVWVad7546LMjpRKy3ODmLut10o9HDfZmMz641uCrdg2f2qwpHdWg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "The staff were amazing and gave special accommodations for early-arrival guests.\nRoom is clean and spacious. I like the large glass wall.\n\nOn the flip side the corridor is not air-conditioned. Not a problem for me but other guests might feel too warm.\n\nI only used cabs for transportation for this location. It's certainly less convenient than the downtown locations but can't complain with the price.\n\nOverall great value for the stay.",
      "time": 1745736416,
      "translated": false
    },
    {
      "author_name": "M M",
      "author_url": "https://www.google.com/maps/contrib/114442474015223259254/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW_4QQENzuWN98dtXOT5v3r8LKw1RWpGVWh6IelmJH_Co90yjk9Nw=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Quincy Hotel Singapore by Far East Hospitality is a stylish, adults-only boutique hotel located just a short walk from Orchard Road, making it ideal for shoppers and food lovers. The hotel offers comfortable, well-appointed rooms with modern amenities such as 42-inch LCD TVs, premium bedding, and complimentary Wi-Fi. Guests enjoy perks like daily breakfast with extended hours, 24-hour lounge access with light refreshments, and evening cocktails. Facilities include an indoor swimming pool, fitness center, sauna, and a steam room, catering well to relaxation and wellness needs. The hotel is praised for its spotless cleanliness, attentive service, and a tranquil atmosphere despite its central location. Free parking and airport transfer services are available, adding convenience. Overall, Quincy Hotel provides a welcoming, upscale experience with excellent access to Singapore’s vibrant city life.",
      "time": 1745404065,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12029093868405672424",
  "user_ratings_total": 937,
  "vicinity": "22 Mount Elizabeth"
}