{
  "formatted_address": "9 Yio Chu Kang Road Space@Kovan #01-51, Singapore 545523",
  "geometry": {
    "location": {
      "lat": 1.3545925,
      "lng": 103.8769008
    },
    "viewport": {
      "northeast": {
        "lat": 1.355960080291502,
        "lng": 103.8783745302915
      },
      "southwest": {
        "lat": 1.353262119708498,
        "lng": 103.8756765697085
      }
    }
  },
  "name": "Qwang - Vietnamese Food You Love",
  "place_id": "ChIJrVG6JfIX2jER83J7ydo9G3U",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "HungryGoWhere",
      "author_url": "https://www.google.com/maps/contrib/107645727514945874720/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWNAkiPve25f1mnTaLy1aD-uIECS3f2ktZgd8k3g-I5lbggeNE=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "2 years ago",
      "text": "This unassuming joint in Kovan has a small but tasty menu of Vietnamese salad bowls and banh mi. It is a quick-serve concept that caters to healthy eaters with less sugar and salt, and virtually no MSG or oil. Special mention goes to the avocado mousse ice cream — a rare find in Singapore.\n\n[What it’s good for]\nThe banh mi classic (S$9.50) is stacked full of pate and butter spread, Vietnamese pork ham (cha lua), pork floss, pickled carrots and daikon, and enough chilli to make you sweat. The ham is the standout star, thanks to its meaty juiciness. The banh mi beef ribeye (S$13) features premium beef ribeye that's sliced fairly thinly and roasted perfectly with a flavourful tenderness and a touch of five spice. The sandwich is stuffed with a heap of coriander and fresh chilli. The pork belly bowl (S$10.80) comes with a generous portion of chunky and fatty pork belly, which is tender and nice to chew on. There’s also a certain smokiness from the marinade that melds harmoniously with the other ingredients. For the more health-conscious, try the regular pork bowl (S$10.80) that is less fatty than the pork belly version and vibrates with a more savoury umami flavour.\n\nVietnamese coffee (S$4.60) is the only drink served here. It's rich and has a dark flavour profile, with strong chocolate and caramel notes. The avocado mousse ice cream (S$6.80) — dark green avocado mousse at the bottom of the bowl, with coconut ice cream, desiccated coconut, almond flakes, and chopped peanuts on top — is a beautiful dance between the decadently creamy mousse and denser, milky ice cream.\n\n[What it could improve on]\nThere was a lack of sauce (think sriracha) and oil — perhaps olive or sesame — that could take the banh mi here to another level.\n\n[Our quick takes]\nIs it conducive to conversation? -—Yes, but I can’t imagine it’s the kind of place you’d want to stay at for long.\nIs a reservation necessary? — No reservation needed!\nHow to get there? — A 13-minute walk from Serangoon MRT station should get your appetite started. Otherwise, there are several buses from both Serangoon and Kovan MRT stops.\n\n[Things to note]\nIf you like the salad sauce, you can add 50 cents for another container — totally worth it.\nDo note that this place is hardly suitable for groups — there are just eight stools and three wooden tables. I’d consider it more of a delivery and takeaway spot.\n\nRead more at HungryGoWhere for the full review",
      "time": 1678946202,
      "translated": false
    },
    {
      "author_name": "Digital Foodprint",
      "author_url": "https://www.google.com/maps/contrib/111979840497210804864/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWglPvEXrwfhMTed8nSlV-_4FFEzdQ0F39q6YxoDfG-lVuGAy2a9g=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "2 years ago",
      "text": "Located deep within a commercial space in between Kovan and Serangoon is this humble Vietnamese restaurant.\n\nDishes ordered were the chicken bowl and pork banh mi. Personally I would give the banh mi a miss mainly due to the tough pork meat used. On the other side, the chicken bowl was such a great deal, ingredients were generously given, mints and greens were so refreshing and crunchy while the nuts within gives a good crunch in texture.\n\nLittle downside would be its price and location.\nAlso please take note that there are very limited tables (3) for dine-in as this place mainly serves takeaway.",
      "time": 1676965754,
      "translated": false
    },
    {
      "author_name": "Lirene Bay",
      "author_url": "https://www.google.com/maps/contrib/102213924345193254932/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWNs_RD99QRPMb6eOIomv52X9eJHHmgXnMQBPnSiJf9QPrdHG-m=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "3 years ago",
      "text": "We tried the Pork Bowl, Chicken Bowl and also the Tofu Bowl. I like the char-ness with the roasted pork and chicken in both the meat bowl. I like that there is the option of tofu bowl which is vegetarian, as you know, we have all got one of such friend.\n\nThey are filled with greens including romaine lettuce, japanese cucumbers, big cherry tomatoes, mint, basil, pickles carrots and daikon. The mint gave a refreshing taste. There’s also chopped roast peanut for that addition crunch and taste.\n\nThe Chilled Vietnamese Coffee is really bold and strong with added sweetness from condensed milk. A little sweet and could do with some melted ice for that perfect taste.",
      "time": 1651270914,
      "translated": false
    },
    {
      "author_name": "Denise",
      "author_url": "https://www.google.com/maps/contrib/106466138746784963787/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKCc4ZiwczCNLE5XFujGAyZpBoR67HnqyfC9SifHLdNjhjQ9A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "A hidden gem around upset Serangoon, nested among the boutique cafes. Well toasted bahn mi with generous ingredients, could be stronger in taste with more sauces but still great overall!\nOrdered the grilled pork bowl filled with lots of well charred grilled pork balanced out with crunchy vegs and rice vermicelli, will try the other bowls next time!",
      "time": 1680936408,
      "translated": false
    },
    {
      "author_name": "Jacquie W",
      "author_url": "https://www.google.com/maps/contrib/113826399104887108027/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKJ10oHwHtE_0JDcm-Ln7hwJ_Sgroz5XcB2rHQSzfCumx1bb0U=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Delicious Vietnamese noodle salad bowls! Fresh, tasty, healthy and good value too. We had the pork bowls with Vietnamese coffee. The takeout process was also smooth and fuss-free. It's nice to have this secret gem in the area. Will be back for more!",
      "time": 1639633664,
      "translated": false
    }
  ],
  "types": [
    "meal_delivery",
    "meal_takeaway",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8438406336701231859",
  "user_ratings_total": 34,
  "vicinity": "9 Yio Chu Kang Road Space@Kovan #01-51"
}