{
  "formatted_address": "9 Goldhill Ave, Singapore 309007",
  "geometry": {
    "location": {
      "lat": 1.3191839,
      "lng": 103.8320683
    },
    "viewport": {
      "northeast": {
        "lat": 1.320495980291502,
        "lng": 103.8334057802915
      },
      "southwest": {
        "lat": 1.317798019708498,
        "lng": 103.8307078197085
      }
    }
  },
  "name": "Raffles House@Goldhill",
  "place_id": "ChIJdyeN3PoZ2jERJ4XF1eVXNh8",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Rose",
      "author_url": "https://www.google.com/maps/contrib/117286711840077791394/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVZhVhzzCKWNclUdohzIHK-1rrIpCR6aY_PfuInheVcDYKvyo96=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "My daughter had been going to Raffles house school from PG to K2 and  already graduated.\n\nWhen we moved house and need to change other school when she was in K1, we regretted immediately.  My daughter was no longer her usual self.  She missed her teachers and friends.  We eventually reenrolled her back to Raffles House and never look back since then.\n\nRaffles house school is NOT like any other school that just focus on how to make money out of unnecessary things or keep asking the children to memorise and study hard even though they are only 4 or 5 y.o.\n\nThe teachers understand that Children need to be given individual space to learn and grow so that they will truly enjoy learning.\nThey still teach children mathematics or English, Chinese through singing, playing besides the usual ways. She really loved going to this school everyday.\n\nMy daughter also was fortunate with lovely friends to play with :)\n\nWhole heartedly, I cannot appreciate enough to the great teachers who put all the effort on the children most of the days through the year.\nIf you want you kid to grow up confidently and happily, with a great childhood memory, look no further. I highly recommend parents to enrol their child to this wonderful school.",
      "time": 1733418364,
      "translated": false
    },
    {
      "author_name": "Berfin Serdil ÖRS",
      "author_url": "https://www.google.com/maps/contrib/107871116999435077933/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUoh2d9oM83jvOHYKZ4L8G58AKmAni4tBWu918h1mHupFEF-Is=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "My daughter is going to Raffles House Pre-School-Goldhill for 2 years now and she loves the school and her teachers!\n\nThank you Ms Evangelin for helping us to find this amazing school! Thank you Ms Rebecca, Ms Sha, Ms Alyssa, Ms Dyan and Gao Laoshi for your support and taking care of my daughter!\n\nThank you Auntie Fanny for cooking delicious food and looking after kids!",
      "time": 1733141376,
      "translated": false
    },
    {
      "author_name": "Sophie Hawkins",
      "author_url": "https://www.google.com/maps/contrib/101406156225811748120/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJmTWE9Bnj9r7TTzEeR5aX9BG1MMaJil1D9RXU-Qtky2q0H-w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "My son has attended Raffles House at Goldhill since he turned 18 months and we could not be happier with the school and our decision to send him there.\n\nWhen enrolling we visited all of the kindies in the area and found many to be very unresponsive or slow - some made us feel like a nuisance for wanting to view and made it clear that with lengthy wait lists they didn’t really need our business. By contrast, Evangelin (the Principal) was friendly, welcoming and went above and beyond to show us around the school. She took her time to answer our questions and provide a lot of info which we appreciated.\n\nFrom his very first day our son loved it - his teachers in Playgroup are all so kind and caring and it’s obvious how dedicated they are. They take time to prepare interesting activities for the kids with a focus on learning but also fun. There is plenty of outdoor playtime and also water play and cooking, science experiments etc.\n\nIf we ever have a question the teachers respond to messages quickly and we totally trust them to take care of our boy. Each morning when we drop him off the staff greet him by name and with a huge smile. They send us lots of photos and updates so we know what he gets up to.\n\nHe has come on leaps and bounds since starting school and I credit a lot of that to his teachers and the homely environment at school. He loves his teachers and even asks for them at weekends and evenings - especially his favourite Ms Sha!\n\nWe have absolutely zero regrets - this school is a gem.",
      "time": 1658197990,
      "translated": false
    },
    {
      "author_name": "Adelene Tan",
      "author_url": "https://www.google.com/maps/contrib/106422680281888252868/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX6jM3R7PhNBkKwFewuBr9ABTCr6pDzAp__VQdhS0uX1nfNpe1WFQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "My son has been attending Raffles House at Goldhill Avenue for three years now and really enjoys it. The school takes a holistic view to education and there is a good balance between   academic learning and play. Gym and music are part of the curriculum where kids engage in climbing, balancing, navigating obstacle courses, singing and learning about rhythm and musical instruments. They are involved in many experiments and hands on learning. For example, they get to observe the life cycle of a butterfly from caterpillar to pupa to butterfly (which they released into the wild), observe the habits of live stick insects, and tend to their fruit and vegetable garden. There are also many fun and interesting learning journeys. Through the dedicated teachers, my son is able to recognise and read English and Chinese words well, and is proficient in counting and math skills. The teachers are very warm, nurturing and affirming, which really builds the confidence of the kids. Love for learning and creativity are encouraged, and the kids are given many opportunities to express themselves and share their thoughts. Many thanks to Ms Farhanna, Ms Joyce, Ms Amy, Zhang Laoshi and Mao Laoshi who have taught him over the years. He is definitely looking forward to learning with Ms Sarinah this year!",
      "time": 1578015146,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "school",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2249081708563760423",
  "user_ratings_total": 4,
  "vicinity": "9 Goldhill Avenue"
}