{
  "formatted_address": "2 Braddell Rise, Singapore 318871",
  "geometry": {
    "location": {
      "lat": 1.3433148,
      "lng": 103.8428742
    },
    "viewport": {
      "northeast": {
        "lat": 1.344314830291502,
        "lng": 103.845372
      },
      "southwest": {
        "lat": 1.341616869708498,
        "lng": 103.8420416
      }
    }
  },
  "name": "Raffles Girls’ School (Secondary)",
  "place_id": "ChIJUZgFRKwX2jERb8htKcSaiRU",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Joyce Lim",
      "author_url": "https://www.google.com/maps/contrib/114306834103372851451/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXgFeb1t096dSlrk62Z0XkVwM9bnhc8-e1nWHUxfa3i27ikGVDv=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "12 months ago",
      "text": "My review is based on my interactions with current students during RGS open house on 18 May 2024, and my time there as a student in late 1990s/ early 2000s (in the Anderson Rd campus).\n\nI've attended quite a few sec sch open houses with my daughter, who's taking her PSLE soon. RGS is the 4th school we've toured, and is not just my top, but my daughter's top as well. Let me tell you why.\n\nFrom the moment we alighted at the spacious drop off point to enter the spacious lobby, we could feel the energy of the place. The place was packed, but it wasn't chaos.\n\nAt the MPH, there were performances on stage, a sizeable area with seats for audience, and CCA booths at the back. I loved how there were house cheers with lots of students participating. Glad to see that house spirit is still going strong. I stopped by at my CCA's booth and had friendly conversation with my juniors. At the CCA booth of the CCA my daughter was interested in, the young lady there was extremely patient with my numerous questions on DSA process, interview questions, selection criteria. At the special booths at level 1, again we meet another young lady who was superbly helpful and enlightened us on DSA.\n\nBased on the interactions I've had during the open house, I'm super proud of the juniors I've encountered; they were all well-mannered individuals who carried themselves well and were super helpful. The vibe of the school in general - the school spirit - is very much alive and well.\n\nBased on my own time there a few decades ago, I loved how we were taught to be independent with a growth mindset, long before growth mindset was trendy. Because it's an all girls school, we did everything ourselves and didn't rely on male counterparts. I enjoyed my CCA tremendously, and it imparted important life skills. I liked that my seniors and peers were extremely capable and intelligent, and learning alongside them spurred me to achieve the best I could.\n\nWas the school perfect? No. I wished some of my teachers were more encouraging and less condescending. I wished some of my peers were less elitist and more down to earth. But overall it was a pretty good institution of learning. If I had to choose again, I'll definitely choose RGS.",
      "time": 1716375039,
      "translated": false
    },
    {
      "author_name": "Singapore Vaishnawaat",
      "author_url": "https://www.google.com/maps/contrib/116878857237773301048/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUfmgQkSXKD_uEwVGEk9IxCpXu6Hnl4wYuYsmF1DEl-uWJJSy5H=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "RGS is a humongous school. The canteen ques are really long. I feel that they should make more stalls.",
      "time": 1744626929,
      "translated": false
    },
    {
      "author_name": "M",
      "author_url": "https://www.google.com/maps/contrib/111314140510133503604/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKr-O_tB7SBAJPUPWLTkzx31NH86YZoJURVbg75c2eJhwXBMA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "Truly disappointed by the quality and apathy of both the teachers and school administration.\n\nPerhaps RGS is being used as a study in nurture vs nature, where naturally bright girls are tested to establish if they can still thrive despite the quality of teaching and administration?\n\nIn any case, I can only hope that MOE will finally bother to step in to rectify the issues before yet another generation of girls \"waste\" their years at RGS.\n\nI believe this can easily be achieved by really engaging with its ex and existing students (and their parents) to really understand the issues with the teachers and school administration, and then taking concrete steps to address them.\n\nAnd no, asking the school administration to undertake this task of identifying and addressing its own issues will clearly not work - it hasn't for the last many years!\n\nHope springs eternal...\n\nUpdate: Even with a new principal onboard, NOTHING has really changed for the better even after a year… not the quality of teaching and teachers, administration or even canteen food.  The upside from this is that my daughter learns to be more independent and resilient. But it’s quite sad really…\n\nLatest update: Here to attend the teacher-parent meeting and the level of incompetence on display is astounding.",
      "time": 1739522999,
      "translated": false
    },
    {
      "author_name": "fishyy",
      "author_url": "https://www.google.com/maps/contrib/106855227276613016760/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLXviWoVSVJEfCmoW3WzCnulPBvPvPaBI9LXH1E7asD7Luc8g=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "9 months ago",
      "text": "i have a lot to say about this school, sadly.\n\nfirst off, there's a \"booking\" system implanted, where your name is recorded for any small mistake, including but not limited to forgetting your name tag, being late for one minute because of a traffic jam. recently, mobile guardian started acting up, and students could not connect to wifi on their personal learning devices. Thus, many students decided to bring their own laptops, which did not have mobile guardian installed. they were then warned that they would be booked if they continued using laptops (because it wasn't allowed). however, if the students do not use laptops, their learning experience would be greatly affected as they are left without a way to access the learning materials.\n\none of my other concerns is that the school places a way too important emphasis on events it deems important. for the recent racial harmony day and student leader investiture celebrations, students were made to stay behind after school to attend, despite it being in the middle of exam season. the heavy workload means that during those days, students would have to burn the midnight oil in order to finish the homework assigned. this just results in a very unhealthy lifestyle, which could have been easily prevented by not attending useless celebrations.",
      "time": 1722505753,
      "translated": false
    },
    {
      "author_name": "Zuko",
      "author_url": "https://www.google.com/maps/contrib/109111669266713732977/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL0D0bpCPHGY0RS9Ur0qSCBc5IpJwXYLMq3JlcL1h2aOj6U1Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "we love taking 10 minutes to walk to the canteen and queuing for 1001001010 minutes!",
      "time": 1743576438,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1551941713905174639",
  "user_ratings_total": 63,
  "vicinity": "2 Braddell Rise"
}