{
  "formatted_address": "585 N Bridge Rd, Level 10 Raffles Specialist Centre, Singapore 188770",
  "geometry": {
    "location": {
      "lat": 1.3007231,
      "lng": 103.8571428
    },
    "viewport": {
      "northeast": {
        "lat": 1.302005930291502,
        "lng": 103.8585650802915
      },
      "southwest": {
        "lat": 1.299307969708498,
        "lng": 103.8558671197085
      }
    }
  },
  "name": "Raffles Heart Centre",
  "place_id": "ChIJkZGimrAZ2jER07hiKql9Qeo",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "K C",
      "author_url": "https://www.google.com/maps/contrib/105533873324476697292/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVofsSO8orZUyCuXVUuPantgUP0mo7aGw26qDgCCc-pBOrsUqcZ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "in the last week",
      "text": "Be prepared to spend a very long time with no estimation of how long it will take. Doesn’t matter if you have an appointment time as they will not follow nor give you any updates. It’s ok if the clinics busy but I think the illusion that it is an appointment is the frustrating part.\n\nHad an appointment for 1050, waited for 30 mins before I had to ask the nurses what is going on. It was only then they told me that most likely I could only see the doctor at 2+ or possibly later. No point scheduling an appt if they are just gonna make you come in at your appt time and just wait in the queue.\n\nOnly plus is the place is cozy because they know they will make you wait a very long time",
      "time": 1747280508,
      "translated": false
    },
    {
      "author_name": "Chong KV",
      "author_url": "https://www.google.com/maps/contrib/114047288472149349381/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX_UreVzsNHUHEgi-6O_n3CbgB0FvQtJ3qP9kh1p017-TNYpkxEiw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "The waiting place is cozy and there is a free drink at the self service station. I was quite surprised the doctor didn't meet up with me after the trendmill to further explain the result, He attended the trendmill when I started running and a short msg to me while I'm back facing him on scanning, I only heard \"looks good, no problem\" and he is done. The nurse then asked me to wait outside and immediately I was called for payment, to my surprise, I was asking don't I have at least a report and face to face review by the doctor? Then they print me a few pages of charts with comments and just pass them to me without a file or envelope, and ask me if I need to talk to the doctor or is it ok if I just read it........ I believe the center can do it better, The doctor can be very busy but also can be professional in handling the patient, counter service can also make things more presentable so to allow the patient to leave with a proper carrier and smile and not just hold the stake of ECG paper out from the center.",
      "time": 1730797724,
      "translated": false
    },
    {
      "author_name": "J",
      "author_url": "https://www.google.com/maps/contrib/111015192825878219722/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUdYtqofLwb1sLbmTkRwAH87R0K45aGArHzE-Pg71t-KiJXKq0=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Expensive yet unprofessional. Govt hospital services are 1000x better.\n\nAfter my test, no one said anything about the results?  No doctor review? When I asked, the nurse told me they will call me in 1 week and it’s been almost 2 months and still no call?\n\nThe 3 simple tests cost $2k - 2 lasted for just 15-30 mins max.\n\nWhen can I get my reports? I’ll file a complaint to the authorities if you do not respond! If you lose my report, own it! Don’t go quiet! I paid $2k for the tests!",
      "time": 1743806249,
      "translated": false
    },
    {
      "author_name": "Snake Tank",
      "author_url": "https://www.google.com/maps/contrib/107461055208697901889/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJiHpp8wP_fhj4FM-GirJNtT1PC7gxKhgCpb7MEiOdS-xo0CQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Special thanks to Ms Jessica Faith at the billing section. After I've collected my medication,  immediately she served me without any delay.  Most importantly,  she served me with a big sweet smile to brighten up my day! Very friendly lady.  Thank you",
      "time": 1737087904,
      "translated": false
    },
    {
      "author_name": "Rizal Samat",
      "author_url": "https://www.google.com/maps/contrib/111062223670698447093/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV7G6NIjhlfHgmzOeDRmu7cQRiMuoUstgMj7IXc61l7vpuREuPE=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "5 Star treatment and service rendered to patients- very impressed with how organised the heart centre is ran… efficient and quick to react when required. I have been a patient for Dr Lee for the past 3 years and I must say that he a gem. Always happy to help and will be there for you when you have any questions about your condition. The Nurses are also great, all are very accommodating…",
      "time": 1737086116,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16879911043875387603",
  "user_ratings_total": 60,
  "vicinity": "585 North Bridge Road, Level 10 Raffles Specialist Centre"
}