{
  "formatted_address": "585 N Bridge Rd, Level 9 Raffles Specialist Centre, Singapore 188770",
  "geometry": {
    "location": {
      "lat": 1.3012864,
      "lng": 103.857212
    },
    "viewport": {
      "northeast": {
        "lat": 1.302461530291502,
        "lng": 103.8587562802915
      },
      "southwest": {
        "lat": 1.299763569708498,
        "lng": 103.8560583197085
      }
    }
  },
  "name": "Raffles Internal Medicine Centre - 莱佛士内科医疗中心",
  "place_id": "ChIJa3ULj7AZ2jERYtb31m9TBmA",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "Yi Shiean Tan",
      "author_url": "https://www.google.com/maps/contrib/104047651198396819276/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUqPyLvlDd-L77KnD_ndNAbgkpQIOxeQfY35tlKwlvI8Om5Zo-Dug=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "2 months ago",
      "text": "Among the many gastroenterologists I have consulted, Dr Woo stands out for his exceptional bedside manner. A colonoscopy under his care is never rushed, and his meticulous approach ensures the best possible patient support.\n\nEqually commendable is the efficiency of his nurse and administrative team, particularly Priya and Zeenat, who are both well-versed in navigating insurance claims with speed and precision.\n\nHowever, this comes at a cost—long wait times. On three out of my four visits, delays stretched to > 1 hour despite having a scheduled appointment.\n\nOn one occasion, I had to forgo my appointment altogether after >1 hour wait as I had another meeting scheduled, returning on a separate day instead.\n\nPatients are advised to bring along a laptop if they need to work or avoid booking meetings within 1.5 hours after their appointment.\n\nWhile the wait can be frustrating, knowing you’re in good hands makes it far more bearable.",
      "time": 1741858701,
      "translated": false
    },
    {
      "author_name": "Jay Ann Cha",
      "author_url": "https://www.google.com/maps/contrib/109580729349942517101/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocItp1_QfvULIT0GIZVNtJXseHgm9YFoeXjOhTskrxHNt7_qkg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "10 months ago",
      "text": "Very poor appointment management system and service. They changed my appointment time because of the doctor’s schedule but did not inform me and I only knew when I reached at my original slot 9am. The receptionist advised me to come back at 12.30-1 even though the appointment was 1.30pm. I double checked with her and she said it’s fine, after lunch. When I reached, there was no one at the counter and some other colleague said she went out for lunch. In the end I only saw the doctor at 1.30pm, the appointment time in the system.\n\nAfterwards, while booking the follow up appointment, she could not understand my requirement of any Wednesday or Thursday in August and gave me Sunday and Tuesday dates??\n\nI commented about the change in timing and waiting time to the doctor and the receptionist but none of them were apologetic or gave proper acknowledgment. The doctor was supposed to give me a timesheet since I had to come back and forth and missed work but nothing was given and I only noticed it after I have left. Very poor service and treatment of patients!",
      "time": 1720679689,
      "translated": false
    },
    {
      "author_name": "kokila vani",
      "author_url": "https://www.google.com/maps/contrib/115206446332269484293/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWxvMqCmQ6ZKSOJ0AoCnVkeYLol6tybqlqoBe7GrR1uehI4el6K=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "I have been seeing Dr teo for the past 4 years.  He's one of the Dr who take care of his patients well and will advice you accordingly.. He will let u have a peace of mind when you leave the clinic. Very professional.. thank you Dr teo",
      "time": 1727079328,
      "translated": false
    },
    {
      "author_name": "Edmund Tan",
      "author_url": "https://www.google.com/maps/contrib/106966304155501233640/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLicG7EAu6_Rl0Mn9Q4RzokSxfxP38W9qR-SnOQeHB3GbyDeg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "It was a pleasant experience. The clinic staff were sincere and helpful and the doctor was patient and thorough in his assessment and explanation.",
      "time": 1726797786,
      "translated": false
    },
    {
      "author_name": "STACY T (Stace)",
      "author_url": "https://www.google.com/maps/contrib/108215506988776570745/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW_Fva1c25QbpG8aLAu-5R29lzWQHm_FzXFk44g0lEJF_QEM9eM=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "7 years ago",
      "text": "Came for my appointment at 930am, I sat in the dispensary and payment section for over 24 minutes waiting for someone to finally pick up my forms and actually get the meds ready and payment all while watching 6+ women sitting behind the counter talking about lunch and patients and everything else besides what needs to be done.  Why is it always that people think you have all day to sit around and wait for them.  My time is also precious and I have others things to do better than sitting watching people not doing anything! Disappointed in the new Internal Medicine - diabetes’s and endocrine system! There’s no communication and no consistency.",
      "time": 1519353050,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6919309617314387554",
  "user_ratings_total": 16,
  "vicinity": "585 North Bridge Road, Level 9 Raffles Specialist Centre"
}