{
  "formatted_address": "45 Boon Keng Rd, #02-01, Singapore 339771",
  "geometry": {
    "location": {
      "lat": 1.3180938,
      "lng": 103.8623873
    },
    "viewport": {
      "northeast": {
        "lat": 1.319313280291502,
        "lng": 103.8636525302915
      },
      "southwest": {
        "lat": 1.316615319708498,
        "lng": 103.8609545697085
      }
    }
  },
  "name": "Rainbow Cove Kallang CC Preschool",
  "place_id": "ChIJW-OVHdIZ2jER9Jn_PllVYRw",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Kah Bee Ong",
      "author_url": "https://www.google.com/maps/contrib/104169295591685121600/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVEXvGtRAF5rFbhBAXsPbxvvQ2uQNRL6nSsK5JiF12SZS3TlYe9rA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "My child joined Rainbow Cove K1 in Aug 2023. I like that the principle and the teachers are willing to listen to my concerns and take actions to help my child. My child is extremely shy and she has a medical condition but the teachers are very accommodating. Throughout her stay, my child experienced loving and encouraging teachers and they have helped her step out of her shell and enjoy her school life. We also chose this school for her teacher-student ratio and the variety of activities (sport ball, Chinese speech & drama, reading programs) and including options of Montessori styled activities.",
      "time": 1735875291,
      "translated": false
    },
    {
      "author_name": "Nia Man",
      "author_url": "https://www.google.com/maps/contrib/115268634973980340977/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIJie47IzWvqvblRolvWmIjkpkiZByxXRYQE1V45SV3yc3gvA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I can’t say enough good things about Rainbow Cove Kallang CC. From day one, our daughter has been welcomed into a warm, supportive environment. Teacher Mariana and the staff are incredibly dedicated, always taking the time to understand each child’s unique needs and strengths.\n\nThough she started off shy, she has grown in both confidence and independence, becoming more excited to learn every day. The small class sizes and personalized attention have made a huge difference in her academic progress and overall development.\n\nWe’ve seen her form wonderful friendships, and the school fosters an atmosphere of kindness, respect, and cooperation. Rainbow Cove has provided a strong foundation for her, and we’re truly grateful for the love, care, and support they’ve shown her. It’s been an unforgettable experience, and we will genuinely miss this wonderful school.",
      "time": 1730993011,
      "translated": false
    },
    {
      "author_name": "Simon Koh",
      "author_url": "https://www.google.com/maps/contrib/108538444058837899384/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWLqnd_kGo9hbw5BuVTNCdu5eAh4GTIff2-qnWFzML1-c6rcbqVkA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Both our children enjoyed their time at Rainbow Cove from 2020 -2024. We had gone through a few childcares / preschools over the years for various reasons, and Ms Mariana and her team are definitely one of the most nurturing and patient teachers we've encountered. The school has a comprehensive curriculum that gets the children ready to enter primary education, and the children have fun in the process of learning. Thank you for the great experience!",
      "time": 1734851854,
      "translated": false
    },
    {
      "author_name": "valencia loke",
      "author_url": "https://www.google.com/maps/contrib/108784177526762825682/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJJiYSFhBom9gc4-bPm3vvtm4ZvoaIzjFF6IXVX0nwL9XEGwA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "The moment i stepped into this school for the first time, i knew this was the school i would enrol my son into. The environment is just very warm and friendly, the teachers were helpful and very kind.\nI liked how the teachers help to build confidence for each kid and gave them space to grow\nMy son can be quite cheeky , and i would like to thank the teachers and principal for being so patient with him !\nCredits must go to all the teachers and principal mariana for creating such a warm and welcoming environment for the kids ! ♡",
      "time": 1740711994,
      "translated": false
    },
    {
      "author_name": "Ariel Chen",
      "author_url": "https://www.google.com/maps/contrib/110062473499751121600/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJEPJJJ5Fpke0TDS892BiQgiO2UNSW-jl6oV7l9YSsbuOcQpg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "My daughter has been attending Rainbow since PG days, she took some time to adjust to the school initially. The teachers have been very patient and caring, especially the Principal Mariana. Thumbs up to the curriculum, my girl has learnt to write and read very independently for her age group. This gives me confidence that she can transit into Pri Sch more easily. Now that my girl is graduating, there is nothing but lots of thank you and appreciation to the school!",
      "time": 1735183002,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2045009547600304628",
  "user_ratings_total": 25,
  "vicinity": "45 Boon Keng Road, #02-01"
}