{
  "formatted_address": "110 Butterfly Ave, Singapore 349844",
  "geometry": {
    "location": {
      "lat": 1.3344126,
      "lng": 103.8755147
    },
    "viewport": {
      "northeast": {
        "lat": 1.335658680291502,
        "lng": 103.8768956802915
      },
      "southwest": {
        "lat": 1.332960719708498,
        "lng": 103.8741977197085
      }
    }
  },
  "name": "Rainbow Cove @ Butterfly",
  "place_id": "ChIJmWC264QX2jERm7LcacTNwN8",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Xiao xue Qian",
      "author_url": "https://www.google.com/maps/contrib/106715360236997461107/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLt1m92QoSFZ_E7LwA_lUImjxTV4Vx9n1LSwgwKoHnQDu0o7g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Rainbow Cove Pre-School at Butterfly is an exceptional place for young children to grow and learn. The staff are incredibly caring and dedicated, creating a warm and nurturing environment. My child absolutely loves attending, and it's wonderful to see them excited every morning. The curriculum is well-rounded, focusing on both academic and social development, and the school’s activities are always engaging and fun.\n\nThe principal is very hands-on and actively interacts with parents, which makes a huge difference. It’s reassuring to see how involved and approachable she is, always making time to address any questions or concerns. Communication with parents is excellent, and I feel fully involved in my child’s progress.\n\nI highly recommend Rainbow Cove @ butterfly to anyone looking for a safe and inspiring learning environment!",
      "time": 1735646928,
      "translated": false
    },
    {
      "author_name": "c abi",
      "author_url": "https://www.google.com/maps/contrib/113943651213611709870/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL-AWtwC6zPcE_FPR-gjPrDm5EYrtUbhbGEtuHRlw6gqaEvcw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Rainbow cove is a lovely place! not only from the exterior but I’ve found the teachers and principal to be knowledgeable and intentional with their interactions with the students. I’ve had multiple interactions with Principal Elizabeth and found that she is very experienced in her field of more than 20 years and the way she interacts with the children is firm yet loving and the students seemed to really enjoy being around her. The school’s design is well thought-through with the way the classes are designed and their activities, saw that they made their own tanghulu once as a class activity- not only good for the children’s gross motor skills but to learn and engage with other cultures! Would highly recommend to send your little ones to Rainbow Cove considering the activities are well-thought out to engage and educate the children as well as the environment crafted out for them to be able to explore and grow in! Probably one of the best preschools around!",
      "time": 1735568652,
      "translated": false
    },
    {
      "author_name": "Lee Anon",
      "author_url": "https://www.google.com/maps/contrib/115248214293710151796/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLMsFJ_KnQdV9y2uheyFIXahoWvwRN890Skwjjhq3zX5UySsA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Amazing childcare. Principal is very pro-active and friendly. She attends to issues as soon as she can.Teachers are friendly and response well.\n\nSchool has varies programs for the kids which my child enjoys. The materials for the kids learning are pretty good.\n\nThank you for taking care of my child's well being.\n\nReally appreciate it.",
      "time": 1735280875,
      "translated": false
    },
    {
      "author_name": "Grace K",
      "author_url": "https://www.google.com/maps/contrib/113624905520088068085/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK26n3cE1TBEeiZXTmLwHy0xnZqAKjR2J-pKs4lEPXwM1G2zA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "My kid has been with Rainbow Cove since N1 and has just graduated from K2.\n\nIncredibly grateful to the Principal Elizabeth, the teachers (including Teacher Amerah, Li 老师 and Xiong老师) and Aunty Judy and her team for creating a safe environment for her. Aunty Judy’s meals were a highlight—my picky child enjoyed them so much that she often asked for second helpings!\n\nThe preschool provided a safe and nurturing space where my daughter could learn, grow, and become independent, such as learning to shower on her own. Her teachers and the principal were patient, attentive, and caring, keeping us well-informed with timely updates.\n\nAm also thankful for Principal Eliz and the teachers for always responding promptly to our concerns and questions, and for stepping in, especially when it came to the wellbeing of the kids.\n\nBeyond the curriculum, the school always thoughtfully planned holiday programmes to make learning fun, including activities like cooking, crafts, and even fire drills.\n\nOh, and the school bus service was a true lifesaver! The uncle who drove the bus and the aunty who ensured every child’s safety made picking up our kid so much more convenient and worry-free\n\nThank you Rainbow Cove@Butterfly!\n\nWould definitely recommend Rainbow Cove to parents looking for a preschool 😊",
      "time": 1735718677,
      "translated": false
    },
    {
      "author_name": "GT",
      "author_url": "https://www.google.com/maps/contrib/108792121903018829550/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIbSQmLR_uw703pCuETI1RwV061yBlnQr0wUqZ-bIeF34qB8g=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "I didn't sign up with them as I had placed my child at a cc nearer to my place but I would like to say that I had a positive impression of the teachers and classroom when I went for the tour. The teachers looked loving and committed when they conduct classes. Would love to know what they can offer in their after school care program next time.",
      "time": 1735962553,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16123112909459731099",
  "user_ratings_total": 24,
  "vicinity": "110 Butterfly Avenue"
}