{
  "formatted_address": "460 Alexandra Rd, #03-04, Singapore 119963",
  "geometry": {
    "location": {
      "lat": 1.2736219,
      "lng": 103.8017499
    },
    "viewport": {
      "northeast": {
        "lat": 1.274954180291502,
        "lng": 103.8031364802915
      },
      "southwest": {
        "lat": 1.272256219708498,
        "lng": 103.8004385197085
      }
    }
  },
  "name": "Rainbow Cove @ Alexandra",
  "place_id": "ChIJzSXR_DIa2jERsiV0hN1JleE",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Ayumi Endo",
      "author_url": "https://www.google.com/maps/contrib/103110296669499528390/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKM_SsE7NjmhmknisYMXifG-igcKQLrUQua1XdUEXLOW94YwQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "My son has been attending Rainbow Cove since he was a 9-month-old baby.\nThe teachers are always cheerful, encouraging, and supportive of the children.\nIn particular, Principal Jay has been incredibly flexible and understanding, helping us with our concerns and consultations many times, for which we are deeply grateful.\n\nAlthough we moved and my son transferred to a different school, he still misses Rainbow Cove dearly.\nIt’s a small school, but its warm and welcoming environment makes it highly recommended.",
      "time": 1736473482,
      "translated": false
    },
    {
      "author_name": "Dianne Karen Uy",
      "author_url": "https://www.google.com/maps/contrib/102127925404213545312/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVFvCAgC3AoL1HOtFeTuk5XPz2L7srJxKrr-JWB6aG3xn7hDqQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I’m beyond grateful for my baby Z's amazing time at Rainbow Cove Alexandra! We sent him there when he was just 3 months old, and he stayed until 16 months—every step of the way, the teachers were nothing short of incredible. They’re so genuine, loving, and attentive, always making sure the little ones are happy and well cared for.\n\nWe also really appreciated the regular updates—they made such a difference in easing my mind. As a mom, trusting someone else with my baby wasn’t easy, but Rainbow Cove made it feel so natural. I always knew he was in the best hands, and that kind of reassurance is priceless.\n\nA huge thank you to Teacher Jay and the wonderful team (Shout out to Tr Jo, Tr Wendy, Tr Winnie, and of course all other teachers too!) for creating such a warm and loving environment! You guys are amazing, and we’ll always be grateful for everything you’ve done. ❤️ ❤️ ❤️ Highly recommend Rainbow Cove to anyone looking for a safe, caring, and fun preschool for their little ones!",
      "time": 1738897734,
      "translated": false
    },
    {
      "author_name": "Bashayer",
      "author_url": "https://www.google.com/maps/contrib/118040353816053435820/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLr3GKZOvgPRL0bfS07fCRuXJU3JLOo9FaP8e1Q-zNCCIKa3g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "I’m from Saudi Arabia, and my son, Saud, attended Rainbow Cove at Alexandra in Singapore for almost a year and a half while I was pursuing my Master’s degree. From the very first day I stepped into the school, I could see how happy and engaged the children were — I immediately felt this was the right place for Saud.\n\nMs. Jay, the principal, was incredibly kind and supportive throughout our time there. The entire team created a warm, caring, and nurturing environment that made Saud feel safe, loved, and excited to go to school every day. Even now, six months after we left Singapore, he still remembers his classmates by name and his eyes light up every time he watches videos from his time at the school.\n\nWe are truly grateful to Ms. Jay and the entire staff at Rainbow Cove Alexandra for giving Saud such a beautiful and unforgettable early childhood experience.\nThank you all for all the love, care, and joy. You made his early years so special. You will always hold a special place in our hearts.\n\nSaud’s mommy 🤍",
      "time": 1745526004,
      "translated": false
    },
    {
      "author_name": "Fiona Carroll Thomas",
      "author_url": "https://www.google.com/maps/contrib/110979339844900233872/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ2zs9ebB_VrImpNUeFybU7iUhv3BbkPpS9L-iCpRNCVC0x8A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "My son attended playgroup at Rainbow Cove starting at 18 months old. He really enjoyed his time there. Highly recommend to any parent looking for a fun & engaging school with amazing teachers!",
      "time": 1739481877,
      "translated": false
    },
    {
      "author_name": "Rusha Chakraborty",
      "author_url": "https://www.google.com/maps/contrib/112355042371165546485/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXNrEoiTw6Kn8bfm2jW0sQ2xkT9__By4Vd_Vu6CYax7WUxvKcOFcQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Rainbow Cove Alexandra provides a clean, safe and welcoming environment for preschoolers to socialize and learn. The teachers and principal are very attentive and responsible, ensuring parents are kept informed with regular updates during handovers. They are open to feedback and take appropriate action. They listen and accommodate each child's need as much as possible. The teachers keep the little ones excited and involved with variety of fun and engaging lessons/ activities. Highly recommend Rainbow cove to anyone who is looking for a safe and fun preschool for their kids.",
      "time": 1711532420,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16254979645822477746",
  "user_ratings_total": 28,
  "vicinity": "460 Alexandra Road, #03-04"
}