{
  "formatted_address": "7030 Ang Mo Kio Ave 5, #08-43 Northstar @ AMK, Singapore 569880",
  "geometry": {
    "location": {
      "lat": 1.3775442,
      "lng": 103.8757058
    },
    "viewport": {
      "northeast": {
        "lat": 1.379274730291502,
        "lng": 103.8769762302915
      },
      "southwest": {
        "lat": 1.376576769708498,
        "lng": 103.8742782697085
      }
    }
  },
  "name": "Reading & Spelling with a Difference",
  "place_id": "ChIJRcVeWfEX2jEROzsK15YNwZU",
  "rating": 1,
  "reviews": [
    {
      "author_name": "ong lee",
      "author_url": "https://www.google.com/maps/contrib/114614080068728012169/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKV0-6S5EJH926ET8eFbPTllkMpavZB03RS0t5hK4ETT52_ig=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 years ago",
      "text": "“Reading and spelling with a difference” is a sole-proprietor business managed by a lady name Jacinta Miranda (JM). The business registered under other personal services is in fact a tuition center set up and vast majority make up of special needs students. They market themselves as a one-stop intervention center to bridge special needs children to mid-stream education. For pre-schoolers, they called their programme Simple Minds. But Simple Minds is not a registered business. There are at least 2 hired teachers, her family which consist of her husband and 2 teenage children help out the business. Personally, I enrolled my child and was in her center for 1 year 4 months. I will like to share my experience and warn other parents about their unethical business practice to avoid more victims like us.\n\n1)\tRidiculous advice on primary school deferment\nJM claimed that her school is able to write and get deferment for children to MOE and it had been done successfully many times without any doctor’s endorsement. She is not a registered practitioner in Singapore.\n2)\tLack of care\nMy child was frequently dismissed from school drenching wet bottom down. JM refused to allow my child to go diaper free for the sake of toilet training as her floor is carpeted. I compromised even though my child is almost fully diaper free and only has to be in diaper in her center. Little did I expect that my child will be drenching wet frequently. If due care was exercised, this will not go unnoticed by the teachers.\n3)\tFalse claim on child’s capability\nTo quote an example. Before the circuit breaker, I was issued numbers, addition sign and equal sign flashcard to do addition activity with my child. I and my child’s private OT were still working with my child on number recognition and sequencing. Finding the activity inappropriate for my child’s level, I questioned JM and asked how am I going to do it with my child. She replied my child knows it all and have it all in her.\n\nDuring the circuit breaker period, I worked diligently with my child. Finally I witnessed first handed my child’s transition from not being able to even recognise 1-5 to being able to pick  the correct number. Then much later, sequence 1-5. Thus, I also ascertained that my child does not have the skill prior to that.",
      "time": 1595933215,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10790921123660446523",
  "user_ratings_total": 1,
  "vicinity": "7030 Ang Mo Kio Avenue 5, #08-43 Northstar @ AMK"
}