{
  "formatted_address": "25 Joo Chiat Pl, Singapore 427751",
  "geometry": {
    "location": {
      "lat": 1.313408,
      "lng": 103.9003269
    },
    "viewport": {
      "northeast": {
        "lat": 1.314686380291502,
        "lng": 103.9015509302915
      },
      "southwest": {
        "lat": 1.311988419708498,
        "lng": 103.8988529697085
      }
    }
  },
  "name": "Rehab Alliance | K.H.Poon Physiotherapy",
  "place_id": "ChIJJ7_FvxEY2jER6LkMf3_FgDE",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Eggy A",
      "author_url": "https://www.google.com/maps/contrib/112082877624012549848/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU_Jvdi6xv_Is0TPwPoC4PGuC2mIsp1Urbhi8LKmOPtJL0X8ke9=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I recently needed physical therapy for my balance and range of motion after being discharged from the hospital, and I feel very fortunate to have found Rehab Alliance.\nI have done multiple sessions with DJ, and my experience has been great. DJ takes the time to listen to my concerns and has tailored exercises that I can do both during our sessions and at home. The clinic is well-equipped with a variety of exercise aids, which makes the sessions more effective and enjoyable. DJ is always positive and encouraging, pushing me just the right amount so that I can see real progress without feeling overwhelmed.\nI appreciate how everyone at Rehab Alliance is focused on safety and cares about their patients. It’s a comforting environment. I look forward to my remaining sessions and am grateful for the support I’m receiving on my recovery journey. Highly recommend this place!",
      "time": 1737449366,
      "translated": false
    },
    {
      "author_name": "Huize Anzel",
      "author_url": "https://www.google.com/maps/contrib/104896651946165008329/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVMf9xtAYmYdNe_d78cnW0PaBJzyi7qzlhG7mfORyDGfmQZZCT5=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Had a great first visit to the physio! The therapist took the time to really understand my condition and what I’m hoping to achieve. Everyone—from the therapist to the front desk staff—was friendly, professional, and helpful. I’m feeling confident and optimistic about my recovery journey with them.",
      "time": 1744421212,
      "translated": false
    },
    {
      "author_name": "Olga Bugis",
      "author_url": "https://www.google.com/maps/contrib/108778290745540701961/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVbe0vOcxmrEmQdlBxgawt7EHZlD_xRDQdbr2OxfxA9iRaUs36O=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Dear Team! Thank you for the great work you did to get my daughter’s knee back to normal after the surgery! I am very grateful to Mr Poon as he is very professional, compassionate and understanding! He knows well all the minor things about the knee and he gave a great support for all these weeks to get my duaghter’s knee as it was before the injury. She  could also use the gym, come whatever times per week needed and Mr Poon has always been very particular and attentive during the visits, he spends a lot of time for his patients. And the team is great too, helping in any possible way. I loved the fact that they have all modern equipment which helped to reduce the inflammation (I forgot the name of the machine). As I have injured my knee recently, I had to see Mr Poon myself and I had no doubts he will help me! That’s what is happening now. My knee gets stronger and I am not scared so much  to accidentally fall. Mr Poon also shared the equipment needed to bring to our house, when my daughter needed it. I greatly recommend the clinic and I am happy that our surgeon Doctor Su recommended Mr Poon’s clinic! ❤️❤️❤️👍🤩",
      "time": 1746961484,
      "translated": false
    },
    {
      "author_name": "Alan Chang",
      "author_url": "https://www.google.com/maps/contrib/118166480261131737972/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJN2QgxxPiwezFr2vlm0ak4l8XhCFuv8dsO3f1XOrlDrZRRew=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Physio Poon attended to me on the first session . He first gathered the details and read intently to understand my MRI for actual injury . His was very systematic in assessing the injury by checking the different muscle groups that was weak and aching that led to this injury . I was having OA of the Right joint , most serious injury I ever had since I run full marathon for the last 32 years.  He assigned and monitored my progress after each session and check how I was doing .\nFast forward , after 4 sessions , about 1 month, I was out of pain w/o my NSAID. I could walk w/o pain and almost back to my normal self . Next is to strengthen until I can go back to my training, slowing working with him and surely knowing that I can get back by the workout and grace of God . Indeed he is very good physio and attentive and wants to ensure I am well . Highly recommended !",
      "time": 1747146882,
      "translated": false
    },
    {
      "author_name": "Angeline Choong",
      "author_url": "https://www.google.com/maps/contrib/103522401388192330465/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKmrBblXkLD17MwqOfEgY8Tpo40gjM3bHnS3lrudWzoVH86tw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "⭐⭐⭐⭐⭐\nIf I could give more than five stars, I would! Mr Poon isn’t just a physiotherapist—he’s a miracle worker. I walked in feeling like a rusty old robot and walked out feeling like a brand-new human. His kindness, patience, and expert care helped me recover so quickly that I started to wonder if he had magical healing powers. If you’re looking for someone who knows their stuff and can fix you up while making you feel comfortable (and maybe even laugh through the pain), this is the place to go! He also have a team of very brilliant people that work along side together. Highly recommend!",
      "time": 1742291878,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3567068056260491752",
  "user_ratings_total": 132,
  "vicinity": "25 Joo Chiat Place"
}