{
  "formatted_address": "501 Bukit Timah Rd, #02-01, Singapore 259760",
  "geometry": {
    "location": {
      "lat": 1.3225945,
      "lng": 103.8144895
    },
    "viewport": {
      "northeast": {
        "lat": 1.323959980291502,
        "lng": 103.8158971802915
      },
      "southwest": {
        "lat": 1.321262019708498,
        "lng": 103.8131992197085
      }
    }
  },
  "name": "Relish by Wild Rocket",
  "place_id": "ChIJ-zEJvQYa2jERd8vrJa_-zzw",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Vanessa See",
      "author_url": "https://www.google.com/maps/contrib/109334880149125745863/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK5tZhLRfrhTXAYzoyE4vFSJbKSNMCIsMF2-6N9wUSXaQDkbg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Terrible burger. Very sad to see the standard has dropped - the patty was hard and dry, and tasted like it had pork mixed into it. Was smelly too, which it never used to be.\n\nCutting open the burger, the cross section shows a very dense, overmixed patty. The burger bun used to be buttery and soft, now it’s dry and much firmer. Wayyyy less sauce as well.\n\nFries also had a weird aftertaste, might be the stale oil, or that the supplier has changed. Either way, it wasn’t as good as long time.\n\nWill not repurchase.",
      "time": 1744958627,
      "translated": false
    },
    {
      "author_name": "Kelly C",
      "author_url": "https://www.google.com/maps/contrib/105223816679062692639/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocILJvzbKMFAiBCG_fBaUU3kqmS6HOrT6NYpDyRI6zb44IvBHml8=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "If you're keen to experience local flavours in a different way, Relish's mod-Sin cuisine is sure to delight your palate. This joint is awesome for groups, so you can try many dishes at once.\n\nThe scallop 'Her Kiao' glass noodles, when mixed with the sauce and fried lard, were so flavourful. I thoroughly enjoyed the Spicy Vongole that has a robust taste with the infusion of laksa leaves and a generous portion of clams!\n\nHae Bee Hiam pasta, too, was tasty, but I would have loved it to be spicier and less sweet. I enjoyed the mushrooms prata pizza that hits your nose first.\n\nWe also had the Krapow prata pizza, Carbonara, Crabmeat linguine, Chicken rice bowl, Beef burger and  3 starters!\n\nAn overall great experience! Loved the ambience and the friendly and attentive service!",
      "time": 1738908582,
      "translated": false
    },
    {
      "author_name": "penny",
      "author_url": "https://www.google.com/maps/contrib/104198052626816980862/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKp78MbLDwmIndox9Gihe7w3PyGsTsWKpPKeQl9uBphGCOgl-k=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "11 months ago",
      "text": "i really enjoyed the burgers! i requested for medium rare and they delivered it well, the meat was juicy and was pink in the centre 🤤 the bun they used was nicely toasted and very soft! the fries were also crispy and full of flavour so i didn’t get tired of eating them half way.\n\nthe pasta was delicious too, just that the portion was pretty small for its price. though i guess that it can be attributed to the quality and preparation. luckily, we ordered a bunch of dishes to share, so it wasn’t really a big issue for us. if you’re coming here alone, or not into sharing dishes, i’d recommend getting a burger as it’s more satisfying (in terms of portion size).\n\nfree water (self service) is a plus too!",
      "time": 1716989036,
      "translated": false
    },
    {
      "author_name": "Katong Panda",
      "author_url": "https://www.google.com/maps/contrib/106753012560992924648/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVRI5_bJFhNtNv-fIhVxGJ3CmoClkkgnr7bGbCXN24hGOa1w1c=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "8 months ago",
      "text": "A cosy cafe tucked at the 2nd floor of the Cluny Court. Walking distance from the Botanic Garden.\n\nFrom the moment you step inside, you’re greeted with a warm and inviting atmosphere that sets the perfect tone for a relaxing meal.\n\nThe menu is a delightful mix of fusion and inventive dishes that cater to a variety of tastes.  They are mostly delicious. We enjoy most of them.\n\nThe coffee is exceptional, brewed to perfection. Service is friendly and attentive.\n\nWe have to fetch our cups of water from a far away counter.\nWe can't stay here for long as they will start clearing up the table when the time is nearly up. 😂",
      "time": 1724562108,
      "translated": false
    },
    {
      "author_name": "Cam Bee",
      "author_url": "https://www.google.com/maps/contrib/117744431969418497469/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXkDYHf0f17UyqGLJhLPkgJBezgST4IXwXwZunKbLmjECbYrFxT=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "8 months ago",
      "text": "Three of us visited this establishment to enjoy a light dinner accompanied by laughter and conversation. The venue exuded a welcoming ambiance, characterized by dim lighting and a cozy atmosphere, enhanced by wooden seating adorned with large, comfortable cushions, strategically placed lamps at the corner tables, and tealight candles on selected\ntables.\n\nThis location is ideal for a relatively quiet gathering with family or friends, particularly on a Saturday evening when the crowd is minimal.\n\nRegarding the food, it was satisfactory—pleasant and standard fare, which complemented the overall atmosphere. I must emphasize that the service was exceptional; the staff frequently checked in to see if we required anything further and ensured our satisfaction. They were also accommodating regarding our table preferences.\n\nAdditionally, we ordered the lemongrass ginger drink, which was delightful. The crab linguine was flavorful, and the Large portion size would likely suffice for those with hearty appetites, though we shared it among ourselves for a light meal. We would certainly consider returning for another casual catch-up, especially if one desires a light meal.\n\nThe location is conveniently situated just a short three-minute walk from the Botanical Gardens MRT Station.",
      "time": 1725848782,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4382000990663723895",
  "user_ratings_total": 777,
  "vicinity": "501 Bukit Timah Road, #02-01, Singapore"
}