{
  "formatted_address": "116 Lavender St., #01-07 Pek Chuan Building, Singapore 338730",
  "geometry": {
    "location": {
      "lat": 1.3117435,
      "lng": 103.8623904
    },
    "viewport": {
      "northeast": {
        "lat": 1.313047780291502,
        "lng": 103.8637561802915
      },
      "southwest": {
        "lat": 1.310349819708498,
        "lng": 103.8610582197085
      }
    }
  },
  "name": "Renozone Interior Design House",
  "place_id": "ChIJjfCy3bYZ2jERsXIPnbN__ys",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Major Fleedom",
      "author_url": "https://www.google.com/maps/contrib/103179871788069675139/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWLyntQw57k_cM3Icei3RaN0t3ZxuZk4qtYXXpcPxbqsQsdZ_er=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Renovating a home isn’t just about construction, it’s an experience, a journey shared with the renovator. A good renovation goes beyond craftsmanship, it’s about trust, communication, and the feeling of being in good hands.\n\nRenozone has worked on both my flat and my brother’s, and each time, the experience was consistent, familiar, and reassuring. Their dedication to quality and attention to detail delivered results that were not only satisfying but gave us the confidence that our homes were in the right hands. Walking into the completed space felt like stepping into something thoughtfully crafted, made with care and precision.\n\nWhat truly sets Renozone apart is their people. The staff are warm, accommodating, and genuinely invested in bringing a vision to life. They don’t just renovate spaces, they create homes filled with comfort and character.",
      "time": 1740760444,
      "translated": false
    },
    {
      "author_name": "Alex LiM",
      "author_url": "https://www.google.com/maps/contrib/115519697510885026095/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKl_y3XRizV0UZguDHPevFlepL6QakBkRM7N1gUGJhOn2SREzo=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I recently engaged Renozone Kelvin and his team to design and renovate my home, and I couldn't be happier with the results! From start to finish, they considered every little detail, ensuring that my home felt both functional and incredibly welcoming.\n\nTheir expertise in interior design was evident in every aspect, from the kitchen to each room. Even when I felt lost or unsure about certain decisions, their team provided excellent advice, guiding me through the process with professionalism and patience.\n\nTheir overall work was awesome, their carpentry and electrical work were outstanding—flawlessly executed with precision and top-notch craftsmanship. Every element of the renovation was thoughtfully designed, making my home aesthetically pleasing and highly practical for daily living.\n\nIf you're looking for an interior design firm that truly listens, cares about the smallest details, and delivers high-quality results, I highly recommend Renozone! They transformed my home into a space that my whole family absolutely love. Thank you for making my dream home a reality!",
      "time": 1742515147,
      "translated": false
    },
    {
      "author_name": "Jamie Oh",
      "author_url": "https://www.google.com/maps/contrib/104210707880728224931/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocInL4ZK9tKCgUWEqsbXnDqECXhijidxQKTzh6NYSuwisDecmA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Introduced to Colin from renozone by my sister who did reno with him since more than 10 years ago. Very prompt and efficient service throughout the reno process, Colin is always very patient and responsive to my queries no matter big or small. Contractors who worked under him are also very meticulous to ensure all things are in good order. Satisfied with the final result of the house 😊 will recommend to family and friends who are looking for reno recommendations 🤗👍",
      "time": 1745813864,
      "translated": false
    },
    {
      "author_name": "Walter Loo",
      "author_url": "https://www.google.com/maps/contrib/110501325275318397208/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLOZuklO9gFsHLG0LgJV7ymsV7fsFeTiFuwg1Y-Pzel0ZUb3w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "This is our 2nd time engaging Renozone for our major house renovation. The 1st time was around 18 years ago , and since it was soooo good the 1st time, it was natural for us to go back to them. Both Kelvin and Collin saw thru the project, and handed over on time just as they had promised, around in 10 weeks and earlier, just before CNY 2025. Collin was the ID creative ideas, while Kelvin was the person making it happen. The support was extremely positive, special note especially going out to Kelvin, who responded to our concerns promptly and fixing it very quickly. He was also very knowledgeable telling us what can do, what cannot. It made our renovation less stressful. As said, we did a major Reno, overhauling everything. They will work to your budget and make it work out regardless. Overall it was a good experience. Definitely recommend.",
      "time": 1738121465,
      "translated": false
    },
    {
      "author_name": "Masak JeannieeY",
      "author_url": "https://www.google.com/maps/contrib/108203211854356812679/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLLRz0r5KPUn4HoUV7uA3aAK-0t0EF_-vScP2Nmt3PMrtzxhw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I engaged Renozone to renovate my 4 room resale flat and I did not regret my choice. Kelvin was my ID and renovation in-charge. He was responsible and gave sound advice on all my renovation queries. As a result, there was no hiccup in my renovation journey.\nThe renovation cost was also reasonable. Knowing that I would be retiring soon, Kelvin did not give me pressure to take on the more costly renovation items. The final result of the renovation is that my house is now cozy with good quality carpentry.",
      "time": 1745203280,
      "translated": false
    }
  ],
  "types": [
    "general_contractor",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3170393072103027377",
  "user_ratings_total": 47,
  "vicinity": "116 Lavender Street, #01-07 Pek Chuan Building"
}