{
  "formatted_address": "T4 Arrival Dr, Singapore",
  "geometry": {
    "location": {
      "lat": 1.3377807,
      "lng": 103.9817428
    },
    "viewport": {
      "northeast": {
        "lat": 1.339142430291502,
        "lng": 103.9831203802915
      },
      "southwest": {
        "lat": 1.336444469708498,
        "lng": 103.9804224197085
      }
    }
  },
  "name": "Roost",
  "place_id": "ChIJuSefIwA92jERcn56aKHgoNw",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Ray Tan",
      "author_url": "https://www.google.com/maps/contrib/118226053308108066808/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVpzGMkrPcUaKMsYznOMivq95jZGbdTCKMEQp8ZEaU81-Ne_95w=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "2 months ago",
      "text": "Sb overpriced chix rice… ~$13 nett for a set of Hainanese chix rice. Had a plate of flattened white tits meat slathered with their in house sauce. The rice is slightly hard but still acceptable. The chilli is decent as well. Comes with a small bowl of soup with small clumps of boiled vegs. It’s just v overpriced. I uds maybe overheads are high but at least give some standard la. Even the chatterbox xpress at T1 is just slightly pricier. Nay for me.",
      "time": 1742268969,
      "translated": false
    },
    {
      "author_name": "Alan Phua",
      "author_url": "https://www.google.com/maps/contrib/108544517837913313926/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXVh_sveZvniXmpjCDrjL-lTMM0Ok46mEC-cREtAN4LBhTxqEfC=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Decent Chicken Rice conveniently located at T4 Arrival\n\nThe ubiquitous Hainaese Chicken Rice is every Singaporeans' comfort food. Whether roasted, steamed or soya sauce chicken rice, even down to whether thigh, breast or drum meat, every Singaporean has their favorite combination. It's one of those beloved Singaporean dish that can unite and divide Singaporeans.\n\nHave passed by this shop multiple times after landing at T4 and today decided to give it try as I was not in a rush for time. I actually did not know it was a Chicken Rice specialty shop until I inspected the menu up close as they sold other dishes also.\n\nPerhaps the shop should display the prepared chickens in the glass cabinet to be more obvious.\n\nPretty straight forward menu and cashiering. As it was morning, the restaurant wasn't busy and the food arrived pretty fast.\n\nVery well presented with the familiar fragrance of the chicken rice wafting gently through the air!\n\nOn first visual inspection, chicken breast was well cut and presented, rice was neatly scooped into a bowl and it came along with a hearty bowl of soup.\n\nWhile eating I took the chance to read up about this establishment and interest was piqued when it touts itself as Singapore's first automated chicken rice shop.\n\nThe chicken is in fact cooked to precision via a proprietary equipment known as iKook.\n\nOn to the taste, both the soya sauce and steamed chicken had a good gelatinous skin but curiously the meat was a tad dry. Nonetheless it was still tasty and I finished both portions pretty quickly.\n\nOn the rice - I felt the rice could have been better. It was clumpier than expected and somehow lacked deep flavour. Somehow I felt it was abit of an outlier when paired with the chicken. Will have preferred it to be \"oilier\".\n\nThe chilli sauce was refreshing with a stronger sour note.\n\nThe soup was salty! However it had nice chunks of vegetables.\n\nOverall I think this is pretty decent for chicken rice though at some part of the meal, I felt it was at risk of being out of balance.\n\nWith the price of 13sgd (after tax and svc charge) in a very comfortable environment after a flight, is actually quite alright.\n\nFor those Singaporeans living abroad, this is still a nice welcome when we fly home.",
      "time": 1740367388,
      "translated": false
    },
    {
      "author_name": "Justin Teo",
      "author_url": "https://www.google.com/maps/contrib/109776564465139819836/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK4M86YteSIIzB4QlwCICxLG8ij6foidXhH24ylNULCjw5p6g=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 4,
      "relative_time_description": "2 weeks ago",
      "text": "The food reminds me of the defunct Toa Payoh Lor 4 Soya Sauce Chicken. All the food from the chicken rice set including the soup, sauce and chicken is good. Chicken is abit little for the price.\nThe atmosphere is kinda cafe casual style so doesn’t really justify that kinda price.\nIf they can lower it to below $10 or include gst, that would bring in more regulars.\nWould not return for at this price unless no other food to eat at T4.",
      "time": 1746358545,
      "translated": false
    },
    {
      "author_name": "Jun Kai Toh",
      "author_url": "https://www.google.com/maps/contrib/107198429972623127094/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIPN1FUzCqD-00KgFKn8CklgPolNdXkMMDYURKPlM3OyYGWYg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "3 weeks ago",
      "text": "Yin Yang Chicken Rice $10.9++\nGood flavour and texture. Roasted chicken not too different from steamed since all soaked in sauce. Chili is good\n\nSayur Lodeh $5.9++\nOkay curry vegetables\n\nMinced Chicken Tofu $5.9++\nNicely fried and good meat sauce with mushrooms\n\nOverall good, but can get better elsewhere for the price",
      "time": 1745673354,
      "translated": false
    },
    {
      "author_name": "Benjamin Low",
      "author_url": "https://www.google.com/maps/contrib/116161376842727717352/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUa-qD9Hn-ZO9dTCRDgaLSt7Pt-VxaZTbv5Tq6LKf27zcFQYXn-2Q=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Just on the left of the arrival hall when arrived to Singapore..\n\nGood chicken rice! Does not lose out to the hawker.\n\nFeel good to be able to enjoy good chicken rice upon arrival vs eating overpriced food on flight (budget ones)",
      "time": 1742739239,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15897953668465065586",
  "user_ratings_total": 8,
  "vicinity": "T4 Arrival Drive"
}