{
  "formatted_address": "Mount Alvernia Hospital., 820 Thomson Road #05-59 Medical Centre D Singapore 574623 Thomson Rd, Singapore 574623",
  "geometry": {
    "location": {
      "lat": 1.3417017,
      "lng": 103.8380437
    },
    "viewport": {
      "northeast": {
        "lat": 1.342979130291502,
        "lng": 103.8393926802915
      },
      "southwest": {
        "lat": 1.340281169708498,
        "lng": 103.8366947197085
      }
    }
  },
  "name": "S L Goh Women's Clinic",
  "place_id": "ChIJMyrvuEYX2jER3IeB0996pKM",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "hling",
      "author_url": "https://www.google.com/maps/contrib/103769541017811370962/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLD-m1rRWxPUyeEDM_ALgqdrhQ5nbfybMB83hwiV6aYAFhwEQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "This is my second pregnancy under the care of Dr. Goh. My first pregnancy with her was smooth and uncomplicated. However, this second pregnancy has been quite different from the first.\n\nI was diagnosed with preeclampsia, but Dr. Goh closely monitored my condition and made a firm, timely decision that we could not delay delivery any further. She emphasized the importance of delivering as soon as possible for the safety of both myself and my baby.\n\nThroughout the process, Dr. Goh has always been patient in answering all my questions. When it came to making critical decisions, she remained calm, firm, and reassuring, giving me great confidence that both my baby and I were in safe hands.\n\nI highly recommend Dr. Goh to anyone looking for a dedicated and experienced obstetrician. You will definitely be in good hands. I also want to thanks the wonderful staff at Dr. Goh’s clinic — they have always been attentive and helpful in addressing all my pregnancy-related queries.",
      "time": 1745748545,
      "translated": false
    },
    {
      "author_name": "Melissa Lim",
      "author_url": "https://www.google.com/maps/contrib/106402703589580714820/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIcr65N5JOnuF9qVZkDWIY5pl4fGT9I0G_Eok77oCEyTEg44w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "A big thank you to Dr Goh and team - for all the care and support throughout the entire pregnancy journey! Dr Goh is very experienced and both her professionalism alongside with her calm demeanor had provided my husband and I so much comfort and assurance especially as first-time parents. We also had positive experiences throughout each consultation visit as all the staffs are also very helpful, highly efficient and very organized/ systematic! Delivery was very swift and smooth (no doubt we felt very assured that we will be in good hands with Dr Goh) and recovery was quick as well. Incredibly grateful to have Dr Goh and team’s care during my entire pregnancy journey, so much so that it was a smooth sailing one. Big thank you once again! 🩵",
      "time": 1739237296,
      "translated": false
    },
    {
      "author_name": "Lydia Tang",
      "author_url": "https://www.google.com/maps/contrib/110216073367712712403/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI0_2J5ZBPNB1iybWRPSw_jF5atCLKifDEK_k28YAXYvdYI2Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I can’t express enough how grateful I am for Dr. Goh and the exceptional care I received throughout my pregnancy. From the very first check-up, Dr. Goh was not only thorough and knowledgeable but also incredibly reassuring. Every visit felt like a safe space where all my concerns, no matter how small, were addressed with patience and understanding. The peace of mind I felt knowing that my baby was healthy, paired with Dr. Goh’s calm and assuring words, truly made every appointment something to look forward to. Thank you, Dr. Goh, for your unwavering care and professionalism. You made this journey a lot less stressful, and I’ll always be grateful for that.",
      "time": 1743675159,
      "translated": false
    },
    {
      "author_name": "Jolyn Tay",
      "author_url": "https://www.google.com/maps/contrib/106716863570708228638/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLytVu_jg-UeimLkABXn7HYPziaElQ4_C_RXJuE8ONycc2wmg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Thank you to Dr Goh and her team! Dr Goh is patient, attentive, and takes the time to answer all questions thoroughly. Her skill and expertise were evident throughout my delivery, which went smoothly thanks to her calm and confident care. The post-delivery stitches healed beautifully, a testament to her precision and experience. I felt truly supported and in safe hands every step of the way. Highly recommend her!",
      "time": 1745939571,
      "translated": false
    },
    {
      "author_name": "Lynn Goh",
      "author_url": "https://www.google.com/maps/contrib/116361266668846784932/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKXFPoMtn1xsxqgpFUQWndV5Fnfa9jM98Yl_1sDmUGSK3jdTQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I had a wonderful and positive pregnancy experience throughout the entire 10 months of pregnancy, my husband and I have always felt assured and know that we’re in good hands. Dr Goh was very empathetic to listen to our concerns and patient with our questions each session. Dr Goh shares her knowledge/advise backed by statistics and never forces her opinions on me to make certain decision. Great teamwork from the front desk, they are very efficient and good communication via texts!",
      "time": 1742366116,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11791684826107578332",
  "user_ratings_total": 156,
  "vicinity": "Mount Alvernia Hospital., 820 Thomson Road #05-59 Medical Centre D Singapore 574623 Thomson Road, Singapore"
}