{
  "formatted_address": "154 W Coast Rd, #02-24 West Coast Plaza, Singapore 127371",
  "geometry": {
    "location": {
      "lat": 1.3035473,
      "lng": 103.7658775
    },
    "viewport": {
      "northeast": {
        "lat": 1.304793080291502,
        "lng": 103.7669869802915
      },
      "southwest": {
        "lat": 1.302095119708498,
        "lng": 103.7642890197085
      }
    }
  },
  "name": "Saigon Legend @ West Coast Plaza",
  "place_id": "ChIJ83vVWJIb2jERitYwGu6SXuE",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Frederick Tan",
      "author_url": "https://www.google.com/maps/contrib/105431133624174376742/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX-LwQprCQajdt7zC7cd1e236USKKDV3lFIC5VcEI2TrDWjftUv=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Saigon Legend: A Feast for the Eyes and Tastebuds at West Coast Plaza\n\nMy recent lunch at Saigon Legend in West Coast Plaza wasn't just a meal; it was a sensory journey.\n\nAs I walked in, instead of just smelling the food, my attention was immediately drawn to the large TV panel showcasing close-up, mouth-watering videos of authentic Saigon cuisine. The vibrant colors, the glistening sauces, the perfectly arranged herbs - it was a visual feast that set the stage for the delicious meal to come. It truly amplified the anticipation!\n\nI started with the traditional saigon Banh Mi with pork, a Vietnamese staple. The baguette was perfectly crisp on the outside and soft on the inside, providing the ideal vessel for the savoury filling. The pork was tender and flavourful, complemented by fresh cilantro and carrots. It was a symphony of textures and tastes, a truly satisfying sandwich.\n\nTo accompany the Banh Mi, I ordered the Vietnamese drip coffee without milk. The slow drip method yielded a strong, rich, and aromatic brew. It was the perfect pick-me-up, with a bold flavour that lingered on the palate.\n\nNext up was the fresh Vietnamese wrap (the non-fried type). These delicate rolls were packed with fresh lettuce and succulent prawns. The accompanying fish sauce was zesty and flavourful, adding a delightful sweetness to the dish. It was a light and refreshing option, perfect for a warm afternoon.\n\nTo quench my thirst, I opted for the lemongrass drink infused with pandan leaves. The lemongrass provided a citrusy note, while the pandan added a subtle sweetness. It was a fragrant and refreshing beverage, the perfect complement to the savoury dishes.\n\nThe portions were generous, and the prices were reasonable, making Saigon Legend an excellent value for money. The service was friendly and efficient, adding to the overall positive experience.\n\nIf you're looking for authentic Vietnamese cuisine in a relaxed and inviting setting, Saigon Legend at West Coast Plaza is a must-try. From the flavourful Banh Mi to the fragrant lemongrass-pandan drink, it was a very friendly and enjoyable sensory experience to the rich culinary heritage of Vietnam.\n\nHighly recommended!",
      "time": 1743167123,
      "translated": false
    },
    {
      "author_name": "LP Pua",
      "author_url": "https://www.google.com/maps/contrib/113241051085659633004/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVJat0H-xuRcFQ5fZT0JkY6ObyUNLgL0WoknObSDkfn6wl6eZJnmQ=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "4 weeks ago",
      "text": "We came for a lunch gathering, attracted by their under $20 lunch meals. The selection was extensive, and we were spoiled for choice. Service was fast, and the food quality was generally good, based on various feedback",
      "time": 1745369529,
      "translated": false
    },
    {
      "author_name": "Evelyn",
      "author_url": "https://www.google.com/maps/contrib/100752907852147302568/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLv745tP2T2gQ3-wWfn1sPR0C1Ff3MbtptEKBHOUZ03P94VJg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Been frequenting this place in 2024, haven't been back for 4 months and boy the food quality and taste has been upgraded! The beef pho is the closest so far to an authentic bowl in HCM City, nothing comes closer (and we are pro-actively looking for Vietnamese food in Singapore).\nGonna be back real soon again! 🥳\n\nForgot to mention: the Viet coffee here is AMAZING! They made the coffee a showy tripled-layer presentation - with foam on top, coffee in the mid-tier and condensed milk at the bottom.\nAt $1.95 (add +0.50 for takeaway), it’s a steal!\n\nHighly Recommended!",
      "time": 1740890709,
      "translated": false
    },
    {
      "author_name": "Whatever You say",
      "author_url": "https://www.google.com/maps/contrib/115784704512979476478/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLc6H4DGJsuoYceTUVdxVCKTROU_h9oZRkxlItpDhCefacFMQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Great ambience and atmosphere. Good place to chill on a weekday night. Their food is more towards the healthier and less oily side. I had their vegetarian tofu vermicelli and enjoyed it a lot.",
      "time": 1741957761,
      "translated": false
    },
    {
      "author_name": "Vera Bunawan",
      "author_url": "https://www.google.com/maps/contrib/102873968321821107630/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJB_q2ugUg6mxYahCXNwOlKX2xCO-Sqc5QH841Es6_Iqq-2Mw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Great food. We ordered platter to share, prawn mango salad, pork grill skewer and garlic salt mid wings. All taste delicious and yummy 😋 good food pair with beer and wine 😋😋😋😋 Vietnamese roll has good standard, next time will try their pho and baguette.",
      "time": 1728123359,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "restaurant",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16239578857683867274",
  "user_ratings_total": 438,
  "vicinity": "154 West Coast Road, #02-24 West Coast Plaza"
}