{
  "formatted_address": "1A Tampines Street 92, #01-00B SAFRA, Singapore 529453",
  "geometry": {
    "location": {
      "lat": 1.3446019,
      "lng": 103.9416649
    },
    "viewport": {
      "northeast": {
        "lat": 1.345743380291502,
        "lng": 103.9430727802915
      },
      "southwest": {
        "lat": 1.343045419708498,
        "lng": 103.9403748197085
      }
    }
  },
  "name": "Sarpino's Pizza",
  "place_id": "ChIJDRxXlRc92jER2daLplGd5GY",
  "rating": 3,
  "reviews": [
    {
      "author_name": "Sean",
      "author_url": "https://www.google.com/maps/contrib/117168273624339544276/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUbD_BYMwEhIygC-QuvrmQkmjlwc4-WeblS46YWrS1JTROT0-uBhw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "7 months ago",
      "text": "On 5 May 2023, 1 pm, I was there to use a one for one promotion from Safra. The air con of the place was not working.  Secondly, the place ran out of canned drinks and I could only get mineral water for the personal set I ordered.  It was an horrible experience.  I believe it was intentional to scam safra customers during the promotion.\n\nI wrote email to the customer service.  One month later, a Greg Blakney replied, he said he would make goodwill compensations to me and asked if I am on their membership scheme.  I am not on their membership scheme and asked for advice but he didnt reply me.  I wrote back two more times over the course of weeks and still he ignored me.\n\nI urged you not to patronize this pizza chain.  The food was actually not value for money and not that nice.\n\nOn 30 Sep 24, visited again as need to redeem a safra voucher.  Malay staff said member no discount on side dishes except pizza, as instructed by their boss. But strangely their banners on member discounts both on glass wall and on counter didn't specify anything about this.  When safra staff was talking to Malay staff, Malay staff even told her he didn't know what banner said and that it was outdated.\n\nVery overpriced items.. got the garlic bread in the end and it was selling at 6.20.  The place was understaffed.  At 5 pm only one staff working and I need to wait a long long time for order to be taken.  Later need to wait long time for order again.  Because staff also busy preparing food.\n\nI urged ppl not to patronise this store\n\nEdit: 7 Oct 24. After last visit, I learned from safra staff that their 10 percent discount banner was obsolete and it should be 15 percent on ala carte menu.  So Sarpino not only tried to scam me no discount, even after intervention, gave me an older discount of 10 percent.  Safra staff Gladys was kind enough to say she would reimburse me if Sarpino doesn't return me the difference.  So I have to take another long tedious walk to safra 7 Oct 2024 850 pm. Staff told me he has no key to drawer and asked me to come back tomorrow!  I left but I was thinking why he can't pay me first and take from drawer himself later.  I went back and he made phone call to boss and now magically could produce an envelope with the miserable 30 cents refund. I think Sarpino purposely wanted me to walk to fro",
      "time": 1728306373,
      "translated": false
    },
    {
      "author_name": "Garion K",
      "author_url": "https://www.google.com/maps/contrib/100847096966085054638/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIMKUOmttBVoPshS8v3PRh_0FBrZJO9z1QZfjrggqtKM7XEQQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 2,
      "relative_time_description": "4 years ago",
      "text": "Ordered pizza delivery. Both regular Gourmet 9”, one Tropical Hawaiian and a Midnight Express.\nJust a few things..\nOnly after order confirmation was the delivery time mentioned. So you have no way to gauge the time to decide whether to proceed with order.\nThen, it said order would be delivered in 90mins. But it took more than 2hrs for the order to finally arrive.\nLike a few other reviewers highlighted, pizzas were way under-sized! Well, only the pizza boxes measured a tad bigger than 9”!! The 9” pizza itself couldn’t even make the 8” mark!😏\nLast but not least, the pizzas were a little too oily, toppings under provided, taste so-so.\nSarpino’s used to be good, that was many years back. Now, I suppose it’s better to give it a miss.. this would be my last.",
      "time": 1620576000,
      "translated": false
    },
    {
      "author_name": "Byron Luo",
      "author_url": "https://www.google.com/maps/contrib/110175190204977161084/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIcX2lyPUH9o9-43Db3Gu_p144dqNAc9wE4RsLqdaG8xwD4-Q=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "I ordered a aloha pizza at foodpanda\nBut….\nThat’s horrible\nYour restaurant please check first before serving thanks",
      "time": 1715081193,
      "translated": false
    },
    {
      "author_name": "Ben Loy",
      "author_url": "https://www.google.com/maps/contrib/115067595425147527913/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKJjJHiUt_FaNN-A1_ZnzO2TNMkU_8DEjObnhv1LC0PPI-2Rdhx=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "4 years ago",
      "text": "Was there for dine-in, just nice caught a promotion - around $22 for x2 regular pizzas, arrived around 15mins. Pizza was freshly made and served piping hot on the spot (margherita and pepperoni). Cheese was stringy and crust was also made right - not extremely or specifically thin, but sufficiently crispy for the standard consumer. From comments here, seems like dining in has better experience",
      "time": 1606732254,
      "translated": false
    },
    {
      "author_name": "Bobby Ang",
      "author_url": "https://www.google.com/maps/contrib/114711807052776421675/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIlKEhNcjzcTQXVxXkEXwPduamPfMn6qGEDcpPkJSurqB06Jx4=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Thank you Sarpinos (Suhaimi) for the wonderful pizzas and to accommodate our early order ☺️ Appreciate the speedy delivery and good communication!!",
      "time": 1742015811,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7414223860570773209",
  "user_ratings_total": 47,
  "vicinity": "1A Tampines Street 92, #01-00B SAFRA, Singapore"
}