{
  "formatted_address": "Cosford Container Park, Cosford Rd, #01-01 30, Singapore 499550",
  "geometry": {
    "location": {
      "lat": 1.3652545,
      "lng": 103.9812318
    },
    "viewport": {
      "northeast": {
        "lat": 1.366706130291502,
        "lng": 103.9824804802915
      },
      "southwest": {
        "lat": 1.364008169708498,
        "lng": 103.9797825197085
      }
    }
  },
  "name": "School of Cambridge",
  "place_id": "ChIJH7YARTU92jERY9yp9Qy9zyc",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "jayden",
      "author_url": "https://www.google.com/maps/contrib/105743541374316989018/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLwULvJdQDmvny72TJa5YalPplbiH7oOpP8fRxWfUiYNkgQ6pmd=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Great place with great atmosphere with view of airplanes landing, you can constantly see in good view of the planes so near to you and hearing the loud thunder of the planes landing.\nDefinitely a great view for plane lovers, however if you are looking for a place to have business discussions or meetings, it may not be appropriate as every few minutes there will be the loud rumbling of the plane landing.\nThe staff are also friendly, you can order food from the other stalls to eat here however you will need to clear the plates yourself and bring it down before you leave which is understandable since it's a different entity and standalone bar itself.\nIt's very windy too, was there from evening till night and both the evening and night view is great!",
      "time": 1728558429,
      "translated": false
    },
    {
      "author_name": "Tiffany Sim",
      "author_url": "https://www.google.com/maps/contrib/100024594898343922889/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU9d_E5PE_kMIZvz1bX4oGaVITvRlTh8SklDmj1GMzJesYnXnI=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "Delicious cocktails. Have tried the gin cocktail (spring bloom) and the vodka cocktail (dancing queen) both taste awesome.\n\nThe food in the menu is from downstairs vendors but they will help you bring up.\n\nThe ambience here is superb, relaxing and peaceful. It’s situated on the 2nd floor so we were able to watch the planes from here too.\n\n(also the bartender here q cute 🤭)",
      "time": 1719140913,
      "translated": false
    },
    {
      "author_name": "Jia Wen Toh",
      "author_url": "https://www.google.com/maps/contrib/112044666945589113677/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIccME4y5OSob08BBzbLDJWAKcKlP-VYS4lWcpDOol_mumHHQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "If you're up for a unique bar experience, School of Cambridge is definitely worth checking out. It’s right next to the airport runway, which gives it a really cool and hip yet romantic vibe. It’s a great spot for hanging out with friends or a special date.\n\nThe cocktail menu here is a real standout. Instead of the usual drinks, they’ve got some seriously creative options. I’d recommend getting a group together and trying a bit of everything because every cocktail we had was amazing (or if you’re a good drinker, you can just order and drink everything by yourself without having to share 😉). I’m not usually a fan of rum, but my friend’s Bumblebee cocktail changed my mind—it was fantastic!\n\nI was also skeptical about trying the Spring Bloom cocktail because of the egg white, but the bartender, Mr. Isaac, convinced me it would be good. He was right! The drink was super refreshing and had a smooth texture that really made it special.\n\nMr. Isaac is awesome—really friendly and knowledgeable about the cocktails. He’s great for suggestions if you’re not sure what to try, and he’s open to feedback too.\n\nThe only downside is the location. It’s a bit out of the way next to the airport, which might put some people off. But honestly, the cocktails and the vibe are totally worth the trip. I hope more people discover this gem because it’s definitely an underrated place I’ll be coming back to!\n\nI would highly recommend this place for a chill date to impress your partners, or for a hen/stag night! It’s also suitable for groups looking for a nice place to chill and bond together.",
      "time": 1725598938,
      "translated": false
    },
    {
      "author_name": "Tess Neo",
      "author_url": "https://www.google.com/maps/contrib/114906663583090475701/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKLQVG4_y7JBZ3g_ASYRc_4Do51RUQlsWs1hzbg3ZI5y0_JIg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "The bar is just across the runway, which provides an awesome view of the planes taking off. Love the drinks at this bar and bartender was also able to customise a drink for me. Top picks will be Spring Bloom, Dancing Queen and Midori Cream Soda 🥰 definitely worth multiple visits!",
      "time": 1719157413,
      "translated": false
    },
    {
      "author_name": "Wendy Chua",
      "author_url": "https://www.google.com/maps/contrib/109987059542641241681/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUYXUvrLVZwl7Nw9tzo8IZUE6O39a4Mt9GLzjcBc3knn8q4K_pt=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "The cocktail class was awesome for the price, we get to make 3 types of drinks for the price of $22++ on National Day weekend. The staff was nice and also explained to us the making of cocktail. We had a nice view of the planes at Changi as well. Nice to hang out with friends",
      "time": 1723367617,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2868719351017102435",
  "user_ratings_total": 89,
  "vicinity": "Cosford Container Park, Cosford Road, #01-01 30"
}