{
  "formatted_address": "51 Tg Pagar Rd, #03-00 / #04-00, Singapore 088472",
  "geometry": {
    "location": {
      "lat": 1.278669,
      "lng": 103.843997
    },
    "viewport": {
      "northeast": {
        "lat": 1.280024830291502,
        "lng": 103.8452983302915
      },
      "southwest": {
        "lat": 1.277326869708498,
        "lng": 103.8426003697085
      }
    }
  },
  "name": "Secret Party World : 给我一首歌的时间 Family Karaoke @ Tanjong Pagar",
  "place_id": "ChIJtxKkScwZ2jERvguWCXlcJIQ",
  "rating": 3.4,
  "reviews": [
    {
      "author_name": "Chee Kiong Tan",
      "author_url": "https://www.google.com/maps/contrib/101817943142954775510/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVpXBli_6VngQLpWvKOt-l_2Idsxs_HjnsnqU5XD42jJ1fGFyqF=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "Promo for before 8pm is very very very worth it.\nThe system to select songs and sound system also quite good.\nIf this stays, it will be one of my regular hang out place.",
      "time": 1561307763,
      "translated": false
    },
    {
      "author_name": "dreamer04",
      "author_url": "https://www.google.com/maps/contrib/100434267479418282022/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU8pnDW_55bRNFDPZSMwnOy00M-a_SslWEiziZMiezRGZoJLwIV=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "We booked for Saturday night 7pm to 10pm slot, when we sang until around 8pm, suddenly there is visible loud drilling and renovation noises that obviously louder than our played songs and mic. We pressed the service bell for few times but no one attended to us. Once or twice is acceptable but the drilling continues on and off for 1 HOUR. We paid for 3 hours of karaoke and this is what we get? We spoke to the counter staff and she said they will check for this issue but the situation was not improved. After a while, the owner came and told us the building of theirs are under renovation at this hour (9pm+ already) and they have no choice but to continue the renovation. We are not asking for anything, just a simple solution to maybe postpone the renovation session to after 10pm? But they said they are unable to do anything about it. Was disappointed to get this reply as a customer. If they have scheduled renovation at night at this hour, they could have at least have the courtesy to inform us before we pay at the counter/before we enter the room. Definitely not recommended to visit this outlet. If you do have to visit this outlet, it is advisable to check with them whether will there be any renovations during your session before you pay at the counter, hopefully no one else has to experienced what we experienced. Peace",
      "time": 1654959297,
      "translated": false
    },
    {
      "author_name": "Glenn Noronha",
      "author_url": "https://www.google.com/maps/contrib/104979946357084190270/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI6n3F7SIhO71GVzUSeMvThqg2UxUDFsolXIArvzLha8q2HuA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "Really great place to enjoy karaoke with a group. The packages are awesome. Also loved the massage chairs they have at many places in the building.",
      "time": 1560117073,
      "translated": false
    },
    {
      "author_name": "Vicki Lai",
      "author_url": "https://www.google.com/maps/contrib/112120954146156939973/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKEHQeOrSVQrozA3as4vABh2mR7sOWH_AFEqgwpCa6ASGQnhw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "Their Ktv private room service at level 3 is seriously horrible. Glasses in room is full of dust and dirty. We booked the VIP room for close to 20pax and ordered alcohol around 2k+. But when the bill came,  we realised that they tried to charge us 2 more bottles of Martell ($500+) thinking we are drunk. We only order 4 bottles (2 sets) but they charged us 6 bottles(3 sets). Thankfully some of us is sober enough to realise the mistake. When confronted at the level counter, a male staff(which later they said is their customer but I don’t know why he served us drinks in our room?)  act like gangster when we confront the staffs of the overcharged and publicly insulted my friend asking her just go up drink and settle it as if she’s a hostess. He also pointed us middle fingers and the staffs there tried to send him away after doing this but luckily  police report is made and I managed to ask the police to stopped him from running away.\n(The guy seems to be the friend of the young  lady boss or the staffs)\nToday, we all woke up with bad headache, alcohol seems to be mixed and beer taste so blend and not gassy.\nSeriously just avoid this kind of black shop at all cost.",
      "time": 1680341361,
      "translated": false
    },
    {
      "author_name": "Victor Lee",
      "author_url": "https://www.google.com/maps/contrib/107863136987221735985/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVbRf9CFnCfJdyVfxIJtYoT2zYg1PKu85Dm81_5weXC0LFklZ1fjg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "Didn't order food. Very spacious room but service is slow. Going to toilet is very troublesome as there is only one toilet at Lvl 2 which you either have to climb the stairs down or take a lift",
      "time": 1686133141,
      "translated": false
    }
  ],
  "types": [
    "night_club",
    "bar",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9521837187089697726",
  "user_ratings_total": 58,
  "vicinity": "51 Tanjong Pagar Road, #03-00 / #04-00"
}