{
  "formatted_address": "252 Tembeling Rd, #02-07 Tembeling Centre, Singapore 423731",
  "geometry": {
    "location": {
      "lat": 1.3066882,
      "lng": 103.9051837
    },
    "viewport": {
      "northeast": {
        "lat": 1.307848680291502,
        "lng": 103.9066188802915
      },
      "southwest": {
        "lat": 1.305150719708498,
        "lng": 103.9039209197085
      }
    }
  },
  "name": "Seeds D' Learning House Preschool",
  "place_id": "ChIJqbrGV3IY2jERz-dm9IGnmN0",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Linzi Puvanendram",
      "author_url": "https://www.google.com/maps/contrib/108323025621927088657/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVdYVj717ZEdwtAlscaKUyF3spzBQMUgJotsNYVMGgzzCYckScK=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "My family and I are very thankful to SEEDS, the Teachers and Staff. Since joining them in 2015, my children have benefitted much from their lessons. The Teachers are dedicated and give their best for the children. I love the small number classes, which enhance learning and personal attention to each child. Many a time teachers have given extra time to help in the weak areas. Teacher Carina is very caring and supportive of the children and parents, she never fails to encourage and even give a listening ear to our concerns. Florrie has always been so helpful with all matters pertaining to the classes and teachers. Even our children are happy to attend the classes. When circuit  breaker began, SEEDS was very much involved in ensuring the children get all they need for every zoom lesson they had. They went the extra mile to assure us that the children would miss out at such a crucial time in their studies and even kept in close contact with us. Florrie’s replies to queries are always prompt. Thank you for all you’ve contributed into the lives of my three sons in their learning journey.",
      "time": 1602658767,
      "translated": false
    },
    {
      "author_name": "Goz Gabrielle",
      "author_url": "https://www.google.com/maps/contrib/101448727165264628923/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIx8QCBEho2TBzuGxv_RIH4iu8wSHpdvczn1GJslyfjnd6uOg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "We have been with SEEDS for the past 4-5 years. The teachers & staff have been professional and caring towards my kids. Their grades have improved under their tutelage & the teachers always provide timely feedback.\n\nI was particularly impressed during the Circuit Breaker in 2020, when the centre was able to make quick & sound decisions in establishing online classes (with additional consultancy lessons) for the graduating cohort.\nMy P6 kid could assume some normalcy in preparing for PSLE (scored A* for both subjects).\nIn such times of uncertainty, SEEDS practised flexibility & consideration for both students & parents.\nThis encounter shows the leadership in SEEDS and also sets them apart from other Enrichment centres.\nIn addition, their low staff attrition rate and many years in the education industry speaks volumes of their staff commitment & also in helping students gain confidence in scoring better grades.\n\nI highly recommend SEEDS to any parent.",
      "time": 1642758504,
      "translated": false
    },
    {
      "author_name": "Cai Xiaofang",
      "author_url": "https://www.google.com/maps/contrib/117915626764400075983/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWRub858VxNRry0fl6-b50XsWmUd2_0AM2OsaSoL_GymjVcDxNT=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "My son enjoyed  his maths class in seeds and I can see his progressive improvement with teacher Aloysius.Staff are very nice and helpful.\nAs a result, he achieved A1 for both EM and AM for his Olvl results! Thanks to all Teachers and staffs in Seeds.",
      "time": 1643111189,
      "translated": false
    },
    {
      "author_name": "Jessica",
      "author_url": "https://www.google.com/maps/contrib/103094490603527728372/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLEVpkGKjAT_YwAww-HdPRbmKao22wOtWtisTX8bxwwXV77JA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "So very thankful that we have found this school. We joined only at the start of K2 because our previous school, a church kindergarten nearby was failing in its curriculum & chinese and thank goodness we did. I love the small class size, curriculum is solid as it well prepares kids for p1, teachers are very nurturing and dedicated plus they give personal attention to each & every child (because they cap the class sizes!). Lots of effort is made also for Field trips (as can be seen once covid19 rules were relaxed) and I appreciate the effort behind organising these. Though our daughter was there only for her k2 year, it was enough to catch up on a year wasted in k1. There is also a basement carpark for ease of sending & pick up. I would highly recommend this pre sch to everyone we know.",
      "time": 1673960078,
      "translated": false
    },
    {
      "author_name": "hailey toh",
      "author_url": "https://www.google.com/maps/contrib/108450737114085856853/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWMYI1qmk0ZAljWuuhi4qqqVp2Zg0IrAQAejKUDt1hEPo7tWUc=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "Good school with great teachers! Fun and enjoyable lessons with the enrichment centre too. Very helpful and supporting staffs from the centre.",
      "time": 1575211110,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15967696655435098063",
  "user_ratings_total": 11,
  "vicinity": "252 Tembeling Road, #02-07 Tembeling Centre"
}