{
  "formatted_address": "249 Sembawang Rd, Singapore 758352",
  "geometry": {
    "location": {
      "lat": 1.4172148,
      "lng": 103.8155584
    },
    "viewport": {
      "northeast": {
        "lat": 1.418874830291502,
        "lng": 103.8170237302915
      },
      "southwest": {
        "lat": 1.416176869708498,
        "lng": 103.8143257697085
      }
    }
  },
  "name": "Sembawang Country Club",
  "place_id": "ChIJE2JYEvQT2jERWjxQ8t7lN98",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Zackery Goh",
      "author_url": "https://www.google.com/maps/contrib/109405400403426765330/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUGQsp237p9vNHb-uS9FyMoz0Z-zK6zy1GCgCTEXQuCxwKVbMg-=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "I recently had the pleasure of visiting Sembawang Country Club, and I can confidently say it’s a hidden gem for both golf enthusiasts and food lovers!\n\n**Golf Experience:**\nThe golf course is absolutely stunning! The layout is challenging yet enjoyable, with beautifully maintained greens and fairways. The scenery is breathtaking, surrounded by lush greenery and the calming views of the water. The staff was incredibly friendly and professional, ensuring that our day on the course was smooth and enjoyable. Whether you're a seasoned golfer or a beginner, this course caters to all skill levels.\n\n**Dining Experience:**\nAfter a fantastic round of golf, we decided to dine at the club's restaurant, and it did not disappoint. The menu offered a delightful variety of dishes, from local favorites to international cuisine. We tried the seafood platter, which was fresh and flavorful, and the service was impeccable. The staff was attentive without being intrusive, making our dining experience truly enjoyable. The ambiance of the restaurant was relaxed and welcoming, perfect for unwinding after a game.\n\nOverall, Sembawang Country Club offers a perfect blend of excellent golf and outstanding dining. I wholeheartedly recommend this place to anyone looking to enjoy a day out in a beautiful setting. I can't wait to return!",
      "time": 1742285321,
      "translated": false
    },
    {
      "author_name": "Benjamin Lim",
      "author_url": "https://www.google.com/maps/contrib/110111787888284412226/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWO6Glq4f_laaYjWw1_PeKMQYupy1nk8E_HNHGqRWnRODyT2cne=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Imho the best country club in the north for golfers.\nHeres why:\n\n1) Challenging 18 hole (back 9 currently under reno but front 9 still playable) might be abit patchy due to the incessant inclement weather.\n\n2) The only driving range with TRACKMAN shot tracking and virtual courses\n\n3) Nicely maintained practice green to simulate chips from outside the green, sand bunker and ample putting green practice with multiple pin positions for line reading etc.\n\n4) Excellent showering facilities even for the swimming pool showers. Much better and newly renovated modernised design compared to its neighbors golfers changing room. Golfers changing room is amazing if you get to play here. Idk why but this stood out to me. Its refreshing walking in to take a shower after a game.\n\n5) Very friendly staff especially the SGAcademy instructors. Can just go up to one of them and ask for an impromptu lesson booking.\n\n6) theres also a japanese themed izakaya? bar Right infront of the driving range. Can get your beers/finger food delivered to your bay too if u want.\n\n7) Occasional sight seeing of helicopters moving in and out of the adjacent Sembawang Airbase\n\n8) im pretty sure theres more from the other reviews.\n\nOnly gripe is that u have to watch out for peak periods as bays are limited. There are lessons for the ACS school that take up a majority of the non member bays on the bottom on one of the days iirc thursday. Late noon til evening 530pm. Also group lessons. Lots of individual lessons in the afternoon to evening portion of the day almost everyday.",
      "time": 1744039638,
      "translated": false
    },
    {
      "author_name": "Eric Effin' P",
      "author_url": "https://www.google.com/maps/contrib/101781764873773768564/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU4sCzb0Z4G6HCZHwMz3XxdJAvBI3pH9WUnt1ObHfj_gbVj2OVx=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "2 years ago",
      "text": "Hope I don't get flamed.\nI prefer this course than OCC.\nIt's more picturesque.\nThe people here are also more chilled.\nThe marshals here are also more relaxed.\nThe whole environment here is much better than OCC. It's totally a different vibe.\n\nCourses were quite well maintained.\nIt was raining the night before but it was still good and not plagued with water in the fairways.\n\nWith water and ice facilities at the buggy pick up area, it's quite awesome. You get free ice and free water and can use the cooler box with your own drinks!\n\nI guess all these benefits are due to fact that this is a Serviceman club. This club also accepts civilian members too!\n\nWe ended off with awesome fish head curry and prawn paste chicken for lunch and that were delightful!\n\nThe driving range also looks big and plenty of bays!\n\nWant to come back and will come back!\n\nGreen fees with member on weekday = 151.4sgd (Inc buggy)",
      "time": 1673944490,
      "translated": false
    },
    {
      "author_name": "eric tham",
      "author_url": "https://www.google.com/maps/contrib/113371783407288368096/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJklPk1jHJigjAF9rswoEVqqw3n1tuWOulO2bjCxfbVSN9b-Q=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "6 months ago",
      "text": "good layout, challenging enough. New F&B caterer. Yummy but a bit pricy. Good is not cheap, cheap is not good.... Driving range under major maintenance. Sadly the greens are in the bad, but playable eyesore condition, maintenance blame bad weather. Hope they will gather more experience to tackle the green conditions.\n\nUpdate, no improvements. Now the weather is getting better. Putting greens are bumpy.....\n\nFnB is good  but pricy.\n\nUpdate - Swimming pool close due to upgrading.\nDriving range back to shitty condition\n\nCourse need a make over.....\n\nGolf course should be undergoing major re-renovation and in play with 9 holes till end 2025.\n\nSwimming pool opened.\n\nF&B still the same",
      "time": 1730370126,
      "translated": false
    },
    {
      "author_name": "Ben Lin",
      "author_url": "https://www.google.com/maps/contrib/112207206059430942725/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXzFzIatsbHeBlEiEglMLS7PXlqa6dQYp79Mre0WSs9aKHQ099q5w=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "This golf course is considered in quite difficult level as their fairways are always narrow and uneven, the worse there are lots of the water ponds and bunkers put in the distance of 200-220m. Not easy to conquer it.\nHowever, their food is good and reasonably priced.",
      "time": 1695505391,
      "translated": false
    }
  ],
  "types": [
    "amusement_park",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16084577339887860826",
  "user_ratings_total": 805,
  "vicinity": "249 Sembawang Road"
}