{
  "formatted_address": "110 Sengkang E Wy, Singapore 544886",
  "geometry": {
    "location": {
      "lat": 1.3954449,
      "lng": 103.8934578
    },
    "viewport": {
      "northeast": {
        "lat": 1.39622345,
        "lng": 103.8946577802915
      },
      "southwest": {
        "lat": 1.39310925,
        "lng": 103.8919598197085
      }
    }
  },
  "name": "Sengkang General Hospital",
  "place_id": "ChIJW5hcVtYb2jER81BIRMJ0RjQ",
  "rating": 2.5,
  "reviews": [
    {
      "author_name": "Julie Tan-Hoo",
      "author_url": "https://www.google.com/maps/contrib/100041657715489496945/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJiuUhkVC4LtSqv72tshnMmI8qX8AAN2TsjJv_ocOAuFXtAug=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "My dad was sent to SKH A&E via ambulance and I followed in my car.  By the time I got to A&E, dad was already registered and wheeled into the treatment room.  I was immediately advised where to wait, escorted there, and the staff explained how the information panel shows each patient being triaged - whether they were awaiting treatment, treatment in progress, awaiting admission or pending discharge. Alongside each patient’s initials was an update on whether lab tests, radiology tests etc were being conducted.  Once completed, you see a tick next to the name.  Privacy was preserved as IDs were masked, but loved ones in the waiting area had enough info to follow the process , very much reducing anxiety.  The waiting area was comfortable, near drinks and the toilets and the doctors would come out to speak with waiting loved ones.  Whilst there was a constant stream of patients, my dad and others like him received prompt and efficient treatment and every staff was polite and friendly.  Dad was moved from the ambulance trolley to a bed in the treatment room throughout, and made comfortable.  Doctors were clear and informative and made efforts to ensure we were always kept informed.  Bringing a loved one to A&E is never a good experience, but the A&E team at SKH truly made it a less anxiety ridden and assuring one.   Thank you!",
      "time": 1745143041,
      "translated": false
    },
    {
      "author_name": "Monica Vega",
      "author_url": "https://www.google.com/maps/contrib/105474007388156685334/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVraUaQcCl1iLanEVG5C3Z36YFc_zKOG3xMptS3X8T54ilwiWA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "Hi came to Sengkang Gen Hospital for a medical procedure. My initial admission appointment was efficient and smooth, some wait time, but not too long. The ladies explaining the procedure, and steps are very kind.\n\nThe day of the procedure checking was smooth and efficient. The nurses were kind and I felt well taken care of while getting ready.\n\nThe OR team was great, the lady wheeling me to the room was kind. The a esthetic team was friendly and made me feel comfortable. One thing is, the main anesthesiologist had like sniffles, and had hear mask under her nose 🤦🏽‍♀️.\n\nThey were keeping a close eye on me while in the recovery area. My blood pressure was low, and the female nurse reached to the head nurse, and the exactly what to do. Only downside was that I was released too quickly. I wanted to sleep more, but I had to go. Also, maybe a nice hot Milo at the end would make fasting worth it. 😅\n\nThanks team for treating me so well.",
      "time": 1745330392,
      "translated": false
    },
    {
      "author_name": "Licht Lee",
      "author_url": "https://www.google.com/maps/contrib/118126563054466213203/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX99nQwR3gN7V0CbV-NPw2PS4lYDqH6maqksyEIZhD5MO5Y_HkTrQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "I have had consistently disappointing experiences at Sengkang Hospital, and I feel compelled to share my concerns in the hope of driving improvement. While I am sure there are skilled and compassionate nurses and doctors on the team, my encounters thus far have not reflected this.\n\nI visited the A&E few hours ago, the triage nurse’s approach left much to be desired. I was in visible discomfort, crying in pain, unable to move my left arm, yet the nurse seemed impatient and dismissive. Repeatedly ringing the bell was one issue, but what made it more frustrating was that, despite being able-bodied, she didn’t step out of the triage room to see that I was already walking over. She rang the bell six to seven times, even though there were only three people waiting outside, including myself. Nurse Tuar or Nurse Tuan, you need training. Instead of asking detailed questions to assess my pain or condition, I was told, “If you don’t show me, I wouldn’t know,” despite my clear physical inability to point to the source of pain due to a potential pulled muscle or muscle tear on my left upper back. In an A&E setting, where patient care and attentiveness are critical, such a lack of empathy and patience is deeply troubling. She told me “You are in the hospital now, don’t cry, I understand how you feel.”\nIf you understood how I felt, you wouldn’t told me not to cry when I’m in so much pain. Knowing that I was in so much pain, weeping uncontrollably everytime I make a slight movement, she pressed the affected area hard causing me to flinch. I requested for a place to lie down so that there’s no weight pulling the muscles; but I was rejected twice. Once by the counter staff who probably followed the nurse’s instruction, and second time when I was in the triage room with the nurse. I get that I am going to consult the doctor soon, but the point is I was uncomfortable. Really uncomfortable.\n\nThis isn’t an isolated incident. On a previous visit for severe food poisoning and dehydration, I was repeatedly poked in both arms as the doctor struggled to find a vein. Rather than acknowledging the difficulty or the effects of dehydration on vein accessibility, I was blamed for “refusing” an IV drip, which was untrue and dismissive of my condition. I couldn’t even speak, had to go to the toilet trying not to soil myself while waiting for someone to bring me to the toilet. I was having the runs probably every 3-10 mins for a few hours. I thought I would have died that day and tried my best to request for warm water to keep myself hydrated but was denied too until few hours later. Upon arrival, I vomited one or two bags that the A&E staff gave, each about three-quarters full. I was put in the observation ward, I remember waiting for the doctor for a very long time at least and hour plus or two, at the A&E from night till midnight and was discharged because “I refused to get IV therapy.” Just because I was weak, dehydrated and exhausted, wasn’t able to speak, doesn’t mean what you’re doing is right or have the rights to accuse me of what I did not say or do.\n\nAs someone who has worked in a hospital before and understands the challenges of healthcare, I typically approach these situations with understanding and lots of patience. However, the lack of basic communication, empathy, and professionalism during my visits is unacceptable. The role of A&E staff demands not just medical expertise but also patience and effective interaction with vulnerable patients.\n\nI urge the hospital to review its training and standards, particularly in A&E, to ensure that all staff provide the level of care and professionalism that patients deserve. If staff members find it challenging to work in such a high-pressure environment, they may be better suited to roles that align more closely with their temperament and strengths. Ensuring compassionate and efficient patient care should always remain the hospital’s priority. The next time if it happens again, I will definitely escalate this to Singapore Nursing Board and Singapore Medical Council.",
      "time": 1733862698,
      "translated": false
    },
    {
      "author_name": "Edison Wang",
      "author_url": "https://www.google.com/maps/contrib/103381428862399080910/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXSbErkPn_9VOkjTsd6FKdcI6LphPyr5pJ31P6r5cLw76VMVAHE=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "The worst hospital in Singapore. My daughter was sick and her temperature was 39.6C. The nurse entered 36.6C into the system. As a result, she waited for a longer time and the doctor didn't pay much attention to her. I don't know how such a low-level mistake could be made. When I asked the nurse, she shamelessly said that it was written in the wrong way and it had been corrected. There was not even an apology. What kind of quality is this? Shocking!",
      "time": 1736864463,
      "translated": false
    },
    {
      "author_name": "Ryza Jake",
      "author_url": "https://www.google.com/maps/contrib/112894342097953979837/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUtQhh-NnWhtbbO_z2_2cQiiOL8pfegyEbd5IjnKIo8rFfwwiSQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "in the last week",
      "text": "*WARNING FOR THOSE GOING RADIOLOGY DEPARTMENT*\n\nI accompanied my mother who had a CT scan appointment on 15 May 2025. She arrived on time — her appointment was at 1.20pm for a 1.50pm scan — but ended up waiting for two hours due to what she described as pure negligence at the front desk.\n\nAccording to her, two counter staff were at the nurses’ station and seemed to be chatting with each other. While I can't say for sure whether they were paying attention to the queue, what my mom experienced was that her CT scan form was not passed on to the next team handling the scan. It remained with the counter staff while other patients who arrived later were attended to first.\n\nShe only found out something was wrong after waiting far too long and finally approaching one of them. That staff member then went to check, and the attending doctor — who was very apologetic — rushed out to ask them, visibly frustrated, “Where is her form?”\n\nMy mom has always had good experiences at this hospital in general, until this visit. The doctor was kind and did her best to make up for the delay, but the front desk’s mishandling caused a completely avoidable two-hour wait. This isn’t acceptable, especially for patients who show up on time and follow instructions. These kinds of mistakes should not be happening.",
      "time": 1747304149,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3766826516060066035",
  "user_ratings_total": 1241,
  "vicinity": "110 Sengkang East Way"
}