{
  "formatted_address": "KM36 Mukim tanjung Kupamg Gelang Patah, 81550 Johor Bahru, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.404491,
      "lng": 103.603174
    },
    "viewport": {
      "northeast": {
        "lat": 1.405951930291502,
        "lng": 103.6044395802915
      },
      "southwest": {
        "lat": 1.403253969708498,
        "lng": 103.6017416197085
      }
    }
  },
  "name": "Senibong Golf Club",
  "place_id": "ChIJnYwqR9gL2jERuSXUCu9MbU4",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "Pauline Yoong",
      "author_url": "https://www.google.com/maps/contrib/109959124710224590577/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW7Es4V35sdl3yrK9Uz8nYAm8cH_XdK-kI5UCnLMrvdMxl7m0TK=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "4 months ago",
      "text": "We tried a 18 hole at this golf course on a Saturday morning. As we only have two golfers we have to take a caddy. Ana our caddy is very pleasant and knowledgeable about the course and she is very experienced which makes our game more enjoyable. However she’s the only good part of the game. Firstly the clubhouse is very very run down. There is a foul smell at the very rundown reception and pro shop. The check in counter lady was not very welcoming. The toilet and changing room also have weird smell which makes me sick. When I opened the locker I couldn’t even put my bag in properly as the little shelf in the locker is almost broken. Shoes are not allowed in but the floor doesn’t seem clean either inside. There are peeling paint and moisture stains all over the ceiling and wall. Next the course itself is very hilly, grass was alright it need some maintenance. But the course is not really spectacular there is no feature hole or highlights. Just a very plain course to be honest. Buddy is very old and poorly maintained and we were not even given water. We bought some beers at the cafe and they kindly give us a box of ice saying it’s free ice. However they only accept cash or touch n go payment. No credit card payment so luckily we had some cash. We paid RM700 plus for game for two with a caddy. Won’t come back again unfortunately. Giving it a rating of 3 as the caddy does make a difference.",
      "time": 1735446499,
      "translated": false
    },
    {
      "author_name": "JQ",
      "author_url": "https://www.google.com/maps/contrib/111419954499769463828/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVWWukNISWrbad9REsWYb4lwop_z-JsAFjQgLQ5dHBRRhAjKPgC=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "Senibong Golf Course is easily accessible and challenging in its own way! Hole 1 proved tricky for me, and I unfortunately lost  balls to those big drains every time. Despite that, I enjoyed playing this laid-back course.\n\nThe layout is simple abit hilly  but the greens are rather forgiving, and holes aren't too long making it perfect for a relaxing round . I ended up playing  3 weeks in a row.\n\nBeing just a round the corner from  2nd link, Tuas is a huge plus.\n\nOverall, Senibong is a great choice for those seeking a low-key golfing experience without too much fuss but get so much in value!!!\n\nSome complained about clubhouse run down but I feel it's alright decent. For what it's worth 👍",
      "time": 1747131187,
      "translated": false
    },
    {
      "author_name": "C Nick’s",
      "author_url": "https://www.google.com/maps/contrib/109408252306136037921/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU9gjW7jAXYss2eb7dIguALDcMp6YLH2CQl0u8T2b5R506rHQjF=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "If it’s your first at this club, it’s good to have a caddy. The course is rather hilly, so it’s good to have them advise you accordingly. Otherwise it’s a pretty manageable course for beginners.\n\nJust a downside, they seem to have an issue with drainage as mud kind of common throughout the course. I fat a stroke with my wedge and I ended up “slicing” a nice slab of mud off the ground like butter.\n\nHonestly forest city is way better in terms of playability and challenge. But if you factoring the cost, I wouldn’t mind coming back to Senibong. And Senibong is beginner friendly. That said, season player may not like it.",
      "time": 1742177339,
      "translated": false
    },
    {
      "author_name": "Train SH",
      "author_url": "https://www.google.com/maps/contrib/103239999520026959684/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVHUgFQ1mG-7XhevgfNLP5BuAosHUzJP56kNvSekpjIJiVp05elAg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "11 months ago",
      "text": "Good value for money, It's close to the border and not clowded. The course competition is diverse, so it's fun to manage. It has the disadvantage of poor drainage. So if the ball gets stuck in the rough, it has difficult to find and becomes covered in mud.",
      "time": 1717855507,
      "translated": false
    },
    {
      "author_name": "Kyung-Whu Chung",
      "author_url": "https://www.google.com/maps/contrib/112034920941732701973/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXiTozdD5Cx99Nc6Zg0g_4Yx-U7Nx9WKdU5_UBRVXHc1-xRV5v1=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "4 months ago",
      "text": "Course Layout 3/5\nPlain. Easy. Good that you can drive buggy into the fairway.\n\nCourse Condition 1/5\nTerrible.\nTee box is like a fairway bunker. No grass at all.\nGreen side is like swamp and water hazard.\nCheck out the video (around green. Check out the sound) and photo (tee box). Most holes are like that. Fyi, it was taken around noon on a sunny day.\nNote fairway and rough is all cow grass as well. Not a place for enjoying your iron strikes.\n\nGreen Condition 3.5/5\nQuite fast. Ok condition. Not great.\n\nCaddy 3/5\nCaddy didn’t give much help on course management. Didn’t even properly clean clubs\n\nClubhouse 3/5\nOk for me. A bit rundown.\n\nWill I return?\nif this is the only place I can play, I will consider.",
      "time": 1736054628,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5651257696982410681",
  "user_ratings_total": 247,
  "vicinity": "KM36 Mukim tanjung Kupamg Gelang Patah, Johor Bahru"
}