{
  "formatted_address": "84 Geylang Bahru, #01-2686, Singapore 339692",
  "geometry": {
    "location": {
      "lat": 1.3198978,
      "lng": 103.8736672
    },
    "viewport": {
      "northeast": {
        "lat": 1.321318680291502,
        "lng": 103.8749814802915
      },
      "southwest": {
        "lat": 1.318620719708498,
        "lng": 103.8722835197085
      }
    }
  },
  "name": "Serenity Casket & Funerals",
  "place_id": "ChIJvRZhDBoY2jERdsIkXqiKP7w",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Jacqueline Tang",
      "author_url": "https://www.google.com/maps/contrib/114470128962233176822/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL_xPxz0tsdf_4RNkD35uN-UR_MHUsyT648mYVEp8rWFNWxqQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "The team is very responsive, helped and guided us a great deal even before the funeral. They have been there every step of the way guiding and instructing us what to do and expect.\nThe package covers all needs from the beginning to the last send off. Every little needs and requirements are looked into.\nThe team is even ready to hand out tissue to family members. Such a simple act but it shows that they are extremely sensitive to the family needs and atmosphere.\nSet up for the wake is elegant and professional. We were informed of the timing of every step from the set up and tear down.\nOur family appreciates and thank you from the bottom of our hearts for the superb professional service!!\nLastly thank you too for upgrading the hearse to the Maserati. It gives great dignity to the deceased.\nSpecial shout out to Eugene the funeral director assigned. We appreciate your service.\nThank you, Elson for the complimentary coffee machine. ☺️",
      "time": 1744879208,
      "translated": false
    },
    {
      "author_name": "Serene Sein",
      "author_url": "https://www.google.com/maps/contrib/112471029155541984009/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUcdP9kqxz4SiNrgLO_XnnfSSX31FR_c8vGxG-cWf7yWxRlAOY=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "On behalf of my family and myself, I would like to express my heartfelt gratitude to Nichole and team. Your help, advice, comforting words and support during this difficult time have meant so much to our family. Especially Nichole, you made my mother so pretty, gorgeous and rest there in peace.\n\nThank you for your team standing with us in our grief, and for honoring my mother’s life with full support of your team. From her day of departure, following up of each day until collecting of her ashes, we can sense your team sincerity and gratitude. Thank you so much. May God bless you and all abundantly for your kindness and compassion to us.\n\nWith deepest thanks,\nSerene Sein & Family",
      "time": 1746839355,
      "translated": false
    },
    {
      "author_name": "Genesha Jessie",
      "author_url": "https://www.google.com/maps/contrib/108515063912139960475/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXMeU3atHB_JU0gw13VRkMjmkGY_BnBKr_SFY5TQn5PIQqa2vqV=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Dear Serenity Team\nThank you for making the funeral / wake service very beautiful. Especially with the upgrade to Maserati,\na dignified and honoured last ride for my father.\nSerenity did such a wonderful and exceptional job ❤️\nThank you for all of the directions and support given to my family and myself when organizing all the funeral arrangements.\nIt took a lot of pressure from us during this difficult period,\nFrom the time I started pre planning with Elson and team\ncommunication was very smooth and effective,\nJacky was assigned to oversee the whole process, he handled professionally and always ready to answer all our questions, he showed a lot of respect, empathy and gave emotional support to our grieving family. He kept checking on us if we were okay\nthose made our day better.\nWe were truly touched by the service that was rendered to us and I would strongly say that I have chosen the right and best Casket company for my dad we will definitely recommend your service to others\nOnce again\nFrom the bottom of our hearts we are very thankful and grateful to Serenity for making this Memorable last journey of our late dad. 🙏🙏🙏🙏\nGod bless Serenity team ❤️❤️❤️❤️",
      "time": 1746164277,
      "translated": false
    },
    {
      "author_name": "Richard Tan",
      "author_url": "https://www.google.com/maps/contrib/116792768505777895283/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWlpkH7p5qPZXmlrBMp1LrazXjNEAAYI15kv3sTdQGkcXWGGZs=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "The level of service by Serenity Funeral Service is superb. From the time of activation until the time that the funeral service is over, the physical and spiritual support was endless. Their punctuality and guidance throughout was truly commendable, as this was my first time organising a funeral for a loved one. We have been greatly blessed by their services. We only needed to call them and inform them our need when my brother passed away. They were able to effectively advise and recommended suitable funeral package according to our financial ability. All the necessary bookings for the funeral wake to the cremation and ash management were fully organised from start to finish. Their logistical partner also gave their full support and set up the wake location within 2 hours, and the wake went full steam thereafter. My family and I were deeply grateful for their seamless support, making our difficult time more bearable.",
      "time": 1744877170,
      "translated": false
    },
    {
      "author_name": "Janelle Loh",
      "author_url": "https://www.google.com/maps/contrib/108471737280144791297/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIJ1SaYL80DMV5ikahLVcynGJazSL0KHIu35M9-gPrJMNi72g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We would like to express our gratitude to Serenity and the team who assisted us throughout the bereavement. They are very prompt to respond and give their best support to guide my family through the whole process - from embalming to setting up and cremation - it went very smoothly.\nThe tentages are beautifully set up, giving a sense of peace for family and friends.\n\nWe are very grateful for Jessy and team for supporting and rendering help to us wherever needed through these difficult times. Their services, attitudes have truly exceeded our expectations. Thank you!",
      "time": 1742941275,
      "translated": false
    }
  ],
  "types": [
    "funeral_home",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13564713058401829494",
  "user_ratings_total": 563,
  "vicinity": "84 Geylang Bahru, #01-2686"
}