{
  "formatted_address": "50 Jurong Gateway Rd, #03-11/12 Jem, Singapore 608549",
  "geometry": {
    "location": {
      "lat": 1.333659,
      "lng": 103.7435088
    },
    "viewport": {
      "northeast": {
        "lat": 1.334377980291502,
        "lng": 103.7446886802915
      },
      "southwest": {
        "lat": 1.331680019708498,
        "lng": 103.7419907197085
      }
    }
  },
  "name": "Shaburi & Kintan Buffet",
  "place_id": "ChIJV3Hp4A4Q2jERm6lv0qhl-BY",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Irene Lim",
      "author_url": "https://www.google.com/maps/contrib/105804445185126817371/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXD8DJY2xjJiMEhi1uXEJV0CKGTTCzFF4IUrDs7PZrUcLaukCyh=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 3,
      "relative_time_description": "4 weeks ago",
      "text": "We tried the Shaburi option and upgraded to the premium beef — not surprisingly , the “tasty beef” didn’t quite live up to its name. Texture and flavour were lacking. The condiments were okay, nothing particularly memorable. The buffet spread was average, maybe slightly below expectations in terms of variety and quality.\n\nOn the upside, ordering is done via QR code and food is served quickly. Service was fast, efficient, and clear — staff were attentive and prompt throughout. For the price we paid, it’s still a reasonable option, especially if you’re after a no-fuss, quick hotpot experience.",
      "time": 1745231857,
      "translated": false
    },
    {
      "author_name": "Stephen Lim",
      "author_url": "https://www.google.com/maps/contrib/117005225316397904652/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL6rx7sV7INee9M_ypDoKNXJNA5rHNI6PbqkzSNhuDCYF3D1w=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "We had the pleasure of dining at this restaurant for their exceptional dinner buffet, featuring unlimited oysters and snow crab legs, as well as shabu shabu. The service team demonstrated remarkable kindness and attentiveness. The cuisine was outstanding, and the staff\nefficiently cleared empty plates.\nThe gentleman is really commendable. Keep refilling the fresh oysters and the snow crab legs. Well respected. Congratulations on delivering outstanding service; your dedication to excellence is truly commendable.",
      "time": 1740151924,
      "translated": false
    },
    {
      "author_name": "Napat Lipimongkol",
      "author_url": "https://www.google.com/maps/contrib/108685617155246810836/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVO4fH81FF4kXAJpuY5-zVWOWi7iieWBOFdHhkrlY3bt4cSv0c=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Limited oyster & snow crab promotion ends tomorrow. Today I come at lunch which costs only $35.80++ for 90 minutes hotpot buffet, plus free-flow fresh oyster & crab.\n\nI had above 50 oyster, crab, shabu beef+pork+chicken, curry, mac n cheese, gyudon, chawanmushi, karaage, desert, milk tea and white chocolate fountain. For me, that was a solid $0.72++ per oyster only. The best deal in town I've known for this fresh juicy oyster! I forgot to take photo for other dishes, as very busy with those oyster. Overall it's only less than $43 nett per pax~~ Thank you for making my weekend day🥰 The staffs are kind and helpful. They also refilled soup and oyster regularly.",
      "time": 1740218881,
      "translated": false
    },
    {
      "author_name": "Kelly Han",
      "author_url": "https://www.google.com/maps/contrib/107838768385022758033/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXAQDfKfXPuxR9HunRKELPtrvHIoAUvh-YolcpA8S13hclpMK5J=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Spent my wedding anniversary eating Hotspot! Was a nice experience dining with my husband! The staff are friendly and approachable. Food and drinks are fresh. Service is fast too! Thank you store manager of the day for serving us and answer our enquiry! 😃",
      "time": 1739862049,
      "translated": false
    },
    {
      "author_name": "Pete Klimek",
      "author_url": "https://www.google.com/maps/contrib/115651891130079828399/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVlEceNMi14URTNABTzBbxqdmOw1e2u-Dh0zTq4o6t-8_SLCXCT0g=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "If you're searching for the perfect hotpot and Japanese grill experience in the West, look no further than Shaburi & Kintan Buffet at Jem, Jurong East—a culinary oasis that delivers on every front.\n\nFrom the moment you step in, the ambience sets the tone: clean, modern, and surprisingly spacious. The tables are thoughtfully arranged to offer both comfort and privacy, a rare luxury in most buffet settings. Whether you're dining solo, on a date, or with the entire family, there's a seat for everyone—without that cramped, elbow-to-elbow feeling.\n\nNow, let’s talk choices—because this buffet delivers. The variety is sublime. From premium cuts of meat for the grill (yes, the Kintan side is a meat-lover’s paradise), to fresh seafood, vibrant vegetables, and a hotpot bar that caters to every broth preference and dietary whim, it's impossible to walk away hungry—or disappointed. Whether you’re keto, pescatarian, or someone who just wants to pile everything onto one plate (we see you), Shaburi & Kintan has something for you.\n\nService? Impeccable. The staff are attentive, friendly, and efficient, keeping the experience smooth and stress-free—even during peak hours. Empty plates vanish like magic, and drinks are refilled before you have to ask. Speaking of drinks, the free-flow non-alcoholic beverages—including tea, coffee, and soft drinks—are a refreshing touch that adds serious value to the meal.\n\nAnd just when you think it’s all over, along comes the dessert: light, sweet, and satisfying. Not an afterthought, but a perfectly included finale to a feast.\n\nWhat truly warms the heart, though, is their special senior pricing—a thoughtful gesture that makes dining here even more inclusive and appreciated. Anyone over 60 gets a discounted rate, making it an ideal spot for a multi-generational family gathering.\n\nIn short, Shaburi & Kintan Buffet at Jem is a gem. Quality, variety, service, and space all wrapped into one very well-priced package. It’s not just a meal—it’s an experience.\n\nPerfect. Just perfect.",
      "time": 1746088683,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1655184638818101659",
  "user_ratings_total": 1117,
  "vicinity": "50 Jurong Gateway Road, #03-11/12 Jem"
}