{
  "formatted_address": "271 Bukit Timah Rd, #B1-02, Singapore 259708",
  "geometry": {
    "location": {
      "lat": 1.3165013,
      "lng": 103.8353836
    },
    "viewport": {
      "northeast": {
        "lat": 1.317952680291502,
        "lng": 103.8368446802915
      },
      "southwest": {
        "lat": 1.315254719708498,
        "lng": 103.8341467197085
      }
    }
  },
  "name": "Shanghai Pu Dong Kitchen",
  "place_id": "ChIJgV6cme8Z2jERDZYpDihvbhY",
  "rating": 3.5,
  "reviews": [
    {
      "author_name": "Jiang Yahui",
      "author_url": "https://www.google.com/maps/contrib/110245649436949948591/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKgbWRAkdeUxeDjkDWMkCOybDcZE9QK6pDAcxA5PqUYyI0W5jE=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Service not that great but so what. I love the food!!  It is fantastic. I occasionally meet the Shanghai lady boss while running out of the kitchen as the takeaways and dine in orders are continuous. Due to lack of staff, they are only opened from Friday evenings to Sundays. Spring Onion noodles is a MUST!",
      "time": 1738396505,
      "translated": false
    },
    {
      "author_name": "mark teo",
      "author_url": "https://www.google.com/maps/contrib/107332224518533055449/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLnb02HtNknP1PufQHhozXTwt5pguq96cLappmbaloIl0MbNg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "After reading these terrible reviews, I just had to experience it. Not that bad actually. Visited on Sunday for lunch, greeted by the owners, immediately sat us down, ordered food and wait while have  drinks. Food was served at an acceptable time, even the restaurant are two third filled with dinners. Food was great.  Limited round tables unless you have large groups. If you have 2 hours to dine, I think this is not a bad place to eat. Oh...cash only. No cards, no digital payment, no paynow/payday.",
      "time": 1691632256,
      "translated": false
    },
    {
      "author_name": "Sylvia Chua",
      "author_url": "https://www.google.com/maps/contrib/106151745675612494812/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJxqxyYBx7pyyOSxMSXAw2gM4xjcW-CCXtoX8WMBD5j43yMhA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Came here after almost 20 years. Food could not compare to before but still good. Service is good though they were really short of staff. Dishes very served VERY slowly. We ordered onion cake, scallion noodles and pig trotter. All are delicious. Spring onion cake is rather tough and could have more spring onions. Scallion noodles could have more spring scallion and less dark sauce. Pig trotter is still awesome though could be less sweet. Generally still a delightful meal.",
      "time": 1740895781,
      "translated": false
    },
    {
      "author_name": "Nick Hui",
      "author_url": "https://www.google.com/maps/contrib/115967581825930490243/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVwfJG-ewSAwZzUllBbGiox3-ynOKjUBU0JCv7ZjBm7GlZHM_QN=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "TL;DR: Superb food, understaffed, if you can’t enjoy strong tasting food (garlic, spicy, sweet, etc.) then give this a miss.\n\nThis is a hidden little gem in Balmoral Plaza. Legend has it the availability of the menu is solely dependent on the mood of the lady boss. I’ve come here more than 5 times and I can’t figure out what’s available or not. Sometimes not sure why they have a menu at all.\n\nWhat they are known for: 小笼包, 生煎, 红烧肉. What they do well: literally everything on their menu that is cooked in a wok.\n\nPlus, they are consistent with their cooking standards which is quite hard to find nowadays. Their 红烧肉 is probably the best you can find in Singapore, and I highly recommend you pair that with a (or a few) bowl of rice.\n\nTheir vegetables, wok fried with tons of garlic is always good, be it 干煸四季豆 or 鱼香茄子, every dish on the table is always a perfect balance of fragrant and spicy. Even their番茄炒蛋 would top 95% of your 菜饭 stalls.\n\nJust beware of bringing friends, relatives or anyone who’s “on a diet”, “doesn’t like too sweet things”, “too oily”. You get the point.",
      "time": 1641123905,
      "translated": false
    },
    {
      "author_name": "Happy Fatty",
      "author_url": "https://www.google.com/maps/contrib/109258886875391584548/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJrb8GKjBvqywv4mjfhqrq-W-emNtZ-n0VnfjgiTirvFAg6BQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "A friend recommended this restaurant to us. We went. The outside of the restaurant looked suspicious and not so promising. But actually it turned out quite good. We ordered most of their famous dishes. I would say they were very authentic homemade Shanghainese’s food. The Shen Jian Bao (pan fried bun) were sold out. It could be their most popular dish. We ordered the Guo Tie (pan fried dumpling) instead. It was so good. The scallion oil noodle was very good too. The scallion oil pan cake was also very good. I forgot to take a photo to show you guys. But it tasted so good. The service staff can only speak mandarin. They are friendly and helpful when they can understand you. Not every dish you want is available. I just feel that it really depends on the timing you walk in and what the chef has on hand. LOL. The restaurant only accepts PayNow and cash. We spend about $30 per person. I will go there again if I visit that area in future.",
      "time": 1647091909,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1616351534099568141",
  "user_ratings_total": 146,
  "vicinity": "271 Bukit Timah Road, #B1-02"
}