{
  "formatted_address": "Winsland House 1, #09-08, 3 Killiney Road, Singapore, Singapore 239519",
  "geometry": {
    "location": {
      "lat": 1.2996608,
      "lng": 103.8402777
    },
    "viewport": {
      "northeast": {
        "lat": 1.301086480291502,
        "lng": 103.8415224302915
      },
      "southwest": {
        "lat": 1.298388519708498,
        "lng": 103.8388244697085
      }
    }
  },
  "name": "Shens Clinic",
  "place_id": "ChIJ-XK-NucZ2jERcsR7uJuLUe4",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Tong Poh Yeo",
      "author_url": "https://www.google.com/maps/contrib/100701557930859480578/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUIzcIBjzsbZiwnl30vEWPTHuKlpqz4E6osJVoVH0WGJxU3rCfd=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I recently had my eyebag removed at Shens Clinic and I am very happy with the entire experience. The staff and the assistance were friendly and Dr Shens did explain clearly the steps prior to the ops. The procedure itself also not too painful and went on quite fast and smooth. The recovery went on smoothly. Yesterday I visited Dr Shens for the One-month review. I am very satisfied with the result. The costing is also reasonable. I highly recommend them to anyone considering this type of procedure",
      "time": 1742448285,
      "translated": false
    },
    {
      "author_name": "Huang Liyin",
      "author_url": "https://www.google.com/maps/contrib/111615945237836510747/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLBqplzjy8Bp14gSlN39SvPkQQ9MBPQAgkCBzMj6nKbg99Fry4=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "9 months ago",
      "text": "Did my double eyelid surgery (stitching) with Dr Shen in 2022. Over a few occasions in 2023, I brought up my concerns of the outer crease (seems thicker and odd shadow at the end, as though there’s a v-fold) and also the excess skin below lash line. To which the staff said underneath is residual swelling and  asked me to monitor as sometimes it could be water retention.\n\nJust went for a review and was utterly disappointed. There were 3 staff at reception, talking loudly and having their personal conversations. Appointment at 4pm but only saw Dr at 4.30pm.\n\nMentioned to Dr Shen on my concerns but before I could finish each sentence, he kept interrupting me. He focused on the photos taken via the computer screen, and did not bother coming closer to take a look at my eyes in person. He brushed it off my concerns and said there’s nothing wrong with my eyelids. And that my creases are still deep and will last for a long period of time.\n\nHe said the “excess skin underneath lash line” is my eyelid muscle after stitching up the crease. And he said the crease is supposed to be thin from inner and a bit thicker as it goes to outer corner.\n- But you can clearly see my right eye crease is uneven! Photos don’t lie.\n\nI walked out of the consultation room with no solution or course of action.\n\nThis is to anyone looking to do their double eyelid surgery here. Can read the 1-star reviews on this page, and I’m not the only one unsatisfied with my results…\n\nEdit: back in 2022 during consultation, nope Doc didn’t suggest for an incisional surgery nor did he show any AI of the difference. So please do not push the blame / dissatisfaction to the consumers’ fault.\n\nNow my only wish is that this won’t worsen over time… I will not make a return trip to this clinic, and here’s a heads up to anyone looking to visit here 🙏🏼",
      "time": 1723630858,
      "translated": false
    },
    {
      "author_name": "Fel",
      "author_url": "https://www.google.com/maps/contrib/114124447631650621869/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWRWo6wajU9T3a3Fwl95gEBFFHZbK7XBRmdPQUDZ0rFueTAKFSL=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "Finally decided to post a review for Shens Clinic after 3 years. For anybody who is considering a rhinoplasty from Dr. Shen, please read till the end.\n\nI had an incredibly disappointing experience with Dr. Shen. I underwent a rhinoplasty which consist of nose implant (which were slanted after 1 year) and alarplasty with him between February and March 2022, which cost a staggering $12,000. To my dismay, there was practically not much difference in how my nose looked after the surgery. After waiting weeks for the swelling to go down, I was shocked to see that my nose looked almost identical to how it did before. Even worse.\n\nWhen I raised my concerns during the follow-up, Dr. Shen dismissed them and made me feel like I was overreacting. For the exorbitant amount I paid, I expected professionalism, skill, and real results—not excuses. Now, thinking back, I feel like I was being gaslighted by him, as he kept complimenting his own work and trying to convince me it looked great when it clearly didn’t. To add on, even if I reached on the dot, I have to wait for more than 30-40 minutes for every of my appointments. It seemed like the clinic doesn't have any time management.\n\nIn February 2024, I had to undergo a revision rhinoplasty in Bangkok. Even the surgeons there were shocked when I told them I had previously had my nose done—they said it looked like nothing had been done at all! That was incredibly frustrating to hear and confirmed my suspicions about the lack of quality in Dr. Shen's work.\n\nPlease take the time to read the reviews for Dr. Shen’s clinic carefully. I wish I had paid more attention to them before choosing him. Look at the attached photos—would anybody pay $12,000 for this?\n\nI feel like I completely wasted my time and money on his services, and I would strongly recommend looking elsewhere (not in SG) if you’re considering any type of nose jobs. Don’t make the same mistake I did.",
      "time": 1736258665,
      "translated": false
    },
    {
      "author_name": "Emma",
      "author_url": "https://www.google.com/maps/contrib/113884972967415837072/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLd_gOwtqHyfztkQ3eyDfr5kI6ssOVe5FjKt88J8OmYxFhJtw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Many friends and family kept on telling me how tired I looked all the time. It was true that after kids and now in my mid 50s, that my face had a \"sinker\" appearance - loss of facial fat. In addition, eyebags were starting to show, especially under one eye. I decided to do some research and even went for a few consults with several clinics. Finally last October, I decided on Dr Shens as he gave me the best treatment plan and reasonable pricing for two procedures - fat transfer and eyebag removal. He was patient, assuring, discussed in detail my expectations and took the time to allay my fears. He showed me some before and after pictures of what to expect, also highlighting that many of his fat transfer patients worry constantly thinking that maybe the result is wrong and then after awhile lo and behold, they can't stop smiling at the results. Tearing for a period of time up to a week is also possible for some patients. I took heed and went ahead. The pictures speak for themselves and the undereye bags and circles are now completely removed, no wrinkles, nasolabial folds far reduced and cheeks lifted! I had no pain post-surgery, and since I did a while face fat transfer (cheeks and forehead), I was swollen for a week which gradually subsided and I went for a winter vacation in December just 2 weeks post surgery. Thanks to Dr Shen and his nurses (Ivy and Emily) and the warm welcome and attentiveness of his front desk, I now look refreshed and turned back the clock.",
      "time": 1739610566,
      "translated": false
    },
    {
      "author_name": "Mun Mun",
      "author_url": "https://www.google.com/maps/contrib/108029008593076065279/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUgh1I_0QkMFwgxO9tDDcL1FnpQxEB4Dn2yM2x4T9lDe4o-z96c=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "I recently had a breast augmentation procedure at Shens Clinic, and I couldn’t be more pleased with the entire experience! From the moment I walked in, the staff made me feel comfortable and well-informed about the process. Dr. Shens took the time to address all of my concerns and helped me choose the right size and shape for my body. The procedure itself went smoothly, and the recovery process has been much easier than I expected. I’m beyond happy with my results – they look natural, and I feel more confident than ever. The care, professionalism, and attention to detail at Shens Clinic were exceptional. I highly recommend them to anyone considering this type of procedure!",
      "time": 1728798626,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17172660355071722610",
  "user_ratings_total": 114,
  "vicinity": "Winsland House 1, #09-08, 3 Killiney Road, Singapore"
}