{
  "formatted_address": "25 Airline Rd, Singapore 819829",
  "geometry": {
    "location": {
      "lat": 1.3772009,
      "lng": 103.997269
    },
    "viewport": {
      "northeast": {
        "lat": 1.378718530291502,
        "lng": 103.9982501802915
      },
      "southwest": {
        "lat": 1.376020569708498,
        "lng": 103.9955522197085
      }
    }
  },
  "name": "Singapore Airlines",
  "place_id": "ChIJXXpHJng82jERWYpAixBramQ",
  "rating": 3.5,
  "reviews": [
    {
      "author_name": "JM V",
      "author_url": "https://www.google.com/maps/contrib/113607140413131397124/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWTm2i3vn1X6-OeMW4aIiWixpV0GyiBnt_dvRucdDI_pT877mce=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "We usually book Singapore Airlines when flying between Singapore and Manila. It’s always a great experience. The crew is friendly and attentive, and the food is consistently delicious.\n\nI especially enjoy the in-flight entertainment there’s a great selection of movies to watch, which keeps the flight enjoyable when I choose not to sleep.\n\nOverall, flying with Singapore Airlines is always comfortable, relaxing, and worth it.",
      "time": 1739969679,
      "translated": false
    },
    {
      "author_name": "Gabriel",
      "author_url": "https://www.google.com/maps/contrib/117387838809977391267/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUxUIqhWMBQgZmnuePRJ3GpjXGkjKP_5RI86sAWszpf99Tmp__P=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Have flew SIA on economy, premium economy and business multiple times, and the service standard provided is consistent, unlike other airlines which explains why it is world class.",
      "time": 1744497044,
      "translated": false
    },
    {
      "author_name": "Megan Pereira",
      "author_url": "https://www.google.com/maps/contrib/102400863098310364632/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX9hr4w6I9SXeaDRxvuU_BZDenTfrkEKBXKm513kXf6ElrL29Hn=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Flew Singapore Airlines for the first time to San Francisco & back. Found both Economy & Premium Economy to be comfortable with the menu being quite delicious. Definitely flying with them again, xiè xiè!",
      "time": 1742874304,
      "translated": false
    },
    {
      "author_name": "Yan Qi",
      "author_url": "https://www.google.com/maps/contrib/115869370988585670722/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWurwudSiGSQQJ0OrqnTvKxSsBrBm8qrNg-bi5-kRXJQLSICw8=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Singapore Airlines Business Class: Taipei to Singapore Review\n\nMy exceptional journey with Singapore Airlines began with an early check-in at Taipei Airport, where friendly staff swiftly handled baggage and immigration procedures. We were warmly greeted at the counter and promptly checked in.\n\nNext, we headed to the Silver Kris Lounge, which impressed with its expansive size and stunning airport runway views. The lounge offered an array of hot meals, cold starters, salads, sandwiches, fruits, and beverages, including a selection of wines. I was particularly drawn to the delicious Bah Kut Teh, a traditional Singaporean pork rib soup, with its rich, flavorful broth and tender chicken. Unfortunately, Laksa was not available in the Taipei lounge.\n\nAs a Star Alliance member, Singapore Airlines allowed us to visit the Eva Air Lounge, which was equally impressive. The lounge boasted two sections and shower facilities, which I utilized before my flight.\n\nWith priority boarding, we settled into our seats, C18, F18, and K18 (my window seat). The cabin was spacious, with modern amenities and comfortable seating for individual passengers.\n\nThe in-flight entertainment was excellent, featuring an extensive library of movies, TV shows, and music, ensuring a engaging experience throughout the 4-hour flight.\n\nThe meal service was exceptional, with a carefully crafted international menu. I pre-ordered the Braised Beef with Thyme Jus, which consisted of:\n\n- Antipasto Marinated prawn with mozzarella cheese and balsamic dressing (appetizer)\n- Braised Beef with Thyme Jus, roasted seasonal vegetables, and green beans (main course)\n- Haagen Dazs Caramel Chocolate Brownie Ice Cream, Brie, Edam, and Cambozola Cheese, with dried apricot, dried date, and crackers (dessert)\n- Assorted bread rolls and gourmet breads with butter or flavored olive oil\n- Coffee or tea\n\nOur 1 hour 45-minute meal service was attentive and efficient.\n\nAfter dinner, we reclined our seats into full-flat beds and enjoyed a restful sleep. Twenty minutes before landing, we were gently awakened to prepare for arrival at Changi Airport.\n\nOverall, Singapore Airlines Business Class delivered an outstanding experience, combining efficient check-in, excellent lounge facilities, impressive in-flight amenities, and fine dining.\n\nMoney well spent, I highly recommend Singapore Airlines Business Class for its exceptional service and amenities. Rating: 5/5.\n\nYou can also earn KrisFlyer miles.",
      "time": 1731232657,
      "translated": false
    },
    {
      "author_name": "Francis Oh",
      "author_url": "https://www.google.com/maps/contrib/109797442713807425214/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUgouMfNJ-CX_86xGoZo4kgdPoccKUPa-iBE4PrIXXslgRpkrle7g=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "5 months ago",
      "text": "Always our favourite national airline. Our trip to Korea, Seoul, the food from Korea to Singapore is good. The staff service can be improved.",
      "time": 1734175853,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7235713470124034649",
  "user_ratings_total": 227,
  "vicinity": "25 Airline Road"
}