{
  "formatted_address": "990 Old Choa Chu Kang Rd, Singapore 699814",
  "geometry": {
    "location": {
      "lat": 1.3726356,
      "lng": 103.6841167
    },
    "viewport": {
      "northeast": {
        "lat": 1.374026980291502,
        "lng": 103.6853632302915
      },
      "southwest": {
        "lat": 1.371329019708498,
        "lng": 103.6826652697085
      }
    }
  },
  "name": "Singapore Shooting Association",
  "place_id": "ChIJZdXLHwAP2jERJ7010SSdidw",
  "rating": 1,
  "reviews": [
    {
      "author_name": "Doreen Tang",
      "author_url": "https://www.google.com/maps/contrib/112941377020936927642/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK7qSCxyg-X-qUmASCxFhRbWwYMWkIddr_F6UFZ6YDOTfdpqA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "On 24 April, less than 15 minutes after the registration link was posted, I submitted the registration for my son. Despite the prompt response, his name was not included in the final participant list. Strangely, other participants who registered only on 3 May—were accepted. This raises the fundamental question: why was the selection not based on a transparent first-come, first-served policy?\n\nAdditionally, the communication surrounding the event was disorganized. Multiple emails were sent by Edmund, leading to confusion among parents. A separate email requesting payment added to the frustration. Some parents proceeded to make payment only to later discover that their children were not allowed to participate, which is entirely unacceptable. In Edmund’s email response, it was the responsibility pushed to all parents.\n\nThis experience has been disheartening for children like Hansel, who have shown consistent effort and enthusiasm for shooting, particularly with the hopes of building a strong DSA portfolio. Being excluded due to unclear and poorly managed administrative processes has severely affected his morale and undermines the values of merit and fairness that this competition should stand for. Moreover, this is the last competition result for his DSA.\n\nI am demanding an explanation on your registration process and strongly urge the committee to review the selection process and communication workflow for future events to ensure transparency, consistency, and respect for the time and effort of all aspiring participants.",
      "time": 1746788583,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15891405541607849255",
  "user_ratings_total": 1,
  "vicinity": "990 Old Choa Chu Kang Road, Singapore"
}