{
  "formatted_address": "Towner Road #01-204/206 Block 101, Singapore 322101",
  "geometry": {
    "location": {
      "lat": 1.318997,
      "lng": 103.860763
    },
    "viewport": {
      "northeast": {
        "lat": 1.320485180291502,
        "lng": 103.8622593802915
      },
      "southwest": {
        "lat": 1.317787219708498,
        "lng": 103.8595614197085
      }
    }
  },
  "name": "SingPost Post Office — Towner Branch",
  "place_id": "ChIJz1dGvdEZ2jERQzR--9YLsPI",
  "rating": 3.4,
  "reviews": [
    {
      "author_name": "Huang Jia",
      "author_url": "https://www.google.com/maps/contrib/101868052281050025773/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUouRm_jcTkER_r1PzzEFG_vePWGG2y6MvOar1RnezEdee-Bvqg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "SingPost called and mentioned the goods will be arranged to delivered on a certain date. But failed to do so.\n\nWhen called the customer service at multiple times, received different responses.\nMorning call was told not to worry goods is arranged for delivery.\nAfternoon called and asked again, being told the address is wrong. Which is wrong because the new address has been updated 4 days ago over the phone with SingPost.\n\nEvening before 6 called and check with them again, they mentioned they need to check with relevant team why is the goods not being delivered and seeking my understanding.\nAnd I requested to give a follow up call before 6, before they end operation, and guess what no call again.\n\nParcel was late, and arranged for another round of delivery, this is the experience with the SingPost.\n\nThey can’t do anything but just ask us to wait, because they can’t do anything.\n\nI hope this is not what it supposed to be.\n\nThis is definitely a bad and bad service provided by the SingPost.\nFinding excuses. If you missed the plan, means you missed it.\nAs a customer, I don’t accept. + it is not the first time.\n\nOn the next day I received my item. But it’s already after so much drama.\nThank you SingPost for doing such a Great job.",
      "time": 1740732249,
      "translated": false
    },
    {
      "author_name": "kar kaye lee",
      "author_url": "https://www.google.com/maps/contrib/107888953253294631135/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV4OWeFrftZhoepLG9hcNQODmnZMMO6sW11HQw7DVWaIiijy-Eg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Queued there at 4am for Twice tickets and the lady (Ms Veerehma) was super nice! She managed to get my tickets with the help of her colleague (a male i dont remember the name of so sorry!) But it was a great experience :) everyone there was so kind and helpful and very friendly!! Highly recommended 👍👍",
      "time": 1686566576,
      "translated": false
    },
    {
      "author_name": "Philippians 4:13",
      "author_url": "https://www.google.com/maps/contrib/111290340777263625321/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUl2SGeYMBKrjdxKWC36AJ-Wo0uMGJ4KZEc5-7vaOA3LqnoCtBUEg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "10 months ago",
      "text": "Turtle slow . Only 1 staff on duty . Even tho female staff (Filipino I assume ) is friendly , helpful and nice but just one customer got stuck and entire que awaits",
      "time": 1719294216,
      "translated": false
    },
    {
      "author_name": "J C",
      "author_url": "https://www.google.com/maps/contrib/103746222501117375336/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJwk-uVQ5eE0AcuhcAjsNNP5loyQZ_9_1PyJu0z99J49vwObA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Went to this branch to send parcel to my son in UK.\nDidn't really understand there are many controlled measures, but the staffs in the branch is so helpful and friendly to brief me on every aspect. To ensure my parcel could arrive safely.\n\nKudos to Mdm. Veerehma, she was really professional and always thinking of customer interests. Despite went through the hassle to help me to understand the self-help apps and pre-registration processe, so that i could save time and trouble should i send another parcel in the future. She was really thoughtful and not just trying to serve customer according to the SOP.\n\nGreat job!",
      "time": 1672302581,
      "translated": false
    },
    {
      "author_name": "Mel Choo",
      "author_url": "https://www.google.com/maps/contrib/116716324134104804133/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL9H_E9K2ewrl4F__HmLp4V276p_HjzLxjGujpNmIek0enP6A=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Was here to collect the HPB fitness tracker. Tended to by a stern lady with curt replies and not a smile on her face. Thought since my husband was there he could collect one as well. She told us to register on the app first, which we did on the spot. However the earliest slot was the next day morning. Since we were already there, it didn't make sense to come back tmr so I asked if we could select tmr's time slot and collect today instead. Was met by a curt \"No\". And she also said this tracker is given by HPB and not them (suggesting its not her problem, too bad...) Rather taken aback by this kind of (non-existent) service, we decided, forget it and just leave. We don't stay nearby, not going to come back to this place. No wonder tons of trackers rotted in the warehouse - collection is a pain and the post office staff doesn't care.",
      "time": 1695027154,
      "translated": false
    }
  ],
  "types": [
    "post_office",
    "finance",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17487490371049894979",
  "user_ratings_total": 37,
  "vicinity": "Towner Road #01-204/206 Block 101"
}