{
  "formatted_address": "190 Dunearn Rd, Singapore 309437",
  "geometry": {
    "location": {
      "lat": 1.3212977,
      "lng": 103.828876
    },
    "viewport": {
      "northeast": {
        "lat": 1.3220305,
        "lng": 103.8303506
      },
      "southwest": {
        "lat": 1.3190993,
        "lng": 103.8256806
      }
    }
  },
  "name": "Singapore Chinese Girls' School",
  "place_id": "ChIJTWmHvPsZ2jERkQKp5z4AY_o",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "kelly :3",
      "author_url": "https://www.google.com/maps/contrib/106005303196106171827/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWIInsAxkvDpXGG6SKITiaM0mYh768hqtV1nKGzQBwsQsZ6Mzg=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "3 months ago",
      "text": "I've spent 4 years at this school and there is a lot of awesome teachers that really care for their students, but of course there are some not as good teachers as well. The canteen and bathrooms are not the cleanest, and the primary schools infrastructure is definitely much much better than the secondary school ones. The school is quite cliquey, you will especially feel it if you weren't from the primary school, a lot of drama, but there can be very sweet people there as well. The BEST part of this school is defiantly the teachers and the amount of experience you can gain. Not all schools push their students to do the silver award to take points off for the O-levels, nor push their students to do volunteer work. If you attend, your resume will look good that's for sure, it happened for me even though i attended during the pandemic.",
      "time": 1737614730,
      "translated": false
    },
    {
      "author_name": "Hing Han Yu Celine (Scgss)",
      "author_url": "https://www.google.com/maps/contrib/106117037709487244654/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKOMZCqKqpuBFJYlY4eV1OLjWNtr762DlRIqwP5pfxEoqr2jg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "The teachers here are not nice.i recently did a practice paper in class,and i failed it.Im not upset that i failed,because seeing how the teachers teacher,i would be shocked if i was still able to maintain my A1.However,what i am really upset about is my Chinese teacher  REFUSED to mark one of my FOUR MARK questions,because she said it was too long.HELLO!!??who does that??During psle,you can’t just give the student a zero just because their answer is “too long”.I feel this is very unprofessional since she can’t just deduct our marks because she is too lazy to do her job properly.Plus,during normal day work ,when we do work on our workbooks,she doesn’t mark our work.She just puts a big red tick at the corner of each page!Sometimes,even I know I answered the question wrongly,but she still just puts that big red tick at the bottom of each page.How am I supposed to learn from my mistakes when I don’t even know what my mistakes are?I used to get A1 for Chinese all the time,but now I’m failing cuz of her💅💅💅",
      "time": 1744694249,
      "translated": false
    },
    {
      "author_name": "carter",
      "author_url": "https://www.google.com/maps/contrib/110826513708426948634/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJjsq7813DbV5dMaxmcic8H7OwcNhvVHuz_uxFJHQGvUlyC1w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Very good school. Ten years of my life spent here. Met the best friends and teachers. Teachers would sacrifice their break times every single day if you need help with your work, or don’t understand subjects (had friends who just consulted teachers, had no tuitions at all and scored raw 6 for olevels). School connectivity is good, people are a little cliquey but everyone finds their own group. Food is not bad! Many options. Good study environment, encouraging and not competitive at all. Very grateful to have amazing teachers who recognize students needing additional help (mentally and physically), and trying their best to help them. My literature and English teachers often burned midnight oil marking worksheets and writing notes for us, and turned up to school with very little sleep throughout the year. Dedication 💪🏻💪🏻 teachers are also very friendly and approachable :)  plus the school gives valuable experience for future (eg humanities trip overseas, leadership programs, model United Nations, hosts sports competitions, performing art performances, work experiences at real companies, etiquette classes, sabbaticals and much more)",
      "time": 1732124906,
      "translated": false
    },
    {
      "author_name": "gαвяιєllє",
      "author_url": "https://www.google.com/maps/contrib/101082350722615466681/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU7qKHU1NSalPrEAKa0LOJjqxJ8oxsESrnz4rDGMFDKpOFhVekH=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "best school ever, spending 10 years here is worth it. SEND UR KIDS HERE it’s so supportive",
      "time": 1739080107,
      "translated": false
    },
    {
      "author_name": "L",
      "author_url": "https://www.google.com/maps/contrib/117457359674578731574/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIDZqQPfa7YF0n8iM3Cpq7VPAKo2hHeLWUawgXedwgU0AYVJQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Very good location, near to Steven’s mrt and the school has a strong, rich Peranakan heritage in Singapore, their alumnis has also done well and contributed significantly to the community 👏🏻👏🏻",
      "time": 1653971704,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=18042264802350924433",
  "user_ratings_total": 122,
  "vicinity": "190 Dunearn Road"
}