{
  "formatted_address": "Blk 3, Level 1, Singapore General Hospital, Outram Rd, Singapore 169608",
  "geometry": {
    "location": {
      "lat": 1.2784612,
      "lng": 103.8346289
    },
    "viewport": {
      "northeast": {
        "lat": 1.279787730291502,
        "lng": 103.8360052302915
      },
      "southwest": {
        "lat": 1.277089769708498,
        "lng": 103.8333072697085
      }
    }
  },
  "name": "Singapore General Hospital Block 2 & 3",
  "place_id": "ChIJOTESzlAZ2jER_RXJCqO4rL8",
  "rating": 2.8,
  "reviews": [
    {
      "author_name": "Chloe",
      "author_url": "https://www.google.com/maps/contrib/112302767113963493528/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIK8fVDZidIPyZq5NY-RJCenUpu9h6UJFhmNwARS8WXnRsSNw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "a week ago",
      "text": "I came for ortho appt, but waited for 1hr to realised they give me an empty room without any doctor inside. I got suspicious so I checked with one of the staff whom is a health attendant, and she still say the room will call me without helping me to double check. Finally I went to the cashier and they realised a wrong room was appointed for me. So if I don't go and check with the cashier I will be waiting for nothing??? I hope the service can be improved further.",
      "time": 1747103492,
      "translated": false
    },
    {
      "author_name": "Shaowei Chua",
      "author_url": "https://www.google.com/maps/contrib/117662912545697164645/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW5n8K2XyZAiFPe62k4YSJK3lSEioaC15gLuT93Q3r29R0I0B4j=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Don't understand why even with an appointment, we still need to wait more than an hour. Continue to protect the hospital staff and they remain inefficient and unproductive. Even polyclinics are more efficient.",
      "time": 1741941756,
      "translated": false
    },
    {
      "author_name": "C Leong",
      "author_url": "https://www.google.com/maps/contrib/104120229674877345821/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJRAalE3g-NFJEdf-ZYQFyvoRo3fr2QHLTdObsPvx277abNgw=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "4 months ago",
      "text": "And for the case of the chinese nurse who tie a ponytail with dyed hair on 30/12/24 who attend to my dressing at CDLD Blk 3 B1 after I consult the doctor call me to the room left of room 25, the treatment area room 25-27, some probably know each other, the moment I went in her face was very unhappy and black and speak in Mandarin \"ni de wound zai na ni?\". She speak in a mixture of mandarin and english with the wound pronunciation in english softly so I'm like processing and she's impatient and purposely speak loudly \"san koh zai na ni? !\" When I haven't lie down. She then say angrily this bed can't move and I have to move myself. After her stuck-up attitude I asked her are you okay why the need to speak fiercely and rudely like that? She say what? She's very good. I heck care her & lie down then she asked how many times I go polyclinic, I said they recommend me 2 times per week. Then she went away for awhile and back also there's another nurse I think attending other patient. She then say you must go to polyclinic 2 times, I say umm, she's repeating what she asked me earlier and make it like a command when the other nurse was there. She then speak loudly to other nurse this one cannot make it and make it seems like she's referring to the bed! When I'm about to go I asked where's all my stuff she put under the table she don't reply I have to go there and check myself and she nearly take away the registration slip of paper. Then when I'm on my way to the door she suddenly \"bye-bye\" and use childish language and think it's funny when earlier she ignored my question unprofessionally! This lowlife reflect her CMI standard on vulnerable patient and think that lil form of authority she so seek her whole life can make up for her lack of basic manners and miserable life. Totally rude and uncalled for. Nurses should be more professional, patient without being condescending as they act in between doctors and patient.\nI hope appropriate action and guidance is given to ensure nurses are professional and have basic courtesy.",
      "time": 1735830723,
      "translated": false
    },
    {
      "author_name": "LINBERD C.",
      "author_url": "https://www.google.com/maps/contrib/117839783701354510842/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWz0apt1XIADiB9op2z3tHzOWmN2hLLcUmBaniCWHG6dUHDr_iv3w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "All the phlebotomist at SOC Clinical Lab, SGH Blk 3, Level 1 have been awesome. Not only are they good at their job, they are swift too. No pain, just a pleasant experience. Thank you very much! :-)\n\nIt would be wonderful if GXM can also be done here instead of at the Haematology Centre :-(",
      "time": 1730870801,
      "translated": false
    },
    {
      "author_name": "Joohn Than",
      "author_url": "https://www.google.com/maps/contrib/117658711981461811128/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX-V7jEU3gXyYAWbtELSW3K_TWqIAbgr_trJN6lbLgp5LhHNsVZ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "Long waiting hours, it is the known thing that doctors do not start their consultation at 2.00pm. 10 out of 10 doctor can't make it on time and at least 1 hour late. Can't the hospital review their system and start their appointments 1 hour later. Old person doesn't has stamina to wait for such a long hours.",
      "time": 1662622811,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13811617167638599165",
  "user_ratings_total": 35,
  "vicinity": "Blk 3, Level 1, Singapore General Hospital, Outram Road"
}