{
  "formatted_address": "Yuan Ching Rd, Jurong Lake, Singapore 618661",
  "geometry": {
    "location": {
      "lat": 1.3436783,
      "lng": 103.7271394
    },
    "viewport": {
      "northeast": {
        "lat": 1.345334080291502,
        "lng": 103.7287145302915
      },
      "southwest": {
        "lat": 1.342636119708498,
        "lng": 103.7260165697085
      }
    }
  },
  "name": "SkatePark @ Lakeside Garden",
  "place_id": "ChIJGXh_C7MP2jERfjzAO4Oin-M",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "ET Ang",
      "author_url": "https://www.google.com/maps/contrib/112541858640367889228/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVnF7w-uteqjE3HkkwQQ9ZSr5Ggn5xc-4ThHMDZCI7KRwLwNIGSEw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Stepping into the Skate Park at Lake Garden, I'm immediately struck by its sheer scale. It's a sprawling paradise for skaters.\n\nThe park, known as Singapore's largest outdoor skate facility, is a marvel that stretches across 17,000 square meters.\n\nEach of the five pods within the park offers a unique experience.\n\nI watch beginners take cautious strides in the Learn to Skate Pod, while adrenaline junkies tackle the steep curves of the Big Bowl Pod. It's not just about skateboarding; the parkour zone and bouldering wall invite athletes of all stripes to test their mettle.\n\nThe lakeside setting is breathtaking, providing a tranquil counterpoint to the skaters' energetic maneuvers. The thoughtful integration of shelters and solar panels speaks to a commitment to comfort and sustainability that impresses me deeply.\n\nBut what truly captivates me is the sense of community.\n\nThe park is alive with the camaraderie of skaters and the shared enthusiasm for the sport. Classes and events are a regular occurrence, welcoming all skill levels into the fold.\n\nI leave the Skate Park at Lake Garden feeling inspired by the seamless blend of sport, nature, and community spirit. It's a place that celebrates movement and connection, and I'm already looking forward to my next visit.\n\nP.S. I ran here quite frequently. Photos taken in the early morning where there is no crowd. Best time to visit is probably late afternoon/ early evening where you will see the skaters, bikers.",
      "time": 1709781918,
      "translated": false
    },
    {
      "author_name": "Kokthye Lim",
      "author_url": "https://www.google.com/maps/contrib/106497119696593044976/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLgMl5jcDHHQQc7kWLqO8J28oEYOA0ktHslcAywmlxw2KvC8w=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "A great place for youth to skate. There are at 5 different levels of skate course for users to try out. Water coolers are available. Got toilets and a small skate cafe.",
      "time": 1715133313,
      "translated": false
    },
    {
      "author_name": "Alex Tan (sup dot sg)",
      "author_url": "https://www.google.com/maps/contrib/114029170025753307595/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVZIUHpZzivPaRIlKl3HeA8OgppX-34l6zOq9S3p5xCUStGLGU=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "I recently had the pleasure of visiting this amazing skate park with a rock climbing wall and I have to say, I was blown away by how awesome it was! As someone who loves both skateboarding and rock climbing, this place was a dream come true.\n\nFirst of all, the skate park itself is top-notch. The ramps, rails, and obstacles are all expertly designed and maintained, making for an incredibly smooth and exciting skating experience. There's plenty of space to skate and a variety of different features to try out, from big ramps to smaller obstacles for beginners.\n\nBut what really sets this place apart is the rock climbing wall. It's a massive, towering structure that offers a challenging and thrilling climb for both beginners and experienced climbers. The holds are carefully placed and the routes are well-marked, making it easy to navigate your way to the top.\n\nOverall, I had an incredible time at this skate park with a rock climbing wall. Whether you're a seasoned skater or a beginner, or a climbing enthusiast, there's something for everyone here. The staff were friendly and helpful, and the facilities were clean and well-maintained. I would highly recommend this place to anyone looking for a fun and exciting way to spend their time! 5 stars all around. much thanks to doge multiverse sg",
      "time": 1680790887,
      "translated": false
    },
    {
      "author_name": "Edrie Boomz",
      "author_url": "https://www.google.com/maps/contrib/111751045487129289869/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXeWYTwZyKCFcoig9EVsMc9a31R5BKRk6D-eS8QCe20MShP5Ous=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Not a skater but loving this park! I’m sure skate enthusiasts will love this place, seems like there are multiple areas for different level of skaters.\n\nThere’s also a parkour corner albeit rather small for a sport that is requires a lot of movement.\n\nA nice place for joggers too.",
      "time": 1682424860,
      "translated": false
    },
    {
      "author_name": "SK —",
      "author_url": "https://www.google.com/maps/contrib/114901427646914671770/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLEtRxB08Kr7cbTyBICgy9V9ScxJ9Cq1OieVRFYlt9D1NMDVw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Interesting place to visit. Apart from the skates, also happened to watch an open air mini concert by Dansen John. Cool 😎",
      "time": 1680982107,
      "translated": false
    }
  ],
  "types": [
    "park",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16402007052433505406",
  "user_ratings_total": 67,
  "vicinity": "Yuan Ching Road, Jurong Lake"
}