{
  "formatted_address": "8 Marina View, #02-07 Asia Square Tower 1, Singapore 018960",
  "geometry": {
    "location": {
      "lat": 1.2784217,
      "lng": 103.8514742
    },
    "viewport": {
      "northeast": {
        "lat": 1.279768130291502,
        "lng": 103.8528271302915
      },
      "southwest": {
        "lat": 1.277070169708498,
        "lng": 103.8501291697085
      }
    }
  },
  "name": "Skinscape Clinic",
  "place_id": "ChIJX6ap9owZ2jERri9mWCHjiDc",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Fay Tan",
      "author_url": "https://www.google.com/maps/contrib/114441315331028844085/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXojiNJ-bttTkf9HU1F0sluEIP1-54RhpAxHLuK4q8VTbMR_Hc=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Honestly, this has been one of the most pleasant and relaxing experiences I’ve ever had at an aesthetic clinic. I absolutely love the design—it’s so aesthetic and calming! I was greeted by such a warm, attentive, and welcoming team. The doctor was incredibly friendly and genuinely attentive, giving very detailed explanations and making sure I felt comfortable every step of the way.\n\nIf you’re looking for a place that blends professionalism with true care, this is definitely it. I’m usually quite scared of pain, but the doctor kindly offered options to ease the discomfort, which I deeply appreciated. It’s rare to find such a genuine and thoughtful experience in this space.",
      "time": 1746599218,
      "translated": false
    },
    {
      "author_name": "Joey Ang",
      "author_url": "https://www.google.com/maps/contrib/106921246128507292943/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLI31-hQX-BWlKium0Ve5G-Ba7sx0ZlIvI9BMaNnwX7-O0g3Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "I have been visiting Skinscape for years when they were at Cathay but now move to Marina View.\n\nHow I know them was through google to remove my mole. I met Dr Harvey and his team. They're very friendly and definitely the best! Dr Harvey has never failed to answer all my questions professionally.  During the process, he went through everything thoroughly. To make sure it was done properly and carefully. He even went extra miles for the service done. He gives advice for every treatment. Skilled and knowledgeable.\n\nI'm now in the process of treating my scars. Saw a huge improvement and hope to get the best result that I want soon! Most importantly, they are not pushy and hard selling.\n\nI even recommended them to my friends. If you want to find a good doctor, go to Skinscape to find Dr Harvey and thank me later!",
      "time": 1746181537,
      "translated": false
    },
    {
      "author_name": "Amber Chua",
      "author_url": "https://www.google.com/maps/contrib/116439652043667958010/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVrSvEXilevDOCKKATP9EEVYXCqjCewrns0HvEnotY3RscwXH4=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I have gotten facials done at Skinscape for about 6 months now and my therapist is Aurore, she is amazing, highly recommend her.  I have recommended friends to go as well and they have also had an amazing experience.  I have extremely sensitive skin and their signature facial is the only one I’ve had in Singapore that has not caused me to breakout.  I have had such a great experience that I signed up for the facial membership with cost wise is extremely worth it.",
      "time": 1742301816,
      "translated": false
    },
    {
      "author_name": "Rachel Lam",
      "author_url": "https://www.google.com/maps/contrib/108450353748262934069/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJxY_DLe4yl5x4haN8r18Z4k5HHilikp95LubPPOpNGDwzZrw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Have been visiting Skinscape since Cathay days. Results have always been positive!\n\nDr Harvey took the time to understand my goals and recommend the best approach to achieve them. Staff are incredibly friendly and professional. Would recommend to anyone looking to see visible results for their skin!",
      "time": 1744021843,
      "translated": false
    },
    {
      "author_name": "Chih Chwen Heng",
      "author_url": "https://www.google.com/maps/contrib/107543376704524670413/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUf1yR_9tJ_ZHrtymBAZODmcBuD4qmz9GS0YbVgyzM2DMPQ6-s=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Skinscape is my sanctuary and I am always counting down the days to my next visit. I have been a regular monthly customer for the past 3 years, opting for minimally invasive treatments such as facials and lasers. The results have been amazing with my peers always asking for my secret to eternal youth. I used to think the aesthetics’ formula was more pain equal better results, but Dr Harvey and his team has correction my misconception, replacing pain with pleasure. I cannot recommend skinscape enough and the price point is the icing on the cake.",
      "time": 1745577755,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4001698001275203502",
  "user_ratings_total": 74,
  "vicinity": "8 Marina View, #02-07 Asia Square Tower 1"
}