{
  "formatted_address": "21 Fernvale Rd, #01-01 High Park Residences, Singapore 797637",
  "geometry": {
    "location": {
      "lat": 1.396639,
      "lng": 103.8752242
    },
    "viewport": {
      "northeast": {
        "lat": 1.397943080291502,
        "lng": 103.8766751302915
      },
      "southwest": {
        "lat": 1.395245119708498,
        "lng": 103.8739771697085
      }
    }
  },
  "name": "Small Wonder Sengkang",
  "place_id": "ChIJQ8zrOAQX2jERNrRJ9Tr8t8g",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Shannon Hung",
      "author_url": "https://www.google.com/maps/contrib/107409195976117715677/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKPBm5DIwbYii06hhLe6gorh1J3pxIU6RCo3R6m0No2JUrjxw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I am thankful to Small Wonder Sengkang for taking care and nurturing my child since he joined them 2 years ago. The teachers (including the centre director) are passionate, genuinely love and care for the children.\n\nMy child particularly enjoyed the holiday-themed activities conducted in December. One of the theme was Camping and the children did camping activities in school for a week. A month has passed, my child is still asking me if he is going camping in school when we are on the way sending him to school.\n\nWe are also very impressed with the teachers and centre director’s efforts to decorate the school for the different celebrations. The Christmas decorations at my child’s classroom were really nicely done up and was in line with the camping holiday program.",
      "time": 1737093952,
      "translated": false
    },
    {
      "author_name": "Ho Jian Wei",
      "author_url": "https://www.google.com/maps/contrib/107705451541909783330/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL08xxNdG_fMV_xRJiK28aVnmC42Bhs_jwQs5WSUOmEjOh5ww=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "The teachers are incredibly caring and truly go above and beyond for the children. My son loves all of them, even those who don't teach his specific level, and it's clear that they all have a genuine interest in the kids' well-being and development. The principal is also fantastic—always engaging with parents and ensuring open communication, which makes me feel confident and informed about my child's experience. There are so many fun, interactive activities, and it's evident that they focus on making learning enjoyable. My son comes home every day singing new songs he’s learned, and it’s such a joy to see his excitement about what he’s been doing. Highly recommend this center to any parent looking for a warm, nurturing, and enriching environment for their child!",
      "time": 1741132290,
      "translated": false
    },
    {
      "author_name": "Joey Chen",
      "author_url": "https://www.google.com/maps/contrib/110104495076996698715/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWcoyTuswBTKFq0BIh678twYr0txfZ-6nAHs1daqMEYaWLWjUA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Thank you to all teachers & staff for the amazing experience we’ve had with the school! Our boys have been with the school since infant care & have made so many wonderful memories. Teachers are incredibly sweet & patient towards the boys. Staff & teachers take effort to remember parents/grandparents for pick-up. We feel confident to entrust our boys with the school. We would definitely recommend the school!",
      "time": 1740312117,
      "translated": false
    },
    {
      "author_name": "sudarni sulaiman",
      "author_url": "https://www.google.com/maps/contrib/111735713367740908488/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKg4PWhOZzcTtdSUeXa0EbJ1jU0Vt2Gg3vv-Lvu4N5D39OEaw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I am incredibly grateful for the wonderful experience my two sons have had at Small Wonder Sengkang, formerly known as Safari House, since 2020. The teachers have consistently been kind, supportive, and dedicated, always keeping me updated on my sons' progress. My older son graduated last year and transitioned smoothly into Primary 1, thanks to the solid foundation he received here. My younger son, who is currently in K2, has grown from being timid to becoming a more vocal and confident boy. I truly appreciate the care and attention the teachers at Small Wonder Sengkang have shown. Thank you for making a positive impact on my children's development!",
      "time": 1736937481,
      "translated": false
    },
    {
      "author_name": "Cheryl Lim",
      "author_url": "https://www.google.com/maps/contrib/115352654108027376917/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKXxdPgwUqXPe44QNkbI6-HD1-do8F2hBr_83qfaq47vKzbwA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Our experience with Thea’s school has been nothing short of amazing. From the moment we enrolled her, we’ve been impressed by how friendly, approachable, and professional the teachers are. They genuinely care about the students’ growth and well-being, and it’s clear that they are highly competent in what they do. They go the extra mile to ensure the children feel comfortable and supported in their learning journey.\n\nThea has been thriving here—she is learning so well and so fast! The curriculum is incredibly well-structured and thoughtfully designed. We love that it’s comprehensive and engaging, which means there’s no need to supplement her education with extra enrichment classes. The school ensures that children receive a strong foundation in academics while also nurturing important life skills.\n\nOne of the standout aspects of the school is how well they communicate with parents. We receive regular updates and photos giving us a window into Thea’s activities. It’s heartwarming to see her happy and engaged at school, and we really appreciate how timely and detailed the updates are.\n\nThe school also emphasizes parent involvement, which is a huge plus for us. There are plenty of parent-child events and activities that allow us to connect with Thea’s school experience in a meaningful way. These events foster a strong sense of community and help us build wonderful memories as a family.\n\nOverall, we couldn’t be happier with our decision to enroll Thea here. The school strikes the perfect balance between academic rigor, emotional development, and community engagement. We highly recommend it to any parent looking for a nurturing and enriching environment for their child!",
      "time": 1737956469,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14463306058477188150",
  "user_ratings_total": 9,
  "vicinity": "21 Fernvale Road, #01-01 High Park Residences"
}