{
  "formatted_address": "557 Jurong West Street 42, Block 557, Singapore 640557",
  "geometry": {
    "location": {
      "lat": 1.3540468,
      "lng": 103.7188342
    },
    "viewport": {
      "northeast": {
        "lat": 1.355302780291502,
        "lng": 103.7202031302915
      },
      "southwest": {
        "lat": 1.352604819708498,
        "lng": 103.7175051697085
      }
    }
  },
  "name": "So Fresh Catering",
  "place_id": "ChIJLZtj6toP2jERyNYLIhKI6oc",
  "rating": 1,
  "reviews": [
    {
      "author_name": "Hai Ying",
      "author_url": "https://www.google.com/maps/contrib/102361086972035917369/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLkjA4mGMzS0JHG6KpBFfnfPbbBqfd7vxa6u3HpW8eUOpKODg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "5 years ago",
      "text": "Following are the areas that need a lot of improvement:\n\n1. Attitude of the staffs: Staffs was impolite when they answered us over the phone\n\n2. Last minute changed in price and did not specified their requirements/expectations of their customers in their menu.\n\nWe ordered from them once before and despite the rudeness of their staffs, my family would like to engage them again for the second time as we did not want to spend time looking for a new caterer. However, it made our experience even worse. They informed us that there’s an increase in the price per pax due to a Long holiday in the month (it was definitely changed not Long ago because what they did was just to write over the price with a marker pen). Not only this, for every items that you requested (eg:chairs) and even the transportation fee, they also said there’s a price increased. However, they did not specified all these new changes into their menu. Fine...we did not argue with them further on this because there’s nothing we can do since is the company’s policy to increase the price. So, when we have done placing our orders, we submitted to one of the employee, and they even issued us an invoice for confirmation. Not Long after, they informed us that there’s a changed in the company policy again. So what happened was previously when we ordered from them, we consulted them and they mentioned to us that we are able to order more than 2 dishes from a category because we did not want any vegetables. Therefore, we ordered 2 meat instead and no vegetables at all. The invoice has even issued to us, but they said that we couldn’t do this way anymore because company change in policy. I was wondering, do your company change rules/policy so regularly?? Why are you all informing us after we placed our ordered and invoice issued? This is so ridiculous. Now they want us to re-select our choices. Do update your menu properly based on your all “new policy”, it’s really irritating that we have already placed our ordered and there you all go informing us on the new policy etc.\n\nReally a bad experience for my family and I.",
      "time": 1565102292,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9793789951132554952",
  "user_ratings_total": 1,
  "vicinity": "557 Jurong West Street 42, Block 557, Singapore"
}