{
  "formatted_address": "5 Stadium Walk, #01-38/39, Singapore 397693",
  "geometry": {
    "location": {
      "lat": 1.3021918,
      "lng": 103.876502
    },
    "viewport": {
      "northeast": {
        "lat": 1.303556880291502,
        "lng": 103.8781155302915
      },
      "southwest": {
        "lat": 1.300858919708498,
        "lng": 103.8754175697085
      }
    }
  },
  "name": "Song Yue Taiwan Cuisine",
  "place_id": "ChIJoZwrGS4Z2jER3gq4uzuqIbw",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "C K Leong (Ah Leong San)",
      "author_url": "https://www.google.com/maps/contrib/108882315597576503809/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUVnsYpsyFz1yewbM5c0PaBvtNJDL19MIgBzbnv_ufhW-tODaOB=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "First time here after a failed attempt to get in. It was because there were long queues of cars coming into the Sports Hub area for events. So this time I checked to ensure no event on that day. As the name suggests it’s Taiwanese cuisine. As we just returned from Taipei we found the food was just as good as those we tried there. We had the Ah Ma Rice Vermicelli and taro soup. It was very delicious. Using the authentic Taiwanese 新竹米粉 the dish is really yummy. Just as we had in Taipei. One of their signature dishes is the crispy eggs with black sesame sauce which was best eaten with rice. They served very  good Taiwanese short grain rice. We loved the steamed red grouper which was really very well steamed - not under or overly cook. The water snowflake vegetables was good - crunchy and not overly cooked too. We’ll likely return again of course ensuring there’s no event around Leisure Park where the restaurant is. 😆",
      "time": 1743839787,
      "translated": false
    },
    {
      "author_name": "William Tan",
      "author_url": "https://www.google.com/maps/contrib/116142914043575788977/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW8DsWUJDBTy5l6iify2TJ5mC7Nky0FI6FFZ08JymybD2uEqBmG=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "This is the Chinese restaurant mainly sell Taiwan cuisine. Last time when it was just opened, always crowded during weekend and you can't even reserve a seat on the day itself. Need to reserve in advance.\n\nBut we went on 23 Mar 2025. It is less crowded and we manage to book a seat 30min we went there. Probably people looking for something new that time. The service and food serve are slow, but luckily the food taste still above average, I can say. ⭐8/10\n\nSuggest you to call for reservation especially during weekend.\n\nQuite many people order the pumpkin tofu. Suggested.\n\nWhen you join the member can enjoy SGD 5 off for first time and accumulate points.\n\nQuite expensive I can say. Per person price is around SGD30 and above",
      "time": 1742900197,
      "translated": false
    },
    {
      "author_name": "dogcom sg",
      "author_url": "https://www.google.com/maps/contrib/107700710922107795793/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX4z_RAQYsaNVWHnKNSStORY_aoPF0hnS2pupsuZay720f8SIzQWg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I am writing a rather long review as they deserve it. They don't have a big selection of dishes like many other restaurants. The dishes are in one size only, like the medium size of other Chinese restaurants. We ordered 9 dishes plus dessert for the 11 of us. All were superb! Very original; not your usual fare at most Chinese restaurants or Zi Char establishments. We all concurred on that and each plate was polished clean.\n\n- Farm chicken with spring onion\nReminds me of our Samshui Chicken. Very similar. Fragrant, cooked just right with a nice bite that is not tough nor too soft.\n\n- Pineapple Prawn with Crispy You-Tiao.\nGolden brown lightly battered fresh, succulent prawn coated with flavorful sauce with a mix of pineapple cubes and crispy You-Tiao\n\n- Braised Vegetables with Fish Maw.\nShould Chinese cabbage braised. The flavours are infused in the vege.\n\n-  Golden Seaweed Tofu\nCrispy on the outside, soft on the inside, yummilicious\n\n- Handmade Crispy Duck with Taro\nDeep Fried duck slices with a creamy yam paste. First time having this. Very well prepared. It's like Tim Sum Yam Ball.\n\n- Slow-Braised Pork Ribs with White Radish\nBraised prime pork ribs with white radish, both deliciously tender and melt-in-your-mouth.\n\n- Water Snowflake Vegetable Stir-Fried With Lily Bulb And Ginkgo Nut. We added this dish half way through to cater to one vegetarian friend in the group. Nice crunchy texture, healthy addition.\n\n- Ah-Ma’s Rice Vermicelli and Taro Soup\nTraditional Taiwanese dish Rice Vermicelli Soup 米粉汤. Supposedly the finest quality rice vermicelli sourced from Xin Zhu 新竹, Taiwan, cooked in a rich and aromatic pork bone broth, enhanced by the inclusion of fresh seasonal ingredients and fragrant taro. This is a must try!\n\nEverything goes so well with a bowl of white rice giving it the a feeling of home cooked food by mum or grandma.\n\nI\"LL BE BACK!\n\nI realised there are bad reviews about waiting service but we were very pleased with the service from the waitresses. They were attentive and pleasant. The restaurant wasn't very busy at that time.",
      "time": 1741845943,
      "translated": false
    },
    {
      "author_name": "Katie Choo",
      "author_url": "https://www.google.com/maps/contrib/114561569146464094601/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWJy2N3Jv6HiqkWvmgDV9q27vnyLqNrIjnWh_g_QYDqFNV_A9s9=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "My 2nd visit here. Usually spend 30min to dine in but not sure why the restaurant always seems empty with occupancy like 6/10 but they do not take on walk in anymore.\n\nTaiwan culture always seems to be attentive and 贴心 but somehow I don’t feel it here at Song Yue so maybe you can look into it as a way for staff to improve?\n\nWant to compliment one of the short hair staffs doing her best “Ginny” who approached us to offer how to serve our dish and I was actually expecting this kind of initiative in a not so busy restaurant. Food was great. We had Ginger duck soup, Sesame Oil Chicken Soup, Fried Fish and I must say their sesame dark sauce sunny side up egg was truly yummy!",
      "time": 1746851162,
      "translated": false
    },
    {
      "author_name": "michael lin",
      "author_url": "https://www.google.com/maps/contrib/101093200154303210000/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWsfOmJxDMn30IhtL0DG3fgXEKZRunUICNs8PR-n5m7HUb8mjoY=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Nice experience. Lovely food. 5 of us (guys) ordered the duck taro vermicelli broth, the fried duck taro slices, salt pepper chicken, cabbage with bacon, and the pineapple prawns with you tiao.  Think our favourites were the duck taro slices, the duck soup, and the pineapple prawns. Rich foods though. The cabbage was also nice, but the salt pepper chicken was under-seasoned and didn’t have that Taiwanese feel. All other dishes felt authentically Taiwanese. Rice and drinks were good too. I ordered an iced sour plum - authentic! Table seating was a little packed. Busy for a Friday evening. Lots of family with children. Made for a boisterous ambiance, so conversation was not the easiest. Service was attentive once we got their attention. Plus plus place. Worked about to be just under $40ppax. Overall, recommended. Would come again.",
      "time": 1745637431,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13556303526891096798",
  "user_ratings_total": 190,
  "vicinity": "5 Stadium Walk, #01-38/39, Singapore"
}