{
  "formatted_address": "176 Orchard Rd, #02-29/30, Singapore 238843",
  "geometry": {
    "location": {
      "lat": 1.3024016,
      "lng": 103.83984
    },
    "viewport": {
      "northeast": {
        "lat": 1.303797230291502,
        "lng": 103.8414065802915
      },
      "southwest": {
        "lat": 1.301099269708498,
        "lng": 103.8387086197085
      }
    }
  },
  "name": "Song Fa Bak Kut Teh The Centrepoint 松發肉骨茶 先得坊",
  "place_id": "ChIJq51Ft5YZ2jERd4ctVijFKeA",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "uow31",
      "author_url": "https://www.google.com/maps/contrib/110934380608891778313/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ9KR0p9tpOmJV3pu2S7G4Nfy63wReLVef5248d4E7HN7NYb_Q=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "This restaurant is absolutely delicious! Although the place is often crowded, the restaurant has a great flow, ensuring that guests are seated efficiently and comfortably. Despite the busyness, the service remains exceptional, with attentive staff who make sure your experience is enjoyable from start to finish. It’s clear that this establishment maintains high standards in both food quality and customer service. The atmosphere is lively, yet the attention to detail in every aspect, from the food to the service, makes it a standout dining spot. I highly recommend it to anyone looking for an authentic and satisfying meal.",
      "time": 1735984527,
      "translated": false
    },
    {
      "author_name": "Ayda Sulianti",
      "author_url": "https://www.google.com/maps/contrib/104766553448968580051/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXEpDfmEy-tuvy-8rpsSoBJr3sJqV076FziO0yF3-jW0xvbsMel=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "🍲 First Bak Kut Teh Experience? This is the Spot!\n\nNever tried this iconic dish before, but Song Fa won me over! Their broth is light, flavorful, and not oily—perfect if you’re craving something wholesome.\n\nHighlights?\nThe tenderloin pork claypot(fall-apart soft!)\nFish soup (clean and aromatic)\nand Kai Lan (crisp and fresh).\nOh, and free unlimited soup refills! 🥣\n\nTheir portions lean petite, so order a spread to share (or double down on favorites!).\n\nThe vibe? Pure nostalgia—retro Singaporean café charm with wooden stools and old-school tiles.\n\nA tasty, cozy dive into tradition! 🪑",
      "time": 1741923210,
      "translated": false
    },
    {
      "author_name": "ML",
      "author_url": "https://www.google.com/maps/contrib/106421457478618430542/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU76uZp9exsjWuit0CWjXHcvmeLRK6F0HQyeN5y4e1R8WhaOhjlpQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "3 months ago",
      "text": "Frankly as a local, I don’t eat song fa bah kut teh. Only because foreign friends want to go, so I accommodate them.\n\nThe food is not more wow than it should be. I guess you can also laud it for consistency. It’s not any more or less tasty than how bah kuh teh is supposed to be. But of course you will be missing out if you didn’t order fried youtiao to dip the soup. Crunchy doughy and savory goodness.\n\nIt’s insanely crowded and the centre point branch also accommodates tour groups which adds to the chaos. Go at super early dinner like 5pm if you want to eat it even earlier on weekends.\n\nFor what we ordered, we paid like nearly $60 for 2 people. Not exactly cheap but not breaking the bank either.\nI guess if you’re a tourist and you want to try, sure, why not. But locals would find it madness to line up 45 min to an hour for this very regular food.\n\nUpdate: Jan 2025 service is quite slow. I experienced slow service also at another branch.\nI think they want to prep the whole order first before serving all at once but seriously customers are hungry / starving after Q-ing up so long, so why can’t you serve something first that’s ready to eat? Also frankly, the soup and pork ribs are all ready made, it’s able to serve it immediately.\nEven after instructing staff to bring something anything quick, it was ignored…. *rolls eyes*\n\nAnd the digital order system allows customers to order the paofan porridge alone but the staff later brings a card with exclusion clause saying you can’t do that, you MUST order a “main dish” with the Pao fan.\nGeez, put that restriction in the digital order, so customers can immediately know instead of ordering and have to edit order again… I feel the whole system has much to be improved on …\n\nbut on a positive note song fa is more affordable than some other bah kuh teh chain. And the cashier was quite flexible which I appreciate.",
      "time": 1737726978,
      "translated": false
    },
    {
      "author_name": "Rosa Kop",
      "author_url": "https://www.google.com/maps/contrib/104839480290690532992/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXgGmGiiP9oUKOqEu1ElTtblZxSfnKHt8CEAcqnVaunqTWRXRB5=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "Delicious comfort food, love their soup noodles tofu (all 3) peanuts and fried fritters. Never disappoints. Well organized we were in a long line for a 30 minute wait. Scan menu to order.",
      "time": 1724300237,
      "translated": false
    },
    {
      "author_name": "Tâm Anthony",
      "author_url": "https://www.google.com/maps/contrib/103276245302747623908/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVT5_P2X5ru9YGPt_nh_P5iP8zC8dDRvrkSr-1ibEy44VqZandQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Fantastic experience!\n\nThey've got the best bak kut teh in Singapore for sure!\nFresh and flavorful broth, juicy and tender pork rib that go really well with condense soy bean sauce.\n\nEven the store get crowded easily, the staffs are still super calm, professional and helpful. It's located in the corner, so just track the kiosk' number to locate it. No too big store but nicely decorated and cozy\n\nI will definitely go back to this place anytime I have trip to Singapore! 100 points!",
      "time": 1737111893,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16152658315576182647",
  "user_ratings_total": 1700,
  "vicinity": "176 Orchard Road, #02-29/30"
}