{
  "formatted_address": "6 Marina Blvd, #01-18/19 The Sail at Marina Bay, Singapore 018985",
  "geometry": {
    "location": {
      "lat": 1.2805968,
      "lng": 103.8528441
    },
    "viewport": {
      "northeast": {
        "lat": 1.281800780291502,
        "lng": 103.8541637302915
      },
      "southwest": {
        "lat": 1.279102819708498,
        "lng": 103.8514657697085
      }
    }
  },
  "name": "SOS Bar Restaurant",
  "place_id": "ChIJc9mCRw4Z2jER-H2AVBjcDYY",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "mag huang",
      "author_url": "https://www.google.com/maps/contrib/102209821885119594374/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXSeT16w3DliK6a_4Ae-RaLgZM6_-aX719P5vTJJsUHsD7bvaaa=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Order the nachos, can’t go wrong. The chips and avo dip was so good! Staff was great, met the founder and he was super chill. Would rec the interesting bloody mary if that’s your thing.",
      "time": 1626286344,
      "translated": false
    },
    {
      "author_name": "Guan Ying Cheah",
      "author_url": "https://www.google.com/maps/contrib/101985342182055683320/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLiT5908Icm9h_DA-2H4YTtVLA3zAGLxRjt5EiYkw3iVoQcLA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Came here on a quiet night, but so nice and chill. Service was great, and so was the food. We got the beef and pulled pork burger, recommend the pulled pork. Was soooo nice ♥️ thank you! Pet friendly too, the service staff gave our dog water. Cleared our food. Beer was worth it.",
      "time": 1699882158,
      "translated": false
    },
    {
      "author_name": "Khor Zi Jian",
      "author_url": "https://www.google.com/maps/contrib/110988941914838424379/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXug95DaD8ehnSncJhDtVQnHpm4uCYdGQxGVy4VG1MhC-bDeik0=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 years ago",
      "text": "Food was delicious and service was great!\n\nWe ordered the (i) chicken meltz burger, (ii) baby back ribs and (iii) pulled pork nachos!\n\nThe burger came with a knife stabbed right in the middle, what a way for presentation! There were 2 slices of breaded chicken breasts, tomato slices, lettuce, bacon, melted cheese, sauce/ spread (some kind of hollandaise sauce with fresh herbs). The buns were lightly toasted with sesame seeds and the cheese was so soft and chewy! The mix of crispness from the breaded chicken, and the savouriness of the bacon, mixed with the soft buns give it a very wholesome burger taste.\n\nThe baby back ribs were so soft and literally fall off the  bone! The meat was so tender and the sauce was drizzled all over the ribs. I was impressed with the size of the ribs, which were arranged so nicely! The sauce was also very smoky and sweet!\n\nThe pulled pork nachos were lightly salted, and the same melted cheese was within it. There was also guacamole just heaped onto the chips, and bits of pulled pork tossed within. The pork bits were so soft and melted in my mouth. There were also burnt bits to give it a charred taste, and jalapenos to give it a spicy kick! (We even asked for more jalapenos which the staff gave!)\n\nThe asahi draught from tap was also very fresh and smooth, as it should be.\n\nOverall, it's a very nice and cosy restaurant which I'd highly recommend coming to chill right in the middle of CBD, and to take a stroll around marina bay area! Would defo be back again!",
      "time": 1600780213,
      "translated": false
    },
    {
      "author_name": "Ice Qu",
      "author_url": "https://www.google.com/maps/contrib/112472682452415767759/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXCNYlHWu16DpWlTwNKe41agOLE-eo_Mnb4Vv2MC9fR64AXEsA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "6 years ago",
      "text": "Unpretentious,  casual but in no way a dive bar, the SOS has got the right vibes for a quiet midweek drink with your friends or sweetheart as well as a rowdy, steam-blowing-off beer with coworkers on a distressing Friday or whatever day of the week you find yourself in need of a haven of respite.\nEasily located, poised as a clipped edge on the streetside corner of The Sail, SOS Bar is rather handy. Public parking is available on the 4th floor of The Sail, reached by going around a sort of driveway/street that is correctly shown on Google Maps.\nIf you take the MRT, you'll want the blue Downtown Line, alight at DT17, station aptly named the Downtown Station.  Exit A. Walk across the street using the crosswalk and you are there. It's that easy!\nOn our visit we had a cold beer and a gin-yuzu drink, both just fine and dandy. Also tried the sweet potato fries which were presented fresh out of the fryer in a wire basket. Easily done.\nOther reviewers have said there isn't much to see here, but I would disagree. They have sports on wall-mounted tv sets. This is a corner location not far from banks, shops, a hotel or two, plus there are residences in The Sail, so plenty of diversity as far as people watching if you're not into tv. Small dramas of lovers meeting, tourists being lost, workers being exhausted, expats being bored or lonely, all kinds of little stories are being played out on that street intersection if you just watch. Having a friendly staff, good to great selection of spirits and interesting cocktails or mocktails is a bonus. Catch a glimpse of Singapore here, especially on a Sunday, when other areas of the city are mobbed, this SOS Bar can be your haven of peace.\nHighly recommended.",
      "time": 1554075914,
      "translated": false
    },
    {
      "author_name": "T A",
      "author_url": "https://www.google.com/maps/contrib/114789196240062377786/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWUZ7qMLXbvYLZRwYRJRnuEEYmCkfQk1rpdB_ZUvlMHWvrOxb-g=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "6 years ago",
      "text": "Didn’t eat there, just day drank. Great little bar for that. Surrounded and hidden by banking / financial institution skyscrapers, the kind of quiet place local office expats go after a rough day at the office to get loaded. I just visit Singapore once or twice a month for work but the staff made me feel welcome right away. She made a great vodka / lemonade and I had about 6 of them over 2 visits in the same day.\n\nFantastic quiet but still interesting spot to hang out and watch people walk by. I was there on Tuesday afternoon which I’m sure is different then a Friday night, but I loved it. Will go back for sure and try the food next visit.",
      "time": 1532427758,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9659618772834614776",
  "user_ratings_total": 211,
  "vicinity": "6 Marina Boulevard, #01-18/19 The Sail at Marina Bay"
}