{
  "formatted_address": "1 Grange Rd, #06-04 Orchard Building, Singapore 239693",
  "geometry": {
    "location": {
      "lat": 1.3015674,
      "lng": 103.8372957
    },
    "viewport": {
      "northeast": {
        "lat": 1.302835430291502,
        "lng": 103.8385518302915
      },
      "southwest": {
        "lat": 1.300137469708498,
        "lng": 103.8358538697085
      }
    }
  },
  "name": "Specialist Skin Clinic - Dermatologist Singapore",
  "place_id": "ChIJy1_9GZEZ2jERE8WO8_dSBfU",
  "rating": 3.8,
  "reviews": [
    {
      "author_name": "Fintan Mc Kiernan",
      "author_url": "https://www.google.com/maps/contrib/102266195263814016794/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV6KxHgiMYHmN-Ku-UAVtD8j_4LT5rvglhg36ug87sj-cksdqeZ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "My first visit today with Dr Neoh Ching Yin.  My visit necessitated interactions with a number of staff to give blood samples and other testing. Dr. Neoh and all the staff were most professional and very pleasant. Nobody enjoys going to the doctor, and having nice staff really makes a pleasant difference. Well done guys keep it up, much appreciated.",
      "time": 1729247360,
      "translated": false
    },
    {
      "author_name": "Sheena Tan",
      "author_url": "https://www.google.com/maps/contrib/112355839221261013109/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK-0kFJMELSY7nDPd-H_cx_b32IlgW_DGSzZYd_mEFpZ8AbjA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "*Posting on behalf of a friend*\n\nI called up on 18/01/2024 to order 2 bottles of the face gel. Firstly, the staff did not mention that this item is expiring in April 2024 and it is impossible for me to finish in time as I have an extra 1 bottle at home.  It was a wasted trip to the clinic to only found out on the expiry date.  Secondly, I was shocked to hear from the staff that the face gel could still be used 3 months after expiry date.  I was angry because I feel that I am paying a full price for a near expired product.  What if this expired product cause more skin issues after using on my existing sensitive skin?  Is the clinic going to be responsible?  I feel that this is not ethical. I also asked them if possible to pre-order for me, so that I could come back to get them but they mentioned that they won't restock unless the current ones are sold. I am very upset with how the clinic handled these issues.",
      "time": 1705625810,
      "translated": false
    },
    {
      "author_name": "Eva N",
      "author_url": "https://www.google.com/maps/contrib/103836027000056073896/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIfJD3k5LVOyy4nHZgkBYpPW2WQW7iAJEgh4B-38Z9aGhbV8Q=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Have been coming to this clinic for more than 5 years now for my skin needs (adult acne and also how to manage my skin through my pregnancies). Dr Cheong and Dr Phay are skilled, have excellent bedside manners and are thorough. Their treatments have been effective and they do not push for treatments that are unnecessary. Clinic staff are helpful, friendly and personable. I return again and again for skin maintenance. Recommended them to family and friends. I would only highlight to potential patients that the waiting time can be long sometimes - but that is expected because patients may have unanticipated needs; the clinic staff are efficient nonetheless.",
      "time": 1653093885,
      "translated": false
    },
    {
      "author_name": "Jermaine T",
      "author_url": "https://www.google.com/maps/contrib/101808767218856417443/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIxLLI8EjbtiBzIT3HXDJw6QYozKE6me6fjV7f5WRmO_8qTW3Y=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "2 years ago",
      "text": "While the doctor I visited was nice and friendly, she seemed to be in a rush and gave me the vibes that she wanted this consultation to end asap. I wasn’t able to explain my full history of skin problems and neither did the doctor seem keen to know by probing.\n\nShe also used a lot of medical jargon and asked me to go for a skin biopsy to test for a skin lymphoma, two weeks before I left to study abroad. There was no explanation given on what a skin lymphoma was or the severity of a skin biopsy test - upon my research, it turns out it was a form of cancer, and no way is someone fit for TWO skin biopsies right before leaving the country. I think these things should be explained properly with the patient’s feelings and condition taken into consideration - which I felt wasn’t done at all.",
      "time": 1682217935,
      "translated": false
    },
    {
      "author_name": "Xy -",
      "author_url": "https://www.google.com/maps/contrib/100849603612083723973/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK__-H4FeERrvTDOs-YWxD_od953nEtX6WEKQIwHBaLyCljvZYk=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "10 months ago",
      "text": "Came on a Monday afternoon, no crowd, receptionist nurse however, exceptionally rude and aggressive for no reason, please calm down and be more professional, thanks. (Might be Monday blues, shall never find out though)",
      "time": 1719819171,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17655609139072517395",
  "user_ratings_total": 30,
  "vicinity": "1 Grange Road, #06-04 Orchard Building"
}