{
  "formatted_address": "100 Orchard Rd, Located in: Concorde Hotel, Singapore 238840",
  "geometry": {
    "location": {
      "lat": 1.3006741,
      "lng": 103.8419409
    },
    "viewport": {
      "northeast": {
        "lat": 1.301788080291502,
        "lng": 103.8438206802915
      },
      "southwest": {
        "lat": 1.299090119708498,
        "lng": 103.8411227197085
      }
    }
  },
  "name": "Spices Cafe",
  "place_id": "ChIJ8ZWaq5cZ2jERU5GmDeaL61o",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "joe fong",
      "author_url": "https://www.google.com/maps/contrib/107449856987650037918/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJGt46mGXs_MpGZ6mePCUet9sxfyWpPBxWx-RvTU9SNPGrlVw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Was reading the reviews and wondered is it is really so good, the fact that buffet is available in most hotel.\n\nBut to my surprise this place is amazing, with wonderful service crew and chef attentive to every needs.\n\nFirst the lobster with flavour of cheese and salted egg, the size is consider big and really fresh.\n\nCrab in 3 flavours, chilli crab 🦀 was good, salt egg is excellent but black pepper lack of sauce,  even the crab is not big buy all fresh and meaty.\n\nThe spread of choice from stew ox tail, japanese sushi,  sashimi,  and the fresh Oyster is from the sea...\n\nLaksa is a must...\n\nFish maw stew is really truly great culinary skills..\n\nThe food are served on decent portion and they top it up almost very instantly not to fill it up but making fresh, even for those cook food.  This really makes the food fresh and not over done in the steamer or warmer.\n\nDessert the star was rhe durain pudding or durian paste that really from fresh durain and no kidding it is sooo goood.\n\nOverall this is a buffet that worth the price, excellent service especially Rahimah and ambience is good.\n\nI will come again for sure.",
      "time": 1743155288,
      "translated": false
    },
    {
      "author_name": "Clarence Ow",
      "author_url": "https://www.google.com/maps/contrib/112234615480628100933/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX_dX_-LEj7UqCWF1JKZREPhyLFgPJjp7PYAIjqqOhzJhaYPuc=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "This is the first time I came here for their lunch buffet, which served local delights and peranakan food.\n\nIt surprises me that they have a rather wide range of food. Though local foods are commonly found in Singapore, Spiced Cafe definitely have high demand for quality. The Laksa, prawn noodle, Kway Chap and Popiah are excellent. Among these, we all prefers Laksa, which taste superior.\n\nAmong the cooked food, there are plenty of peranakan style which include Ayam Buah Keluak, some Peranakan fishes and sotong.\n\nI also like their pork leg vinegar as well, not so sour but fragrant. As well as their pig stomach soup.\n\nThere are even more than enough traditional kueh and desserts, which i recommend to start early before you are too full to enjoy.\n\nThe fruits amazed me too, as it is rare for buffet to served Jackfruit and Longans.",
      "time": 1742445423,
      "translated": false
    },
    {
      "author_name": "Winston C",
      "author_url": "https://www.google.com/maps/contrib/117811413595030544234/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWredilit3QVCOzV59feizspJ5Iltfg8ISJtnNiWls8YW-90X7DXA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "This is my first time at Spices Cafe. Love the seafood options - Oysters, prawns, sashimi, snow crab, steamed fish, black pepper crab, salted egg crab, chilli crab! Plenty to eat and U can order the crab dishes again and again.\nThe cooked food section was look only. The standout to me was the steamed fish and beef stew. Satay was good! They also have a tempura and laksa station - just average.\nFocus on the seafood! Oysters are fresh!\nThe service staff was attentive and helpful with orders. Be prepared to dirty your hands when eating crab!\nI will probably go back again when I have another birthday to celebrate!",
      "time": 1742659785,
      "translated": false
    },
    {
      "author_name": "muffin Sweet",
      "author_url": "https://www.google.com/maps/contrib/103549962793705801669/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI_wa55ZYnFGT3wQ3apd2McxcHvG7goLYDZH9-o8QgDJjZ0JQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Brought a visitor to try the Peranakan food and she enjoyed everything. Wide variety of dishes and dessert and the durian penyat was a crowd favorite - all are taken within minutes of each replenishment. Good price with discounts, nice seating and ambience and sound was not trapped even though restaurant was full",
      "time": 1734718361,
      "translated": false
    },
    {
      "author_name": "Henry Cheng",
      "author_url": "https://www.google.com/maps/contrib/108151994390288524704/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVfwNWg1-WqOnI9hAEUZRyboEsnOwxVecQ6btSc16XE-eLvdD7M=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "Upon arrival, I was greeted with warm smiles and quick, efficient service—a promising start. The ambiance was cozy, elevated by the enchanting tunes of a harpist who performed live as I enjoyed my meal. A truly elegant touch that set a serene mood for the evening.\n\nThe Lobster Mentaiko/Cheese was a standout dish. The combination of fresh, succulent lobster with the rich, umami flavors of mentaiko or cheese was a culinary delight. Every bite was an explosion of flavors that left me craving more.\n\nAnother remarkable dish was the Laksa. The rich, spicy coconut broth, accompanied by perfectly cooked noodles and fresh seafood, made this a dish to remember. It’s no wonder laksa is a favorite in Singapore, and Spices Cafe does it justice.\n\nHowever, not everything was perfect. The oysters were, unfortunately, a bit of a letdown. Despite looking fresh and inviting, they didn't sit well with me. I experienced stomach discomfort for a few days after the meal, which was quite disappointing given the otherwise pleasant dining experience.\n\nOverall, Spices Cafe offers a charming dining experience with some stellar dishes and lovely ambiance thanks to the live harpist. The service is commendable, and the majority of the food is delightful. However, I would advise caution with the oysters, based on my personal experience.",
      "time": 1736081373,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6551483903128277331",
  "user_ratings_total": 306,
  "vicinity": "100 Orchard Road, Located in: Concorde Hotel"
}