{
  "formatted_address": "24 Geylang East Ave 2, Singapore 389752",
  "geometry": {
    "location": {
      "lat": 1.318443,
      "lng": 103.8887339
    },
    "viewport": {
      "northeast": {
        "lat": 1.319691930291502,
        "lng": 103.8902092802915
      },
      "southwest": {
        "lat": 1.316993969708498,
        "lng": 103.8875113197085
      }
    }
  },
  "name": "Sri Sivan Temple",
  "place_id": "ChIJz46D4yIY2jERT2ClyKkbF2U",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Umakant Mishra",
      "author_url": "https://www.google.com/maps/contrib/110685561721919319103/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXC353_KXw4w8tKxENFIOB_sgxJZiEF_AJ6LHG44QGAJBqpjrs=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "Sri Sivan Temple is quite a big temple of God Shiva and other Gods. Before 1850 the original Shiva Linga/ Temple was located in Potong Pasir from where it was moved three more times to different places. During second World War part of the temple structure was damaged.  The present structure (1993) is adjacent to Foo Hai Chan Buddhist Monastery at Geylang East avenue 2. 🙏🙏",
      "time": 1720602154,
      "translated": false
    },
    {
      "author_name": "Narendra Mehra",
      "author_url": "https://www.google.com/maps/contrib/112490221553463694651/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJcRIpwTycX5h3Vs6Pm308Jh3iyyeNRrZ6lB8Ma-rX_crZKJv4=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "Peaceful temple in Singapore. Understand, one of the few Shani Devta temples in Singapore. All facilities for puja available on Saturday when we visited. Oil, lamps etc. Nice quiet serene place for worship and meditation.",
      "time": 1705886532,
      "translated": false
    },
    {
      "author_name": "Venkat Astro",
      "author_url": "https://www.google.com/maps/contrib/114436150588721070247/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXoeG4qhRIaTWbTIKWtOrgztzI3Bp_FIySIfDPzO_w6FSx6oJuw7A=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "A beautiful temple in Geylang east.It is abode of lord Shiva and has all deities surrounding him. The temple is in first floor.It is very clean and neat.And temple staff are very friendly.",
      "time": 1661434610,
      "translated": false
    },
    {
      "author_name": "Shankar Rajasekharan",
      "author_url": "https://www.google.com/maps/contrib/110247786263487895553/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWsoqkEYsHi5ih_rYMA2aGkvEPdQ169xCaA3xhU0r3RoDFZf8fs=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "It has been recorded that the Sri Sivan Temple was rebuilt as a solid structure in the early 1850's at the Orchard Road site under which the Dhoby Ghaut MRT station is located. The Sivalinga was known to be worshiped at this site well before 1850. The Sivalinga had moved three times within Singapore once from Potong Pasir to a spot in the lower end of Dhoby Ghaut, then to a site near where MacDonald House Stands today, and then on to the Orchard Road site where it used to be until 1983.\n\nIn 1898, a further phase of the recorded development of the Sri Sivan Temple began. The reconstruction work took several years to complete. One Mr V Nagappa Chetty and his wife were responsible for this, largely with their own funds and from donations collected from local Hindus.\n\nAn order placing Sri Sivan Temple under the Mohammedan and Hindu Endowments Board (set up in 1907) was gazetted on October 18, 1915. In 1968, the Hindu Endowments Board (HEB) was formed to manage four temples including the Sri Sivan Temple.\n\nDuring the Second World War, some of the statues of secondary deities and a part of the temple structure were damaged by shells that landed around it. Towards the end of the war, renovations were made to the temple and a consecration ceremony was held in July 1943. In 1954, the Municipal Commissioners wanted the temple to be setback 14 feet from the road to widen Orchard Road. After long drawn discussions, a compromise was reached between the Board and the City Council. In consideration of the temple giving up 490 sq. feet of the front land, the temple was given $50,000 and allowed to be rebuilt at the same site. Plans to rebuild the temple were drawn up in 1957. Local contractors completed the construction works in April 1962 and skilled crafts men from India carried out the sculptural and ornamental works. The consecration ceremony was held on December 9, 1964.\n\nIn 1983, the Government decided to acquire the land on which the temple stood. An MRT station was to be built underground. Therefore, a transit temple was built next to the Sri Srinivasa Perumal Temple at Serangoon Road while a more suitable and permanent site was being identified. All the god-forms from the Orchard Road Temple were installed in the new site at Serangoon Road which allowed for all daily prayers and festivals celebrated to be continued. The Hindu Endowments Board had intended to make the new temple unique in appearance, features and facilities. The Board and the management committee of the temple consulted well-known temple architects in India. The Board sent a team to study the best of both the North and South Indian Temples. What followed was a unique design with an octagonal structure with a multi-purpose hall and staff quarters. The new temple was built at a cost of $6 million on a 3,000 sq. meter plot at Geylang East. The new site is about four-and-a-half times bigger than the temple's former site at Orchard Road. After ten years of temporary residence at Serangoon Road, the Sri Sivan Temple was consecrated at its present Geylang East site on May 30 1993.\n\nMajor festivals celebrated at Sri Sivan Temple are Vinayagar Sathurthi, Vaikasi Visakam Brahmothsavam, Thirukarthigai, Arudra Dharisanam, Thiruvembavai Vizha, Maha Sivarathiri, Vasantha Navarathiri, Guru Peryarchi, Sani Peyarchi, Navarathiri and Skantha Shasti.",
      "time": 1675603657,
      "translated": false
    },
    {
      "author_name": "S",
      "author_url": "https://www.google.com/maps/contrib/104498040819853039789/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKYx2z8uzmK193ZI7qOifkcTLXldydvXzIel2GnWCAe5647faA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 2,
      "relative_time_description": "2 months ago",
      "text": "Under maintenance and seems main temple is not accessible",
      "time": 1740303438,
      "translated": false
    }
  ],
  "types": [
    "hindu_temple",
    "tourist_attraction",
    "place_of_worship",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7284321338324770895",
  "user_ratings_total": 2483,
  "vicinity": "24 Geylang East Avenue 2"
}