{
  "formatted_address": "820 Thomson Rd, Singapore 574623",
  "geometry": {
    "location": {
      "lat": 1.3420811,
      "lng": 103.8384558
    },
    "viewport": {
      "northeast": {
        "lat": 1.343443280291502,
        "lng": 103.8397297802915
      },
      "southwest": {
        "lat": 1.340745319708498,
        "lng": 103.8370318197085
      }
    }
  },
  "name": "St Anne Mother & Child Centre",
  "place_id": "ChIJC3Q1s4IX2jERAJIHILX_dY8",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Alicia Pang",
      "author_url": "https://www.google.com/maps/contrib/104699108537219529327/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLNc3riVQlcK7UfKxjRrETw4_slkZpv_qA-O_3iigwc21yFiQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "2 months ago",
      "text": "Stayed at st Michael’s ward when I gave birth last year.\nChecked in at 1am for a 7am surgery and husband took about an hour before coming back to the room to rest. Hope admission could be sped up a little especially during the wee hours.\nMost nurses were friendly and really helpful except for one who came across as intimidating and rude. She told us to show her how we were going to pacify baby when baby is crying but it was our first time and expected them to guide us.\nThe food wasn’t that good. Literally tasted like hospital food and the portion is pretty small. Spouse’s food was pathetic. Nothing compared to other private hospitals that even serve lobster for mummies.\nThe service at Parentcraft was good though. Was served by Ms Fonnie for plugged ducts and she was very thorough in her explanation. I learnt a lot from her even though I gave birth more than half a year back.\nHope the hospital could improve on their food choices & portioning before my next delivery as I’d choose to return to the same gynae who delivers only at Mt A.",
      "time": 1740182528,
      "translated": false
    },
    {
      "author_name": "Teacher P",
      "author_url": "https://www.google.com/maps/contrib/113723683563439666504/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWGmvuZw3F2qZrF1VvOY2GlWmKT-R1EWVVvunheaFWkFpAKpdem=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "I birthed two of my kids here. The experience was nothing short of wonderful. This time I'm back at the Pediatric Ward because my son needed to be warded. It's the Mother and Child center / new wing and I am even more impressed than before:\n\n1) Spacious single bedder room was clean and comfortable. Everything is new and modern. The toilet is big and well equipped.\n\n2) Nurses were attentive, on schedule always, and great with my fussy kid. Everything right down to taking note of what my child ate was done meticulously.\n\n3) The staff from the Pastoral Team (Dominic) came by to say hello and check on my child. He was empathetic and friendly. There was no agenda - just a kind check in on both child and parent. I really appreciated that kindness.\n\n4) The staff and nurses at the triage were also friendly and great with my son. Thank you for administering the suppository so swiftly and professionally.\n\nI am thankful to have the privilege of getting a bed and having a team of  professionals tend to my child.",
      "time": 1724636496,
      "translated": false
    },
    {
      "author_name": "Siah Hx",
      "author_url": "https://www.google.com/maps/contrib/103944670556353820143/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK2_4xwTioh5QOxNGusd8ueHlqYq_VbK36m4RccH_DxAWBi0g=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "8 months ago",
      "text": "New wing in Mt Alvernia Hospital. Lobby located at Level 2, Specialist clinics at other higher levels. Basic amenities available on site Washroom, water dispenser (Lobby only), carpark (at a fee and not cheap).",
      "time": 1726799267,
      "translated": false
    },
    {
      "author_name": "Eu L",
      "author_url": "https://www.google.com/maps/contrib/111223111774987330005/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJanof48VjG1Z8oL339fSzw1zedln-qYs9tqAtBmv22M_PO_Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Delivered my first baby at Mt Alvernia. The nurses at St Michael’s ward were patient and compassionate.\n\nSpecial shout out to the nurses who were working tirelessly over the Christmas period (23-26 Dec 2023) and to Nurse Michelle who was helping me with my engorgement issues in the wee hours of the morning when I was feeling extremely down and emotional. Nurse Michelle even came over to check at 2am on 26 Dec to help me massage my engorged breasts for more than an hour till I could see beads of perspiration on her forehead. I was really touched by her act of kindness. Thank you so much. ♥️",
      "time": 1714210310,
      "translated": false
    },
    {
      "author_name": "Tsu Chingz",
      "author_url": "https://www.google.com/maps/contrib/117394048666165388084/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLxcbSh1Gc2F1B72MYpkXhgkeKDeh2gCda0ohsmYJ7duESzNA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "10 months ago",
      "text": "I will not recommend any mothers to deliver here. There is lack of manpower & nurses lack of professionalism. Nurses don’t have empathy for patients & medicine don’t come on schedule. Food was not good too. Nurses don’t feed the baby sufficient milk on time & just assume the breastfeeding, little expressed milk, was enough. It was very disappointing despite this was a new hospital. The only good thing is the hospital is new & quiet. I will highly recommend mothers to go to Thomson medical instead as the service & care given to both mothers & babies were so much better.",
      "time": 1720856722,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10337449673090372096",
  "user_ratings_total": 10,
  "vicinity": "820 Thomson Road"
}