{
  "formatted_address": "682 Race Course Rd, #01-325, Singapore 210682",
  "geometry": {
    "location": {
      "lat": 1.3145844,
      "lng": 103.8559111
    },
    "viewport": {
      "northeast": {
        "lat": 1.315795580291502,
        "lng": 103.8572986302915
      },
      "southwest": {
        "lat": 1.313097619708498,
        "lng": 103.8546006697085
      }
    }
  },
  "name": "Stamford Medical & Dental Centre",
  "place_id": "ChIJA9MYHY0Z2jERXBi3uOdd8Xk",
  "rating": 1.7,
  "reviews": [
    {
      "author_name": "kuso 90",
      "author_url": "https://www.google.com/maps/contrib/109595297313811905153/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJWrnle2AyBGtYsD9kO6fMztqKv3U9UenulJTsiGYBV9-pDZA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "I had a very disappointing experience at this clinic due to the poor attitude and unprofessional behavior of the front desk staff. The receptionist was rude and lacked basic courtesy, which set a negative tone for the visit.\n\nAfter being asked to wait inside, I wasn't informed clearly about when my medication was ready. They called my name without ensuring I could hear it, and when I didn’t respond, they blamed me for not answering. This caused unnecessary confusion and wasted my time.\n\nAdditionally, when the staff mentioned that masks are required in Singapore clinics, I couldn’t help but think that they could have simply asked politely for me to wear one, instead of immediately using Singapore's regulations to lecture me. It came across as condescending, as if they were trying to assert some sense of superiority rather than addressing the issue in a respectful manner.\n\nThis level of service is unacceptable, especially in a healthcare setting where efficiency, clear communication, and professionalism should be priorities. I hope the clinic addresses these issues to improve the patient experience.",
      "time": 1734144155,
      "translated": false
    },
    {
      "author_name": "Shenise Xuan Xuan",
      "author_url": "https://www.google.com/maps/contrib/103370831394504354522/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUUBxJH_HoZG4A32SG9T6i1DoxrA3hf5i0layst5uVmoweFKOD6=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "10 months ago",
      "text": "My helper went there for the extraction by herself as I couldn’t take time off to go with her. I spoke to Dr. Heng on phone, and he explained that my helper’s tooth decay was bad and that in the process of extracting the tooth, it might break and require surgery. I told him to try the extraction first and that I believed in his skill to pull it out without surgery.\nI was busy at work and was shocked to learn that he had performed the surgery without attempting to extract the tooth by pulling it out. No consent (verbal or written) were given to commence surgery.  Although there are special discounts for domestic workers, the cost is still a significant issue for me. Transfer the money to my helper. I told her not to pay first and to stay in the clinic, as I needed to talk to the clinic staff. However, she paid and left instead. This is unethical and against the SDC protocol.",
      "time": 1720577040,
      "translated": false
    },
    {
      "author_name": "Mamun Hasan",
      "author_url": "https://www.google.com/maps/contrib/117958390703010828368/reviews",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK65UMlrTRj65LTzsZ0V29Dm5moLgnizSNk2D0eGziTHSOCLQ=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "8 months ago",
      "text": "",
      "time": 1725255762,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8786907597794383964",
  "user_ratings_total": 3,
  "vicinity": "682 Race Course Road, #01-325"
}