{
  "formatted_address": "1 Kay Siang Rd, Level 11, 10-02, 09-01, Singapore 248922",
  "geometry": {
    "location": {
      "lat": 1.2960465,
      "lng": 103.8157393
    },
    "viewport": {
      "northeast": {
        "lat": 1.297346780291502,
        "lng": 103.8172305302915
      },
      "southwest": {
        "lat": 1.294648819708498,
        "lng": 103.8145325697085
      }
    }
  },
  "name": "Stanfort Academy",
  "place_id": "ChIJM0ny4Skb2jERjKzunro56WU",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Pon",
      "author_url": "https://www.google.com/maps/contrib/117491685479781987210/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXiKsuKsfR_vp1CSEDN_3XLz8H239GIzV9cGq9WA3XuKSGz1xFK=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I have the privilege of attending Stanfort Academy for almost 2 years and I can confidently say that it was an incredible journey. The academy commitment to excellence is evident in every aspect, from the experienced and supportive faculty to the rigorous and comprehensive curriculum.\n\nI studied for my diploma and advanced diploma in hospitality and it helped me grow not only academically, but personally too. I had many opportunities to develop my skills, discover my passions, and build lasting relationships with my peers.\n\nOverall, I am grateful for the experience and opportunities that Stanfort has provided me. I recommend it to anyone  looking for a well-rounded education and a supportive community.",
      "time": 1736392196,
      "translated": false
    },
    {
      "author_name": "Maria Jessica Desullan",
      "author_url": "https://www.google.com/maps/contrib/111432127076542271943/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV4T6ZrNnbh7gybehPMwQd4Fcn4E8ex2OnBoD6tFg5fW8guD8qC=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Stanfort Academy is truly an exceptional institution! The teachers are highly dedicated and passionate, always ensuring that every student reaches their full potential. The curriculum is challenging yet enriching, preparing students for the real world. The supportive and inclusive environment makes learning a joy. I successfully completed two diplomas here, and the knowledge and skills I gained have been invaluable in my career. The school’s programs are well-structured and tailored to real-world applications, which prepared me to excel in my current job at Prive. I highly recommend it to anyone looking for quality education and career preparation!",
      "time": 1736242422,
      "translated": false
    },
    {
      "author_name": "yuming Wu",
      "author_url": "https://www.google.com/maps/contrib/101024393105115474263/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLUr_DDw1nYY-yc0Mlkx2RuBWeWs7kgbZgPaf-Lg-h-ijnCqA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "⭐⭐⭐⭐⭐\nI had an exceptional experience at Stanfort Academy in Singapore! The staff and faculty are highly professional, approachable, and dedicated to ensuring every student succeeds. The courses are well-structured, with a perfect balance of theory and practical application, making learning both engaging and relevant to real-world situations.\n\nThe campus environment is welcoming and inclusive, which creates the ideal atmosphere for personal growth and academic achievement. I was particularly impressed by the support provided to students, from career guidance to extracurricular activities that enhance skills beyond the classroom.\n\nIf you’re looking for quality education with a strong focus on excellence and student development, I highly recommend Stanfort Academy!",
      "time": 1735619034,
      "translated": false
    },
    {
      "author_name": "Armina Khatun",
      "author_url": "https://www.google.com/maps/contrib/115328301758992710897/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLP95vMnA2FA1I2f02w_i0pAoNMQqCHWP3Lcv9wIw2qazHpjK4=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I would like to express my gratitude for the wonderful experience I had at Stanfort Academy in Singapore after 3 years of studying here. The supportive environment, excellent teaching methods and diverse extracurricular opportunities have truly shaped my development, both academically and personally. I especially appreciate the strong sense of community and dedication of the staff. If I could make one suggestion, it would be to expand career guidance and practical learning opportunities to further prepare students for their future. Thank you all for working hard to make my time there memorable",
      "time": 1736868545,
      "translated": false
    },
    {
      "author_name": "Shwe Sin",
      "author_url": "https://www.google.com/maps/contrib/101252173998625914341/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKfUqiQ-ZsqKl5PT5cd9gwSKtMQ9lryoU8R4vIFiFCnmHCAZQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I have been studying at this school for over a year, completing both DBM and ADBM programs. The teachers are incredibly knowledgeable and never fail to reach out their students whenever needed. The staff is warm, welcoming, and always ready to assist with any concerns. The school provides valuable practical experiences outside of the classroom, including visits to expos and industry events. These opportunities not only enhance our learning but also expose us to various career paths and possibilities. In addition to academic focus, the school organizes outdoor activities that help students relieve stress and build stronger connections with one another. My time here has been filled with unforgettable memories, and I am truly grateful for the experiences I’ve gained.\nI highly recommend this school to others, and I’d like to thanks to the entire team at Stanfort Academy for their support and dedication.",
      "time": 1736395624,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7343464141097446540",
  "user_ratings_total": 113,
  "vicinity": "1 Kay Siang Road, Level 11, 10-02, 09-01"
}