{
  "formatted_address": "67 Serangoon Garden Way, Singapore 555963",
  "geometry": {
    "location": {
      "lat": 1.3635935,
      "lng": 103.8653653
    },
    "viewport": {
      "northeast": {
        "lat": 1.364991480291502,
        "lng": 103.8667466802915
      },
      "southwest": {
        "lat": 1.362293519708498,
        "lng": 103.8640487197085
      }
    }
  },
  "name": "Standard Chartered Bank Branch @ Serangoon Gardens",
  "place_id": "ChIJtUwnKgAX2jERD5LYyH2zRPw",
  "rating": 2.2,
  "reviews": [
    {
      "author_name": "E Low",
      "author_url": "https://www.google.com/maps/contrib/113184581174608855994/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXgf7aEJ7DRgfyU3kD6-8FlXnYg486c4bF1vfghfmiJB9G7ac0=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Went in the morning (6/3/25) slightly past 10am. Two counters were opened but one was serving a corporate customer. The staff (counter 1) that served us was very professional and knowledgeable. She knew what forms we required to submit and could guide us thoroughly. The  walk-in experience from beginning to end was seamless and very pleasant. Impressed!",
      "time": 1741242497,
      "translated": false
    },
    {
      "author_name": "eysl um",
      "author_url": "https://www.google.com/maps/contrib/118399347594706326995/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWYB5PBFKGAcfqKg1Z2Qjx60y_07Ot7Of9kooOk7jk-x59KNvXP=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "They have collection of new notes every year and year after year, the service is sloth like. Folks have allocated appointments but are forced to wait super long even though I arrive half an hour early. Was told to come back at 11am on the dot because they haven’t given out queue numbers yet. To my horror, the queue numbers have been given out when i returned at 10.58am. Only one counter manning these appointments and the person manning the counter is super slow. Such job functions need to be replaced by AI, or perhaps a change in name is in order. Slow Chartered Bank is more apt.",
      "time": 1736826118,
      "translated": false
    },
    {
      "author_name": "Greg Ho",
      "author_url": "https://www.google.com/maps/contrib/103583615160449659742/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJrl-8TAujZg5rh6p_ldR--7zVqXGToflL7JzkkxI8FyDsYBg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "Unacceptable Service at SCB Serangoon Gardens Branch\n\nOn 23 Dec 2024 at around 11:30 am, I visited the SCB branch at Serangoon Gardens. The bank was not busy, with only about three customers present. I was issued waiting number 110 and was next in line. Unfortunately, I was not informed when my number was called, and I only noticed it when I saw my number displayed on the screen.\n\nWhen I approached counter 3, I informed the service staff that I wanted to close my account and waive my credit card's annual fee. To my surprise, the staff told me she couldn’t assist and instructed me to call the hotline at 6747 7000 instead. Reluctantly, I called and waited for nearly 20 minutes on hold.\n\nDuring this time, I noticed another staff member leaving for lunch and stopped her to inquire if account closure and fee waivers could be done at the branch. She then spoke to the service staff, who suddenly decided she could process my request after all.\n\nThis experience was both frustrating and unprofessional. I wasted 20 minutes of my time because the staff initially refused to help with something that could have been resolved immediately. This lack of initiative and professionalism is deeply disappointing and reflects poorly on the service standards of the bank.\n\nThis is by far the worst experience I have had with a bank, and I am highly dissatisfied with the level of service provided.",
      "time": 1734942507,
      "translated": false
    },
    {
      "author_name": "Walter Young",
      "author_url": "https://www.google.com/maps/contrib/115076087462306773759/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJP8_TIpr5ZcXF0oW911Ru9FAcIN-0UFLBIHsBRR2KLivnNMQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Was there to closed my account due to personal reason. Staff is friendly and helpful",
      "time": 1746698510,
      "translated": false
    },
    {
      "author_name": "Yew Meng Thong",
      "author_url": "https://www.google.com/maps/contrib/103784853494414377684/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocISKN0Kg566JQK6Fwf-sXgVCKwJwDLXnCXXlmkDYC-0PMHrPw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "When told ‘don’t rush, I’ll help you after your dental appointment’, she and her co worker Erwan could recognise me when I returned 2 hours later.\nAlthough attending to another customer she directed me to sit in the aircon waiting lounge and came back in quick time (that’s 5 star customer service for Irene Look).\n\nIn response to my list of questions, … why I’m receiving monthly statement with credit balance for a cancelled credit card; submit request for ATM card (might have lost in the post); clear my internet banking app which did not recognise my user name n password. Resolving the above reflect her efficiency, knowledge of bank’s product n system, with good listening ability to my needs (more 5 stars?) are Irene’s willingness to run a second mile for a customer.",
      "time": 1726235248,
      "translated": false
    }
  ],
  "types": [
    "bank",
    "finance",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=18177851348796084751",
  "user_ratings_total": 59,
  "vicinity": "67 Serangoon Garden Way"
}