{
  "formatted_address": "3155 Commonwealth Ave W, #04-16/17, Singapore 129588",
  "geometry": {
    "location": {
      "lat": 1.3147266,
      "lng": 103.7641762
    },
    "viewport": {
      "northeast": {
        "lat": 1.316345780291502,
        "lng": 103.7659363302915
      },
      "southwest": {
        "lat": 1.313647819708498,
        "lng": 103.7632383697085
      }
    }
  },
  "name": "Standard Chartered Bank @ The Clementi Mall",
  "place_id": "ChIJpfvORo4a2jERiHsUnVhcHbc",
  "rating": 2.6,
  "reviews": [
    {
      "author_name": "Sherry de Guzman",
      "author_url": "https://www.google.com/maps/contrib/109497842978783979148/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVV9BXIyibS2tdQF39t2xHoUyi-P26mUyRPp2YLruxXNMDtdJY=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "I had a very unpleasant experience with staff in Standard Chartered Bank-Clementi branch -Tan Lee Peng Rose. I requested assistance in converting one of my transactions to Easypay, as I couldn’t do it through my online banking app (I don’t know why it wasn’t working this time, as I’ve been able to do it in the past). I asked her to help manually, as I had previously done with my husband’s account.\n\nHowever, Tan Lee Peng Rose was very hesitant and insisted that it should be done through my online banking app. I explained multiple times why it wasn’t working, but she continued to insist otherwise. I explained the issue four times, and only after confirming with her senior did she agreed to assist me. Before proceeding, she once again emphasized that it should be done through the app. I then showed her my phone, and she finally completed the necessary steps.\n\nAfterwards,I kindly told her that she should treat customers politely and not rudely. In response, she sarcastically and rudely told me I should understand her position, since I also work in the service industry, implying that I should understand her stress. I explained that while I do understand the pressures of working in customer service, it is never acceptable to treat customers disrespectfully. She even raised her voice at me. This is completely unacceptable and unprofessional behaviour , and I hope this matter will be addressed.",
      "time": 1741948981,
      "translated": false
    },
    {
      "author_name": "keynes ong",
      "author_url": "https://www.google.com/maps/contrib/108630039012712635412/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLVj6a0QBcmWe2gYseZJ2zNuSiiIFf9xuPJ0DVSfLc-QYon=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "PLEASE READ BEFORE HEADING DOWN TO THIS BRANCH\n\nVisited the Standard Charted The Clementi Mall to exchange for new bank notes for CNY 2025 with my 81 year old grandmother, as earlier in the week her banker had advised her to visit the branch to join a walk-in queue from 11am to 12 noon.\n\nWe arrived at 10:40am and was asked to join a snaking queue of more than 20 elderly folks as they had a walk-in queue specially for clients above the age of 60 years old. Note that if you were below 60, you had to make a booking online to get your new notes.\n\nNo chairs were provided for the old folks and they were asked to stand for more than 2 hours to wait for their turn. I understand that it was the first day of the new note exchange and there was a stream of people who made prior online reservations who were ushered in to the branch upon arrival. They were seated whilst waiting for their turn.\n\nFrom a customer service perspective, this is jaw dropping. It makes no sense that the elderly who have placed their life savings with the bank are treated in such a manner. No chairs or drinking water was provided for the elderly in queue, note that this was lunch time and my grandmother was starving whilst waiting in line.\n\nAfter standing for two and a half hours, my grandmother was very very upset and complained  about the poor treatment towards the elderly. They had no choice and reluctantly allowed us to go in and take our seats in the bank. After three and a half hours of waiting my grandma finally got her new notes which had\n\nI think the management is not managing their customers well and surely they have proven to be most unkind to old folks, branch manager should reconsider what’s the purpose of their role. What a shame!!!! Strongly suggest you close your account with Standard Charted and move to other local banks that prioritises their customers.\n\nPossible resolutions for future branch managers(the current one should just resign):\n\n1) Chairs for the elderly\n\n2) Water for those who are waiting in line\n\n3) Priority queue with dedicated counter for elderly above 60\n\n4) ATMs repurposed for the distribution of new notes during CNY period",
      "time": 1736834095,
      "translated": false
    },
    {
      "author_name": "Shavon",
      "author_url": "https://www.google.com/maps/contrib/115872335218953607659/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUDN3l2Ua5hJKYufz9dD_MlNhwTVBX_bJiT-vIqnzsfhBxQ7mqAQQ=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Visited the branch to settle some fee issues. Staff Susan Tan was very patient and helpful in assisting. Thank you for your service!",
      "time": 1745055192,
      "translated": false
    },
    {
      "author_name": "John B",
      "author_url": "https://www.google.com/maps/contrib/115053699278515490086/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKNCRHjBOIPaUy1_QmQ32ZMUO0CR9krvWTA44pEwttphA6ZMw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "Lousy branch. The bank guy filled in the form for me wrongly, wasted my time to come down!!! I got to redo again myself and mail it instead.\n\nThe guy at the front service counter was also useless. He kept on played and saw his  phone while answering my question to get queue number..",
      "time": 1735987267,
      "translated": false
    },
    {
      "author_name": "Edwin T",
      "author_url": "https://www.google.com/maps/contrib/106177319684867048767/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJuhQEzytCAbJpc9S9_eRwuvRGGBe11UXqZpkrsUQNk8jbLjw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "9 months ago",
      "text": "I was at StanChart Clementi Mall Branch on Sunday 11 Aug. As my Debit MasterCard had been retained by the ATM, I approached one of its staff to retrieve it. The staff identifies himself as Wayne without showing his lanyard and even had the audacity to claim to be the manager and customer service staff at various turns (photo of this charlatan is attached for reference).\n\nOn retrieval, despite identifying the card number and my name on it, Wayne claimed he could not hand it over as he needed my ID to verify that card belonged to me (absurd enough as it is given there was only one card retrieved in that instant). Nevertheless, giving this charlatan the benefit of the doubt, I proceeded home to retrieve my ID.\n\nWhen I returned with my ID later that day, the charlatan then suggested my card was retained because it was damaged (utter load of tosh given I had input my PIN before the card's retention) and the bank had to retain it to destroy it.\n\nWell, if so, then why suggest the ID was the only verification required for the return of this card? Regardless, it's even more harrowing StanChart's staff are at liberty to retain cards even after verifying the customer's identity. What odds this charlatan would not misuse this card?\n\nWhen I asked to see the manager, this charlatan then claimed he was the manager. Well, such an obnoxious and pompous pathological liar certainly deserves some airtime - I'd suggest you think twice before approaching the charlatan in the photo if you ever use the services at this branch. Presumably, he will claim to be the CEO next.",
      "time": 1723657773,
      "translated": false
    }
  ],
  "types": [
    "bank",
    "finance",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13194804018927664008",
  "user_ratings_total": 42,
  "vicinity": "3155 Commonwealth Avenue West, #04-16/17"
}