{
  "formatted_address": "67 Ubi Ave 1, Singapore 408942",
  "geometry": {
    "location": {
      "lat": 1.3241365,
      "lng": 103.8929176
    },
    "viewport": {
      "northeast": {
        "lat": 1.325780780291502,
        "lng": 103.8941240802915
      },
      "southwest": {
        "lat": 1.323082819708498,
        "lng": 103.8914261197085
      }
    }
  },
  "name": "StarHub",
  "place_id": "ChIJO-QWoh8Y2jERfilekzN9b5E",
  "rating": 3.5,
  "reviews": [
    {
      "author_name": "Ab Ba",
      "author_url": "https://www.google.com/maps/contrib/106608970598790039747/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKjkPaVExNpD-WHlN0nhH3TPi11B0a2IT4HXW2plbbThbPUBg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "My home wifi broke down 2 days ago and I called starhub to get it fixed. The technical service said they will call back soon. They never called back, instead, I got an sms saying that there will only be a call back the next day. Today, I got a call at 11.30am, with the person only notifying that I will get ANOTHER call back tomorrow afternoon. He only called to notify me that they will call back again tomorrow. When I asked, he said no one will come over to fix the wifi. I am very shocked and disappointed at starhub’s service. Will not be using it anymore.\n\nI have been enduring the terrible home wifi for the past few years, it is shocking how terrible their service is too. Do not use starhub.",
      "time": 1744947359,
      "translated": false
    },
    {
      "author_name": "Kevin Tan",
      "author_url": "https://www.google.com/maps/contrib/116854717343072457693/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKbhlN0DMB91CY2ugzGoCE2WSShLx_HQ5ZV9HYmKz2v5dtZvg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "If you think Singtel was bad. StarHub is even worst. Broadband down for 3 days and counting. No wifi, no StarHub TV, cannot work or study at home. Consistent with other negative feedback called 1633 and it took so long to arrange an appointment. When the hub trooper finally showed, issue not solved and then have to repeat the entire process all over again to make another appointment. Seems like they struggled with their internal process. Called them 8 times over the last few days and issue still not resolved and they seems nonchalant about the situation. Very frustrating to deal with this “non”service provider.",
      "time": 1746715277,
      "translated": false
    },
    {
      "author_name": "Adelia Tan",
      "author_url": "https://www.google.com/maps/contrib/100367122173265246202/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJmUAByxtSJrsejGZbAHYN4L6vJSOTaI-QToiM7fgRPsS8F_w=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "29 Mar 2025 - 0 stars if possible...\n\nMany unhappy incidents over service disruptions & poor customer service during the many years I've been a Starhub TV customer.\n\nThe most recent one happened yesterday 28 Mar 2025. TLDR; Was watching TV when suddenly the setup box lost connection at about 1.30pm, turned off power, removed & replugged cables/power cords, re-started the box, went to check the nucleus connect (internet) modem under Starhub TV and noticed the Loss of Signal (LOS) light blinking red. Unplugged, replugged, switched off and on both that modem & the DT Link router, and the LOS was still blinking red. So either it's a signal issue or modem not working.\n\nEnded up calling 1633 for technical assistance at about 2pm. Staff instructed to turn off n on the modem, which I did one more time, while they rebooted the system from their end, but still the same, says it's not a signal issue. Staff determines it's a problem with the modem n requires a technician to come & check/replace modem as necessary. There are charges of $50+ (technician's visit) plus $30+ (transportation fees) that will be charged, charges to be waived if it's actually a faulty modem. So ended up making an appointment to have a technician visit & solve the issue ASAP. Appointment made for 30 Mar.\n\nAt about 9pm+, I plugged back & restarted the modem again & guess what?! No more LOS blinking red and able to watch Starhub TV again. So obviously, it's not a faulty modem issue.\n\nEventually called 1633 again today at 2.30pm, to cancel the technician appointment which is no longer required, as cancellation/change of appointment can only be done via their APP or hotline. Why not have this option available on your online page via the web browser as well??!! Called 2x as the 1st call that got connected to agent Alex, there was no response/reply after he mentioned his name & I kept on hold for 1min trying to see if he can hear me.  Had to hang up, call again. At least managed to speak with another agent Rus, who was responsive & helped to cancel my appointment, after checking the report from my call yesterday, which wasn't accurate, indicating the problem was with my setup box, which wasn't the case. With some further information given that there's some Internet problem. So with a less than accurate initial report keyed into their system, who knows what's the actual problem?!\n\nAnd only after speaking with Rus and giving him feedback/complaining about the various issues not being properly rectified & prevented after sooooooo many years of using their TV services (+ APP/Technical Team/Customer Survey via SMS, etc), he revealed that there was actually a signal loss issue yesterday which they realised somehow (dunno when but definitely not before my call yesterday) & he had been informed by his team leader. Which meant I would have been charged if I didn't cancel this appointment to come check/change my supposed faulty modem!! Which is outright unfair to the customer.\n\nIf I didn't have a preference to watch TV in the format where it doesn't buffer & stream like on the Internet, I would definitely save my money & not pay for Starhub TV subscription!!\n\nStarhub, if you don't pay attention to your service standards, which are lacking, you will eventually lose even customers like me who hate the hassle of losing their TV-watching enjoyment!!",
      "time": 1743238620,
      "translated": false
    },
    {
      "author_name": "Pearlyn",
      "author_url": "https://www.google.com/maps/contrib/117319359769498054744/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL8BXRBtOEjSrecRnEhyHyUDqcKF3IuUZ5JlpMMZ3E_0y_ynA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Give negative star if possible!!!!!!! Horrible service. Wifi nt working. They said the earliest appt is 5 days later. But did not state black & white that there will be transport and technical cost. Saw $60 extra in our bill. The technician came and found out that our modem spoilt but we are covered under warranty so why is this our problem to fork out transport cost etc. It's your god damn duty to deliver the service within the contract. If your modem is so unreliable thats nt my prob. Promised to waive the charges over the phone but still charge in the bill. Then promise to waive off in the next bill which they did but end up charging us for late payment fee. Seriously, use your brain. No wonder you are losing customers.",
      "time": 1744956455,
      "translated": false
    },
    {
      "author_name": "Pavel Krot",
      "author_url": "https://www.google.com/maps/contrib/113791698762733086617/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWCcgLWFEWfGQXLEofSC_n-bH46DyBlqRvjMM0WudmSmqqlJLNs=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "StarHub’s 5 Gbps broadband plan is advertised as ultra-fast, but the equipment they provide (TP-Link EX510 router) only supports speeds up to 1 Gbps. This means customers pay for a premium service they can’t fully use—essentially overpaying for a fraction of what’s promised.\n\nWhat’s worse is their customer support. For nearly a month, I’ve been passed between agents who either lack basic technical knowledge or refuse to take responsibility. Calls are repeatedly scheduled and then ignored, or they ring at random times without warning. When I finally escalated the issue, they agreed to send a technician to replace the router — **but now insist I pay for it**, even though their equipment is the problem.\n\nThe fix is simple: Replace the incompatible router with one that supports 5 Gbps speeds—at no extra cost. Instead, they’ve chosen to waste my time, test my patience, and now expect me to foot the bill for their mistake.\n\nIf you value your time and sanity, avoid StarHub. If you do sign up, demand written confirmation that their equipment matches the plan’s speed—and prepare for a battle if issues arise.",
      "time": 1743326494,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10479732518383659390",
  "user_ratings_total": 431,
  "vicinity": "67 Ubi Avenue 1"
}