{
  "formatted_address": "18 Marina Gardens Dr, #02-03 Gardens by the Bay, Singapore 018953",
  "geometry": {
    "location": {
      "lat": 1.2826201,
      "lng": 103.8653945
    },
    "viewport": {
      "northeast": {
        "lat": 1.283587730291502,
        "lng": 103.8669054302915
      },
      "southwest": {
        "lat": 1.280889769708498,
        "lng": 103.8642074697085
      }
    }
  },
  "name": "Starbucks Gardens by the Bay",
  "place_id": "ChIJLz-PTTkZ2jERibCYxz-HkkA",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "Joydip Sinha",
      "author_url": "https://www.google.com/maps/contrib/101100381196038602735/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWO0Tz-tWCORr1VGgScRyt6eMDdjcCSppZU3OEuU_fkL4LSDkum=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "7 months ago",
      "text": "Reasonable set of food and drink offerings at a convenient location close to the Gardens by the bay. The breakfast set menu is good. Staff are generally helpful but appear a bit less in detail when some enquiries are done. Overall a reasonable food experience and good ambience.",
      "time": 1729421634,
      "translated": false
    },
    {
      "author_name": "Toon Tran",
      "author_url": "https://www.google.com/maps/contrib/102078641965155497930/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWZj_ozK67YD0vUUpBQSjRzrxoJndFacBNmoJa0ee-_aRn9sWCk=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "Starbucks at Gardens by the Bay is not just your average coffee stop; it’s a refreshment haven perfectly placed within one of Singapore’s most stunning attractions. Whether you’re a weary traveler looking to recharge or a local in need of a quick caffeine fix amidst natural beauty, this Starbucks location has you covered.\n\nThe café itself is designed to match the aesthetic appeal of its surroundings, with modern, comfortable seating that invites guests to relax and soak in the lush, green views. The floor-to-ceiling windows offer a panoramic view of the vibrant garden life outside, making it an ideal spot for those who appreciate both good coffee and great landscapes.\n\nAs expected from any Starbucks, the menu includes a wide range of their signature beverages, from rich espresso shots to creamy frappuccinos, alongside a selection of snacks and light meals. The quality of the coffee is consistently good, providing that familiar taste that Starbucks fans love and rely on.\n\nWhat sets this location apart is its atmosphere. Situated in the heart of the Gardens by the Bay, it provides a serene escape from the tropical heat with its cool, air-conditioned interior. It’s a fantastic spot to plan your garden exploration over a cup of your favorite brew or unwind after a long walk through the iconic Supertrees.\n\nService here is fast and friendly, with baristas who greet you with a smile and serve with efficiency, even during busy periods. With its prime location, excellent service, and consistent quality, Starbucks at Gardens by the Bay is more than just a coffee shop—it's part of your Gardens by the Bay experience.\n\nWhether you’re looking for a quick coffee to go or a place to sit back and relax, Starbucks at Gardens by the Bay adds a delightful twist to your garden visit with its superb blend of nature and comfort.",
      "time": 1730589685,
      "translated": false
    },
    {
      "author_name": "DAFFODILUK",
      "author_url": "https://www.google.com/maps/contrib/106554697224261164876/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX9caPmdgXuf9TFzeZnkWTnZmWrjiN-sEaSEauyvhkpDVi5oQAL2A=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "My favourite Starbucks drink is Java Chlp frappuccino but today's drink does not taste good at all. It lacks in flavours, just sweet and cream taste only. So disappointed.",
      "time": 1742295170,
      "translated": false
    },
    {
      "author_name": "Tâm Anthony",
      "author_url": "https://www.google.com/maps/contrib/103276245302747623908/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVT5_P2X5ru9YGPt_nh_P5iP8zC8dDRvrkSr-1ibEy44VqZandQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "The worst Starbucks ever!\n\nI dont know why Starbucks still runs this business in one of the most popular attractions like Garden by the Bay!\nThe staffs are literally ruin this place with zero welcoming, didnt give a freaking care to our orders, talked loudly to each other, tossed left over to the sink violently which shocked us!\n\nPlease do something or just basically remove the Starbucks sign to avoid disparaging the brand!",
      "time": 1736777307,
      "translated": false
    },
    {
      "author_name": "Florenz Ng",
      "author_url": "https://www.google.com/maps/contrib/102663634408630669268/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXlTCOgB3gLYY6tRRVXXApa_Wx_0Soa4LACwTcjeFoC5oJsxscn=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "Step into this store and you feel the most welcoming service. Having a good coffee here with a beautiful view. Fullest stay well when the feelings is nice in this Starbucks. Will be coming back soon. Thank you and keep up the good job.",
      "time": 1722336783,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4652930073028505737",
  "user_ratings_total": 237,
  "vicinity": "18 Marina Gardens Drive, #02-03 Gardens by the Bay"
}