{
  "formatted_address": "100 Tras St, #01 - 05 100 AM, Singapore 079027",
  "geometry": {
    "location": {
      "lat": 1.2744615,
      "lng": 103.8433528
    },
    "viewport": {
      "northeast": {
        "lat": 1.275810180291502,
        "lng": 103.8446791302915
      },
      "southwest": {
        "lat": 1.273112219708498,
        "lng": 103.8419811697085
      }
    }
  },
  "name": "Starbucks 100AM",
  "place_id": "ChIJvUUHX2sZ2jEROBCal8aaKLE",
  "rating": 3.8,
  "reviews": [
    {
      "author_name": "Mason Tay",
      "author_url": "https://www.google.com/maps/contrib/108195777674730720034/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI3l4pFW9WlEHgxW0gH_IGJEwq0L2xp6TODRlTJg0TN4nYP7g=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I’ve always liked this Starbucks outlet at 100AM Mall and have visited many times over the years. While the space isn’t very large, it has a cosy charm—especially when it’s not too crowded. The baristas here are consistently friendly and helpful. Big thanks to Zhao for the great service!\n\n19 Feb – It’s exciting to see new items hitting the menu. I absolutely loved the Strawberry Mochi Cream Blossom Frappuccino—super tasty and refreshing!\n\n14 Apr – Really thrilled to see an innovative concept brewing here. I tried their new caffeine-boosted coffee and it gave me just the right kick—felt great afterward! I’m also in love with their new cup design, featuring their signature green in a lighter, fresher tone. It definitely makes my day feel a little greener!\n\nThank you Ridzal for the warm and polite service 😎\n\n17 Apr – I’m a coffee person and never thought I would try anything from the Starbucks Snoopy series—but I gave the Joe Kind Snoopy Chocolate & Caramel Oatmilk Iced Latte a shot. Honestly, it didn’t taste too different from a regular latte, aside from the creamy chocolate topping and the cute Snoopy chocolate tag, which added a slightly sweeter touch.",
      "time": 1744892993,
      "translated": false
    },
    {
      "author_name": "diana ho",
      "author_url": "https://www.google.com/maps/contrib/107842625058786862964/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL8K5eZlYBWR_s6Vyp77pI0S7zldWajwf1aw7PQHHONdhM-Ag=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I wanted to take a moment to express my appreciation and thank you for the outstanding service I received during my visit to Starbucks 100AM today.\n\nBeen served by a staff member name Peter . His friendliness, kindness, and positive attitude customer service truly made a great experience of customers feel a pleasant atmosphere.\n\nThank you again for making my visit such a delightful one. Keep up the amazing work!\n\nWish you continued success! Keep up the fantastic work!",
      "time": 1742904428,
      "translated": false
    },
    {
      "author_name": "Feinn !",
      "author_url": "https://www.google.com/maps/contrib/115858937955729013103/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXE-iaahqERXdkgulhq8_LHtFdZXsC0eRg6Ym2A7hh-Lk9nA_5p=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Huge appreciation to the best Starbucks barista ever (a Chinese boy)\n\nAmong all the branches I have visited, your service is the best！!",
      "time": 1744708314,
      "translated": false
    },
    {
      "author_name": "yuki ang",
      "author_url": "https://www.google.com/maps/contrib/102462842500925212762/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX1qklVkJgJC2775SLCKU8tWpFqZjAGm3tPentKAIm-eyf2CujB=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "the drinks were up to standard! but was disappointing about my visit was the way one of the staff was being treated by another staff.\n\na female staff was lecturing a male staff on how he couldn’t get the recipe for some of the drinks right in mandarin in a very unpleasant tone, and it was loud enough for me and my entire group to hear. at first it was tolerable because we thought it was over after the first time, but she continued to scold him frequently for the whole maybe 3 hours i was there? i was trying to get some work done and it was quite distracting, i had a hard time focusing because she was literally scolding him behind the counter and i’m pretty sure the whole starbucks could hear her.\n\nmaybe it’s true that he can’t remember the recipes and he could do his job scope more accurately, but it was ironic that she stressed that “how can you be serving these drinks to our customers” when i feel as a customer she was affecting my experience way more than having 4 pumps of syrup instead of 3 if you ask me. and in fact the male employee was extremely nice and yes recipes are important, but i think that attitude matters as well.\n\nas someone who’s worked in f&b before i understand that she might want to aim for perfection, but i don’t think this is the way she should be treating other employees regardless of their abilities, ESPECIALLY right behind the counter.\n\nanyway if you’re the guy reading this, i hope you are not too affected being shouted at like that in front of everyone and if you’re the girl, come on read the room sister if you want to continue working there 😭 spare a thought for all of us please 🙏",
      "time": 1743417126,
      "translated": false
    },
    {
      "author_name": "J** S***",
      "author_url": "https://www.google.com/maps/contrib/100474126234692378324/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJRPFMUVXlwO-IIkHUfcOIVNEHyRfZ4rrdyPq6t6W8VU39AIg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "Afiq, the barista from the Starbucks outlet located at 100AM, was very polite and served with a positive attitude. 👍🏻👍🏻It was impressive how he keeps track of the orders of regular clients. I will definitely visit again! 👍🏻👍🏻",
      "time": 1721111513,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12765623321519329336",
  "user_ratings_total": 190,
  "vicinity": "100 Tras Street, #01 - 05 100 AM"
}