{
  "formatted_address": "11 Changi Coast Walk, Singapore 499740",
  "geometry": {
    "location": {
      "lat": 1.3160615,
      "lng": 103.9774041
    },
    "viewport": {
      "northeast": {
        "lat": 1.317630580291502,
        "lng": 103.9786429802915
      },
      "southwest": {
        "lat": 1.314932619708498,
        "lng": 103.9759450197085
      }
    }
  },
  "name": "Stella Seaside Lounge",
  "place_id": "ChIJL9EqqjAj2jERtpYeN4Ku0CQ",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Loh Ricky",
      "author_url": "https://www.google.com/maps/contrib/105538701864779732018/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWz0qjSXYKJs3LPvkmfWi5SeUCRs6DjDuIj3D6vu8uK-t-6l_XS=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Very rare restaurant in Sg that can have such a beautiful seaview for dining, the place is well renovated and very classic.\nThere is a pool that can swim and also different chairs setting for selection.\nThey are shelter and open-air dining area, so no issue for people who prefer air-conditioning dining experience.\nPet friendy restaurant, food wise not bad.\nWe had smashed beef burger and seafood linguine, very nice, and portion is reasonable.\nWill be back to support this restaurant.\nBest to call for reservation as dinner time the place will be pack, best time to come ard 5.30pm to take nice photos.\nThe view of plane desending is very nice.",
      "time": 1744321228,
      "translated": false
    },
    {
      "author_name": "Alexandre Yeoh",
      "author_url": "https://www.google.com/maps/contrib/105525343007754662187/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJS6VvsKYBhA9_rTEXqeun1vT2ZSF6hN2cpLEsbTe6KoECVkA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Had a great dinner at Stella Seaside Lounge on a cool and windy evening. It’s a chill spot tucked along Changi Coastal Road, with good food for the price and quick service. It wasn’t too packed, but had a nice buzz. The house beats, pool, and sea view gave it serious Bali vibes. Would come back again.",
      "time": 1746399230,
      "translated": false
    },
    {
      "author_name": "Divya Tewari",
      "author_url": "https://www.google.com/maps/contrib/104832952654803947331/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXlAkgqXneRfNYVW5Fj7IKbBq53n9YtAjAVEM8eMrSP8hgh-Er0=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "We really enjoyed the food as well as the ambience. The drinks were good, i would recommend the mango margarita. Fish tacos and mushroom pasta were very good as well. It's just that getting a cab back was difficult, but the restaurant people helped us call the cab. So overall, I would highly recommend this place.",
      "time": 1746277948,
      "translated": false
    },
    {
      "author_name": "YY",
      "author_url": "https://www.google.com/maps/contrib/110326367700732433892/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLir0f2WUXBkEQNiRZuG-m-xB9ehF1FsfDHIyVUn5v_irWYWnU=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "2 weeks ago",
      "text": "First of all the place has unbeatable ambience. If you drive (really hard to get here by public transport...) or take a grab here, you'll see what I mean. You are eating by the sea or almost above the sea, hearing the waves splash and watching surfers (if you come in the day) glide across the water. Really relaxing and great for conversations.\n\nThe food looks good but tastes...well... I tried the seafood stew. It was bitter and strange. My friend tried the pasta which was average and a bit sweeter than normal. Sweet potato fries were average, not soggy. A coke costs $6.\n\nI suppose most people don't come here for the food anyway, but it would be nice if it was a bit better.",
      "time": 1746347122,
      "translated": false
    },
    {
      "author_name": "Justin Ngien",
      "author_url": "https://www.google.com/maps/contrib/115948827199432222428/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU0_3xE5j1dqJH69hUjD-b5-AAhEziL6ETqjgYz7duobXLfXrmm=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "We used to dine frequently at Belly View until it closed down a couple of years ago. Since then, we hadn’t really returned to the area. The last time we visited was at least once in 2022, after the place had undergone a major revamp some years prior.\n\nFor my significant birthday, my better half’s family hosted a celebration at Stella Seaside Lounge. I was pleasantly surprised—it turned out to be more of a beach club, reminiscent of those in Sentosa. The atmosphere was fantastic, with a relaxed, family-friendly vibe rather than the adults-only feel of some other beach clubs.\n\nThe music wasn’t overly loud, and we saw plenty of families with kids, even some with their pets. The sea breeze that day was just right—cooling without being too strong.\n\nThe food was decent, though a bit on the pricey side. But given the setting, I suppose that’s to be expected for a place like this.\n\nWhat really stood out was the service. The staff were attentive and ensured that empty plates were promptly cleared, which made for a more pleasant dining experience.\n\nI’d highly recommend going early—around 5:30 PM—to catch the best of the evening ambiance and enjoy the experience to the fullest.\n\nNote: this is also a pet friendly establishment though certain areas are out of bounds for pets.",
      "time": 1741521049,
      "translated": false
    }
  ],
  "types": [
    "night_club",
    "bar",
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2652812054814955190",
  "user_ratings_total": 2317,
  "vicinity": "11 Changi Coast Walk"
}