{
  "formatted_address": "HarbourFront Walk, 1, B2-K17 VivoCity, Singapore 098585",
  "geometry": {
    "location": {
      "lat": 1.264996,
      "lng": 103.820846
    },
    "viewport": {
      "northeast": {
        "lat": 1.266343830291502,
        "lng": 103.8221634802915
      },
      "southwest": {
        "lat": 1.263645869708498,
        "lng": 103.8194655197085
      }
    }
  },
  "name": "Stuff'd",
  "place_id": "ChIJvaStvFgZ2jERni1LOSYc9MU",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Jelene",
      "author_url": "https://www.google.com/maps/contrib/111572258058449367614/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVL_6FPu2vjZTI6WiFfP647R3Ed0PaeNcDGhyEH7Q47Os7-Hj2qyA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Absolutely unacceptable. I ordered the Chicken Daily Bowl with extra salmon, and it arrived without the chicken. How do you forget the main protein in a protein bowl? I only realized after I got home, and at that point, there’s nothing I can do.\n\nIf I hadn’t added salmon, I would’ve been stuck with a sad, overpriced veggie bowl for $10+. I paid for chicken AND salmon, and I expect to get what I ordered. This is basic attention to detail, and clearly, Stuff’d doesn’t care about getting it right. For a place that specializes in roasted chicken, missing the main ingredient is a huge mistake. I expect better attention to orders and a refund for this mess-up.",
      "time": 1741002924,
      "translated": false
    },
    {
      "author_name": "Jay Lim",
      "author_url": "https://www.google.com/maps/contrib/107602884394312643870/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVM1RkMP7iJwU01tiA1AxdZbb9Mg5RbPSJ40EFk6QzS2FrVsot7=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "Used to always get my regular favourite - chicken kebab + extra chicken for dinner after gym. After the 3-4 months renovation, I was excited to come back to my regular favourite dinner place but unfortunately, I was disappointed. Price went up by a dollar and portion dropped a lot! I didn’t mind a dollar increase as long as portions remained the same but the kebab became so small. Back then, when the Kebab was wrapped in tin foil, the kebabs were much larger (as demarcated by the line I drew in the photo). The kebab was also surprisingly much ‘lighter’ and it felt odd. Hence, I went home to weigh it and it was only 300grams even after paying 2$ for extra chicken meat (how could a scoop of extra chicken be so light?). Back then, it was always at least 350g-400g with the extra chicken. For once, I didn’t feel full after eating Stuff’d’s kebab for dinner. To make it worse, the chicken is much drier now (see my photo). It used to be more moist with some crispy chicken bits that tasted like grilled chicken as it should in a Kebab. Now it tastes like dried shredded chicken with barely any taste (one can tell from the photo).\n\nAs a regular, I am honestly quite disappointed by the drop in standards coupled with the increase in price (@$8.30 for a not filling dry tasting kebab). I was so looking forward to the reopening. I hope this is just an unlucky encounter and might give this outlet another chance. However, if standards remain the same in the next purchase, that would probably be my last order from the store.",
      "time": 1733902193,
      "translated": false
    },
    {
      "author_name": "Ayaka Ayaka",
      "author_url": "https://www.google.com/maps/contrib/114432416588819596211/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK0ZmGVbPjLNEdgF9NwoBfNuvEiMbJ3YV3GHWVReIwbhHbtcA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "See the nachos so dissapoint before i buy have tomato and onion and cucumber now no have and the staff so rude not nice i dont k ow if dont want to work or what",
      "time": 1743601589,
      "translated": false
    },
    {
      "author_name": "bayou tachi",
      "author_url": "https://www.google.com/maps/contrib/114355695874971739911/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU5LN28FOrme9FJvWCltge_H91GqLlyWxY7_DfXJ0X0mNhMfEU=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Ang Mo Kio and this place by far has the worst sizing of chicken kebab. Other places not like this. I asked why it's so small, this staff just laughed at me? Excuse me?\n\nI paid for my food and I saw it was as tiny as heck, onions was put only 3 strands? Sauces only few drops? Keep looking at orders scared not enough ingredients and reduce the amount to get maximum profits is it? 😂\n\nDon't even bother coming back.",
      "time": 1740048912,
      "translated": false
    },
    {
      "author_name": "Artem Moshnin",
      "author_url": "https://www.google.com/maps/contrib/114186673531048387843/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWvlti1ntxFtbwjSEgoSkij50Ksz-3FUWFhWwG5K3k15xyJo1u7=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "The food here is reliably delicious and healthy. I got the burrito bowl with all vegetable toppings, and 5 other. The mash potatoes were really good, paired with the sweet Thai sauce and vegetables. The chicken here always taste great, it has a slightly smokey flavour and is tender and savoury. The food here is worth its price and portion too, would recommend especially if you want a quick take-away meal or snack.",
      "time": 1695438855,
      "translated": false
    }
  ],
  "types": [
    "meal_takeaway",
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14264056870284766622",
  "user_ratings_total": 379,
  "vicinity": "HarbourFront Walk, 1, B2-K17 VivoCity"
}