{
  "formatted_address": "845 Geylang Rd, Singapore 400845",
  "geometry": {
    "location": {
      "lat": 1.3165411,
      "lng": 103.8941781
    },
    "viewport": {
      "northeast": {
        "lat": 1.317986580291502,
        "lng": 103.8958668302915
      },
      "southwest": {
        "lat": 1.315288619708498,
        "lng": 103.8931688697085
      }
    }
  },
  "name": "Sufia's Gallery - Malay Art, Calligraphy",
  "place_id": "ChIJy56weRcY2jER4j0lGxK0RJE",
  "rating": 1,
  "reviews": [
    {
      "author_name": "Nurul Asyiqin",
      "author_url": "https://www.google.com/maps/contrib/104123232163170841414/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ_7TEXUyLrrzwbqJSv9Nb7yKCh4Wwyil-0bd1MRX_id4BqdQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 years ago",
      "text": "We bought ayat frame from Sufia's Gallery. We texted the owner with regards to the printing of the faded ayat and the crack/chip frame. He did not reply but instead bluetick us. We called a few times but no answer. Went to the shop with the frame and he accused us of wiping the wordings with chemical that is why the words faded. We even told him that we whatsapp him and called but did not answer. He said that it is impossible that he did not replied to our text. We showed him the messages and he keep denying. All he does was to talk about akhirat and kiamat to us which has nothing to do with what we were asking. Oh ya! When the frame arrive it was at 9pm and he drill at that time. The frame colour was not even our choice. We called n text him right after he left as we were checking everything thoroughly. And he is so rude to call us 'jahat and kurang ajar' for accusing him. The whole time when we were there he keep on denying and thinks that he is always right. We hope that those who wants to buy from Sufia's Gallery don't waste your money/time going there.",
      "time": 1645948959,
      "translated": false
    },
    {
      "author_name": "Noor Khazenah",
      "author_url": "https://www.google.com/maps/contrib/104695400210169984167/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWidILnsJM5YclZp050uJ6zj2CjWZDgJbbTzJ2L1SJvpCKojzka=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "Ordered my ayat on 18th march . They promised to fulfill my order by hari raya but did not fufil it. I had to call them so many times . The man left me with empty promises. All the numbers were not in use. Out of that 30-50 miss calls he somehow picked up once and gave excuses and said he is going to refund me via paynow . However MIA-ed after.  I went down to the store that day itself to ask for a refund. He was also rude saying \"My order is small and my deposit is only $50\" and also mentioned he didnt know my \"number\" . An order is a order.Why do a business if you cant fufil it right. I checked the google reviews after the incident happened and all of them were true. Pls, do not waste time by visiting this store.",
      "time": 1684598334,
      "translated": false
    },
    {
      "author_name": "Ianzy DJ",
      "author_url": "https://www.google.com/maps/contrib/101570577983010268373/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIY7y-Uk2Ekj0P4_kn739dVlAlMeMd0UpsNXfHv9F0P_-N2Pg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "Requested for a repair as frame was bought from the said shop; from before fasting month, on march, did a deposit of $450 as required by them and they informed will be repaired and done in three weeks and promised to send before Hari Raya, as such we waited (this Che Mat, told us that he will make for us a new piece and take the broken one back) so hari raya came, we made calls to him and so many excuses he gave to us, and then he said the frame was not up to scale to ours, as such, he required us to send our frame to his shop, which we did on our own expense, and informed us that will send to his factory and complete in two weeks, and now it has been 3 months, still no news from this said fella, tried to contact him, guess what, number not in use! even called the other numbers, no avail. This fella always talk to us regarding religion and akhirat and stuff like that but he fails to accomplish a customers order which he promised, from 3 weeks to 3 months is no easy feat. Will be making my way down to the store itself to see if he still exists.",
      "time": 1655183162,
      "translated": false
    }
  ],
  "types": [
    "art_gallery",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10467689423773711842",
  "user_ratings_total": 3,
  "vicinity": "845 Geylang Road"
}