{
  "formatted_address": "21 Choa Chu Kang North 6, #01-22/23/24, Singapore 689578",
  "geometry": {
    "location": {
      "lat": 1.3968375,
      "lng": 103.7466843
    },
    "viewport": {
      "northeast": {
        "lat": 1.398302080291502,
        "lng": 103.7479024302915
      },
      "southwest": {
        "lat": 1.395604119708498,
        "lng": 103.7452044697085
      }
    }
  },
  "name": "Sukiya Gyudon • Curry (YewTee Point)",
  "place_id": "ChIJu1kt8oQR2jERbHG-z11SV90",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "lamei",
      "author_url": "https://www.google.com/maps/contrib/107192851982219582115/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUfIKy0zJmA-W6LraboSVKs7uB5N6D-Lwvk6iYQxFBbYO3OOMoY=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "2 months ago",
      "text": "I recently ordered takeaway and was quite disappointed with my experience. I specifically ordered a dish that included half boiled egg, but when I got home, I realized it was missing. This was a key part of the meal, and its absence significantly affected the taste and overall experience.\n\nAttention to detail is important, especially for takeaway orders where customers can’t check the food right away. I expected better quality control from a place with such good reviews.\n\nI hope Sukiya can improve their order accuracy to avoid disappointing future customers.",
      "time": 1740749473,
      "translated": false
    },
    {
      "author_name": "Jeremy Chong",
      "author_url": "https://www.google.com/maps/contrib/107469174196949866035/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWOBdjkii38cjTKGgFiHR69N1A6qLXBNiF_cHOiTcI5EWmzsZ8=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Food: had the half boiled egg beef yakiniku bowl (M). Portion is just nice for me. The amount of beef is reasonable. The sauce is just nice, not overly sweet or salty. Minus one for the egg, I thought the egg would be served inside as per picture but you have to crack the egg (just nitpicking), would prefer the yolk to be more runny\n\nService: scanned QR code, didn't have to wait long for the meal to come. Side note: if you have to crack the egg, best if there were some wet tissues available (or similar), otherwise make sure you have extra tissues to clean your fingers\n\nAtmosphere: came in alone, almost 8pm, got seated immediately at the counter when I queued. Place is brightly lit. Ample seats available. (Queue is forming now at 815pm)",
      "time": 1744459978,
      "translated": false
    },
    {
      "author_name": "Ryan Foo",
      "author_url": "https://www.google.com/maps/contrib/115205994943468906576/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU042r-KoXhfJoXq80znjJ0_7QOtiWF81VE4zrUMryi8qk5t_Db=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I'm really happy that Sukiya has opened here — it was my comfort food back in Japan, and having it nearby again is a treat. The portions are generous, and usually, a small size is enough for me. The hot matcha tea is excellent, and I typically alternate between that and miso soup. The meal set’s salad is fresh and enjoyable, but the karaage tends to be served cold, which is a bit disappointing since it should ideally be hot.\n\nIf you're mindful of costs, I’d suggest skipping the meal set, but nothing beats a hearty bowl of gyudon. A special mention goes to the spring onion gyudon—it's absolutely amazing.\n\nWhen the store first opened, the service was quite fast. Lately, it has been a bit slower, likely because they're training new staff, so I don’t mind too much. I usually visit slightly after lunch hours to avoid the crowd, which makes for a more relaxed dining experience.\n\nOverall, I'm really glad Sukiya is here, and it remains a go-to spot whenever I crave a comforting bowl of gyudon.\n\n(Please don't close, why do all my fave stalls in Yew Tee keep closing 😭)",
      "time": 1738771836,
      "translated": false
    },
    {
      "author_name": "KasperxP",
      "author_url": "https://www.google.com/maps/contrib/114210666729042004471/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKFYa8MDETS3nPqf21VkxqH_NACB_-eSyAX3lbL1OUdDU0r-jqJ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "I recently tried two extremely mediocre dishes at Sukiya.\nThe first was the Beef Yakiniku Bowl with added Kimchi. According to the description, it features \"Thick grilled beef with sweet and savory yakiniku sauce on top of warm Japanese rice.\" Unfortunately, it tasted more like high-sodium sauce beef served on low-grade Japanese rice. The serving of rice was pathetic, and the flavors were completely unbalanced.\n\nThe add-on Kimchi was a joke - a mere tablespoon for $3.\nThis was stinginess at its finest.\n\nThe Okra Gyudon with Dashi sauce and chicken was another letdown. The menu described it as \"Gyudon with sliced okra. The unique slime coming from okra which contains soluble fiber matches perfectly with our special sauce, giving it a refreshing aftertaste.\"\nHowever, the half-boiled egg was undercooked, with the whites still raw. This was part of the breakfast combination. The special sauce was non-existent, and the dish was bland with no signs of Dashi.\nThe chicken was also gamey.\n\nOverall, I would not recommend Sukiya. The dishes lacked standards, balance of flavors, and skill.\nIt's a try-once-and-never-again experience.",
      "time": 1739970106,
      "translated": false
    },
    {
      "author_name": "Liau Yuan Wei",
      "author_url": "https://www.google.com/maps/contrib/101467908285337699109/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV94YjFZ16DRAb20nT6gtjZRipKeSTZ6wUcpSwu6uS6xARzFIlz=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "I got the new Takoyaki sauce Beef Gyudon bowl set menu with vegetables and ice green tea for lunch. Feel the sauce too strong and make me full very fast. Service very fast and payment process very smooth, simply scan QR code on table to order from online menu and make payment via ApplePay",
      "time": 1744281322,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15949307168226701676",
  "user_ratings_total": 138,
  "vicinity": "21 Choa Chu Kang North 6, #01-22/23/24"
}