{
  "formatted_address": "1 Hougang Street 91, #01-23 Hougang 1, Singapore 538692",
  "geometry": {
    "location": {
      "lat": 1.3754744,
      "lng": 103.8797771
    },
    "viewport": {
      "northeast": {
        "lat": 1.376648230291502,
        "lng": 103.8810278802915
      },
      "southwest": {
        "lat": 1.373950269708498,
        "lng": 103.8783299197085
      }
    }
  },
  "name": "Sukiya Gyudon • Curry (Hougang 1)",
  "place_id": "ChIJpUHKm6AX2jERkrMF0Kavx2I",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "johnnykuochung",
      "author_url": "https://www.google.com/maps/contrib/110803765536711118720/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUIozbWPxugGZODavXWfBzv6f1AhKvSbLwscJ8qwdTiYAac9DJ3=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "5 months ago",
      "text": "It was one of those evenings when I craved something warm and hearty. I headed to Sukiya and decided to try their Teriyaki Salmon Bowl with Beef, a combination that promised to hit all the right notes.\nAfter finding a seat, I scanned the QR code on the table and placed my order easily. Technology definitely makes things smoother these days, so I sat back and waited for my meal.\n\nNot long after, the food arrived. The cashier girl quietly placed the bowl on my table and left without a word no greeting, no “enjoy your meal,” just a quick drop-off. I noticed it, but I let it slide and focused on the food.\n\nAnd the food didn’t disappoint. The teriyaki salmon was tender, flaky, and perfectly glazed, with a sweet-savory balance that melted in my mouth. The beef slices were juicy and flavorful, complementing the rice beautifully. It was simple, comforting, and exactly what I needed.\n\nAt the end of my meal, as I got up to leave, I noticed the cashier girl sitting down again. It crossed my mind that it would’ve been nice if she had said something cheerful, like “Thank you” or “Hope you enjoyed your meal.” Small gestures like that can make a big difference and leave a lasting impression.\n\nOverall, the food at Sukiya was great, and I’d definitely come back for another bowl. I just hope next time, the service feels a little more welcoming because good food paired with a bit of kindness can turn an ordinary meal into something truly memorable.",
      "time": 1734423939,
      "translated": false
    },
    {
      "author_name": "Annie Chua",
      "author_url": "https://www.google.com/maps/contrib/104230266278813538662/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUggNCA8yAHn-aq-Pll-_sYLFwCerelmeWdDyAQfkpFpalWVz1Bdw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "The waitress' name is Naz. She recommended new products to us. She is very nice and helpful. We will definitely come back next time.",
      "time": 1744343227,
      "translated": false
    },
    {
      "author_name": "YL",
      "author_url": "https://www.google.com/maps/contrib/117623755190840857500/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocItirpS_dWu0EHu2BMjDuCi0NzfaTXu2ock0NdmXwt2M1g_fw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "8 months ago",
      "text": "Popular place in HG1 mall. Q was fast hence not a v long wait. Food is consistent and it was tasty. Will definitely visit with my family for a casual meal.",
      "time": 1727017317,
      "translated": false
    },
    {
      "author_name": "Cindy Ong",
      "author_url": "https://www.google.com/maps/contrib/115132799541458923001/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKYncVWd53YeQ2tXgRnGMcnpufoqG7RGuKwjnS2VPxrpjbZ4Q=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "So glad to finally have them in Hougang!\nYou can place your order and make payment via the qr code on the table so that's really convenient. They also accept cash payment at the counter. There's a hardcopy menu provided at the table and that makes it easier for people who have difficulty looking at mobile menus.\nGreat variety on the menu from beef to chicken and unagi. They have korean bibimbap bowls and that is an interesting addition.\nMy favorite were the combo don where you get 2 types of meat for best of both worlds. I usually like adding an additional portion of beef as i find it very worthy for the price and quantity.\nService was awesome, staff were attentive and served complimentary tea shortly after we were seated. Officially my favorite gyudon outlet now.\nRecommend those who would like a delicious, affordable and filling meal",
      "time": 1712396982,
      "translated": false
    },
    {
      "author_name": "Nur Muhammad",
      "author_url": "https://www.google.com/maps/contrib/113491723560637434727/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWlF30cvbDjDSlapMGLabE-sdXnrsArmpjV3ebcx4fCcO02opn1=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Food and service here have been very consistent. Waiting time isn't long. Staff are efficient in carrying out their duties. Food taste is great and consistent throughout mutiple visits. Kudos to the kitchen and service staff for keeping high standards despite being constantly busy.",
      "time": 1725251667,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7117850867071824786",
  "user_ratings_total": 139,
  "vicinity": "1 Hougang Street 91, #01-23 Hougang 1"
}