{
  "formatted_address": "Medini Iskandar Malaysia, 81550 Iskandar Puteri, Johor, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.3966304,
      "lng": 103.6277599
    },
    "viewport": {
      "northeast": {
        "lat": 1.398107430291502,
        "lng": 103.6290635802915
      },
      "southwest": {
        "lat": 1.395409469708498,
        "lng": 103.6263656197085
      }
    }
  },
  "name": "Sunway Hotel Pendas Pool Bar",
  "place_id": "ChIJkdENZAAJ2jERQ2YA9Ys6p04",
  "rating": 5,
  "reviews": [
    {
      "author_name": "자스틴 Justin T'annix",
      "author_url": "https://www.google.com/maps/contrib/111381798583502532553/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW9GPwGgJ_JdiSitrSrhpap6vYdTMvALw66gilLluwLaCa2sBRE9w=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "12 months ago",
      "text": "If you're seeking a serene spot to enjoy a drink, look no further than the Pool Bar at Sunway Hotel Big Box. Situated on Level 1 by the swimming pool, this open-air bar offers a charming and breezy atmosphere that's perfect for relaxation.\n\nThe Pool Bar serves a diverse range of beverages, from aromatic coffees and refreshing juices to expertly mixed cocktails and an extensive selection of hard liquors including brandy, whisky, gin, vodka, and rum. Beer lovers will also find a good variety to choose from. The prices are quite reasonable compared to other bars in the area, making it an attractive option for both locals and tourists.\n\nWhat sets this bar apart is its laid-back and cozy vibe. It's often less crowded, providing a comfortable and somewhat romantic setting ideal for unwinding. The music is delightful and perfectly balanced—not too loud—allowing for conversation. In the evenings, a live band enhances the atmosphere with their performances, adding a special touch to the night.\n\nThe bartenders are friendly and attentive, ensuring you have a great experience. Being part of the Pendas restaurant, the Pool Bar also offers a tempting food menu, so you can enjoy delicious dishes along with your drinks.\n\nOpen daily from 3 PM to 12 AM, the Pool Bar welcomes everyone, not just hotel guests. Plus, there's free parking available, which is a nice bonus.\n\nWhether you're looking for a quiet place to relax after a busy day, a cozy spot for a date night, or just a casual evening out with friends, the Pool Bar at Sunway Hotel Big Box is the perfect destination.",
      "time": 1716594970,
      "translated": false
    },
    {
      "author_name": "Justin T'annix",
      "author_url": "https://www.google.com/maps/contrib/107741685824922315858/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUraetQOJrucNRjzyu666scfEy69ezg7aPvtxKrMYO8gX-PfgFZ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "12 months ago",
      "text": "Located on Level 1 of the Sunway Hotel Big Box, the Pool Bar is a hidden gem worth discovering. Nestled by a swimming pool, this open-air bar offers a refreshing ambiance with a nice view and a gentle breeze, making it an ideal spot to unwind.\n\nThe Pool Bar boasts a comprehensive drink menu that caters to all preferences. From freshly brewed coffee and refreshing juices to a wide range of cocktails, hard liquors like brandy, whisky, gin, vodka, and rum, and a variety of beers, there's something for everyone. The drinks are reasonably priced, especially when compared to other bars in the area.\n\nOne of the standout features of the Pool Bar is its atmosphere. Often less crowded, it provides a comfortable and cozy place to chill. The setting is somewhat romantic, perfect for an evening date. The music is good and sets the right mood without being too loud, and the live band performances at night add a lively touch to the experience.\n\nThe bartenders at the Pool Bar are friendly and attentive, ensuring a pleasant visit every time. As part of the Pendas restaurant, the bar also offers a full food menu, so you can enjoy a meal along with your drinks.\n\nThe Pool Bar is open from 3 PM to 12 AM, and the best part is, you don’t have to be a hotel guest to visit. There's also free parking available, making it convenient for everyone.\n\nWhether you're looking for a place to relax after work, enjoy a casual evening with friends, or have a romantic night out, the Pool Bar at Sunway Hotel Big Box is a fantastic choice.",
      "time": 1716595832,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5667563028854367811",
  "user_ratings_total": 2,
  "vicinity": "Medini Iskandar Malaysia, Iskandar Puteri"
}