{
  "formatted_address": "681, #05-01 Punggol Dr., Oasis Terraces, Singapore 820681",
  "geometry": {
    "location": {
      "lat": 1.4031154,
      "lng": 103.9132209
    },
    "viewport": {
      "northeast": {
        "lat": 1.404539480291502,
        "lng": 103.9144625802915
      },
      "southwest": {
        "lat": 1.401841519708498,
        "lng": 103.9117646197085
      }
    }
  },
  "name": "SuperGenius Preschool @ Punggol, Oasis Terraces",
  "place_id": "ChIJv3Rks0YV2jERUXBROmeCOms",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Charm McC",
      "author_url": "https://www.google.com/maps/contrib/100114145512140725130/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUAm0SsSGkl5wEPqk1-fsTynT0ZJQyXCOILNFbAxV3yLa2c28Qi=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "We loved Super Genius! It was quite a trip from our home but it was all worth it because the teachers prepared my son very well for Kindergarten 2 in a bigger school. Now he is thriving and have changed so much from when we moved here one year ago. I believe that letting him attend Super Genius has immensedly contributed to the progress that he has achieved! We miss you Teacher Wei and all the teachers! Terran is making waves in his new school and reads and write well now! He also speaks Mandarin randomly in the house. Thanks to you all and all your efforts!",
      "time": 1741135756,
      "translated": false
    },
    {
      "author_name": "Louies Tan",
      "author_url": "https://www.google.com/maps/contrib/100157220043933474201/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUXkZsPqF3S7WWFwGJ3P8ZFFjvnVU9icvfwnB6gxn29wx130TRu=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Great preschool for the children!!\n\nWe did a centre tour in 2020 (just before the Circuit Breaker) after visited a dozen of other preschool in the area... we fell in love with the place and their pedagogy immediately!\n\nSuperGenius provides a spacious environment (plenty of rooms and space for the children to move around in their learning journey) with committed teachers whom understands the different needs of the LOs at various stages!\n\nOh, I do have to mention that my LO slipped and fall during the centre visit (minor knock) and was immediately attended to with a ice bag.. after we left, we saw Principle Juvina and her staff examining the scene again and... on the next day, I saw the area revamped with child safe furniture!\n\nSpecial mentions to Teacher Sandy, Nadia, Jolene, Alice, Othman, Miguel and Estelle! They have made my LO's experiential learning journey a positive one!",
      "time": 1631593114,
      "translated": false
    },
    {
      "author_name": "Diana Zulkifli",
      "author_url": "https://www.google.com/maps/contrib/108944880600030015143/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVSw4YMeu6h8e9FwCkcYacQ3weOFT_Efh0Yk4Eq4BHeABnGl_g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "My son has been with the school since playgroup and is now in nursery. As parents, we've witnessed impressive growth in his communication skills, grasp of the alphabet, and basic ethical behaviors. The school fosters positive reinforcement, setting an excellent example. When we're with our peers, the noticeable improvement in his communication and gestures stands out. Despite the higher tuition fees, we wholeheartedly recommend SuperGenius as a solid foundation for his development. The parent-teacher Zoom meetings are beneficial for tracking his progress, and the staff are always cheerful and accommodating during handovers and pickups. Instead of relying on multiple school enrichments, SuperGenius serves as a one-stop platform for ensuring all the basics are met. Highly recommended, Good work Teachers and staff’s! 👍🍍🍍👍",
      "time": 1723774039,
      "translated": false
    },
    {
      "author_name": "Jasline Ng",
      "author_url": "https://www.google.com/maps/contrib/115128703732960816849/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIK6kaRlzCO7lZ5TVeyzVSVvRR2M7DX0oquhE0N7sPwfxOInQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "My girl has been attending different enrichment classes at SuperGenius since a year ago! The enrichment center is bright and clean and with great facilities. I like their teaching style and my girl is enjoying herself very much. She learns alot through play, learning the different alphabets with real items eg. Fish, Egg etc.",
      "time": 1648271318,
      "translated": false
    },
    {
      "author_name": "Dan Li",
      "author_url": "https://www.google.com/maps/contrib/109917758512199325059/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVVuSfObZg5RCCRjbp0efXylH1xLFsmLIRQwu_eZ_6jftQUhsc4=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "I seldom make right decision in my life but sending my baby daughter to SuperGenius is one of the exception. Before we join here, we already look for a few places and here’s environment I can say it’s the best compare to the area nearby. Principal Juvina gave us a warm welcome and host the virtual tour efficiently. Teachers are also professional to take care my baby. From the daily care/physiological needs to the course(vision/cognitive learning) they teach so that my little one can have a well development through these learnings. Highly recommend this institution to all parents.",
      "time": 1647559694,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7726631490579165265",
  "user_ratings_total": 38,
  "vicinity": "681, #05-01 Punggol Drive, Oasis Terraces"
}