{
  "formatted_address": "39 Linden Dr, Singapore 288712",
  "geometry": {
    "location": {
      "lat": 1.3323978,
      "lng": 103.8016616
    },
    "viewport": {
      "northeast": {
        "lat": 1.333667530291502,
        "lng": 103.8029960302915
      },
      "southwest": {
        "lat": 1.330969569708498,
        "lng": 103.8002980697085
      }
    }
  },
  "name": "Swallows and Amazons Kindergarten",
  "place_id": "ChIJhe1fL5cQ2jER53JHJ_HZkpg",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Kim Ngo Woodward",
      "author_url": "https://www.google.com/maps/contrib/117693588567986359706/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWbjTdnwKNC3nzrE5F98VXqAzsStbF3CvEpA7amK86XD3FMemSY=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "Such a beautiful school with amazing teachers (highly experienced, lots of master’s degrees). Their reading program works - I am a mystery (parent) reader for N2 and K1 and I see kids sounding out words or reading them as I do.\n\nSuch a warm and welcoming environment - kids love it here. My daughters love going to school and learning is fun at SAA. And when learning is fun, it’s easier to remember and use in real life. They also provide an environment that help kids build relationships with peers and adults, increased confidence and individuality.\n\nThe class rooms are beautiful - filled with natural light. Beautiful outdoor space and playground. There’s an open door for parents to come in to see how kids learn and engage. Additionally, ALL the teachers are amazing. They send you nice notes about your child’s growth and ongoings.\n\nI highly, highly recommend  Swallows and Amazons.  I wish I found the school earlier. ❤️❤️❤️",
      "time": 1716960670,
      "translated": false
    },
    {
      "author_name": "Minna Kalenius",
      "author_url": "https://www.google.com/maps/contrib/112662908049322497806/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWLQH87KtxNpCweliQKzSppNIOxOnermpo-H65wkqsg4XU6Y4r6=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "Wonderful place, wonderful staff. Both of our children started here when they turned two. We could trust they were well taken care of and learned all essential skills before entering \"the big school\".\n\nThey left for S&A with happy faces every morning and came back in the afternoon eager to tell what they have learned that day. After two years they both spoke fluent English and could enter the normal class at school with no need for help with English language (we are not native speakers).\n\nThey both have fond memories from S&A and still after many years remember their teachers.\n\nI can warmly recommend S&A to anyone who's looking for preschool for their children.",
      "time": 1717878646,
      "translated": false
    },
    {
      "author_name": "Nikita Erpineni",
      "author_url": "https://www.google.com/maps/contrib/116114977273229110514/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKxxgUKqyvb5puSDAjdJO0JjiYVBbXMVS-avPhIjmEbNKyfPJo=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Lovely school that gets you an instant feeling of trust and care. The teachers here know how to manage young kids that come with a wide range of personalities. I have seen my son go from being loud to now being sensitive and playful.",
      "time": 1733812298,
      "translated": false
    },
    {
      "author_name": "Aparna Asrani",
      "author_url": "https://www.google.com/maps/contrib/116199789192192785148/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLTRZd9LTnQ821tVjf2JGnSzC8rI8PwE8XOOQ-RkIQcom8W2A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "Our journey with SAA began in 2018 when my older daughter attended her first summer camp there. She absolutely loved it and asked to go back every holiday since then. As an educator myself, I immediately felt a sense of joy and contentment when I first walked into SAA. The school exuded an inclusive atmosphere with warm and welcoming staff members, and a beautiful outdoor play area. Our younger daughter has been going to SAA for two years now, and it gives us such relief to know she is in great hands year after year.\nThe teachers welcome every child with warmth and love each morning, and her homeroom teachers have instilled a love for learning in her. The school also strongly believes in building school-home partnership, frequently inviting parent volunteers and organising field trips and fabulous events such as Mother's Day, Sports Day, and Graduation. We are very grateful to have found such a wonderful school and teaching community for our girls.",
      "time": 1717817152,
      "translated": false
    },
    {
      "author_name": "Zara Linehan",
      "author_url": "https://www.google.com/maps/contrib/114949332802995416205/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKIzKWc6IMVjnjlHyRNK-0u9mEISUQLJGJhKG2p5Rn67YggDg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "Both my children have passed through Swallows and Amazons and I could not have wished for more for them.\n\nI have a daughter and a son with very different personalities and each was nurtured and championed in a supportive caring environment. There is a strong emphasise on providing the kids with a fun learning space to develop their EQ as well as their IQ, in contrast to the many other pre-schools we looked at.\n\nJackie and her staff have a genuine love for the children and their work. I highly recommend Swallows and Amazons if you are looking for a team to help your child grow into an happy, academically strong, developmentally rounded individual.",
      "time": 1717957960,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10994089270134141671",
  "user_ratings_total": 20,
  "vicinity": "39 Linden Drive"
}