{
  "formatted_address": "127 Plantation Cres, #01-05 Plantation Plaza, Singapore 690127",
  "geometry": {
    "location": {
      "lat": 1.357528,
      "lng": 103.7342677
    },
    "viewport": {
      "northeast": {
        "lat": 1.358653030291502,
        "lng": 103.7354563802915
      },
      "southwest": {
        "lat": 1.355955069708498,
        "lng": 103.7327584197085
      }
    }
  },
  "name": "Swensen's @ Plantation Plaza",
  "place_id": "ChIJ-QhpgCcR2jERakSJtK0yiSY",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Haikel Yusop",
      "author_url": "https://www.google.com/maps/contrib/109983989207076851720/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU7K9IPmZNnl2-5lBoT8RDhi5LOX4yv01iBPmOrdb8uD5v4ZQAN=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "Newly opened Swensens (about half a year). Very quiet & calming cos of its ulu location. Food is just as good as other Swensen’s outlets.\n\nWould come here again for the yummy chicken & waffles & ambience",
      "time": 1745293248,
      "translated": false
    },
    {
      "author_name": "Irny N",
      "author_url": "https://www.google.com/maps/contrib/117333524818298539727/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX33E461mjDrc_sAqcKdyrRn3yy1HxrzkGYX-FAv11Vwu_xirp5=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Our last dine in Swensen’s was few years ago at another outlet.\n\nWas contemplating to eat here.\nWhile browsing the menu, the server(didn’t get his name. A young Chinese boy with glasses, a student probably) recommended a few nice dishes that makes us wanted to dine in.\n\nThe server that took our order was another young Malay boy, Zaky. He’s patient and friendly in taking our orders.\nHe was multitasking in taking orders, cashiering and preparing deserts.\nHe even apologised for sending our desert a bit later cause he was busy with cashiering (which I’m aware of cause we were seated near the cashier).\n\nFood was great. Still as good as how it used to be.\n\nDefinitely recommend to dine in here. Not very crowded, but I can’t speak for the weekends tho.",
      "time": 1738673649,
      "translated": false
    },
    {
      "author_name": "Suriani Ahmad",
      "author_url": "https://www.google.com/maps/contrib/112399855117435955754/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX7KDRxDfP0uOS_-K5fP23JpUd-tFru1xtTAGG2kt6wVZdKeWPZ=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "2 months ago",
      "text": "I am writing this review only until repeated visit to the outlet. I am not writing this to entirely make a complain but i am making a feedback so it can be taken in to improve the food quality for better customer experience.\n\n1st visit - my steak was serve with seasonal veggie option that i choose which came as only carrot, brocolli blanch in hot water.\n\n2nd visit - My partner’s ribeye steak came not in a fresh state at all, the first bite was not edible with a sour unfresh meat condition which however was replaced by the lady manager on duty.\n\n3rd & recent visit - The Pesto salmon we ordered came with corn and peas that wasn’t freshly cooked. For this i will attach the picture for your reference. And from the picture can definitely see the colour difference of the vegetables as mentioned served with lack of freshness.\n\nI and my family love to dine at Swensen so i hope that something can be done to improve this food quality being serve at this outlet.",
      "time": 1741332555,
      "translated": false
    },
    {
      "author_name": "MrA",
      "author_url": "https://www.google.com/maps/contrib/112008289267740134602/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWmx3lceuKzr9IpyiazfaYGRIijre_2gIhIos5GD21NE_Q_2RUL=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "5 months ago",
      "text": "Visited on a Friday afternoon and tried their lunch set meal. Everything was good, from services to food quality. This is Swensen newest restaurant, only 3 months old. The design is trendy and comfortable.\n\nI don’t stay at Tengah but I specially visited to show my support for restaurants around Singapore. I will write a good review to help the business if it’s well justified. I don’t get paid for any of my good reviews.",
      "time": 1732377069,
      "translated": false
    },
    {
      "author_name": "Nur Iman Rostam",
      "author_url": "https://www.google.com/maps/contrib/110287485091231667131/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKk595S-r1_udolNvwjHBrRXawa0-51AXFXSDcmorPXWIc8HA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Labour Day was a fun outing date with me and two university alumni friends who are still together after 11 years (9 years since our 2016 graduation). And the easiest dinner is at Swensen's Plantation Plaza because it is new and quite a buzz.\n\nI decided to eat their signature Sourdough 49ers Sandwiches Set that came with a Minute Maid Orange Juice and Soup of the Day. The food is appetising with a good layer of juicy chicken meat and an oozy layer of cheese. It was so good that it filled my belly well without needing any extra except to completely devour the whole set meal.\n\nThe atmosphere was lively and it was not too noisy at the same time. Great meals with interesting life-sharing conversations and wonderful laughters, a great night out without a doubt.",
      "time": 1746356861,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2776806366890247274",
  "user_ratings_total": 222,
  "vicinity": "127 Plantation Crescent, #01-05 Plantation Plaza"
}