{
  "formatted_address": "101 Bukit Panjang Rd, Singapore 670534",
  "geometry": {
    "location": {
      "lat": 1.381823,
      "lng": 103.7645431
    },
    "viewport": {
      "northeast": {
        "lat": 1.383171330291502,
        "lng": 103.7658329302915
      },
      "southwest": {
        "lat": 1.380473369708498,
        "lng": 103.7631349697085
      }
    }
  },
  "name": "Swim Masters Singapore",
  "place_id": "ChIJRStNq1wR2jERg6VgdNSGpho",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Alex Ng",
      "author_url": "https://www.google.com/maps/contrib/118169564739139306576/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUaPmBrjG-79Dg0rcA6CnKOFLwrIiimOS8HdE8Ckz0khU22klRAJw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Coach Alvin is Amazing with Kids!\nWe enrolled our child in Coach Alvin's swim program a few months ago, and the experience has been absolutely wonderful, largely thanks to Coach Alvin himself. What truly sets him apart is his incredible ability to connect with children.\nHe has endless patience, especially with kids who are initially nervous or hesitant about the water. Instead of pressure, he uses encouragement, fun games, and a calm demeanor to build their trust and confidence. Our child went from being quite anxious to genuinely looking forward to swim lessons each week!\nCoach Alvin knows how to break down swimming techniques into simple, understandable steps suitable for young learners. He celebrates every small achievement, making the kids feel proud and motivated. He creates a really positive, safe, and engaging environment where learning feels like play. We've seen remarkable progress not just in swimming skills, but also in our child's overall confidence around water. Highly recommend Coach Alvin for any parent looking for a nurturing and effective swim instructor!",
      "time": 1746431548,
      "translated": false
    },
    {
      "author_name": "Gavin Ong",
      "author_url": "https://www.google.com/maps/contrib/109950546172181741522/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJUAfbzmIlinoDF7GMCs0A_LilmJDRXCc9HdcztjvuKO6Cm7Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "As an adult learner with busy schedule, I was initially hesitant to start swimming lessons. However, my experience with coach Alvin Ho and Coach Kingston has been amazing from the very beginning.\n\nTheir patience, kindness, and friendly created an stress-free environment, allowing me to learn at my own pace. In just two short months, I've made incredible progress. I can now confidently swim breaststroke and am well on my way to mastering freestyle.\n\nWhat sets Coach Alvin and Coach Kingston apart is their dedication to understanding each student's unique needs and goals. They provide personalized guidance, constructive feedback, and unwavering encouragement.\n\nIf you're a resident of Bukit Panjang or the west area looking to learn how to swim, I highly recommend Coach Alvin Ho and Coach Kingston. Their expertise, passion, and supportive teaching style make them the perfect coaches for learners of all ages and skill levels.",
      "time": 1732974779,
      "translated": false
    },
    {
      "author_name": "Sarinah Salleh",
      "author_url": "https://www.google.com/maps/contrib/109228158408098973126/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLRNawUlg1KG5ekJiXj8TXJ5uDZ5Y98nxIzU7H1dXfwDH_LYQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Thank you all the Swim Masters Coaches in their dedication to train my children. It's not an easy job as I sit and observe them training the children under their respective stages, especially for upcoming Swimsafer tests.\nAlso, special shout out to Coach Alvin for going extra miles to train for my son's Stage 6 Swimsafe tests",
      "time": 1745982313,
      "translated": false
    },
    {
      "author_name": "Angeline Li",
      "author_url": "https://www.google.com/maps/contrib/116003173817665840083/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJO-N_z1CE0ZCH1BBglQGLxYp9Xiw25zdPRuUvVuwX-3GJ-Hw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "My two boys have been learning swimming with Swim Master for more than 2 years now. The coaches were very patient and supportive in teaching them. Thank you!",
      "time": 1741667075,
      "translated": false
    },
    {
      "author_name": "Chloe Teng",
      "author_url": "https://www.google.com/maps/contrib/101196505124239895030/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLkhLaAwWqFb-6Bhd-5HJ4xHQvZCnCkVCIY22oZq-bhwGbEBw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "We’ve had a fantastic experience with Swim Master! Both of my children, ages 6 and 8, have been taking swimming lessons here, and the progress they’ve made is incredible. The instructors are patient, professional, and really know how to engage with young learners. They focus not only on technique but also on building confidence in the water, which has been so important for my kids. The facility is clean and well-organized, and the staff is always welcoming. I highly recommend Swim Master to any parent looking for quality swim lessons!",
      "time": 1727843087,
      "translated": false
    }
  ],
  "types": [
    "school",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1920370538163774851",
  "user_ratings_total": 152,
  "vicinity": "101 Bukit Panjang Road"
}