{
  "formatted_address": "9 Jln Kubor, #01-01, Singapore 199206",
  "geometry": {
    "location": {
      "lat": 1.3038325,
      "lng": 103.859201
    },
    "viewport": {
      "northeast": {
        "lat": 1.305280630291502,
        "lng": 103.8605908302915
      },
      "southwest": {
        "lat": 1.302582669708498,
        "lng": 103.8578928697085
      }
    }
  },
  "name": "Symmetry",
  "place_id": "ChIJifyxILcZ2jERY1I6W2KqL70",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Marcus Ang",
      "author_url": "https://www.google.com/maps/contrib/111145722549856734783/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWPr-nUmapJ4Ctq3YxAKtDZpf0DaANUhrrW2t3NsRnzxTtK4sk=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "egg benedict was well executed with a minced mushroom base, bread was nicely toasted, pairs well with the fatty bacon too. sauce came off as a pleasant surprise.\n\nsteak was thin without char like most of the other have mentioned, but the cook and marination was good. grilled octopus leg was well cooked and not rubbery, sausage was packed with herbs to cover the porky smell.\n\nportions and quality of items were reasonable for the price paid, overall a pleasant dining experience, will be back for more.",
      "time": 1745127709,
      "translated": false
    },
    {
      "author_name": "Alice Chou",
      "author_url": "https://www.google.com/maps/contrib/101114117667011103235/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJZxqK9_P_gBmZ5rYSwvT5RWCmgc8eBYD2SIpDjsl1KAYurhOeP=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "As a vegetarian travelling in Singapore, finding vegetarian food has been quite a bit of a challenge, especially if you're looking for flavourful vegetarian options. If you're in the same position, then you will not want to skip Symmetry. I'm so impressed by the food, the flavour profiles of the dishes we ordered and the presentation, the vegetarian options available, the service they offer, and even the ambiance right down to the music they play (electronic music: chill house).\n\nI came here with 3 others and the kitchen knocked all 4 of our dishes out of the park! I ordered the Symmetry Eggs Benedict, no bacon. The brown butter and yuzu emulsion was mind-blowingly delicious. The citrus flavour keeps the entire emulsion light and refreshing, which enhances the sweet and savoury flavour profile of the entire dish. You'll leave feeling full and completely satiated, but not stuffed.\n\nMy friends ordered the Tuna Melt Toastie, which was really filling and comes with two sunny side up eggs on the top. One ordered Cherry Pancake Stack and it was topped with cornflakes which gave it the perfect crunchy and soft texture. And the honey ice cream was PERFECTION. So light, fluffy, creamy, and the perfect flavour and sweetness - It's made in New Zealand! And don't skip out on the truffle eggs mushroom! The flavour profile is deep, smoky, complex, and so, so good.\n\nThe servers were friendly, fun, and cracked jokes. Be prepared to spend at least $25+ per meal, but for the entire experience that you get, it is worth the splurge. If I'm ever back in Singapore, I will 100% come back to this restaurant.",
      "time": 1745898152,
      "translated": false
    },
    {
      "author_name": "Serena Lai",
      "author_url": "https://www.google.com/maps/contrib/111209503094214960865/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW1rwla61uCSOeXrghdTr4kIf-6rD_rt0FRw1zYazY2pIclAyoE=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Was on my wishlist for quite some time and we ordered truffle eggs mushroom, dirty matcha and berry cocktail to share. The food is usual cafe-standard, but the dirty matcha is good.\n\nI liked how the matcha foam paired nicely with the coffee, not overpowering it. Prices here are a little steep though, but the ambience is nice.",
      "time": 1743232686,
      "translated": false
    },
    {
      "author_name": "J9",
      "author_url": "https://www.google.com/maps/contrib/112678143761330296890/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV2Y8cwJ23HbselvA7i-QjmMSUNqTh54v4vg9av9sdtkLFLtCKF=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Had such a wonderful time and meal here!\nStaff were really friendly and accommodating, despite it being a busy sunday brunch time they managed to squeeze our table of 8 in. Really appreciate the effort they took for this!\n\nFood was amazing! Really recommend the breakfast set and the tuna melt sandwich, wonderful place for a good brunch!",
      "time": 1739107215,
      "translated": false
    },
    {
      "author_name": "Nataliia Makaruk",
      "author_url": "https://www.google.com/maps/contrib/108315210237627213340/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUtO58beDtMqo4wJz0a5BNRm5j7qtvmNHjIWzcUfPE4C3iP7L2L=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "It was the first time we tried Australian cuisine and it was absolutely fantastic! So diverse and delicious tastes. And their signature green smoothie is just the best! Thanks for such an excellent experience in Singapore.",
      "time": 1746359904,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "bar",
    "restaurant",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13632301936487846499",
  "user_ratings_total": 1963,
  "vicinity": "9 Jalan Kubor, #01-01"
}