{
  "formatted_address": "38 Irrawaddy Rd, #06-59/60/61 Mount Elizabeth Novena Specialist Centre, Singapore 329563",
  "geometry": {
    "location": {
      "lat": 1.3221344,
      "lng": 103.8440747
    },
    "viewport": {
      "northeast": {
        "lat": 1.323487180291502,
        "lng": 103.8456124302915
      },
      "southwest": {
        "lat": 1.320789219708498,
        "lng": 103.8429144697085
      }
    }
  },
  "name": "Synergy Orthopaedic Group Pte. Ltd.",
  "place_id": "ChIJy527ApMZ2jERAsiMKRcxYxE",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "munpew khong",
      "author_url": "https://www.google.com/maps/contrib/116237414457466326025/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKjXAjC_1E4c3xrcbMV6kZiLbCul1gg6N-_7m93zxV2WbRf7g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "My wife saw Dr Lim Mui Hong to remove a cyst from her ankle. Dr Lim is detailed, caring and frank regarding the diagnosis.  He demonstrated excellent after care surgery.  Most important of all, he is friendly and cheerful putting my wife at ease. I would definitely recommend Dr Lim.  The staff in particular Geraldine at the clinic are friendly and helpful too.",
      "time": 1726721507,
      "translated": false
    },
    {
      "author_name": "toony toony",
      "author_url": "https://www.google.com/maps/contrib/103497760800307357801/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJpMPS_m_A7z9EQMPJsHgbW7ZsE3sUXeXtOKImP938h4Bcv3g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "I would like to compliment Dr Lim Mui Hong for his professionalism and skillfulness in treating my wife. My wife had a fall and resulted in her having to go through quite an urgent knee construction surgery to  address both her bucket handle torn meniscus as well as her torn ligament. Dr Lim has been most friendly, patient and reassuring in addressing our concerns as well as questions before the surgery. It also helped that Dr Lim took care of all the pre-surgery procedures and we didn't have to worry about anything at all. Amazingly, my wife could walk the next day, with assistance, after the surgery. She also could straighten her leg perfectly and is on track with her recovery. At two weeks now, she can almost walk unassisted. Throughout the whole recovery stage, Dr Lim has provided very good advice and is very quick to respond to any queries that we might have about the recovery at any time of the day. We are very grateful to have met such a kind surgeon who is not only skilful but also cares a lot about his patient's well-being. Dr Lim has certainly made the whole experience of having to go through a major operation fuss-free and less traumatic for my wife.The anesthetist, Dr Ong, whom Dr Lim works with is also very friendly, caring and professional. He has certainly helped to bring down the level of anxiety greatly before the operation. We are grateful for the level of care and service provided by the doctors.",
      "time": 1717155114,
      "translated": false
    },
    {
      "author_name": "Yamee",
      "author_url": "https://www.google.com/maps/contrib/100301925025017618314/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ5b25XFmy3PvMiLy78Q8oGP98fYEs_jRtpeZlAJiez-Tp_Nw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Saw Dr Lim Mui Hong for my knee issue. He is detailed, patient and follows up properly for post surgery. He puts his patients interests at heart definitely recommend! The clinics receptionists are very friendly and efficient and will patiently answer your queries! 👍",
      "time": 1705749913,
      "translated": false
    },
    {
      "author_name": "SL L",
      "author_url": "https://www.google.com/maps/contrib/107094506073864319576/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIwx5YPnZSte5ULseKCnJyWwRzpnTcJ0bfJPMLROpy_M9rorQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "I had my surgery done with Dr Lee Haw Chou for a Humerus Fracture & Radial Nerve Palsy.\n\nSurgery went okay and I was expected to recover my Wrist & Fingers function in 6-9months. However, after 1year of consistent physiotherapy and follow up the situation remained the same.\n\nI have sounded out many times to Dr Lee regarding my expected recovery period vs 12-13months. He kept claiming that recovery period is case by case basis. I Have requested  for more testing to be done to find out why.. was referred to do an EMG test. When the result was out, he mentioned that everything is normal and we should wait it out.\n\nAfter 1 year of not having movements in my wrist & fingers, I decided to seek an 2nd opinion. My other doctor went through my EMG report & shared that the results are not good. Was sent for an MRI scan before finding out that I have to undergo another operation to regain movements. Waiting will highly likely not help for my situation at all.\n\nStopped going back to Dr Lee & no follow up calls/message was sent to me for 1 year regarding my situation. Should I have stayed with Dr Lee, I will never know the severity of my injury. Simply said, I wasted more than 6 extra months waiting for nothing.\n\nAside from this, Dr Lee also like making senseless jokes about my injury. Eg: ‘oh, cannot move your wrist only ma’.\n\nEvery follow up felt like I wasn’t taken seriously and my concerns were not heard. No notes/memo was taken either. Had to always recap Dr Lee on my progression from day of surgery till present.\n\nWorst experience, do avoid at all cost!!\n\nNote: Recovered in a short span of 6 months after seeking 2nd opinion + surgical plans.",
      "time": 1682724133,
      "translated": false
    },
    {
      "author_name": "Be Me",
      "author_url": "https://www.google.com/maps/contrib/107409555469058625944/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXsbo7eghphZVk6iORplt1umsYavlqOz8onQL35GPufilTHFW-SQA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Excellent team, professional and very helpful.  After searching up n down for a caring, professional doctor opted for my Microdiscectomy with Dr Lee. Patient care, comfort and health is priority for Synergy. Doctor Lee is caring, loving and extremely professional. His experience in lumbar microdiscectomy is unparalleled.  I was operated in early may 2022. Immediate pain releive and i am now feeling fit as a horse.\n\nFor all who are searching... this is it guys.  A sincere professional doctor right at Synergy. Would fully recommend to all.\n\nThanks a lot Dr Lee Hwa Chou :))\n\nCheers\nB",
      "time": 1651986952,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1252899096890230786",
  "user_ratings_total": 17,
  "vicinity": "38 Irrawaddy Road, #06-59/60/61 Mount Elizabeth Novena Specialist Centre"
}