{
  "formatted_address": "594 Serangoon Rd, Singapore 218208",
  "geometry": {
    "location": {
      "lat": 1.315164,
      "lng": 103.858361
    },
    "viewport": {
      "northeast": {
        "lat": 1.316581330291502,
        "lng": 103.8596210802915
      },
      "southwest": {
        "lat": 1.313883369708498,
        "lng": 103.8569231197085
      }
    }
  },
  "name": "TA Community",
  "place_id": "ChIJJccqPAcZ2jERLBZXpdQlfYo",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Hannah Tan",
      "author_url": "https://www.google.com/maps/contrib/111267721255068407477/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWaKFxWBYYiUIrwBkuVQ6IHOXYa4jht4zja3YMqoWK7ogWvb6Tudg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Wow, what a find! We were looking for a new brunch and stumbled on this (honest to god) hidden gem. A quaint and quiet cafe with amazing Swedish food (love the pomegranate kale salad and meatballs) and an incredibly sweet and friendly owner. We will be back to try more of the menu!",
      "time": 1742569441,
      "translated": false
    },
    {
      "author_name": "A-Cute Hunger",
      "author_url": "https://www.google.com/maps/contrib/107871716736324850619/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXQJspNex-TRanlJ9PtgT6thDdW6zeJQX128NsNBphxpttXdyI-=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "TA Community is a delightful surprise—a Swedish gem nestled in the vibrant heart of Little India.\n\nFrom the moment you step inside, you're greeted with incredible hospitality by the charming Swedish host, making you feel like a cherished guest in their home.\n\nThe food is truly exceptional. The seafood sandwich is a visual masterpiece, resembling a dessert cake with its artful presentation and layers of fresh, flavorful ingredients. The Swedish meatballs are equally amazing, cooked to perfection and bursting with authentic flavors that transport you straight to Scandinavia.\n\nOne of the highlights of our visit was the opportunity to taste four different gin and tonics, expertly curated by the host. At just $6 each, this was an unbelievable offer that added a special touch to our dining experience.\n\nThe ambience is cozy and inviting, starting with a unique shop in the entry foyer that sets the tone for the experience that follows. A well-stocked bar and shiny disco balls adorn the heart of the restaurant, adding a touch of whimsy to the atmosphere. As you move further in, you find another dining hall with more tables, perfect for enjoying a relaxed meal.\n\nTA Community feels like a house that decided to open a shop and a bar, inviting you over for an unforgettable dining experience. If you're looking for an unexpected culinary adventure in Singapore, this is the place to be!",
      "time": 1723384110,
      "translated": false
    },
    {
      "author_name": "Cheryl S",
      "author_url": "https://www.google.com/maps/contrib/102631085784451913861/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUBxCwBCA0KkdAytpQCiqgB_9x5B0EieDTyJz0nW5wBIZdizw3k=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Pleasantly surprised by the excellent quality of food and service at this place. The seafood sandwich cake is not only beautifully placed together but also tastes super yummy. Gotta try the Swedish meatballs which are full of flavour. We really enjoyed our cocktails too. We were here for brunch on a Sunday, which had a smaller menu. Can’t wait to come back on a weekday to try the full menu.",
      "time": 1714303037,
      "translated": false
    },
    {
      "author_name": "Meredith Martin",
      "author_url": "https://www.google.com/maps/contrib/108852200096028286039/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUgXMbmiDxFQRarlvl9GoggBZXdv7KcSOicPZkfjIktwvobTL7MKQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Gift shop is amazing - Scandinavian kitchen decor and imported goods, meets japanese pottery and specialty cocktail kits. Add in organic baby gifts and this is a one-spot-stop for a beautiful gift. The service was fabulous. If only I had planned time to enjoy the pastries or dishes.\n\nI'll be back!\n\n(I live nearby and really want this place to get more foot traffic. It's a gem and the only thing of its quality in this area. So I took these pictures and made this post while the helpful lady wrapped my present beautifully.)",
      "time": 1714813182,
      "translated": false
    },
    {
      "author_name": "S H Lee",
      "author_url": "https://www.google.com/maps/contrib/110490721977867742919/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLj6p32Y4pHeNHcqWcLoDDysKi4KllGHOXo2O8w5i1wT7P3fw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Good food, great service in a cosy space. We liked both the skagen toast and the gravy cheeseburger. The shrimp was slightly chewy, not the usual crunchy type, and somehow tasted more flavourful. Burger patty was grilled to perfection (although we would've preferred the gravy to be less salty), and even the fries were great. Friendly bosses and staff added sparkle to the experience. Thanks!",
      "time": 1708342745,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "florist",
    "bar",
    "restaurant",
    "food",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9979173944560129580",
  "user_ratings_total": 38,
  "vicinity": "594 Serangoon Road"
}