{
  "formatted_address": "740 Bedok Reservoir Rd, #01-3189 Reservoir, Singapore 470740",
  "geometry": {
    "location": {
      "lat": 1.3379838,
      "lng": 103.9228847
    },
    "viewport": {
      "northeast": {
        "lat": 1.339274480291502,
        "lng": 103.9241557302915
      },
      "southwest": {
        "lat": 1.336576519708498,
        "lng": 103.9214577697085
      }
    }
  },
  "name": "Tai Tong Seng Trading",
  "place_id": "ChIJY2IYols92jERfLkW4AEoOdw",
  "rating": 3.8,
  "reviews": [
    {
      "author_name": "LY",
      "author_url": "https://www.google.com/maps/contrib/103115221693526538510/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJLxpwe9kfu4ADJePc9t2WaspBGFdnhyuEI9nGPjFies4THBA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "3 years ago",
      "text": "Terrible company. Please kindly blacklist the company.\n\n1. Never willing to quote properly on the spot.\n2. Always ask the plumber go to your house and corner you and quote ridiculous price.\n3. A 98 dollars tap, then finished installation at 350!!! Force us to add valves for the hot and cold water then do the work.\n4. Very poor standard of work.\n5. Arrived 2-hour later than the scheduled appointment.",
      "time": 1630491972,
      "translated": false
    },
    {
      "author_name": "SC Tan",
      "author_url": "https://www.google.com/maps/contrib/114280931140906006810/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIxY75SZM9W6GpKlr5yysTUpFO3GBESyqX0PbwVPeAhOgOQYg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 years ago",
      "text": "Very unpleasant and distressing experience with purchase and installation of toilet bowl. Initially quoted a price of $390 with 3 months warranty to replace toilet bowl. This was competitive as compared with another quote of $400 with 1 month warranty. However, just 15-20 mins before plumber came over, was informed that price originally quoted is not applicable after picture was sent to plumber. However, picture of toilet was already sent the day before booking was made. When plumber came, the price quoted was $650. The reason given was that this is a more complicated job, etc which is not entirely convincing. We did a background check with other shop/Plumbers again and found we are overcharged as the toilet bowl could have been replaced under $400. In the end, we declined to proceed but already paid $200 for deposit of toilet bowl and removal of old toilet. Overall, the charges and conduct of both the shop sales person and plumber are not transparent and we ended up spending more than we needed to . It is a very disappointing and regretful situation that I did not chose the other option which may appear less competitive upfront. I would not recommend this shop nor their services.",
      "time": 1596105526,
      "translated": false
    },
    {
      "author_name": "Colin Wong",
      "author_url": "https://www.google.com/maps/contrib/116510655911824980754/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjURn7COccjnKihhvXM18rGbkRqab-nQZPj3HCK6TyhZEkQyIFis=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 years ago",
      "text": "1. Went down to get a replacement toilet flush valve.\n2. Showed them the broken piece and they told me it cannot be replaced, need a repairman to go down and fix it. Says it will cost 250 to replace the whole thing toilet flush system.\n3. They ask for my contact no and address and say they can go down later and take a look. Fearful of transportation charges in case I do not want them to fix it, i ask them specifically and they say they will take a look and if no work done, there is no payment to be make.\n4. Guy came down, look at it for 2s and quoted me 250 to change the flush valve and flow valve. (Flow valve was not even spoilt). I immediately say i do not want to fix it n he demanded a 30 dollar transportation fee.\n5. I told him he was the one who said if no work is done, there is no fee but he still insisted on the 30 dollars. It was pure fraud. I managed to get him out without paying.",
      "time": 1635475327,
      "translated": false
    },
    {
      "author_name": "Bryon Tian",
      "author_url": "https://www.google.com/maps/contrib/112898934190264682223/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLBFdDCuLOetNe0O9KM_7zhP-MN8-BZGZCrIJ2nZ0XJg6HSJA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "5 years ago",
      "text": "Quite disappointing. When my father and I went ask to replace and install a new sink and it was initially offered at $220. But we didn’t had our dimensions so we we didn’t buy it then. But the second time we came over. They raised to $260. It was a little weird and over priced but we just accepted it and selected a sink for our replacement. However, on the day they came to fix our sink, they said our old sink was installed differently to how they normally would and they upped the prices to $300. My dad and I agreed to just let them fix the sink was not useable for 3 weeks already. But the sink they installed for us was not the sink we were shown. We are extremely frustrated with them.",
      "time": 1574350138,
      "translated": false
    },
    {
      "author_name": "DJ haiting",
      "author_url": "https://www.google.com/maps/contrib/101989751555054721453/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLRr2vbiqk5LsmzcXRWlHGnHu3tVOaG7nW_ozAO8MXdODeHHw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Very glad that the issue with my clogged sink was settled very efficiently! The boss and worker was transparent with the process of the repair, and took video to show me of the issue faced.\nSubsequently, offered me clear options + weighing the pros and cons for each option for me to make an informed decision. Thank you so much!",
      "time": 1638243365,
      "translated": false
    }
  ],
  "types": [
    "hardware_store",
    "point_of_interest",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15868758750536317308",
  "user_ratings_total": 44,
  "vicinity": "740 Bedok Reservoir Road, #01-3189 Reservoir, Singapore"
}