{
  "formatted_address": "3 Yung Sheng Rd, Singapore 618499",
  "geometry": {
    "location": {
      "lat": 1.3346605,
      "lng": 103.7215524
    },
    "viewport": {
      "northeast": {
        "lat": 1.335966130291502,
        "lng": 103.7227975302915
      },
      "southwest": {
        "lat": 1.333268169708498,
        "lng": 103.7200995697085
      }
    }
  },
  "name": "Taman Jurong Market & Food Centre",
  "place_id": "ChIJHabbDPsP2jEROQtuba0GHhc",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Kaori Ginger",
      "author_url": "https://www.google.com/maps/contrib/115769713843279821069/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUnlD4V_zptK4p7CCufgBA8PzqEp16HmAJAIQ0T1mNqUNeqza49ZA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "4 weeks ago",
      "text": "Tried this stall at level 3, #03-169, in the morning. Pocket friendly and surely a hearty meal. Surprised that I could not find anything regarding this stall. Owned by a pair of sweet and nice early couple. Visited there around 6am, before heading for some morning walk.\n\nThey do have some special dishes like pig's tail, chicken feet, duck wings. Dint order those as I'm not into it.. but for people who wanna try, this place absolutely deserve your visit. Im unsure of how much a pig tail costed elsewhere, but this stall sells at around 2 dollars for a big one. Chicken feet is 3 for 2 dollars as well.\n\nThey does have the regular dishes like fried eggs, chicken wings, luncheon meat, chap chai, fish fillets...etc. Order a plate of fried beehoon with egg+chicken wing, costs $3.10. The red chill is really spicy with a hint of pleasant sweetness. However the green chilli is always my to-pair with for the beehoon. They does have sets as well, but I like to choose my dishes on my own.",
      "time": 1745315367,
      "translated": false
    },
    {
      "author_name": "Winston Teo",
      "author_url": "https://www.google.com/maps/contrib/103983640077681957103/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV5NzDT0ls7P0VYmKSCa_bJR9a9u_qvM1jhtYf94_gsl0KgUE6I=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "2 weeks ago",
      "text": "Lunch at Taman Jurong Food Centre – A Hidden Gem for Hawker Delights\n\nTucked away in the heartlands, Taman Jurong Food Centre delivers an unpretentious yet deeply satisfying hawker experience that foodies in the know truly treasure.\n\nToday’s lunch was a feast of bold flavors and smoky wok hei—a perfect snapshot of Singapore’s rich culinary tapestry.\n\nFirst stop: Rojak.\nA riot of textures and flavors—crunchy you tiao, juicy pineapple, cucumber, and turnip—all lovingly coated in that signature sticky, dark prawn paste sauce, finished with a generous shower of crushed peanuts. The sauce was punchy and fermented just right, giving a deep umami hit that lingered with every bite. A delightful dance between sweet, savory, and tangy.\n\nNext, Fried Tau Kwa.\nGolden brown on the outside, custard-soft within. This humble tofu took on new life when dipped into the accompanying chili sauce. The crispy edges added bite, while the inside remained fluffy and warm, absorbing every bit of sauce like a sponge. It’s the kind of simple dish that’s deceptively addictive.\n\nThen came the Fried Kway Teow.\nServed hot off the wok, it was everything char kway teow should be—smoky, slick, and sinful. Each strand of flat rice noodle glistened with dark soy, intertwined with eggs, bean sprouts, Chinese sausage, and bits of crunchy lard. That unmistakable wok hei gave the dish a fragrance you could smell from the next stall. A pure indulgence.\n\nFinally, Hokkien Mee.\nA comforting mix of yellow noodles and thick bee hoon simmered in rich prawn and pork stock. It came slightly wet, with a balanced savory sweetness. The prawns were fresh, the squid tender, and the sambal on the side packed enough fire to make you break a sweat. A squeeze of lime cut through the richness and brought the whole dish together.\n\nVerdict:\nTaman Jurong Food Centre proves again that some of the best meals come served on plastic plates in the most unassuming places. With every bite, you taste heritage, heart, and hawker mastery.\n\n#sedapinsg #supershiok",
      "time": 1746004937,
      "translated": false
    },
    {
      "author_name": "Leonard Lim",
      "author_url": "https://www.google.com/maps/contrib/116867245896657547975/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV7MTJQfPKKdXci7Ep7ycKYLivnr5sjqRBDsHDcPA0e61iF5otYMA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "One of my favourite food centers in the west that offers value for money delicious food.\nBig shout out to #03-155 Ming Hor Fun\nGreat wok hei and bursting with flavour for both the beef hor fun and fried rice.\nThe raw egg mixed into the piping hot hor fun adds a slippery smoothness to every mouthful. The har cheong gai (prawn paste chicken) has deep flavour, juicy on the inside and crispy on the outside.\nOl' school comfort food taste!",
      "time": 1737640597,
      "translated": false
    },
    {
      "author_name": "Vincent Kok",
      "author_url": "https://www.google.com/maps/contrib/101486772728447596046/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUdcxg2p-ERLqcxtwATuDmGTrlm5qPH5HXENtOSPwjIl40xYBS1ww=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "Love the rojak and the tau kwa pok... the elderly couple use charcoal to toast the youtiao, tau pok, cuttlefish adding flavour without a doubt.\nUsed to enjoy a decent bowl of loh mee in the past but the taste was a little sweeter and not to our liking.",
      "time": 1735545157,
      "translated": false
    },
    {
      "author_name": "JJ Jen",
      "author_url": "https://www.google.com/maps/contrib/108529671565113161419/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJRtRWNHC7Ouaiib41Reiykcehk8VXomlo09rcyPq-t1VOM13Ei=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "Revisited this food center after 15 years. Many varieties of food at affordable price. Kopi Si only at $1.10.",
      "time": 1737254847,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1665776254108699449",
  "user_ratings_total": 5270,
  "vicinity": "3 Yung Sheng Road"
}