{
  "formatted_address": "4 Tampines Central 5, Singapore 529510",
  "geometry": {
    "location": {
      "lat": 1.352451,
      "lng": 103.9446732
    },
    "viewport": {
      "northeast": {
        "lat": 1.353718130291502,
        "lng": 103.9463109302915
      },
      "southwest": {
        "lat": 1.351020169708498,
        "lng": 103.9436129697085
      }
    }
  },
  "name": "Tampines Mall",
  "place_id": "ChIJ89lf6hE92jERQXt7c5QOFnY",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Peter Rock Steady",
      "author_url": "https://www.google.com/maps/contrib/112735098010851642789/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKamKsoyh2qSCvZHzFaOCtsljtrNpnUrHsr2Yp6A8SqAK345Ak=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "2 weeks ago",
      "text": "Quite a crowded mall on a Friday afternoon.\nThere are more than one mall here so expect more crowds than usual",
      "time": 1746173751,
      "translated": false
    },
    {
      "author_name": "Alice Kwah",
      "author_url": "https://www.google.com/maps/contrib/100434972059725782323/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW39hQVH3cbPgn7_Dz3IWITSSc6iJtihYdXnqgPg5JC_TMu7qKy=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Hanami Matsuri – Japanese food fair with takoyaki, dango, cherry blossom gelato & more 😊👍👍👍🥰😋😋😋",
      "time": 1744028599,
      "translated": false
    },
    {
      "author_name": "樱木花",
      "author_url": "https://www.google.com/maps/contrib/103988529191663290937/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWjy5ah7OFhTiKGlcSOs_sZT9_CIwiXAfFC1787WarSQSO2zjg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Definitely a great mall with almost everything like boutiques hopes, eateries, groceries and snack stores.\nLift area is easy to find but very warm - felt like missing air conditioning in that area. During peak hours might feel humid and some elderly or conditioned patrons might feel need to heavy breathe.",
      "time": 1741857572,
      "translated": false
    },
    {
      "author_name": "Mamun Miah",
      "author_url": "https://www.google.com/maps/contrib/114020743606283760527/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXG98exVKMqHcnk6l3P8YkBuSqrUnor1UEdUT4gx_iWaB9tur6u=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "🌟 Discover the heartbeat of Tampines at Tampines Mall! 🛍️ Nestled in the heart of this vibrant neighborhood, Tampines Mall is more than just a shopping destination; it's a bustling hub of excitement and community spirit. From trendy fashion boutiques to delectable dining options and everything in between, this mall caters to every taste and desire. Whether you're seeking the latest fashion trends, craving mouthwatering cuisines, or simply looking for a cozy spot to unwind with friends, Tampines Mall has it all. With its convenient location, diverse offerings, and welcoming atmosphere, Tampines Mall is not just a place to shop; it's an experience to savor. Dive into the energy of Tampines Mall and let it charm you with its local flair! 🎉",
      "time": 1711511553,
      "translated": false
    },
    {
      "author_name": "Kamal Indika Nanayakkara",
      "author_url": "https://www.google.com/maps/contrib/109967720850402274429/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUk7ACzlu4dk9OIChzxEgvqGZEfL0wuVKzXmgdfcJTbMp6BWkIxDQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Tampines Mall is one of the best shopping destinations in the eastern region of Singapore, conveniently located near Tampines MRT Station and the bus interchange. It offers a complete and comfortable shopping experience with something for everyone—from families and students to working adults and seniors.\n\nThe mall is spacious, well-maintained, and fully air-conditioned, providing a relaxing environment for shopping and dining. It has a great mix of local and international brands, including fashion outlets, electronics, beauty products, sports stores, and lifestyle brands. Whether you’re looking for everyday essentials or trendy shopping, you’ll find it all here.\n\nOne of the best features is the variety of food options available. From fast food outlets like McDonald’s and KFC to casual dining restaurants and local food stalls, the mall caters to different tastes and budgets. The food court on the top floor offers a good selection of local hawker favorites at reasonable prices.\n\nTampines Mall is also family-friendly, with a large NTUC FairPrice supermarket, Popular bookstore, Watsons, and pharmacies for daily needs. The Golden Village cinema on the upper floors is perfect for catching the latest movies in a comfortable setting.\n\nAnother bonus is that Tampines 1 and Century Square malls are just next door, allowing shoppers to easily explore three malls in one trip. The connection between them is seamless, and you can enjoy an even wider variety of stores and eateries.\n\nThe location is excellent, and the mall is always clean, organized, and lively. Whether you’re coming for shopping, food, or entertainment, Tampines Mall is a great place to spend your day. Highly recommended for both residents and visitors looking for a vibrant retail and lifestyle hub in the East.",
      "time": 1746258299,
      "translated": false
    }
  ],
  "types": [
    "shopping_mall",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8509004576718551873",
  "user_ratings_total": 14328,
  "vicinity": "4 Tampines Central 5"
}