{
  "formatted_address": "05-01, 470 N Bridge Rd, Bugis Cube, Singapore 188735",
  "geometry": {
    "location": {
      "lat": 1.2981502,
      "lng": 103.8555656
    },
    "viewport": {
      "northeast": {
        "lat": 1.299546530291502,
        "lng": 103.8568480302915
      },
      "southwest": {
        "lat": 1.296848569708498,
        "lng": 103.8541500697085
      }
    }
  },
  "name": "TANGS CLINICAL CENTRE TCM",
  "place_id": "ChIJN_L0ApgZ2jER_Q2gxMrPS94",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Tan Tse Yong",
      "author_url": "https://www.google.com/maps/contrib/117099411863226899609/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVj6QUNF2OTNYmqqtrLV4Zgo-4znlkb5APgXrGpVz299raVjLqJ6w=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We brought our son to see Dr. Tang at Tang's Clinical TCM back in September last year for a persistent eczema issue on his arm. Dr. Tang was incredibly patient, professional, and thorough in his consultation. What impressed us the most was that he didn't try to push any products or unnecessary treatments. Instead, he advised us to stop applying a certain cream we had been using and recommended simple but effective dietary changes—like cutting back on chicken rice and avoiding fish oil.\n\nFast forward to March this year, our son's skin has shown a remarkable improvement. The eczema has almost completely healed! (I've attached before-and-after photos to show the transformation.)\n\nWe’re truly grateful for Dr. Tang’s genuine care, wisdom, and professionalism. Thank God for leading us to the right place. Highly recommended for anyone looking for a trusted and ethical TCM doctor!",
      "time": 1743945411,
      "translated": false
    },
    {
      "author_name": "joa loke",
      "author_url": "https://www.google.com/maps/contrib/113654196570648792887/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIpuq8hN32q6IS3w0bfd9IxUD5rpU0oxssRkdxoaUeX8SAkww=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "My daughter suffered from psoriasis and eczema since 2023. I knew that steroid treatment isn’t the solution so turned to Dr Tang. The healing process is long and we almost give up. However, there is no cure for autoimmune diseases so we persist on Dr Tang treatment.\n\nAfter 8 months of treatment, her psoriasis almost gone and the eczema flare is getting less frequent and less severe.\n\nWe are looking forward to full recovery now. All the waits and patience are worthy when seeing my child’s skin finally got smoother.\n\nThanks Dr Tang and the team.",
      "time": 1724811941,
      "translated": false
    },
    {
      "author_name": "Aza",
      "author_url": "https://www.google.com/maps/contrib/113308067731743384011/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUBEHhgNFDtDSmYbjU6kitpJ5SZ2onAzKAt4j9NZfHkC7eIUMJh=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "10 months ago",
      "text": "Dr Tang has been helpful & patient in treating my child’s skin condition. After checking with so many dermatologists, only Dr Tang’s treatment worked. Their creams & herbal medications healed my son’s skin. Although healing process was not fast, results were definite. My son is now steriod-free.\nHighly recommended.\n\nThank you, Dr Tang!",
      "time": 1721811853,
      "translated": false
    },
    {
      "author_name": "Kevin Chua",
      "author_url": "https://www.google.com/maps/contrib/117568456850505748669/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUbh486L2lv0FwjmoVehyzXV_ZASPDR3PVx9xT0eHzaPiCRYL3_=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "TCM treatment that healed my eczema / psoriasis, but takes time and is not cheap.\n\nMy background:  Sometime around the middle of 2022, I started developing a small patch of eczema / psioriasis on my palm.  It started with small water bumps that get really itchy.  Upon \"healing\" it would get all crusty with pus.  It gradually spread to about a 2cm patch.  I went to the GP who gave me a topical steroid cream and moisturiser.  Using them helped to soothe the skin and make the itch go away.  Knowing that it might build resistance, I used it sparingly.  However, I noticed a pattern where it would stop being effective, and when the itch returned, it would spread even more.  By Feb 2023, it had spread to about 30% of my hand.  At that point the itch would sometimes be so unbearable that I would feel like chopping off my hand, and I was embarrassed to shake other people's hands.  My kids also did not want to hold my \"rough\" hand.  That's when I got desperate, and thought of alternative treatments.  I had read online about how changing my diet could help but it was quite drastic and not practical for my situation.  Eventually, I searched online and found Tang TCM.\n\nThe treatment:  I started my treatment around Feb 2023.  It was costly, about S$400+ per month for a few containers of powder to consume every morning and evening, and I had to stay away from spicy food and alcohol.  Dr Tang explained that the treatment would make my condition a little worse, before I start to see some improvement, and this will continue in 2-3 month cycles.  For the first 6 months, I had to visit him monthly to track my progress.  But a few months in, I could definitely see that my condition was improving.  By the end of 2023, my skin was smooth and looked like it had never been affected by eczema / psoriasis.  I continued the treatment for a few more months to treat some other parts of my body that still had some lingering signs of eczema (I had eczema when I was younger, am now in my 30s), and Dr Tang eventually (after about 1 year) discharged me when he deemed I had recovered.",
      "time": 1713838947,
      "translated": false
    },
    {
      "author_name": "raziff shariff",
      "author_url": "https://www.google.com/maps/contrib/106721782649740201923/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ65w4Ii5i0i0eBdQk6JiH09X74xCUo9dmrvT-A-4-2h_FDSA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Dr Tang is a compassionate and meticulous practitioner first and foremost. I came in 2 years ago with a very bad side effect on my legs due to taking Oral chemo medication daily for around 1 year before mtg him. I was suffering from blood cancer, hence the oral medication intake.\n\nBoth my legs up to the knees has its skin turned to black after cycling with my nieces one day,  with white flakes, itchiness and the most painful sensation( pain factor 8-9) I’ve ever felt. I was in total pain when I met him. I needed an immunosuppressant specialist and looking for alternative medical specialist to help me make sense on what is happening.\n\nWhen I met, straight, away he suspected it was an issue with hydroxurea(oral chemo medication). He gave me the right dosage of natural herbs in powder form and told me to take it for a few weeks and to see him again.\n\nThe moment I took the herbs, the intensity of the throbbing pain and itchiness I felt gradually gave way and pain factor drop to almost zero. I felt so much relief!\n\nFast forward now, my skin is almost cleared 90 percent, the toxicity level due to oral chemo has went down and I’ve change to an alternative medication for that. His advice and care every time we met has helped me stabilise and get healthier in all aspects of my health as well.\n\nThank You Dr Tang. I am ever grateful to you!",
      "time": 1715227899,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16018124969462468093",
  "user_ratings_total": 23,
  "vicinity": "05-01, 470 North Bridge Road, Bugis Cube"
}