{
  "formatted_address": "653A Punggol Dr., Singapore 821653",
  "geometry": {
    "location": {
      "lat": 1.3980787,
      "lng": 103.9192291
    },
    "viewport": {
      "northeast": {
        "lat": 1.399304580291502,
        "lng": 103.9204773302915
      },
      "southwest": {
        "lat": 1.396606619708498,
        "lng": 103.9177793697085
      }
    }
  },
  "name": "Tanjong Rhu Wanton Noodle (Since 1994)",
  "place_id": "ChIJDZpgR2Y92jERvP5Cg2sE0iU",
  "rating": 2.8,
  "reviews": [
    {
      "author_name": "SUSS Stop",
      "author_url": "https://www.google.com/maps/contrib/115004300688822679328/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK1ELY4SWxiLTND13sbpy5to8dAFSpcQ893QiVqBHoMZYbehw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "Having lived in Singapore for over 30 years, I’ve never felt the need to leave a Google review — until now. That’s how disappointing my experience was at this wanton noodle stall.\n\nIf I could give zero stars, I would.\n\nOn 26 April 2025, I made a special trip just to satisfy my craving, only to be met with one of the most baffling and frustrating encounters I’ve ever had. I queued behind a customer who ordered two bowls for takeaway. There was no one behind me. Just as it was my turn to order, the uncle at the stall abruptly told me he would not be taking any more orders. I was confused and asked him to repeat himself. The customer in front of me clarified that he said he was done taking orders.\n\nI asked him why, and only after a few tries did he explain that he was going to focus on cooking for delivery orders instead, and told me to come back another day. I even offered to wait, thinking it might just take a few minutes — but he coldly told me to wait 30 minutes to an hour if I wanted to.\n\nMind you, there was literally no queue and no one else around. I’ve had their noodles before — they usually take only 2–3 minutes to serve. It is just ONLY one bowl for me. This time, I was completely brushed off for no good reason.\n\nThis entire experience left a really bad taste in my mouth — not from the food, but from the service (or lack thereof). My family and I will NEVER return. Looking at the store’s low rating now even for a store that open for one year, I can honestly say I’m not even surprised.",
      "time": 1745691352,
      "translated": false
    },
    {
      "author_name": "Doraemon",
      "author_url": "https://www.google.com/maps/contrib/112665277904119154671/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX2VSCcaT9axvOwx2nD8XD3PgZ8V5VFnv420aocMSfLa6GlcEmN=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 3,
      "relative_time_description": "8 months ago",
      "text": "Kitty and I decided to try Tanjong Rhu Wanton Noodle for dinner before our cycling event.  We'd been here before for kway chap and were intrigued by the wanton mee stall that looked so inviting.  We were hoping for a delicious meal to fuel us up before our ride.  Kitty ordered the wanton mee, and she actually enjoyed it.  She said the noodles were good quality, and the overall flavor was good.\n\nI, on the other hand, ordered the shrimp dumpling mee and wasn't as impressed.  The noodles were good quality, but the soup was lukewarm, and I felt the seasoning was lacking.  It felt a little bland overall. The shrimp dumplings were tasty, though.  The prawn crackers and char siu were also good, but I found the wantons themselves to be less impressive compared to other places I've tried.\n\nOverall, while the food wasn't bad, I think Tanjong Rhu Wanton Noodle has room for improvement.  They could focus on the soup temperature, seasoning, and the overall flavor of the wantons.  We'd rate this place 3 stars based on our experience.",
      "time": 1725047010,
      "translated": false
    },
    {
      "author_name": "Andy Lee",
      "author_url": "https://www.google.com/maps/contrib/113937067165127510810/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVGw6jodYzRIkpE_MpOK1Drb9Uy57Qa9V4xYiuLixjXQvjPHZzhQg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "4 months ago",
      "text": "Very average noodles. Char siew not fantastic, noodles so so. Price very affordable $4.50. There are better alternatives.",
      "time": 1735978761,
      "translated": false
    },
    {
      "author_name": "HH Tan",
      "author_url": "https://www.google.com/maps/contrib/111191568841607507767/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXWMcHWSUC1uVSPQjTZj8XPLMYQCC8e9rhmiNIamwG5UqAFYqQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "The worst Wanton noodle store I have ever visited. Although food is considered above average.. but their staff have Terrible Attitude problem! Extremely rule to elderly…ask to add wanton and they never hack care... the person after me wanted to add noodles also been ignored. Shouted at customer even they make a wrong changes…\nWill never support such store again..!",
      "time": 1733232858,
      "translated": false
    },
    {
      "author_name": "Ramesh N",
      "author_url": "https://www.google.com/maps/contrib/115967493436495560576/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVJ5G4OLzE79D4Yss5ZTI46dAirdCBDSc38u59aBZg8gRL3iu9aZQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "4 months ago",
      "text": "Part of the Foodloft coffee shop chain.  Nice and springy wanton noodles. $4.50 for a standard small bowl.",
      "time": 1734853171,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "store",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2725245584322789052",
  "user_ratings_total": 98,
  "vicinity": "653A Punggol Drive, Singapore"
}