{
  "formatted_address": "377 Hougang St. 32, B1-09/10, Rivercourt 530377",
  "geometry": {
    "location": {
      "lat": 1.3630164,
      "lng": 103.8952549
    },
    "viewport": {
      "northeast": {
        "lat": 1.364581630291502,
        "lng": 103.8965911802915
      },
      "southwest": {
        "lat": 1.361883669708498,
        "lng": 103.8938932197085
      }
    }
  },
  "name": "Teeth Q Dental Surgeons @ Hougang Rivercourt",
  "place_id": "ChIJ1X4Gh6IX2jERGduLPwb9vhU",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Aryanti",
      "author_url": "https://www.google.com/maps/contrib/104414822976046745486/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWjxhFbvQl0PTo39WAmcBbUbUodLwenVxqlcxwey-J-PmiaPG3d=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Got 3 of my wisdom tooth out including surgery and they did an amazing job at it! The whole experience was painless and the constant communication made me feel more at ease. Also made sure I understood what needed to be done for my aftercare. Will definitely be coming back! Thank you❤️",
      "time": 1738808173,
      "translated": false
    },
    {
      "author_name": "-.- Un!que",
      "author_url": "https://www.google.com/maps/contrib/116660553300455928364/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWyzSMV2-esYkt7x2P1zJgyQafJX9B-pi29ftbXHQ_rPIQaBPFA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 weeks ago",
      "text": "This has been one of the most disappointing and frustrating experiences I’ve had with a dental clinic. I paid over $100 for a consultation that lasted less than five minutes, during which no treatment was provided. I was then told I needed to see another doctor for my case—at an additional cost of $100. The entire experience felt transactional rather than patient-focused. The information provided by the front desk was misleading and inaccurate.\n\nWhat left me even more upset was the lack of follow-up and accountability. I was assured that someone from the management team would get back to me after experience a misalignment in what was promised to us for the threatment, but no one did.\n\nIt has now been nearly six weeks, and I still haven’t received any proper response, despite the issue being escalated to Dr. Desmond Goh (the founder). After reviewing some of the other negative feedback, I can see a pattern in how concerns are handled—or rather, ignored.\n\nWhile this clinic has many glowing reviews, I would advise others to read both the positive and negative feedback carefully before making a decision. I personally chose this clinic based on its Google rating and regretted it in the end.\n\nAfter sharing my honest review, I also noticed attempts to interfere with feedback left on the platform as it was removed.\n\nAdditionally, I was surprised to see my name mentioned publicly in relation to my visit without my consent. This information was provided solely for the purpose of registering for treatment, and I believe its disclosure may have been a breach of privacy. I have since reported the matter to the relevant authorities.\n\nI sincerely hope my experience can serve as helpful insight for others. Dental care should be rooted in trust, professionalism, and respect—but sadly, I didn’t experience that here- and personally, i will HIGHLY NOT recommend anyone or friends to visit this clinic.",
      "time": 1746544657,
      "translated": false
    },
    {
      "author_name": "Wild Kiddo",
      "author_url": "https://www.google.com/maps/contrib/107398187676569143259/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ2rpC2dbDKvmL-ANrVXotsbnYroipL0ec_dJKG3kZ0y6pqBA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "I had a terrible experience with the doctors at this clinic. Their attitude was extremely poor, and the waiting time was outrageously long. The doctor's demeanor was far from professional. When I reached out to their WhatsApp business account for an inquiry, they took an unreasonably long time to respond.\n\nI genuinely don’t understand why people choose this dental clinic. The level of professionalism is severely lacking. I will never return and will avoid this clinic at all costs.\n\nAdditionally, the clinic staff who called to schedule my appointment seemed untrained and unsure of what she was saying. Multiple \" I am not sure\", \"you come down then you will know\". After seeing several other negative reviews, I now understand why.",
      "time": 1742875133,
      "translated": false
    },
    {
      "author_name": "Lunite",
      "author_url": "https://www.google.com/maps/contrib/108150903768814956678/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLs4quB8hPHgf171I9hYfDz-_W9JTyvFpZzgXbIbEyel9A7Sw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Been here for a wisdom tooth extraction. As a person with an irrational fear for dentists, Dr Grace is extremely gentle, explaining every step of the way in details. Appointment wise they are very punctual as well, with little to zero wait upon arrival to appointment time. 10/10 for efficiency and service!!",
      "time": 1737773231,
      "translated": false
    },
    {
      "author_name": "M J",
      "author_url": "https://www.google.com/maps/contrib/115346937067806554183/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKyrF-CXjAUe6ylovqJHm6T4svrv3OqFdSvC-0_MrXNMJWT9w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I recently tried the teeth whitening service, and I couldn't be happier with the results! My smile looks brighter and more radiant, and the entire process was quick and comfortable. The staff was friendly and professional, making the experience even more enjoyable. I highly recommend this service to anyone looking to enhance their smile!",
      "time": 1735533689,
      "translated": false
    }
  ],
  "types": [
    "dentist",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1566967923649272601",
  "user_ratings_total": 317,
  "vicinity": "377 Hougang Street 32, B1-09/10, Rivercourt"
}