{
  "formatted_address": "50 Anchorvale St, Singapore 544834",
  "geometry": {
    "location": {
      "lat": 1.3982693,
      "lng": 103.8842681
    },
    "viewport": {
      "northeast": {
        "lat": 1.399615680291502,
        "lng": 103.8857023802915
      },
      "southwest": {
        "lat": 1.396917719708498,
        "lng": 103.8830044197085
      }
    }
  },
  "name": "Tenderbest Makcik Tuckshop @ Sengkang Riverside Park (No reservations only walk-ins)",
  "place_id": "ChIJDUaCpCgX2jEResQ5FtpUra8",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "chin wey ngee",
      "author_url": "https://www.google.com/maps/contrib/113622753213418799728/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXaYWm-vS9aw67eOl92FtjDkq_OhA7PQsl-jqrz_4a7bd7zOBBrOQ=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Good food good ambient.  Windy & comfy.  Worth drop by if u r hungry after swim/ cycle/ run.   Enjoy greenery.\n\nRevisit for late dinner.  Whole chicken really well fried, juicy inside.  Can tell oil used is quite fresh.  Salad & vege is fresh as well.  Surprisingly Fries is better thn M.",
      "time": 1743781212,
      "translated": false
    },
    {
      "author_name": "Winston Teo",
      "author_url": "https://www.google.com/maps/contrib/103983640077681957103/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV5NzDT0ls7P0VYmKSCa_bJR9a9u_qvM1jhtYf94_gsl0KgUE6I=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I embarked on my first brunch at Tenderbest Makcik Tuckshop, nestled within the serene Sengkang Riverside Park. This spacious 110-seater restaurant offers both indoor and outdoor seating options, allowing diners to choose their preferred ambiance. With free parking and a cozy atmosphere, it's an ideal spot for a relaxing meal amidst nature.​\n\nDishes We Ordered:\n\nBaked Egg with Sourdough: A comforting dish featuring perfectly baked eggs nestled in a flavorful sauce, served alongside crusty sourdough bread, ideal for soaking up every delicious bite.​\n\nSmoked Salmon and Egg Benedict: A classic brunch favorite, this dish presents silky smoked salmon atop toasted bread, crowned with poached eggs and drizzled with rich hollandaise sauce.​\n\nEgg Omelette: A fluffy and well-cooked omelette, generously filled with a choice of ingredients, offering a simple yet satisfying option for egg lovers.​\n\nSizzling Caramelized Pisang Goreng with Ais Krim: A delightful twist on a local favorite, this dessert features crispy fried banana fritters caramelized to perfection, served sizzling with a scoop of creamy ice cream, creating a harmonious blend of warm and cold sensations.​\n\nBeverages:\n\nSalted Caribbean Affogato Drink: An intriguing fusion beverage that combines the bold flavors of coffee with a hint of salted caramel, offering a refreshing pick-me-up with a tropical twist.​\n\nVanilla Susu Drink: A smooth and creamy vanilla-infused milk drink, providing a sweet and soothing accompaniment to the meal.​\n\nTenderbest Makcik Tuckshop's extensive menu caters to diverse palates, featuring options ranging from local delights like nasi lemak to Western favorites such as fried chicken, pasta, and salads.\n\n#sedapinsg #shiokytai #supershiok\nSaturday, 29 March 2025",
      "time": 1743432045,
      "translated": false
    },
    {
      "author_name": "SY",
      "author_url": "https://www.google.com/maps/contrib/105747780294286305616/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJnTdIckGy2vzIRzbg7j2leY0IuUte63NKSwbQ9RO96D5Cm=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "4 months ago",
      "text": "Came here with my hubby, sometimes with family quite a number of times for dinner after my evening walk. Standard dropped so much compared to when it first opened. This time round is the worst. Chicken not as tasty and not well seasoned, so there is a raw chicken taste. Ordered the chicken salad, can’t even get myself to eat it anymore after a few leaves. Salad not fresh at all. Cook didn’t check, Manager also didn’t bother. Maybe they changed the cook? Left unsatisfied and unhappy. 4 stars for serving staff services, 2 stars for Manager. Manager’s role is very important for returning customers and new customers. Can see that sales dropped quite a bit. Not going back again.",
      "time": 1736252152,
      "translated": false
    },
    {
      "author_name": "XiNERGY LiN",
      "author_url": "https://www.google.com/maps/contrib/109799344462279679791/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUH767hYHMCJHQ72myC-dxReausXYyQR0qttjKF258Bj4Q_ZQceRQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "Have to be early if you want to dine here as they do not take reservations. Got there at before 6pm on Sunday and had to wait 30min before a table is available.\n\nDespite the long wait, food was ready within 15min of ordering. Everything there is self service,so just walk over to the collection counter.\n\nPrice is acceptable, food quality and portion is good too. As the restaurant is halal and under the branding of tenderbest, plenty of chicken items on the menu. The ambience of the place is not bad, located within the park.",
      "time": 1712746632,
      "translated": false
    },
    {
      "author_name": "Lydia Heng",
      "author_url": "https://www.google.com/maps/contrib/110477061035605935081/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVgYToMP5p9JWsgq148teS6fiPCdhqi6zceC5tXFjYbM-jIOnQo=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 2,
      "relative_time_description": "9 months ago",
      "text": "Pretty disappointing... Outlet to outlet standard differs. This wasn't good.\n\nThe food looked great, but unfortunately we won't be returning again except for the crispy chicken chop.\n\nInside AC seating was quite smelly to us so we sat outside instead which had a nice atmosphere.\n\nRating 5/10\n\n⭐ Crispy Skin Chicken chop\nChicken chop was great with crispy skin, but the chicken was too flat. Better if it was bigger portion or thicker.\n\n⭐ Half Spring Chicken with Aglio olio\n- not al dente, overcooked\n- aglio olio more oily but doesn't have the garlic taste\n\n⭐ Hawaiian Pizza\nWasn't spectacular. Mediocre. Not the thinnest pizza as proclaimed. The bread dough was nicer than the filling itself",
      "time": 1722874519,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12658867423260820602",
  "user_ratings_total": 289,
  "vicinity": "50 Anchorvale Street"
}