{
  "formatted_address": "56 Loyang Way, #04-11, Singapore 508775",
  "geometry": {
    "location": {
      "lat": 1.3804799,
      "lng": 103.976673
    },
    "viewport": {
      "northeast": {
        "lat": 1.381585530291502,
        "lng": 103.9777371802915
      },
      "southwest": {
        "lat": 1.378887569708498,
        "lng": 103.9750392197085
      }
    }
  },
  "name": "Teng Hong Renovate",
  "place_id": "ChIJp6R8mgwY2jERXEHC-C0fJuM",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Joel Ng",
      "author_url": "https://www.google.com/maps/contrib/104806059091091066981/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXbirEhpeZ1PGMnxvv_1Cx8KookdiJ_Mq5AZEfvUH_OZzEqZXlMGw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "We contracted Teng Hong to do an overhaul of our 3BR Condominium. It was an old condo with the last renovation done more than 10 years ago. Rayen helped us tremendously from the planning stage till the end. We had no Interior Designer so she literally had to play that part as well, and she offered many practical suggestions which we eventually adopted. I was particularly impressed with her willingness to accompany us to the various shops and offer her professional advice from a practical perspective while retaining aesthetic considerations. Overall, we felt that it was value for money and the pricing was reasonable with very good service offered.",
      "time": 1746777567,
      "translated": false
    },
    {
      "author_name": "Adeline Leong",
      "author_url": "https://www.google.com/maps/contrib/100063020830283318559/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIe3WGb-93gyveFw3C4uSUsvmXQYSWrJHwl75t4Wk4xnjhGmQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Our 2nd time engaging Teng Hong Renovate for our home renovation & definitely there are no renovation nightmares!\n\nEstablished good working relationships with Diana and team, communication was always clear and any questions or concerns were addressed promptly and most importantly resolved. The team always took extra miles to help whenever we faced any issues.\n\nWe are extremely pleased with the final outcome. The quality of work was outstanding—every detail was handled with precision and care. From the initial planning to the final touches, it was clear the team took pride in their craftsmanship.\n\nWe would strongly recommend Diana and team for anyone looking for high-quality renovation work.",
      "time": 1744809548,
      "translated": false
    },
    {
      "author_name": "Devika Mukherjee",
      "author_url": "https://www.google.com/maps/contrib/106636280361322071334/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV7tNEmiyRCtAM1HE8JHfeNVAUTeGohvlZEuZSmOHSERK7uth53=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "We renovated our first home (resale) with Teng Hong Renovate and Jun Hao managed the project from start to finish. We are very happy with the end result. The entire renovation was smooth with regular updates given by Jun Hao.\nHe made a lot of effort to truly understand what we wanted and gave us helpful and practical suggestions throughout. We added on quite a few things along the way and he always accommodated our requests and more importantly kept everything on schedule despite our short timeline.\nThe quotes provided were reasonable and pricing is competitive.We did the electrical, plumbing, carpentry and redid the entire bathroom including tiling. The quality of the workmanship for everything is good.\nWould highly recommend working with him!",
      "time": 1738501818,
      "translated": false
    },
    {
      "author_name": "alvin chng",
      "author_url": "https://www.google.com/maps/contrib/105532397837169420485/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVFaHV1FjLp2hxdYzyaCr-gd2FYte8Ps1oGYaKZBCd3CS5zkHQ=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Responsible and trustworthy company, completed the renovation project within the said timeframe.\nThe ID Ms Shu Han is very helpful and responsive too. She helped to get problems resolved.\nSpecial thanks to Shu Han for her dedication and she kept us on the progress of the renovation.\nWe were informed on the progress of the renovations .\nThe team that did the tiling work are very good, they have done a very good job, the finished job was to our expectations.\nThank you.",
      "time": 1738285420,
      "translated": false
    },
    {
      "author_name": "Tricia L (IG: 3travelog)",
      "author_url": "https://www.google.com/maps/contrib/105123071772086751190/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXQI4NTv9_xpIxHrawLdJpNkNeL4BSQ5Dn_AKddIyP_kk19Qioc=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I was recommended by a friend to engage Teng Hong Renovate and I will have no hesitation to recommend them to all my friends as well!\n\nFirst, we were living overseas when we contacted THR and I was put in touch with Rianne, who despite the huge time difference, was able to organise an initial call & quote.\n\nSecond, when we returned to SG, Rianne quickly organised a site visit to get the exact measurements, etc. so timing was perfect! She also took into account all my specific requests regarding measurements.\n\nThird, we engaged THR for a small project and regardless of that, Rianne and the team did not treat it as such. Other IDs may eschew smaller projects because it may not be worth their time & effort, but I never felt that this was my experience with THR.\n\nLastly, I appreciated that THR was able to install the cabinetry within two days. Super fast & efficient!\n\nOnce again, thanks Rianne and team!",
      "time": 1738820802,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "general_contractor",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16367804178032116060",
  "user_ratings_total": 36,
  "vicinity": "56 Loyang Way, #04-11"
}