{
  "formatted_address": "1 HarbourFront Walk, #02-143 VivoCity, Singapore 098585",
  "geometry": {
    "location": {
      "lat": 1.2634814,
      "lng": 103.8218274
    },
    "viewport": {
      "northeast": {
        "lat": 1.265092880291502,
        "lng": 103.8227083302915
      },
      "southwest": {
        "lat": 1.262394919708498,
        "lng": 103.8200103697085
      }
    }
  },
  "name": "Thai Accent",
  "place_id": "ChIJA7UOu1gZ2jERJBiW8FNGx3Q",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Isaac Sam",
      "author_url": "https://www.google.com/maps/contrib/108426703400532001032/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUW-13Wh8cKYmW9wqhB8JlLi0QuC1DVXDaFHN2kPvjkIM_rCN3f=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "Finding excellent vegetarian options for my mother can often be a challenge in Vivo, but our visit to this Thai restaurant was an absolute delight. The menu offered a thoughtful selection of authentic Thai vegetarian dishes, each bursting with vibrant flavours and fresh ingredients.\n\nThe *Pad Thai Jay* (vegetarian Pad Thai) was a standout—perfectly balanced with just the right tanginess and a satisfying texture. We also loved the *Coconut Soup*, which was aromatic and creamy, yet light on the palate. The staff were attentive and happy to confirm which dishes were fully vegetarian, putting my mother at ease.\n\nWill be back for the non-vegetarian dishes.",
      "time": 1746600427,
      "translated": false
    },
    {
      "author_name": "Angelia Ong",
      "author_url": "https://www.google.com/maps/contrib/107075617145166914342/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIe4U4pAo3yh1aBe6fAYwpAt9CFm0OoHAT6oQTD5gD36SmkNA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Thai Accent brings the heat and heart of Thai cuisine to the table. The stir-fried basil chicken was fragrant and fiery, packed with juicy chicken, chili, and crispy basil—an instant comfort dish. Their stir fry kailan with salted fish also helped to balance the spice.\n\nThe Tom Yum seafood soup, served traditionally in a hotpot, was a standout. The broth was tangy and aromatic with a gentle kick, packed with mushrooms, seafood, and herbs that warmed from the inside out.\n\nAuthentic flavors, generous portions, and a casual, welcoming vibe—definitely worth a visit if you're craving Thai food with real soul.",
      "time": 1743138846,
      "translated": false
    },
    {
      "author_name": "Todd Junck",
      "author_url": "https://www.google.com/maps/contrib/116397368236873168764/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW7i-ZZOg7mwoRKrEeSSReHOw6A_qxt_4SxnJGJOdRU5l0RjOTnaA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Nice restaurant, not busy, and very good Thai food. It was nice to get away from the crowds in the mall. We had prawn cakes for an appetizer (delicious) and a green curry dish for a main course. We shared both and it was enough food for lunch. The lychee juice drink was delicious too! Friendly staff, but they didn't have WiFi for customer use here.",
      "time": 1740987326,
      "translated": false
    },
    {
      "author_name": "Toon Tran",
      "author_url": "https://www.google.com/maps/contrib/102078641965155497930/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWZj_ozK67YD0vUUpBQSjRzrxoJndFacBNmoJa0ee-_aRn9sWCk=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "Thai Accent at VivoCity is a fantastic spot for anyone craving authentic Thai flavors with a view! Located on the second floor, the restaurant overlooks the scenic waterfront, offering a peaceful ambiance that enhances the dining experience.\n\nThe menu is extensive, featuring all the classic Thai favorites like Pad Thai, Green Curry, and Tom Yum Soup. Each dish is prepared with fresh ingredients and the perfect balance of spices, capturing the true essence of Thai cuisine. The portions are generous, and the flavors are rich and aromatic without being overly spicy—although you can request extra heat if you’re up for it!\n\nThe highlight here is the pineapple fried rice, beautifully presented in a carved-out pineapple, and the mango sticky rice for dessert, which is sweet and refreshing. The service is friendly and attentive, with staff who are quick to offer recommendations and ensure a pleasant dining experience.\n\nWith its delicious food, welcoming staff, and beautiful views, Thai Accent at VivoCity is a great choice for a relaxed meal with family or friends. Highly recommended for anyone looking to enjoy authentic Thai food in a comfortable and scenic setting!",
      "time": 1730684701,
      "translated": false
    },
    {
      "author_name": "Ong Zhi Yuan",
      "author_url": "https://www.google.com/maps/contrib/104417804420531473764/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXIKT6Cu9TEMxrk2g1XVOPPdJDxx3WhsAXEK-kpKj4513VdnYs=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I went to Thai Accent for a team lunch, and we ordered a bunch of dishes—every single one was fantastic. Authentic Thai flavors all around, but a special shoutout has to go to their pandan leaf chicken. Wrapped in pandan leaves, the chicken was incredibly tender, perfectly marinated, and bursting with umami in every bite. It was hands down the highlight of the meal.\n\nOther standouts included the seafood tom yum soup, which was packed with seafood and had just the right level of spice, and the fried rice, which was smoky and packed with flavour.\n\nDespite our large order, the food arrived quickly, and the staff were super friendly and attentive throughout. I’ll definitely be back, and if you’re into authentic Thai food, this place is a must-try. 9/10.",
      "time": 1736227692,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8414771755097659428",
  "user_ratings_total": 822,
  "vicinity": "1 HarbourFront Walk, #02-143 VivoCity"
}