{
  "formatted_address": "2A Jalan Seh Chuan #01-071 Bukit Timah Wet Market & Food Centre (Interim, Singapore 599213",
  "geometry": {
    "location": {
      "lat": 1.341027,
      "lng": 103.7748995
    },
    "viewport": {
      "northeast": {
        "lat": 1.342374830291502,
        "lng": 103.7761012802915
      },
      "southwest": {
        "lat": 1.339676869708498,
        "lng": 103.7734033197085
      }
    }
  },
  "name": "thatsmypizza.sg @Bukit Timah",
  "place_id": "ChIJAZgwpuER2jERC6_n9ol_lZg",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Melissa Eisner",
      "author_url": "https://www.google.com/maps/contrib/117316308946167178763/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocInzITBbs1kXHipsTJdwwrMde7hDOKObbB0vpNxOQgGNOJiyWnr=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Before you judge the amount of pizza in this post, please know 2 things: 1) I had done a 13km walk across Singapore and 2) There were 7 of us in total eating pizza. That said, incredibly indulgent pizza overload at @thatsmypizzasg that was worth every calorie.\n\nBy now you’ve looked up and seen that the Bukit Timah location is at a hawker market, and you’re like … good pizza at a hawker? Girl, you’re crazy! But I’m telling you, great pizza can come from such  a humble location.\n\nWe tried one each of the 4 bases: truffle white, rosemary garlic, pesto, and tomato. There really wasn’t a bad pizza in the whole lot, just different favourites based on different likes. Universally the crusts were magical - that perfect balance of crispy crusty goodness with the right level of chew. The truffle white with portobello was my personal favorite, anything truffle and mushroom is heavenly to taste. The close runner up for me was the tomato base four cheese pizza, stinky cheese is my jam, and they serve it with honey which just adds to the overall flavor.\n\nThey have a sister restaurant in the same hawker market that serves beer, which is the perfect compliment to the pizzas. And they make sourdough bread to boot, probably explains why the pizza crust is so good. This spot is a must try! Highly recommend!",
      "time": 1742477587,
      "translated": false
    },
    {
      "author_name": "Lee Joonmin",
      "author_url": "https://www.google.com/maps/contrib/105182720697493057327/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUgjh0idQw0_MnhqSbuqcOdKKqRKn7MnHOYS1huE-60UDU3hwFLxw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "The Truffle White Four Cheese pizza was seriously good. The crust was perfect—crispy on the outside, soft on the inside. The base had a nice chew, and the cheese was super melty and rich without being too heavy. You can really taste the truffle too, not overpowering but just enough.\n\nThey give you honey on the side to drizzle over it, which sounded a bit odd at first, but it actually works really well. That sweet-savoury combo is kind of addictive.\n\nI also tried the Pesto Prosciutto pizza a few weeks back, really good stuff as well, if Prosciutto is something you fancy.\n\nAfter you’re done with the pizza, walk across the carpark to thatsmybrew and get yourself a pint of stout. Perfect combo!",
      "time": 1743917407,
      "translated": false
    },
    {
      "author_name": "Lourens Reijgersberg",
      "author_url": "https://www.google.com/maps/contrib/110946028363952594608/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWgxo7Jb8aMvbL437-YNUJCfkqaSmG9yAYLl0dqZx_8UpsqN1hW=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Dough is nice and chewy, tomato sauce is good and not overwhelming or too much, mozzarella also nice milky and chewy. Overall very nice pizza! Staff is nice and friendly, I had to wait a bit , but fine for me, I’ll just get some of the craft beer next door. Not in a hurry… just enjoy life 😀\n\nFor people complaining about price… I make some pizza myself and good ingredients are not cheap and it makes time to ferment nice dough, just that it is in a hawker center does not mean you get 5 dollar pricing. I’ll be coming back for some beers and pizza! 🍕",
      "time": 1731244189,
      "translated": false
    },
    {
      "author_name": "I P",
      "author_url": "https://www.google.com/maps/contrib/109158617005255532631/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX7Pz0J_tMn5AM748BhA7AeVKOX-O3jCDuQrNmcOKtEear-wpw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "First time trying, ordered the tomato based Parma Arugula 🐷\n\nThe pizza is freshly baked upon order and it’s very tasty - the dough is not too thick and is soft & chewy. The mixture of flavours is also on point.\n\nIt’s good that they have a preorder system to avoid long waiting time. Very efficient 👍🏻 Will definitely come back to try the other flavours.",
      "time": 1746442535,
      "translated": false
    },
    {
      "author_name": "Æ",
      "author_url": "https://www.google.com/maps/contrib/107282898183587148287/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXp-LQslYAgbZ5C7OS8xWjEBP6RFia8zmr83vuaUAcz42q2xle8=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "Authentic handmade sourdough pizzas that held their own flavour-wise. What struck me more was the price. Total damage was $64 for two boxes of small pizzas which were only good enough for 2 people, maybe 3. This is the kind of price I was expecting from the more upmarket pizzeria in the city. Anyway, that didn’t deter anyone as they had plenty of orders so much so that wait times averaged 20-30 mins. I don’t mind coming back again to try the other flavours but it will probably be for a special occasion. Also the pizzas were quite badly burnt on some of the slices (see pic). Something that the owners should take note as there are others who have highlighted as well.",
      "time": 1736094476,
      "translated": false
    }
  ],
  "types": [
    "meal_takeaway",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10994834295824559883",
  "user_ratings_total": 405,
  "vicinity": "2A Jalan Seh Chuan #01-071 Bukit Timah Wet Market & Food Centre (Interim"
}