{
  "formatted_address": "90 Eu Tong Seng Street #01-03 C.I.D.C Blk A, 90 Eu Tong Sen St, Singapore 059811",
  "geometry": {
    "location": {
      "lat": 1.2834041,
      "lng": 103.8419018
    },
    "viewport": {
      "northeast": {
        "lat": 1.284726730291502,
        "lng": 103.8432887302915
      },
      "southwest": {
        "lat": 1.282028769708498,
        "lng": 103.8405907697085
      }
    }
  },
  "name": "The Dive Company",
  "place_id": "ChIJ8VtC1rYZ2jERlOOOqf7DnZM",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Yvonne L",
      "author_url": "https://www.google.com/maps/contrib/117406456618565197947/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW3losYwu55-gdG7wv29uKVTHmOqI2JgObhykk_wh6Vn9PJjRdR=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Had my first leisure dive trip over a weekend in Tioman with TDC. What a great experience, thank you Rafi and Josiah - great vibes and responsible instructors. I felt very well taken care of throughout the trip :-)",
      "time": 1745824545,
      "translated": false
    },
    {
      "author_name": "Fathanah Paijan",
      "author_url": "https://www.google.com/maps/contrib/116678832130262180294/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKP3Ga7W4bp0KyJWGn-jND1IwWYJsoH0sJLyWA9nr5zFGu1=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Starting off this journey, I was a little anxious and uncertain. But I am proud to say that I emerged out of the waters as a confident diver at the end! A huge thank you to Rafi for his constant patience and reassurance. His gentle guidance kept me calm and safe underwater. I naturally enjoyed each dive. The entire process and itinerary was thoughtfully planned indeed in ensuring your success in becoming a certified diver. Thank you to The Dive Company for making my first diving experience a memorable one!",
      "time": 1746674631,
      "translated": false
    },
    {
      "author_name": "Fawn Lin",
      "author_url": "https://www.google.com/maps/contrib/116260373680654602073/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIsOApPlFRshEjM0gY91dM7-5wlAxheTwgXkAUDQ1eY1HyRZw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I had always wanted to try scuba diving since I was 21 and was finding a buddy or friend to learn with me but to no avail... T-T Nonetheless, I plucked up my courage after 3 years (finally) and decided to sign up for the Open Water PADI Certification at Tioman Island with The Dive Company. I have to say it is one of the BEST decision of my life~ Being able to learn from such amazing instructors / dive masters have been such a memorable experience! There were many times where I was a bit clumsy in learning the techniques but both Rafi and Shaun would always be very patient and will remind us on the important factors to learn the various skills. Emphasis is also placed on safety so don't worry you are in safe hands!! Many thanks to Rafi and Shaun! :)\n\nNot only were they great instructors, but having signed up for the course alone, they were very welcoming and would always check in to make sure I'm alright! Being so friendly and approachable allowed me to feel that it is not a course but a fun adventure to make new scuba friends! We were not only able to do the dives but able to chill out by the beach and have friendly conversations which forms part of the memories~\n\nRafi and Shaun are really passionate divers and being able to hear their stories may really influence you to start liking it even more! Also, not forgetting Ken who was the dive master for the leisure divers. Despite not learning from him directly, he was very friendly in sharing his diving experience and was a really good guide in briefing us throughout the trip! Really appreciative of them making this experience so memorable and fruitful!! Will definitely sign up for the leisure dive trips with them when I have the chance! Definitely would 10/10 recommend this diving center if you want to go for any leisure dives or pick up a new skill/hobby~ Don't be afraid to step out of your comfort zone :)\n\nP.S. Was truly blessed with great weather and good visibility of water~ The scenery and being able to swim with the marine life is so surreal ",
      "time": 1698059861,
      "translated": false
    },
    {
      "author_name": "Yeo Wei Jie",
      "author_url": "https://www.google.com/maps/contrib/100898864816568493062/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWLpeRRYhfQ67TmP7pz-5SHtq0nXUORRDRhZst2kZdw3kn_ixrC=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Completed my Open Water Diving course with Rafi in Tioman after numerous recommendations by all my diving friends! I can say that it was a unforgettable experience! Right on from the confirmation to the pool session to actually completing the entire course, Rafi and his team have been truly professional and passionate in their craft! You would definitely be in good hands!",
      "time": 1695625176,
      "translated": false
    },
    {
      "author_name": "Christine Z",
      "author_url": "https://www.google.com/maps/contrib/103361874728203910166/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIn0nZIj62OAoR_o3AwqxN2yzW5A4u0c9DXYHUIDuoeK_uD7Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Recently completed an OW diving course with Rafi and Alvaro and it was an incredible experience. They are highly knowledgeable, patient, and ensured that all of us felt comfortable and safe throughout the course. They took the time to explain everything clearly and provided hands-on training to help us develop the necessary skills.\n\nThe equipment provided was well-maintained, and they went above and beyond to make sure everything was in working order. Their passion for diving was infectious, and they shared valuable insights and tips that were helpful even outside of the course.\n\nOverall it was an amazing experience and I highly recommend here to anyone looking to learn or improve their diving skills. Thank you for an unforgettable experience!",
      "time": 1681202656,
      "translated": false
    }
  ],
  "types": [
    "travel_agency",
    "school",
    "store",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10636873393452802964",
  "user_ratings_total": 167,
  "vicinity": "90 Eu Tong Seng Street #01-03 C.I.D.C Blk A, 90 Eu Tong Sen Street"
}