{
  "formatted_address": "29 Tanglin Road, Lobby Level, The St. Regis Singapore, Singapore 247911",
  "geometry": {
    "location": {
      "lat": 1.3056768,
      "lng": 103.8260238
    },
    "viewport": {
      "northeast": {
        "lat": 1.307213680291502,
        "lng": 103.8274395302915
      },
      "southwest": {
        "lat": 1.304515719708498,
        "lng": 103.8247415697085
      }
    }
  },
  "name": "The Astor Grill by St. Regis",
  "place_id": "ChIJqarwp7MZ2jER7TPWO7ZYhK8",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Kelias Quek",
      "author_url": "https://www.google.com/maps/contrib/102455125673888414066/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUnnqKgHJhJHQteS20SNf4c1M3la-iNZ0I5iIXGCnQP-p8vnJSkaw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "During our recent staycation at St. Regis, we decided to keep things simple and dine at the hotel’s lobby restaurant instead of venturing out. The experience was decent — the food was good but didn’t really offer anything particularly exciting or remarkable. It was solid, satisfying, and exactly what you’d expect from a hotel restaurant, but nothing that would make you rave about it afterward.\n\nOn the other hand, the service was impeccable. The staff were extremely attentive and went out of their way to ensure our comfort, though this might have been partly due to the relatively low number of customers that evening. Regardless, the service definitely elevated the experience, contributing to an overall pleasant and relaxed vibe.\n\nAs for the atmosphere, it was welcoming and contributed to a laid-back dinner experience. While the food didn’t impress, the overall ambiance and attentive service made it a nice and easy choice for a meal without the hassle of leaving the hotel.\n\nOverall, it was a good meal for a night when we were looking for convenience and relaxation. If you’re staying at St. Regis and don’t feel like heading out, this restaurant provides a solid dining option, though don’t expect anything extraordinary.",
      "time": 1739704976,
      "translated": false
    },
    {
      "author_name": "TS",
      "author_url": "https://www.google.com/maps/contrib/106276131202764486394/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWvjRR0wEAV9yexD4m8wI0HFmWMlKmMkcgKYtB9sOV6vXLcD2AX=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "We visited The Astor Grill for Chinese New Year Eve dinner during our stay at St. Regis Singapore, and it was a fantastic experience. The service and food were both exceptional, with the staff being particularly impressive – all the waiters were highly accommodating and well-trained.\n\nThe restaurant specializes in fine meats, but they also offer a selection of fish, lobster, and other dishes. One unique touch that stood out was their selection of knives, allowing guests to choose the one they prefer for their meal.\n\nOne area for improvement would be the addition of music, whether live or recorded, to enhance the ambiance and elevate the overall dining experience even further.",
      "time": 1738303600,
      "translated": false
    },
    {
      "author_name": "Thomas Ng",
      "author_url": "https://www.google.com/maps/contrib/110820475118553879520/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLX2so5mAnqnbt9EycqZ8NcOeJ6593LQ10hDmfkKYIXUb4DRg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Feel so happy to dine in Astor Grill. The food is delicious, and the service is very good.\n\nOnly downside is the butter which is hard, because it’s taken from the fridge directly.\n\nThe CREAMY REGIONALLY-SOURCED SPINACH is really good.",
      "time": 1741765390,
      "translated": false
    },
    {
      "author_name": "SZ Lim",
      "author_url": "https://www.google.com/maps/contrib/114108831723577323443/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIACEKucLGfg0Gi6Py-eUqV4jnqbmvAVx8zKN66BIIiv7h9Rg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "We went for the Wednesday Wonders of the Sea buffet. We had the DBS promo which gave us second diner pays 50% off.\n\nSecuring the reservation was easy via their website, and few days before the buffet we actually got a reminder from them via WhatsApp. We requested for a quiet spot and was given a nice corner by the window which was just what we wanted. It was also the corner for which we sat many many years ago. So we had a very good feeling from the start.\n\nTheir service staff are very friendly and nice with smiles the whole night. Definitely 5 star service. They were quick to keep the plates once we were done. However, a point of improvement might be the need to monitor whether customers would want more water / drinks top up. A review I read previously also indicated this issue.\n\nFood wise, the choices are really limited. But with the promotion, and with a clear target in mind, this was exactly what I wanted. I wanted a king crab buffet which doesn't cost a bomb and I don't really need too much variety.\n\nThe seafood was of really good quality. Totally love the oysters. They were soooo creamy. As for the king crabs, haven't had one before so it was a new experience for me. Can't comment much but the meat was pleasant with a tinge of saltiness. I tried different parts, and even had two claws. Was happy that I did not have to queue to get the food which is usually an issue for other buffets with lobsters or king crabs. I went to refill quite a number of times and saw them refilling constantly.\n\nThe cooked hot food was really good as well. The catch of the day and the breadcrumbs salmon was just so juicy and so evenly cooked. Definitely way better than your typical buffet quality. I enjoyed the cooked chilli lobster pincers and also the clam soup which had a strong wine aftertaste.\n\nThe desserts were few but not too bad. Would say they are pretty average but I leaned more towards their chocolate-based desserts.\n\nThey even gave us an anniversary cake and allowed us to bring it back home (being that it's a buffet and we would like to indulge in their buffet desserts duh). That was quite thoughtful and really really appreciated. They had a lighted candle so we took photos with it first before they packed it up for us.\n\nOh and we realized how good their olive oil was at the end of the whole meal when we tried it with the bread. Despite it being weird, we tried it with the grilled prawns and we were so happy with it.\n\nOverall it's a very good buffet. Not too many choices but who needs choices when u have good quality food?",
      "time": 1736342584,
      "translated": false
    },
    {
      "author_name": "cecilia c",
      "author_url": "https://www.google.com/maps/contrib/101322756278349400860/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV00PyZ3-8bvdmEEFQdeulWWBUxg9tHCJw7eyw0V2Rt65YvvqiZkA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Exceptional Dining Experience at Astor Grill by St Regis!\n\nWe celebrated my daughter's birthday at Astor Grill by St Regis, and it was truly an unforgettable evening! The entire experience was top-notch, thanks to the outstanding service, delectable cuisine, and elegant ambiance.\n\nSpecial mention to your incredible waitress, Inna, whose service went above and beyond! Her attentiveness and thoughtfulness were remarkable. When she overheard us mentioning my daughter feeling chilly, Inna promptly offered and brought her a shawl, ensuring her comfort. Her warmth and genuine care made our evening even more special.\n\nThe food was exceptional!",
      "time": 1730025449,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12647331193274381293",
  "user_ratings_total": 401,
  "vicinity": "29 Tanglin Road, Lobby Level, The St. Regis Singapore"
}