{
  "formatted_address": "108 Gerald Dr, #01-26, Singapore 799035",
  "geometry": {
    "location": {
      "lat": 1.3870809,
      "lng": 103.8789194
    },
    "viewport": {
      "northeast": {
        "lat": 1.388367330291502,
        "lng": 103.8800170802915
      },
      "southwest": {
        "lat": 1.385669369708498,
        "lng": 103.8773191197085
      }
    }
  },
  "name": "The Milestone Academy",
  "place_id": "ChIJgxWgQ2cX2jER-VaBKwO2gkA",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Darrell Lin",
      "author_url": "https://www.google.com/maps/contrib/105814643280258122404/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ_02WCRtWBQOjdiWbTx87xoZZ56iG0IMY_G4kFvO6dVgckcw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Our son with ASD has been attending TMA for over 2 years and has shown great improvement in terms of attention span and interaction ability. The staff team is very patient with him and accommodating to do home-based therapy sessions in addition to centre-based sessions. Will certainly recommend for families with special needs!",
      "time": 1734149651,
      "translated": false
    },
    {
      "author_name": "Melody Yap",
      "author_url": "https://www.google.com/maps/contrib/103522463715265801422/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVnP5eCkaOX0SPJXJuGx6dNOYKqj0lOiKAFuo2feSKUzX6clUCe-w=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "We have seen major improvements in our son's ability to cope with daily activities, and it's all thanks to the teachers there who are always so patient and willing to guide. Therapy plans are tailor made according to each child's needs and abilities, and are reviewed periodically with the parents to ensure they stay relevant to the parent's expectations. I am glad to have found The Milestone Academy and I believe that many other special needs children will be able to benefit from their expertise and experience in such therapy",
      "time": 1678167080,
      "translated": false
    },
    {
      "author_name": "Cindy Lim",
      "author_url": "https://www.google.com/maps/contrib/116015925700808760603/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJe-9JQPRTPz3rDRfnewM0KaKJh1gUZBJ_4GxyZSLrCl8LuqQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "My child is with The Milestone Academy for coming to 2 years now.  The school and teachers are dedicated to help and support my child's development through programmes and therapies tailor-made for my child. My child has thrived and improved much more than i have expected.  My child always look forward to lessons and thoroughly learn and enjoy them.\n\nWe are glad to have found The Milestone Academy.  We have previously spent on other therapies that were not well suited for my child. But going to The Milestone Academy changed that and my child's constant improvements can be seen!\n\nThank you Ms Hannah and all teachers in The Milestone Academy for your patience and dedication for our special children!",
      "time": 1676694067,
      "translated": false
    },
    {
      "author_name": "Luxshmi Bhat",
      "author_url": "https://www.google.com/maps/contrib/116408873339952587358/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLE0mLP50f6arPxuF4JzMvnF9ssolKmoslzVZZZPr05KmR-VA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Our son has been attending sessions at Milestone Academy for almost four years now. He has shown lots of improvement in fine motor and life skills since then. He enjoys his sessions at TMA. His attention span has improved significantly and he is now more willing to do tasks such as eating on his own, putting on his clothes. Since the beginning, the teachers have been very patient and caring. I believe their attitude and acceptance has helped him feel at home, thus motivating him to cooperate during sessions. The current location of the centre too is very peaceful and conducive for children with sensory needs. My sincere thanks to the team at TMA for their wonderful efforts in ensuring our kids feel comfortable and well-cared for, which plays a key role in their development and progress. :)",
      "time": 1680702567,
      "translated": false
    },
    {
      "author_name": "Uma Sangari Naidu",
      "author_url": "https://www.google.com/maps/contrib/118174870729735093172/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXutu6cuB7p5fiId4gnmLR_u-GqXM1z2gWCrYVbG0OY5V01zoISWQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I found this place via google. Called and spoke to Ms Hannah and was very glad that I made the decision to send my son to The Mildstone Academy. They have a very friendly and caring teaching staff and team who loves and teaches according to my son’s need as well as mood and readiness. I can see a lot of good changes and progress in my son’s learning journey within a month attending session at The Mildstone Academy. He enjoys and look forward for his classes with Teachers. Thank you The Mildstone Academy, Ms Hannah and her team of teachers for giving a happy and wonderful environment for my son to learn and grow. Thank you.",
      "time": 1702361062,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4648477890130827001",
  "user_ratings_total": 9,
  "vicinity": "108 Gerald Drive, #01-26"
}