{
  "formatted_address": "458 Joo Chiat Rd, Singapore 427671",
  "geometry": {
    "location": {
      "lat": 1.3062168,
      "lng": 103.9045221
    },
    "viewport": {
      "northeast": {
        "lat": 1.307607580291502,
        "lng": 103.9059368302915
      },
      "southwest": {
        "lat": 1.304909619708498,
        "lng": 103.9032388697085
      }
    }
  },
  "name": "The Melting Pot JC",
  "place_id": "ChIJxZsq86EZ2jER8qDffqwMY1w",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Dina Sarah Art",
      "author_url": "https://www.google.com/maps/contrib/114731286484363422337/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVgSQUcejDx1-r7EMAs2U8IziLusELGYjhcD_htorSZCYOwoRE=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "If you’re a roast beef lover this place is a must-visit! They are only available on every Sunday.\n\nThe beef was perfectly cooked, tender, juicy, and packed with flavor. The portions were generous, and the gravy had just the right balance of richness. Beyond the food, the atmosphere was just as impressive warm lighting, rustic decor, and a cozy buzz that made the whole experience feel special. Whether you’re with friends or on a quiet date it’s a great spot to relax and indulge in a hearty meal.\nAlso, There is a server name Sarah, she is very attentive and hospitable 😊\n\nAmazing Sunday indeed ❤️",
      "time": 1746951657,
      "translated": false
    },
    {
      "author_name": "Kitsune Risu",
      "author_url": "https://www.google.com/maps/contrib/113204175469258071224/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVdvM5_e8rQa_62mSnjAnMGDqj1W40rKubyhwybpWLnytekKg_6=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "I'd slept on this place for too long. As a non-drinker, I'd always passed by because it felt primarily like a drinking spot. However, there was a menu plastered outside advertising the menu and I stopped in for a Sunday Roast.\n\nAnd let me say it was fantastic. The meat had not a single stringy piece of sinew and fell apart at the fork. The gravy was incredibly rich and red-winey, and the yorkies are the best I've had in SG, even beating out some British Pubs here.\n\nThere is also a selection of alcohol free drinks which they do NOT skimp on as well. I had a cucumber gimlet, which was every bit as complex and deep, and not just simple fruit water that other restaurants might peddle as a 'cocktail'. Clearly, a lot of care, love and pride goes into the food, as is reflected by the warmth and friendliless of the staff and owner.\n\nAlso the gravy. I want to die in a vat of that gravy. I want to marry that gravy and be a disappointment to my parents. The gravy is fantastic. More gravy please.\n\nGood food thanks.",
      "time": 1746948482,
      "translated": false
    },
    {
      "author_name": "Sharon Pillai",
      "author_url": "https://www.google.com/maps/contrib/110896109343427851844/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI3GPg80faXTtwoHXtBAul3PMEA8SIUmYN_TeSYLsUk-jnVEw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "The Sunday roast was absolutely delicious. The portions are huge and worth every dollar. Lamb samosas are a must try and fries came with a special chilli sauce that was unique and delectable.  Another highlight is the mutton pizza which is very hard to come by and it was subtle on the heat and there was so much lamb on the pizza which was the best.\n\nThe mojito is the best drink I have ever had, I have tried many and nothing has come close to the taste of the drink. Loved the ambience, was transported into old London with an art gallery feel. This is a must place to visit, eat and drink. The staff are very attentive and acceded to our requests.  Lastly, the burnt cheese was smooth on the palate. The best Sunday lunch outing with the family.",
      "time": 1741677698,
      "translated": false
    },
    {
      "author_name": "CAY Goh",
      "author_url": "https://www.google.com/maps/contrib/109282705874145910123/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIlnf15urVzVptK8MBDOI1_LqUE2zpU5qqY6BcMIXTKhfzZSUo=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "New gastrobar on busy Joo Chiat area!! Subtle luxurious interior and ambience with extensively ranges of cocktails!! Must try their Tokyo Tembeling, Ceylon Road and for dessert drink I highly recommend Midnight Peanut Butter after deviousness on their cheese platter, beef sliders to fusion dishes!!",
      "time": 1729604224,
      "translated": false
    },
    {
      "author_name": "Natasha S",
      "author_url": "https://www.google.com/maps/contrib/103222589515500979133/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX_QRPlAOPs_0w2TGkVnHNESxBh7rES0IlTa82-wjRhuiSs6jQv=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Had the opportunity to have some drinks and light bite here for the first time. The ambiance here is perfect, so cozy and beautifully decorated. You can tell they put a lot of thought into every detail of the decoration. It made my dining experience even more special and would be perfect for a date night. Nevertheless there’s many options for their specialty cocktails. I had the ondeh and the banana pisang cocktail which tasted ‘very’ unique (chef’s kiss). For food wise, I had the burger sliders, amazing flavors and beautifully presented dishes! Every bite was a delight. Highly recommend!. Service wise, owner and staff are so welcoming and friendly. Incredible experience. Will definitely come back to try more cocktails and their food as well!!! Looking forward to coming back here. 😍 I highly recommend. ⭐️⭐️⭐️⭐️⭐️",
      "time": 1729867103,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6657178609186218226",
  "user_ratings_total": 28,
  "vicinity": "458 Joo Chiat Road"
}