{
  "formatted_address": "6 Napier Rd, #08-11/12 Gleneagles Medical Centre, Singapore 258499",
  "geometry": {
    "location": {
      "lat": 1.3069561,
      "lng": 103.8202005
    },
    "viewport": {
      "northeast": {
        "lat": 1.308128580291502,
        "lng": 103.8214892302915
      },
      "southwest": {
        "lat": 1.305430619708498,
        "lng": 103.8187912697085
      }
    }
  },
  "name": "The Aesthetic & Plastic Surgery Clinic - Dr Seah Chee Seng, Dr Wong Manzhi",
  "place_id": "ChIJ1-H_JyAa2jERT-qGvhS9OtI",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Misao",
      "author_url": "https://www.google.com/maps/contrib/107428002043962968153/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVkcTl7efTbJ9wM7zQzwb01YankcmNgr6jh5i59y2PSvyCzecyJhg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Dr. Wong Manzhi is very meticulous with her work, she operated on my mother’s breast after tumor removal. The stitches she’s done was very tidy and heals properly. She was recommended by our cancer doctor and shows amazing results. Dr. Wong also cares a lot about her patients and always make sure to respond fast whenever we need her assistance through Whatsapp.",
      "time": 1744010078,
      "translated": false
    },
    {
      "author_name": "Fariah Haidah",
      "author_url": "https://www.google.com/maps/contrib/107557667586086635132/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVriSCMXPVKhqYCYB25q6EB0B8rA2JPSxKmem6qKn9_luEEb28=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "A couple of months ago, I had surgery with Dr. Wong Manzhi, and I couldn’t have asked for better care. She is not only highly skilled but also incredibly humble and kind, taking the time to explain everything and ensuring I felt completely at ease.\n\nHer team was just as caring and professional, making the entire experience smooth and reassuring. Thanks to their dedication, my recovery went well, and I felt fully supported throughout.\n\nI’m truly grateful for Dr. Wong Manzhi and her team and highly recommend them to anyone in need of excellent medical care! :)",
      "time": 1741946236,
      "translated": false
    },
    {
      "author_name": "Janice Lee",
      "author_url": "https://www.google.com/maps/contrib/111944532165567071909/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ3S44DfDgGKl5iTtldObgsMyoynpbu7ca1suI9GZfq8U8VbA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Dignosed with breast cancer in Apr 2024, opted for full mastectomy with recon. My specialist recommeded Dr Wong Manzhi. First impression is oh whoa, Dr Wong look stern, suprisingly, she is pretty patience and explained in details what are the options that I have and the pros n cons depending on which type of recon i choose. After the ops, the following ups with her proved her professionalisim n caring beyond her capacilty. Dr Wong is the 2nd doc that I had seen and after consultation with her, initially,\nI felt at ease with her and decided to go for the recon with her though initially I am unable to decide on whether I want or not. Am truly grateful to Dr Wong and her team who have shown care and patience throughout the most vulnerable period for me.",
      "time": 1743645751,
      "translated": false
    },
    {
      "author_name": "Alexia Choo",
      "author_url": "https://www.google.com/maps/contrib/101522810605472785440/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIC98h0lWWwypKNPr5f4Ql8eLuuiFZzzsbyPRrbd9RMxA3j0w=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I am thankful to have Dr Wong support during my mastectomy and breast reconstruction journey. I still recall my first visit with her - she spent a long time to explain to me all about reconstruction and the options I had to fill up the breast, this allowed me to make a well informed decision. Her medical expertise are top-notch and she really spends a lot of time on her patients. Thank you dr Wong again and see u next time!",
      "time": 1744167748,
      "translated": false
    },
    {
      "author_name": "L L",
      "author_url": "https://www.google.com/maps/contrib/115317107757338243018/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKyFMTzO9uDbDXMn0sNCQ4cGUs3yBrDhhU1x0e2icL0uVE2qQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I am pleased with the exceptional care I received from Dr Wong Manzhi and her team! From the initial consultation to the post-operative follow-ups, I felt informed, comfortable, and supported throughout the entire process.\n\nThe surgery itself was seamless, and the recovery was surprisingly smooth.\n\nThe entire staff, from the front desk to the nursing team, were friendly, professional, and courteous. Their dedication to patient care is evident in every interaction.\n\nI wholeheartedly recommend Dr Wong Manzhi to anyone considering plastic surgery. Her skill, compassion, and commitment to excellence make her truly exceptional in her field.",
      "time": 1732242310,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15148628193407593039",
  "user_ratings_total": 55,
  "vicinity": "6 Napier Road, #08-11/12 Gleneagles Medical Centre"
}