{
  "formatted_address": "80 Collyer Quay, Singapore 049326",
  "geometry": {
    "location": {
      "lat": 1.2831722,
      "lng": 103.8534216
    },
    "viewport": {
      "northeast": {
        "lat": 1.284994530291502,
        "lng": 103.8545613302915
      },
      "southwest": {
        "lat": 1.282296569708498,
        "lng": 103.8518633697085
      }
    }
  },
  "name": "The Fullerton Bay Hotel Singapore",
  "place_id": "ChIJxy-B0A4Z2jERYIdc3NBhKBs",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Rus Wer",
      "author_url": "https://www.google.com/maps/contrib/107553200774815146601/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU5BiIsJfG72GrJ32_alZocW4YoeGKs-FEMfmI0fNa9ASpLv5s4=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "The Fullerton Bay Hotel - Singapore\n\nElegance. Beauty. Sophistication.\n\nEverything you’re looking for in a hotel, in heart of Singapore downtown.\n\nThey offer abundant of luxury seating throughout the hotel. Large open space for dining.\n\nThey offer many open-space lounges throughout the hotel with beautiful views. They have a piano lounge with large windows overlooking the Marina Bay Sands Hotel and The Shoppes at Marina Bay Sands.\n\nAround the hotel plenty of places to walk around. If you’re looking to do some luxury shopping, The Shoppes at Marina Bay is walking distance, roughly 10 to 15 minutes, if you don’t stop to admire everything around you. 😊🤭",
      "time": 1744247691,
      "translated": false
    },
    {
      "author_name": "Julian Harris",
      "author_url": "https://www.google.com/maps/contrib/118299777136505117634/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVVbqo0EcissXyUlpCtcpXMeNvTRAS_mr0N_ffYDX39eZ4-n6haXQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "3 weeks ago",
      "text": "= Pros =\n\nVery grand foyer. Crazy huge.\nReally great beds, good mattresses.\nGreat location, nice views (though waterfront is noisy at night even on level 5).\nVery friendly staff.\nNice roof top pool.\nGood breakfast, nice variety of stuff.\n\n= Cons =\n\n- Absolutely atrocious customer service hours: no customer service at all during weekends. Yes you heard that right even if you have a many-thousand pound reservation no one will bother to pick up the phone or email during the weekend. IT’S A HOTEL. 😱\n- Emails typically take more than a day to respond sometimes 2.\n- Completely broken up front payment system. I tried with multiple cards to provide an online down payment and it simply said there was an error even though the cards worked with other providers. Because it happened on a Friday evening Singapore time I wasn’t able to resolve any of it for 2 days until Monday. I only stayed with that hotel because I had other family staying there otherwise I simply would’ve gone somewhere else.\n- Overall decor feels like the 80s. Surprised to hear it’s actually quite new. Aged feel probably not helped by silver peeling off the back of some of the mirrors in places\n- Breakfast coffee is undrinkable — clearly from a cheap machine, and they don’t seem to know how to soft boil an egg— multiple attempts over several days resulted in very undercooked egg sloshing out of the shell.\n- TV connectivity to personal devices inconsistent: worked in one room, not in another.\n- Invoicing was completely incomprehensible— I got a bill adding breakfast as extra and a bunch of other confusing items resulting in what appeared to be rather a lot owed on top of an already massive up front payment. But in the end they said to ignore it all. Very stressful. Oh, and I had a three letter room number, and the web interface refused to recognise it. Apparently have to add a zero at the beginning. This is such a basic basic technology fix really their web provider should be fired.",
      "time": 1745695327,
      "translated": false
    },
    {
      "author_name": "Kaylia Ang",
      "author_url": "https://www.google.com/maps/contrib/101595758868925870646/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUiwhoCFY6YHQlG0QKTjIdeb-5tF73o-134SZpZTFi39_0uEV4=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "I love Fullerton. It is so nice to go there and relax. The staff is super helpful n caring. I would definitely recommend this place when coming to Singapore for a holiday. 😁",
      "time": 1746600180,
      "translated": false
    },
    {
      "author_name": "Stephen Hurst",
      "author_url": "https://www.google.com/maps/contrib/104452620854947650338/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUsX_CLgd4UV42modMxvGXasmaFah1q9eVHcIk4-AIOBnjDipY=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "This hotel is set apart from many others by its customer service! They are the most helpful staff I have ever met and they are so attentive you feel like royalty. The location is great and the rooms are nice but the staff are what make this hotel special. We have a premier room number 408 and although this room is not advertised as a bay view room the balcony enables you to see most of the bay including the various evening lights shows which is amazing and very unexpected. Last night we dined in the roof top bar Lantern which is fabulous and the pool looks amazing but not tried it yet. We have a few more days here to try the cocktails and pool which I’m looking forward to.",
      "time": 1735391329,
      "translated": false
    },
    {
      "author_name": "Kenneth Yeo",
      "author_url": "https://www.google.com/maps/contrib/111153740218915905371/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIR08S8GO_sGxRDmQMOIU79vW9E7PQWTQOc9Ccc5wPA5ESyog=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Had a staycation here for just one night and in my honest opinion, it was such a wonderful and pleasant experience. We opted for the package with the $250 dining credits and used it mainly on in-room dining as well as at Lantern. I was surprised that the portions were actually quite reasonable and it was filling for us as well. View wise, one could opt for the marina view but I was pretty satisfied with mine, in any case, I spent most of the time in the room as well and not at the balcony. Service was simply excellent as the hotel staff lead you directly to your doorstep and those serving room service were polite and professional. Price can be rather steep, which is understandable, but for the services and experience offered, I truly think it is extremely worth it. Wouldn’t call it bang for buck but I have no regrets staying in this hotel and would most definitely come back here again !",
      "time": 1741152429,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1956921587770623840",
  "user_ratings_total": 4108,
  "vicinity": "80 Collyer Quay, Singapore"
}