{
  "formatted_address": "97 Tg Pagar Rd, Singapore 088518",
  "geometry": {
    "location": {
      "lat": 1.2774196,
      "lng": 103.8437872
    },
    "viewport": {
      "northeast": {
        "lat": 1.278768280291502,
        "lng": 103.8450398802915
      },
      "southwest": {
        "lat": 1.276070319708498,
        "lng": 103.8423419197085
      }
    }
  },
  "name": "The Blue Ginger (Tanjong Pagar)",
  "place_id": "ChIJy3NcJ20Z2jERsizqEPou3Ek",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Chua Bernard",
      "author_url": "https://www.google.com/maps/contrib/116763827953354833238/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLHICHxcOaBgD_ghZKmaaApsE4D2EOpbaq8r_TXnunyPyJzKg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "An award winning restaurant that serve traditional Peranakan Cuisines. Once again, patronized this restaurant sometime ago and ordered the following dishes…\n\n-Kueh Pie Tee .. had crispy, light and thin Golden Brown Pastry Shell, with sweet savory julienned stired fried vegetables, turnips and carrot fillings, top with sliced shrimp. Each bite was flavourful and satisfying.\n\n-Gado Gado .. had quite a balanced thick, nutty, slightly sweet and slighty tangy sauce, as well as a portion of tofu, tempeh and vegetables. However could have been better if more sauce was given.\n\n-Chap Chye Masek Titek .. had a good mix of Cabbage, Long Beans, Vermicelli and Black Fungus, are tender but not mushy, having soaked up the fragrant of the subtle sweet sauce.\n\n-Nonya Noodles .. although visually a Humble dish, the noodles were springy and served as a canvas for the mild spicy, sweet and savory gravy, topped with Squid Rings and Shrimps.\n\n-Kerabu Laksa .. was punchy but not overpowering, where the sharp acidity of calamansi and tamarind was tamed by subtle sweetness and gentle heat of sambal. Each forkful offered Crunch and Chew, Cool and Heat.\n\n-Beef Rendang .. Meat was tender, coated with thick, dark, sticky coconutty spicy sauce. Its aromatic and flavourful. Could have been better if Beef were softer in texture.\n\n-Babi Pong Tay .. Pork was soft, fatty and slow-braised, soaked all the deep, savoury sweet goodness of fermented soybean paste that was thick, rich and glossy. Had a balance of saltiness and mellow sweetness, but personally preferred abit more sweetness.\n\n-Curry Vegetables .. Curry was thick and creamy, with hint of sweetness. Vegetables were soft but not mushy, and soaked through. Each bite dripping with flavours. Could have been better if its a little more spicier.\n\n-Tauhu Nonya Style .. Tofu was soft on the inside, lightly fried on the outside with crisp edges. Sauce was tangy, slightly sweet and bold flavours from chilli, garlic and tarmarind. Good balance of heat and acidity with every bite.\n\nOverall dining experience was consider good due to the flavourful and well textured food and desserts served, except a few dishes that need i personally felt needed a little more spices or ingredients.\n\nOther than their food, ambience of restaurant was rather cosy as it was Peranakan styled with a modern twist. Service wise, staffs were efficient but not attentive enough though.",
      "time": 1744546433,
      "translated": false
    },
    {
      "author_name": "Yvonne Chou",
      "author_url": "https://www.google.com/maps/contrib/112791111059591714704/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUt7sMmueW01ce-Q-h5HIeowSgtQJj3_-ag5deGg9PqSqonUJU1=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "Have always read about the blue ginger and the Michelin awards they have been receiving. None of the dish struck me as exceptional. In fact, it was lacking the flavour I would expect from a Peranakan restaurant",
      "time": 1743210727,
      "translated": false
    },
    {
      "author_name": "Zackery Goh",
      "author_url": "https://www.google.com/maps/contrib/109405400403426765330/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUGQsp237p9vNHb-uS9FyMoz0Z-zK6zy1GCgCTEXQuCxwKVbMg-=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I recently dined at The Blue Ginger and was thoroughly impressed by the overall experience! The ambience is warm and inviting, with a beautifully decorated interior that perfectly sets the mood for a delightful meal. The soft lighting and tasteful decor create a cozy atmosphere that makes you feel right at home.\n\nNow, onto the food: each dish was a visual masterpiece and tasted divine! The flavors were well-balanced, showcasing the culinary expertise of the chefs. However, I found myself wishing for a bit more spice to elevate the dishes even further. A little extra heat would truly enhance the vibrant flavors and bring the dishes to life.\n\nOverall, The Blue Ginger is a fantastic spot for a memorable dining experience. I can't wait to return and see how they might spice things up! Highly recommend it!",
      "time": 1733568275,
      "translated": false
    },
    {
      "author_name": "Chris SG",
      "author_url": "https://www.google.com/maps/contrib/118301042945741620173/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIf_HaoLISTF-bgfkf-G2FjNWnCsZWEXojVPcuaWjqD_ZCOhMc=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Haven’t visited blue ginger for some time and I really missed their signature dishes!!! Ordered their beef rendang, roasted chilli egg plant, fish maw soup and durian chendol and they were all perfect. My favorite Peranakan restaurant!!! 😍😍😍",
      "time": 1746866889,
      "translated": false
    },
    {
      "author_name": "Juren",
      "author_url": "https://www.google.com/maps/contrib/103519339503648864005/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVjKt1slfctIFb7mM-JzxNoQvXl5yzRCOzo24ndzrH0UPTphfw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Had a great meal at The Blue Ginger in Singapore—authentic Peranakan food done right. The Ayam Buah Keluak was rich and flavorful, and the Ngoh Hiang was crispy and packed with goodness. Loved the balance of spice and sweetness in the prawn pineapple curry. Cozy atmosphere, friendly service—definitely worth a visit if you’re craving solid Peranakan classics.",
      "time": 1744086338,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5322180511205567666",
  "user_ratings_total": 1043,
  "vicinity": "97 Tanjong Pagar Road"
}