{
  "formatted_address": "33 Erskine Rd, Singapore 069333",
  "geometry": {
    "location": {
      "lat": 1.2807135,
      "lng": 103.8453893
    },
    "viewport": {
      "northeast": {
        "lat": 1.281986880291502,
        "lng": 103.8467348302915
      },
      "southwest": {
        "lat": 1.279288919708498,
        "lng": 103.8440368697085
      }
    }
  },
  "name": "The Scarlet Singapore",
  "place_id": "ChIJedOwSA0Z2jER2MzP7abeptc",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Alexis Herrera",
      "author_url": "https://www.google.com/maps/contrib/107328626002014313268/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKY6Q8hGEdQ94o_PBdJmnPYQgXGJkVNoJruBdfBJCYT5Ai3Fw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "We stayed in the Scarlet Hotel for just one night  to be able to visit Singapore.\nThe hotel is very well located with public transportation within few meters (subway, buses).\nYes the rooms do not have windows. However, they are not small and they have their charm. It was also very calm, we didnt hear anything from the street or wherever. Beds and furnitures are of good quality.\nFor us, the major positive point for this hotel is the staff. They are all incredibly helpful ! The hotel kept our luggage until late at night before our flight. We really enjoyed our stay there and would recommend 100%",
      "time": 1741591155,
      "translated": false
    },
    {
      "author_name": "Jess.Z W",
      "author_url": "https://www.google.com/maps/contrib/118318812736206730600/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVclg9EUIqCsvwO4UgLTos0BIbt1cCGuJusRIdsSPfptmh7re4g=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "2 weeks ago",
      "text": "Don’t book if you care about check in time.\n\nTried to check in earlier than the normal check in time (2pm) The manager told me he would try. And something should open by 1pm.\n\nFast forward to 2:40pm, 40 mins past the normal check in time, I was still waiting in the lobby could barely sit straight due to jet lag and the 13 hour flight I just got off from in the morning.\nThe good thing was: after my third time checking with them on what time they could get the room ready, they offered me an alternative room to rest until my booked room is ready.",
      "time": 1746169594,
      "translated": false
    },
    {
      "author_name": "Antonio Maria Bovo",
      "author_url": "https://www.google.com/maps/contrib/117655932565165944878/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV5HrTFoYDOoBe-NmRJ2Ih4g1Zga-nfTjugFS2CDoop-lSubHGa=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Unfortunately, my experience with The Scarlet Singapore was extremely disappointing. I had made a booking well in advance, which was officially confirmed, but the hotel cancelled it without providing any explanation or offering an apology. I find this behavior highly unprofessional and disrespectful.\n\nTo make matters worse, I had chosen this hotel for a stay during a very busy period, so now it will be very difficult to find a suitable alternative without facing higher costs or having to settle for something less.\n\nCustomer service like this is simply unacceptable, especially from a hotel that markets itself as a high-end boutique property. I will never book here again and I do not recommend it to anyone.",
      "time": 1744314421,
      "translated": false
    },
    {
      "author_name": "Simon Meyers",
      "author_url": "https://www.google.com/maps/contrib/104872386433884719110/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVcrTBzvq1JwNJt9-cPa6kCbjHHM_mOwMxBnAIA_OIZQXRLTVo=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Really enjoyed our stay here. The Scarlet is perfectly situated on the edge of Chinatown, and, more importantly, literally opposite the Maxwell food court/hawker centre. There are a couple of really great coffee shops nearby too, and the Maxwell MRT. Getting in from the airport was very easy, and we found it was the perfect location to explore from. Everywhere we wanted to go was relatively close and easy to get to. (Even the Gardens by the Bay which we found over priced and very touristy)\n\nThe room was small but the decor was nice, the bed was very comfortable with nice bedlinen. Staff were courteous and friendly, and, for Singapore, the Scarlet is good value.",
      "time": 1739400138,
      "translated": false
    },
    {
      "author_name": "The Glereans",
      "author_url": "https://www.google.com/maps/contrib/114528119505455476137/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIJUZdcW7dGbUZQJdbCuV30zZtG6n7c23axHpxLdZhgt6SgnxA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 2,
      "relative_time_description": "a month ago",
      "text": "How disappointing...we booked 2 rooms for 4 adults.\nWe were on the mezzanine floor, out side our room was the outdoor spa which was under repair so couldn't be used. The rooms were much much smaller than the photos led us to believe. Also the rooms were at the back of the hotel where our view was a giant car park....The recommended roof top bar was a joke. Inattentive staff, no beer available (what !!) and if we wanted something to eat, which we did, they would have to order it in and we would have to wait around 45 minutes.\nThe only great thing was the location, Chinatown was only a couple of minutes walk. It looked great on the outside, the foyer looked groovy, BUT overall very very disappointing.",
      "time": 1743378465,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15539352372824231128",
  "user_ratings_total": 938,
  "vicinity": "33 Erskine Road"
}