{
  "formatted_address": "48 Peck Seah St, Singapore 079317",
  "geometry": {
    "location": {
      "lat": 1.2779306,
      "lng": 103.844885
    },
    "viewport": {
      "northeast": {
        "lat": 1.279274930291502,
        "lng": 103.8462625802915
      },
      "southwest": {
        "lat": 1.276576969708498,
        "lng": 103.8435646197085
      }
    }
  },
  "name": "The Prince",
  "place_id": "ChIJjZCj0hIZ2jERFf54vtrt17Y",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Axel Lorsold",
      "author_url": "https://www.google.com/maps/contrib/105923665593035872682/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVBvzjr7vzKNqnSR06Za77NGH5dgptbSwADDclUHI-bxBfkjDg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Our first visit to this restaurant months ago was, frankly, terrible. The service was outright rude, to the point that it soured the entire experience — even the food couldn’t redeem it. We left feeling frustrated and disappointed.\n\nTo their credit, the restaurant later reached out and offered us a $100 voucher to return. We decided to give it another shot — and I’m genuinely glad we did.\n\nEverything had changed. The staff had been completely turned over, and the difference was incredible. The new team of waiters and waitresses was warm, welcoming, positive, smiling, and incredibly professional. Their positive energy transformed the atmosphere and brought the whole place to life.\n\nThe food was delicious, but it was the outstanding service that made the night. What was once a place we swore we’d never return to is now one we’ll happily recommend. Huge credit to the new team — you turned this into a 5-star experience.",
      "time": 1746837573,
      "translated": false
    },
    {
      "author_name": "karen ong",
      "author_url": "https://www.google.com/maps/contrib/116761275087057206164/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ2iVfsuMEGiQFLUiB1ly89dqwEw2BG0FG24jIeLnZOmn-0pA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "3 weeks ago",
      "text": "Had a great experience at The Prince . The set lunch offers good value $29 with a nice selection of dishes. Service was excellent — friendly and attentive. Loved the stylish and comfortable décor too. Will definitely be back!",
      "time": 1745685902,
      "translated": false
    },
    {
      "author_name": "Roger Yuen",
      "author_url": "https://www.google.com/maps/contrib/100691112263099536110/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXTGxVzZMMSrn6MjJplvMDWyBb5XXlMS4VpKqZ9Q2oTEtbYWa4=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Business lunch at The Prince (rebranded from Fat Prince) in Tanjong Pagar. The restaurant offers a modern take on Arabic cuisine in an upscale and inviting ambiance, with its warm shades of beige and brown creating a relaxing and intimate atmosphere. One of the standout features of this restaurant is its excellent-value 4-course lunch set, which offers a variety of delicious options at an affordable $29!\n\nThe lunch set includes a several selection of dips served with freshly baked pita bread that perfectly complement the main dishes, adding rich, flavourful accents to the meal. The Fish Kebab is particularly noteworthy; it features fresh fish, marinated and grilled to perfection, served taco-style with tahini sauce and slaw. Likewise, the Chicken Kebab is equally impressive, showcasing tender meat infused with spices that elevate its flavour profile.\n\nPortions are small but adequate, perfect for solo dinning; or with a larger group, you can sample more options. I'd a quick look at the ala carte dinner menu, and it looks inviting too - will back to check it out.",
      "time": 1741358150,
      "translated": false
    },
    {
      "author_name": "Mongolian Horse",
      "author_url": "https://www.google.com/maps/contrib/114330143678262162269/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUZNQRyf6WZy_M_6v1tCeEOGJSFAAWonz93MlVDjHdCTlH1b68=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Enjoy the ambiance of the restaurant!  Service provided by Siva & Flo was personal and excellent. The eggplant is creamy & tasty! Especially to mention are the desserts - cheese Kunafeh, date pudding prepared by Chef Zenny are extraordinary and has a pleasant spice kick to it! It offers me a new love for Middle East desserts ! Simply enhancing! 😍😍",
      "time": 1735263951,
      "translated": false
    },
    {
      "author_name": "monique ang",
      "author_url": "https://www.google.com/maps/contrib/116994996772617686889/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVjluXXc0uHdyIPZCHKnu0kwQow6ozxIybqH5oQ4IirKUiF9-M=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "AMAZING BIRTHDAY DINNER.\n\nHad a blast celebrating a dear friend bday. Besides the food being amazing (order the halloumi, octopus and cauliflower are amazing) the warm and thoughtful service by SK (and Shiva) made the diner full of humour, fun and delightful.\n\nOrder the dessert, cause they are just nice and NOT TOO SWEET : which WE LOVE and suits those who enjoy just the right sweetness. Baklava ice cream and kunafe are chef kissed.\n\nOverall, We had a blast and memorable and delicious dinner!",
      "time": 1740236266,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13175260758649929237",
  "user_ratings_total": 1249,
  "vicinity": "48 Peck Seah Street"
}