{
  "formatted_address": "109 Mount Faber Rd, Singapore 099202",
  "geometry": {
    "location": {
      "lat": 1.271178,
      "lng": 103.8193882
    },
    "viewport": {
      "northeast": {
        "lat": 1.272612930291502,
        "lng": 103.8208334802915
      },
      "southwest": {
        "lat": 1.269914969708498,
        "lng": 103.8181355197085
      }
    }
  },
  "name": "The Mirabilis Bar @ Mount Faber Peak",
  "place_id": "ChIJ2ea0MQAb2jERYoZB-UtoR8k",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Bing Xuan Ho",
      "author_url": "https://www.google.com/maps/contrib/106843166756572594425/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIUyf02_bH4u61PgomTX4RnlMBPHUqYNWf7dCZqpuO6HggJEg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Glad to find this bar newly opened in Apr 2025. To visit the bar, you would have to go through the Dusk restaurant.\n\nIt is the best bar for me in Singapore.\n\nLove talking to Anton. He enthusiastically introduces the cocktails you order before AND after it is served. Since he is the one that came up with the recipes, he can tell you all about the stories behind them.\n\nThe cocktails were made with passion. I wouldn't say they are fancy, but no doubt they are legit, not overly sweetened or diluted, just they way you would have made it for yourself.\n\nCocktail is around $20 per glass, which is also significantly lower than other in the town. Being open air could be a drawback to some, but it is perfect for me.\n\n100% will visit again. Hope we all can support such a passionately run bar in Singapore.",
      "time": 1746800103,
      "translated": false
    },
    {
      "author_name": "Inday Mona's Vlog",
      "author_url": "https://www.google.com/maps/contrib/110126392125429460306/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXgRaxUVPNIFuTqkr_3bbp41TXnlmrMF0P0yOkQRhXNKM5QBnl5PQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "The place is so good and service is excellent. The staff named Tiger is so friendly and accommodating and all of their staffs too. We have the best beautiful dining experience there. We are looking forward to come again in the future.",
      "time": 1746794921,
      "translated": false
    },
    {
      "author_name": "Kavan Lio",
      "author_url": "https://www.google.com/maps/contrib/100687793376915797767/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIKStQ93_QGYRLmnHLqJE-ODiafnxZLwkTe5kdy2Cfpc6V39g=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Very friendly staff and the cocktail is divine!\n\nThe luscious purple Mirabilis cocktail brings a blossoming bouquet of lavender to the palate at every sip!\n\nIts Espino is a delicious blend of Brass Lion’s hawthorn gin and exquisite vermouths!  Rich, with a tint of the hawthorn flavour!  Have a beautiful finish with its cherry on the side.",
      "time": 1746714292,
      "translated": false
    },
    {
      "author_name": "Lui Grace",
      "author_url": "https://www.google.com/maps/contrib/107735494311771600311/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIsd8_6lJLMQNaR392TLrCzjsWdwVrTwtp7k902e3mAVTZGWw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "World Class Cocktail Festival at The Mirabilis Bar – @gorneff’s “What If” Series\n\nStepping into The Mirabilis Bar for the World Class Cocktail Festival felt like entering an alternate universe of imagination and mastery.\n\nAnton’s “What If” menu dares to ask bold questions — and answers them with drinks that are as balanced as they are inventive.\n\nHere are the first three that truly captured the spirit of the challenge:\n\n1. Tailored & Fashioned\nWhat if... Old Fashioned was created in London?\nA fusion of Old Fashioned and Martini — elegant, composed, and gin-forward. Tanqueray No. Ten shines, with grapefruit syrup and rosemary bitters enhancing its citrus and herbals. A clean, classy sip for both Martini lovers and Old Fashioned purists.\n\n2. Don Sazerac\nWhat if... Louisiana was a Mexican State?\nSmoky, complex, and captivating. Don Julio Reposado meets smoked agave nectar, vanilla bitters, and anise salt, crowned with “New Orleans Air” — a Sazerac in foam form. Bold and delicious. My top pick of the night.\n\n3. The Dove\nWhat if... Scots Celebrated the Day of the Dead?\nA Paloma twist that transforms Johnnie Walker Black Label. With triple citrus cordial, peated tea soda, and a grapefruit salt rim — it’s vibrant, layered, and turns skeptics into believers.\n\nEach cocktail was a chapter — reimagined and artfully refined. Hats off to Anton for a cohesive and clever menu.¹",
      "time": 1746837066,
      "translated": false
    },
    {
      "author_name": "Tina Ho",
      "author_url": "https://www.google.com/maps/contrib/116670053240655293073/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXH8LYeurgyI6Q81ANa9dIEfanMZDiR1l42LtS_AJoc7lvMDadO8Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Location of Mirabilis means you will get lovely views of the sunset while enjoying unique cocktails. Anton passionately explained the inspiration of the bar and the cocktails he created. David (one of the servers) was very friendly and spent some time chatting with us. It’s a girls night out for me but it is definitely a romantic venue you can bring your dates 😍 oh and I found out that if you make a reservation for a weekday, you get a complimentary cable car ride up to Mount Faber from Harbourfront Centre! So cool!!",
      "time": 1743832529,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14503675800483628642",
  "user_ratings_total": 59,
  "vicinity": "109 Mount Faber Road"
}