{
  "formatted_address": "Edgedale Plains, #53-55/57, Singapore 828692",
  "geometry": {
    "location": {
      "lat": 1.3991125,
      "lng": 103.912776
    },
    "viewport": {
      "northeast": {
        "lat": 1.400336080291502,
        "lng": 103.9142762802915
      },
      "southwest": {
        "lat": 1.397638119708498,
        "lng": 103.9115783197085
      }
    }
  },
  "name": "The Amore",
  "place_id": "ChIJd-iYSgAW2jERcpwuoDm7imU",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "antihunter",
      "author_url": "https://www.google.com/maps/contrib/107409081859681251262/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWHi6EvkMApHfagPWHD3q30u5DQH_Vg_1hp1kpwZBPU9BPcwkek=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "3 years ago",
      "text": "[I am writing as a resident of Punggol estate, who stayed here for 11+ over years and my honest opinion in my review when visiting the condos, so that individual can assess the pros and cons before any commitment.]\n\nEach EC or condo has its pros and cons. But for The Amore EC in Punggol, although its a small project, its definitely better than some other EC/private condo projects in Punggol. E.g. Grand Entrance and drop-off point, Entry to guard house can buffer to up 3-4 visitor cars in queue which a number of condos cannot.\n\nBasement carpark with air-condition at B1 lift lobby.\n\nOverall the estate, common areas and common facilities are well maintained. Maintenance fee is $308+ for 6 strata and $360+- for 7 strata unit.\n\nBBQ is at level 16 Sky garden of each block so that the smoke don't affects other residents. It has a handicap friendly toilet at level 16 as well.\n\nThe Amore EC is also right beside Horizon Primary school which is 1 of the best primary school in Punggol, where parents need to ballot+volunteer-work in order to get their kids in.\n\nFloor Plan wise, its quite squarish and easy to fit most of the furnitures.\n\nWalking distance 4min+ to nearby kopitiam and Giant along Punggol Central (no need to cross the road). To Oasis LRT or Oasis Terrace is around 7mins+ walk.\n\nThe Amore EC is near to the upcoming Cross-island Riviera MRT in Year 2031-2033 (already announced by LTA) along Punggol Central Road beside the Fire Station, which is 150meters away.\n\nThe disadvantage point is there is no shower facilities for visitors who swim at the pool, and will need to go to owner's unit to shower. The connecting staircase from basement carpark to Function Room has no shelter if it rains. The drop-off point for guest or resident has no shelter if it rains. The Function Room is quite big but has no water basin to do washing which is commonly found in other condos, end up have to wash in the common toilet beside function room (15 steps away).\n\nThere are also feedbacks that the sinked fund for this EC is very LOW, to the point that the Mgmt Committees is going to impose Special Levies on their residents from Year 6 and Year 9, payment in 2 tranches amounting to few thousands dollars for each tranche. If you are a potential buyer of this resale EC, you have to be prepared to fork out additional money for sinked fund (estimated >$8,000 for 2 tranches) after buying a unit here. This is in view that The Amore EC is a smaller condo with lesser residential units, resulting in higher maintenance fees and sinking funds. The seller or seller agent is unlikely to be truthful about this since it is to their disadvantage. Just take note of this.\n\nFor units with no west sun, there are limited units that are internal facings; stack 10,11,15 and 16.\n\nStack 17,20,23 and 24 have no west sun but directly face the horizon primary school.\n\nStack 02,08, 18,19, 21 and 22 are internal pool facing but will face direct west sun.\n\nThus far, this is the only EC in punggol that comes with an open area yard with a retractable cloth hanger, similar to those of HDB.\n\nOverall, the pros still outweighs the cons, give a 3.5 stars.",
      "time": 1633937682,
      "translated": false
    },
    {
      "author_name": "SeraFina Faith",
      "author_url": "https://www.google.com/maps/contrib/107732054545832504634/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVISheRxBbeGJ3LH4iq3rVAN6O9QZr09RH-FO3EvRTmv7iipHME=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "a year ago",
      "text": "Extremely small living & dining area although it's a 3-bedder unit. From the main door leading to the living room is a very narrow walkway. The kid's bedroom is probably just twice the size of a HDB utility bomb shelter. Typical space constraint for ECs. Also, the facade of these ECs are basically the same: similar colour and structure; dark gray everywhere.",
      "time": 1706105493,
      "translated": false
    },
    {
      "author_name": "Benedict Tan",
      "author_url": "https://www.google.com/maps/contrib/103639716693877281523/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUkJyEaNV1qpGccAeqz1-0cvyT2HGP5hGzu7GWwW9rUfs7zgYAS=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "3 months ago",
      "text": "Feels  a little cramped. And not well laid-out in my opinion.",
      "time": 1738465344,
      "translated": false
    },
    {
      "author_name": "yunyun liu",
      "author_url": "https://www.google.com/maps/contrib/117244985111314786266/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIn9M6WLKh_ZIDYoZjVLqTHX3vqz1N6nDNTHznFnP_UiyG2Tg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 years ago",
      "text": "will the management please look into the lady who parks her bike in a car lot everyday at the condo and walks out after that. she does not stay at the condo. im hoping fellow residents will speak up to the management about this too.",
      "time": 1683003322,
      "translated": false
    },
    {
      "author_name": "Hanna Psalms (Hanna)",
      "author_url": "https://www.google.com/maps/contrib/108386033122807192393/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXi12n0_OaNrGC67vLGXMghFAQ1eklMlfKXXps-e7mTToOcl6bFWQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "6 years ago",
      "text": "A great place to live for beginning a family. With the pool and sky gym. Everything you need is there.  Security is alert and good. But problem with booking with bbq. It takes time for them to process and check. But all is ok.",
      "time": 1529567725,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7316866400791731314",
  "user_ratings_total": 158,
  "vicinity": "Edgedale Plains, #53-55/57"
}