{
  "formatted_address": "401 Havelock Rd, Lobby Level 1 Hotel Miramar Singapore, Singapore 169631",
  "geometry": {
    "location": {
      "lat": 1.2885162,
      "lng": 103.8372389
    },
    "viewport": {
      "northeast": {
        "lat": 1.289907680291502,
        "lng": 103.8386224802915
      },
      "southwest": {
        "lat": 1.287209719708498,
        "lng": 103.8359245197085
      }
    }
  },
  "name": "The Brass Rail Lounge",
  "place_id": "ChIJG97fPHYZ2jER1Qfx4xLpoDE",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Joyce Angelie Mamangon",
      "author_url": "https://www.google.com/maps/contrib/102835568824907831050/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUXI1YjnWMEYnA9MBoG8qxNM2mtjiTEUdORW1DB0crWSfi5EgU=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "Had our dinner there recently for a simple celebration of our wedding anniversary.\nThe food is not excellent but fresh and tasty. The servings are also decent and good for its price.\nThe place is just ok, not crowded even on a Saturday night. Although behind the glass walls, you can see a lot of people in queue for the other restaurant beside it that makes the ambiance a little less appealing to me.\nThe service crews are helpful and from time to time they will ask if there is anything else we need or take out empty plates from our table.\nOverall, it is still a good experience for us.",
      "time": 1714475912,
      "translated": false
    },
    {
      "author_name": "Daryl Lim",
      "author_url": "https://www.google.com/maps/contrib/102390381365711777753/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIudwS4duIDOJFzXehg7ftsa_4e9kxOfeclcGyGk6cvKZ9BwQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Excellent food and equally important, excellent service provided by Kok Siong and Ms manager! Yesterday my family and I had dinner at Brass Rail lounge and the drumsticks with curry mayo was the best I ever had in Singapore! Also, Kok Siong was very helpful and sincere with his service and because of him we will definitely come back again! Ms manager (sorry we didn’t manage to get her name) was also absolutely helpful and provided an impeccable service during our dinner there. We wanted to takeaway away their speciality, Boston Lobster and because we were afraid that the noodles would be soaked with the gravy and wouldn’t taste nice the next day, she helped us to packet the noodle and gravy separately while giving us extra gravy soup as well! Overall, it was a great experience and I would give it a 11/10 if possible, cheers!",
      "time": 1725173895,
      "translated": false
    },
    {
      "author_name": "Florence Leow",
      "author_url": "https://www.google.com/maps/contrib/102656561598060120185/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWWAO5NDzda0lWfeRJhWD1zQtDlUm5XL-zVuqnQGNv9Rilxc3M7=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "🔶️ The Brass Rail Lounge\n🔵 Hotel Miramar\n401 Havelock Road (Lobby Level 1)\nSingapore 169631\n\n🔵 I had reserved a table for two at 8 PM at The Brass Rail Lounge on 4th Feb 2025 Tuesday. 🟢 The booking was reserved under the Google App Link in partnership with Eatigo App, which allowed me 50% discount off the dishes during a certain time period.\n\n🟢 My hubby and I ordered the classic Hainanese Chicken Rice and Hokkien Mee dishes. ✔️ Both local dishes were scrumptious and well-crafted.\n\n🟨 The Hokkien mee noodles were cooked nicely in a super rich & flavourful pork bone & prawn stock, giving them a distinctive umami taste and texture.\n\n✳️  For the Hainanese 鸡饭 Chicken Rice, the chicken breast pieces were poached to perfection, retaining its tender and juicy texure. 🟨The rice grains here were infused with the rich flavours of the chicken stock, and the result was fluffy, delicious and aromatic rice.\n\n🟦 Service wise = Both staff, Mr Hairul Shafiq and Mr John Boo, were cheerful, amiable, and have genuine dispositions.\n\n⬛️  We had a short chat about Hotel Miramar's founding and I told them the hotel was established in 1971, and when I was a little girl in the 1970s and a young person in the 1980s, I had been to the dining facilities at the hotel. 🥰  But that was so long ago and today, I am revisiting the hotel again.\n\n💙 I do remember Hotel Miramar in its early days. As I walked through the hotel lobby tonight, I am reminded of the past again. I had family dinners here before, and makan sessions with old friends here. 🧡 Am happy to have dined here tonight and would be back soon.\n\n🟨 Thank You for the friendly and great hospitality shown to my hubby and myself tonight! 🙏🏻",
      "time": 1738684702,
      "translated": false
    },
    {
      "author_name": "Lico Kwek",
      "author_url": "https://www.google.com/maps/contrib/116339007862600014910/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKk2jyMRpILzKoen5haR4VbBaa4x8GLnWfkdIHIBODLCJ1NWA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I went to the Brass Rail Lounge on a weekday evening with my group of friends and I really loved the ambience of the restaurant! It was quite quiet for the timing we went there (about 8pm) but we really enjoyed the peaceful vibes!! The service staff were extremely approachable and friendly and took really good care of our needs there during our time there! :) We really enjoyed the music selection of the restaurant, playing a mix of Pop music from the 2010s which was really nostalgic and we just had a blast there!\n\nFood wise, the Nasi Goreng was my personal favourite! You can really taste the Wok-Hey in every bite and the Nasi Goreng was really in a huge portion and the servings were really generous! It even came with fried egg, Satay and Fried Chicken Wings!!\n\nWe also ordered the Tuna Salad and all I have to say is that it was PHENOMENAL! Every bite of the Tuna you can really taste the wok hey as well as they seared (?) the outside of the tuna with the inside tasting like Sashimi!\n\nWe also enjoyed the Cheesy Fries that we ordered and to our surprise it came as Curly Fries which is our group's absolute favourite!!\n\nOverall, the food was great, ambience and service is above the top but the experience with our group of friends is certainly one that we would never forget. Thank you so much The Brass Rail Lounge for the amazing dinner and would definitely recommend for you to come down if you are in the area and have a taste of the food here!! :D",
      "time": 1689860885,
      "translated": false
    },
    {
      "author_name": "Rahul Kale",
      "author_url": "https://www.google.com/maps/contrib/110669930392335821580/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVts3uNA7-meRbk56HPvaZd5zXvDm0kFfh7s1sKzir_N06TG3dShQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Service from Mr. Pratiban was top notch. We tried two vegetarian options: vegetarian pasta and braised beancurd, both were excellent. The pasta was served with a patty. Braised beancurd was served with crackers and picked veggies.  The serving portions for both were generous. Thoroughly enjoyed our experience especially after availing the eatigo discount on the final price. The seating arrangement is more suitable for drinking but there are many tables available if you want to dine comfortably.",
      "time": 1691553284,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "night_club",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3576114371475081173",
  "user_ratings_total": 44,
  "vicinity": "401 Havelock Road, Lobby Level 1 Hotel Miramar Singapore"
}