{
  "formatted_address": "435B Bukit Batok West Ave. 5, Singapore 652435",
  "geometry": {
    "location": {
      "lat": 1.3586883,
      "lng": 103.7405123
    },
    "viewport": {
      "northeast": {
        "lat": 1.360059180291502,
        "lng": 103.7418332302915
      },
      "southwest": {
        "lat": 1.357361219708498,
        "lng": 103.7391352697085
      }
    }
  },
  "name": "The Language Studio by Jane Feng",
  "place_id": "ChIJgx4X6_cX2jERC8ml8dC2zqc",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Dong Yang",
      "author_url": "https://www.google.com/maps/contrib/101899475014549001322/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK66eZl2ksnX11AHE2YzDQ0ulfe9aF4KM0qrrTUQFNs_IAlEw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I cannot say enough about the exceptional teaching we’ve experienced! From the moment we began, it was clear that Teacher Jane has a true passion for education. Their engaging teaching style captivates the students, making even the most complex subjects accessible and enjoyable.\nI've witnessed remarkable growth in my child this year. He have not only improved academically but have also gained confidence and a genuine love for learning. It's heartwarming to see how Teacher Jane fosters a supportive environment that encourages students to ask questions and explore new ideas.\nI wholeheartedly recommend Teacher Jane to any parent looking for a dedicated and inspiring educator. If you want to see your child thrive in a nurturing atmosphere, look no further!",
      "time": 1730271967,
      "translated": false
    },
    {
      "author_name": "Raymond Chua",
      "author_url": "https://www.google.com/maps/contrib/108737818977961285920/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUU7ocKGW-bKp6llxvxAln8J7tSuMr27H0enXH7uvEdDErshoqg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "**Review for teacher Jane**\n\nWe are incredibly impressed with Jane's dedication and teaching methods. What stood out the most was her ability to connect with Raphael on a personal level, which kept him engaged and motivated throughout the lessons. Jane’s approach is not only structured and thorough but also flexible, adapting to Raphael's needs and learning style.\n\nUnder her guidance, Raphael has shown significant growth in his English skills, particularly in his writing and comprehension. She focuses on building both his confidence and foundational knowledge, which has helped him tackle challenging topics with ease.\n\nI would highly recommend Jane to any parent seeking an exceptional tutor who is patient, attentive, and truly committed to their child's progress.",
      "time": 1725635613,
      "translated": false
    },
    {
      "author_name": "Kanako Mori",
      "author_url": "https://www.google.com/maps/contrib/102847623732290814392/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJtWUj-vreafVnqOb8uERm_h09IJOLt-vNAPRQjVOJTGd1hnw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Jane’s proficiency in Japanese was a tremendous help during one of the events I supported for Japanese visitors in Singapore. Initially, Jane was one of the participants, but when we realised that the organiser had not appointed an emcee, she took the initiative to facilitate communication between the Japanese and local participants. Without Jane, many of the Japanese guests would have felt lost, so I’m very grateful for her assistance. I believe her passion for languages will inspire young students. Wishing you all the best in your future endeavours, Jane!",
      "time": 1728490013,
      "translated": false
    },
    {
      "author_name": "Jerlyn Tan",
      "author_url": "https://www.google.com/maps/contrib/105933711943347984752/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVm0HOFCiyWh_xNGblJvsOOjVBxtyKp9-Yw2kVIOQAAKr8aodrTng=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Just attended a Japanese dessert lesson with a master from Japan, it was so intimidating to learn from someone who couldn't speak a common language but thankfully we had Miss Jane with us to save the day~\n\nClearly if you ever attempt to learn a lesson conducted in another language, you might feel introverted or just 'lets get this done and over with' but I was immediately drawn to Jane's warm personality and professional translation! Even I took the courage to ask her questions in order to really learn as much as I can, despite being shy.\n\nIt was amazing how she took observation to the actions and surroundings around her, making sure she assist to asking questions at the right time to prevent the master teacher from getting overwhelmed. She would go up and beyond to check the clarity of the problem, sharing our opinions to the teacher in order to get more insight, ultimately, you could totally trust her and her skills!\n\nLove the way she speaks too, it was clear in tone and speech, it was a good way for me to practice hearing and even speaking Japanese too.\n\nOverall, I had a very good experience, and I even made friends with her and I wouldn't have it any other way~🌸 Thank you very much~",
      "time": 1730182442,
      "translated": false
    },
    {
      "author_name": "Jaslicious Teo",
      "author_url": "https://www.google.com/maps/contrib/101109676660852227680/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLj8pT3KeYM1EUThLkoNYkuoh5RYROoxDUVA_F8Mb6a7NKkBg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "What impressed me most about Jane’s teaching was her ability to make complex concepts easy to understand for En Ting. Her patience and encouragement allowed her to feel confident in asking questions and exploring new ideas. Jane has been helping her develop both academically and personally. She has not only improved in her language skills significantly but also boosted her confidence in expressing herself. I would highly recommend Jane to any parent looking for a dedicated, insightful, and supportive teacher. Jane creates a positive and engaging learning environment that not only helps students excel in their studies but also nurtures their confidence. 👍🏻👍🏻👍🏻",
      "time": 1725104042,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12091803058059987211",
  "user_ratings_total": 30,
  "vicinity": "435B Bukit Batok West Avenue 5"
}