{
  "formatted_address": "89 Bedok North Street 4, #01-119, Singapore 460089",
  "geometry": {
    "location": {
      "lat": 1.3329785,
      "lng": 103.9382695
    },
    "viewport": {
      "northeast": {
        "lat": 1.334220580291502,
        "lng": 103.9397635802915
      },
      "southwest": {
        "lat": 1.331522619708498,
        "lng": 103.9370656197085
      }
    }
  },
  "name": "The Braised House",
  "place_id": "ChIJNwp3ODA92jERMvWp8HD2Dec",
  "rating": 3.8,
  "reviews": [
    {
      "author_name": "Supreet Kini",
      "author_url": "https://www.google.com/maps/contrib/105328280516267995599/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUNd3bSbZTh_ob1b71Rc6UrKGE1N40GFU2YUn12qeLLlwz_xGkD=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Ordered recently from The Braised House, which seems to be a newly opened outlet near Bedok.\n\nWe ordered the following :\n\n1) Knife-Cut Black Pepper Smoked Duck Noodles - This was my favourite. The smoked duck with the seasoning of black pepper was really good. The noodles were chewy. It was a nice balance of spice, with the braised ramen egg complimenting it really well.\n\n2) Knife-Cut Minced Pork Noodles - Again, chewy but nice noodles. The chilli provided with this was potent, but so good and added a lot of character to this dish. Added in a braised chicken cube as an add-on and this was quite a heavy dish to finish.",
      "time": 1728043084,
      "translated": false
    },
    {
      "author_name": "Joyce",
      "author_url": "https://www.google.com/maps/contrib/108340000757990011193/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKFrv3JT2ovzWn4CbLDDNvD6nn7-m4pwDusI2lhufGNHRDmXA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "Sad that it has gone down in everything. Service is bad. Food has gone down in size. Ordered a braised minced pork since it was one of my fav. Use to have really generous portions. Look at my picture. Just oil.",
      "time": 1737552635,
      "translated": false
    },
    {
      "author_name": "paulin phang",
      "author_url": "https://www.google.com/maps/contrib/117115006801951626028/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVLtY3o2PpVRupFNfQ53OMHGWU1-lokYBVXT9eFZ7td6UER_e-ECw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "A big shoutout to The Braised House for satisfying our braised cravings! We recently ordered their Signature Braised Pork Bowl with uncut pork belly, 1 Ramen egg, mild spicy minced meat, and Xiao Bai Cai for $11.50. It was absolutely delicious! The meat melted in our mouths, and the flavors were out of this world.\n\nWe also tried their Braised Pork Belly Bowl with cut pork belly, 5pc Quall egg, and Xiao Bai Cai for $8.80. The combination of tender pork belly and the richness of the Quall eggs was simply delightful.\n\nNot to forget their Signature Braised Chicken Bowl, which featured 2pc chicken wing, chopped Shitake mushroom, peanuts, and Xiao Bai Cai for $11.50. The chicken was incredibly soft and flavorful, and the addition of peanuts added a nice crunch to the dish.\n\nWe couldn't resist trying their Mei Cai for $3.80 and their Xiao Bai Cai with Oyster Sauce for $6.50, both of which were the perfect accompaniments to our meal.\n\nTo top it all off, we indulged in their Kong Bak Bao (6 pcs) for $19.00, and boy, were we blown away! The combination of succulent braised pork and fluffy buns was a match made in heaven.\n\nOverall, our dining experience at The Braised House was phenomenal. The food exceeded our expectations, and we will definitely be returning for more. The staff were incredibly friendly and accommodating, making our visit even more enjoyable. We give them a well-deserved 5-star rating!",
      "time": 1707408338,
      "translated": false
    },
    {
      "author_name": "CK Lau",
      "author_url": "https://www.google.com/maps/contrib/108831522110958843213/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLpxjr_J7BvxJB4m4-JLahynuRXBaZxuesmLHg-sPZRem0aCA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "Ordered and paid via Kaikai app. Reached the shop but the person mentioned that they did not receive any orders and are no longer using the app so will not honor my order. The Kaikai logo is still prominently displayed outside the shop.\nSeriously if the owner has issues with food ordering or delivery platforms, you should settle with them and not punish your loyal customers (ok ex I mean).",
      "time": 1735122716,
      "translated": false
    },
    {
      "author_name": "Quan Teng Ho",
      "author_url": "https://www.google.com/maps/contrib/115124677922200088050/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVqPMqW7dINDE2zIa7oDNV2H5z_Apuzp2PJm6dJroJCQm_fhVpeFA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Went here to try their Signature Braised Pork Bowl as well as their Torched Tamagoyaki Mentaiko. Wasn't disappointed at all. The Tamagoyaki was pretty interesting and I'm sure children will love it.\n\nThe braised sauce they used for their braised meats was to my liking. The Signature Braised Pork Bowl also comes with a ramen egg, which I initially thought was a hard-boiled egg until I gave it a bite.\n\nThe staff were friendly and gave me recommendations on what to try. I'm glad that I listened to their recommendations. No regrets.\n\nThis outlet mainly serves takeaways and deliveries, but they still have some seats available for dine in.",
      "time": 1707993289,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16649234362393031986",
  "user_ratings_total": 38,
  "vicinity": "89 Bedok North Street 4, #01-119"
}