{
  "formatted_address": "38 Trevose Cres, Singapore 297722",
  "geometry": {
    "location": {
      "lat": 1.3224525,
      "lng": 103.8233016
    },
    "viewport": {
      "northeast": {
        "lat": 1.323818480291502,
        "lng": 103.8247563302915
      },
      "southwest": {
        "lat": 1.321120519708498,
        "lng": 103.8220583697085
      }
    }
  },
  "name": "The Glyndebourne",
  "place_id": "ChIJLRr0M_8Z2jER56HGLTtGwtM",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Winnie Lee",
      "author_url": "https://www.google.com/maps/contrib/117911153170675908591/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX9KOUIsbSooGQhCEYknjmMqbv25UnFJCTn-XOADXE5xe299w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Friendly facility management. My parents and I visit my sister at The Glyndebourne often and the security officers has always been polite and considerate. Also, facilities here are great! Always kept clean and well taken care of by the residents too. Location is also convenient. 100/10 would get a unit here if I’m not broke. 🥹",
      "time": 1742525904,
      "translated": false
    },
    {
      "author_name": "Wenya Lee",
      "author_url": "https://www.google.com/maps/contrib/107248063720232052298/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLTal-0Mg0MxMbw0u4FaXlw8DN6YsgqSAcd4Tr1zhPs07r2qko=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Overall, this condo has been a great place to live. The location is very convenient—there’s a bus stop right outside, it’s a 6 mins walk to the MRT, and Cold Storage (Alocasia) is just a 10 mins walk away. Driving to most parts of Singapore usually takes less than 20 mins, which makes commuting manageable.\n\nThe community here is welcoming, with friendly neighbours, helpful condo staff, and a professional security team. While security measures can feel strict at times, they are in place to ensure residents’ safety, which I appreciate. (Tbh I think it’s unfair for any non-resident to leave bad reviews here)\n\nThe condo’s facilities have seen improvements, with the swimming pool and playground upgraded the last 1-2years. I like how one is regularly paying maintenance fees and constantly seeing improvements within the condo.\n\nThe condo committee also puts in effort to plan events and celebrations, adding to the sense of community. Like any place, occasional maintenance issues arise, but I’ve found that condo is generally prompt in addressing concerns.\n\nHaving lived here for over four years, I’ve had a positive experience and look forward to staying longer.",
      "time": 1742101584,
      "translated": false
    },
    {
      "author_name": "JAekeun Song",
      "author_url": "https://www.google.com/maps/contrib/111623862993914788417/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIytUiglNxOj0KqPvqjwXp9BF2lp13SfvFYUDNbbPHRom4swdc=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "The rudeness of the Indian security guard is beyond words. Even if a vehicle is not registered and is parked for just one minute in a non-visitor parking area solely to load heavy items, he rushes over like a storm and makes a huge fuss. Apparently, there are sensors that trigger an alarm when an unregistered vehicle parks HaHaHa. His behavior is so rude that I am planning to file a complaint with the security company in charge. Be extra cautious of the territorial attitude of the bald Indian security guard. Because of this one person, the quality of the condo has dropped to its worst.",
      "time": 1740365561,
      "translated": false
    },
    {
      "author_name": "zack yeak",
      "author_url": "https://www.google.com/maps/contrib/109580914894927662288/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU5VRt8OIkvtAPkHTdPiscFQfLjTg3b-UxrNjim4Nn8ppU7mgxYzw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "Today I cover for my friend shift due to he is ill and deliver item to one of his customer at this place\n\nIm wondering that why the residents here is willing to pay the facilities fee monthly as:\n\n1- There is always no security officer on post at the main entrance ( I come on the afternoon time twice on 18 December 2024)\n\n2- The bald headed Indian security officer with spec is extremely rude, he asked why I parked anyhow on the lot but the fact is I parked at the side corner without blocking or creating any hassle to the residents or cleaner. I shared to him that I've no choice due to no officer at main entrance and this place only have 1 way in and out so I need to come in to avoid blocking the users at public road. He raised his voice tell me that he is sleeping now and suddenly management called him and scold him to get over to check what is on going...\n\nThis type of management really is a talent, without troubleshooting their own issue and quickly ask this guy to come admit he is sleeping as break time between 4-5pm and get screwed\n\nUpon leaving, this security officer warned that next time when you see this ugly face is here you park your vehicle outside the public main road.\n\nI'm totally amazed, that nowadays condo management team able to train such a person to take care of their residents which is paying monthly.\n\nSecurity officer should be always on post and assist as this is what the security officer should do\n\nLastly, my advise is if you have money in the pocket this place might not be a good and strategic place to be interested with no matter long term or short term unless the attitude of the management team change",
      "time": 1734514170,
      "translated": false
    },
    {
      "author_name": "Larry Woon",
      "author_url": "https://www.google.com/maps/contrib/101284693283698344387/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK84o_UbcULFT8Q2BZvAPdvVwE6rlZbfA0Ib3c4vuLaJY4iHw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 2,
      "relative_time_description": "5 months ago",
      "text": "Rude security.. Using phone while on duty. Unclear instructions given to visitors. Just say proceed to basement carpark. Only working here, you don't own the condo, why so rude?",
      "time": 1734251997,
      "translated": false
    }
  ],
  "types": [
    "real_estate_agency",
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15258835707469668839",
  "user_ratings_total": 91,
  "vicinity": "38 Trevose Crescent"
}