{
  "formatted_address": "189 Thomson Rd, Goldhill Center, Singapore 307631",
  "geometry": {
    "location": {
      "lat": 1.3186389,
      "lng": 103.8435667
    },
    "viewport": {
      "northeast": {
        "lat": 1.319667880291502,
        "lng": 103.8449465302915
      },
      "southwest": {
        "lat": 1.316969919708498,
        "lng": 103.8422485697085
      }
    }
  },
  "name": "The Clue-less Goat",
  "place_id": "ChIJi0g87ecZ2jERVDspnoPEgWU",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Angie Chng",
      "author_url": "https://www.google.com/maps/contrib/108764242257700631083/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXux1TvNz_ST8hQNgagfs8TGDlrWNSio1T2JB_erzvUXHbcyjw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "3 weeks ago",
      "text": "Wanted to try somewhere new when we were near Novena. Googled came with this suggestion. Had a hard time looking for it as the cafe front was blocked by construction.\n\nService staff was pretty cold except when we were leaving, some warm bye bye was given. Basic service is there, though.\n\nIt is meant to be a cafe, but the clutter at one corner of the cafe kind of spoils the ambience. Also, when we asked for sharing plates and the minute I saw those metal ones, sorry, but dogs came to my mind. I know Korean restaurants use them but didn't see that in most cafe.\n\nFood was basic. Maybe that explains the pricing too. The waffles were not like what we expected of in most cafes. They are the type you get from housing estates bakery, except that here they made them more crispy. Not a big servings for both our order. The cheese in our Classic order was rather pathetic. Don't expect those cheese overflow you get from other cafes. So one would need to manage your expectations.  Also, not too many items in the menu. So a re-visit might be challenging. Decent place but no wow factor. Is clueless goat after all!",
      "time": 1745478033,
      "translated": false
    },
    {
      "author_name": "Shan Leong",
      "author_url": "https://www.google.com/maps/contrib/113138367268114769094/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVgypX1jKR-WoZod5yJ8uke4gLbapZz4_rffHF7BHy9bX95LZwC=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Just looking around for a cup of coffee. Actually a good place to have a nice cup of coffee, but took me some time to locate where is it. Due to surroundings with lots of construction. As for the service was fast & friendly and environment was cozy. Food at other table looks good, will find chance to try it.",
      "time": 1745730725,
      "translated": false
    },
    {
      "author_name": "Joe Leong",
      "author_url": "https://www.google.com/maps/contrib/102838853844363316669/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK_Sw8urh8TJiEBCDoeBL12IrKcOvnYKJ7fgkare4PKVAOilg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "If you are Clueless on what they have to offer on their menu, step in and try their Breakfast set, pasta and burgers on unique plates. There is a Dirty Orange (coffee base) for the adventurous. Do be prepared to wait during peak hours as they have limited seats in the cosy cafe.",
      "time": 1738474028,
      "translated": false
    },
    {
      "author_name": "Pankaj",
      "author_url": "https://www.google.com/maps/contrib/103569609455800860012/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXdAwEipwD4osfdMYzWmgA2vH2rvrjmty7ihy52D2kbziZ6B8ll=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "2 weeks ago",
      "text": "Compact coffee spot in Novena with an interesting name. Come to the vicinity often but never tried this place before.  Came on a sunday, and the place was busy with brunch lovers. Getting a seat took a bit of time, but the servers were efficient in managing tables. Ordered a large cafe latte and an iced americano. Coffee took a bit og while to come but was decent, though not as strong as I'd like it. For 11 SGD for two coffees seems quite reasonable.  Give the goat a try.",
      "time": 1746327307,
      "translated": false
    },
    {
      "author_name": "Ribeye",
      "author_url": "https://www.google.com/maps/contrib/108129213100021627372/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVjsX2wodqm6tcuK3xSM4kccm8YMuGCBLmxd8sf2EhtIKIdDPW5=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "A neighborhood gem for brunch lovers, Clueless Goat charms with its warm, unpretentious vibe and hearty plates. The open-faced smoked salmon sandwich (added a poached egg separately for good measure) was a winner—layered with briny olives, sharp red onions, and silky salmon on toasted sourdough. Their Americano is smooth and robust, rounding out the meal nicely.\n\nStaff are genuinely friendly, and the space feels inviting with its mix of rustic and minimalist decor. Quirky, wabi-sabi-inspired tableware on display adds a cozy, homespun touch. Portions are generous for the price, making it a great value-for-money spot for lazy weekend brunches or casual weekday catch-ups. While not revolutionary, Clueless Goat nails simplicity and comfort—a reliable Thompson hideout for those craving honest, satisfying food in a relaxed setting.",
      "time": 1740237922,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7314343339399658324",
  "user_ratings_total": 818,
  "vicinity": "189 Thomson Road, Goldhill Center"
}