{
  "formatted_address": "5, Lower Kent Ridge Road Main Building, F02-02, Zone F Level 2, Singapore 119074",
  "geometry": {
    "location": {
      "lat": 1.2946909,
      "lng": 103.7832309
    },
    "viewport": {
      "northeast": {
        "lat": 1.296341380291502,
        "lng": 103.7844668302915
      },
      "southwest": {
        "lat": 1.293643419708498,
        "lng": 103.7817688697085
      }
    }
  },
  "name": "The Wellness Centre (National University Hospital, NUH)",
  "place_id": "ChIJvx2HfFEa2jERtbztIksliwk",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Wong Li Yun",
      "author_url": "https://www.google.com/maps/contrib/104760208769514512942/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVGpaXbKozVUmhziU6fccB6b2YS_iK0rY308_mkv_KzrdDDLcAN0w=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "This is my first health screening that I did in my life and I definitely recommend to have your health screening done at NUH Wellness Centre👍 The front counter staff, nurses and doctors are all very friendly to help. I was briefed well by the counter staff when I arrived and they make sure I understand clearly before proceed. The nurses are very patient too. When I told them I am scared of blood taking they take it very gently and walk me thru the process. It did calms me well. The consultations with Dr Karen after all my tests were very thorough. She is very kind and knowledgeable to let me understand my reports better. The environment of the centre is also very welcoming, they provide snacks and beverages like tea, coffee, water to let you consume while waiting. Also they provide referral to NUH specialist directly if there is a need. So all your health status and reports are within the same institution, making sure you get the care you need. The overall process of health check up is not rushed but at a comfortable pace. Very little waiting time spent, overall 5 stars for my experience here!",
      "time": 1744873430,
      "translated": false
    },
    {
      "author_name": "Linda Yap",
      "author_url": "https://www.google.com/maps/contrib/110745151998223906789/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJgWR38imxPROuK2vBaCFGd6yohL_Qu63aEEZ91tYJ-H3R4Hw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Dr Elsie Yong is very detailed, attentive, explains my health screening results very well, very patient with my questions and offer very good advices including improvement in my personal lifestyle and diet. Her calmness and pleasant approach is very reassuring",
      "time": 1740371767,
      "translated": false
    },
    {
      "author_name": "Apple ID",
      "author_url": "https://www.google.com/maps/contrib/115709038405527284642/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ-LGIjtPJVA09YQR3n47-XC28qwCsGJGBpn1OF3rgBUAqkPw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Great experience! I visited them today. My name is Ben. The staff at the counter greeted me with a smile and assisted me with all the preparation before the doctor. I got extraordinary service and would highly recommend. I was attended by Dr Elsie Yong. She was detailed in her explanation.\nThe nurses are also great at experienced.\nHighly recommend!",
      "time": 1745906921,
      "translated": false
    },
    {
      "author_name": "Pamela Tan",
      "author_url": "https://www.google.com/maps/contrib/112189637615914125760/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWAv0Skg3CvMTMQPtkK3C6S-h-BdlNJaND0G45csDo336BmxQS-zg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Excellent experience doing my Full Body Check Up at the NUH Wellness Centre. Staff and doctor and nurses there are very competent, patient and friendly. They were warm and helpful, answering all the questions I had. The centre is well decked out such that any waiting time spent there is comfortable. Making an appointment for the check up was also a breeze, doing that through WhatsApp. Loved the sandwiches, banana and coffee provided. Maybe can provide blueberries and dragonfruit too - to aid in stool collection!  Overall highly recommend that everyone does their full body check up here at the NUH Wellness Centre!",
      "time": 1739505106,
      "translated": false
    },
    {
      "author_name": "Michael Ong",
      "author_url": "https://www.google.com/maps/contrib/118396934392217926082/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWJTf2_lHwTecWvj2RB5CgCp8o426YnW9RZEQC65MZ4pbRD0V9O=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I had a wonderful experience from start to finish at The Wellness Center. The staff were incredibly friendly and welcoming. Eve was especially helpful, providing clear instructions and making sure I felt comfortable throughout the process. Dr. Karen was also fantastic during my consultation, offering valuable insights and guidance. Thank you!",
      "time": 1743646487,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=687684372742913205",
  "user_ratings_total": 454,
  "vicinity": "5, Lower Kent Ridge Road Main Building, F02-02, Zone F Level 2"
}