{
  "formatted_address": "602B Tampines Ave 9, #01-01 Happy Hawkers, Singapore 522602",
  "geometry": {
    "location": {
      "lat": 1.3612795,
      "lng": 103.9376827
    },
    "viewport": {
      "northeast": {
        "lat": 1.362582830291502,
        "lng": 103.9390429802915
      },
      "southwest": {
        "lat": 1.359884869708498,
        "lng": 103.9363450197085
      }
    }
  },
  "name": "The Only Burger",
  "place_id": "ChIJ35HbPQA92jERkSSgca4siK0",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "LP Pua",
      "author_url": "https://www.google.com/maps/contrib/113241051085659633004/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVJat0H-xuRcFQ5fZT0JkY6ObyUNLgL0WoknObSDkfn6wl6eZJnmQ=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "This Muslim-owned burger stall is located in a relatively quiet coffeeshop. We ordered the Original Beef (Double), the Smash Beef (Double), and the Oklahoma Beef (Single), plus upgraded one set with fries and two pieces of chicken. When the burgers arrived, they looked big and impressive. More importantly, the taste exceeded expectations, making this a pleasant surprise find. The only downside was that the burger was a bit dry.",
      "time": 1746945199,
      "translated": false
    },
    {
      "author_name": "Kevin Ng",
      "author_url": "https://www.google.com/maps/contrib/116845354307506613905/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUCQbg9CEQxcjrS59Qy7PrdM7iey1eoH-k9RrVYyu7bCMMFOXEl=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "A fantastic five out of five stars I was told about this place from a friend and this recommendation really did not disappoint. Like many of the reviews here, yes the beef is pretty soft, but it lacks no flavor!\n\nit's extremely favorful, where the burger is supposed to be spicy, or juicy, or tender, or crunchy, the burger ticks all the boxes!\n\nPortions are fairly generous and top up for fries isn't too expensive all in all we paid about $20 for two burgers and I would visit again just to try the other burgers.\n\nSwanky 10 out of 10!",
      "time": 1744285509,
      "translated": false
    },
    {
      "author_name": "A T",
      "author_url": "https://www.google.com/maps/contrib/110290698573319690288/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXbYAit7RBA38TcKWmeSJ-GeQ-qW7MxFTDanBkZ_194cz8-z3qXpg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Impressed with the burgers! Portion seemed big. But the bun easily flattened so it is good for me, and I don’t feel so bloated. The fish patty was really huge size very fresh  and soft. Fried. Just nice. Turkey ham with big portion of beef was also great. Might be abit thin to some maybe but I am fine. Freshness is key.  Looks like Carls Junior burger size.  Somehow it seems the lettuce and onion went well with beef and turkey.  Had to takeaway the fish for my girl to try!\n\nWould be nice if the burger has a wrapper over it as it gets messy while eating as the generous sauce from the fish burger oozed out. Otherwise we have to use our own tissue😅.",
      "time": 1732792630,
      "translated": false
    },
    {
      "author_name": "Roid Shafiq",
      "author_url": "https://www.google.com/maps/contrib/106532316620516285273/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJTpzkXobCAXPMCdhKi2cdilxp_p_tig03eBuvf4Y58ItlcDQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "5 months ago",
      "text": "Came to try this place after seeing it on GetFed. I had the Oklahoma burger while my girlfriend had the original chicken burger. Mine was really good, patty was flavourful, tender and juicy, and the flavour from the fried shallots was really good. Upgraded my sides to onion rings which were nice too, and the added cheese sauce on the side was a nice touch. On the flip side, the chicken burger was tough and really quite dry. I’m a fan of breast meat so I am usually quite lenient and understand that breast meat can be a little bit less juicy. However, this one was pretty bad, possibly due to the patty being overcooked. I believe this may be more of an inconsistency issue as opposed to it being a bad burger, perhaps texture can be improved with adjustment of the cooking times or a more consistent cooking time. Nonetheless, the flavours of the chicken burger were still really good, the patty itself having a peppery taste. Would definitely come back to try the other burgers and would love to see an improvement with the chicken burgers the next time I come.",
      "time": 1732975055,
      "translated": false
    },
    {
      "author_name": "Alvin Neo",
      "author_url": "https://www.google.com/maps/contrib/100320734673331402240/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJjk3UMSHMSxH2elZ-8zwXooiVIydmWiJVe-XnWlUz2UlePhg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "First time trying and tried the double spicy chicken and the serving was huge! I had to eat 1 piece of the chicken patty like a chicken cutlet by itself before I can eat the burger itself lol. And of course the taste was great and it's really quite spicy overall super worth the price!!!",
      "time": 1742139619,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "store",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12504293493136434321",
  "user_ratings_total": 128,
  "vicinity": "602B Tampines Avenue 9, #01-01 Happy Hawkers"
}