{
  "formatted_address": "290 Orchard Rd, #16-03 Paragon Medical Suites, Singapore 238859",
  "geometry": {
    "location": {
      "lat": 1.3036434,
      "lng": 103.8357434
    },
    "viewport": {
      "northeast": {
        "lat": 1.305236580291502,
        "lng": 103.8374154802915
      },
      "southwest": {
        "lat": 1.302538619708498,
        "lng": 103.8347175197085
      }
    }
  },
  "name": "The Plastic Surgery Practice",
  "place_id": "ChIJO-su3pIZ2jER4-wVJd2QiKM",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Annabelle Sainte-rose",
      "author_url": "https://www.google.com/maps/contrib/100041876666155208520/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXcpgYirT1ed2qkAkvw2784g00BgEMz_MhQ3j1Svjg_WE_SVv3C=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Dr. Karen Sng is incredible and so is her team.\nI am so happy with the results!  Dr. Karen is extremely good at what she does, and most importantly, she makes sure as a patient you feel comfortable too!\nNot only has she taken great care of me, but also she is lovely to speak with at every appointment.\nI can't speak highly enough of The Plastic Surgery Practice. I highly recommend becoming her patient! Thank you very much for doing such an amazing job.",
      "time": 1660204629,
      "translated": false
    },
    {
      "author_name": "Sue Thia",
      "author_url": "https://www.google.com/maps/contrib/100633780914076402484/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJentL5-RHnOspiMPU4B7xPaWFL1vAzwSM-Hx9-nJ-tPy0SPg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Thank you Karen Sng & team for your excellent service & care. Had my cholestrol deposits on both upper inner eyelids removed in April. To date it has healed very well. There was absolutely no pain during & after the procedure. Even so during the removal of stitches. Her skills are truly commendable. Her charges are reasonable too. I went to Karen with my eyes wide open after reviewing the few bad reviews. Spam google reviews have done injustice to professionals like them.5",
      "time": 1631587424,
      "translated": false
    },
    {
      "author_name": "Hanni",
      "author_url": "https://www.google.com/maps/contrib/110620269153758140457/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXmvn8gsvkb-_fM1g_GoPSdeEeiI0UTMrtKn1pnN1zb2WvkzAR7-w=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "There are no words I can find to truly express my gratitude and admiration for Dr Sng. THANK YOU for all you've done for me for the past 15years! Yes, I have been visiting Dr Sng for almost 15 years. Dr Sng changed my life tremendously and I am truly honored to have been one of her patients!\n\nDr Sng is a very compassionate, skillful, knowledgeable, professional, confident, kind, responsible and friendly doctor. She is easy to talk with and explains in detail what she feels she can do to help you. She has the ability to put patients at ease and therefore I have always trusted her. I know I will be in good hands.\n\nBreast augmentation was something I thought about doing for a long time and I'm glad I finally did it two weeks ago. I am beyond pleased with my results, it already exceeded my expectations! My friend can't believe how natural my breasts look! Dr Sng had given me the results of my dreams and a brand new confidence once again!\n\nI was also surprised that I experienced very minimal pain and discomfort after the surgery. I could even go shopping on second day Post op! It was again a very incredible experience with Dr Sng!\n\nI would also like to thank Priscilla and Lekshmi! They are warm, helpful and professional. Thank you for taking such good care of me.\n\nI would definately recommend Dr Sng to anyone looking for a more comfortable life with their body.\n\nI'm so blessed for having met Dr Sng. She had significantly impacted my life. A big thank you once again for the amazing transformation and taking good care of me!\n\nP.S., From what I understand, those negative reviews are made by unknown people who doesn't even exist in their clinic database. Those comments are definitely not true and unfair to Dr Sng and the Team! They deserve 5 stars rating!",
      "time": 1652157551,
      "translated": false
    },
    {
      "author_name": "Nayara Gonçalves",
      "author_url": "https://www.google.com/maps/contrib/107586502162558479823/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXep9Ey17F3f0VE6vmQlNRipMdhGOGbfBIG6NnTccJ8L7tTd025=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "From day one, Dr. Karen was very kind, constantly reassuring and patient with all my questions, doubts, and requests. She was understanding of my concerns and addressed all of them. Her team is just great! Priscila is very kind, gentle, thoughtful, calming, and Lekshmi as well, very pleasant, kind, and accommodating. Both always so friendly and helpful, regularly making sure I was alright and as comfortable as possible. Very prompt to answer my emails or texts. All are very competent in what they do. The night before and on the day of my surgery, I was very nervous. But Dr. Karen and Lekshmi that were in the room with me at the time, were so patient and sympathetic that they managed to calm me down. The recovery went very smoothly, and I'm happy with the results.",
      "time": 1630054818,
      "translated": false
    },
    {
      "author_name": "JC Lebraud",
      "author_url": "https://www.google.com/maps/contrib/106171189960969060338/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIWUmrhdXW4G8hL7UZP7cMKz0vw6H-U-qlnvddk4dAhKPDq-A=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Our 4 year old bumped into a stone table and perforated his lip through and through. Dr Sng came out to the ER within an hour on a Sunday to perform complex surgery on what was a jagged and deep cut. Thanks to this surgery and her excellent care over the ensuing months, our son has recovered his smile and his lip is as good as new! Thank you so much Dr Sng!",
      "time": 1629295121,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11783827704499268835",
  "user_ratings_total": 14,
  "vicinity": "290 Orchard Road, #16-03 Paragon Medical Suites"
}