{
  "formatted_address": "36 Temple St, #01-01, Singapore 058581",
  "geometry": {
    "location": {
      "lat": 1.2832521,
      "lng": 103.8437979
    },
    "viewport": {
      "northeast": {
        "lat": 1.284494880291502,
        "lng": 103.8452075302915
      },
      "southwest": {
        "lat": 1.281796919708498,
        "lng": 103.8425095697085
      }
    }
  },
  "name": "The Inn at Temple Street",
  "place_id": "ChIJz7vCOHMZ2jERpU02xW42jTg",
  "rating": 3.3,
  "reviews": [
    {
      "author_name": "Cobi Ivghi (‫קובי איבגי‬‎)",
      "author_url": "https://www.google.com/maps/contrib/101227509380909322624/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKMqWzMBBqL0phwgjL9pJfzIMIvkoDXhALSk2BjqlnPlhFidQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "Try to avoid this hotel! We booked for five nights, and right at the entrance there was a terrible smell of mold. The smell was even worse in the hallway and in the rooms. We asked to change rooms because the air conditioner wasn't working and the bathroom was unusable because of a narrow gap between the toilet and the shower partition. The room we were given also had a terrible smell of mold. There was no hot water, the manager said we had to wait for the electricity to heat it up. There was mold in the shower, the safe didn't work properly, the TV didn't work, we had the receptionist fix it. The shower partition was broken and the electric kettle didn't work (at this point we had given up on them). Apart from the proximity to the MRT and the smiling staff, everything was bad. We left after two days instead of five. Of course, the hotel manager's poor service mentality didn't include the option of apologizing or offering a refund for the nights we didn't use. We \"donated\" 280 US dollars so they could continue to \"serve\" others with poor service.  Don't fall into the trap!",
      "time": 1742966335,
      "translated": false
    },
    {
      "author_name": "Diam Doan",
      "author_url": "https://www.google.com/maps/contrib/102949606420551554437/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUrgLgg6cRz2jdFWZWJxRyq8zOBX769Qa22AoqjyYBJzwPW03he5w=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "3 months ago",
      "text": "The only good point of this hotel is its location. It is within China Town with lots of food courts and shops around, and nearby the MRT stations, very convenient after a long walking day.\nNegative point:\n- Rooms are not clean at all and had bad smell inside\n- Soundproof is not good\n- Some rooms does not have hot water and the water from the shower looked dirty, I guessed it the water pipe got rust inside\n- Room services: even they make up the rooms every day, they are not clean, and we found dust, hairs on the basin once we just back to the room at night - after room services",
      "time": 1739353845,
      "translated": false
    },
    {
      "author_name": "D. Akash",
      "author_url": "https://www.google.com/maps/contrib/103274512559522092106/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU1JU8AxjFCrvodKrPV0-xypiEJuxxsFDmGqKZMlnu14yfyNE3CRg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 2,
      "relative_time_description": "3 months ago",
      "text": "Positive points: the location is perfect, it is about 300m from metro station.\nThe backside rooms doesn’t have any noise problems\nBedsheets and towels get changed everyday and that lady is very kind.\n\nNegative points:\n1. Staff just know the check in and check out procedures, not qualified to give any other information.\n2. Overall service is average, doesn’t deserve 7000Rs per night price.\n3. Rooms are not clean at all. Very dirty/dusty behind cupboards.\n4. The floor has carpet which is not cleaned nor vaccummed since ages. So you can see dust all around the floor.\n5. The most bad part about this hotel, it doesn’t have water gun in toilets so most Asians will not like it. It is disgusting to use toilet paper only.\n6. On the last day, we realised bed has bedbugs so be really really careful. We are facing issues now after returning from the trip.\n\nDefinitely not recommended!!!",
      "time": 1738495346,
      "translated": false
    },
    {
      "author_name": "chen chu",
      "author_url": "https://www.google.com/maps/contrib/104211234078411092978/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL8YYZNuDA05DK2A7rhqKyV4yHvGo-rMDjfwmdd4DKdsZn50g=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 2,
      "relative_time_description": "3 months ago",
      "text": "The good:\nThe hotel is located in the middle of Chinatown with great food and shopping down stairs or a short walk away.  The MRT train station is 200m away with orchard road a few stops away.\n\nThe bad:\nThis hotel is in dire need of a full  renovation. From the moment  you walk in, there is a strong musky/mouldy smell.  Windows do not open which contributes to the smell.  The bathroom is very small to the point where you need to sit sideways on the toilet.  The room is generally dated with many worn or poorly repaired fixtures..",
      "time": 1739995484,
      "translated": false
    },
    {
      "author_name": "Andy Cheng",
      "author_url": "https://www.google.com/maps/contrib/111983549854221490618/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKH1GSiON8olnA6v2-L8wAYnp4YqPts5YVQtizf_YcyBCCsxw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "The manager is very treacherous and dishonest. No matter what day you search, there is only one room left of each room type, trying to entice customers to book a room quickly. However, according to customer reviews, the inn is dirty, old and dusty !\n\nMy request for cancellation and refund one month before the accommodation date was continuously rejected by the inn and the clerk can not speak mandarin.\n\nUnfriendly hotel & Poor service!",
      "time": 1740098919,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4074973087223139749",
  "user_ratings_total": 400,
  "vicinity": "36 Temple Street, #01-01"
}