{
  "formatted_address": "383 Bukit Timah Rd, #01-09B, Singapore 259727",
  "geometry": {
    "location": {
      "lat": 1.3195389,
      "lng": 103.827332
    },
    "viewport": {
      "northeast": {
        "lat": 1.320817230291502,
        "lng": 103.8286506802915
      },
      "southwest": {
        "lat": 1.318119269708498,
        "lng": 103.8259527197085
      }
    }
  },
  "name": "the RITUAL",
  "place_id": "ChIJv54-ECwZ2jERw8V-N3dPCEU",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "linda Lim",
      "author_url": "https://www.google.com/maps/contrib/111361792062638322258/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLxkp2UidfL8kderyYyT6T5jix6RpPcIv1oEUG1E1JTNaYB6w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "I like coming here! Jian Wei and the team are always so friendly and welcoming. They really make you feel at home. What impresses me most is that they remember exactly how I like my coffee, which adds such a personal touch. Even when it’s busy, they keep things running smoothly and never compromise on service. The food is consistently delicious too, fresh, flavorful, and satisfying. Highly recommend this spot for anyone looking for great coffee, good food.",
      "time": 1746677770,
      "translated": false
    },
    {
      "author_name": "Ng Yong Ming",
      "author_url": "https://www.google.com/maps/contrib/116059578954710664061/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWJpBwJZbbYhjW7D3nwcXB5KoGVYTxOtxa3AyB0TCxARETmWeMo=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "3 weeks ago",
      "text": "Went without making a reservation, luckily there were bar seats available still (most tables were either taken or reserved). Uncle Matt's beef bowl was quite good, not too sure if the pink bits were the homemade tsukemono (probably is) but it was such a good item to mixed into the rice with the furikake. Burst the yolk and then mix everything up like how you would do a bibimbap and every mouth has a good combination of the beefy taste, the crunch from the crumbs and tsukemono, and the creaminess of the yolk.\n\nMadame's truffle egg croissant was alright, but this is purely personal preference as the scrambled eggs at the top were not as creamy/runny as I preferred. Overall still a good item on the menu.\n\nStaff were very friendly, even offering to shift us to an alternative seat so that we aren't squeezing at the end of the table with other guests.",
      "time": 1745746728,
      "translated": false
    },
    {
      "author_name": "June Ang",
      "author_url": "https://www.google.com/maps/contrib/116720311529529767073/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVvlaCBBkhEzNUg-aLnlzHBdoE__dK6o3G_BzIe_DLHFUb7bMV4=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "The Ritual is a wonderful spot for brunch, with comfortable and clean setting with plenty of space. The staff are attentive and quick to accommodate my needs. While the prices are slightly on the higher side, the quality of the food and service reflects the value.\n\nWe ordered several dishes. The truffle eggs croissant was nice, with perfectly fluffy scrambled eggs enhanced by the rich aroma of truffle, all nestled in a buttery, flaky croissant. It was flavorful and satisfying.\n\nThe rosti with sausage is my favorite. The potatoes were shredded finely and pan-fried to golden, crispy perfection. Smoked salmon was included at no extra cost and the sausage (+$2) added a hearty and savory touch to the dish.\n\nFor dessert, the waffle with strawberries and vanilla ice cream stood out. The waffle was light yet crispy, with a generous portion of strawberries that added a tangy balance to the creamy vanilla ice cream. It was a sweet and satisfying end to the meal.\n\nIt’s a lovely place to enjoy a meal when you’re looking to treat yourself.",
      "time": 1735119068,
      "translated": false
    },
    {
      "author_name": "Ying Jie Han",
      "author_url": "https://www.google.com/maps/contrib/105854703119460047322/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWDAJYMGfuD_QdJlp86CcLC8inaQ8yuRQ_Pwx5wmeObfHSk1DM8=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "2 months ago",
      "text": "The mango chicken sandwich was really scrumptious (I liked the toasted sourdough, especially). But the piccolo I ordered was really not up to par. It was overly bitter and just wasn't made right. I think the space is okay, but the ventilation system is quite loud and sometimes the music playing was also a bit too loud (I could feel the vibrations of the speakers from the corner table I was sitting at).",
      "time": 1742370672,
      "translated": false
    },
    {
      "author_name": "lydia bae",
      "author_url": "https://www.google.com/maps/contrib/115696838656230481760/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW9PWzgqMmBAPYjKG4MAC2yNugGmrf5tEc2XeHFl-nREon5THc=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "Went on Public Holiday and it was packed. Luckily we made a reservation beforehand. Because it was PH, kitchen was busy & the food take longer to come out, but the service staffs were very kind to inform us of the delay. Coffee was good and this place is good for people who wants to cut down on their carbs/seek for rice substitutes. We ordered many food and the one that stood out the most was actually their vegetarian cauliflower bowl with omni meat. My mum enjoyed it so much.\n\nFood is definitely good, no doubt about it. But it’s a little bit more on the pricier side. But you get what you pay for, so there’s no complain there.\n\nIt’s a little difficult to get parking here. There’s a designated car park which charges $2/h after the first hour but it’s a little difficult to find. Alternatively, you can park at the landed houses area.",
      "time": 1730389300,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4974313161881470403",
  "user_ratings_total": 483,
  "vicinity": "383 Bukit Timah Road, #01-09B"
}