{
  "formatted_address": "226F Ang Mo Kio Ave 1, Singapore 566226",
  "geometry": {
    "location": {
      "lat": 1.366646,
      "lng": 103.8395414
    },
    "viewport": {
      "northeast": {
        "lat": 1.368030980291502,
        "lng": 103.8409761302915
      },
      "southwest": {
        "lat": 1.365333019708498,
        "lng": 103.8382781697085
      }
    }
  },
  "name": "The Kumpong Boys Malaysian Style Nasi Lemak",
  "place_id": "ChIJFdP0bUIX2jERz0Zz8e4CZGQ",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Peter Lim",
      "author_url": "https://www.google.com/maps/contrib/101588650628728817361/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUpGJkwO53g0WIb6onOUD1mII1l9oxx65DYln-axRq7oKnErn0_=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "I had tried many versions of Nasi Lemak in Msia, so, this piqued my interest. Ordered their Nasi Lemak Berempah Set (S$6.90). The chicken is fried until very crispy and the spice flavor is good. The rice texture is just nice but lacks the coconut (lemak) flavor.\n\nThe most important part of Nasi Lemak is the sambal. While the sambal is relatively okay, it is not the Malaysian-style sambal. The big onion-filled sambal reminded me of the prawn-onion sambal that my family used to cook. And the portion given is too little.\n\nVerdict: While the dish is relatively good, this cannot be considered a Malaysian-style nasi lemak.\n\nP.s\nIs the name of the stall \"Kumpong Boys\" instead of \"Kampung Boys\" an error or intentional?",
      "time": 1744782351,
      "translated": false
    },
    {
      "author_name": "Tsunami33",
      "author_url": "https://www.google.com/maps/contrib/116808243841536766045/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXaKOm-KFIILfc4qdhlY98PWcC5Q6xWfGuSpesKX8WMujf_jYYB=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Always a nasi lemak fan. The sambal is amazing. Loved the balance of spices and texture w the onions. Packed it too soon and should have left the chicken to drip and cool. But it was amazing with the rice and sambal. Will be going back to eat it fresh… have the others to try from the menu.",
      "time": 1744559143,
      "translated": false
    },
    {
      "author_name": "Super Fragrance",
      "author_url": "https://www.google.com/maps/contrib/105892392413528737906/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWqSHV5zr7c3YSKUDcYJTQPmMJX6sgB719ANkni_d0p9uj2OS23=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Came at 9.55am but they really only open at 10.30am. Ordered Berempah set for $6.90. For the uneducated Berempah means spice so chicken was coated with spice.\n\nI find the Malaysia nasi lemak to be misleading because the chicken is definitely better than any i had in KL. Is like S rank hunter cha hae-in vs healer lee joohee. And judging by the colour of the bone, the chicken should be frozen chicken so Jonas (the boss) frozen chicken is more moist and tender than any KL nasi lemak chicken.\n\nThe spice was flavorful and unique the only issue might be it is not very off the bone so that are still meat stuck onto the bone. Sambal chili is the spicy type which i prefer. Ikan bilis and peanuts for the crunch.\n\nSpecial mention goes to the egg as well it is bouncy and happy unlike some that are miserable.\n\nRice was also individualized and if i were to nitpick, it could have been more lemak. But i am also not sure if it is because of the sambal that overshadowed it.\n\nI know it is nasi lemak is not meant to be healthy but maybe Jonas can make it more healthy by including more vege other than cucumber.",
      "time": 1742354788,
      "translated": false
    },
    {
      "author_name": "Tan Wei Liang",
      "author_url": "https://www.google.com/maps/contrib/102725254698687540687/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ-GMosZmRp2EAuejHWn3oz1_7Mlj2OJ9KoG8qPLtuNMbaRFA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Definitely a hidden gem in AMK - one of the better Nasi Lemak I have eaten in SG. The rice is fragrant, sambal is good and the chicken is nicely marinated and fried too. Even the sides like the fried peanuts and anchovies are cripsy. The portion is also generous for such prices. Nothing to complain about generally, but if I really have to pinpoint something, the rice could have a stronger coconuty taste cause the sambal totally covers it. Without the sambal, the rice tastes pretty good by itself. But with the sambal, I can’t really tell I am eating nasi lemak (could be any basmati rice). Other than that, no issues at all. Would definitely be back again💯",
      "time": 1737119976,
      "translated": false
    },
    {
      "author_name": "Jacob TAN",
      "author_url": "https://www.google.com/maps/contrib/114080558508206655685/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUv7ChYSn_mkLArSNaLDWMUf1ZDQof9r4wk1hpAqCrkFj2Y3mn2=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "This Cosy coffeeshop has many popular stalls. The nasi lemak is one of those. They use basmati rice and the rice is firm but not so lemak. The chilli is very different from other nasi lemak stalls. It is bright in colour and spicier. The chicken is very nice, crispy skin with succulent meat. Very well marinated too.ikan billis is crispy and the fried egg omelette is nice.\nOverall, good quality nasi lemak at reasonable price.",
      "time": 1738907195,
      "translated": false
    }
  ],
  "types": [
    "meal_takeaway",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7233910126740195023",
  "user_ratings_total": 68,
  "vicinity": "226F Ang Mo Kio Avenue 1"
}