{
  "formatted_address": "6 Tampines Street 92, Block 2 #01-08, Singapore 528893",
  "geometry": {
    "location": {
      "lat": 1.3434187,
      "lng": 103.9415563
    },
    "viewport": {
      "northeast": {
        "lat": 1.344752780291502,
        "lng": 103.9428444802915
      },
      "southwest": {
        "lat": 1.342054819708498,
        "lng": 103.9401465197085
      }
    }
  },
  "name": "The Oasis, Where Pets Thrive",
  "place_id": "ChIJI8rtpuI92jERG7Y1dUTwhCo",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Tiffany Boogaloo",
      "author_url": "https://www.google.com/maps/contrib/103546682351624755795/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUD6dsv4Kodgrub8p99bOuVoWMKc21NthfWQ5cl1P5iq2w9C_Y=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "10 months ago",
      "text": "Went to this place for a corgi gathering - we had field and pool access from 9-11am(10-11am for pool) and paid about 27 per dog, owners don’t need to pay for their own person, just their dogs and whatsapp proof of vaccination records to the place. Place managed to  fit about 54 corgis and their owners comfortably.\n\nThe grass is synthetic so it is good for my corgi’s paws who is allergic to grass, and seemed quite clean overall. There are fun obstacle courses for your dogs, such as hurdles, and ramps of different steepness to test your dogs agility and a tunnel for the adventurous ones to run through.\n\nSome things for owners to take note - there isn’t any water coolers nearby in the compound area for you to fill up water promptly for your dog and water isn’t sold/provided for such meetups, however the pet shop next to the compound sells dairy free  ice cream from licked.sg for your dogs to cool down with. We were lucky to have a booth selling pet products that provided free water and puppucinos for our corgis. But for private use be sure to buy/bring water beforehand. There are vending machines at the drop off/pick up area and toilets outside before you reach Oasis.\n\nThe place started to get so hot by 10 plus and there was no shelter/roof shade, wish they could have at least provided huge fans or coolers especially since corgis are bad with Singapore heat due to their thick fur and most were panting heavily by 10am.\n\nFor pool access, do note there won’t be any personnel monitoring your dog as well, and the corgis had to be actively attended to by their owners. Life jackets are also NOT provided, so bring your own for your doggie. Hair dryers/drying services are also NOT provided/offered for dogs after they use the pool, however shower points for the dogs after they use the pool are available.\n\nFor a group gathering like this I think the price of 28 is alright, but I would not privately hire this place due to the lack of necessities/services provided as mentioned above for the field and especially so for the pool for $45 an hour without drying availabilities.\n\nDid Dm them on ig asking about these and am thankful they did reply me well.",
      "time": 1720339169,
      "translated": false
    },
    {
      "author_name": "subi le",
      "author_url": "https://www.google.com/maps/contrib/100734616064605444740/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLY-hfxTwTOewzleewgCE0gCgci0Wc59s9dXpdv__ZV9nZPJGk=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "They have a very big space both indoor and outdoor which is perfect for my dog. She loves it there because she can run around. 🐶💖👍",
      "time": 1743254867,
      "translated": false
    },
    {
      "author_name": "Soniya S",
      "author_url": "https://www.google.com/maps/contrib/101764956976912196128/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVxbAqjwN0Onf5IfaxtgJVPf59WY_XDM5bLPLV_MOVudbZyA2O-=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Our second time here, and the service and care only keeps getting better. From the WhatsApp customer service, all the way to the in person experience and post service after care, the team at Oasis really do ensure that pets thrive. My dog always enjoys the private pool and I can see his confidence building each time. The grooming services are also excellent and he looks super fresh after. Having everything at one place is very convenient. The team took great care of my pup and gave us a lot of assurance and updates. There is no doubt that your pup will be in good hands. Can’t wait to be back!",
      "time": 1689498881,
      "translated": false
    },
    {
      "author_name": "Janice Soh",
      "author_url": "https://www.google.com/maps/contrib/111310822271202712293/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJvmksE6N1CRPq7Z541gLWVjFk4fDFBfU6QOsuVmmmRQmifhw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "I would like to commend The Oasis for the positive experience I had — from initial WhatsApp communication (reservation process, checking of vaccination records) to actual day’s happenings. Booked a 2h pool session meant for birthday celebration of our litter-pups but the weather was not in our favour. Special shout out to Zhi Ying who displayed flexibility and initiative in allowing us to use the indoor venue instead for our gathering. Her little gestures of prompt provision of water bowls (for the dogs), bringing extra chairs in (for the humans), clearing table space and providing food bowls & lighter (for the birthday cakes) were much appreciated. Initiative cannot be taught and it’s a gem when you have staff who possess it. She also monitored the lightning warnings closely to keep us updated on the feasibility of proceeding with the pool session. We eventually could use the pool for 30 mins. Majority of the dogs in attendance also had “Bath & Fluff” done, so we left with nice clean tired dogs. Thank you so much once again to The Oasis team for contributing to the memorable 1st birthday celebration of our beloved pups.",
      "time": 1713670379,
      "translated": false
    },
    {
      "author_name": "Chee Chong Ngiam",
      "author_url": "https://www.google.com/maps/contrib/113681081264458530105/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUI0RH7EMx8LHcTRNQVo--jjlHFf5fhueVS7EqJqycROgWH8H8=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Finally found a place that can provide all the services require for my dog Max. Sarah the groomer is friendly and responsive to queries fast. She provide update on the progress and also nice photos  after grooming.  Will sure recommend to others who want a one stop shop for your dogs.  A place that allow all dogs and dog lovers to have fun.",
      "time": 1655643279,
      "translated": false
    }
  ],
  "types": [
    "park",
    "pet_store",
    "store",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3063837823333676571",
  "user_ratings_total": 58,
  "vicinity": "6 Tampines Street 92, Block 2 #01-08"
}