{
  "formatted_address": "60 Springside Walk, #01-13/14 1 The Brooks I, Singapore 786020",
  "geometry": {
    "location": {
      "lat": 1.4047655,
      "lng": 103.8194607
    },
    "viewport": {
      "northeast": {
        "lat": 1.406108480291502,
        "lng": 103.8206501302915
      },
      "southwest": {
        "lat": 1.403410519708498,
        "lng": 103.8179521697085
      }
    }
  },
  "name": "Therapeuo",
  "place_id": "ChIJi9jXlucW2jER9dRuWnJ7F3Q",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Jeremy Loh",
      "author_url": "https://www.google.com/maps/contrib/114196448888349046544/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKyY1j-LT6w8YntvYTb0jl1lawsMlfu4tjGOOVcaKtrDA310w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Bio resonance with Therapeuo rocks !\n\nIt seems like such a terrible loss for us all that this option is not available in the main stream.\n\nI’ve had a chronic and intense lower back pain for 3 decades. I’ve been told I had scoliosis, have tried muscle balance therapy, seen osteopaths, chiropractic adjustments but none of that worked out for me.\n\nBy the 7th session with Elaine from Therapeuo, my lower back pain had improved by 80% and I continued to remain almost pain free on a daily basis, nothing has ever come close to such a miraculous improvement for me in the last 3 decades. By the 14th session, my pain was almost completely gone. I’d say ‘almost completely’ because I believe that whatever residual remains of my lower back pain is mostly psychological in nature as I’ve lived with it for so long.\n\nCan’t thank you enough Elaine and team from Therapeuo. You guys are doing amazing work with Bio Resonance. Really appreciate it !",
      "time": 1659252051,
      "translated": false
    },
    {
      "author_name": "Siu Christina",
      "author_url": "https://www.google.com/maps/contrib/116551476310048158384/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJj5yYcHfA0dh6mI8qhEfqKu51wmDrnsrgAYBQRW877LG8HCA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "8 years ago",
      "text": "Words cannot fully express my gratitude for Therapeuo.\n\nIn 2012, a car accident compounded with stress caused me to develop blepharospasm, a disease with symptoms such as an uncontrollable blinking of both eyes and a nervous system gone haywire.   As I could no longer drive, this took a toll on my career that heavily inolves driving.\n\nI consulted 4 neurologists and 4 eye specialists but ended up with the same suggestion - Botox.  But I did not feel comfortable with such a procedure that needed to be done every 3 to 6 months.\n\nI chanced upon Bicom treatment while travelling in Hong Kong.  My uncle, a diabetic with kidney problems avoided dialysis through Bicom treatment.  The sharp pain at his waist subsided after just 2 treatments.  I thus decided to look for the same treatment in Singapore and  found Therapeuo.\n\nWhen I first met the chief therapist Elaine, she spent more than three hours on a very detailed analysis that was astonishingly accurate.  This motivated me to proceed with the treatment.\n\nHowever, after about six treatments, I did not not feel any improvement and sometimes felt worse than before.  Nevertheless, when I doubted if this treatment suit me, Elaine encouraged me to continue as she told me it was normal for the condition to worsen.  Truly,  I continued and my uncontrollable blinking slowly stablised.  At the end of a cycle of 15 treatments, Elaine conducted another analysis and most of my organs' conditions showed improvement and three of my 5 elements stablised.\n\nI decided to continue with another cycle and had no regrets, enjoying recovery in both my eyes and nervous system.  I felt calmer on a daily basis as well.  One day I decided to try driving again and ALAS! I was so happy to be back at the wheel and driving again:\n\nI sincerely thank all the therapists at Therapeuo, without whom my recovery would not have been possible - Elaine, Teck Seng, Sharon. Nicole, Lee Rui and Jasmine for patiently helping me through the battle, as well as the two lovely manager cum receptionists Wai Fong and Bee Lan.\n\nMy warmest and sincere regards\n\nSiu kee Christina Siu",
      "time": 1483597213,
      "translated": false
    },
    {
      "author_name": "Bernard Ong",
      "author_url": "https://www.google.com/maps/contrib/104181442535269245823/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI0K1tStjV-r_pVjj8OAN6B-B9V-etkxzcxZLWMij9oGVwtuZ4N=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "10 years ago",
      "text": "can be expensive but a trusted non invasive treatment for certain chronic diseases and lessen severe allergic reactions",
      "time": 1421805083,
      "translated": false
    },
    {
      "author_name": "Cristina Goh",
      "author_url": "https://www.google.com/maps/contrib/106572741641709220996/reviews",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUcW4uAA11IwCOMGhsgdtZQ4vEu8vjPGzNUc4BlrelxegEmqgsokw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "",
      "time": 1581005643,
      "translated": false
    },
    {
      "author_name": "Andrew Yeo",
      "author_url": "https://www.google.com/maps/contrib/107014026920953996868/reviews",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWtW-a7pan2XoE9ul6QiGRjj_xOSLE0zLvhlwa_lvdNLpg-5D_g=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "",
      "time": 1569338507,
      "translated": false
    }
  ],
  "types": [
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8365290563937686773",
  "user_ratings_total": 6,
  "vicinity": "60 Springside Walk, #01-13/14 1 The Brooks I, Singapore"
}