{
  "formatted_address": "11 Bidadari Park Dr, #02-03/05/06/07 The Woodleigh Mall, Singapore 367803",
  "geometry": {
    "location": {
      "lat": 1.3386593,
      "lng": 103.8717689
    },
    "viewport": {
      "northeast": {
        "lat": 1.339948030291502,
        "lng": 103.8734511802915
      },
      "southwest": {
        "lat": 1.337250069708498,
        "lng": 103.8707532197085
      }
    }
  },
  "name": "Thomson Women's Clinic/Specialists (Woodleigh) - Gynae, Pregnancy (Normal & High-risk), Health Screening, Fibroid, Cyst, IUI",
  "place_id": "ChIJZVtLSeAX2jERqhJnXsC4Y-E",
  "rating": 5,
  "reviews": [
    {
      "author_name": "yc",
      "author_url": "https://www.google.com/maps/contrib/108826451711712032977/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXGu2YY-rhE5o2Yp1aIAqjIfKI9yWTuHTTeJdbEXTJ155rLmMfiEQ=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "We were extremely grateful to meet Dr Ryan. His warmth, professionalism, and genuine empathy made every clinic visit something to look forward to. Under his expert care, I was able to deliver my baby safely.\n\nThroughout the entire delivery process, Dr Ryan was calm and confident. His reassuring presence and encouraging smile made each visit a joy. The staffs—Chloe, Ariel, and Hunnie were also extremely friendly and polite. Without question, when we’re ready for another baby, Dr Ryan will be our first choice.",
      "time": 1741319090,
      "translated": false
    },
    {
      "author_name": "JC",
      "author_url": "https://www.google.com/maps/contrib/104656847817193601624/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIdgJnMsjwITfI_4hehNXzhhnruijmOAP5i-IAZuq1mI4hCsgE=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I first met Dr. Ryan Lee at Fair during my pregnancy and was immediately impressed by his warmth and professionalism. After speaking with him, we felt completely at ease and knew he was the right doctor for us. Looking back, we couldn’t be happier with our decision.\n\nThroughout my pregnancy, every check-up with Dr. Ryan was reassuring and thorough. The nurses were always kind and attentive, making each visit a pleasant experience. When it was time for my C-section, Dr. Ryan performed the surgery with great skill and efficiency. The procedure went smoothly, and my recovery has been excellent—the incision healed beautifully with minimal discomfort.\n\nDr. Ryan is not only highly skilled but also genuinely caring. I’m incredibly grateful for his expertise and support and would highly recommend him to anyone looking for an exceptional OB-GYN!",
      "time": 1742538793,
      "translated": false
    },
    {
      "author_name": "kel Lew",
      "author_url": "https://www.google.com/maps/contrib/101134804647781074994/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIaKWek0w2p-6SlMQ0h3BNLmjyH4FKbHNkRRbZ8tIafK7OObQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "Words cannot fully capture the profound gratitude we feel for Dr. Ryan and the incredible medical team who guided us through the life-changing experience of our daughter’s birth via cesarean delivery. From the very first consultation to the moment we held our baby girl, Dr. Ryan exemplified unparalleled expertise and calm confidence. His meticulous attention to detail, paired with genuine compassion, eased our anxieties and made us feel empowered every step of the way.\n\nWhat stood out most was his ability to balance clinical precision with heartfelt empathy—whether explaining the procedure with clarity or offering reassurance during moments of uncertainty. The entire team mirrored this dedication, working seamlessly to ensure a safe, smooth delivery. Their collective professionalism and warmth transformed what could have been an overwhelming experience into one filled with trust and joy.\n\nTo Dr. Ryan and the team: Thank you for the extraordinary care you provided. You’ve given us the greatest gift, and we will forever cherish the skill, kindness, and humanity you brought to this journey. We wholeheartedly recommend Dr. Ryan to any family seeking not just a skilled surgeon, but a caring advocate during such a pivotal moment in life.",
      "time": 1747306767,
      "translated": false
    },
    {
      "author_name": "Jessica Rhane Go",
      "author_url": "https://www.google.com/maps/contrib/111993112864215074983/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXaz9YjrpdJpHSvcowK3Axbp_H5QcoV0DHKjOcOxGI7cmqp0mVyqA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Meeting Dr Ryan for the first time at a baby fair we attended last year left us with a good impression of how I would be cared for during my pregnancy - it also became one of the deciding factors how we finally chose Thomson Medical Centre.\n\nFrom the very beginning, Dr Ryan made everything smooth and manageable - he was easy to reach, always responsive, and most especially flexible with appointments, which made a huge difference throughout my pregnancy. Dr Ryan combines professionalism with a warm, reassuring approach that put my husband and me at ease. His thorough and genuine care throughout - both for me and my baby - made me feel confident and made this second pregnancy stress-free.\n\nMy family is very grateful for the experience we had under his care, as well as the support of his entire team at Thomson Specialists Woodleigh.",
      "time": 1745942064,
      "translated": false
    },
    {
      "author_name": "Yos Liman",
      "author_url": "https://www.google.com/maps/contrib/111856900133393390721/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIt3fqAfFOTss4lhRNFSFkX1OmmD2M0xk3iAjb9r-dzA6kE-t4=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "I couldn’t be more grateful to have had Dr. Ryan Lee as my OB-GYN throughout my pregnancy journey. From the very first consultation, he was incredibly attentive, patient, and knowledgeable. He always took the time to answer our questions, explained everything clearly, and made sure both my husband and I felt informed and supported every step of the way.\n\nOne thing that really stood out to us was how approachable and responsive he was—Dr. Lee is contactable via WhatsApp, and he always replied to our questions, no matter how big or small, with clarity and reassurance. This made us feel truly cared for and gave us peace of mind during those moments of uncertainty.\n\nDr. Lee has a calm and reassuring presence, which helped ease our anxiety, especially during the more challenging moments of labor and delivery. When complications arose and we had to proceed with an emergency C-section, he acted swiftly and confidently, ensuring both my safety and my baby’s. Thanks to his expertise and care, we welcomed a healthy baby boy into the world.\n\nI wholeheartedly recommend Dr. Ryan Lee to anyone looking for a dedicated, compassionate, and skilled OB-GYN. We’re so thankful for his support during one of the most important times in our lives.",
      "time": 1745212955,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16241027817585185450",
  "user_ratings_total": 214,
  "vicinity": "11 Bidadari Park Drive, #02-03/05/06/07 The Woodleigh Mall"
}