{
  "formatted_address": "820 Thomson Road Mt Alvernia Hospital Medical Centre D, #06-63/64, Singapore 574623",
  "geometry": {
    "location": {
      "lat": 1.3420964,
      "lng": 103.8379293
    },
    "viewport": {
      "northeast": {
        "lat": 1.343416530291502,
        "lng": 103.8392865802915
      },
      "southwest": {
        "lat": 1.340718569708498,
        "lng": 103.8365886197085
      }
    }
  },
  "name": "Thomas Ho Surgery (Alvernia)",
  "place_id": "ChIJb6LGNqQX2jERWZxci-xaPqE",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Jackson Lo",
      "author_url": "https://www.google.com/maps/contrib/116127836768901523041/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIJlw2odo3A7ma4pCwUAzSRyRk__OEDXMnvq4q3rordcbRekA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Dr Ho is very gentle, detailed, knowledgeable & careful specialist & surgeon. From the first appointment, you feel you are in good hand. My hernia operation is very smooth and the recovery also go smoothly. Dr Ho also gives additional advice re my prostate PSA readings which is not directly related to my hernia case. All the clinic staff are also very helpful. They organize all the files & receipts properly and guide me thru the claim processes. It is a very good & comfortable experience. I highly recommend Dr Ho on any hernia related issues.",
      "time": 1742607879,
      "translated": false
    },
    {
      "author_name": "Poseidon",
      "author_url": "https://www.google.com/maps/contrib/103093162916634415122/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUAtZcQ8cYUGwV5-ozOcmRao7aBozDJOKkbTjRQW74qD2uJ4YU8Qw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I recently had the privilege of being under the care of Dr. Thomas Ho, and I can’t recommend him highly enough. It all started with a lump in my neck that turned out to be a thyroglossal cyst. Dr. Ho was incredibly patient and attentive, taking the time to listen to all my concerns without ever making me feel rushed. He skillfully removed the lump, and though I experienced a minor issue with my vocal cord afterward, Dr. Ho quickly resolved it with expertise and care.\n\nBeyond that, I was grappling with stress and anxiety over some persistent bowel issues and other strange sensations. Dr. Ho didn’t hesitate to take my worries seriously, arranging a colonoscopy, a gallstone scan, and a full blood test to get to the bottom of it. To my relief, everything came back clear, and Dr. Ho’s reassuring demeanor made all the difference during that uncertain time. His professionalism, precision, and genuine compassion shone through every step of the way.\n\nThe experience extended beyond just Dr. Ho’s exceptional care—the entire process was seamless. Appointments were prompt, and the nursing staff was outstanding, going above and beyond to assist with insurance and billing details with kindness and efficiency. I was a walking stress-ball but Dr. Ho and his team made a potentially overwhelming situation feel manageable and stress-free. If you’re looking for a doctor who combines medical brilliance with heartfelt dedication, Dr. Thomas Ho is the one. Highly recommended!",
      "time": 1744174493,
      "translated": false
    },
    {
      "author_name": "Damien seet",
      "author_url": "https://www.google.com/maps/contrib/103129943553388905712/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ0cDO2U0hHGe7pKF9hbvfjzRpO8mSqPV3Xlpkb1Ch6OqTfag=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Dr Ho was superb and highly professional throughout the entire journey of my surgery! I just want to say a big thank you to him and his team of dedicated healthcare professionals! Definitely made the right choice in engaging his clinic!\n\nI engaged the clinic for removal of cyst at my neck, and from the first engagements , doing biopsy, to the procedure itself, and post op consultation, Dr Ho was always professional, reassuring and answering all my questions.\n\nThe medical concierge also helped me handle all appointments and insurance claims procedures, and advised me on the best approach.\n\nThank you once again to everyone!",
      "time": 1742610548,
      "translated": false
    },
    {
      "author_name": "Leonard De Leon",
      "author_url": "https://www.google.com/maps/contrib/103037660773710039442/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU_wYRuqjkrelY44DOD8Wpb90B2So3qEINOcfKrLo52I-cT39sz=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Dr. Ho and his team are highly professional and accommodating. They took the time to explain my case in detail, including the insurance claims process, making everything smooth and hassle-free.\n\nThis was my second surgery, but my first with Dr. Ho, and I can confidently say that this experience was much smoother than my previous one. From consultation to post-surgery care, everything was seamless. Dr. Ho is an outstanding surgeon who provides clear explanations and a reassuring presence, making me feel comfortable and confident throughout the process.\n\nI was initially referred to Dr. Ho by a colleague who also had surgery with him, and I can now confidently say he is truly deserving of the recommendation. If you’re looking for a skilled and compassionate surgeon, I highly recommend Dr. Ho and his team!",
      "time": 1739521113,
      "translated": false
    },
    {
      "author_name": "Tiong Cheng Tan",
      "author_url": "https://www.google.com/maps/contrib/116644169497359839403/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLTp15KoWgZCD-Q_gKxjrHADRZyOcNuRocyct53wrFQY04YFg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "The surgery was successfully in the first place. More importantly after the surgery, most likely due to the small cut, I was not taking pain killer and can do all the routine without much pain. The front desk nurse was helpful and prompt in replying watapps message. Will definitely suggest to friends and family.\n\nAnother positive comment on doctor. Doctor is nice and helpful, explaining the details and try to calm the patient. One part that I was really respect is doctor Thomas is so humble. When I mentioning two of my frenz that go thru similar surgery and suffer from pain for few days, he told me can’t directly compare as we may not know what is their surgery (but both key hole surgery and one of them is also hernia), he also mentioned different people recover differently.",
      "time": 1742353097,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11618824060659342425",
  "user_ratings_total": 148,
  "vicinity": "820 Thomson Road Mt Alvernia Hospital Medical Centre D, #06-63/64"
}