{
  "formatted_address": "12 Chun Tin Rd, Singapore 599599",
  "geometry": {
    "location": {
      "lat": 1.3420142,
      "lng": 103.7751052
    },
    "viewport": {
      "northeast": {
        "lat": 1.343314380291502,
        "lng": 103.7764560802915
      },
      "southwest": {
        "lat": 1.340616419708498,
        "lng": 103.7737581197085
      }
    }
  },
  "name": "Three Meals A Day",
  "place_id": "ChIJeW4H4WEQ2jERRJ-vsW_07J0",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "OJH",
      "author_url": "https://www.google.com/maps/contrib/113771211984981702031/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKQSS-sQKkF87XEJz7yu46cMd2V-r3NOtSpH-us1J0DxcqnTg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I’ve ordered from this restaurant several times and have also dined in on a few occasions. The food is consistently excellent, and the quality never disappoints. It has become one of our go-to spots whenever my family is in the mood for Korean cuisine. The flavors are authentic, the portions are generous, and the service is always warm and welcoming. This place truly holds a special spot on our list of favorite restaurants.",
      "time": 1745038537,
      "translated": false
    },
    {
      "author_name": "edwin",
      "author_url": "https://www.google.com/maps/contrib/109891667258604967057/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUiq8yL1wWH1ADQv1-rNu49gz9GkKBjEWVAGFFQ-C2Ko_pw7oLp=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "One of the tastiest and most affordable Korean restaurants around! The food is consistently good, and the value for money is unbeatable in Singapore.\n\nHighly recommend the samgyeopsal and the soondubu/kimchi soup—both full of flavor and generously portioned.\n\nThe place is often packed and walk-in only, so it can be a bit of a gamble if you’re coming during peak hours. Try during off-peak times if you can.\n\nThey usually charge $2 for additional lettuce, but the staff was kind enough to offer it free of charge just this once—a small gesture, but it really left a good impression.\n\nEasy 5 stars. Rarely disappointed. A place I keep coming back to.",
      "time": 1744162548,
      "translated": false
    },
    {
      "author_name": "AC Chan",
      "author_url": "https://www.google.com/maps/contrib/112914663109983612841/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWwNBKCO5Ms4Y2lK88n57wi8-GEEiKO7GMVshBia6Lxg2AUolVd=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Oh my goodness, the spicy stew pot with seafood, tofu, vegetables, runny egg and rice was so robust and tasty, I was continuously-slurping in the soup despite choking twice due to its level of spiciness (unfortunately, I have a low tolerance for spicy food). The seafood pancake with scallions also hits the spot. It was thin, crispy, non-greasy and loaded with plenty of fillings.\nDid I mention that each of their complimentary side dishes consisting of kimchi, seasoned bean sprouts, macaroni salad, stir-fried anchovies, stir-fried fish cake and egg rolls was equally impressive and refillable too! We were mindlessly eating loads of it while waiting for our food to arrive. 😬",
      "time": 1744768715,
      "translated": false
    },
    {
      "author_name": "Food Onedus",
      "author_url": "https://www.google.com/maps/contrib/105308664542476405432/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXzBidJ0vO1eVDuiIab1FbnroSw-H4HifDbk2079NwEY0GUOAA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "We were warmly welcomed by a Korean lady, who seemed to be the owner, before being seated. The restaurant’s interior closely resembled those found in Korea.\n\nThe food was incredible. We tried the seafood pancake, which was a bit thicker than usual but crispy and packed with flavor. The bibimbap was delicious, especially when paired with the gochujang sauce, which had a perfect balance of sweetness and saltiness. We also had the chicken bulgogi, marinated in what seemed like a homemade blend of sauce—absolutely tasty! We really enjoyed the makgeolli, though it would’ve been even better if it were a bit sweeter.\n\nLastly, the appetisers was really yummy!!! love it\n\nOverall, great food, vibe, and excellent service!",
      "time": 1740407015,
      "translated": false
    },
    {
      "author_name": "Tey sf",
      "author_url": "https://www.google.com/maps/contrib/114151153784481041457/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKvAk-BAWh56-FFbCIpEV4cIaafZSrjOKGfY-2HIrjtm5_stQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "I have ordered the food from Three Meals A Day for our Mother's Day Celebration at home today for lunch. It is very well-received by my family. I love how authentic the Korean food is and it makes me feel like i'm back to Korea again. The seafood pancake is full of ingredients. The bossam meat really melts into your mouth. The cheese chicken bulogogi has a kick in the spiceness but is well-complemented with the cheese. The tuna and cheese gimbap is also well-made and i love the ingredients used. I also like the half half chicken especially the fried chicken is really crispy. I also love their side dishes especially the kimchi. Highly recommend you to order from them. Keep up the good service and food quality! :)",
      "time": 1746855799,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11379739119018024772",
  "user_ratings_total": 947,
  "vicinity": "12 Chun Tin Road"
}