{
  "formatted_address": "3 Gateway Dr, #01-13/14 Westgate, Singapore 608532",
  "geometry": {
    "location": {
      "lat": 1.3343784,
      "lng": 103.7426548
    },
    "viewport": {
      "northeast": {
        "lat": 1.335834580291502,
        "lng": 103.7443741302915
      },
      "southwest": {
        "lat": 1.333136619708498,
        "lng": 103.7416761697085
      }
    }
  },
  "name": "Tim Ho Wan",
  "place_id": "ChIJhTNgqg8Q2jERhKyZxs5QY_I",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "Kaori Ginger",
      "author_url": "https://www.google.com/maps/contrib/115769713843279821069/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUnlD4V_zptK4p7CCufgBA8PzqEp16HmAJAIQ0T1mNqUNeqza49ZA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "4 weeks ago",
      "text": "Had lunch there over the weekend. Stood outside for a good 5 to 10 minutes before the staff showed us to our table. Restaurant was not full at that time thou. Partner warned me about my previous visit, which I forgot! There were flies!!! During our meal, those flies disturbed us quite alot. If you do not care about the flies, go ahead with this place as the food were good.\n\nWell, we had a couple of frequently ordered dimsums like chicken glutinous rice, wanton mee, fried taro dumplings and fried milk custard. And the new item crispy shrimp red rice roll with roselle sauce.\n\n¹Chicken glutinous rice is a pleasant surprised with a piece of lup-cheong (Chinese sausage) in it. Comes with some small meat pieces and mushroom. Something like the lotus leaf glutinous rice instead of the typical \"Lou Mai Gai\". Surely will be my to-go for list for THW.\n\n²Crispy shrimp rice roll comes with tangy roselle sauce at the side, very pleasant for my palate. The sauce was sweet, kinda feel like cranberry sauce. Definately a must try.\n\n³Wanton mee comes with 4 shrimp wanton, dint try the noodle since it was my partner's, instead, I had a taste of the soup. Erm.. not to my liking anyway.\n\n⁴Fried taro dumplings with chicken filling was good! I swear this place knows how to get it done perfect! ⁵Fried milk custard is something special, it's like having a dessert hot and crispy with the doink-doink milk custard inside. Very satisfied with this two fried dishes. ⁶Cabbage with soy sauce was normal lah, as you see, need to balance the meal with some vegetables right~ Kailan was never my choice whenever we order vegs, so there goes the cabbage.\n\n⁷Surperior Pu'er tea was served hot and thick. I wish I had more, but! The flies kept on disturbed us, thus we left very quickly after finish only the second cup.. The meal was great, only drawback- flies! First 1, then 2, then comes the whole family of flies....\n\nWhen we paid for our bill, I did ask why were there so many flies! The lady explained that since they are near the door, so flies does fly in.... Erm....",
      "time": 1745364795,
      "translated": false
    },
    {
      "author_name": "Ewe Keat Huan",
      "author_url": "https://www.google.com/maps/contrib/103626082513610890905/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVcpEkpp4b_KaWygB0NfRxr1geo73o12xphky_CrUovf85LgjzQLw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "Dropped by Tim Ho Wan for a quick dim sum fix. Ordered the Glutinous Rice and Chee Cheong Fun. The Chee Cheong Fun was the highlight – smooth, well-made, and served with a flavorful soy-based sauce. Definitely enjoyable.\n\nThe Glutinous Rice, however, was a bit underwhelming. While the portion was decent, the flavors were rather flat and lacked depth – a 3/5 for that dish.\n\nTo round off the meal, I had a hot Hong Kong-style milk tea, which was surprisingly good. Rich, smooth, and nicely balanced.\n\nOverall, the meal had its ups and downs. Solid service and a casual atmosphere, making it a decent spot for dim sum cravings. Final rating: 3.5 out of 5.",
      "time": 1746872878,
      "translated": false
    },
    {
      "author_name": "C",
      "author_url": "https://www.google.com/maps/contrib/108121427451405924195/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUVEFBMqVdde84YgM7RmJUjTlK2YyphjppNJiT0NgrZFZyAG6RYYA=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Tim Ho Wan at Westgate brings the brand’s signature Hong Kong-style dim sum to the heart of Jurong East. Once known as the world’s most affordable Michelin-starred restaurant, it continues to serve classic dim sum dishes in a casual, family-friendly setting. The outlet offers a comfortable space for both small gatherings and quick meals, with service that’s generally prompt and efficient.\n\nWhile the quality isn’t quite on par with the original in Hong Kong, it’s still above average and reliably tasty. It’s not as crowded as it used to be — we got a table with no wait after peak hours. One downside this visit: a few flies were buzzing around, which was annoying and something I hadn’t noticed on previous trips. Still, I’d rate it a solid 4 out of 5. A convenient option in the West when you’re craving dim sum without the queue.",
      "time": 1744540215,
      "translated": false
    },
    {
      "author_name": "Jia Qi",
      "author_url": "https://www.google.com/maps/contrib/106025704040144996309/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIJas8waQkHLxRJTPooVbPFKHUbP_bkG8ewoCH7_jKhuuU1Xg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "My mother and I dined at Tim Ho Wan (Westgate) recently. While the food was enjoyable, we were quite disturbed by the number of flies around our table and hovering over our food throughout the meal. We had to constantly swat them away, which significantly affected our dining experience. Unfortunately, both of us developed diarrhoea shortly after. Although we can’t confirm with certainty that it was caused by the food at Tim Ho Wan, it was the only meal we had in common that day. I hope the restaurant will look into improving its hygiene and food safety standards to prevent similar incidents for future diners.",
      "time": 1744612317,
      "translated": false
    },
    {
      "author_name": "Samuel Lam",
      "author_url": "https://www.google.com/maps/contrib/103278705053675847980/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIZvC3XKUL098VRbgpMEGeV5vUh7e8AAXbx3_-u8pdkGuvSrQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "A good place to have our dim sum fix!\n\nPorridge was good, Chee Cheong fun was nice and fresh. The dumplings in hot sauce was delicious and a must try. The carrot cake fried perfectly with sufficient among of egg.\n\nWonderful place for a quick luncheon.",
      "time": 1733632262,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17465892628898360452",
  "user_ratings_total": 1006,
  "vicinity": "3 Gateway Drive, #01-13/14 Westgate, Singapore"
}