{
  "formatted_address": "Changi Business Park Central 1, #01-35/36 Changi City Point, Singapore 486038",
  "geometry": {
    "location": {
      "lat": 1.3343581,
      "lng": 103.9624938
    },
    "viewport": {
      "northeast": {
        "lat": 1.335796530291502,
        "lng": 103.9636760802915
      },
      "southwest": {
        "lat": 1.333098569708498,
        "lng": 103.9609781197085
      }
    }
  },
  "name": "Tonkatsu ENbiton (Changi City Point)",
  "place_id": "ChIJu4ftHEI92jERpaLE5fjPz6E",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Roy Chew",
      "author_url": "https://www.google.com/maps/contrib/110002905279294451984/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWbCwliw6LS1SrxYjSGn1Krx4v6fTOC3OhhQpkjUz0c_zzvcI_hWQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Dining area is clean and welcoming. The food is fresh and cooked to order.\n\nThe cabbage with arugula is refreshing and goes well with both salad dressings on the table.  With the set order, it is free flow rice and salad which makes it a great deal.\n\nThe (complimentary after Google review) yuzu ice-cream is refreshing. Love the tangy and slushy texture.",
      "time": 1743401050,
      "translated": false
    },
    {
      "author_name": "LP Pua",
      "author_url": "https://www.google.com/maps/contrib/113241051085659633004/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVJat0H-xuRcFQ5fZT0JkY6ObyUNLgL0WoknObSDkfn6wl6eZJnmQ=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "We ordered three Rosu Katsu Sets with pork from Australia ($23++), Hokkaido ($22++), and an unknown origin ($16.50++), paired with rice or ramen. Though the Tonkatsu varied slightly between sources, the classic tasted just as good to me. The atmosphere was similar to another restaurant starting with S, featuring sesame seeds to grind, free-flowing rice and cabbage, and similar servings. After the meal, we were offered an ice cream for completing a review survey, which included an option to post our rating on Google. This might explain why many reviewers have only one or two reviews. Overall, the meal was enjoyable and worth revisiting for Tonkatsu cravings.",
      "time": 1744554922,
      "translated": false
    },
    {
      "author_name": "Angel Tan",
      "author_url": "https://www.google.com/maps/contrib/117158785732917448770/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKoME4OCsVvTlp4mKmkEP8HwUjCSeZp7b8A1S_j_IkHJZxSsQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Good choice for tonkatsu (there’s even ramen options if u don’t want rice). Best part was the free-flow cabbage, yuzu radish & tonjiru!\n\nAlthough I can’t really tell the difference between Hokkaido pork, Australia pork or local pork, the dishes were all quite delicious! I had the Hokkaido rosu katsu, salmon katsu & ebi fry combo set, which came with crispy & tender pork, & surprisingly the fried salmon was quite moist within the fried batter. Another special dish would be the Rosu Australian kuro kare set, with thick & cheesy black curry!\n\nIG @pingguo301",
      "time": 1743438379,
      "translated": false
    },
    {
      "author_name": "Jechtto",
      "author_url": "https://www.google.com/maps/contrib/106407471320614893952/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXfpuQZTlp2__GjGOxQV6bcw2xpvSE6rQbeHGZ3jSZ2CFmY-bts=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "2 weeks ago",
      "text": "Hungry from half a day of setting up for an event at SingEX, my colleagues and I wandered into a Changi City Point that looked like it was in the midst of a revamp, while parts of it might have been boarded up,thankfully most of the dining options were still available, after circling around the ground and second storeys we decided on this. And boy did the Tonkatsu with its unlimited servings of rice and shredded lettuce hit the spot. First off, since it was a company lunch I restrained myself from ordering any of the fancy Japanese pork, instead I went with the classic Rosu set with Australian Pigs. Though this was the affordable option I must commend the eatery for an impeccable job well done, the crust was light with a satisfying crunch while the meat remained tender and juicy. Pair it with rice or shredded lettuce with the sesame dressing together with the Tonkatsu sauce and this lunch was top notch to the point I was relishing each morsel and taking my time. Will definitely be back to try the most expensive options!",
      "time": 1746179703,
      "translated": false
    },
    {
      "author_name": "Ashok Sankaran",
      "author_url": "https://www.google.com/maps/contrib/116151474993521378025/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXlxBvGEHW46FegwN83aM72D-6C6FAeMauGNkeuFwMhW20hXe5hbQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "If you're craving tonkatsu or ramen, this spot is a must-visit. The tonkatsu is the true star—perfectly crispy and crunchy without being oily or heavy. Whether it's meat or fish, every bite is satisfying. The ramen is equally delightful, with a rich, flavorful broth that hits all the right notes.\n\nOne unique touch is the sesame seed grinding activity while you wait—a fun way to pass the time. The food arrives piping hot, and everything is fresh and delicious. We also loved the free-flow salad and rice, which makes it a great choice if you're extra hungry.\n\nFor those looking to unwind, the alcohol selection is extensive and reasonably priced. The service is fast, efficient, and attentive, adding to the overall experience.",
      "time": 1738114690,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11659766628199211685",
  "user_ratings_total": 508,
  "vicinity": "Changi Business Park Central 1, #01-35/36 Changi City Point"
}