{
  "formatted_address": "820 Thomson Rd, #07-66 Singapore Medical Center D, Singapore 574623",
  "geometry": {
    "location": {
      "lat": 1.3416368,
      "lng": 103.8372638
    },
    "viewport": {
      "northeast": {
        "lat": 1.342935380291502,
        "lng": 103.8386234802915
      },
      "southwest": {
        "lat": 1.340237419708498,
        "lng": 103.8359255197085
      }
    }
  },
  "name": "Tony Tan Women and Fetal Clinic",
  "place_id": "ChIJZaVCKToX2jERu2_ExvGJ66k",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "fanny sia",
      "author_url": "https://www.google.com/maps/contrib/106821868375736610139/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKnbbWanSeqF2qg-JYMxJyB3cAcdQ_x4x2MGrBd5I22vcpdyA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I had the most positive pregnancy and birth experience with Dr. Tony Tan and his amazing team. From the beginning, Dr. Tan was incredibly patient, knowledgeable, and always took the time to explain everything in detail. Given our previous complicated pregnancy, we felt so reassured by his thorough approach in outlining our care plan and options. His professionalism and empathy truly alleviated any concerns we had along the way.\n\nThe birth process went smoothly, and our baby arrived safe and sound last month. I also can't thank Dr. Pay enough for her skill and care during the epidural administration. It was quick, painless, and completely fuss-free, which helped ease my nerves. Dr. Pay was also very reassuring throughout the entire process, which made a huge difference.\n\nThe nurses at Dr. Tan's clinic are also wonderful—friendly, caring, and efficient. The waiting times are always very manageable, which was an added bonus!\n\nWe feel so lucky to have found such a capable and compassionate team to guide us through this journey. Thank you, Dr. Tan and everyone at the clinic, for being such an important part of our pregnancy and birth experience!",
      "time": 1737965813,
      "translated": false
    },
    {
      "author_name": "G Y",
      "author_url": "https://www.google.com/maps/contrib/115930375409130418632/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLI8m97_9dIWjEi7QS6_nDlPh9LyL7PUIqhnu0HkfcU0S0bIQg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Very grateful to have had Dr Tony Tan as my obstetrician for my first pregnancy. He is very attentive, thorough and took the time and effort to answer any questions or concerns I had. His professionalism and expertise is unmatched and I thoroughly appreciated his calm and reassuring demeanour throughout my pregnancy. I felt very taken care of at every stage  and I credit my smooth pregnancy journey to Dr Tan and his lovely team of nurses who went above and beyond.\n\nThank you again to Dr Tan and his amazing staff!\n\nJi Eun Y",
      "time": 1734518255,
      "translated": false
    },
    {
      "author_name": "Melissa Lim",
      "author_url": "https://www.google.com/maps/contrib/109223232247856272445/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUoI9C-7qeiYJSwb1iPlwL2T6K-ZBX82fXC4DEV_zv7vkYKI1j4=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Throughout the pregnancy, Dr Tan was extremely assuring and made us feel at ease during every appointment. Even when there was not so good news, he would break it us calmly and with a clear plan on how to move forward. Therefore, I felt like I was in good hands every step of the way. The eventual delivery went as well as can be expected, and  baby is finally here! We couldn’t be more excited.",
      "time": 1740628913,
      "translated": false
    },
    {
      "author_name": "Sue-Ann Wee",
      "author_url": "https://www.google.com/maps/contrib/105756064192367583174/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLLXeIO1CJHpSeS93OUVXV7_ZV1DrIdGz3uw_83Lv51rv6T0w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I was considered a high risk pregnancy, given certain conditions e.g age, twins.\n\nFrom start to delivery, Dr Tony and entire team have been professional and competent, yet warm and caring. For each visit, Dr Tony explained carefully my conditions and the various risks involved, which was highly transparent and fully appreciated. The team of nurses was always responsive to my questions and needs, and ever so friendly.\n\nI successfully delivered to healthy twin babies on 18 Dec and could not have done it without Dr Tan and his team. Much thanks!",
      "time": 1734581354,
      "translated": false
    },
    {
      "author_name": "Eileen Cheng",
      "author_url": "https://www.google.com/maps/contrib/109764805359874469229/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLFiYjt2MV3KAIFl6sb02MPRjUkkxCjZLbJDY9mPNMWYJaG=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Dr Tony Tan was recommended to us since the start of my pregnancy and I am thankful to have him as my gynaecologist and as well as the entire nurse team! All of them are very friendly and knowledgeable, always patient in answering all my queries and concerns too.\n\nI am very grateful for Dr Tony Tan and Dr Pay - my anaesthetist and all the nurses for assuring me and ensuring me a smooth delivery! Thank you for accompanying me through this happy journey of my first child!",
      "time": 1730088302,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12244031683451711419",
  "user_ratings_total": 69,
  "vicinity": "820 Thomson Road, #07-66 Singapore Medical Center D"
}