{
  "formatted_address": "90 Jalan Senang, Singapore 418461",
  "geometry": {
    "location": {
      "lat": 1.3262756,
      "lng": 103.9163833
    },
    "viewport": {
      "northeast": {
        "lat": 1.327628930291502,
        "lng": 103.9176685802915
      },
      "southwest": {
        "lat": 1.324930969708498,
        "lng": 103.9149706197085
      }
    }
  },
  "name": "TO:YOU Cafe",
  "place_id": "ChIJ0e7uSXE92jERf_Ubq9rdk9c",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Rene C",
      "author_url": "https://www.google.com/maps/contrib/109980768062357810585/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXOpAs20kWQR_enBX8_FPYCC9uQlt5Sx8_UPA-qGz2Ypcx8GliW=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I really liked the way the day light streamed into the cafe, made the area feel more bright and airy.\n\nService staff were all very helpful and polite, service time was quick despite the crowd.\n\nThe food was great! My whole family enjoyed all our dishes and even had seconds for the chicken karaage. The sando is a must try as well! And please please do try the strawberry matcha, otherwise it has to be the sea salt latte if you’re into coffee.\n\nDon’t forget to take out some pastries - I had the croissant and scone, they were really yummy and I think their scones are my new favourite now!",
      "time": 1745133284,
      "translated": false
    },
    {
      "author_name": "Yordan Yit",
      "author_url": "https://www.google.com/maps/contrib/111794790666094275154/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLbO_XZ0gYOLp0LZTMEJdRmENeMn6_Pf_lyLhsRxAVpDZGSzg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "This cafe offers a rustic charm with metal plates and cups. The food was flavorful and well-prepared, with the creamy truffle udon being a highlight, though it could have been less creamy.\n\nWhile the cozy ambiance and pet-friendly outdoor seating add to its appeal, better ventilation and clearer signage for steps leading to the restroom would enhance the experience.\n\nOverall, a pleasant visit with great food. With a few improvements, this cafe could truly shine!",
      "time": 1742636688,
      "translated": false
    },
    {
      "author_name": "YM Tan",
      "author_url": "https://www.google.com/maps/contrib/105649192512753518764/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW9jcXQiguRfOX5eQ-RFLvJYLaYBGSepLzJFfZj2G0gnLqs3CHKMw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "TO:YOU Cafe is a cozy, pet-friendly café tucked away in a quiet residential stretch near Kembangan MRT. Its dark green exterior opens into a bright, minimalist space filled with natural light from a skylight — creating a wonderfully airy and welcoming atmosphere.\n\nDespite the open design, the café remains pleasantly cool and comfortable. Even when crowded, the atmosphere stays calm and peaceful, making it easy to relax or have conversations without feeling overwhelmed.\n\nIf not for my son bringing me there, I would never have discovered such a hidden gem tucked in this neighborhood.\n\nFood & Drinks Tried\n\nVanilla Ice Cream:\nServed in a delightful glass bowl adorned with cute dog illustrations. The ice cream was creamy, smooth, and not overly sweet — refreshing on a warm day.\n\nFurikake Fries:\nGolden, crisp fries topped with furikake seasoning for a savory umami kick. Well-fried and highly addictive — perfect for sharing.\n\nWaffles with Matcha Ice Cream:\nA hearty, crispy waffle drizzled with chocolate sauce, topped with rich matcha ice cream and a playful red biscuit. The contrast of warm waffle and cold ice cream was comforting and satisfying.\n\nCoffee & Espresso;\nRounded off the meal with a hot coffee and an espresso shot — aromatic, robust, and a perfect match with the desserts.\n\nFinal Thoughts\n\nTO:YOU Cafe is truly a hidden gem in the East. The natural brightness from the skylight lifts the mood, yet the café remains comfortably cool. Even when full, the quiet and cozy vibe makes it perfect for a relaxing brunch, catching up with friends, or simply unwinding.\n\nA heartfelt, community-driven space — and definitely a spot worth revisiting.\n\nLocation and Operating Hours\n\nAddress: 90 Jalan Senang, Singapore 418461\n\nOpening Hours:\nTue–Sat: 8 AM – 8 PM\nSun: 8 AM – 6 PM\nClosed on Mondays\n\nNearest MRT: Kembangan\n\nPet-Friendly: Yes, outdoor area",
      "time": 1745657673,
      "translated": false
    },
    {
      "author_name": "Jing L",
      "author_url": "https://www.google.com/maps/contrib/104828919516750525001/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKizpd6nzKFYmMZSFmSyFs6lP0u_wa-c60Pi_ZyCB3Zxlpj2Q=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "A \"hidden\" gem at Jalan Senang. The dishes (including the dessert) were executed perfectly. Well done chef!\nWeekday dinner - cozy ambience, not overly crowded. The service staff was friendly as well.\n\nA cafe that we will return again, perhaps to try their breakfast and coffee.\n\nIndeed \"Today is a wonderful day.\" A good dinner at TO:YOU to end the day on a high note.",
      "time": 1744122913,
      "translated": false
    },
    {
      "author_name": "Hui Wen Loon",
      "author_url": "https://www.google.com/maps/contrib/115539226792829764982/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJX1Zt2UjgqYdCRjOzPRZSI_-63LDdSoEmaxvQVh8B-yZDIWA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Service was slightly slow.\nLoved the truffle carbonara sauce however udon was overcooked. Lost the al dente feels.\n\nTamago Sando was not too bad although I wouldn’t have preferred it to be the traditional katsu instead of tamago. But creative dish.\n\nDrinks - can be improved. Matcha taste not strong enough.\n\nPet friendly place also location was rather ulu. Saw a couple of cars kena ticket as there isn’t much proper parking near the cafe…\n\nOverall good vibes.",
      "time": 1745150511,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15534003470974317951",
  "user_ratings_total": 157,
  "vicinity": "90 Jalan Senang"
}