{
  "formatted_address": "1 Tan Tock Seng Link, Singapore 307382",
  "geometry": {
    "location": {
      "lat": 1.3233301,
      "lng": 103.8462888
    },
    "viewport": {
      "northeast": {
        "lat": 1.324632230291502,
        "lng": 103.8475820802915
      },
      "southwest": {
        "lat": 1.321934269708498,
        "lng": 103.8448841197085
      }
    }
  },
  "name": "TTSH-Integrated Care Hub (ICH)",
  "place_id": "ChIJTcwxfN4Z2jER579tEZAqCXc",
  "rating": 3.6,
  "reviews": [
    {
      "author_name": "Kylie Chang",
      "author_url": "https://www.google.com/maps/contrib/111531883702512631799/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJH7bGFdCVNQB-0qtTizl4i1MNLqi7y7Ozw-ZiKisYuTIHQPw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Mum warded at Wards 15G.\nStill recovery in progress.Place are quite new n spacious!Staffs and Doctors are quite friendly in Wards 15G. Check in and out thru the gantry is less hassles.Place are less busy than in TTSH.\nMum love the Nurse /Caretaker Rani attendance on assisting on her needs .\nEverydays she is looking forwards on her arrival n praising her setvice !TNo wonder she don't want to go home soon Though I never get to see u .Thank you for your love and care Staff Nurse or caretaker Mdn Rani.\nLastly,I can't find sandwiches ,coffee vending machine and foodcourt!\nThe journey  n the uphill is so long walking towards here!",
      "time": 1745400028,
      "translated": false
    },
    {
      "author_name": "JANET LIM",
      "author_url": "https://www.google.com/maps/contrib/112347716612686090737/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKVY6zitZ4Ysr6JhDrkgTLBsWKb6ou2TxoKNOZ5Z-bqJmQ80g=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "The Class A ward is under-staff. It is about only 2-3 nurses attending to 14 beds\nThus, the service level is affected. For people paying higher price (class A), we will expect prompt service.\nOn 25 Apr 25 (fri), ward 17G, no OT or PT session was arranged and i was given the explanation that they are lack resource so they can only see patient only 2 times each week. Hence, this would mean there will be 1 day that the patient has no therapy at all and it was a waste of rehab time! Please look into this feedback and provide an explanation. This is  totally unacceptable as the patient is here to do rehab for recovery and yet she is now sleeping whole day due to the lack of resource.",
      "time": 1745563378,
      "translated": false
    },
    {
      "author_name": "Lee Ml",
      "author_url": "https://www.google.com/maps/contrib/115771800503604258399/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIIwLoKwwDQQCDo2T8wTGf2gYHLKE_6sYhsc3qvVdNyaFdpyQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Doctors/staff/social worker and nurses are great people.\nTo begin, nephew had severe stroke on 23 Jan 2025 (right side of his body). He admitted to TTSH and subsequently to ICH (level 7G) for rehab. We are given extension for nephew stay until 18 Apr 2025 (they heard us while sharing our worries). Doctors and all staff helped with the process of nephew recovery. To us, we are thankful since he can now move around without having long term helper.\nWe are grateful to TTSH and TTSH ICH (Integrated Care Hub).\nThank you very much 😊🙏👍🏻",
      "time": 1744951535,
      "translated": false
    },
    {
      "author_name": "Donovan Tan",
      "author_url": "https://www.google.com/maps/contrib/105524133033629488922/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJC5PPZhGLs-HQJXTVOMAT99zv4bzFLbmdVhZtKDHY3I5sjnA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "⭐⭐⭐⭐⭐\n\nI would like to express my deepest gratitude to Mr. Teo Zhe Hao and Ms. Charmaine Leow of Level 15 Rehabilitation Group for their outstanding care and dedication. Their professionalism and compassion in guiding my dad through his rehabilitation journey were truly exemplary. They took the time to understand his needs, tailored the therapy to suit his condition, and consistently encouraged him with positivity. Their ability to combine expert knowledge with a warm, patient-centered approach made a significant difference in his recovery. I am incredibly thankful for their commitment and personal attention, which went above and beyond expectations. Their teamwork, patience, and attention to detail reflect the highest standards of care, and my dad feel fortunate to have been under their guidance. Kudos to this exceptional duo for making his rehabilitation a truly uplifting experience!\n\n⭐⭐⭐⭐⭐\n\nA heartfelt thank you to Staff Nurse Miss Nang of Ward 15H for her exceptional professionalism and compassionate care. From the moment my dad was admitted, she displayed remarkable attentiveness, ensuring all his needs were met promptly. Her ability to communicate with clarity and kindness made a huge difference, putting him at ease during his stay. She consistently went above and beyond, providing not just medical care but also emotional support. Her dedication and tireless efforts are a true asset to the team, and I deeply appreciate all that she has done!",
      "time": 1728889054,
      "translated": false
    },
    {
      "author_name": "Mohamad Syahid Bin Arif",
      "author_url": "https://www.google.com/maps/contrib/105925420457451952759/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ1c1xebKxiC2kBbml9cQ9JEfGMsXitu-LOu_XBQOFWPOAryQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "9 months ago",
      "text": "Spacious. Not crowded. Peaceful. A new facility just officiallly opened in Mar 2024. For rehabilitation. Also housed Dover Park Hospice.\n\nIf need food options etc, have to go to TTSH or Novena Square.",
      "time": 1723960132,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8577433763559882727",
  "user_ratings_total": 21,
  "vicinity": "1 Tan Tock Seng Link"
}