{
  "formatted_address": "3 Tuas West Rd, Singapore 638391",
  "geometry": {
    "location": {
      "lat": 1.3378956,
      "lng": 103.6435695
    },
    "viewport": {
      "northeast": {
        "lat": 1.3385764,
        "lng": 103.6452683802915
      },
      "southwest": {
        "lat": 1.3358532,
        "lng": 103.6425704197085
      }
    }
  },
  "name": "Tuas Depot",
  "place_id": "ChIJwyKe2VEP2jERiH66YIpVl0M",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Time XD Fun (Gee Chok Hiang)",
      "author_url": "https://www.google.com/maps/contrib/114617181471642189425/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUO3fohqx2mVGF4VVNKo7idHK72yOGZQavw5mIqtduUrxIbdcw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Tuas Depot, or Tuas West Depot (TWD) is a train stabling and maintenance area for Singapore's East-West Line trains, serving 7 different generations of rolling stock:\nKawasaki Heavy Industries C151 which was made in Kobe, Japan bodied and joint ventured by four different Japanese consortium – Kawasaki Ltd, Nippon Sharyo Co. Ltd, Tokyu Car Corporation and Kinki Sharyo Ltd. These trains entered revenue service on 7 November 1987, with a white base and a red band running the length of the train and a black front, the bodywork of the train was made from Welded aluminium. It will be part of Singapore's Mass Rapid Transit history once the fleet of 66 Kawasaki C151 trains fully retires by 2026.\nThe second generation Siemens Aktiengesellschaft C651 was made in Vienna, Austria and progressively shipped to Singapore with a total of 19 trainsets (114 vehicles). It entered revenue service on 2 May 1995, one year ahead of the Woodlands Extension opening in 1996. Similar to the Unrefurbished C151, it has a white base with a central red band running the length of the train. It has a melodious motor sound and has a AC regenerator, reducing power consumption and net energy consumption. Its braking is highly regenerative and pneumatic which many people love the train motor sound. It will be part of Singapore's Mass Rapid Transit history once this rolling stock fully retires by 2024 or early-2025 and it will definitely give the 1980s-1990s train nostalgia!\nThe Kawasaki Heavy Industries & Nippon Sharyo C751B is the third generation rolling stock and it was the first train to receive a brand new livery – a black base, red band and grey at the bottom running the length of the train, it was also the first train to be \"sloped\" to create a streamlined look. 21 trainsets were purchased under Contract 751B at S$231 million, and it is the first rolling stock to feature VVVF insulated-gate bipolar transistor traction control system, greenish-floor, wider seats and 4-blinking buttons at the side of the train doors each in every carriage of the train. Kawasaki manufactured 66 cars and Nippon Sharyo manufactured 60 cars respectively with no comparable differences, having built to agreed specifications, LTA awarded the contract to Kawasaki Heavy Industries & Nippon Sharyo in Kobe, Hyogo (Kawasaki) and Toyokawa Aichi (Nippon Sharyo), Japan. It was designed in GK Industrial in Singapore.\nThe Kawasaki Heavy Industries & CRRC Qingdao Sifang C151A is an electric multiple unit (EMU) train operating on the North South Line (NSL) and East West Line (EWL). Entering service in 2011, these were the fourth generation of rolling stock, purchased to increase the capacity of both lines by 15%.\nThirty-five trainsets comprising six cars each were procured in two batches, manufactured in Qingdao, China from 2010 to 2014 by a consortium of Kawasaki Heavy Industries and CRRC Sifang. 22 trains were delivered in 2011–2012, and 13 trains were delivered in 2013–2014.\nBackground\nContract 151A (C151A) for the supply of 22 trainsets for the North South and East West Lines was initiated to complement the Jurong East Modification Project, which added an extra platform at Jurong East MRT Station for the faster turnaround of North South Line trains, thereby increasing the capacity of the line.\n\nAwarded to a consortium of Kawasaki Heavy Industries and CSR Qingdao Sifang (now CRRC Qingdao Sifang) at an approximate value of S$368 million, these trains were built in Qingdao, China. The C151A contract was the first successful joint venture between these two companies. Despite tender competitor Hyundai Rotem Company’s offer of S$323 million, LTA chose to award the bid to Kawasaki Heavy Industries-CRRC Sifang after a comprehensive evaluation in hopes of better product quality.\nIn 2012, 13 additional trains were purchased by LTA under Contract 151A (Variation Order), bringing the total number of trains to 35. These additional trains were built to the exact same specifications and entered service in 2013–2014.\nMore on this section in Part 2, Stay tuned! >>>>>",
      "time": 1702453570,
      "translated": false
    },
    {
      "author_name": "Muhd Macho",
      "author_url": "https://www.google.com/maps/contrib/102182244993360527915/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJVybSwnMKiYzUgLIOuiiVxgq2HNfSPwl6OwRJ2LXSbefSD-Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "Have one person always like to take MC..",
      "time": 1731510053,
      "translated": false
    },
    {
      "author_name": "joseph raj",
      "author_url": "https://www.google.com/maps/contrib/104462247010588492807/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIrM4hofLn61p2DM7YgF9hLuXXuzE92fXso-I8MuKqN48JKjw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 2,
      "relative_time_description": "2 years ago",
      "text": "10 mins walk from Tuas west road MRT. No food shop. Only vending machines. Coffee at $0.50 per cup.",
      "time": 1675156877,
      "translated": false
    },
    {
      "author_name": "Endro Sunarso",
      "author_url": "https://www.google.com/maps/contrib/105770468552647584395/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWwAT-P8-1ye-hOyA5tBhs_yZirDS95q4E_PLfNzv66u8Pbl5q0BQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "3 years ago",
      "text": "A modern MRT depot. The best I have seen in Singapore. Everything is shiny and new. What's not to like?",
      "time": 1650964428,
      "translated": false
    },
    {
      "author_name": "Max",
      "author_url": "https://www.google.com/maps/contrib/109765620014235036576/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWXOax6ltWs6TCDAGx7Om_NYcWHl-7eJ77anw3CLMVINaZEVpA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "As a train enrhusiast, this is the worst place ever as some trains are kidnapped here and get sent for scrap",
      "time": 1713532727,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4870455574841163400",
  "user_ratings_total": 69,
  "vicinity": "3 Tuas West Road, Singapore"
}