{
  "formatted_address": "143 Teck Whye Ln, #01-231, Singapore 680143",
  "geometry": {
    "location": {
      "lat": 1.3803544,
      "lng": 103.7534201
    },
    "viewport": {
      "northeast": {
        "lat": 1.381669730291502,
        "lng": 103.7548671802915
      },
      "southwest": {
        "lat": 1.378971769708498,
        "lng": 103.7521692197085
      }
    }
  },
  "name": "TutorJohn Learning Centre - Choa Chu Kang Tuition Centre",
  "place_id": "ChIJvTsDgNcR2jERjQy8Q7z6uoo",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Muhammad Naufal Muhammad Farhan",
      "author_url": "https://www.google.com/maps/contrib/106627501513206850251/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV682Juv8YezWRIPhorSlD5kHhS8shLHobU-S2B0PxqKF9kvDQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I've been attending tuition here for a year, and it's made a significant difference in my understanding and confidence in the subjects. The tutors are incredibly hardworking, always going above and beyond to ensure we succeed. They put in a lot of time and effort to break down complex concepts and make them easier to understand. They’re always available to answer questions and provide extra help when needed. Their dedication has helped me achieve my academic goals, and I'm very grateful for their support. I highly recommend this tuition center to anyone looking to improve their grades with supportive, knowledgeable tutors.",
      "time": 1731418807,
      "translated": false
    },
    {
      "author_name": "Nal Nal",
      "author_url": "https://www.google.com/maps/contrib/105016033900209074738/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI1mIzZda74PwT0Xc7s4Ph6IOZ9zOuL3oM1OzASZN-Pm5no=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "The first year was good with my son showing improvement. After the tutors changed, I regret putting my compete trust in them. There was no improvement and no feedback even though he was receiving one to one maths tuition and group tuition for science. I really should have changed his tuition guidance to somewhere else earlier. This place was a bad choice.",
      "time": 1733889236,
      "translated": false
    },
    {
      "author_name": "Mob Master",
      "author_url": "https://www.google.com/maps/contrib/100983129042254189348/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXxt6n_279PEeI1P1spURJJ2DQ8XfGEEag51nbfVd40xkOEDG0=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "The tuition center is very good as the tutors are very patient and teach us at our own pace. The tutors explain to us how to do the questions very clearly. They also go above and beyond to ensure we succeed. I highly recommend this tuition center to anyone who wants to improve their grades.",
      "time": 1731418942,
      "translated": false
    },
    {
      "author_name": "Cheryl Wu",
      "author_url": "https://www.google.com/maps/contrib/110844977872280020051/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJOW91U2A1C9ICm9VdP2hJvJg3qngehy___4B-y11VOZsd8_w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "My son joined Tutor John for merely 1.5years, but his results had improved tremendously and his confidence level had significantly boom.\n\nWas really glad that Tutor John offered intensive lessons before every actual paper for my son N Level, even for those subjects my son did not took up with them.\n\nWanna say a big Thank You to all the teachers! Thank you!",
      "time": 1729856228,
      "translated": false
    },
    {
      "author_name": "Sindy Sia",
      "author_url": "https://www.google.com/maps/contrib/112187236377207761118/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIHVteV03THwemtJ-hyHWfkRv15IoHcsWnlYrgE-8h9D1ZvMQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "My daughter was posted to normal technical after her PSLE last year. I went around different tuition centres looking for tutors who could help my daughter with improving her academics.  But the search was so disappointing as all tuition centres don't give tuition to G1 (normal technical) / G2 ( normal academic ) subjects.\nI was really desperate until my friend recommended Tutor John tuition centre.\nMy daughter joined their group tuition,  she enjoyed the classes a lot as the centre has good teaching materials, the tutors are lively and keep the students engaged.\nWhen my daughter couldn't have group tuition due to CCA commitment,  Tutor John personally interviewed tutors to give my daughter one-to-one tuition. He was meticulous in the choice of Tutor in terms of qualifications and personality.  My daughter has since gone on to achieve G2 for English,  and G3 for both Math and Science. She also received an Edusave scholarship for being in the top 10% .\nWe would like to express our gratitude and appreciation to Tutor John tuition centre for helping my daughter when other tuition centres turned us away.\nThank you for not being biased against my daughter's poor results.  This shows that with good teaching ethics and attitudes,  all students could shine!",
      "time": 1733975468,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9996578009399430285",
  "user_ratings_total": 164,
  "vicinity": "143 Teck Whye Lane, #01-231"
}