{
  "formatted_address": "Blk 653A Punggol Dr., #01-01, Singapore 821653",
  "geometry": {
    "location": {
      "lat": 1.3980195,
      "lng": 103.9193741
    },
    "viewport": {
      "northeast": {
        "lat": 1.399221530291502,
        "lng": 103.9206166802915
      },
      "southwest": {
        "lat": 1.396523569708498,
        "lng": 103.9179187197085
      }
    }
  },
  "name": "Ubi Thai Sister Chilli Mee Pok",
  "place_id": "ChIJdaX_Gpk92jER6kMBB-9mLZw",
  "rating": 2.6,
  "reviews": [
    {
      "author_name": "oXRYSTALo Ong",
      "author_url": "https://www.google.com/maps/contrib/114556064085815871377/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSTtKcF9FYMbh-XNbDu8f7Whl3gi-ZY6T8pFPOm3v9Y98Ws7jL=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "UBI THAI SISTER CHILLI MEE POK: A Tasty Thai Twist on Mee Pok (4/5 Stars)\n\nRating:\n\n• Atmosphere: 4/5 (Clean and modern coffee shop setting, comfortable and inviting)\n\n• Food Quality: 4/5 (Delicious and flavorful mee pok with unique Thai flavors and a wide variety of options)\n\n• Service: 4.5/5 (Friendly and helpful service from the young boy running the stall)\n\n• Value: 4/5 (Affordable prices for a satisfying and flavorful meal)\n\nOverall: 4/5\n\nDonkey and I were cycling back home around 10 p.m. when we stumbled upon UBI THAI SISTER CHILLI MEE POK.  We were both famished because we'd forgotten to have dinner, so we decided to give it a try.  The stall is located in a clean and modern coffee shop, so we were already off to a good start.  The menu boards were clear and inviting, with photos of the different dishes, and Donkey ended up ordering the Pig's Liver Sliced Meat Set, and I went for the Minced Meat Mee Pok.\n\nThe young boy running the stall was very friendly and helpful. He even added extra pork lard to my mee pok upon my request, which made it even more flavorful.\n\nDonkey's Pig's Liver Sliced Meat Set was absolutely delicious. The pig's liver was cooked perfectly, tender, flavorful, and without any of that powdery texture or strong smell.  The sliced meat was also super tender and well-seasoned.  We couldn't have asked for a better meal.\n\nMy Minced Meat Mee Pok was a surprise. The broth was a dark black color, turns out they use a unique black sauce in a Thai style.   It was super flavorful with a little hint of sweetness and it made the whole bowl of mee pok really special.  The minced meat was also really tasty.\n\nI loved it, but said maybe they could use a little less black sauce.  I found it a bit overpowering for me.  I also mentioned that the soup was a little bland, maybe because the other flavors were so strong.\n\nOverall, we had a great experience at UBI THAI SISTER CHILLI MEE POK.  The food was delicious, and the atmosphere was pleasant.  We'd definitely recommend it to anyone looking for a tasty and unique mee pok experience, with a Thai twist.\n\nWe are giving UBI THAI SISTER CHILLI MEE POK a 4-star rating.  The food is fantastic, with a great Thai twist.  The young boy running the stall is friendly, too. However, the slight issue with the black sauce and the soup keeps it from getting a perfect score.  We'd definitely return.",
      "time": 1739196513,
      "translated": false
    },
    {
      "author_name": "Doraemon",
      "author_url": "https://www.google.com/maps/contrib/112665277904119154671/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX2VSCcaT9axvOwx2nD8XD3PgZ8V5VFnv420aocMSfLa6GlcEmN=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Kitty and I were cycling back home around 10 p.m. when we stumbled upon UBI THAI SISTER CHILLI MEE POK.  We were both famished because we'd forgotten to have dinner, so we decided to give it a try.  The stall is located in a clean and modern coffee shop, so we were already off to a good start.  The menu boards were clear and inviting, with photos of the different dishes, and I ended up ordering the Pig's Liver Sliced Meat Set, and Kitty went for the Minced Meat Mee Pok.\n\nThe young boy running the stall was very friendly and helpful. He even added extra pork lard to our mee pok upon her request, which made it even more flavorful.\n\nMy Pig's Liver Sliced Meat Set was absolutely delicious. The pig's liver was cooked perfectly, tender, flavorful, and without any of that powdery texture or strong smell.  The sliced meat was also super tender and well-seasoned.  We couldn't have asked for a better meal.\n\nKitty's Minced Meat Mee Pok was a surprise. The broth was a dark black color, turns out they use a unique black sauce in a Thai style.   It was super flavorful qith a little hint of sweetness and it made the whole bowl of mee pok really special.  The minced meat was also really tasty.\n\nKitty loved it, but said maybe they could use a little less black sauce.  She found it a bit overpowering for her.  She also mentioned that the soup was a little bland, maybe because the other flavors were so strong.\n\nOverall, we had a great experience at UBI THAI SISTER CHILLI MEE POK.  The food was delicious, and the atmosphere was pleasant.  We'd definitely recommend it to anyone looking for a tasty and unique mee pok experience, with a Thai twist.\n\nWe are giving UBI THAI SISTER CHILLI MEE POK a 4-star rating.  The food is fantastic, with a great Thai twist.  The young boy running the stall is friendly, too. However, the slight issue with the black sauce and the soup keeps it from getting a perfect score.  We'd definitely return.",
      "time": 1739114783,
      "translated": false
    },
    {
      "author_name": "Ong Zhiwei",
      "author_url": "https://www.google.com/maps/contrib/101918321089720155197/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ_j1esGULVOVHY-iZSNwhNgoYNKK4l0PyS9kxtVnyOTOCfTsE=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "a month ago",
      "text": "$9 for a coffeeshop BCM is very pricey especially when the portion is pathetic. The egg and ingredients were way overcooked. Don't recommend at all.",
      "time": 1743562144,
      "translated": false
    },
    {
      "author_name": "Eun Lim",
      "author_url": "https://www.google.com/maps/contrib/109491599485664560712/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUQ-vzN2ty--ld0gqzTUShkmMbx-kKkOSrlOo0VOndXpCdK2hs=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "4 weeks ago",
      "text": "The taste of the noodles here depends on the person cooking. Frequent this place quite often and realise they always messed up the order even if you are the only one in queue ordering. My order was always wrong especially when it was taken by an older looking uncle, looks like he doesn’t know his own shop menu well. The taste of the noodle cooked by him is always overcooked, soggy and somehow extremely wet. For the high price point here inside a coffee shop I don’t think this should be overlooked. However, bonus point to a young boy with bangs and spectacles, fantastic cooking skills with perfectly textured noodles and it isn’t even oily even when u ask to add more chilli. Normally, only seen him working at night, you will actually be mind blown by his noodles. Do give it a try if you see him :))",
      "time": 1745236583,
      "translated": false
    },
    {
      "author_name": "Kasandra H",
      "author_url": "https://www.google.com/maps/contrib/107710878738863699408/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWM5nup0r4DnVH9oUAZqmX-Fw-RptbWsHql3m0z0xmmfyQdzpU=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Food and meat is raw and under cooked. Like d other customer said below, immediate stomachache. Can tell the chef is not a good cook though he has a cook's belly. Went back to the chef to show him the under cooked meat. He says it is supposed to be that way. Avoid at all costs. They opened a new stall but there were no customers. I tried it. Super expensive. Huge regret. Have to go home to cook again.",
      "time": 1741598156,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11253764220669477866",
  "user_ratings_total": 9,
  "vicinity": "Blk 653A Punggol Drive, #01-01"
}