{
  "formatted_address": "21 Club St, #01-01, Singapore 069410",
  "geometry": {
    "location": {
      "lat": 1.2824769,
      "lng": 103.8466987
    },
    "viewport": {
      "northeast": {
        "lat": 1.283878480291502,
        "lng": 103.8480273302915
      },
      "southwest": {
        "lat": 1.281180519708498,
        "lng": 103.8453293697085
      }
    }
  },
  "name": "UFIT Podiatry Clinic",
  "place_id": "ChIJJUggKs0Z2jERcz0OUY2sdGU",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Ong Lee Lian",
      "author_url": "https://www.google.com/maps/contrib/103777575765503290058/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXapwJpbqjAht7i3tnv84-W_slH20nLX6lujBpARtNfAOxI1Oqlfw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Exceptional Podiatry Care at UFIT – Thank You, Lewis and Team!\n\nI was brought to UFIT by my lovely daughter Valerie—also my personal PT—and I couldn’t be more grateful for her recommendation.\n\nI had a fantastic experience with Podiatrist Lewis at UFIT Club Street. I came in for a painful ankle, a bunion, and recurring ingrown toenails, and everything exceeded my expectations.\n\nLewis was relaxed, funny, and incredibly knowledgeable. He made me feel at ease while staying professional and thorough. He explained every step of the treatment, making the whole process smooth and surprisingly enjoyable. My ankle pain has eased, my bunion feels more manageable, and the ingrown toenail treatment was quick and minimally uncomfortable.\n\nThe warm atmosphere at UFIT made it even better. Gym Manager Chris kindly gave me a tour, and I was impressed by how clean, well-managed, and welcoming the facility was. The staff were all friendly and clearly knowledgeable in both fitness and rehab.\n\nIf you’re looking for excellent podiatry care in a supportive environment, I highly recommend Lewis at UFIT Club Street❤️👍",
      "time": 1746785002,
      "translated": false
    },
    {
      "author_name": "Clarisse Ong",
      "author_url": "https://www.google.com/maps/contrib/100282260641326516078/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ2reYBjViyG9E3PWVoSc60bVGLUwbIqy6aN8qPu1DOti01Bw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 months ago",
      "text": "I recently had an appointment with podiatrist Lewis Nurney at UFIT, and it was a wonderful experience. I’ve been dealing with a long-standing issue, but with Lewis’s expertise, kindness, and patience in listening to my concerns, I’ve finally been able to solve the problem and feel so much better.\n\nThe clinic is modern with high-tech equipment, and Lewis explained everything clearly, making me feel confident in the treatment plan. Now I’m feeling ready and prepared for the 10K Standard Chartered Marathon! If you’re looking for expert podiatry care, I highly recommend Lewis and the team at UFIT!",
      "time": 1731669032,
      "translated": false
    },
    {
      "author_name": "Simon Hirrle",
      "author_url": "https://www.google.com/maps/contrib/101228006661103974230/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIQggxF39EJLcZqsIZPzwGcTtu59PZpIc3v4NCTcEcwR0shbg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "I did the running analysis with Lewis - very comprehensive and insightful. He used his expertise and latest equipment to closely examine my foot strike pattern, form, cadence, and other variables to pinpoint areas I can improve, types of shoes I should and shouldn't wear, and more. They can even print insoles within an hour if you need, and offer a suite of other services under one roof - physio, PT, classes, etc.\n\nIt's clear that Lewis really knows his stuff and can help runners identify root causes of injuries they may have, as well as help healthy runners stay healthy.\nI found it to be reasonably priced.\n\nThanks again, Lewis!",
      "time": 1745646682,
      "translated": false
    },
    {
      "author_name": "Erin Yap",
      "author_url": "https://www.google.com/maps/contrib/107019375302484175991/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKPBOtF_j2vSt5M4swHNuKsvPgYazZyQwhe7MYWVkRYzO-s9INW=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I saw Lewis at UFIT for knee pain from running and had a great experience. He started with a thorough assessment, including a treadmill gait analysis with cool equipment, which gave valuable insights into my mechanics.\n\nLewis explained his findings clearly and recommended targeted exercises to fix the root cause, not just the symptoms. His professional yet approachable style made it easy to ask questions.\n\nHighly recommend him for running injuries—informative, practical, and solutions-focused!",
      "time": 1740562880,
      "translated": false
    },
    {
      "author_name": "Avery Liew",
      "author_url": "https://www.google.com/maps/contrib/103910684685740922869/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV2hzjxbNVUhmmnDeZqj78UKGua3SX5kNi7SDOrcD41sf7WrW3z=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I recently booked an appointment with Mr. Lewis, Head of Podiatry at UFIT, for an advanced running assessment to better understand my foot structure, my risk of running injuries, and most importantly, how to improve my running technique.\n\nHere’s what I learned:\n\n- I had chosen the wrong shoes for my running style.\n- I have a bunion on my second toe, especially on my right foot.\n-I need to work on improving my cadence to at least 175-180 steps per minute.\n- Strengthening my calves is essential for better performance and injury prevention.\n\nIf you're curious about what this assessment is all about or want to improve your running technique and prevent injuries, I highly recommend reaching out to Mr. Lewis. I'm sure he'll provide great advice tailored to your needs.",
      "time": 1740322252,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "point_of_interest",
    "health",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7310657818079411571",
  "user_ratings_total": 91,
  "vicinity": "21 Club Street, #01-01"
}