{
  "formatted_address": "267 Compassvale Link, #01-01, Singapore 540267",
  "geometry": {
    "location": {
      "lat": 1.3836956,
      "lng": 103.8969761
    },
    "viewport": {
      "northeast": {
        "lat": 1.385113280291502,
        "lng": 103.8984566302915
      },
      "southwest": {
        "lat": 1.382415319708498,
        "lng": 103.8957586697085
      }
    }
  },
  "name": "Umart Compassvale Link",
  "place_id": "ChIJW37oqGwW2jERuB2UHk_dcJo",
  "rating": 3.1,
  "reviews": [
    {
      "author_name": "Hee ME",
      "author_url": "https://www.google.com/maps/contrib/113676166713343503658/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV7SaLWmGKX3-uiQ1ThDS0cjmJ5nlKGCzZlC9CMYAyRxQ66dC3zwQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "6 months ago",
      "text": "WORST UMART at Block 267 MSCP Compassvale Link. Today at 28 Oct 24 around 1930H, I bought a 3 cans of 490ml of Heineken beer and a can of 490ml of Anchor Strong beer. When I reached home I realised I have taken a can of 320ml of Heineken beer out of the 3 cans. I brought them back within 10 mins to change it but the 2 sales ladies refused to let me change to the one I wanted to buy. They insisted I have bought it and can’t change anymore! What kind of service is this? I have patronised this shop for 19 years since 2005 and this was what I got back for being a loyal customer. This is NOT the first time I’m being treated this way!\nI’m going to bring this to CASE ASAP. It’s so unreasonable that I can’t change my item.\nAnd I and My Family will NOT buy anything from them anymore!\nNO MORE!\nBuy at your own risk!",
      "time": 1730121374,
      "translated": false
    },
    {
      "author_name": "Penelope W",
      "author_url": "https://www.google.com/maps/contrib/100159441886628472492/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKUaLdLba0uPW7VY74wdZ2uFDZq6eolBN-sE2oqxubFcqgvEQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Convenient location but I’d rather walk to Giant or NTUC than to come back ever again. Don’t like handling return parcels? Then don’t apply to be a drop-off point!!\n\nWent to their store to drop off a parcel + purchase something. A fat lady was behind the counter, presumably the lady boss since she’s never in uniform like the other staff. Was using her phone when I went up to the counter.\n\nShe took one look at my return parcel and spat out “you need to do it yourself” while curling her lips and tossed me her phone. I took her phone and asked her how to do it.\n\nShe sighed and looked incredibly impatient like she was talking to the world’s largest imbecile. Called for her staff and told me to go to her staff who walked me through the process.\n\nDropped off my parcel and walked straight out to Giant.\n\nLady. There was no need to give your customers this condescending attitude. I suspect she doesn’t know how to do it because the last time I went, it was also her at the counter and she also got mad that I had the audacity to return a parcel.\n\nIt’s fine if you want customers to do it on their own. Just say so and go through it with the procedure. But there’s literally no need to be so insufferable. The store was literally empty! And don’t you get paid for each return parcel? If you’re not, you should stop doing it, totally not fair to exploit your location for free.\n\nDefinitely going to the Rivervale Plaza drop-off point in the future. That lady boss is always pleasant. And frankly, this woman is unpleasant.\n\nIt’s not the first time receiving attitude from this prize of a woman. Thank you for the reminder.\n\nSeriously… I was just trying to drop off a parcel at a drop-off point and spend money.",
      "time": 1712414575,
      "translated": false
    },
    {
      "author_name": "Marcus Nah",
      "author_url": "https://www.google.com/maps/contrib/108851483842225070997/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLFvD9YcYM85cDH3YDu7zwZI2p7Q8Sp0c6QtLG5xOEAEO7lhRV3=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "a year ago",
      "text": "Convenience shop but everything outside kept and door around closed 9.40pm even it's said 10pm closed. Don't waste time going over if can't reach there by 9.35pm.. u can forget about going to buy something even someone is inside..",
      "time": 1706796726,
      "translated": false
    },
    {
      "author_name": "Aminah Aminah",
      "author_url": "https://www.google.com/maps/contrib/100354175289404760144/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJinrjYdXD_SNFZSei13H3hHX9Pr4LgOnarvv93uUoQT5pKGw=s128-c0x00000000-cc-rp-mo",
      "rating": 2,
      "relative_time_description": "a year ago",
      "text": "I’m not sure why!! When come down at 9.30pm the shop will closed!!! But state at google 7am to 10 pm ! In charge please update the timing in the system! Last time use to close 10 pm! But recently change the worker the timing also change… its not happen one time!! Please update the timing! Thank you",
      "time": 1691235244,
      "translated": false
    },
    {
      "author_name": "Johara Erfana",
      "author_url": "https://www.google.com/maps/contrib/107508304361524408840/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLgEd8ug1WCcdFfWL4mhe7h844it_oSeKUizzq81-2G0a2TLQ=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Worst service by the male cashier. Too much attitude",
      "time": 1740046124,
      "translated": false
    }
  ],
  "types": [
    "convenience_store",
    "grocery_or_supermarket",
    "store",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11128638011117673912",
  "user_ratings_total": 19,
  "vicinity": "267 Compassvale Link, #01-01"
}