{
  "formatted_address": "85 Bedok North Rd, #01-15, Singapore 460085",
  "geometry": {
    "location": {
      "lat": 1.3321419,
      "lng": 103.9384941
    },
    "viewport": {
      "northeast": {
        "lat": 1.333624480291502,
        "lng": 103.9399203802915
      },
      "southwest": {
        "lat": 1.330926519708498,
        "lng": 103.9372224197085
      }
    }
  },
  "name": "Uncle Lai Putien Signatures 莆田主食",
  "place_id": "ChIJFXz9Im492jERCWRdp6188RE",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "Weijie Aw",
      "author_url": "https://www.google.com/maps/contrib/111453483853385931354/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWv4C6D4bDRUuIrntUENAtzoKt0Ml-Jh5qOnsYSehduosrD9PRCvA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "a year ago",
      "text": "Nice store selling Heng hua cuisine. As someone with a Heng hua background, I find the lor mee gravy not flavourful enough and it lacks the seafood taste. However at $6.50, the portion of noodles given was very substantial! I advise adding some vinegar provided to enhance the taste! Overall an average Heng hua lor mee when compared to the other putien lor mee I ate before. (Btw it's weird there's no peanuts on an authentic Heng hua lor mee 😅)",
      "time": 1713674226,
      "translated": false
    },
    {
      "author_name": "Joy J",
      "author_url": "https://www.google.com/maps/contrib/116985601148046726280/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJfCWw36Mc1F4vD3KNW3I_3bLP7-gA4kQPPYrwqJdlP2JZRAQ=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "a year ago",
      "text": "Taste is not bad.\nThey recently changed the menu so only a few items remain. they removed peanuts from the dishes which I think is essential and should definitely be included.\nWith peanuts it will be 4 stars for me",
      "time": 1711288668,
      "translated": false
    },
    {
      "author_name": "Sean Goh",
      "author_url": "https://www.google.com/maps/contrib/113608706305591448585/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKEaTeEStI-pfTIXqsvSF6l02FivQ-XBDO9hy5SPhzxdS9tTA=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "4 years ago",
      "text": "One of the new stall after the completion of upgrading of fengshan 85 hawker centre. They specialize in heng hua cuisine. They sell dishes like the henghua lor mee, fried beehoon and etc. Prices starts from SGD$5 onwards, fairly reasonable for the generous portion.\n\nMy personal favorite was the lor mee. The bowl of noodle comes with prawns, clams and thin slice of pork. The broth has a gravy like consistency and has good flavor. Garnished with roasted peanut, it gives the dish an extra dimension in terms of texture.",
      "time": 1600523935,
      "translated": false
    },
    {
      "author_name": "L Y",
      "author_url": "https://www.google.com/maps/contrib/116804450051508415316/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJZAO4Uv-q58chtZFhsvT4iy8MK7wYOdKcR0WvOYml4jFiCKw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "There's a ton of good food at Blk 85 Fengshan but Putien food is the last I usually have in mind.  Walked past this stall MANY times and decided to give this a try today (6.8.2023) as I did not want to usual hawker carbs-laden and  sodium-laden food.\n\nWAITING TIME\nWe came around 6pm on a Sunday. The wait was at least 20 minutes. The saving grace is the buzzer system.\n\nAMBIENCE/SERVICE\nThe usual noisy and humid hawker center. We found a nice round table away for the fanfare. The order-taker was rather rude/abrupt  but I don't have high expectations in a hawker center.\n\nPAYMENT\nCash only. No payNow, payLah or Grab.\n\nFood:\n1. Putien fried bee hoon (S$6): Plating needs improvement. All the ingredients (prawns, lala, veggie, peanuts, fried egg) were buried in that pile of bee hoon. The texture of the bee hoon is exactly like what the restaurant Putien uses. Taste wise, no places I have tried, can rival Putien's.  Rating: 6/10\n\n2. Spinach in trio sauce (S$10) : This is excellent. Restaurant standard and not salty. Pricey but very well-executed. Rating: 9/10\n\nREPEAT FACTOR\nYes, i will visit this stall again to try other dishes. Promising.",
      "time": 1691323841,
      "translated": false
    },
    {
      "author_name": "Lemmy Lamb",
      "author_url": "https://www.google.com/maps/contrib/106750842167260589965/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUZRZR83e_8iubkfg6vqdpIKTvGcJ_SzbwiAMhRm4egnPs3CNnw8Q=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Chanced upon this humble hawker stall in Bedok that claims to serve authentic Putien cuisines. I tried out a few dishes offered by this young entrepreneur owner.\nTo be honest, I was first kinda sceptical of his bee hoon. I am personally a die-hard fan of Putien bee hoon. Hence, I have high standard for the taste of this fried Putien bee hoon. The look of the bee hoon when it first served to me was identical to the one I have got from Putien Restaurant, or even better. Unlike the overly dry bee hoon served in the restaurant, this bee hoon is absolutely flavourful bursting with a harmonious blend of savoury and umami notes! The bee hoon absorbs the entire essence of the fresh seafood ingredients like prawns, clams, baby scallops & slices of pork, as well as a medley of vegetables. Each of these ingredients infuses the bee hoon with their individual flavours, creating a delicious, complex taste. The resulting broth, with a spectrum of seasoning, is well-distributed into each strand of bee hoon which heightens the delicious aromatic flavour. Rating: 5/5 (I will give a 10 if possible!)\n\nNext is the sweet and sour pork. Every piece of the pork is coated and fried skilfully, then tossed in a tangy, sweet, and slightly tart sauce. Amazingly, not one piece of the pork is overcooked! The evenly glazed syrupy and tangy sauce adds an interesting contrast to the delightful crispy exterior of the pork in every bite. Rating: 5/5\n\nThe taste of my third dish, Caramelised Yam, is a wonderful blend of sweet and nutty flavours with a crispy texture. The owner’s secret recipe of the seasoning further accentuates the sweet and savoury elements of this dish. The result is a delightful contrast between the crispy, glistening exterior and the soft, slightly sweet interior. Rating: 5/5 (5 is an understatement!)\n\nMy last dish is fried omelette egg. The flavour is predominantly eggy, with a mild and slightly buttery richness. The omelette is fried with a strong wok-hey, that gives rise to the golden brown exterior, providing a subtle crunch that contrasts with the soft, fluffy interior. However, I think the owner is overly generous with his ingredients, I almost could not finish the omelette! Rating: 4/5\n\nMy overall experience is definitely beyond satisfaction! I will return for the widely praised lor mee the next round!",
      "time": 1701000967,
      "translated": false
    }
  ],
  "types": [
    "meal_takeaway",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1292951653311144969",
  "user_ratings_total": 36,
  "vicinity": "85 Bedok North Road, #01-15"
}