{
  "formatted_address": "8 Sentosa Gateway, Singapore 098269",
  "geometry": {
    "location": {
      "lat": 1.2540421,
      "lng": 103.8238084
    },
    "viewport": {
      "northeast": {
        "lat": 1.2577978,
        "lng": 103.82842805
      },
      "southwest": {
        "lat": 1.252041,
        "lng": 103.81910385
      }
    }
  },
  "name": "Universal Studios Singapore",
  "place_id": "ChIJQ6MVplUZ2jERn1LmNH0DlDA",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Moza Alqaydi",
      "author_url": "https://www.google.com/maps/contrib/103114933622001557965/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUuOswfRHWAB_77wQr0NdaVx5mcKRRXhZDVSMWltpXT5wGfXm0=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "I had a fantastic time visiting this amusement park! The entrance ticket was reasonably priced, and the overall cost was very affordable for the fun we had.\n\nThe rides were absolutely amazing—exciting, safe, and suitable for all ages. There was a great variety, from thrilling roller coasters to fun attractions for kids. The park was clean, well-organized, and the staff were friendly and helpful.\n\nIt was a memorable experience, and I would definitely recommend it to anyone looking for a fun day out!",
      "time": 1746538446,
      "translated": false
    },
    {
      "author_name": "Asheesh Gupta",
      "author_url": "https://www.google.com/maps/contrib/103289634858636555331/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUg2W4Uc4njJoI8Mp2gTt9YM7tUykMpIVySo7wJ4tsiLmPQQ5D6=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Have fun.\nDownload their APP to view the waiting time at each ride in real time. It is really accurate.\nThe queues are considerably smaller by the last hour of the day. It could be a good idea to try the rides again in the end.\n\nI found most of the open shows were not worth it. Could be relevant for the kids.",
      "time": 1745648768,
      "translated": false
    },
    {
      "author_name": "Thusitha Kariyawasam",
      "author_url": "https://www.google.com/maps/contrib/111031053351929053721/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVzUe1U45M_A5PST5O5nstNh6bZMripnQ0SSZ_JtAvTWYqFbiVR=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "A magical experience at Universal Studios Singapore! We had an unforgettable day, especially with our 4-year-old son.\n\nFrom the moment we entered, we were immersed in the world of beloved movies and characters. The park is incredibly well maintained, and the staff were friendly and welcoming, making our experience smooth and enjoyable.\n\nThe rides were suitable for all ages, and my son had an absolute blast. He loved the Sesame Street characters, especially meeting Elmo and Big Bird, which was a dream come true for him. We also enjoyed the interactive play areas that were perfect for his age. The Jurassic Park area was another highlight, with exciting attractions that were thrilling for both adults and children. Although some of the larger rides might have been a bit too intense for younger kids, there were plenty of milder attractions like the Madagascar ride, which was a great fit for our little one.\n\nWhat really stood out was how family-friendly the park is. There are many child-friendly facilities, including spacious baby changing rooms and stroller rentals, which made it so convenient for us as parents. The food options were diverse, catering to all tastes and dietary preferences.\n\nThe highlight of the day was the parades and shows, which kept my son entertained with vibrant costumes, music, and performances. Even if you’re not a huge theme park fan, Universal Studios Singapore offers a full day of fun for the whole family.",
      "time": 1742721099,
      "translated": false
    },
    {
      "author_name": "Lesley Holmes",
      "author_url": "https://www.google.com/maps/contrib/100925501546850540517/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVEv4zIlkb2_Uv81xzDSFXzv9D0jtx0gCccsvSxt2PBEKxBBXk5uQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "A great day out.\nThe park itself isn't massive, so it is an easy day out.\nThe queues on the day I went were around 20 minutes max. I went on the big rides 4 times each.\nThe food was OK, service was pretty quick.\nI left around 4 and had done all I wanted.\nGreat place for kids",
      "time": 1746872542,
      "translated": false
    },
    {
      "author_name": "Ricky Zulfandi",
      "author_url": "https://www.google.com/maps/contrib/115902875143457673727/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWqfkTVVGw7LBljc_kiKUCmKAZdvz1h_mZV-pfTJEHE7rekBAIe-A=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Just got back from an amazing day at Universal Studios Singapore with the fam — and wow, what a blast! From the moment we walked in, the energy was just awesome. The park is super well-organized, clean, and full of fun vibes.\n\nWe started off with the Transformers ride — seriously one of the coolest 3D rides I’ve ever been on. The kids were screaming (in a good way), and even the adults were hyped. Then we hit up Jurassic Park, got soaked on the river raft ride, and didn’t even care because it was so much fun.\n\nOne of the highlights? The Minion Mart and all the Despicable Me stuff — my little cousin couldn't stop smiling. Oh, and don’t miss the Revenge of the Mummy ride if you like a little thrill. Totally worth the wait!\n\nThere are plenty of food options too — from quick snacks to proper meals. We grabbed lunch at one of the themed diners and even found some halal choices, which was a plus for our family.\n\nOverall, it was such a wholesome day — full of laughter, a bit of adrenaline, and tons of unforgettable memories. Whether you're with kids, teens, or just a bunch of fun-loving adults, Universal Studios Singapore is totally worth the trip!",
      "time": 1744136184,
      "translated": false
    }
  ],
  "types": [
    "tourist_attraction",
    "amusement_park",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=3500426646667023007",
  "user_ratings_total": 103240,
  "vicinity": "8 Sentosa Gateway"
}