{
  "formatted_address": "1207 Dover Rd, Singapore 139654",
  "geometry": {
    "location": {
      "lat": 1.3025305,
      "lng": 103.7771791
    },
    "viewport": {
      "northeast": {
        "lat": 1.304389230291502,
        "lng": 103.77995485
      },
      "southwest": {
        "lat": 1.301691269708498,
        "lng": 103.77625385
      }
    }
  },
  "name": "UWC South East Asia (Dover Campus)",
  "place_id": "ChIJwTBrr14a2jERD81KLlIjJMI",
  "rating": 4.1,
  "reviews": [
    {
      "author_name": "Felix Rieckmann",
      "author_url": "https://www.google.com/maps/contrib/100085174005758597699/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU7eTXH3akUkAwbZn84Rx87-xC0uAX4gEu7yzP73d71L1Gp2-z5Fg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Beautiful campus, so many green spaces. A few details here and there could be updated and a few rooms are a touch worn, but amid the warm atmosphere, the stacks of books and often great facilities that is a minor issue. It looks like the type of school one would want every kid, anywhere, to go to.",
      "time": 1710638925,
      "translated": false
    },
    {
      "author_name": "dia",
      "author_url": "https://www.google.com/maps/contrib/101462645541578742329/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL_GdQRaIwsxbshuZthWZUqi0j2ah8oOvchc9lqozFWbW4b3Q=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "8 months ago",
      "text": "Students are unruly and rowdy, entitled and inconsiderate. On the bus, students will keep on pushing and pushing until there is barely any space left to even walk.\nThey like to block the staircase on the double decker buses, and push people like its the end of the world.\nStudents often hang out at bouna vista mrt, and even have some buying bubble tea and spitting pearls at each other? Grossly irresponsible, pearls everywhere and even getting some on passersby. For the price you’d think they’re teaching their students useful life lessons like don’t be a public nuisance, but apparently not.",
      "time": 1726127982,
      "translated": false
    },
    {
      "author_name": "Misaki",
      "author_url": "https://www.google.com/maps/contrib/103704634577953112724/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIFJZ0o3WlHlnu_nPV-7YcKfTDlSo-YEeIKujp3EQ98hvBpqH8=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "I went this school to watch my friend's match, and I had a horrible experience with the kids there. Some were being very mean to each other, and one student bumped into me without saying sorry; instead, they just glared at me and talked about me with their friends. When I entered the bathroom, I saw smoke coming out of one of the stalls, and I think somebody was vaping with their friend there.\n\nThe school itself was big and pretty clean, but they really need to educate their students about manners. Additionally, they should definitely conduct bag checks or something similar once in a while.",
      "time": 1706087468,
      "translated": false
    },
    {
      "author_name": "Mixalis Hatzinas",
      "author_url": "https://www.google.com/maps/contrib/101516733542689254717/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKgMLE6eCsl7hqrmINSRByt6pEbdiqXBRELI2Kj3U_1D4NOnA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "a year ago",
      "text": "Just avoid.\nHype noses.\nThey asking 600$ + registration fee\nWithout even to provide school tour\nWith out even to be helpful to register\nStudent information.\n5 star kindergarten Hotel.\nIf you wish to throw your money this is the place.\nBetter and cheaper choices around",
      "time": 1713438380,
      "translated": false
    },
    {
      "author_name": "bananaketchup",
      "author_url": "https://www.google.com/maps/contrib/117080043033520886783/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW3l2d82YcbqCMA-pqQiXoT3uWpmkuXHZ4skjAzipZkerXSC6aX=s128-c0x00000000-cc-rp-mo",
      "rating": 3,
      "relative_time_description": "a year ago",
      "text": "After going to UWCSEA for 3 years (Grade 7 to Grade 9) I can confidently say this school is okay. I was initially going to be much more harsh towards it, but when I think about it more it's not too bad. However, there are a number of complaints I have about going to school here.\n\nThe good points first.\n- Extra curricular activities teachers seem very passionate and are skilled in teaching. This also includes Outdoor Ed teachers. This is likely because they aren't considered fully employed at the school, they don't receive a large paycheck and they seem a lot more committed to teaching the students well.\n- Facilities are beautiful and often spotless. Music and Art departments are especially good, and the Music department allows you to go in at any time and use your own practice room. (technically, you need to get a pass, but no one ever does)\n- Lots of available resources that would otherwise cost a lot of money, this is perhaps a plus of going to an international school.\n- The overall environment is laid back and gives the students a lot of freedom and independence as part of what the school values. It allows students who are dedicated to learning and becoming better to operate under their own terms and what they're comfortable with. It's good for people who genuinely care about their studies.\n- The teachers are accepting and tolerant of students with different identities, there are efforts to create a diverse community and parts of the school that will make disabled students, LGBTQ+ students and so on more comfortable than perhaps a public school would.\n\nNow here are the bad points.\n- The tuition cost for this school is expensive, and in my opinion, not justified, especially if you are sending your child into primary school and maybe even middle school. Not only is the school fee high but there are also additional costs for activities, school trips etc that all don't seem worth it. Although, assuming you apply for this school, you don't have to worry about money, but if you're not extremely rich, my advice would be to send your kid in during high school, maybe even just during G11 and G12, as they are planning to change the G9 and G10 curriculum in a couple of years to be more similar to the primary and middle school. The truth is that there is no revolutionary kind of learning during primary and middle school. Which brings me to my next point:\n- UWCSEA's teaching is very surface-level in my opinion. It feels as if they constantly underestimate their students and what the students know. We rarely have the really in-depth discussions at UWCSEA that I really want during class. The kind of stuff they teach, in UWCSEA-created courses especially, seems very unmeaningful.\nOf course, there are avenues you can find where you can engage in meaningful discussion and thinking, but you have to look for them, they aren't just part of the school's curriculum. Those also depend greatly on the students or extra curricular staff who you are engaging with.\n- The student body in UWCSEA is cliquey, rude, reckless and don't care about UWCSEA values or its cause. There are vaping problems, I would argue there are bullying problems too. This is where I feel the freedom and independence of UWCSEA has some drawbacks. These students often take UWCSEA's laid-back environment as a way to have fun and not care, not to learn and grow. You might know about the motorcycle accident that resulted in a student being killed on an unsupervised G11 trip. From my perspective, this happened because the students in UWCSEA often don't take things seriously and are more prone to risk.",
      "time": 1715140666,
      "translated": false
    }
  ],
  "types": [
    "school",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13989345178390547727",
  "user_ratings_total": 126,
  "vicinity": "1207 Dover Road"
}