{
  "formatted_address": "592 Balestier Rd, Singapore 329901",
  "geometry": {
    "location": {
      "lat": 1.3268792,
      "lng": 103.8427753
    },
    "viewport": {
      "northeast": {
        "lat": 1.328144830291502,
        "lng": 103.8442010302915
      },
      "southwest": {
        "lat": 1.325446869708498,
        "lng": 103.8415030697085
      }
    }
  },
  "name": "Value Hotel Thomson",
  "place_id": "ChIJ5egbiV8X2jERZTyWeXcN7xU",
  "rating": 3.5,
  "reviews": [
    {
      "author_name": "Eugene Chua",
      "author_url": "https://www.google.com/maps/contrib/102252024363838267443/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVzFcpEIqC70FZTZsz69iHpfJrphIofGKUuJH1c1M_Vx32OrO3O=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "Room had a very strong odor that gave us a hard time to breathe. Staff said it was the cleaning agents they used, but i honestly think they should start changing to either odorless or at least a good scented cleaning agent. It was very dificult to breathe in there.\n\nStaff wise.. staff was not at all helpful. No room service, no luggage/baggage assistance. We had like 5 bags with us, and we had to haul it all from the reception to our rooms without any offer of any help.",
      "time": 1747124351,
      "translated": false
    },
    {
      "author_name": "nousername yyy",
      "author_url": "https://www.google.com/maps/contrib/109318845870824394093/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXFKdbjzAdowz2_v_6UBT8Fx34JypvpuqxZIUKmpgtgK-YwdYhj=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "in the last week",
      "text": "Very bad experience!how could two teenagers live in a small room? Also,the toilet was super small and dirty, I even saw two insects in the toilet, it was super disgusting!What's more, how could we shower without shower curtain, the floor was wet.Also,there was no exhaust fan in the toilet ,how could  it be a toilet ?And about the room,l couldn't believe Ilive in such that rubbish room, we couldn't even open our luggage, we were so disappointed Although we only stayed for four nights, I don't think I can stay here even more one second. For the bed,! couldn't sleep well because the sheet of the bad was dirty I don't think you guys clean it well and the pillow was not soft enough. Besides, I don't know why the hairdryer couldn't take it out ,did you guys think we want to stole it and the coat hanger couldn't take it out, what's the purpose of putting here without using it? The most important was only a lock for the door, it was not safety for us and I could hear my neighbours were talking loudly at midnight, they kept screaming and shouting, it was so annoying! Lastly,the lobby was super small, just a few people could go inside.l was so disappointed of this bad experience , l swear l will never stay in this hotel anymore!",
      "time": 1747365957,
      "translated": false
    },
    {
      "author_name": "JAKARIA MUKUL",
      "author_url": "https://www.google.com/maps/contrib/104404859556842672558/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV4Dgwot7Il6pgI3kK1voipMlvVJZRS05LWLwcYq2inBf_w9iuSEg=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "3 months ago",
      "text": "In my opinion, this hotel is not suitable for higher-class people. I stayed there for two nights, but I was not happy with their service. They need to be more careful in handling customer service, ensuring room cleanliness, changing bed sheets, providing brushes on time, and offering coffee or tea according to the customer's preference (with or without sugar). Water supply should also be properly managed.",
      "time": 1739278339,
      "translated": false
    },
    {
      "author_name": "Chris F",
      "author_url": "https://www.google.com/maps/contrib/117654107831081813125/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocInSYqo7bE2S6MWpdmfIAoIaX2qgNZ25MjIpCjPLNYThDwFMA=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "I really wanted to leave a good review, as I’m usually generous with my hotel ratings, but this was probably the worst stay we’ve had. The room was nothing like the pictures—very deceiving. As soon as we opened the door, we were hit with a moldy smell. We immediately requested another room, but we never received any feedback or update about it. The bathroom also had a strong moldy odor, and the toilet was dirty.\n\nWe asked for fresh towels, but they never arrived. When we reached out to reception for help, they didn’t even bother to follow up or provide any updates. On top of that, the walls were so thin that we could hear people in the corridors in the morning while we were still trying to sleep.\n\nOverall, this was absolutely not worth the money. Very disappointing and would not recommend.",
      "time": 1738382255,
      "translated": false
    },
    {
      "author_name": "LMT.BRKR007",
      "author_url": "https://www.google.com/maps/contrib/115704463596138441490/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLheqX7SxwtuW_VposKPEbI3GfPpl6kF3Vg9r1__wQIYyAw9GIh=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "A bit rough for a budget hotel. I have stayed at holiday inn and i would compare this as a red roof in or motel 8. The cleaning agent which was a cheaper bleach caused my throat for both me and my associate to get sick. I reported this on agoda as well. I honestly would want my money back. I have stayed other places for less and have had way better quality of sleep and rooms. Just being brutallaly honest. Very loud customers. I think a tour group was staying and they was loud in hallways late.",
      "time": 1747036044,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1580496801022491749",
  "user_ratings_total": 2604,
  "vicinity": "592 Balestier Road"
}