{
  "formatted_address": "60 Arab St, #01-02, Singapore 199757",
  "geometry": {
    "location": {
      "lat": 1.3011964,
      "lng": 103.859466
    },
    "viewport": {
      "northeast": {
        "lat": 1.302475580291502,
        "lng": 103.8607314802915
      },
      "southwest": {
        "lat": 1.299777619708498,
        "lng": 103.8580335197085
      }
    }
  },
  "name": "Vary.sg",
  "place_id": "ChIJNS-3H5MZ2jERWEPWBBibixw",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "suzen",
      "author_url": "https://www.google.com/maps/contrib/110813622133166743966/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVrSHlY9_8UzcaGqrUaovjmOFE3Ci0_gVEc21lKoiT1Er-s0q8=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 2,
      "relative_time_description": "2 months ago",
      "text": "Saw this recommend from online platform. Went to try it by ordering takeaway. Proved to be too much to finish it all. The long truffles fries were best to eat it while still hot.\n\nAs for the nachos with 2 types of cheese tasted like the ones at cinema 😷",
      "time": 1740881570,
      "translated": false
    },
    {
      "author_name": "Sten (Piqued Wanderer)",
      "author_url": "https://www.google.com/maps/contrib/115011929186540431052/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWWbpFyJ2wLsASsvdpfZFU2nvqzXRkXyOzw-cYNB81OlxGaDNZM=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Ordered their signature and specialty fries and it was yummy!\n\nLets dive in straight!\n\nFood:\nBest eaten when its hot. So when we ordered, they made it fresh for us.\n\nService:\nThere is a kiosk to order food to reduce manpower at the front.. well, staff do come out to assist since there will be some challenges by users who are not familiar with the system\n\nAtmosphere:\nPlace is definitely small but looks lively and hip.\n\nA recommended place to at least try once. Do check them out!\n\nCheers!!",
      "time": 1736086653,
      "translated": false
    },
    {
      "author_name": "Rochelle (OchieBon)",
      "author_url": "https://www.google.com/maps/contrib/107572074312956587143/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXRv2Mhfbx5uxClrVa-UX2v2pyzq8O-UnomlBru_jove_QOFBsxNQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "This is one of the best and longest and crunchiest fries I've ever tried in Singapore!!! I super love tjis Monster Fries!!! and the store is just small with one small table and chairs on the side but they offer best quality fries and nachos plus potato jack thay will make ur tummy full and happy!! Dont miss out thier lychee mojito! the best and very refreshing too! It's just along Arab street and this is becoming more popular as it's halal plus fries is like giant in size!! i love the taste not too oily and i ordered the truffle fries! it also comes with two sauces and we picked honey mustard and bbq! Nearest MRT Bugis MRT..it's at the heart of kampong glam! Must Try!! Sheera and Emyll super friendly too!!!",
      "time": 1738830469,
      "translated": false
    },
    {
      "author_name": "Sera // IG: diningwithsera",
      "author_url": "https://www.google.com/maps/contrib/118301436723641326928/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX9NCc6stGTNIHPixhaC27p8dOFlcSoDAsI6AA2DU2i2sTIPw0=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Probably the smallest muslim-owned shop for all things potatoes!! They offer monster fries, baked potatoes, nachos & refreshers, with endless VARY-ations (haha). With limited seats available, we decided to go for a takeout instead.\n\nHad their Varitos fries ($9+1+1):\nThese handmade 6-inch fries had the perfect crisp and crunch. With 7 seasonings & 6 sauces to choose from, the combinations are endless. We paired these with the popular OW cheese seasoning & added Mentai Mayo (my friend’s fav) & Honey Mustard sauce (my fav) each for an additional $1, which came in the cutest bottles. Must-try !!\n\nAlso tried their Varispuds Beef Chilli Jack ($14) which entails soft baked potato topped with creamy melted cheese & beef chilli (prepared Mexican-style, so the spice level was perfectly balanced & not overpowering). A satisfying dish, but I felt that the meat-to-potato ratio could be tweaked a little for a more substantial bite.\n\nHad their Varicool Lychee Mojito ($5) which was a tangy, refreshing non-alcoholic drink which paired pretty well with our spud mains.\n\nService was just a littlee slow (15+ mins for the order), but the friendly staff made up for it. Overall, a satisfying, hearty meal. Will be back for the fries if I’m around the area 😋",
      "time": 1738931903,
      "translated": false
    },
    {
      "author_name": "Zozo",
      "author_url": "https://www.google.com/maps/contrib/109173464175521287422/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVKBtxIeuwXbYjOBJHsgK6gUhsdytO1pcx35OtD2jcTAaA43Wk=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "If You Love Potatoes, You Have to Try This Halal-Certified Potato Heaven in Singapore!\n\nTheir Monster Fries are crispy on the outside, fluffy on the inside, and irresistibly addictive. Made fresh and fried upon order, they’re a perfect treat, served with everything from seasonings to tantalizing sauces!\n\nIf you’re craving something a bit more indulgent, their Beef Chilli Varichos is a must-try. Is nacho chips smothered in spicy minced beef and rich melted cheese. Or go for the Salsa Guacamole for a refreshing twist, or the classic Cheesy Cheese— their own take on nachos that’ll leave you hooked.\n\nThe Beef Chilli Jack Varispud is the perfect choice for hearty meal. This baked potato is mashed, stuffed with butter and cheddar cheese, and topped with spicy minced beef and mayo sauce. For a milder option, try the Plain Jack Spud Varispud for a more pronounced cheese flavour.",
      "time": 1740660655,
      "translated": false
    }
  ],
  "types": [
    "meal_takeaway",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2056908182287434584",
  "user_ratings_total": 16,
  "vicinity": "60 Arab Street, #01-02"
}