{
  "formatted_address": "1 Larkhill Rd, B1-06 @ Amara Sanctuary Sentosa, Singapore 099394",
  "geometry": {
    "location": {
      "lat": 1.2517312,
      "lng": 103.8221016
    },
    "viewport": {
      "northeast": {
        "lat": 1.253023630291502,
        "lng": 103.8233141302915
      },
      "southwest": {
        "lat": 1.250325669708498,
        "lng": 103.8206161697085
      }
    }
  },
  "name": "Verve Bar + Grill",
  "place_id": "ChIJSVIHtwcf2jERVG-X_1AbMxM",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "TJ Teghjeet Narula",
      "author_url": "https://www.google.com/maps/contrib/115164269960293488693/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVfDaAaOCtEaRKX47EVLETRNt1t1Wj9v50Kd4BbARZkhZ1MnCdWyw=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "We recently had a small celebration at Verve Bar+Grill to mark a special occasion, and it turned out to be an unforgettable evening! From the moment we walked in, the ambience set the perfect mood.\n\nThe food was absolutely amazing—everything from the bar bites to the main course, desserts, and drinks was spot on. Each dish was flavourful, making it an absolute treat for our taste buds.\n\nA big shoutout to the incredible crew at Verve! Their warm hospitality, attention to detail, and friendly service ensured we and every guest felt taken care of. It was truly 5-star service at its best.\n\nKudos to the owner, Mr. Subhankar, for his dedication to creating such a welcoming and enjoyable space. His efforts in making sure that every guest feels comfortable and has a great time really shine through.\n\nWe had an amazing time, and Verve Bar+Grill is definitely a place we’ll be returning to again. Highly recommend it to anyone looking for a perfect spot for celebrations !",
      "time": 1738062620,
      "translated": false
    },
    {
      "author_name": "Eileen Ng",
      "author_url": "https://www.google.com/maps/contrib/102277112624358429031/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJi9sy5_cGxK4U-jfI9NnttVOs50R9-mNB91df-MBgyDd-uBGI=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "We had such a fantastic experience at Verve Bar & Grill! We chose the menu of a fusion of Indian and Chinese dishes, which was so delicious that every bite was unique and flavoured. The atmosphere was cosy and peaceful, surrounded by beautiful tall trees, which made it feel like a hidden gem.\nThe restaurant is set in a lovely conservation bungalow within the hotel vicinity. The space has a warm and comfortable vibe, which makes our evening extra special.\nWe were dining with a top-level CEO, a few foreign guests and professionals with very high expectations, and they were thoroughly impressed! The service was friendly and attentive, the kitchen was spotless, and the whole experience exceeded our expectations.\nThe night was filled with laughter and great food, just the place you want for a memorable dinner. I'd recommend Verve Bar & Grill to anyone looking for something unique and special!",
      "time": 1733632766,
      "translated": false
    },
    {
      "author_name": "Shubhi's dance Academy",
      "author_url": "https://www.google.com/maps/contrib/114805472930657618295/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXqs4HMJ-K6vBz8Jik5spM2VRVftkmrUinIEnr5fTH34SnEmuk4=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 3,
      "relative_time_description": "3 months ago",
      "text": "Disappointing Birthday Celebration with a Sweet Gesture\n\nI recently celebrated my birthday with my family at this restaurant, but unfortunately, it was not the experience I was hoping for. Despite having made a reservation for the outdoor dining area and receiving confirmation, we were disappointed to find that the area was already occupied by another event. We were eventually seated in a corner outside, which wasn’t ideal for a special occasion.\n\nThe food was underwhelming. We ordered the aglio olio, but it didn’t meet expectations at all—it was quite bland. Other dishes were similarly average, and honestly, nothing stood out.\n\nHowever, I do want to mention that the birthday cake they provided was absolutely delicious, and we truly appreciated this thoughtful gesture. It was a lovely touch in an otherwise disappointing experience.\n\nConsidering it was my birthday, I had hoped for a more enjoyable and memorable meal, but the combination of the seating issues and lackluster food left me feeling let down. Wouldn’t recommend it for special occasions, though the cake was a nice surprise.",
      "time": 1739177419,
      "translated": false
    },
    {
      "author_name": "Lynsey Cooke",
      "author_url": "https://www.google.com/maps/contrib/111226151576047694151/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVDEze8LamnvmoC1ORuAp_4OYp43GohvZOCag4esAkRKS4OHbCl=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We loved Verve! We stayed at The Barracks Hotel for 5 nights and ended up eating at Verve for four nights! The Indian specialities were all delicious. We particularly enjoyed the Keema and the Tandoori Chicken. Our children enjoyed ordering selections from the Bar Menu for a small plates dinner.\nService was excellent, friendly, attentive and very helpful with recommendations.\nWe are big fans of scotch whisky too and there is a varied selection at Verve. We will come again next time we are in Singapore. Highly recommended. Thanks to every one at Verve.",
      "time": 1744962000,
      "translated": false
    },
    {
      "author_name": "Chin Jun Yan",
      "author_url": "https://www.google.com/maps/contrib/101387401705791296526/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLuMrsE4B0IqfD472kQ48_wJfvPAcDAb2Puh1wYPtfi0X48Bw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Overall, would recommend the Indian cuisine and cocktails. Food and drinks were extremely rich in flavour and well thought out. Cocktails were notably prepared with finesse and filled with numerous ingredients.\n\nRetaurant has a quiet ambience which is confortable. Bar and outdoor seating options are also available.\n\nStaff were attentive and very friendly. However, they may seem to be slightly overbearing at times. Would recommend for staff to check in with guests at a lower frequency to improve guest comfort.\n\nThe menu is extremely extensive and may be overwhelming for first-time guests. Would recommend asking for recommendations from staff for first visit. I am sure they will be more than happy to help!",
      "time": 1745043759,
      "translated": false
    }
  ],
  "types": [
    "bar",
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1383479545232322388",
  "user_ratings_total": 27,
  "vicinity": "1 Larkhill Road, B1-06 @ Amara Sanctuary Sentosa"
}