{
  "formatted_address": "21 Choa Chu Kang Ave 2, Singapore 689907",
  "geometry": {
    "location": {
      "lat": 1.3777532,
      "lng": 103.7404917
    },
    "viewport": {
      "northeast": {
        "lat": 1.379026230291502,
        "lng": 103.7418921302915
      },
      "southwest": {
        "lat": 1.376328269708498,
        "lng": 103.7391941697085
      }
    }
  },
  "name": "Victory Family Centre Choa Chu Kang",
  "place_id": "ChIJM4iNS9sR2jERifBVNKnihvI",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Marcus Tan",
      "author_url": "https://www.google.com/maps/contrib/102764999498800473834/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUsBxdE36lLpeujpTWzJsbwmP3DXCYImvUYbfMkXjv-yr_eJc8J=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "5 months ago",
      "text": "As someone who works night shifts, I rely on a peaceful environment during the night to rest and recharge. Unfortunately, the volume of the music and loudspeakers from the church has been significantly disturbing my sleep every weekend since friday from 7 to 10.30pm making it difficult to sleep & for me to perform my duties at work.\nI fully understand the importance of your ministry and the church's role in the community, but I kindly ask if you could consider lowering the volume or adjusting the timing of the loudspeakers, especially during late-night hours and i dont get why u had to blast the speaker outdoor? Is this an outdoor event? its so inconsiderate.\nI appreciate the good work the church is doing tohelp the neighbourhood and I do not wish to cause any inconvenience. I’m simply requesting a small adjustment to help create a quieter environment for those of us who need rest to work during the night, please be more considerate.\n\nThank you for your understanding and consideration. I hope we can find a solution that works for everyone in the community.",
      "time": 1734097813,
      "translated": false
    },
    {
      "author_name": "Dhiran Singh",
      "author_url": "https://www.google.com/maps/contrib/108580378228132092138/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKbLtm1Uf667tu0GsZ3BDI04Z--Fink_b4kUrqEjc1sY1kKG-4=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Standing at the cross road, one has forsaken me, for one life has sacrifice for one to die for, as I have said \"Whomever wants to save their life will loose it, for whomever loose their life for me will find their life, find me. Thinking \"is there hope found when there is nothing when you have lived your whole life for me and still in complete brokenness\"\n\nRunning to redemption to be with you and many died and never had eternal life as much as my love defeated death on my  cross, my blood and my body selflessly gave myself up.\n\nWhat more can be found?\n\nI have done everything for you and its still never enough. How do I face my redemption continue begging you for strength and finding my strength fails me.\n\nMy end is nearing drawing and gets to be known who walked to redemption has got his legs completely crushed.\n\nTo find me is to die and find me taking me in your arms. Living and dieing for me is the only way to completely knowing who I am.\n\nWhen I spoke\n\nDid I ever die and it cost that much giving my life for? I was forsaken, despised, rejected, accused, found beauty in my own death so others will know how beautiful they are, they had to see me suffer and die first before anyone could see I took my own fall how much I fell and kept going, as I said \"no one can take my cross from me\" I was the very first to wear my crown and given that death was set upon me for the one whom I created seeing how much beauty and love was given to everyone.\n\nAfter all I had done, it still was not enough, many rejected my salvation and I gave my love and forgiveness and grace as much as it took I had done everything to save you. It betrayed my own body to see you leave in sins and abstain eternally from me.\n\nYou found yourself in nothing, I still came and made sure you know I still care, your heart may feel completely empty, I came to you in the land my Father sent me to bless and you are mine and forever you will be.",
      "time": 1724509134,
      "translated": false
    },
    {
      "author_name": "Qian Le Sze",
      "author_url": "https://www.google.com/maps/contrib/100925882586885803165/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL4P0owTFVfc0Pg0l_hixyVThcwYXskzPQBW6KuJ-5S1icfZg=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "great church for those living around the area! their keyboardist is good looking too ;)",
      "time": 1711943745,
      "translated": false
    },
    {
      "author_name": "Charlene Tan",
      "author_url": "https://www.google.com/maps/contrib/115511402588211231318/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUI5gSafy8ya2GRxzaoQ4p7tzyTdp3cKIVPOK5dHB7VXZ_--5R3=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "6 years ago",
      "text": "Good to visit this church if you are looking for someone to mentor and guide you in your spiritual walk.",
      "time": 1535167496,
      "translated": false
    },
    {
      "author_name": "Miani Anwar",
      "author_url": "https://www.google.com/maps/contrib/111381615407731270913/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI36AsXxjcLwulvpKeNMo6aY4MDr2wSPmXG_KTNy6gT6vaHDg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "7 years ago",
      "text": "Very powerful church with plenty of potential to unleash breakthrough and give salvation.",
      "time": 1513311010,
      "translated": false
    }
  ],
  "types": [
    "church",
    "place_of_worship",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=17475904620413186185",
  "user_ratings_total": 24,
  "vicinity": "21 Choa Chu Kang Avenue 2"
}