{
  "formatted_address": "16-01, Laman Niaga Sunway, Persiaran Medini 3, Sunway Iskandar, 79250 Iskandar Puteri, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.3941212,
      "lng": 103.635254
    },
    "viewport": {
      "northeast": {
        "lat": 1.395512730291502,
        "lng": 103.6365407802915
      },
      "southwest": {
        "lat": 1.392814769708498,
        "lng": 103.6338428197085
      }
    }
  },
  "name": "Vine Cafe",
  "place_id": "ChIJ_-6b5PgL2jERAffI3cfQItM",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Care team Nirvana",
      "author_url": "https://www.google.com/maps/contrib/101916130064663302869/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV8X2xDiPsNEn1lPRRzo5M2Z5B5dqCgfCtLE8NdPaF644Z9n44=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Awesome place serving superb tuna croissants, latter mocha , pesto . Super love the food . Croissant was crisp and buttery flavourful . Mushroom pesto noodle was cooked to right taste. Definitely a comeback and thumbs up to supporting the meatless community. Big shoutout to the cafe and passionate people behind the scene and making us an awesome breakfast. Open from 830am to 930pm. A true hidden gem . Only few minutes drive from Tuas custom . Super highly recommended",
      "time": 1741574955,
      "translated": false
    },
    {
      "author_name": "Kath Angus",
      "author_url": "https://www.google.com/maps/contrib/108677958048610290057/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXYJNtPpv2rqHmNhB9hAomQIa3vMmedL1u2_3690hWUBbwA8WiMlQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "7 months ago",
      "text": "Really enjoyed this little Sunway gem. The atmosphere is very sweet, very chill. The restaurant itself is clean and neat and very welcoming. We visited as a family of 4, we spent 150RM which felt like a good amount. The food and drinks we ordered came out very quickly which was great as we had kids with us. We ordered the full flight of sparkling drinks and the flavours offered us creative combinations that can so often be lacking in beverage menus. Portion sizes were generous and the meals themselves were of balanced taste and lovely.",
      "time": 1727360032,
      "translated": false
    },
    {
      "author_name": "Yun Xiang",
      "author_url": "https://www.google.com/maps/contrib/100471045446290739173/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI4wdMONHfbOMl-rPizZmmC6dSMWxO43DajL63aKZA8GaG__Q=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "2 months ago",
      "text": "The laska is quite good.\n\nI ordered the hojicha latte which is also good. However, the cup is quite small. I also enquired on the milk as I wanted to avoid dairy. They do provide oat milk but I am charged 1 RM. I felt they should have informed me beforehand.\n\nAmbience is good but chairs on my table are uneven and shaky.",
      "time": 1741517522,
      "translated": false
    },
    {
      "author_name": "Sabbitan Balakrishnan",
      "author_url": "https://www.google.com/maps/contrib/111091813820789780678/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUOpsoxkpZ9e7TCfdwLfVOcrAJtKZHVtuwR08RZsNpvHX6p6eSymg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "## The Vine Cafe: A Sunway Citrine Gem for Casual Comfort\n\nNestled near Sunway Citrine, The Vine Cafe offers a warm and inviting atmosphere perfect for a relaxed and enjoyable meal. The cafe's lovely ambiance makes it a great spot for catching up with friends or enjoying a solo lunch break.\n\nWhile I didn't delve into their pastry selection this time, their savory options impressed. For a creamy and satisfying experience, I highly recommend the Alfredo pasta. For a unique twist, try their signature Luok dish – I won't spoil the surprise, but it's definitely worth exploring! The portion sizes were decent, and the classic French Fries were a perfect accompaniment.\n\nThe service at The Vine Cafe was exceptionally fast. My order arrived promptly, allowing me to savor the meal without a long wait.  While I didn't try any beverages on this visit, their menu likely offers a variety of coffees, teas, and other refreshments.\n\nWith prices hovering around RM 60 and above, The Vine Cafe falls into the moderate price range. However, the quality of the food and the efficient service justify the cost.\n\nAdditionally, the cafe is wheelchair accessible, making it a great option for everyone.\n\nOverall, The Vine Cafe is a fantastic choice for anyone seeking a warm and welcoming spot to enjoy delicious and satisfying comfort food. I highly recommend checking it out!",
      "time": 1718765023,
      "translated": false
    },
    {
      "author_name": "Kimberley Howarth",
      "author_url": "https://www.google.com/maps/contrib/114957590885643931784/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKqIRXau89p_qX4D_iPhWPke2K9bpcZNopPSg5xJgvjCHJQZg=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Very cosy, comfortable vegetarian cafe. The staff are warm and welcoming, and very helpful. They also have the option to turn your dish fully vegan by removing the eggs, or other allergens should you require. They have a really great selection of locally inspired dishes, and a few western pasta dishes and pizzas. I got a dry noodle dish with braised tofu and mushrooms. Personally, I think it could use a bit more salt or soysauce. But the braised flavours were really nice and wholesome. And the soy marinated eggs were absolutely perfect, with that delicious gooey egg yolk in the middle. Very good service as well! The food arrived so fast after ordering it was amazing. Very happy to eat here and definitely warrants repeat visits.",
      "time": 1714796709,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15213952048048961281",
  "user_ratings_total": 204,
  "vicinity": "16-01, Laman Niaga Sunway, Persiaran Medini 3, Sunway Iskandar, Iskandar Puteri"
}