{
  "formatted_address": "2 Dickson Rd, Singapore 209494",
  "geometry": {
    "location": {
      "lat": 1.3051493,
      "lng": 103.8546545
    },
    "viewport": {
      "northeast": {
        "lat": 1.306411930291502,
        "lng": 103.8559331302915
      },
      "southwest": {
        "lat": 1.303713969708498,
        "lng": 103.8532351697085
      }
    }
  },
  "name": "Wanderlust by The Unlimited Collection",
  "place_id": "ChIJU502sbkZ2jERX16vKXj9ock",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Adrian S",
      "author_url": "https://www.google.com/maps/contrib/111427524638492789676/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWpKKa48uA283Yifq01poKE6VGQM_RVpPh6BnEG7YY3F1qxWO7CgQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "I would give it 3.5 stars, but since Google doesn’t have .5 stars, 4 it is.\nI have stayed in a few Ascott hotels and - this is for the management of Ascott to read - there is ALWAYS something which you ‘cut budget’ on. The stuff that other hotels will give you without question but with Ascott it’s either a plain ‘No’ or a real pain to ask. In this hotel it’s an extra pillow, and face towels. They basically don’t have extra pillows. Surprising!\n\nOk that was the bad, the good is the rooms are nice; location is very good. A very short 3 mins walk to the jalan Besar MRT. A longer 5-7 mins walk to the Rochor MRT. Room is comfortable, kitchenette is well equipped. The toiletries are very nice smelling.\n\nRoom is small, but the layout is quite unique. This is a treasure in the area: especially with most other hotels there are pay-by-the-hour.\n\nSooooo many eateries around the area, from Malay, dimsum, mamak style, Chinese - all very good and some are known to have superbly good food.\n\nWill I stay in this hotel again? YES. But I will bring my own extra pillow and face towels. You should too!",
      "time": 1743243081,
      "translated": false
    },
    {
      "author_name": "Joe Liu",
      "author_url": "https://www.google.com/maps/contrib/103633670965368534082/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKHh0AuZzRmepf2XynNTx4wZiUMF7FHj0oI-ct_KiPStqki1A=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We stayed here for 2 nights and the hotel didn't disappoint us (booked 1 room for 2 adults and 1 toddler). The room vibe are comfortable, the toilet aren't that cramped (its uber clean!!! Couldn't ask for more) and the bed are soft. There is also washing machine with dryer facility which is a plus point for travelling with toddler, also there is pantry for refilling drinking water as well as microwave/ oven to use. There are also plenty of restaurant nearby that are worthy to try. Overall we had a good experience staying here, also the receptionist are really kind if we need anything.",
      "time": 1744355110,
      "translated": false
    },
    {
      "author_name": "Sujiro Seam",
      "author_url": "https://www.google.com/maps/contrib/102974155473873255359/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLThWKy2csJwfXPxYa_bo67pmMACyU9nphAezRZJaXeF7-yhQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a week ago",
      "text": "Stayed at the Wanderlust in a premier studio. 22 sqm isn't large but for Singapore that's pretty good. Everything was optimised. Plenty of storage space under the bed and in the bedhead. Good to have a kitchen and kitchenware. Fridge is a bit small though.\n\nBathroom is neat and practical but it's not for everyone. No curtain or separation of any sort, so the whole bathroom is soaked after shower. And all the taps and the toilet flush are designed to save water but aren't so convenient.\n\nSparkling water available on tap on the Second floor, with refillable glass bottles provided. But somehow our cards didn't give access to the Second floor. The Hotel staff said it was a computer glitch.\n\nOther travellers shared that a partnership with a nearby Citadines (in the same hotel group) allowed access to a gym and a lap pool but the hotel staff knew nothing about it when asked.\n\nCertainly one of the most upscale hotels In the heart of Little India.  Within walking distance to the Sultan Mosque and the former house of Tan Teng Niah. All sorts of Indian food at your doorstep.",
      "time": 1746616739,
      "translated": false
    },
    {
      "author_name": "Alex Long",
      "author_url": "https://www.google.com/maps/contrib/107343705493966382175/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUT_gqrT2ZqYuW1Q9NZo8MFoXUj4c0_KZjhV0rulqPQSS53kVsv=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I had a wonderful time staying at Wanderlust on my recent trip to Singapore. It's in a fantastic location, very near to local attractions, food and transport in Little India. The room was excellent, designed to maximise space. I got the smallest room and for one person it was perfect. For a couple, you'd need a bigger room. Bathroom was beautiful, with great choice of body wash, shampoo and conditioner. The laundry facilities were excellent — automatic detergent meant it was clean and efficient. Most especially, the staff were wonderful — in particular the gentleman who helped me (Dickson?) with some great food recommendations and directions. A great hotel for a good price. If I return to Singapore, I would stay there again.",
      "time": 1732412523,
      "translated": false
    },
    {
      "author_name": "Eric Olliff",
      "author_url": "https://www.google.com/maps/contrib/114628059379469610782/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVFA0kkrOoVzU4aFh99VsUDzx2SXna7hMm0mOS7iuAmhEPlecYI=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "My wife and I loved this hotel as a home base for 4 days in Singapore. The staff are all incredibly friendly and helpful. The rooms are a bit cramped, but it seems like it's quite good value for Singapore. We loved the sparkling water dispenser and coffee machine on our floor, and also the partnership with the nearby Citadines hotel where we could use their pool and gym. The surrounding neighborhood isn't the \"nicest\", but it was conveniently located for public transit to explore Singapore. We loved eating breakfast every morning at nearby Al Haleem restaurant.",
      "time": 1734312866,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14529172565411192415",
  "user_ratings_total": 516,
  "vicinity": "2 Dickson Road, Singapore"
}