{
  "formatted_address": "5066 Ang Mo Kio Ind Park 2, Singapore 569569",
  "geometry": {
    "location": {
      "lat": 1.3762521,
      "lng": 103.8612364
    },
    "viewport": {
      "northeast": {
        "lat": 1.377547130291502,
        "lng": 103.8624826302915
      },
      "southwest": {
        "lat": 1.374849169708498,
        "lng": 103.8597846697085
      }
    }
  },
  "name": "WashingMachinePro.com",
  "place_id": "ChIJhadp7IcX2jERUMxzffa2QQY",
  "rating": 3.2,
  "reviews": [
    {
      "author_name": "Marcus Chew",
      "author_url": "https://www.google.com/maps/contrib/102667301458859724624/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLhiXJjU1cpfqjtjpeYDBemlIDbotkICXjPmsgL6ltSOuj_mA=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 2,
      "relative_time_description": "6 months ago",
      "text": "Customer hotline is quite responsive. However the expertise of the technician sent is a question mark. I had problems with my Samsung washing machine which occasionally leak water during wash. Technician arrived quite quickly but also left quickly... he turn on a normal wash, let the water fill up a little and proceed to tilt my washing machine. At this time, no water came out and he concluded the washing machine had no problem and left in 10 mins. Not surprisingly, the leak came back during some wash. Contacted the service whatsapp and uploaded a video of where the leak came from. The service centre contacted thr technician and he said tt I used too much detergent. In my normal wash, the most ill use is two cap full. Which modern day washing machine can't handle 2 cap full of detergent?! It's not like I poured half the bottle into the washing machine for a single load. If I need to adjust the detergent to a resolution of half cap of detergent to find that sweet spot of not having any leaks, its common sense to say it's definitely not functioning properly. Utterly disappointed and waste of time even if they decide to return my 60 dollars for service fee. They did ask for another appointment so tt their technician can come again, but if they cannot fix it the 1st time, I'm not confident another appointment will fix anything.",
      "time": 1730033490,
      "translated": false
    },
    {
      "author_name": "Sam Ng",
      "author_url": "https://www.google.com/maps/contrib/107663838294315633587/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJNbF81yoLojp0J3_XzA_HM8i9BEEE85uC4LOU6NfPxxjcP7Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "My Toshiba Washing Machine was purchased about 10 years ago and the spinning function wasn't working. Went through Google and decided to try out WashingMachinePro. Was very impressed with the services provided by their Customer Service Representative Ms. Gan. She was very professional and provide valuable information pertaining to my repair requests. She was also very patient in explaining the T&C pertaining to the Service Request.  Currently the machine is at their workshop pending the replacement of the spinning gear. Price quoted was reasonable. I will not hesitate to recommend Ms. Gan and the Company to anyone if they need servicing or repair of their washing machines.",
      "time": 1718803083,
      "translated": false
    },
    {
      "author_name": "Bernie Kou",
      "author_url": "https://www.google.com/maps/contrib/106779174008708191783/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIGF52J7qrP1o90kdOTvulnCku9cZofp_yJyUN07rGNCl6rjg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "9 months ago",
      "text": "Response from Customer Service was excellent. Try to get technician to come over inspite of their full schedule on the same day I report the problem. You can trust Toshiba to deliver the after sales service and a piece of mind in good team at Toshiba in AMK branch . We'll done and keep up the good work",
      "time": 1723257764,
      "translated": false
    },
    {
      "author_name": "Li Min Cheng",
      "author_url": "https://www.google.com/maps/contrib/101768568355538078477/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV3f355XiLtlpQbQBCGwAQ2NoV1TOxXrpVVJKTNpeWTLZqVpLwr=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "3 years ago",
      "text": "Having called the day before to schedule a washing machine repair at the 2-4pm time slot; they confirmed it with me. On the day of the scheduled repair, I called twice between 2-4pm to understand when the technician was coming as I had someone go over to my home to let him in. During those calls, they said he was on the way. However at 4pm, the technician called to say that he just received the job and was only available from 7-10pm in the evening. Poor planning and lack of respect for your customers time.",
      "time": 1632211772,
      "translated": false
    },
    {
      "author_name": "Syaza Sham",
      "author_url": "https://www.google.com/maps/contrib/117849737533774077375/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW1ZqFLa_W4RdxAFwsLXpFLZcXAKPB7hNm0_6SlGZw6-aGXf6R3Fw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 years ago",
      "text": "Thank you for your service, i had a pleasant experience with them. Called them on a Sunday around 10AM, they arranged for appointment between 10.30am to 12 noon. Technician came  around 11AM and managed to repair my washing machine. Thank you so much for the prompt service, would highly recommend to you guys. May god bless your kind soul! Very satisfied with their service.",
      "time": 1558844922,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=450842607496711248",
  "user_ratings_total": 43,
  "vicinity": "5066 Ang Mo Kio Ind Park 2"
}