{
  "formatted_address": "901 Bedok Reservoir Rd, Singapore 479266",
  "geometry": {
    "location": {
      "lat": 1.3393343,
      "lng": 103.9335986
    },
    "viewport": {
      "northeast": {
        "lat": 1.340706630291502,
        "lng": 103.9353913302915
      },
      "southwest": {
        "lat": 1.338008669708498,
        "lng": 103.9326933697085
      }
    }
  },
  "name": "Wawawa",
  "place_id": "ChIJDQ1FjkY92jERyItFwa7UX28",
  "rating": 3.5,
  "reviews": [
    {
      "author_name": "Cory T.",
      "author_url": "https://www.google.com/maps/contrib/103181963235538438989/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXaXUGzc9i65uJl6EZuiX5KdwrENpWLbIzG8i-XcOm2baj3diqO=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 2,
      "relative_time_description": "3 weeks ago",
      "text": "Stopped by to get an early dinner by the waterfront. Ordered the crispy Hor fun. It’s actually decent; however, the bowl that it was served in completely didn’t make any sense. The minute the fork went into the dish, the gravy spilled over two sides of the bowl. I asked them to change to another bowl - they said it was the only bowl they have for service. Minus stars for not thinking through service.",
      "time": 1745673598,
      "translated": false
    },
    {
      "author_name": "Pauline Yoong",
      "author_url": "https://www.google.com/maps/contrib/109959124710224590577/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW7Es4V35sdl3yrK9Uz8nYAm8cH_XdK-kI5UCnLMrvdMxl7m0TK=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "6 months ago",
      "text": "This restaurant has been around for a long time but I only managed to visit it in 2024. Firstly the facade is really old, it’s alfresco no indoor air conditioned area. The decor is very dated, very 1990s. The menu is quite mixed. Some local, western food. I ordered the fish n chips since you can’t go wrong with that. The fish is nicely breaded and taste very good. Chips are nicely cooked too. But the coleslaw is very bad. Full of mayonnaise and not much taste. I also ordered a glass of white wine which is not chilled enough. The waitress tried to promote a bottle as the price is much more attractive but we don’t drink much. There have a duo live singing band on a Thursday night which was nice. There was ample parking space. Right in front of the restaurant is the reservoir. Very nice scenery so that compensate for everything else.",
      "time": 1731722729,
      "translated": false
    },
    {
      "author_name": "JES LOH",
      "author_url": "https://www.google.com/maps/contrib/110364638920867241458/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJPJMUYbVlkPjcdUyg0W0hTUuDr1iwIFOkBV_nxMS0rFZLrcw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I have visited this outdoor cafe a few times and it was a delightful experience.\n\nThe menu offered an impressive variety,\n\nOne of the highlights was the affordability. For such a scenic location, the prices were very reasonable. It’s the kind of place where you feel like you’re getting more than your money’s worth without compromising on quality.\n\nThe combination of nice scenery , great live band , great food and good company made it an unforgettable outing.\nAlso, the natural surroundings and fresh air made it a perfect escape from the city.",
      "time": 1735307203,
      "translated": false
    },
    {
      "author_name": "oXRYSTALo Ong",
      "author_url": "https://www.google.com/maps/contrib/114556064085815871377/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSTtKcF9FYMbh-XNbDu8f7Whl3gi-ZY6T8pFPOm3v9Y98Ws7jL=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "Wawawa at Bedok Reservoir: A Late-Night Gem with a Breathtaking View (4 Stars!)\n\nRating:\n\n• Atmosphere: 4.5/5 (Tranquil and relaxing, with a stunning view of the reservoir)\n• Service: 5/5 (Exceptional service, even after closing time, with a dedication to customer satisfaction)\n• Value: 4/5 (Excellent value for the atmosphere and service, with a promising food menu for future exploration)\n\nOverall: 4/5\n\nAlright folk, Donkey and I wrapped up a long bike ride with a delightful surprise at Wawawa, nestled within Bedok Reservoir Park.  Even though it was past 11 pm (an hour after closing!), the staff were so welcoming and accommodating, letting us grab a couple of glasses of Guinness and soak in the beautiful view from their outdoor seating.  The rich, creamy stout was the perfect complement to the tranquil setting.\n\nThe view overlooking the reservoir was truly breathtaking, especially with the lights illuminating the park.  It was so peaceful and cozy, even after the staff left and the place closed for the night.\n\nWawawa gets 4 stars from us, primarily because of their exceptional service –  they truly went above and beyond. We'll be back soon to sample their food menu and provide a more comprehensive review then!  We highly recommend Wawawa for a relaxing evening drink with a beautiful view or perhaps for a memorable breakfast or early dinner. This place is definitely a hidden gem!",
      "time": 1735470693,
      "translated": false
    },
    {
      "author_name": "Doraemon",
      "author_url": "https://www.google.com/maps/contrib/112665277904119154671/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX2VSCcaT9axvOwx2nD8XD3PgZ8V5VFnv420aocMSfLa6GlcEmN=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "Kitty and I concluded a long cycling journey from the city with a delightful surprise at Wawawa, nestled within Bedok Reservoir Park.  It was past 11 pm,  an hour after their official 10 pm closing time, yet we were warmly welcomed; the staff's accommodating nature allowed us to order drinks and relax in their outdoor seating area. We savored two glasses of Guinness stout, the rich, creamy texture a perfect complement to the tranquil setting. The kitchen was closed, unfortunately, preventing us from sampling their food menu on this occasion.\n\nThe outdoor seating area provided a breathtaking panorama of the reservoir. The cool night air caressed our faces as we sipped our drinks. Reservoir Park lights illuminated the area. After the staff departed, the shutters were closed, and the establishment lights were turned off. Even in the darkness, with only the Reservoir Park lights, it wasn't too dark and felt quiet and cozy.\n\nWawawa at Bedok Reservoir offers a unique blend of exceptional service and stunning scenery, creating a truly relaxing atmosphere. We gave Wawawa a 4-star rating, preliminary because of the outstanding service extended even after their 10 pm closing time. The dedication of the staff is a testament to their commitment to creating a memorable experience for their patrons. The lingering peace and quiet, even after closing, adds another layer to the charm of this special place. We look forward to returning to sample their food menu and providing a more comprehensive review then. We wholeheartedly recommend Wawawa for a relaxing evening drink with a beautiful view, or perhaps for a memorable breakfast or early dinner. The potential for a truly delightful dining experience here is undeniable.",
      "time": 1735409609,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "cafe",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=8025366908029471688",
  "user_ratings_total": 714,
  "vicinity": "901 Bedok Reservoir Road"
}