{
  "formatted_address": "371 Beach Road 01-02 City Gate Mall Kampong Glam Facing Beach Road, Entrance, outside, the mall, Singapore 199597",
  "geometry": {
    "location": {
      "lat": 1.3019388,
      "lng": 103.8625162
    },
    "viewport": {
      "northeast": {
        "lat": 1.303561180291502,
        "lng": 103.8635181802915
      },
      "southwest": {
        "lat": 1.300863219708498,
        "lng": 103.8608202197085
      }
    }
  },
  "name": "We Desi - Indian Bistro",
  "place_id": "ChIJd3pamCsZ2jER6KXqGOyWk90",
  "rating": 4.6,
  "reviews": [
    {
      "author_name": "Xin Ru Toh",
      "author_url": "https://www.google.com/maps/contrib/102618825663061051563/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUVOBQqW0xVNB7DP9HtXCq-GImGXmPIMf--BAdOYUv2pjcN9nEyIg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Omni modern Indian eatery with vegetarian and vegan options. Some items in the menu are labelled with a vegan icon, but the labelling didn’t seem super reliable as these items weren’t necessarily vegan by default (i.e. might need to remind / request to veganise by having no dairy in the marinade and dips when placing your order). The vegan items labelled were Baby Corn Cigars, Samosa, Ghobi Manchurian, Vege Delight Sizzler, Pani Puri, Vada Pav, Chilli Garlic / Hakka Noodles, Broccoli Tikka, Seekh Haryali, Beet Kebabs, and Pindi Chole. Other items in the menu which weren’t labelled but which I think might possibly be veganisable (please enquire) are Veg Biryani, Palak Soya, Dhaba Aloo Gobi, as well as the Pink-a-licious / Schezwan / Steamed Veg Momos. Overall would like clearer labels in the menu (vegan by default, vegan option available, etc); but regardless I appreciated that the friendly staff kindly and patiently accommodated our dietary preferences! The vegan dishes I got were delicious and not too greasy. Nice atmosphere, located within CityGate, which is linked to Nicoll Highway MRT via an overhead bridge. For those who use the abillion app (free to download), there’s an ongoing 1-for-1 promo for all vegan options in the menu, capped at a maximum of 2 redemptions per bill~",
      "time": 1743313354,
      "translated": false
    },
    {
      "author_name": "Rabia T",
      "author_url": "https://www.google.com/maps/contrib/101230147850826442399/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV5MetXW1tkmQdII8wj4gaTlbylUt6pMRKjPzlByqzDrBQHBVJA=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "We Desi is a cozy restaurant with limited seating but a nice ambiance, perfect for hanging out with friends or enjoying a family dinner. The staff is friendly and helpful, offering great food recommendations. Their tandoori momos are a must-try—absolutely delicious! The katori chaat was fresh and flavorful, and the pani poori brought back nostalgic flavors of home. The aloo samosas were fresh and tasty, and the mini gulab jamuns were adorable and delightful. However, the fish tikka was slightly overcooked, and the pav bhaji burgers didn’t meet expectations. On a special occasion, they surprised us with a complimentary dessert, which was a lovely gesture. Overall, it’s a great spot, and we’ll definitely return for more!",
      "time": 1735253588,
      "translated": false
    },
    {
      "author_name": "grishma dixit",
      "author_url": "https://www.google.com/maps/contrib/103476888220378053076/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU5_SnheNHVrBDOO_OQ3qo585X8A9amC4vSyoL0eJr9JMvpNp9v=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "2 months ago",
      "text": "Ambience is fine. Restaurant is too small , make sure to reserve a table before going.\nFood is delicious and serving is efficient.\nWe felt it bit expensive restaurant.",
      "time": 1741961325,
      "translated": false
    },
    {
      "author_name": "Varun Nahar",
      "author_url": "https://www.google.com/maps/contrib/108672706189187760335/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUPg8q9MQYJ4tSQaJFfaKTeDcsLImmZTdymEoPYRo3TELAvVk35rA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Nice Indian restaurant with super fast service. We orders some vegetarian items and all were good barring cheese sticks. The only downside is there is no washroom in the restaurant, so you have to walk all the way to washrooms located in the basement of the City Gate mall. Will definitely visit again for sure.",
      "time": 1743335929,
      "translated": false
    },
    {
      "author_name": "Sairam Subramanian",
      "author_url": "https://www.google.com/maps/contrib/115140538874299582015/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocICPG64pukYmoDUsKEysVW1Anbipw7ag7bz4jeD0fYbZijk3w=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "7 months ago",
      "text": "Went here with high expectations and did not disappoint.  Had some opportunity to improve but.\nWe ordered Tandoori, Schezwan momos, Gobhi manchurian, Katori Chaat,, Seekh Kabab and Paneer Naanza.\nMomos were ok though I've had better. The stuffing was a bit too mashed and not steamed as you'd expect it to be. And the outer layer could have been a bit crispier.\nGobhi manchurian was textbook stuff. No complaints. The katori chaat and Naanza blew my mind. Katori chaat was everything you'd expect from a chaat. Felt like back to Gali wala chaat.\nNaanza was very innovative and very flavorful. Taste of paneer, cheese, felt almost like a pizza and yet it didn't. We ordered one more because it was that good and ditched our plan for main course.\nFor dessert we ordered Almond Kheer and Malai Kulfi. Dessertd were average.. So overall I'd give this one a 4/5.. Go here for good innovative Desi fare  if you're a fan of Indian fare but bored of run of the mill Indian stuff. !!",
      "time": 1728752964,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "meal_takeaway",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=15966271044733019624",
  "user_ratings_total": 824,
  "vicinity": "371 Beach Road 01-02 City Gate Mall Kampong Glam Facing Beach Road, Entrance, outside, the mall"
}