{
  "formatted_address": "664 Yishun Ave 4, Block 664, Singapore 760664",
  "geometry": {
    "location": {
      "lat": 1.4202366,
      "lng": 103.8410543
    },
    "viewport": {
      "northeast": {
        "lat": 1.421473480291502,
        "lng": 103.8422675302915
      },
      "southwest": {
        "lat": 1.418775519708498,
        "lng": 103.8395695697085
      }
    }
  },
  "name": "Wei Wei Noodle Stall (Prawn Branch)",
  "place_id": "ChIJcRjn3XkV2jERv_PJw8oV7KY",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Yi Ling",
      "author_url": "https://www.google.com/maps/contrib/115707001285123682601/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUlkcK6FpBb-Q_EER2W7ON8uPix2iL97NAPchaAE0TxCULNloBN=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I came here for lunch on a Saturday and discovered this place offers more than just one main dish. We ordered the Hokkien Mee and the Laksa.\n\n🍜 Hokkien Mee ($6.50)\nThe star of the show was undoubtedly the Hokkien Mee. I ordered the $6.50 portion, which was surprisingly large. Despite the noodles being sliced lengthwise, there was plenty of squid, pork belly, and noodles in this dish. It was truly a massive plate that could easily be shared between two people.\n\nThe gravy of the Hokkien Mee was flavorful and packed a punch. It's a simple Hokkien Mee dish, but it brought a lot of depth to the table.\n\nIt's not the most mind-blowing Hokkien Mee I've had, but it was definitely a decent one with a very generous serving. I can easily see myself returning for this Hokkien Mee again, as it's nostalgic and traditional without any unnecessary frills.\nI rate: 4.5/5 🌟\n\n🍜 Laksa ($4.5)\nWe also ordered the Laksa to try, and despite its smaller appearance, the gravy was incredibly robust and brimming with shrimpy flavour. It was thick and creamy, and the noodles clung beautifully to the sauce. Essential ingredients like tofu puffs, bean sprouts, and cockles complement the dish perfectly. The chilli paste provided on the side added a delightful kick, elevating this traditional Singapore-style Laksa.\n\nI'm not sure if this place qualifies as a \"hidden gem,\" but it's certainly an unassuming spot serving decent food right downstairs in an HDB block.\n\nIt's a decent place, and I was pleasantly surprised to see many other patrons ordering other dishes as well. The Char Kway Teow looked particularly enticing, and I'm definitely coming back to try it someday! 💪🏻",
      "time": 1737808414,
      "translated": false
    },
    {
      "author_name": "andyloe",
      "author_url": "https://www.google.com/maps/contrib/110109116555826289679/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKp8vNq96IwjePLOuEuOU4D3CuYyyqr9fZ-XhL7ucNdrJxS3g=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "This plate of fried kway teow hits all the right notes—richly flavoured with a slightly sweet and moist texture, just as it should be. The generous portion comes packed with Chinese sausage, fresh cockles, and crunchy bean sprouts, creating a satisfying mix of flavours and textures.\n\nBeyond the food, the experience is elevated by the warm hospitality of the stall’s auntie, who insists on bringing the plate to your table. Conveniently, PayNow is accepted, making payment a breeze. Definitely worth a visit!",
      "time": 1740134691,
      "translated": false
    },
    {
      "author_name": "Kwong Fei Yee",
      "author_url": "https://www.google.com/maps/contrib/118030178376808365901/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLXSTSRtNgAfr4F9hG5R--eq5_xEIcGnF7cEFBWhcE269TSrA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "2 years ago",
      "text": "Went there on a Sunday morning to try out this place. Ordered white and black carrot cake as well as the chicken feet noodle.\n\nWhite and Black Carrot Cake ($3.5 each). 5 stars\nThe taste is quite good but what really amazed us was the large portion. It is really large and one plate is enough to be shared by 2 small eaters. I think with the current high cost of eggs, it is really amazing that they are only charging $3.5 for one plate.\n\nChicken Feet Noodles ($4.5). 2 star\nOnce again the portion is huge. They gave 3 large chicken feet. The chicken feet is nice and tender and the flavour is okay. However, the noodles was a complete let down. It taste like they forgotten to put sauce. Sorry, the large portion and the okay chicken feet cannot compensate for the mediocre noodles.\n\nService wise is very good. They are courteous and patient with customers!",
      "time": 1660489277,
      "translated": false
    },
    {
      "author_name": "Jodeci Fine",
      "author_url": "https://www.google.com/maps/contrib/105546009118925874250/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUANvnZQG44k_dvTjkgZO9SUYjBAGEZjd6vEQV2q_qocuUMwog=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Yishun is not really known for #bcm. But at this tiny hidden coffeeshop, we found a really good old-school bcm here. Previously operated in Khatib around 30 years, now owner is in the midst of passing down his skills to the next generation, his youngest son.\n\nWhat a great $4.50 bcm!! Generous portion comes with so much ingredients like meatball, lean meat, mince meat, liver(very well cooked), braised mushroom (juicy, one of the greatest I’ve tasted) and lots of shallots. Mee kia is qq and nicely mixed the old school way with tomato sauce added.\n\nHkm cooked by his son. Again a generous $4.50 plate which is served so tongue-burning hot! Semi-wet version with very good umami flavour with prawns, sotong and quite a few pieces of pork belly slices.\n\nThis stall with quite a wide menu also sells fishball noodle, chicken feet noodle, prawn noodle, laksa, ckt and ctk.\n\nLet's wish his next generation a great success!!\n\n😋😋😋😋😋😋",
      "time": 1680403827,
      "translated": false
    },
    {
      "author_name": "Edward Rodrigues",
      "author_url": "https://www.google.com/maps/contrib/112847367770121252188/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWEuREAXfutxJZ_-5cNB81GT2J1OgNSdcte2SFX-7dJHTKA4ZbOyA=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Finally found excellent  👍👍👍 hokien prawn noodle, prawn noodle soup and carrot cake and in Yishun. Prepared by locals and so tasty and cooked well with abundance of ingredients.  Strongly recommend this small coffee shop.  Not much of ambience but we didn't look for that but the food . 😋",
      "time": 1670228781,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "store",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=12028012665412121535",
  "user_ratings_total": 53,
  "vicinity": "664 Yishun Avenue 4, Block 664"
}