{
  "formatted_address": "Blk 418 Northshore Drive 02-11/12, 418 Northshore Dr, #2 Northshore Plaza, Singapore 820418",
  "geometry": {
    "location": {
      "lat": 1.4178051,
      "lng": 103.9010743
    },
    "viewport": {
      "northeast": {
        "lat": 1.418908330291502,
        "lng": 103.9026454802915
      },
      "southwest": {
        "lat": 1.416210369708498,
        "lng": 103.8999475197085
      }
    }
  },
  "name": "Well Collective",
  "place_id": "ChIJJaQjJmMV2jERzWoKMm6sWV4",
  "rating": 3.9,
  "reviews": [
    {
      "author_name": "JY Zheng",
      "author_url": "https://www.google.com/maps/contrib/106694525211482187562/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX0JkN5on-NWVR8k2YGQ2uSJ24lCHNQqfljV6qJo8IBb9yiWfo=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "Well Corrective is a gem! I’m especially impressed by their tasty food and the thoughtful inclusion of gluten-free options — a huge plus in this neighborhood where such choices are limited. The waffles with gelato were exceptional, honestly one of the best I’ve had in Singapore. Their gluten-free pasta is also a winner — flavorful and satisfying. I’d love to see even more gluten-free dishes on their menu in the future. Highly recommended!",
      "time": 1747211335,
      "translated": false
    },
    {
      "author_name": "Britney Khu",
      "author_url": "https://www.google.com/maps/contrib/105275845067023903938/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUd44gus21rAPIqnJxEkCNjvye9tAVXVewprZ-mRujV-je5Veevug=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "Wells Collective presents itself as a charming, child-friendly and pet-friendly cafe, which is always a plus for families and pet owners looking for a welcoming spot. The ambiance is warm and relaxed, with plenty of seating options to accommodate both kids and furry friends.\n\nWhen it comes to the food, it’s decent, though not particularly remarkable. The menu offers a variety of dishes that cater to different tastes, but nothing truly stands out as a must-try. While it serves its purpose as a casual dining spot, it may leave foodies wanting more in terms of flavor and creativity.\n\nThat said, the service is friendly, and the environment makes it a pleasant place to unwind. If you’re looking for a cozy cafe to hang out with your kids or pets, Wells Collective is worth a visit. Just don’t set your culinary expectations too high.",
      "time": 1736488295,
      "translated": false
    },
    {
      "author_name": "MH Tham",
      "author_url": "https://www.google.com/maps/contrib/112376174358198242550/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXJ4tOLbvkkJYRe2LZw4PmTrCsbezMPVke50H01b6T0gSd095fp=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "I have visited Well Collective several times over the years for its pleasant ambiance and generally good service.\n\nHowever, the food often falls short. Flavours clash or are overpowered by a single ingredient. For instance, the smoked salmon sando is overwhelmed by sweet jam and tamago, while the salmon itself lacks any real smokiness, despite the generous portion. It’s a shame, as the ingredients are fresh and full of potential.\n\nThe same issue applies to the alcoholic drinks, which taste rather disjointed. The Baileys mocha, tasted like mocha with a splash of Baileys, lacking depth or cohesion.\n\nDesserts are the best of the lot, though flavours lack complexity and are literally the ingredients showcased in the menu, put together on a plate.\n\nPrices are reasonable, though some may find it not worth the cost. Still, I hope Well Collective improves, as it is a lovely, pet-friendly cafe with great potential.",
      "time": 1743592487,
      "translated": false
    },
    {
      "author_name": "Nic",
      "author_url": "https://www.google.com/maps/contrib/103904891546165224811/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIZnNgPk4O0lEOo-45J2_8K0XMwk092dI7p0Vu1Cb4DtQKw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 weeks ago",
      "text": "Tried a range of dishes and they were all great.\nThe dessert portions were generous as well, which helps justify the prices.\n\nThe dog food served was also cooked, unlike quite a few other places.\n\nWe really appreciated the staffs' efforts to cater to our request as well (surprise birthday message).\n\nService was great too. Well worth the trip.\nOne can easily enjoy here both the cafe and pet-friendly parts of this establishment.",
      "time": 1745653088,
      "translated": false
    },
    {
      "author_name": "Nash ki",
      "author_url": "https://www.google.com/maps/contrib/104320437175051524313/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJRHZWxBnSv8xsoLbdnnBO_yPg9v7UezQ9yrkhfc-GuMzjL-g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Went there for dinner on New Years Eve and it didn't disappoint. The interior gave a very modern and minimalist Bali vibe. It's very cozy too.\n\nStaff were efficient and courteous. Ordering process were seamless and like other food establishment, they used qr code ordering method which was convenient and saves a lot of time.\n\nFood arrived fast and hot. We ordered tofu Tempe fries with wasabi mayo to share. Very simple yet delicious. Seems like a weird combination of wasabi mayo and tofu Tempe but I love it.\n\nWe ordered 4 mains and mine is beef curry rice. Very rich and beef is tender. Barramundi with miso sauce were fresh and no fishy smell. Miso yuzu sauce complement the barramundi fish perfectly. Mentaiko pasta and medium rare steak were perfect too.\n\nAs for dessert, we chose creme brulee Shibuya toast. We devour it in minutes.\n\nShout out to the manager on duty that day, Wanqi tracy, for ensuring our food arrived in timely manner and multitasking.",
      "time": 1735895825,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6798654701778397901",
  "user_ratings_total": 366,
  "vicinity": "Blk 418 Northshore Drive 02-11/12, 418 Northshore Drive, #2 Northshore Plaza, Singapore"
}