{
  "formatted_address": "4 Toa Payoh Industrial Park, #01-1345A, Singapore 319056",
  "geometry": {
    "location": {
      "lat": 1.3357464,
      "lng": 103.8613922
    },
    "viewport": {
      "northeast": {
        "lat": 1.337192930291502,
        "lng": 103.8626257302915
      },
      "southwest": {
        "lat": 1.334494969708498,
        "lng": 103.8599277697085
      }
    }
  },
  "name": "Western Casket 威士登长生店",
  "place_id": "ChIJscmgqXAX2jERLIjsfWIGYmA",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Goh Juat Kin",
      "author_url": "https://www.google.com/maps/contrib/111734209322213974520/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ9-LGHdFCijG_JzARoqV22lXQR2q2MpJnAZDTE4d84IPhxaA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "My family & I would like to express our heartfelt appreciation to Mr Ang & his team at Western Casket (Ang Chin Moh Group) for their excellent wake/funeral arrangements during our recent bereavement. Our brother had passed on peacefully on 7 Apr 25 and we had engaged Western Casket and chosen the Freethinker Honour Package for his last rites.\nThe Western Casket team was very  professional and  dedicated. They willingly accommodated our request for adjustment to the tentage setup. They were also very transparent about costs and did not try to \"hard sell\" things/services that were not needed. We liked especially the team's thoughtful suggestion to use the beautiful flowers from the flower wreaths to decorate my late brother's casket and for family members to use and hold the potted flowers (from the tables)  as a mark of respect, love and blessings as his cortege left for Mandai Crematorium and to bring them (potted flowers) there for his last rites.\nMuch thanks 🙏🙏🙏.",
      "time": 1745217095,
      "translated": false
    },
    {
      "author_name": "Ed Art",
      "author_url": "https://www.google.com/maps/contrib/117656366858348840863/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWA0XqxO57fOKAdrG-hiTq16MI5dnJsjpQSDBcyLZ0byD8XMPzy=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Funeral Director, Vam Pick was calm and assuring at a time of struggle. He walked us through the whole funeral arrangement process. His thorough arrangements allowed us peace to mourn.\n\nWestern casket made our shocked loss more bearable as they handled everything smoothly and with empathy.\n\nThank you for being so patient with us in our time of loss. Bless you Vam and Western Casket for your service.",
      "time": 1732437222,
      "translated": false
    },
    {
      "author_name": "Lay Lay Lim",
      "author_url": "https://www.google.com/maps/contrib/103773041530529028093/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIYOj6P929POpZciAOiVm2RNUg9AQPmujk4pJneTi8Q9MsZdg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "Our mama was very pleased with the level of professionalism and efficiency provided by Western Casket. They took great and awesome care for the final journey of her beloved husband of 64years. Their attentiveness to the smallest detail gave us time to grief without worrying that we might possibly overlook major customary matters.\n\nOur mama liked how they did the entire setup for our papa's wake in the most respectable manner - clean fresh curtains, properly layered huge panels of pristine clean blue carpet, presentable tables aesthetically covered in double layers of grey over white table clothes. Chairs were clean and sturdy. It certainly comforted our mama that our late papa was given the best funeral services as he returns home to God's kingdom.\n\nOne incident of how Western Casket came fast to our rescue. We were desperately looking for Christian hymns to be played during the procession and at the burial ground. Their staff, Benedict, quickly assisted us in pulling out the songs from Spotify in his HP. He had the hymns played over the speaker they provided us with.\n\nWhatever we could possibly think of, they have already been thought of by Western Casket. Thank you, Western Casket, for being so dependable. We can safely put our trust in them.\n\nA big shout out to Ang Zi Qian - he attended to us in the wee hours upon our papa's passing. He listened. He was patient. He promised to give our family a good funeral service for our wonderful late father. He did.\n\nWe will definitely,  by word of mouth, recommend any bereaved families to Western Casket. It is THE ONE to go to.\n\nTo Western Casket - we are in gratitude.\n\n(Our beloved father was buried at 4pm, today, 15May2023, almost 6hrs ago.",
      "time": 1684410225,
      "translated": false
    },
    {
      "author_name": "Clarence Chiang",
      "author_url": "https://www.google.com/maps/contrib/115829357344911217958/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI2nOyOj_h3DGpd4LuysQbL5np2mKyXECEOu0JcQJefPxM5ew=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I had a great experience with Western Casket and in particular Vem Pick who answered my call some time past midnight. He was patient and professional throughout and guided me through the whole process very smoothly. Keep up the good work and thanks for everything!",
      "time": 1743813795,
      "translated": false
    },
    {
      "author_name": "Leroy Ang",
      "author_url": "https://www.google.com/maps/contrib/106802596298986141809/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKlTmCox3KQk_2nQ_jWbOCss1iBMaPLrBL5WlZrZzBY39wj1g=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "The response from the co-ordinator was swift, simple and hassle free.  As our wish was a Direct Cremation, there are lots last minute booking of cremation time and scattering ashes.  I like what the team has arranged for us - a family private time before the cremation.  It was beautiful.  The team did excellent job.",
      "time": 1737853321,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6945120595447941164",
  "user_ratings_total": 25,
  "vicinity": "4 Toa Payoh Industrial Park, #01-1345A"
}