{
  "formatted_address": "10 Telok Blangah Green, Singapore 109178",
  "geometry": {
    "location": {
      "lat": 1.278877,
      "lng": 103.813289
    },
    "viewport": {
      "northeast": {
        "lat": 1.280198480291502,
        "lng": 103.8147861802915
      },
      "southwest": {
        "lat": 1.277500519708498,
        "lng": 103.8120882197085
      }
    }
  },
  "name": "Wildseed Café at The Alkaff Mansion",
  "place_id": "ChIJX7mN2wwb2jERmHzuEpJh7g8",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Kenny Soo",
      "author_url": "https://www.google.com/maps/contrib/111546337541949532149/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW953VNA5PdwLfGl5U-FHPYiq0NGubNZYFIfzT9LHQb4N2ibUI-=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "I’d like to share some feedback regarding my recent order of the Soft Shell Chili Crab Pasta.\n\nI’ve been a regular customer and have ordered this dish many times because I really enjoy it. Each time, the portion of soft shell crab has always been a full piece. However, during my most recent visit on the 9 May 2025, I was served only half a portion, which was quite disappointing—especially considering the dish is priced at $30.\n\nWhen I raised it with the staff, I was told that this is the standard portion. I found this surprising, as my previous experiences have consistently included a full soft shell crab.\n\nServing only half a soft shell crab at this price point not only feels misleading, but also gives the impression that the restaurant is cutting corners—something I wouldn’t expect from an establishment of your standard. The presentation of the dish with just half a crab honestly made it look a bit cheap.\n\nIf I were a first-time customer and received a dish like this, I likely wouldn’t come back or order it again. I’ve attached a photo of my order for your reference—it honestly looked quite disappointing. I hope this can be looked into, and I appreciate your attention to maintaining the quality and consistency your regular customers value.",
      "time": 1747114143,
      "translated": false
    },
    {
      "author_name": "Richard Lau",
      "author_url": "https://www.google.com/maps/contrib/101673940051100677706/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWeVJ90s4rBMg6O2G99ew_ldsaGSHhfgcF6aliFTJ-GHXrjKHVrmg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Wonderful place for a brunch which is pet friendly! I brought my dog to come to have a walk at Henderson waves, then ends with a brunch here. They have indoor and outdoor area. The outdoor area is sheltered, so I don’t feel too hot with my dog sitting outside together. They have pet snacks available here too. Must try the special kaya toast with poach egg. The chicken wing is very delicious too! For the drink, try the wild seed flower coffee, with a hint of flower petal taste. They have colouring paper for children here too, so parents can enjoy themselves better.",
      "time": 1740897791,
      "translated": false
    },
    {
      "author_name": "Grace Ann Franklin",
      "author_url": "https://www.google.com/maps/contrib/110903110726524148472/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW6_EapxL2pc8jQGb69kffTccuyjLvgRij2gU6Ol98HcmIryYg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "What a gem! This cafe is your brunch dream place! Great food selection, wonderful and friendly staff, and lovely outdoor seating. The avocado toast was delicious and don't skip on dessert! The strawberry shortcake was amazing! We'll definitely come back here again!",
      "time": 1735617100,
      "translated": false
    },
    {
      "author_name": "Jin L",
      "author_url": "https://www.google.com/maps/contrib/111989888697449964494/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVqDqDwnEDtanf87xsbOu576VbLyIYPXjN3yMWOxDr3GH3K7UGRog=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "A place I went to by chance while searching and wearing high heels without thinking. Friendly service, beautiful building in perfect nature. It was a pity that the meal was available from 5 o'clock. However, I was satisfied with the Shangri mock-cocktail and chocolate cakes. I will visit again to try other menus. Oh, the fork was so impressive. It was surprising how long it was, but it was comfortable to use.",
      "time": 1740911897,
      "translated": false
    },
    {
      "author_name": "Reina Ng Sekiguchi",
      "author_url": "https://www.google.com/maps/contrib/108301221486235948012/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV6YKVsP0QJY7VcmWVm81njq3xCIsKeFiOd7hfN7HORnCrbGknDoA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Thank you to the kind staff and chef who attended to my request for gluten free options patiently, and coming up with solutions such as the salmon eggs ben in the photo. The restaurant also gave a complimentary slice of birthday cake, and happy birthday light box message for photo taking! Great place to chill and have celebrations. Will definitely come back.",
      "time": 1744069999,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1147962235036794008",
  "user_ratings_total": 2942,
  "vicinity": "10 Telok Blangah Green"
}