{
  "formatted_address": "Mosque St, #8A, Singapore 059488",
  "geometry": {
    "location": {
      "lat": 1.2840515,
      "lng": 103.8442095
    },
    "viewport": {
      "northeast": {
        "lat": 1.285424380291502,
        "lng": 103.8456135802915
      },
      "southwest": {
        "lat": 1.282726419708498,
        "lng": 103.8429156197085
      }
    }
  },
  "name": "Wink @ Mosque Street",
  "place_id": "ChIJhRfsUHMZ2jERk4TeSNwDH8w",
  "rating": 4.2,
  "reviews": [
    {
      "author_name": "Faith Sombilla",
      "author_url": "https://www.google.com/maps/contrib/109250497938728414685/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUYHMM_uZQAq2o9uL28-xXy1N-zggly5XCS64-KW-YyRp10h3Ob=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "I stayed at this hotel from May 7–12, 2025, and arrived around 2 a.m. Check-in was smooth, especially since I had filled out the registration form in advance. Even though it was late, the staff were quick to open the door and assist me.\n\nThe location is right in the heart of the city—just a 3-minute walk to the metro and 2 minutes to the Chinatown Night Market. If you’re into buying souvenirs for friends and family, Chinatown Point Mall is also nearby, right next to the metro station.\n\nIt was my first time staying in a female capsule pod, and overall, it was a good experience. The other guests were respectful and quiet, which made for a peaceful stay. I’m quite particular about cleanliness, especially when it comes to shared toilets and shower rooms, and this hotel exceeded my expectations. The facilities were spotless—I really have no complaints in that area.\n\nBreakfast is simple but convenient, with unlimited bread, spreads, coffee, tea, milk, and chocolate drinks available from 7–10 a.m.\n\nI also want to highlight how accommodating and helpful the staff were. They were always available when needed and spoke excellent English, which made communication easy.\n\nOverall, I would definitely recommend this hotel for solo travelers looking for a clean, safe, and well-located stay in Singapore!",
      "time": 1747215768,
      "translated": false
    },
    {
      "author_name": "Nathan Jackson",
      "author_url": "https://www.google.com/maps/contrib/111174749491452591302/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU0aO_LK1baEJ3z5n6DSKSorzHq7VFskVGNCJCMW3W3oUJVv3DM=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "I stayed here for a week when I was visiting the city. The location is super convenient, being really close to the Chinatown MRT station, and also only a couple hundred metres from Maxwell MRT station too.\n\nGetting into the hostel requires steps, which was ok as I didn't have a lot of bags. Slippers are required indoors, and I brought my own as they will not provide them for you and I didn't want to go barefoot inside.\n\nMy capsule was a top bunk, which was difficult to get into as there is a large step up to get over the storage lockers, and only one set of stairs was provided per room. The bed was fine, but the AC does not reach into the top bunks making it very stuffy in there with the curtains closed.\n\nThe bathrooms were fine, but also got really humid as there is no AC there. The laundry was unavailable which was a massive inconvenience as it cost me $15 SGD to use a laundromat to wash my clothes.\n\nThe requirements to wash your own cutlery and plates is silly when only cold tap water is provided, without using the hot water unit. No dishwashing liquid is provided either, just soap.\n\nThe breakfast consists of toast and cereal, with instant coffee. I didn't try it at all.",
      "time": 1744620479,
      "translated": false
    },
    {
      "author_name": "Hannah Jobe",
      "author_url": "https://www.google.com/maps/contrib/117629297068139486448/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUMriCIBsWypqzfAsYVVvHt7lZPErI8uWaXOr_ntQUJAcTaKy0=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 weeks ago",
      "text": "This was my first experience staying in a hostel and it was definitely worth it. The receptionist was helpful to make sure I could find my way around.\n\nI was a little nervous about booking a capsule style hostel because I don’t like small spaces, but the capsule was pleasantly spacious. The room was very quiet and I was able to sleep well, though I missed the eye mask I lost on the plane because I could see the room light over the top of the curtain.\n\nI discovered by accident that it was a street over from the China Town street market with a lot of shopping and food options.",
      "time": 1745250211,
      "translated": false
    },
    {
      "author_name": "Pat Warburton",
      "author_url": "https://www.google.com/maps/contrib/104948525696946287733/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIph3HPLU7lzUz9uA2QDvx0J8bblshlkDECf9s_I7tlpJ-kEg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "I enjoyed my stay at Wink @ Mosque very much.  The location is great - 2 minutes from the MRT station.  The rooms were clean, the beds comfortable and the water hot!  Staff was friendly and very helpful.",
      "time": 1746775986,
      "translated": false
    },
    {
      "author_name": "Laurence Bevan",
      "author_url": "https://www.google.com/maps/contrib/104854101665057872038/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocK1oGJb18jjS9MUN0VUwIm4Fyym5o92L_a7T3kaGpqMihUW=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "From the point of entrance to wink mosque street\nWas welcoming and quick when I arrived at 12am.\nThe room was excellent as was the bed.\nIt’s a perfect place to stay in Singapore.\nThe bathroom/toilets were also clean…\nThoroughly recommend wink in mosque street,\nSingapore.",
      "time": 1741881090,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14708479152665560211",
  "user_ratings_total": 683,
  "vicinity": "Mosque Street, #8A"
}