{
  "formatted_address": "55 SERANGOON NORTH AVENUE 4 S9, 55 Serangoon North Ave 4, Building, #06-07, Singapore 555859",
  "geometry": {
    "location": {
      "lat": 1.3770254,
      "lng": 103.8747438
    },
    "viewport": {
      "northeast": {
        "lat": 1.378266730291502,
        "lng": 103.8760873802915
      },
      "southwest": {
        "lat": 1.375568769708498,
        "lng": 103.8733894197085
      }
    }
  },
  "name": "With Love Yumi",
  "place_id": "ChIJixYm6FQ92jERhpx4U40AEls",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Siti Rauzaanah",
      "author_url": "https://www.google.com/maps/contrib/116071114837155642025/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVfq_-yVYKDi7D88GvYY4HByfmqOIyXbpu31Z4kc1yagWdhm5JZWA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I cannot recommend With Love Yumi enough! They went above and beyond to ensure I felt my absolute best on my wedding day. From start to finish, my experience with them has been nothing short of exceptional.\n\nThe journey began with Amelia, who handled my initial sign-up and made the process smooth and welcoming. During the fittings, El and Adawiyah were incredibly patient, attentive, and helpful, making every visit to their studio enjoyable and stress-free.\n\nOn the wedding day itself, I had the privilege of being dolled up by Kak Yumi, who brought her expertise and passion to every detail. Assisting her was Kak Shidah, who skillfully helped me with my hijab. Both of them stayed throughout the event to ensure everything was perfect. Their professionalism, warmth, and attention to detail were truly remarkable.\n\nI absolutely loved how I looked on my big day and received countless compliments from friends and family. It was such a confidence booster to know I was in such capable hands.\n\nIf you’re looking for a bridal team that genuinely cares and delivers exceptional results, With Love Yumi is the one. Thank you, Kak Yumi and team, for making me feel like the most beautiful bride on my special day!",
      "time": 1732626601,
      "translated": false
    },
    {
      "author_name": "Nadiah Mazlan",
      "author_url": "https://www.google.com/maps/contrib/106811995419997737888/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXkPLRyo4Y1qQZBWN0uD3EPXU1D9JUC3lok80zuVv0lxDFsTpaS=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "I cant believe it’s already been 6 months since my big day 🙈 I had the absolute pleasure of having Kak Yumi as my makeup artist for my wedding in June, and I cannot express how thrilled I was with the results. From our initial consultation to the day of the wedding, With Love Yumi’s Bridal was nothing short of amazing. Their professionalism, attention to detail, and warm personality made the entire experience enjoyable and stress-free.\n\nDuring our consultation, WLY’s team took the time to understand my vision, skin type, and preferences. They provided excellent suggestions and helped me choose the perfect look that would complement my dress and overall theme. On the wedding day, Kak Yumi & Kak Fifie arrived promptly and brought a calm, reassuring presence, which was much appreciated amidst the pre-wedding excitement.\n\nThe makeup application process was meticulous and thorough. Kak Yumi used high-quality products and techniques to ensure my makeup would last all day and look flawless in photos. They paid close attention to every detail, from perfectly blended foundation to beautifully defined eyes and lips. The end result was beyond my expectations—I felt like the most beautiful version of myself.\n\nNot only did my makeup look stunning, but it also stayed impeccable throughout the entire day and night, despite all the dancing and festivities. I received countless compliments from my family, friends, and even strangers! The makeup looked natural yet glamorous, enhancing my features without feeling heavy or overdone.\n\nIn addition to their incredible skills,Kak Yumi was an absolute joy to work with. Their friendly demeanor, patience, and ability to make me feel comfortable and confident made a world of difference. They went above and beyond to ensure I was happy with every aspect of my look.\n\nI wholeheartedly recommend With Love Yumi’s Bridal to anyone in need of a makeup artist for their special occasion. Their talent, professionalism, and dedication to their craft are truly unmatched. Thank you, Kak Yumi, for making me feel like a princess on my wedding day. I am forever grateful for your amazing work and the wonderful experience you provided.",
      "time": 1736613236,
      "translated": false
    },
    {
      "author_name": "Liyana Nur",
      "author_url": "https://www.google.com/maps/contrib/110570678273649642633/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJpnvZ6IRIGJ-MUmNhYnt6y1PNQzoXGyWXMsdSIv-Bodaq_Tw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "I couldnt thank enough to Kak Yumi and Kak Aina for dolling me up on my special day. Both had made me feel the prettiest that I could ever feel in my entire life. Felt so sad to remove the makeup and especially to return the beautiful gown. The details, the fitting, the colour- everything is perfect from top to toe!\n\nThank you both so much and you both are definitely the best of the best!",
      "time": 1734506334,
      "translated": false
    },
    {
      "author_name": "Sue Abdullah",
      "author_url": "https://www.google.com/maps/contrib/112488760392783515229/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUd7mz7mmXdthJk1_UW4OxWEh09xLBqx_BFN2szo2QnxhqXbPB6=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "It's been almost a month since my wedding, but this is worth a shoutout!\n\nThank you to WLY team for the impeccable service from day one when I booked you till my big day. I knew from the get-go that I will be in good hands of the team’s operations and without a doubt Yumi's magical touch to make me feel beautiful inside and out. Truly I made the right choice even without 'shopping' for other bridal houses.\n\nFelt even more blessed to be the first bride to be dressed in one of WLY x Teh Firdaus gown collection. And the songket, the intricate details and colours matched my outdoor nikah theme perfectly.\n\nI'm still super amazed and wished I can repeat those moments where WLY made me feel like the most beautiful bride in the world! Kudos to the team and I wish you all success!",
      "time": 1739514476,
      "translated": false
    },
    {
      "author_name": "Mohamed Fadhil Mohamed Soffe",
      "author_url": "https://www.google.com/maps/contrib/103846238484344180917/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocInmmhfsrK3bz6eRPgabq_4Awhrb28v-eALs_Xb2aNysZk7bQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "5 months ago",
      "text": "Love Suha's make up look!! The perfect look would not be possible without her and I was so lucky to have her as my make up artist! All the make up looks for all 3 outfits matched exactly what I envisoned ",
      "time": 1732588351,
      "translated": false
    }
  ],
  "types": [
    "clothing_store",
    "school",
    "store",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=6562308214023036038",
  "user_ratings_total": 23,
  "vicinity": "55 SERANGOON NORTH AVENUE 4 S9, 55 Serangoon North Avenue 4, Building, #06-07, Singapore"
}