{
  "formatted_address": "Jalan Medini Selatan 2 Medini Zone F, Bandar Medini Iskandar, 79250 Iskandar Puteri, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.3953442,
      "lng": 103.6252899
    },
    "viewport": {
      "northeast": {
        "lat": 1.396687530291502,
        "lng": 103.6266058802915
      },
      "southwest": {
        "lat": 1.393989569708498,
        "lng": 103.6239079197085
      }
    }
  },
  "name": "X Park Sunway Iskandar",
  "place_id": "ChIJBd3RtlIJ2jERWwDVUL3K0MU",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Gator",
      "author_url": "https://www.google.com/maps/contrib/114331842318070680564/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUf5N0YPQocYYralVhzxgKqHfnlJgSiXhs54DUya0oFIumc-54QVA=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "X Park Johor offers a great variety of lake activities, making it an exciting destination for adventure seekers and families alike. The well-maintained lake provides a scenic and refreshing setting for outdoor fun, with options ranging from kayaking to paddleboarding.\n\nFor those who enjoy a more relaxed experience, pedal boats and fishing spots are available, allowing visitors to take in the natural surroundings at a leisurely pace. The staff are friendly and helpful, ensuring safety measures are in place while guiding beginners through the activities.\n\nThe park’s atmosphere is lively yet serene, making it a great place to unwind or engage in water activities. While some activities may come at a higher price, the overall experience, coupled with the well-kept facilities and stunning lake views, makes it well worth the visit. Whether you’re looking for an adrenaline rush or a peaceful day on the water, X Park Johor’s lake activities offer something for everyone.",
      "time": 1740587221,
      "translated": false
    },
    {
      "author_name": "Jitya M.Topaz",
      "author_url": "https://www.google.com/maps/contrib/106544907846751999334/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUJsjq1F5SWelK8chw6zt1-ZTLCNDkuMf8emEhgHDLEixzrkUC4-A=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "8 months ago",
      "text": "We decided to explore X-Park Sunway at Iskandar, where we tried the go-kart and ATV activities.\n\nBefore our visit, we reached out via email to inquire about the weather conditions and whether we needed to make reservations for specific activities. They informed us that walk-ins were fine, so we went ahead without booking in advance.\n\nUpon arrival, we booked a 10-minute go-kart session, which I highly recommend if you haven’t tried it before. However, we were only able to get an ATV slot at 6:30 pm, even though we arrived around 4:00 pm. The wait was quite long, and we were disappointed because, despite contacting them earlier, they didn’t mention anything about time slots or the schedule for ATVs. It would have been helpful if this information had been provided upfront.\n\nAnother issue we encountered was with our group, which included a few plus-size friends. The counter staff didn’t inform us that, due to size considerations, we would need to take single ATVs rather than sharing a double ATV. This information was only shared once we reached the ATV location. It would have been much clearer and more convenient if the counter staff had communicated this earlier. There seems to be a gap in communication between the front desk and the ATV staff, which could be improved.\n\nDespite these issues, the place is enjoyable, and it has the potential to offer even more sports activities. Would I return? Yes, I would definitely consider coming back, and I hope they take some of my feedback into account to improve the overall experience.",
      "time": 1725946375,
      "translated": false
    },
    {
      "author_name": "Juffrey",
      "author_url": "https://www.google.com/maps/contrib/106747231694663034308/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUoloh0cvx4SWg7EwAmFl2hLAKNxzDTdu2dMXZN7PZWJYBnNFYe6A=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We came at 930am. 30 mins before opening hours able to get 2 slots without waiting. The go-karts and tracks are well maintained and safe.",
      "time": 1744945907,
      "translated": false
    },
    {
      "author_name": "Mecha Griffin",
      "author_url": "https://www.google.com/maps/contrib/113909864273986916028/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWZpR6kkagcK2fwPMjOjHFc-TBf_GfWIhuZtTOn-P9m1mS_KDM=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "I rate X Park Sunway five stars, but you have to be aware that my ratings are odd: I rate things based on whether \"I would change anything about this\" rather than \"Is it the best version it can be?\" Given that I've got no complaints about this place, it's a five. My criteria factored in equipment condition, ease of communication with staff, price structure and quantity-quality of activities. The most boring thing ever would be anything equivalent to staring at the TV in the hotel for 2 hours, and this one surpasses it by a huge margin. I didn't have to know Malay to communicate with 70% of the staff members, and most of them are friendly plus helpful, they know their stations, and they carry it out satisfactorily. I've seen worse and dirtier equipment, and none of them seem to pose a safety hazard, so it's a five on that front too. I think the price was reasonable enough, I didn't do exact calculations, but I expected to pay about 600-700 Ringgit for five activities. I came in a party of three people. The activities I partook in was: ATV, Go-Kart, Paintball, Archery and the EV Boat Ride.\n\nI can't speak for timing and customer capacity, as I went on a Sunday morning during a period with no school holidays (April), so your experience may vary.\n\nI witnessed disagreement between a customer and the staff over certain regulations, and I was affected, asked to wait aside while they resolved it. To compensate me, they gave me more time on the Go-Kart course, which I appreciate.\n\nI would bring more friends here next time for the paintball game.",
      "time": 1745146029,
      "translated": false
    },
    {
      "author_name": "Chrisilvia Keith",
      "author_url": "https://www.google.com/maps/contrib/111047508137350014987/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVOlaSQDTvPlQcuiqNgVNhSr22LHvAyLN1tFMgKtdjTPcfAGNLO7w=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "There are 2 futsal courts and few pickle ball courts here. Ventilation is good, just that fans are not enough. Can be quite hot during sunny day even if it’s under the roof.",
      "time": 1743940263,
      "translated": false
    }
  ],
  "types": [
    "amusement_park",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14254115735081386075",
  "user_ratings_total": 883,
  "vicinity": "Jalan Medini Selatan 2 Medini Zone F, Bandar Medini Iskandar, Iskandar Puteri"
}