{
  "formatted_address": "653 Punggol Dr., Singapore 821653",
  "geometry": {
    "location": {
      "lat": 1.3979671,
      "lng": 103.9193401
    },
    "viewport": {
      "northeast": {
        "lat": 1.399194380291502,
        "lng": 103.9206009802915
      },
      "southwest": {
        "lat": 1.396496419708498,
        "lng": 103.9179030197085
      }
    }
  },
  "name": "Xin ji Congee (Punggol)",
  "place_id": "ChIJ_5pKLgA92jER8-ebzSucwks",
  "rating": 4.8,
  "reviews": [
    {
      "author_name": "Doraemon",
      "author_url": "https://www.google.com/maps/contrib/112665277904119154671/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX2VSCcaT9axvOwx2nD8XD3PgZ8V5VFnv420aocMSfLa6GlcEmN=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Kitty and I were in the mood for some comforting porridge and decided to give Xin Ji Congee at Sengkang River View a try. It's a new store that recently took over the Kway Chap stall, and we were curious to see what they had to offer.\n\nWe were immediately impressed by the quality of the frog porridge.  We ordered a pot for three frogs, which came out to $22, and a pot of plain white porridge for $3.  The frog porridge was absolutely delicious! The frogs were so meaty and tender, and the broth was flavorful and perfectly seasoned. Kitty was especially impressed by the spices and the broth.  She said it wasn't too spicy or too salty, and she loved the sauce.  She was singing praises about the store and said she would definitely come back again for more.\n\nSeeing Kitty enjoying the frog porridge so much, I decided to let her have the rest of the pot, and she happily gobbled it all up! The lady and the guys tending the store are also very friendly, adding to the positive atmosphere. And this coffee shop is a vibrant, clean and neat, and more importantly, it is very windy, making the whole dining experience very pleasant.\n\nOverall, we had a fantastic meal at Xin Ji Congee.  The frog porridge was outstanding.  I'm giving Xin Ji Congee a 5-star rating. The delicious frog porridge, the reasonable prices with quality, the friendly staff, and Kitty's glowing recommendation make this a place we'll definitely be returning to.",
      "time": 1739191050,
      "translated": false
    },
    {
      "author_name": "Mark Heng (Infosphere)",
      "author_url": "https://www.google.com/maps/contrib/102479625642210396540/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU0SVczwTJ6KtYmF9O8ozf74Prm2VScp4QTg-P6ZVnaY90SxgVX=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "Visit date: 15 Feb 2025\nActual review points: 4.5\n\nIf you've ever been under the weather, esp with cough and a sore throat, and wished you could find comfort food like #PorridgeOrCongee, you might wanna bookmark this! 😄\n\nI mean, when you're sick, who wants to deal with lousy tasting cooked porridge from most food stalls out there, which would worsen the already low spirits?\n\nLuckily for me, I'd managed to locate a more than decent stall at Kovan hawker centre and have been a customer for many years, even when I'm not ill 😂\n\n(However, the stall jacked up prices again quietly just this CNY period, making their congee even less affordable! They're no longer my go to place lol)\n\nSo today's new find at Punggol East is gonna delight fellow neighbours and those at nearby Sengkang East Drive/Way 👍\n\nThis new* stall at the corner HDB coffeeshop near the golf driving range surprised with delectable congee! 😋\n\nMy usual is to go for the \"white\" version when not well, i.e. sans you tiao, no oil and no fried shallots. Minus the egg too if that irritates the throat.\n\nWhat I had was smooth congee that's just a little gooey, still piping hot and slightly salty. The pork slices were tender and tasted great; and there were bits of minced pork in the bowl as well.\n\nAs an added bonus, this congee stall sells frog meat cooked in clay pot, plus other dishes. So you might find yourself visiting more often, not necessarily just when you need comfort food 😜\n\nNote: Teochew people will like well cooked porridge with soft rice grains still discernible (see photo of said porridge I just cooked for tonight's dinner 😆)... but that usually is prepared at home as virtually no one sells it outside as comfort food (which is eaten with pork floss, bak kwa, salted egg, kiam chye, etc) 😋\n-----\n\n*A terse review on the side of the other stalls...\n\n#MHTamChiak noted that this kopitiam has seen a few stall changes since it opened!\n\n∆ Xin Ji Congee is new, replacing the kway chap stall.\n\n∆ The fish soup biz had folded (as expected) but the replacement noodles shop is just so so imho.\n\n∆ The still existing (24 hrs) wonton noodles joint also ain't up to scratch, sadly 😭\n\n∆ I reckon the roti prata here is passable, but not their murtabak.\n\n∆ Haven't tried the curry rice stall as they serve mostly deep fried dishes!\n\n∆ The new tze char stall, while serving a wider variety of cooked food compared to the previous biz, is only can do based on my first experience 🤣\n\n∆ No comments on the halal Western and (new) chicken rice stalls.",
      "time": 1739619908,
      "translated": false
    },
    {
      "author_name": "Desmond Ho",
      "author_url": "https://www.google.com/maps/contrib/109759115610546847739/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV5AcdTuMYKw7orVr10F7luNHnr2m-2w9UQJFdzgNqPLt99LN0X=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "My weekly must go-to lunch or dinner.\nI stop going to Chinatown because it's much more savoury and satisfying.",
      "time": 1740575780,
      "translated": false
    },
    {
      "author_name": "Wawa Wii",
      "author_url": "https://www.google.com/maps/contrib/115762649498289235690/reviews",
      "language": "en-US",
      "original_language": "zh",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWdmp9x5IJF8xhBR0PejuSdx4UQ4JxhYU9S_BeiGjj8OWppLHI=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Ordered Ginger Scallion Chicken + Porridge ~ ~ love it... Opens 10am to 10pm (as of now known) Visited as of today 6th March 2025. Thank you guys! Delicious!",
      "time": 1741360344,
      "translated": true
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5459097410273535987",
  "user_ratings_total": 4,
  "vicinity": "653 Punggol Drive, Singapore"
}