{
  "formatted_address": "12 Lor 12 Geylang, Singapore 398993",
  "geometry": {
    "location": {
      "lat": 1.3114895,
      "lng": 103.8780663
    },
    "viewport": {
      "northeast": {
        "lat": 1.312810230291502,
        "lng": 103.8795320802915
      },
      "southwest": {
        "lat": 1.310112269708498,
        "lng": 103.8768341197085
      }
    }
  },
  "name": "YAJU HOTEL",
  "place_id": "ChIJa7DWQDcY2jERMFNLTD7UWYQ",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "ItzMe Harman",
      "author_url": "https://www.google.com/maps/contrib/106435781600355547093/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUr1GvgGCNCu5CGp_5NXh-Won09Dbp-ZA0jgq4lA_EmOoTVLh8=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "I stayed at Yaju Hotel with my family and was impressed by the affordable room rates and excellent service. One of the highlights of our stay was the hotel's convenient location, with easy access to Indian restaurants and local markets. Overall, it offered great value for money, and the service was exceptional.",
      "time": 1738227254,
      "translated": false
    },
    {
      "author_name": "Kamal Preet Singh",
      "author_url": "https://www.google.com/maps/contrib/114342601373444160035/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW24z1-A5EvRZcd6Sp8nWLkgamG6VDrNGNOz2_JSACbjEzu1n7DeA=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "We stayed at Yaju Hotel Singapore for 3 nights and booked the twin deluxe room, and honestly, it was a fantastic experience. The rooms were super spacious—easily enough to fit 4 people comfortably. What really stood out to me was how thoughtful the design was. They had international sockets in the room, so we didn’t even have to bother with converters. This is something even 5-star hotels sometimes miss, so I was genuinely impressed.\n\nThe room also had a huge window that could be opened to let in fresh air (which is such a rare find in most hotels), along with an air conditioner. Free Wi-Fi and a TV were included too, which was a bonus. Every morning, they provided free water bottles, and the cleaning staff was always around and ready to help if you needed the room cleaned, the beds made, or the trash taken out. They were polite and never intrusive.\n\nAnother thing that really impressed me was their check-in and check-out timings. Check-in was at 2 PM and check-out at 12 PM. I can’t stress enough how convenient this was, especially when so many 5-star hotels these days want you to check in at 4 PM and rush you out by 11 AM. It’s those little details that make a big difference.\n\nOn top of all that, they offer free luggage storage for all their guests. This is such a thoughtful touch, especially considering most places charge extra for it.\n\nWhat blew my mind the most was how affordable this place was. It didn’t cost us $$$ per night like you’d expect for such a great experience. Everything from the service to the amenities was top-notch, and it just didn’t feel like we were staying at a budget hotel. I genuinely believe Yaju is a hidden gem and way underrated.\n\nIf you’re planning to visit Singapore and want a comfortable yet affordable place to stay, I highly recommend Yaju Hotel. You’ll save money while still getting an amazing experience—and you can use those savings to explore the vibrant city of Singapura instead!",
      "time": 1738119663,
      "translated": false
    },
    {
      "author_name": "theresa lynn gonzalez",
      "author_url": "https://www.google.com/maps/contrib/113251006095513558000/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUfihT9SHtv874NQyennTy6jq5Cc5C_rMFYCPQT7ofzc7ssQBM=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "Very flexible on check in time.\nVery reasonable price and affordable.\nAvailable on very short notice.\nPaid $150 from 8am-10pm for 4 adults 2 double beds.",
      "time": 1736038614,
      "translated": false
    },
    {
      "author_name": "RITCH FRANCIS",
      "author_url": "https://www.google.com/maps/contrib/110501375623779271724/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVlU7S9vRgS0fUH78-vWxeLP0WeTZZ9gKpjD07jcc38hZj9da5p=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "Rooms and bathroom are very clean. Aircon, water & heater are good. But the room has no dinning table, no microwave and refrigerator. 20minutes walk to the MRT. Lots of good restaurants everywhere",
      "time": 1731251386,
      "translated": false
    },
    {
      "author_name": "Toon Tran",
      "author_url": "https://www.google.com/maps/contrib/102078641965155497930/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWZj_ozK67YD0vUUpBQSjRzrxoJndFacBNmoJa0ee-_aRn9sWCk=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 4,
      "relative_time_description": "6 months ago",
      "text": "Nestled in the bustling heart of Geylang at 12 Lorong 12, YAJU HOTEL proves that good things do indeed come in small packages. Don't let the compact dimensions of the rooms surprise you—these cozy retreats pack a clean and functional punch, with just enough room to swing a cat (figuratively speaking, of course—no actual cats were swung during my stay!).\n\nThe YAJU HOTEL is your go-to spot if you’re after a budget-friendly bed without the unnecessary frills. It’s clean, it’s comfy, and it does the job brilliantly for visitors who need a place to crash after a day of adventure in the Lion City. Let's face it, in a city where space is at a premium, YAJU makes the most of every square inch.\n\nWith its no-nonsense approach, YAJU HOTEL is ideal for the practical traveler who doesn’t mind a snug room. So, if you're planning a short visit and need a place that's as tidy as it is affordable, YAJU has you covered. Dive into the heart of Singapore with YAJU HOTEL—where small is the new big!",
      "time": 1730508713,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9536887049966801712",
  "user_ratings_total": 539,
  "vicinity": "12 Lorong 12 Geylang, Singapore"
}