{
  "formatted_address": "29 Tanglin Rd, Level 1U The St. Regis Singapore, Singapore 247912",
  "geometry": {
    "location": {
      "lat": 1.3055904,
      "lng": 103.825905
    },
    "viewport": {
      "northeast": {
        "lat": 1.307040180291502,
        "lng": 103.8271911302915
      },
      "southwest": {
        "lat": 1.304342219708498,
        "lng": 103.8244931697085
      }
    }
  },
  "name": "Yan Ting",
  "place_id": "ChIJb9RocosZ2jERzYkzsNVyukk",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "bear zucca",
      "author_url": "https://www.google.com/maps/contrib/108431206397580531458/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLiyIR3g4V103H4Ev80P7D_A7fnu8Lf6Bx7F8TkXkTyQ-zXVg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "Every visit to Yan Ting is a top-notch Cantonese dining experience.\n\n✨ An exceptional Cantonese culinary journey\nLocated at The St. Regis Singapore, Yan Ting is one of my top choices for upscale Cantonese cuisine. The ingredients are always fresh, the dishes exquisitely prepared, and every meal has been a thoroughly satisfying experience.\n\n📌 Recommended dishes:\n•\tYellow Wine Braised Chicken Claypot: Tender chicken in a rich, aromatic broth—an absolute must-try.\n•\tCrispy Roasted Pork Belly: Perfectly crispy on the outside and melt-in-your-mouth tender on the inside—truly exceptional.\n•\tVinegar Pork Trotters: Especially loved by the elders in our family—well-balanced sweet and sour flavors, rich in collagen, and deeply flavorful.\n•\tDim Sum Selections: The truffle mushroom dumplings and crystal shrimp dumplings are delicately crafted, both in flavor and presentation.\n•\tCoconut Pudding: Light and refreshing—an ideal way to conclude the meal.\n\n🏛️ The restaurant boasts a refined, elegant ambiance—calm and perfect for family gatherings or festive celebrations. The staff are professional and attentive, making every dining experience a pleasure.\n\n💰 While prices are on the higher side (approximately SGD 100+ per person), the quality absolutely justifies the cost. A place well worth revisiting!",
      "time": 1747058781,
      "translated": false
    },
    {
      "author_name": "Q",
      "author_url": "https://www.google.com/maps/contrib/117965520054989170609/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJhM7C6X9x2D0vBPAP49RYTUIQraO0g0s9qg9OnnC0V7EinHg=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I first visited this place for an ROM lunch. The food was great although they took some time to serve the dishes which led to awkward moments between dishes. This led me to return to try their $168 dim sum buffet brunch (came with tea). As the main dining hall was booked for a wedding reception, we were given the rooms for our buffet brunch. That said, staff was attentive and came to clear the dishes and asked if we wanted to order more. The servings were really small and they gave the exact number of pieces based on the number of pax, which were also great for a buffet because that meant we could try more items. We managed to try almost the entire menu except for the soups, appetisers and dim sum. Would recommend the mushroom truffle dumplings and the radish cake - both of which we would not have ordered if not for staff’s recommendation. Seafood dishes were all pan fried which were a pity, but food was fresh. Do note that the claypot and veggie dishes were huge even if you only order 1 pax portion. Overall, really enjoyed my meal here.",
      "time": 1740914369,
      "translated": false
    },
    {
      "author_name": "Benny T.",
      "author_url": "https://www.google.com/maps/contrib/111773065448350205829/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVp2JYjvUlTxIdN530UqM0NhYI5D_qQvhk-IGuFNtC0pbAh434S7w=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Excellent service from the staff who served us. The food was pretty good, all cooked to perfection. The dim sum, however, was quite ordinary and felt a bit overpriced.",
      "time": 1740389450,
      "translated": false
    },
    {
      "author_name": "TS",
      "author_url": "https://www.google.com/maps/contrib/106276131202764486394/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWvjRR0wEAV9yexD4m8wI0HFmWMlKmMkcgKYtB9sOV6vXLcD2AX=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "3 months ago",
      "text": "During our stay at St. Regis Singapore, we chose to celebrate Chinese New Year at Yan Ting, a restaurant renowned for its prestigious awards and refined Cantonese cuisine. While the overall experience was good, certain aspects fell short of my high expectations, particularly in service and atmosphere.\n\nWhat We Enjoyed:\n- Extensive menu: The restaurant offers a well-curated selection of à la carte and set menu options, catering to different preferences.\n- Quality of food: The dishes were well-prepared and flavorful, living up to Yan Ting’s reputation for fine Cantonese cuisine.\n\nAreas for Improvement:\n- Uncomfortably cold ambience: The indoor temperature was excessively low, making the dining experience uncomfortable. Both my daughter and I felt frozen throughout the meal.\n- Long waiting time: Service was noticeably slow, likely due to the Chinese New Year crowd. However, for a Michelin-recognized establishment, I expected more efficient service management.\n- Service standard: While the staff was polite and accommodating, the overall service quality did not meet the refined standards one would expect from a Michelin-awarded restaurant. Attention to detail and a more seamless dining experience would enhance the guest experience significantly.\n\nFinal Thoughts:\nYan Ting offers elegant Cantonese dining with a diverse menu. However, improvements in service efficiency, temperature control, and overall dining atmosphere would elevate the experience to match its esteemed reputation. If visiting during peak seasons like Chinese New Year, guests should be prepared for longer wait times.",
      "time": 1738331069,
      "translated": false
    },
    {
      "author_name": "Royal Pears",
      "author_url": "https://www.google.com/maps/contrib/108275532362304111934/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI7fWXYs74WHcXX9QkvI86GlbDyQ-pr1RmiDBEiTfZqq38Z6w=s128-c0x00000000-cc-rp-mo-ba7",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Peking duck ($118 for whole) - Excellent. Good that they slice and wrap it for you.\nDouble-boiled abalone consommé, sea whelk, matsutake mushroom ($48 per person) - Good.\nFresh live South African abalone steamed with sliced ginger, tangerine peels ($32 per piece) - Excellent. Tender. The sauce went well with it.\nAsparagus stir-fried with garlic ($26) - Good.\nFried duck with salt and pepper (from Peking duck) - Excellent. Meaty and great flavour.\nGreen dragon stir-fried ($26) - Good.\nFrench turbot fish steamed HK style ($28 per 100g) - Excellent.\nLobster with angel hair pasta and truffle sauce ($48 per person) - Excellent. Meaty and easy off the shell. The truffle pasta went well with it.\nGood service.",
      "time": 1737797842,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5312684972546689485",
  "user_ratings_total": 554,
  "vicinity": "29 Tanglin Road, Level 1U The St. Regis Singapore"
}