{
  "formatted_address": "Blk 226D Ang Mo Kio Ave 1, #01-74, Singapore 564226",
  "geometry": {
    "location": {
      "lat": 1.366795,
      "lng": 103.839176
    },
    "viewport": {
      "northeast": {
        "lat": 1.368342780291502,
        "lng": 103.8404025302915
      },
      "southwest": {
        "lat": 1.365644819708498,
        "lng": 103.8377045697085
      }
    }
  },
  "name": "Yang Shen TCM",
  "place_id": "ChIJXcc5bFYZ2jERfZ0QTg61rxU",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Brigette Kee",
      "author_url": "https://www.google.com/maps/contrib/106278253324776061528/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKwVOVxVWHF-WCUIyDXp1AYHdAWYBmDVsLmPEp1m0S9bZtNEw=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "Consulted Dr. Liu in January and have been taking the Yang Shen tea and Harmony Balance pills. Love both, I am very “heaty” and this helps dispel heat. My migraine and period cramps has improved greatly. The tea also helps me flush out the toxins from night of drinking and junk food.  The new packaging damn chio also !!!!! Recommend!",
      "time": 1629214413,
      "translated": false
    },
    {
      "author_name": "Joan Phua",
      "author_url": "https://www.google.com/maps/contrib/102238892206052329589/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLxi6nNtgLw-DxuiSY_3n-3FxFMKtKDB_2XxYAzNSUYSemsbg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "I would like to take this opportunity to thank Dr Low for her great medical advice and treatment. Under her care and guidance, I have taken following medicines.\n\n1.\tRetreat Life Herbal Tea\n2.\tHerbal Cleanse Capsules\n3.\tHerbal Life Balance Capsules\n4.\tAnti-bacterial and Anti-inflammatory powder\n5.\tYangjin Busui Powder\n6.\tThroat powder\n\nThe above medicines are very effective as they helped to build my immunity and nurse my body system. Some of the areas that have greatly improved include kidney, lower back pain, heavy foot, knee cap, slim down without compromising on diet.\n\nIt takes a while to see the result but for Anti-bacterial and Anti-inflammatory powder, Yangjin Busui Powder and Throat powder, you will see the result after a few intakes. Especially for Anti-bacterial and Anti-inflammatory, Yangjin Busui and Throat powder, they are excellent form of supplements and build body immunity in this current Covid-19 situation. When I returned home and felt something strange in my body, I will make a cup of Anti-bacterial and Anti-inflammatory powder. After that, you will feel that you are back to normal. I strongly believed that this medicine has helped to boost up my immunity which is important in this current pandemic.\n\nAt times, when I have itchy throat or felt discomfort, I will take the Throat powder which relieves me after a while. You will be able to see the result after 1 or 2 intakes.\n\nThe Yangjin Busui Powder has solved my long term lower back pain problem. I also heard from Dr Low that this powder could also cure eczema. So I have started to let my son drink this powder and he feedback that he felt better.\n\nLastly, the best part of these medicines is that you could mix all powder together without worrying that certain types might clash. The medicines are able to complement each other. Therefore, it is very convenient for me to take all these together at one go.\n\nThank you Dr Low for concocting all these great medicines.",
      "time": 1632925875,
      "translated": false
    },
    {
      "author_name": "Serene Yeo",
      "author_url": "https://www.google.com/maps/contrib/102947211377750818756/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLCTMSAC_LOuPAli8ciEwnSPZc6PZpI6WPCtyK-SiJzQtliug=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "My family and I have been using Yang Shen products since 2009.\n\nMy mother is taking both the Yang Shen capsules and herbal cleanse capsules while my myself, second sister, youngest sister and brother in law have been taking Yang Shen capsules, herbal cleanse capsules and tea.\n\nCommon health problems faced by all of us as follows:\nHeadaches\nBack aches\nFatigue\nAnemic\nWeak bladder/kidney\nUlcers in the mouth\nConstipation\n\nAfter taking Yang Shen products can see significant improvement in overall health condition. Seldom get headache and ulcers; bowel improvement and less fatigue; blood pressure, bladder/kidney improve.\n\nMy youngest sister have a 5cm cyst and after taking the Yang Shen capsules the cyst disappeared.\n\nHope to see constant upgrading and expansion of products to treat more illnesses like gout, cancer and covid at the same time keeping prices affordable.  Hope for more promotions and rewards for long term users.\n\nHave been recommending Yang Shen Products to friends and relatives.\n\nSerene Yeo",
      "time": 1629238692,
      "translated": false
    },
    {
      "author_name": "Cath Loy",
      "author_url": "https://www.google.com/maps/contrib/115310706184824463198/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKbmA6vMsGQTVaodaXv4HxKdTGTROGbJuj5SGt1OUsTqYOXyA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 years ago",
      "text": "I have been taking Yang Shen products for more than 6 months. I take the products for stiffness at my feet, general health wellness, and hot flush. My stiffness feet & hot flush reduced 90% and i am now more energetic after taking the products.\nMy health issues have improved significantly. And i have recommended friends and family to try this product.",
      "time": 1629211542,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=1562666668764732797",
  "user_ratings_total": 4,
  "vicinity": "Blk 226D Ang Mo Kio Avenue 1, #01-74"
}