{
  "formatted_address": "322 Hougang Ave 5, Singapore 530322",
  "geometry": {
    "location": {
      "lat": 1.3672362,
      "lng": 103.8969638
    },
    "viewport": {
      "northeast": {
        "lat": 1.368599780291502,
        "lng": 103.8983717802915
      },
      "southwest": {
        "lat": 1.365901819708498,
        "lng": 103.8956738197085
      }
    }
  },
  "name": "Yen Fei Lai Eating House (燕飞来)",
  "place_id": "ChIJE8dTijMW2jERZ6YBxSX5B2w",
  "rating": 3.8,
  "reviews": [
    {
      "author_name": "Leon T",
      "author_url": "https://www.google.com/maps/contrib/112055732544846425678/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWHM7uUCIl058ehFTEwukXrArtBgLWdJ-uocHOTZMLryIFzSBWm=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "8 months ago",
      "text": "I visited this coffee shop for dinner recently with friends and had the Tze char dishes. Ordered a salted vegetable with tofu soup, deep fried tofu with Thai sweet chili, moonlight Hor fun, and omelette with onion.\n\nOverall, the food was pretty ok. Highlight was the portions were huge and food was quite affordable! Not more than $40 for all these dishes in medium portions!\n\nPersonal favourite was the egg :), very crispy and piping hot. The soup has meat inside too, so no extra meat dishes needed.\n\nCoffee shop is quite packed the whole day, mainly senior citizens staying in the neighbourhood. But I like the liveliness here. Tze char stall was very quick in serving - I fact the fastest one I’ve ever encountered so far in SG. But disclaimer - I come around 5plus so maybe few customers then.",
      "time": 1726388247,
      "translated": false
    },
    {
      "author_name": "Jolyn Fang",
      "author_url": "https://www.google.com/maps/contrib/111016364634817490717/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWfOxUyrVuQ_cC83TrCwnc0aZVtLUHUBvpYaY78peeOI8a2_uzc0g=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "8 months ago",
      "text": "Good hawker place in the area.\nVisited a few times..\n1) the bak chor mee stall - love. Lol. Quite legit. Would often tabao/ takeaway.\nThe uncle is also very friendly and jovial.\n\n2) kway chap - shiok. Good portion. They have rice and noodles (with the braised sauce) too. Thoroughly enjoy the big and small intestines, the pig skin and ear. Haha..\n\n3) economy rice stall.. - the ko lo yok is really quite good.\n\n4) the ban mian stall - new addition. Very fragrant. Mom says the soup's good. Can try. :)\n\n5) zi char stall - we had it quite recently..\nThe hokkien mee, aside that its rather salty, its flavourful and rich. Slurpy good. Yangzhou fried rice is okie.\nWe had the sambal sweet potato veg, liked it. Will reorder.\nSweet and sour pork ribs' good. Boneless. A tad too sweet but its fine.\nWe had the crab meat n fish maw soup this time. Wasnt impressive, the flavor didnt come through despite adding vinegar and pepper. Hmm..",
      "time": 1724693896,
      "translated": false
    },
    {
      "author_name": "Ken Peh",
      "author_url": "https://www.google.com/maps/contrib/113975004215945002265/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXSJxn-MN1vy970v-MMcT8F_p28Ghtkh0hnblugxH0puU79a2To=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 1,
      "relative_time_description": "2 weeks ago",
      "text": "Was here for the legendary once every 5 years occurrence of the GE for WP homeground. The atmosphere was simply electrifying and uniquely Singapore. However, the price at the kopitiam is also super uniquely Singapore. I ordered a kopi peng. Normal price at any kopitiam range between $1.60 to $1.80 for a more expensive one. When I was told one kopi peng cost $2 at the counter, I was super turn off. The kopitiam knife bua super lai to tock all those present yesterday night.",
      "time": 1746353291,
      "translated": false
    },
    {
      "author_name": "J.W. Liu (Chris)",
      "author_url": "https://www.google.com/maps/contrib/111727074061055642726/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJLsnQ8KL_EDDOdkYOYpQHHf3Z7VHEZg2oA87xoWcJwRttC2kQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "In my opinion, this is one of the nicer dry Bak Char Mee around the area. The noodles appears to be handmade and has a unique texture. Combined with their sauce 🤤 it’s yummy.\n\nTheir drinks are newly prepared. You could tell with their melted ice.\n\nThe only down side is the coffeeshop has smoking area within. Although the place is well ventilated, you could smell the smoke when there is a change of wind.",
      "time": 1715568168,
      "translated": false
    },
    {
      "author_name": "Irene Tan M X",
      "author_url": "https://www.google.com/maps/contrib/107234303898599875744/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVUDVmrpJq0JycG84Tchs1Qactr0lbYnEksEy1FgU9rKFZHkpE=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "a year ago",
      "text": "☀️ Coffeeshop is popular is the morning hours! Decent variety of breakfast items to go!\n\n🥖 Love the youtiao stalls, esp in the morning, fleshly fried youtiao, sesame ball, butterfly, etc. are sold here.\n\n🍳🥕 Fried carrot cake is a must try here. However, operational time of carrot cake stalls abit unpredictable as an elderly uncle usually mans the stall. Love both their black and white carrot cake.\n\n🍖🍚  Roast Duck, Char Siew, Roast Meat Rice another must try. Rmb to ask stall for more sauce on the rice!\n\n🥙🧅 My always-thought of ordering for home gathering Indian Rojak here, as there’s no other Indian Stalls within vicinity. Though choices of items are limited, but basic ones are still available. Stall will refry items before serving. Roti prata is yummy too! Dough is knead and panfried upon ordering.\n\nPlace has been renovated to be trendy, brighter and fancier!",
      "time": 1713781100,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "store",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7784464421547517543",
  "user_ratings_total": 421,
  "vicinity": "322 Hougang Avenue 5, Singapore"
}