{
  "formatted_address": "100 Ulu Pandan Rd, Singapore 596471",
  "geometry": {
    "location": {
      "lat": 1.321744,
      "lng": 103.779003
    },
    "viewport": {
      "northeast": {
        "lat": 1.323167230291502,
        "lng": 103.7804408302915
      },
      "southwest": {
        "lat": 1.320469269708498,
        "lng": 103.7777428697085
      }
    }
  },
  "name": "yo:HA @ ulu pandan",
  "place_id": "ChIJK5kRJXwa2jERbq3xjGmaA8c",
  "rating": 2.6,
  "reviews": [
    {
      "author_name": "Nicholas Robert",
      "author_url": "https://www.google.com/maps/contrib/107459071018159324919/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI43z_Crh1LEPJmefyA5gbXNWFGKv7b8nz92KCTPApjk-3_MHw=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "10 years ago",
      "text": "yo:HA Ulu Pandan: 0 out of 5 stars\nAbsolutely pathetic. The facilities are dirty, smell bad, and infested with ants. Management is poor, security lazy, cleaning staff ineffective. Rooms are too small and overpriced (3 people to a room, S$550/month in a location out of the way of everything). The cafeteria food is overpriced and unhealthy (a vegetarian will starve here) and the staff rude; no wonder it's always empty. The grounds are barren and dark. Use of the gym costs an extra fee, although this is not stated on the website. EM management should be ashamed. He or she who signs the lease agreement with yo:HA has been scammed. So, if it wasn't clear enough, avoid this place at all costs. I'd rather live on the street.",
      "time": 1415601753,
      "translated": false
    },
    {
      "author_name": "J",
      "author_url": "https://www.google.com/maps/contrib/107162446281103669923/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI98KjzplEGa1AeSO0smWpykwTxSL55B2NcYZPoIC6wfwx9iQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "2 months ago",
      "text": "Don't even think about getting your deposit back.",
      "time": 1742039011,
      "translated": false
    },
    {
      "author_name": "Anthony Falvo",
      "author_url": "https://www.google.com/maps/contrib/101036186809025990517/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVnjtp89dOEq0H_Oh2SGjGqyN-6HqhiNVc9fPPUCV6-mtFaTBYg=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "10 years ago",
      "text": "DO NOT STAY HERE! Yo:Ha @ Ulu Pandan is a disaster of a hostel.  The room size is fine but everything else is terrible.  The air conditioning units spew mold all over your room.  If you do not clean your walls, desk, closet, and clothing every couple days, mold spores will grow on them.  The bathrooms are infested with ants and other bugs.  They clean the bathrooms by spraying everything with a hose.  The moist environment welcomes mosquitoes.\n\nYo:Ha hosts camps and allows these young children to utilize the bathrooms without supervision.  Allowing young children to shower in stalls next to adults is inappropriate.  The children dirtied the bathrooms and used all of the toilet paper.\n\nThe washing machines do not wash your clothes.  Deoderant will still be on your shirts after washing and your clothes will breakdown after a certain number of washes.  They enact rediculous rules and fines.  If you lock yourself out of your room, you can borrow a spare key from management for 5 minutes, run up to unlock your door, and then pay them $10.70.  You cannot have your aircon on when your are gone.  This causes your room to condensate, facilitating mold.  This happens if the rooms next to you leave their aircon on and you have yours off.\n\nManagement does not care about the tenants.  They agreed that no one would enter my room for maintenance without my presence.  They entered my room when I was gone, moved all of my things, and completely disregarded their promise.\n\nYou can get a condo for the same price.  Save yourself the stress and do not stay here.",
      "time": 1428236738,
      "translated": false
    },
    {
      "author_name": "SherlinELF",
      "author_url": "https://www.google.com/maps/contrib/112899736484091024804/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVXBxz5FJ8jmlLX5M60xUBbzFCbCeRQhwJJ75aqe-sPXfIZH58C=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "9 years ago",
      "text": "I am currently staying in Block 3, level 3. I would like to thank both management staffs and cleaners for keeping the environment clean. The corridor, toilet, pantry and even the fridge are so clean. I have never thought that the fridge can be so neat and tidy and it looks new!\n\nBesides, the new cleaner here is so friendly and hardworking, she washed the toilet so many times in one day. I saw her washed the toilet 2 times in the morning, one at 8am, another around 10am or 11am. She also greet and talk to everyone. Whenever I see her, she always smile. Besides, when she is washing the toilet and some students want to use the toilet, she would either quickly finish the washing or let the student use first then she continue to wash.\n\nFurthermore, the management staffs are friendly and efficient too! Especially Ms. Susan, she even accept my feedback during her off day. For instance, last Sunday night there was no electric supply at Blk 3 level 1, my friend informed the security guards but they said have to wait until Monday. Thus, I helped my friend to contact Ms. Susan and she immediately ask a cleaner who was on duty to fix it. Thank you Susan so much for helping us to solve problem even though you are off duty.\n\nBesides that, the management staff are so efficient that I just wrote my feedback before going to school and when I came back from school, the problem is solved. For instance, the lamp in the toilet is spoilt.\n\nIn short, thank you so much for keeping the environment of hostel clean and providing such a good and efficient service to students.",
      "time": 1433949938,
      "translated": false
    },
    {
      "author_name": "Jaime Stella Richardson",
      "author_url": "https://www.google.com/maps/contrib/111234161736112662562/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJT10_F-LfrEZrJjJrxdC1YWLwrrWLbajDuRS9hNtIcQ5kW0A=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "9 years ago",
      "text": "This is worst place i have ever stayed. The staffs especially the manager (susan) is very rude and unfriendly towards their customer. Filthy toilets, extremely small rooms, dirty pantry, basically everything was bad. I really did not expect a developed country as Singapore to have such hostel amenities for their students. Whatever happened to their law and safety measures that they harp so greatly about? this hostel is even worse than one at the third world country. Everytime i enter the toilets, i would just wish this moment would pass by as quickly as possible as the toilets were filthy, smelly and horrible…such a nightmare! They just spray water at the toilets daily without scrubbing them with soap. The first day when we arrive at the hostel, we have made our payments and we presented our payment details to the front desk staff, they just complacently replied that they are not aware of our arrival and hence the room or any documents that need to be signed is not ready. They immediately put the blame on us for not emailing them and informing our date of arrival ( in real fact we have already emailed them all the details with the payment evidence and also details of our arrival). Guess they are just too lazy to check and do their job. After a long wait to check in, we asked their help to send our huge luggage using their club car, they were very reluctant and gave us a cold shoulder and said they would only do this out of good will with a really cold face. They did help us to send the luggage but who wants a help of that nature??  They do really expect you to carry your heavy luggage up the hill to your room. NO SENSE OF KINDNESS WHATSOEVER. THey should perhaps learn some customer service skills in which customer service is all about putting customer first and also dealing tactfully. My fellow course mate got conned regarding the refrigerator issue. They mentioned to us that 'if we would like to have a fridge in the room, it would cost 10 dollar'. We were under the impression that a fridge would be rented to us for 10 dollar per mth, but in real fact the 10 dollar is just for the electricity charge in which they did not mention to us clearly. After realising the  misunderstood situation, my friend explained to them and asked back for his cash. they just complacently asked him to email them ( i can't understand why they always ask to correspond thru email when you are talking to them face to face). When he emailed, they just plainly refused to pay back his cash. DAY LIGHT ROBBERY!!!. Secondly, i did not have any wifi access in my room, hence i went and questioned them on that matter. They told me that they mentioned in their website that they would provide internet access not WIFI access (HOW SMART they are to twist words and statement)....when i requested them that i would like to have a room with wifi access, they told me i need to pay 50 dollar for room changing fee!!! ( I haven't even stayed there for a hour!)...the room was filled with mildew and mould smell...fungus was everywhere in the air....after complaining several times, they said they would ozonise the aircond, which in turn did reduce the smell but did not totally eradicate it....the canteen was a huge mess, everything they serve there is unhealthy, once i entered the canteen and saw about 5-6 men sleeping on the table...i got shocked...most of the time they don't have any food there….if you want to have any food, the nearest place is by bus to the clement avenue food court which is about 15 minutes away by bus…so troublesome! i wonder how could this be the situation with one of the prominent private hostels in singapore…doesn't have a proper cafeteria....basically this is just a money sucking place..I heard that using the facilities in the gym would incur extra charges…everything is just about taking more money from you..the nearest MRT station is clement which is about 20 minutes away by bus (not convenient)..don't stay here at any cost if you don't want to go thru heartache….every experience here was a mere heart ache!!!",
      "time": 1433179372,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14340475416604683630",
  "user_ratings_total": 17,
  "vicinity": "100 Ulu Pandan Road"
}