{
  "formatted_address": "6 Fort Canning Rd, Singapore 179494",
  "geometry": {
    "location": {
      "lat": 1.2975524,
      "lng": 103.8449317
    },
    "viewport": {
      "northeast": {
        "lat": 1.298718880291502,
        "lng": 103.8464538302915
      },
      "southwest": {
        "lat": 1.296020919708498,
        "lng": 103.8437558697085
      }
    }
  },
  "name": "YWCA Fort Canning",
  "place_id": "ChIJZwxIoaIZ2jERAvHcBFIIyjc",
  "rating": 4,
  "reviews": [
    {
      "author_name": "Always-Me Chen",
      "author_url": "https://www.google.com/maps/contrib/100572705723067423058/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLAAmTbhc6oSoGRGCT9Myz6GjVbc0zpNqYPdqDX2TPrG9r8HA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Just a short note to thank your staff Mr Siva for the very warm welcome on our check-in and stay on 3 May 2025.  He patiently listened and understood exactly what we want and attended to it quickly and calmly. His helpfulness and pleasant manner - made us feel assured, welcome and brightened our stay at yr hotel. My friends and I really appreciate it.",
      "time": 1746309261,
      "translated": false
    },
    {
      "author_name": "M D'Silva",
      "author_url": "https://www.google.com/maps/contrib/116485246356224068431/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWa_QPvA4nvE5D6vMTw16q4APD39NwXTzObQO7GvZ7v7qIStMhvog=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "a month ago",
      "text": "Is at a walkable distance from the Dhoby Ghaut MRT station. They have breakfast available at their cafe on the ground floor. Room was spacious. There is a 24 hour accessible self service laundrette. Staff was good.",
      "time": 1744045231,
      "translated": false
    },
    {
      "author_name": "Allison Mak",
      "author_url": "https://www.google.com/maps/contrib/106517021830496069946/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU9DjRxP3VinopzEqSt0I2OWHHWAbdyDsicuUtk-6CQC6ggec4l=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 4,
      "relative_time_description": "2 months ago",
      "text": "Had lunch here, they welcome elderly - my mum and grandparents enjoyed their senior discounts! Menu is a bit limited from now to April as they are revising the space and only have the fan favourites on offer now. Always enjoy the fish soup here, my grandfather ate the bowl clean!",
      "time": 1742551896,
      "translated": false
    },
    {
      "author_name": "Ross O",
      "author_url": "https://www.google.com/maps/contrib/112229165832660593112/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocI_cf5RbCHO0FyiA6urmAilHWQdF3r3_dNpLrW0K4S7MqlZTg=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "a week ago",
      "text": "Drivers be warned - very limited parking lots and worse, grace period is a mere 5 min which is totally out of norm in the Singapore context. After touring both levels of carpark, gave up and exited. That came to $2.26 for not even parking at all, which is totally ridiculous! Hotel will say that the grace period is stated in the signboard when entering the carpark. BUT… one would just scan for the parking charges instead of the grace period which is stated right at the bottom of the signboard.",
      "time": 1746859026,
      "translated": false
    },
    {
      "author_name": "Ros “Ros” Ong",
      "author_url": "https://www.google.com/maps/contrib/110779727917716672454/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJD4FASQN1u7pmbUuQ_YDU0_kVCYpeIysuSdN9-77XmvorgIA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "a week ago",
      "text": "We chose YWCA as the venue for our wedding banquet because we wanted our celebration to support a meaningful cause. Knowing that the proceeds go towards helping the community made the experience even more special for us.\n\nFrom the early stages of planning to the rehearsal and actual day, Eileen and Ee Ling were attentive, responsive, and proactive. They followed up with us closely and accommodated our requests at every step. Even when something was not part of their standard offerings, they went the extra mile to propose thoughtful alternatives, which we truly appreciated. Their support made the entire planning process smooth and worry-free.\n\nWe were especially impressed by the beautiful floral decorations, which elevated the entire atmosphere and perfectly reflected our wedding theme. The bridal room was also tastefully decorated, adding a lovely touch to the day. The wedding package was reasonably priced and included many essentials that are typically only offered by hotels, such as venue décor and coordination services.\n\nWhat stood out to us was how well-organised everything was on the actual day. The team provided a full range of services to set up the venue and ensure everything ran seamlessly. They also offered different payment options, giving us the flexibility to manage our finances comfortably. The ballroom was also spacious enough to host our guests comfortably.\n\nOverall, it was a pleasant and meaningful experience working with YWCA. We would highly recommend them to couples who are looking for a beautiful, well-executed wedding while supporting a good social cause.",
      "time": 1746756833,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=4020034765743517954",
  "user_ratings_total": 1750,
  "vicinity": "6 Fort Canning Road"
}