{
  "formatted_address": "6 Changi Business Park Ave 1, #01-34 ESR BizPark (North Tower) @ Changi, Singapore 486017",
  "geometry": {
    "location": {
      "lat": 1.3354073,
      "lng": 103.9637733
    },
    "viewport": {
      "northeast": {
        "lat": 1.336419030291502,
        "lng": 103.9652789802915
      },
      "southwest": {
        "lat": 1.333721069708498,
        "lng": 103.9625810197085
      }
    }
  },
  "name": "Zab Udon Coco Cafe",
  "place_id": "ChIJucpLRRg92jERhxRYymc6RZY",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Aurora Poh",
      "author_url": "https://www.google.com/maps/contrib/108057917187815536389/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW0DHd_SuwNk50v5wowp4y09YEFDQ0rbqCyaQpZuK6Ud1RUw_u_=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I had a very nice+ authentic taste of Thai E-sarn food called Tom mur (one type of papaya salad style in Thailand) yummy!! and my other favourite dish~ mixed mushroom soup! No ingredients missing, full flavoured with original smell of East northern style. Just nice portions served = Reasonable price, good service so far.",
      "time": 1740558387,
      "translated": false
    },
    {
      "author_name": "Weishan Koh",
      "author_url": "https://www.google.com/maps/contrib/115185883826649656499/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIZQvvDFGGIXTdLOVmR1B6t5YMXFfapM_iMmO8_3u3jnQtB8w=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Found this place online. It is not easy finding places that serve sticky rice in the east side. Food was of great value. Servings were huge. Staff were friendly. Service was quick. Place was clean.\n\nOld school pad Thai came with 3 huge prawns. The grilled chicken, papaya salad and sticky rice was a set meal. The grilled chicken was suuuuuuper impressive - tender and flavourful with crispy skin. Papaya salad somehow tastes a bit like Yusheng. Corn salad’s sauce was great. Corn was not really sweet but the sauce made up for it. Soup was great too. Thai iced tea was a tiny bit sweet but can still taste the fragrance of the tea.\n\nMenu is huge. Will definitely be back to try other items.",
      "time": 1740915709,
      "translated": false
    },
    {
      "author_name": "Adrick Loh",
      "author_url": "https://www.google.com/maps/contrib/116967523325064503672/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSqxpxAhBHKvOrwj2rqIVkVX63y1J5yy77XZyeuL2vlR5xtrA=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "7 months ago",
      "text": "Think the best food in this area. The Thai food here is definitely above average. Prices are reasonable in this biz park. Liked the boat noodles mahk as the flavor is thick enough. Moo Ping and Tom yum clear soup is nice, the crab meat fried rice is average.\nReturned twice to try other dishes. See photos.",
      "time": 1729330835,
      "translated": false
    },
    {
      "author_name": "sand kala",
      "author_url": "https://www.google.com/maps/contrib/107606795679138254745/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVqxvBrSe2-y3zc_CGL5x7MoA4lca9ZAKH1H4T-dt6tSMhGRomE=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "a year ago",
      "text": "Located near Changi City Point, this Thai restaurant is truly a hidden gem waiting to be discovered. From the moment you step inside, you're greeted with warm hospitality and authentic Thai flavors that transport you to the bustling streets of Bangkok. While every dish bursts with vibrant colors and bold aromas, it's worth noting that even the least spicy option may still pack a punch for some palates. However, don't let that deter you, as the impeccable service and tantalizing flavors make it a place worth revisiting, even for those with milder taste preferences. Whether you're craving classic Pad Thai, flavorful curries, or refreshing coco drinks - mango coconut is a must try , this restaurant promises an unforgettable culinary journey that will keep you coming back for more.",
      "time": 1713279809,
      "translated": false
    },
    {
      "author_name": "Lorelai D",
      "author_url": "https://www.google.com/maps/contrib/110563036404967613068/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjULKw5VTdsgo88mrtjy3ko391WqBerSbG_wLgbfLvMBWvlGZtQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "a year ago",
      "text": "Feel like some spicy Tom yum soup on a gloomy Singapore afternoon during CNY, and decide to go for somewhere w a lesser crowd. Chance upon this small Thai cafe w reviews about how authentic it is.\n\nTheir set lunch is at really good affordable price between $9.90 to $29.90, no GST too. Saw their promo crab meat omelette fried rice at $9.90. Located just across a beef noodles place & near dominos & dim sum & Indian restaurant at North Tower of the ESR biz park.\n\nAtmosphere is not like where you can sit & chill & talk kind of place but I like that you just eat & go because I observed that they always have a queue & the turnaround is pretty good, perfect for lunch.\n\nTheir menu is extensive, took me a while to scroll through so I think dinner can be an option to try out other dishes. Did see a dinner set at $59.90 too, affordable as the portion is quite big.\n\nWe ended up with a combo for 2 which comes with mooping (pork skewers), crab meat omelette on fried rice, Tom yum soup & 2 ice milk tea that is $19.90 & we also added a basil pork as an ala carte too.\n\nNow on to the food. The star has got to be the Tom yum soup. The tanginess is just right, not as spicy as it looks, and there is an abundance of ingredients which surprised us. There were 2 large prawns & a bunch of smaller ones & mushrooms & for the first time, there is some coconut slices in there which makes it a perfect palate cleanser when you sip the flavorful soup, for someone who loves to cook, I checked out what goes into the ingredients, there are loads of ginger, coriander stem, chili, tomatoes, which makes this a must try there.\n\nThe moo ping was ok & has some char pieces on it. I am not too much of a fan for the crab meat omelette though, as it is more like a thin egg omelette w some strategically placed crab meat on top of some plain fried rice, honestly I think white rice would have been better as the dish turns out too oily but it goes well w the soup. The basil pork (pad kra pao) was more like a Chinese mince pork stir fry w loads of chilis in there, flavorful but I preferred the dried version, they are super generous in the chili & accidentally ate one & thank goodness for the Thai ice milk tea.\n\nI like how they use diff containers for the food. Authentic clay pot for the soup & aluminum pot for the curry, add to the vibe.\n\nOverall a good set lunch meal place at a good price. 4 stars because of the Tom yum soup. Spacious parking since is Changi biz park, conveniently have a fairprice extra nearby too.",
      "time": 1707809147,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=10828125096533038215",
  "user_ratings_total": 99,
  "vicinity": "6 Changi Business Park Avenue 1, #01-34 ESR BizPark (North Tower) @ Changi"
}