{
  "formatted_address": "266C Punggol Wy, #01-374, Singapore 823266",
  "geometry": {
    "location": {
      "lat": 1.4051522,
      "lng": 103.897574
    },
    "viewport": {
      "northeast": {
        "lat": 1.406597630291502,
        "lng": 103.8988813302915
      },
      "southwest": {
        "lat": 1.403899669708498,
        "lng": 103.8961833697085
      }
    }
  },
  "name": "ZENITH MEDICAL CLINIC",
  "place_id": "ChIJ5yHQ3eMV2jERz21p25rFGZo",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "IXK",
      "author_url": "https://www.google.com/maps/contrib/111131336266290555195/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLrjDn3XER_zBx9t8aV7vr-QucG0QIvb58q5zsApswj-d2m7g=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "in the last week",
      "text": "Dr. Paul Ang at this clinic has been our trusted go-to whenever my son experiences ear pain. With his tendency toward ear infections and wax buildup, Dr. Ang has consistently provided expert care, resolving each issue swiftly. This time, my son suffered from severe ear pain and blockage, and to our surprise, a piece of tissue paper had become lodged in his ear canal!\n\nWe are incredibly grateful to Dr. Ang for his skillful removal and prompt attention. His professionalism and dedication make every visit reassuring. Highly recommend this clinic for anyone in need of expert ear care!!",
      "time": 1747367900,
      "translated": false
    },
    {
      "author_name": "Irwin",
      "author_url": "https://www.google.com/maps/contrib/101119115291257911850/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX5LPFz64Ug6xWarbOBSkc4SsBwFWeepEiWMyQnUIkaaqQ_z4k=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "8 months ago",
      "text": "Zenith Medical Clinic lived up to its name of being the peak of the best clinic in Punggol; with a wide variety of services and excelled in their service delivery.\n\nMy mum and I needed to get our ears clean but were unsure of who to approach. Zenith Medical Clinic topped the list when we keyed in “earwax removal punggol” on Google search. We booked an appointment immediately after noticing that Zenith Medical Clinic uses micro-suction instead of syringing to remove earwax.\n\nZenith Medical Clinic is conveniently located on the west side of Punggol, the nearest LRT is Soo Teck (PW7). Turn left upon exiting the LRT gantry and you will see it wonderfully located up a slope beside the 7-Eleven convenience store. Opposite them is Pizzaiolo & Bread which is a bakery that specializes in cake customization, U Stars Supermarket and Shi Fu Eating House where food is affordably priced, not sure of their drinks though.\n\nThe process at Zenith Medical Clinic was as follows:\n\n1. Secure an appointment through their website, WhatsApp or give them a call\n\n2. Register online using Singpass in advance\n\n3. Approach their clinic assistant to verify your particulars on the day of the appointment\n\n4. Take a seat and wait for your name to be called (no queue number will be given)\n\n5. Proceed with consultation\n\n6. Take a seat and wait for your name to be called to collect medication, make payment and follow-up appointments if necessary\n\n7. Rest up and speedy recovery!\n\nOur first impression of Zenith Medical Clinic was homie like being invited to a friend's home rather than for a doctor's consultation. We were first warmly greeted by their friendly clinic assistant Joyce before proceeding with the relevant verification process and taking a seat to wait for our turn.\n\nThe wait became insignificant as a wide selection of books was available to keep patients of all ages occupied. I was amazed that they had books such as Young Scientist which brings back nostalgic memories.\n\nDr Paul was conscientious and patient with his consultation, diagnosis and treatment. He did not rush through his consultation and displayed much care and concern. He shared with us that he would always give his best to treat every patient regardless of how unique their illnesses. He also provides psychological services ensuring that one is physically and mentally well taken care of.\n\nIt warms our hearts when a clinic does not stereotype and is open to hiring anyone who could perform their role and task well. Any potential communication barrier can be solved through typing and sign language. We find that it was a gem to communicate with some of their clinic assistants in such a unique manner and this helped us to understand them better.\n\nWe returned to Zenith Medical Clinic for a follow-up appointment and brought my other family members along for their COVID-19 vaccination. The vaccine at Zenith Medical Clinic was Moderna and it was swiftly and painlessly administered by Dr Paul himself. 30 minutes of observation was required after the vaccine was administered to ensure that patients were cleared of any major side effects that required immediate medical attention.\n\nThe clinic assistants and doctors at Zenith Medical Clinic are constantly trying to improve and innovate to assure you the purest quality of care. This can be observed from how dedicated they were towards all of their patients.\n\nTimestamp of experience at Zenith Medical Clinic, 31 Jul 2024; Wednesday and 31 Aug 2024; Saturday. 🌟🌟🌟🌟🌟",
      "time": 1725199816,
      "translated": false
    },
    {
      "author_name": "coldshock",
      "author_url": "https://www.google.com/maps/contrib/112388290850435424208/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJyvC0nyZ122P6VdarymIUDSnz0mMqFj9Bn0dGrm8EqCGTRaBc=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Cleared my ears in less than a minute. Dr Paul Ang was very professional and quick. Thank you for providing us affordable ENT services.\nMy travel across the island was well worth.",
      "time": 1742446898,
      "translated": false
    },
    {
      "author_name": "KINJAZT",
      "author_url": "https://www.google.com/maps/contrib/105273719376043118480/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUol4q5iadUdrUhf2Amnd7QOYhwg9m-BMNWeNbjQrm3GVhdAkmEbQ=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Went to get my ears cleaned by Dr Paul. Been suffering with blocked ears on-off for years. Would always have blocked/stuffy ears for at least 1-2 weeks whenever I participated in any kind of water activity. Dr Paul and his team were all so friendly and efficient. Would recommend this place to anyone, quite rare for ENT Clinics to have both suction/water syringing at an affordable cost. Thank you Zenith Clinic!!",
      "time": 1737553647,
      "translated": false
    },
    {
      "author_name": "Krystle Lee",
      "author_url": "https://www.google.com/maps/contrib/107339251867569888130/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIuG0zEAHIfA8N4XJFQqmx8PIrPQYyu4zXSOvo4jDacu5XmEig=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "This clinic is truly the MVP in the heartlands\nBlocked ear for 2 weeks with 2 different docs but it took just 1 visit to this clinic and under 1 min, my ear was unblocked!\nDr Paul and Nurse Crystal were both super seasoned in dealing with such cases\nAlthough the wait is long, the number of patients that go to them for treatment speaks volumes\nThey serve with their heart and utmost care for their patients!",
      "time": 1740715065,
      "translated": false
    }
  ],
  "types": [
    "hospital",
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=11104123625155423695",
  "user_ratings_total": 268,
  "vicinity": "266C Punggol Way, #01-374"
}