{
  "formatted_address": "Block 14 Wholesale Centre, #01-25, Singapore 110014",
  "geometry": {
    "location": {
      "lat": 1.2848944,
      "lng": 103.77888
    },
    "viewport": {
      "northeast": {
        "lat": 1.286332030291502,
        "lng": 103.7802968302915
      },
      "southwest": {
        "lat": 1.283634069708498,
        "lng": 103.7775988697085
      }
    }
  },
  "name": "Zenxin Organic Food Singapore @ Pasir Panjang",
  "place_id": "ChIJs9Vo16sb2jEREH2eUBWB22s",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "Soh Hwa Goh",
      "author_url": "https://www.google.com/maps/contrib/111987848639327446761/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIYUCCTDLtvhItOwMbVeraHT_A5tDPQgVQh1NhRW5i91hQxdko=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Zenxin offers a wide variety of fresh organic farm produce and food choices.  Members have their privileges. I just became the member to get 10% savings. Members get special rates on special promotions and events. That’s so cool! Shopping is a breeze here.",
      "time": 1746165153,
      "translated": false
    },
    {
      "author_name": "Valerie Lin",
      "author_url": "https://www.google.com/maps/contrib/118289889892513525474/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWzIuvLJ1UhTcekZdylprwqVTDSupNBn0UUjS15pFzaqFfBsQs8=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "10 months ago",
      "text": "Very unpleasant experience with my latest order! Have been a loyal customer with Zenxin for over 4 years and over the years, their customer service and delivery taxi uncle has been great despite numerous occasions where expiration dates received for dry goods were only a few months to a year and also to receiving moldy king oyster mushrooms until recently, I really cannot take the change in service standards anymore.\n\nWas looking forward to receiving my order from Zenxin which consists of a few perishables and the rest are dry products. However there's no whatsaap confirmation of my order (previously used to receive) and an approximate timing of delivery (used to receive previously). I called up Zenxin and was informed that they have received my order and I'll receive it around 6.30pm - 7pm. It's quite late as usually my orders will be delivered latest by 6pm or much earlier in the afternoon. After the call, received whatsaap message confirming delivery at 6.30pm-7pm. I waited for the delivery until 7.30pm and received email that my order has been completed. I looked outside my door many times and don't see any zenxin delivery box! Subsequently, while making my young child sleep, I received a phone call from the delivery guy saying that he has left my zenxin box in the carpark on top of the letterbox as there's no answer to intercom and the security refuses to let him into my block. I informed him that I was told delivery timing is around 6.30pm - 7pm, waited until 7.30pm and don't hear nor see anything. He seemed surprised and asked me to check my phone log for his miss calls. I checked and he only gave me 1 miss call at 8.48pm, and I picked up his call at 8.51pm. He was rude towards me, raised his voice and said it's my issue that I didn't pick up his call nor his intercom. This is VERY UNREASONABLE as you can't expect us to watch out for delivery 24hours round the clock!? Zenxin you gave your customer a delivery time range, so stick to it! I waited an extra half an hour pass the delivery time range too! On top of that, just to be disturbed by your delivery partner while disturbing my child's bedtime and to receive such rude calls and to tell me that it's my issue and I should bring this up to Zenxin and Lalamove etc.. ??? Am I paid to do these!? I pay Zenxin for your products and service, not paid by Zenxin!\n\nIn addition, the sorghum that I bought at full price, the expiration date is 4 MONTHS AWAY from today?!?! What is this? This is very poor business ethics! Are you trying to push products that's close to expiration dates to customers that shop online and has no means to check on expirations dates in order to get rid of the old products??!?! This is NOT THE FIRST TIME I ENCOUNTERED SHORT EXPIRATION DATES. I don't get refunds for all of these products previously. I actually absorbed them and tried my best to use them as fast as I could as I used to believe in Zenxin. But now, I'm totally done with Zenxin. SO VERY DISAPPOINTED IN ZENXIN.\n\nI'll never shop from your store ever again. Lost all confidence in your products. The dry and \"fresh\" products are not fresh all the time despite giving so many feedbacks on them previously.\n\nSee below photos for proofs.",
      "time": 1720195196,
      "translated": false
    },
    {
      "author_name": "Danielle Leong",
      "author_url": "https://www.google.com/maps/contrib/107981697687271003788/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUhGyFlwIWPRQCAsPimI5v_hl6YDfA8Gg8e_a9tijr-cWlBM6UH0Q=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 3,
      "relative_time_description": "5 months ago",
      "text": "Bought these yesterday at Bugis Cold Storage.. opened it today to wash and I see mold this is unacceptable.\n\nLatest Update: Zenxin has send me a brand new box of blueberries and a complimentary rainbow noodles. Thank you for the compensation and will\ncontinue to support knowing that you value your customer’s feedback.",
      "time": 1733990396,
      "translated": false
    },
    {
      "author_name": "candy chee",
      "author_url": "https://www.google.com/maps/contrib/116322721094297798397/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVdnXW3oO9i4pSZWu_OsLTv8LsZUzJY8en8B-rJgA5BvgAjHHk=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "11 months ago",
      "text": "Love ordering veggies from zenxin for my green smoothie concoctions! They are absolutely fresh and delivery is almost immediate (the next day) after placing my order even late on the night prior. Highly recommended to anyone who are into organic smoothies like me to order from zenxin!",
      "time": 1717815477,
      "translated": false
    },
    {
      "author_name": "jaslyn chen",
      "author_url": "https://www.google.com/maps/contrib/110713683461154129798/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUDKWUk0dg_7qyrlfELYbABmPV8_nHY8aFb6NxIRpiXs5X0id_O=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "2 years ago",
      "text": "My kids like their Simply Natural Organic Belly Friendly Muesli, perfect breakfast or snack if you are craving for something sweet without guilt!\nReady-to-eat and high in protein, this granola will definitely the perfect choice for you!\n\nUse [JaslynWP22] to get 8% off min.spend $30 Winnie Products.\nValid till 30 Nov 2022 (Unlimited usage).",
      "time": 1667921407,
      "translated": false
    }
  ],
  "types": [
    "grocery_or_supermarket",
    "food",
    "point_of_interest",
    "health",
    "store",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7771947510504783120",
  "user_ratings_total": 98,
  "vicinity": "Block 14 Wholesale Centre, #01-25"
}