{
  "formatted_address": "15 Lor 15 Geylang, Singapore 388607",
  "geometry": {
    "location": {
      "lat": 1.3132316,
      "lng": 103.8781581
    },
    "viewport": {
      "northeast": {
        "lat": 1.314559830291502,
        "lng": 103.8795586802915
      },
      "southwest": {
        "lat": 1.311861869708498,
        "lng": 103.8768607197085
      }
    }
  },
  "name": "โรงแรมฉางเชียง",
  "place_id": "ChIJYalcvzAY2jERBEyWYxPX1OQ",
  "rating": 3.7,
  "reviews": [
    {
      "author_name": "Cynthia Lam",
      "author_url": "https://www.google.com/maps/contrib/102153268000261157098/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLubzpvLVK758HMvqTDFwCKS7UklHcuttG9Tvq5IVYpuGe2UQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "6 years ago",
      "text": "The staff was very nice and helped us with all our questions. Throughout my stay (2 weeks), I found that it was easy to naviagate around amd the hotel is in a good spot having 2 buses within a 5 minute walk.\nThe room itself was quite small even though they said we were upgraded to a suite room for free. For 2 slim and small females in a suite is no problem but any more than that, it would be difficult. It was also not as clean as you would expect from a hotel and there were BUGS! We probably killed half a dozen during our stay.\nFor people who will only stay for nights, I would reccomend.",
      "time": 1530565527,
      "translated": false
    },
    {
      "author_name": "Borislav Georgiev",
      "author_url": "https://www.google.com/maps/contrib/100870077611967431472/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJOF_jAwVm80CTjW6o4OYKrAIZ_jWFn5ubomVdNLhbRxSUBTQ=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "7 years ago",
      "text": "A very nice no frills hotel. There are basic amenities and everything necessary for a normal few days stay. It's generally quiet and no one disturbs you with anything. The room, although basic and small, has everything necessary for a normal stay. Plenty of hot water, working air conditioner. The internet is very fast and reliable. The staff is polite and flexible. There is really nothing to complain of if you are looking for a cheap and convenient stay in Singapore for a few days.",
      "time": 1516542474,
      "translated": false
    },
    {
      "author_name": "chetan anand",
      "author_url": "https://www.google.com/maps/contrib/101095223562774485226/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWtR989-dBnDU02r-TTke5Lud3ppS0b0_r1sWQ1OpkJdFGT9Cbnqw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "6 years ago",
      "text": "The rooms are really old and all the electrical sockets are European styled. So i could not use my charger. The good thing is unlike nearby hotels, I could open windows. There is a separate hanger near to windows to dry clothes which was thoughtful.",
      "time": 1531830753,
      "translated": false
    },
    {
      "author_name": "mike fox",
      "author_url": "https://www.google.com/maps/contrib/111815237034296813546/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKcEoC1FwQqjVAmdjbBHW9kbe79CS_3j6h9nNoimsOiPW1U6w=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 1,
      "relative_time_description": "6 years ago",
      "text": "Let me start with the positives about this hotel. The supermarket is about 2 minutes walk away. The closest metro station is Aljunied, about a 10 minute walk. This is truly a no frills hotel. The reception staff were friendly and helpful. Once I unlocked the door an old stale cigarette smell is noticeable. The room is extremely tiny, the double bed fills the room and just allows walking space around the bed. The tv is the old box tv with the remote at reception. Now for the condition of the room. Small is okay, but unclean and small is not. What I mean with unclean, is the overall perception one gets. The dirty mirror in the room, the paint splatter on the headboard, the round shoe size sticker, that someone stuck to the wall and the phantom cleaners never saw or bothered to remove.\nThe bathroom mirror had old toothpaste/toothbrush spray on it. I showered with my flip flops, I didn't want to chance contracting some kind of fungus etc. The shower space in the bathroom is about 45cm×60cm. Miniscule, tiny, small, minute etc - plenty more similes available to describe that shower space. The rooms are apparently non smoking, that is most probably the reason for the ashtray in the hallway next to the lifts. The smoke smell floats from those indoor ashtrays to the rooms located less than 10m away and filters into the rooms, which allows you to smoke for free, without paying the exorbitant sin tax in Singapore.\nThey advertise daily cleaning, but the old tissue piece that was lying in the hallway for 3 days of my 5 day stay, says otherwise. On the third morning, I emptied the rooms near full bin bag and took it down to reception to ask where I could discard it. Upon this question, the reception lady asked if I needed the room cleaned, to which I replied in the affirmative and left for the day. I arrived the evening back at the hotel with excitement and anticipation, wondering if things would be cleaner. Well. . . . . the mirrors were dirty as before, the half bottles of shampoo and shower gel, were not removed, they just received new full friends. The empty bin did get a new bin liner however.\nThe noise levels from outside are not too bad from my back of the hotel room, can't say how the ones are facing the road in the front of the hotel. When other hotel guests shower, one can hear the water running. The other guests could be heard when they were speaking loudly in the hallway.\nThey don't allow the durian fruit but do allow smoking.\nThis is a budget hotel, so one cannot have too high an expectation. If you do not have any other options for accommodation, try again to locate some other kind of accommodation in Singapore.",
      "time": 1527251129,
      "translated": false
    },
    {
      "author_name": "Etem Akay",
      "author_url": "https://www.google.com/maps/contrib/116168092335583252771/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIzgk0aN5SerWIIxI1ENrSyegEB7WUZ4JiO4YFPFka4koB3Ug=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "6 years ago",
      "text": "Very easy to get anywhere by train. Make sure there is no rain the day you go to Sentosa, they stop a lot of activities. Zoo is a must see. Lots to see & do. Food can be expensive in main shopping area but little sidewalk cafes out of city reasonable & good food great selection.",
      "time": 1534044172,
      "translated": false
    }
  ],
  "types": [
    "lodging",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=16489040613985373188",
  "user_ratings_total": 147,
  "vicinity": "15 Lorong 15 Geylang, Singapore"
}