{
  "formatted_address": "624 Choa Chu Kang Street 62, #01-242, Square 680624",
  "geometry": {
    "location": {
      "lat": 1.3984705,
      "lng": 103.7468379
    },
    "viewport": {
      "northeast": {
        "lat": 1.399867580291502,
        "lng": 103.7482030802915
      },
      "southwest": {
        "lat": 1.397169619708498,
        "lng": 103.7455051197085
      }
    }
  },
  "name": "争鲜gogo - Yew Tee Square",
  "place_id": "ChIJKcsDo2gR2jERAIN_NZeneCY",
  "rating": 4.3,
  "reviews": [
    {
      "author_name": "Zhi Heng",
      "author_url": "https://www.google.com/maps/contrib/100690643870007327173/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLQwgyO_la6ONTVngidCsYsOHrEoxcFFx020Xqn9eQRJ9NhCQ=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "4 months ago",
      "text": "I am a regular customer here at this outlet. I have always bought the salmon sashimi (when on display) during 20% discount after 9pm. However, I came today and was served by counter staff Natasha who insisted that only the sushi items (and not the desserts and sashimi) has 20% discount by even though the sashimi were on display. I told her that I have bought from here and always gotten the 20% discount for the sashimi (when it was on display) including when I came here just last Friday, but she insisted that there have never been such thing and refused to believe me and even believed that I was lying. Ruined my experience here as I felt really wronged.",
      "time": 1735034152,
      "translated": false
    },
    {
      "author_name": "Lea Ang",
      "author_url": "https://www.google.com/maps/contrib/106695073718070236517/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIChKojAT8ofh2gVZFG5mXOFGKqHBJRY5hqMgPHbJkscr2Y1os=s128-c0x00000000-cc-rp-mo",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "The sushi was fresh, flavorful, and beautifully presented. The taste was good, and the price was reasonable, making it a great value for money. Don't miss their strawberry mochi, it was too good to miss, also,  there's currently a promotion on their mango pudding, which is definitely worth trying.  What truly stood out, however, was the staff's attitude. She was incredibly friendly, attentive.\n\nIf you're in the area and craving some good sushi, I recommend GoGo at Yew Tee Square. It's a gem that combines great food with excellent service, creating a memorable dining experience",
      "time": 1737257901,
      "translated": false
    },
    {
      "author_name": "J",
      "author_url": "https://www.google.com/maps/contrib/113966954151240288230/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXgl7XEvYTh_ONFtwf2-GP2b3GcV0_clXthy_UtK3NV2ATn81DzLg=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 4,
      "relative_time_description": "2 years ago",
      "text": "Been patronizing this store since they open in late 2022. They used to sell the truffle sushi and it was simply awesome. But sadly, they don’t sell it anymore.\n\nThey also used to be very generous with the soy sauce and wasabi but today the guy only gave a few packets.\n\nThere was also a line outside the store today and same guy was slamming on the bell continuously. Probably to get the attention of potential customers but I saw people only looking puzzled and annoyed. Not a good technique to “attract attention”.",
      "time": 1673276883,
      "translated": false
    },
    {
      "author_name": "Noorashikin Sheikh Noordin",
      "author_url": "https://www.google.com/maps/contrib/116966957694191339328/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL_TzrJWyyTj1hP_mwxntyE16PcSJmShgFRiIbn2GrEJf0Bpw=s128-c0x00000000-cc-rp-mo",
      "rating": 1,
      "relative_time_description": "8 months ago",
      "text": "I always patronised here as my whole family loved sushi and the warm services from your staff everytime we buy..everytime I buy,I  will inform the staff no need to give me wasabi cuz we dont eat but more sauce as my kids used alot of sauce to dip in their sushi! Today I bought sushi worth $20++ and the staff asked me if 1 CHOPSTICKS ENOUGH?? And I told her can give me 2 (despite more than 2 will be eating the sushi) cuz I buy alot and I can't simply eat 1 person. She reply \"oh u can ask for 3\"! I checked my bag and saw I was given 12 sachet of the tiny sauce. I went back and ask her nicely can I have another 2 and infront of other guest,she said \"I already give u alot\" and she open my bag and ask me to see! Come on its just another 2 pathetic packet! She did not give me for your info!! Do Sushi GOGO have a policy how many chopsticks can be given and number of sauce??I was disappointed and I bought the bottle of Soy Sauce myself! Due to this, u lost a loyal customer!  Check your CCTV if u think I am lying! Your staff should learn to be more flexible especially if customer buying more packets!",
      "time": 1726746298,
      "translated": false
    },
    {
      "author_name": "Jowett Chng",
      "author_url": "https://www.google.com/maps/contrib/114340201862369609919/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU0tp6E23A7FolSn4Vi4i-9-Ov86W-0nfBQCS85DExmjR5DR29V=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 1,
      "relative_time_description": "3 months ago",
      "text": "Portion size has significantly decreased while prices jumped from $7 to $8.50. Not worth it anymore when Don Don Donki offers better value just down the street - their portions are more generous and only costs slightly more.",
      "time": 1737861812,
      "translated": false
    }
  ],
  "types": [
    "meal_takeaway",
    "restaurant",
    "point_of_interest",
    "food",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=2772149838525989632",
  "user_ratings_total": 93,
  "vicinity": "624 Choa Chu Kang Street 62, #01-242, Square"
}