{
  "formatted_address": "15A, Jalan Nadi 4 Taman Bukit Senadi Iskandar Puteri, 79100 Johor Bahru, Johor Darul Ta'zim, Malaysia",
  "geometry": {
    "location": {
      "lat": 1.4392019,
      "lng": 103.6321195
    },
    "viewport": {
      "northeast": {
        "lat": 1.440518930291502,
        "lng": 103.6335310802915
      },
      "southwest": {
        "lat": 1.437820969708498,
        "lng": 103.6308331197085
      }
    }
  },
  "name": "古韻工作坊 Refined Corner",
  "place_id": "ChIJ_0ClX0cL2jERjy_G44g-hUU",
  "rating": 5,
  "reviews": [
    {
      "author_name": "Rui Ng",
      "author_url": "https://www.google.com/maps/contrib/100688760567847924052/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJZXkmD5TpqCgdoOgBCzlIlv07_LS0MTAz7UEJn1mPCh-iSlg=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "My wife found this newly set up company in google from search engine as we wish to do some photoshoot as memories for our 10 years since we first met.  We were attracted to their offer of choice for Han Fu, the traditional attire of the Chinese during the Han Dynasty period. During our photoshoot session, it was wonderful.\n\nThe ladyboss was very friendly and helpful, generous as well. We could try on several sets of clothing before making our choices.\n\nThe makeup artist was very good too and her skill was amazing for the hairdo and makeup.\n\nWe chose an outdoor setting but the photographer also took some indoor pictures for us as well. He was very patient and display professionalism in his skill. The pictures were superb!.\n\nWe highly recommend them to all out there who woild like to do photoshoot of weddings/anniversaries in the Chinese Traditional Han clothings. You may browse their choices in facebook.",
      "time": 1741852203,
      "translated": false
    }
  ],
  "types": [
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=5009478918177435535",
  "user_ratings_total": 1,
  "vicinity": "15A, Jalan Nadi 4 Taman Bukit Senadi Iskandar Puteri, Johor Bahru"
}