{
  "formatted_address": "257 Jln Kayu, Singapore 799485",
  "geometry": {
    "location": {
      "lat": 1.3968199,
      "lng": 103.8729364
    },
    "viewport": {
      "northeast": {
        "lat": 1.398161730291502,
        "lng": 103.8743696302915
      },
      "southwest": {
        "lat": 1.395463769708498,
        "lng": 103.8716716697085
      }
    }
  },
  "name": "喜锅Xi Guo（火锅&烤肉）BBQ&HOTPOT",
  "place_id": "ChIJLSCwVB8X2jERd0Ze7awNfMk",
  "rating": 4.4,
  "reviews": [
    {
      "author_name": "Selina Lee",
      "author_url": "https://www.google.com/maps/contrib/103394046212719262685/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJ90hFFxWwQiOezJrGrrH7P-NJHO9Q2bpiUdf6xduw5j7oT6Q=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "Great steamboat and BBQ 2in1 buffet. All the meats are marinated very well and they are so tasty after BBQ. If you’re looking for a fantastic steamboat and BBQ experience, this restaurant is a must try. The variety of fresh ingredients, including premium meats, fresh seafood, and crisp vegetables, ensures that every bite is flavorful. The broths are rich and aromatic, with multiple options to suit different taste preferences.Downstairs there is a VIP room with KTV accessories. This is very amazing and very fit for family or friends gathering. Great eating experience here. We will visit again.",
      "time": 1739011866,
      "translated": false
    },
    {
      "author_name": "Swee Teng Low",
      "author_url": "https://www.google.com/maps/contrib/104006423189756098729/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJf75CRxNs0Ltbk0nc4TarX4eU1D0WMB54RR8htc0q8V_EcWCw=s128-c0x00000000-cc-rp-mo-ba3",
      "rating": 5,
      "relative_time_description": "2 weeks ago",
      "text": "Most exp price is $29.90++ per pax, which is reasonable. You get free flow condiments and sauces (even have bbq powder and chilli powder), free flow items in the menu (less ala carte and drinks). Get free flow drinks at $1++, and soup base at $8++ (regardless whether is it 1, 2 or 4 soups).\n\nChicken soup, tomato soup and mala soup all very nice. Tried mushroom soup, which was a bit bland, but maybe because it's more for vegetarian? I'm not sure.\n\nMeat wise, we only ate chicken and pork, pork tasted better for bbq than chicken.\n\nFree flow drink top up of $1++ only allows you to take from machine - coffee (2/5), milk tea, orange juice (3.5/5).\n\nThe waitresses actively clears your empty plates, service is not too bad. I asked many questions because this was my first time there, and they were very patient to answer me.\n\nThere was indoor area with aircon, most importantly is that the bbq plate and soup pot is side by side. The bbq plate worked a bit slower, just bbq longer lor. Outdoor area the bbq and soup is like mookata, not very good I feel. Oh yes, there's no time limit, and the staff doesn't really chase you. We were there for 2ish hours haha. Can use credit card to make payment after meal.\n\nWill go back again 👍",
      "time": 1746411844,
      "translated": false
    },
    {
      "author_name": "G simone",
      "author_url": "https://www.google.com/maps/contrib/111475317571102639491/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocJL6GzA1K8pv0icLsabyPUoHYaLGQEwEgB9MGOw50hlyYDZCoU=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "2 weeks ago",
      "text": "The hotpot was reasonable good with nice mini meat skewers and tasty soup base. but the bbq part of it was really so so ….\nA little pricey considering the quality of their food",
      "time": 1746470227,
      "translated": false
    },
    {
      "author_name": "HOICHING CHAN",
      "author_url": "https://www.google.com/maps/contrib/109980329237927872530/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIjz6rkrLnD84Ym5Hyp1CmYv94iQVffKjIIGzLxAgtJyWa3kA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "BBQ and hotpot at the same time feeling very content! The owner is super nice ! Fast service and fresh ingredients, the brown super rice cake is highly recommended! Must try !",
      "time": 1739012243,
      "translated": false
    },
    {
      "author_name": "Gabriel Aloysius",
      "author_url": "https://www.google.com/maps/contrib/107644531805077113457/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW97ZiF-AL4HnVzMgjhczp-7H7HoH9POwHAxnMjccWnm0Jwh2nz=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "I stumbled upon this place through another food review and decided to give it a shot. Tucked away in a quiet corner of Jalan Kayu, the restaurant greets you with a row of red lanterns outside, giving it a cosy, traditional vibe. Inside, it’s a small and intimate space — nothing fancy, but comfortable enough for a casual meal.\n\nWe made a reservation via Eatigo for a discounted price of $21++ per adult. Upon arrival, we were greeted by the lady boss. We informed her about our reservation and the 10% discount. However, she didn’t seem too pleased and mentioned we were 9 minutes late, so she was quick to deny the discount. Thankfully, the male boss stepped in, and after checking, he gave the nod to honour it. That interaction left me a little taken aback — not the warmest welcome, especially over a minor delay.\n\nWe proceeded to order via their in-house app. Shortly after, we were told that the soup base ($8) and free-flow drinks ($1/pax) were charged separately — something not clearly stated upfront for what was advertised as an \"all-you-can-eat buffet.\"\n\nAs for the food, it was decent. The dishes were served promptly. Some of the marinated meats were flavourful, while others leaned a bit heavy on the seasoning — slightly salty but still alright after being cooked. The skewers were a highlight, and the seafood was fresh enough.\n\nDrinks-wise, there were only two options: sour plum and “milk tea.” The milk tea tasted more like powdered creamer rather than actual tea — definitely underwhelming.\n\nThey do offer free-flow ice cream outside the restaurant (chocolate, strawberry, and a berry flavour), which was a nice touch for the kids.\n\nAt the end, we were told the actual price was $23 instead of the $21 listed on Eatigo — though they still honoured the 10% discount.\n\nFinal bill: $100.40 (incl. GST)\n\n2 Adults: $53.75\n\n1 Kid: $18.75\n\nSoup base: $8\n\nFree-flow drinks: $3\n\nOverall Verdict: 3/5\nThe experience was okay — not terrible, but not outstanding either. For the price point, I’d personally prefer to spend a bit more at HDL or Paradise Hotpot for better quality food and service.",
      "time": 1743901456,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=14518494335103551095",
  "user_ratings_total": 59,
  "vicinity": "257 Jalan Kayu"
}