{
  "formatted_address": "54 Smith St, Singapore 058960",
  "geometry": {
    "location": {
      "lat": 1.2828295,
      "lng": 103.8434274
    },
    "viewport": {
      "northeast": {
        "lat": 1.284147130291502,
        "lng": 103.8447576302915
      },
      "southwest": {
        "lat": 1.281449169708498,
        "lng": 103.8420596697085
      }
    }
  },
  "name": "国医堂 G&G TCM Medical Pte Ltd (Smith Street)",
  "place_id": "ChIJves-JXMZ2jERfGLpRNn8Xbo",
  "rating": 4.9,
  "reviews": [
    {
      "author_name": "Doraemon",
      "author_url": "https://www.google.com/maps/contrib/112665277904119154671/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX2VSCcaT9axvOwx2nD8XD3PgZ8V5VFnv420aocMSfLa6GlcEmN=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "国医堂 G&G TCM Medical Pte Ltd, located on Smith Street in the heart of Singapore, is a well-established traditional Chinese medicine (TCM) clinic that has been serving the community for many years.  Known for its commitment to providing high-quality, personalized care, the clinic offers a comprehensive range of TCM services to address a wide variety of health concerns.  I've been going to 国医堂 for a while now, and I can't recommend them enough.  I've even sent a few friends their way, and they've all had great experiences.\n\nI've had a particularly positive experience with Dr. Edward Chow, who's stationed at the new outlet on Smith Street.  On one occasion, my son had a stiff neck after sleeping on a stiff pillow, and he was immediately cured by Dr. Chow.  Dr. Chow is not only a skilled physician, but also a good friend.  We've been motorcycle riding buddies since 2016, and he's always been a kind and helpful guy. I was lucky to be able to see Edward today, as it's Christmas Day and he doesn't usually work on public holidays.\n\nRecently, Kitty had back pain and was struggling to find relief. She had visited several other practitioners, but with no success.  I recommended 国医堂 to her, knowing they had a good reputation and that many of my friends had positive experiences there.  I was particularly excited to tell her about the new outlet on Smith Street, where my good friend Dr. Edward Chow is stationed.  He's also one of the top 10 Chinese physicians in Singapore, which is a testament to his skills.\n\nKitty went for a consultation and received acupuncture and therapy. She mentioned that she saw significant results, and she was impressed with the new outlet.  I also took some pictures of the place. The first floor is for consultations and therapy, the second floor is dedicated to foot and body massage, and the third floor is a VIP room.  The whole place is nicely renovated and very cozy and welcoming—you really feel relaxed in this space.  It's usually fully packed and you need to make appointments days in advance to get a slot, but luckily, since it was Christmas Day, we were able to walk in without an appointment.\n\nI'm happy to report that she's feeling much better after her visit.  The doctors at 国医堂 are clearly experts in their field, and they take a personalized approach to treatment.  While the prices are slightly higher than some other practitioners, the therapy is efficient and effective, so I think it's worth it.  The consultation fee is $25, acupuncture is $70, and the Meridian Repair Instrument (which requires practitioner guidance) is $30 for a 15-minute session. I'm so grateful for their help.",
      "time": 1735124919,
      "translated": false
    },
    {
      "author_name": "oXRYSTALo Ong",
      "author_url": "https://www.google.com/maps/contrib/114556064085815871377/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUSTtKcF9FYMbh-XNbDu8f7Whl3gi-ZY6T8pFPOm3v9Y98Ws7jL=s128-c0x00000000-cc-rp-mo-ba8",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "国医堂 G&G TCM Medical Pte Ltd: A Trusted TCM Clinic with Skilled Practitioners and a Welcoming Atmosphere (4.5/5 Stars)\n\nRating:\n\n• Practitioners: 5/5 (Skilled and knowledgeable TCM physicians who take a personalized approach to treatment)\n• Service: 5/5 (Friendly, attentive, and accommodating staff who make you feel welcome and cared for)\n• Ambiance: 4.5/5 (Cozy and welcoming atmosphere, with a beautifully renovated space that promotes relaxation)\n• Value: 4/5 (Slightly higher prices than some other practitioners, but worth it for the efficiency and effectiveness of the therapy)\n\nOverall: 5/5\n\nAlright folk, 国医堂 G&G TCM Medical Pte Ltd, located on Smith Street in the heart of Singapore, is a well-established traditional Chinese medicine (TCM) clinic that has been serving the community for many years. Known for its commitment to providing high-quality, personalized care, the clinic offers a comprehensive range of TCM services to address a wide variety of health concerns.  Donkey has been going to 国医堂 for a while now, and he can't recommend them enough. He's even sent a few friends their way, and they've all had great experiences.\n\nDonkey has had a particularly positive experience with Dr. Edward Chow, who's stationed at the new outlet on Smith Street. On one occasion, his son had a stiff neck after sleeping on a stiff pillow, and he was immediately cured by Dr. Chow.  Dr. Chow is not only a skilled physician, but also a good friend. They've been motorcycle riding buddies since 2016, and he's always been a kind and helpful guy. Donkey was lucky to be able to see Edward, as it's Christmas Day and he doesn't usually work on public holidays.\n\nRecently, I had back pain and was struggling to find relief. I had visited several other practitioners, but with no success. Donkey recommended 国医堂 to me, knowing they had a good reputation and that many of his friends had positive experiences there.  He was particularly excited to tell me about the new outlet on Smith Street, where his good friend Dr. Edward Chow is stationed.  He's also one of the top 10 Chinese physicians in Singapore, which is a testament to his skills.\n\nI went for a consultation and received acupuncture and therapy. I mentioned that I saw significant results, and I was impressed with the new outlet.  Donkey also took some pictures of the place. The first floor is for consultations and therapy, the second floor is dedicated to foot and body massage, and the third floor is a VIP room.  The whole place is nicely renovated and very cozy and welcoming—you really feel relaxed in this space.  It's usually fully packed and you need to make appointments days in advance to get a slot, but luckily, since it was Christmas Day, we were able to walk in without an appointment.\n\nI'm happy to report that I'm feeling much better after my visit. The doctors at 国医堂 are clearly experts in their field, and they take a personalized approach to treatment.  While the prices are slightly higher than some other practitioners, the therapy is efficient and effective, so I think it's worth it. The consultation fee is $25, acupuncture is $70, and the Meridian Repair Instrument (which requires practitioner guidance) is $30 for a 15-minute session. I'm so grateful for their help. I highly recommend 国医堂 to anyone looking for a reliable and effective TCM clinic in Singapore.",
      "time": 1735213401,
      "translated": false
    },
    {
      "author_name": "Michael Glickman",
      "author_url": "https://www.google.com/maps/contrib/101396859612130116763/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjURcmljM8mBB-sqTBm3DeyRJysYCXMKPuqcQZ8I5acbKAYbN5c=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "I had a 10 out of 10 experience. Could not think of anything they could do better. And I am extremely picky American when it comes to physical therapy and massage. Very healing, strong and helpful. I will definitely come back.",
      "time": 1742208028,
      "translated": false
    },
    {
      "author_name": "Jeanie Lee",
      "author_url": "https://www.google.com/maps/contrib/115256540245176351696/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVVklGgU1oswYWbPm5jIhDz3NVc6lPbtpVlvkseolGy9yOGqz1O=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "3 months ago",
      "text": "First time I go to TCM. Dr Clement treated my injured shoulder with acupuncture this is my first time doing acupuncture. Very caring doctor. I afraid of needle he assured me will not have any pain. Thanks Dr. highly recommend.",
      "time": 1738575898,
      "translated": false
    },
    {
      "author_name": "WM Leong",
      "author_url": "https://www.google.com/maps/contrib/115146541166710837626/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLiMhNW4Gw3XukpF2Hf9kmjgzMm6n8Cdt3d1dqVDVyGgT50RA=s128-c0x00000000-cc-rp-mo",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "Tried most of their masseuses. Excellent tuina skills! Look for Alan. He really knows where to find your points that need kneading! Cure of your congested areas guaranteed!",
      "time": 1740737033,
      "translated": false
    }
  ],
  "types": [
    "doctor",
    "health",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=13429167673982935676",
  "user_ratings_total": 1161,
  "vicinity": "54 Smith Street"
}