{
  "formatted_address": "27 Bendemeer Rd, Singapore 330027",
  "geometry": {
    "location": {
      "lat": 1.3191115,
      "lng": 103.8624505
    },
    "viewport": {
      "northeast": {
        "lat": 1.320607230291502,
        "lng": 103.8637155302915
      },
      "southwest": {
        "lat": 1.317909269708498,
        "lng": 103.8610175697085
      }
    }
  },
  "name": "川味",
  "place_id": "ChIJ0-piKgAZ2jERQxwHZSihgmo",
  "rating": 4,
  "reviews": [
    {
      "author_name": "L Chen",
      "author_url": "https://www.google.com/maps/contrib/114020236834462400270/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjV__x5QHIumtdg1Fz36Gg8bXN2uYy2Tv15q8b2IEg8KG-HYj_Ie=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "This stall tucks in Bendemeer Shopping Mall, offers wide selection 凉拌菜veggies from $1.50 per serving (cucumbers, bean sprouts, shredded potatoes, bean curd, black fungus, broccoli, gourd, etc) or $2.50 per serving premium choices such as lotus roots slices, mushrooms, etc.  Also offer arrays of meat including chicken, duck, beef, etc., that go by the weight.  These items are good to pair with variations of steam/ pan-fried buns (with/ without fillings) or scallion pancakes 葱油饼.  I like that their 凉拌菜 has a very well balanced tangy seasoning (chillies, garlic, lemon), super crunchy and best of all, not too oily nor salty.  On early mornings, there’s 小米粥 （millet porridge) which is certainly excellent comfort food for recent cold rainy days.",
      "time": 1736732159,
      "translated": false
    },
    {
      "author_name": "Mackaz Sajiaos Tan",
      "author_url": "https://www.google.com/maps/contrib/108614244530036867769/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKfKNtZcnpbnC6lr4rL9UxMtKiiOc43GgqjO57_PQxhyWrKGQ=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "10 months ago",
      "text": "Nestled in the heart of the bustling city, this Chinese shop specializes in an array of traditional delicacies, focusing particularly on pickled and spicy foods perfect for pairing with bread. Stepping inside, you're greeted by shelves adorned with jars of vibrant pickled vegetables and fiery sauces, offering a glimpse into a world of robust flavors.\n\nTheir selection boasts a variety of pickled treats, from sour cucumbers to tangy daikon radishes, each promising a zesty bite that awakens the palate. For those inclined towards spicier fare, their assortment of chili-infused sauces and pickled peppers adds a fiery kick to every meal.\n\nI sampled their pickled cabbage, which balanced sharpness with a satisfying crunch, ideal alongside freshly baked bread. The combination of textures and flavors was a delightful departure from more conventional fare, showcasing the shop's dedication to preserving authentic Chinese culinary traditions.\n\nThe shop's ambiance is modest yet inviting, with friendly staff eager to share their knowledge and recommendations. Prices are reasonable, making it a viable option for both casual diners and adventurous food enthusiasts alike.\n\nFor a taste of China's pickled and spicy delights, this shop offers a unique and memorable dining experience that's not to be missed.",
      "time": 1721664017,
      "translated": false
    }
  ],
  "types": [
    "cafe",
    "food",
    "store",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=7674873909858475075",
  "user_ratings_total": 2,
  "vicinity": "27 Bendemeer Road"
}