{
  "formatted_address": "1 Jurong West Central 2, #01-17, Singapore 648886",
  "geometry": {
    "location": {
      "lat": 1.3392308,
      "lng": 103.7069174
    },
    "viewport": {
      "northeast": {
        "lat": 1.340545880291502,
        "lng": 103.7078760302915
      },
      "southwest": {
        "lat": 1.337847919708498,
        "lng": 103.7051780697085
      }
    }
  },
  "name": "旺爐 City Hot Pot @ Jurong Point",
  "place_id": "ChIJ1YlEKMMP2jERyk0QM6hJzog",
  "rating": 4.7,
  "reviews": [
    {
      "author_name": "Dorothy Loh",
      "author_url": "https://www.google.com/maps/contrib/101219166623071860423/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWPdsneUguUhGkYARcipHP66C0aVFduidH1T18kmgXeaUBmFAay=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Loving this one person one hotpot place! The hotpot ingredients were fresh and they’re having a promotion on the single sets! Soup was great and refillable. They could customise it by making it thicker but we felt the original flavour was good enough and after adding in the ingredients it made our soup taste richer.\n\nThey have 5 locations ard the island and all are accessible via MRT. Super convenient!\n\nDefinitely heading back for more!",
      "time": 1744604237,
      "translated": false
    },
    {
      "author_name": "J T",
      "author_url": "https://www.google.com/maps/contrib/117488782459001004422/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIltf1qb_3IqxC5l69RAtPGRuFYTm-sy5pDqnEBrIyHs05bPw=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 4,
      "relative_time_description": "4 months ago",
      "text": "Good service and good. Very busy service crew though looks under staffed though.\nFish soup is a must try. Less spicy mala soup base is just nice.\nSesame sauce is a little under whelming but otherwise a nice dining experience",
      "time": 1736658488,
      "translated": false
    },
    {
      "author_name": "Tan ANGELA",
      "author_url": "https://www.google.com/maps/contrib/110813304246653788688/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjU0Du9tiG0_g560tOsOChS-7_wf31MkfJ4CU-bkEIbqwUPEUuA=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "2 months ago",
      "text": "First time had a personal hotpot with my bf. Had a precious dinner here as we can choose our favourite soup and ingredients. Really delicious and worth the price. Free flow of snacks, sauces, condiment and soup. No wonder so many people queue for it. Best to reserve a seat before you go.",
      "time": 1740909129,
      "translated": false
    },
    {
      "author_name": "樂Fun Homestay",
      "author_url": "https://www.google.com/maps/contrib/116235819035071974665/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocIsqQpEuO9ayyWuQ9V3C-qHsPzKCGeR2HZ1bz4BzW9ZglFlGQ=s128-c0x00000000-cc-rp-mo-ba4",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "We reserved a table of 3 to celebrate our friend's birthday.  The restaurant opens for dinners at 5pm but unknowingly I arrived earlier around 4.50pm as I wanted to pass them a birthday cake to be served as a surprise for my friend.  The lady who was busy preparing food (Jessica if I got her name correctly) was very helpful to help me to keep the cake first while I went off to meet my friends.  When we returned to the restaurant, the staff was very fast to lead us to our table.\n\nWe took quite a while to decide our order but their staff made it a breeze for us explaining what are the promotions and options.  At the end, we decided to order 2 pax Set D seafood and drinks.  The portion is actually sufficient for 3 of us. The seafood, meat, veggies etc all very fresh.  Free helpings to their wide varieties of sauce, kimchi, pickles and fruits.  The water melon was super sweet.  The staff also kept helping us to refill the different soups we have ordered.\n\nSubsequently we received a call from another friend saying she and hubby could join us for dinner too.  Jessica and her team immediately helped to shift us to another bigger table.  My friend and hubby ordered their 1 for 1 promo meal.  The portions of wagyu ribeye/beef were very generous and nicely sliced.  Their veggies and handmade yong tau fu baskets were beautifully displayed and sumptuous too.\n\nJessica besides asking her team to clean up the table before bringing the cake out, she personally helped to sing 3 versions of birthday songs (English/Chinese/Cantonese) with background music playing.  We are highly impressed by the standard of service by Jessica and her team.\n\nThank you for making our gathering such a memorable one!",
      "time": 1744297754,
      "translated": false
    },
    {
      "author_name": "AC Chan",
      "author_url": "https://www.google.com/maps/contrib/112914663109983612841/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWwNBKCO5Ms4Y2lK88n57wi8-GEEiKO7GMVshBia6Lxg2AUolVd=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 5,
      "relative_time_description": "a month ago",
      "text": "Opted for Set B which came with lots and lots of ingredients — wagyu chuck eye roll, pork collar, fresh fish fillet, fresh prawn [what a thoughtful gesture to deshell before serving], prawn paste, crab stick [swopped with beancurd skin instead], handmade tofu, cockles, liver, vegetable combo, mushroom combo and staple served with a range of dipping sauces and condiments.\n❤️ both the freshly prepared meat and fresh seafood in hearty portion; and the individual pot which allows everyone to get the soup base that they like!\nI chose Teochew fish soup from their 14 different types of soup base which was robust and flavoursome even on its own.",
      "time": 1743139698,
      "translated": false
    }
  ],
  "types": [
    "meal_delivery",
    "meal_takeaway",
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9857897621120634314",
  "user_ratings_total": 857,
  "vicinity": "1 Jurong West Central 2, #01-17"
}