{
  "formatted_address": "Singapore, Pasir Ris Cl, 1号E!Avenue#01-310 邮政编码: 519599",
  "geometry": {
    "location": {
      "lat": 1.3769641,
      "lng": 103.9546897
    },
    "viewport": {
      "northeast": {
        "lat": 1.378477580291502,
        "lng": 103.9563142802915
      },
      "southwest": {
        "lat": 1.375779619708498,
        "lng": 103.9536163197085
      }
    }
  },
  "name": "辣不辣 Labula Mala Sichuan Restaurant @ Paris Ris Downtown East",
  "place_id": "ChIJWcDQFz092jERVMNr1aaufYM",
  "rating": 4.5,
  "reviews": [
    {
      "author_name": "YM Tan",
      "author_url": "https://www.google.com/maps/contrib/105649192512753518764/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjW9jcXQiguRfOX5eQ-RFLvJYLaYBGSepLzJFfZj2G0gnLqs3CHKMw=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "a week ago",
      "text": "Labula at Downtown East offers a casual yet satisfying Sichuan dining experience. The staff are generally helpful and friendly, contributing to a pleasant and welcoming atmosphere.\n\n辣子鸡: Still acceptable—crispy, aromatic, and pairs well with rice. A safe choice for those craving classic Sichuan flavors.\n\n水煮鱼: While still spicy and delicious, the current version differs noticeably from the authentic style. The soup is thicker and darker, unlike the traditional presentation which is typically lighter and more transparent. This variation is likely due to a new chef. It would be more appropriate to label it as “本店特色水煮鱼” to manage diner expectations. The menu photo should also be updated, as it still displays the traditional version and may mislead customers.\n\nOther Highlights\n\nDrinks: Rich and thick—a pleasant surprise, especially the milk tea and plum juice.\n\nOrdering & Payment: Done via QR code at the point of order—efficient, though it may not suit less tech-savvy diners.\n\nServing Size: Portions are generally fair and align well with the pricing.\n\nOverall: 辣不辣 lives up to its name, offering both spicy and non-spicy options with decent execution. While not every dish hits the mark, it remains a reliable spot for late-night mala cravings at Downtown East. Improved menu clarity and recipe consistency would further enhance the overall experience.",
      "time": 1746952663,
      "translated": false
    },
    {
      "author_name": "Clarence Ow",
      "author_url": "https://www.google.com/maps/contrib/112234615480628100933/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjX_dX_-LEj7UqCWF1JKZREPhyLFgPJjp7PYAIjqqOhzJhaYPuc=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 3,
      "relative_time_description": "a month ago",
      "text": "Their store renovations always feel nostalgic and simple, clean and comfortable. As a brand initially known to provide authentic experience of Mala Stir fry, certainly I have to try it.\n\nTheir Mala Stir Fry does not go with weight but rather portion. A portion of meat came with quite a number of slices of meat, the same goes with the vegetable. At this price point, it is definitely affordable, not too much off from food courts.\n\nPersonally, I find the Mala Stir fry quite wet and not really to my greatest liking as I prefers more fragrance kind of cooking. Nevertheless, i respect their style of cooking.\n\nTheir 辣子鸡 is quite average. It is hard and salty and the flavours are too much of \"right into my face\". As they are having a promotion of 1 for 1 辣子鸡, we have our second portion take away back home. It is rather disappointing to find out that the second portion amount of meat is significantly less than the first portion.\n\nThis is a scam in my opinion. Please do it right if you want to have a promotion.\n\nIf this is a honest mistake, I would suggest doing quality checks to ensure the amount of chicken stays the same.",
      "time": 1743064999,
      "translated": false
    },
    {
      "author_name": "Chong Evon",
      "author_url": "https://www.google.com/maps/contrib/104133007521280423603/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWnm-dZKbU5_C0DFErcniHOnz5i3buxvAwkGDCW5x3-xGcvLKEU=s128-c0x00000000-cc-rp-mo-ba5",
      "rating": 5,
      "relative_time_description": "4 months ago",
      "text": "A place with delicious foods with great music! Shout out to the cereal fried chicken super fragrant with well fried chicken. Mala tang tastes good, good potion. The staff is attentive and polite. Will definitely be back to try other dishes",
      "time": 1735573279,
      "translated": false
    },
    {
      "author_name": "Josephine Tan",
      "author_url": "https://www.google.com/maps/contrib/112348698048907176645/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjWzowmzadjaSEOpQSeUG56fM-PUocnEyGJuR6Nz4xZMc8fV6bMz=s128-c0x00000000-cc-rp-mo-ba6",
      "rating": 3,
      "relative_time_description": "6 months ago",
      "text": "While I’ve enjoyed their food before (main outlet), this visit here left me somewhat disappointed. The Mapo Tofu and black fungus dishes were overly salty, and the fried rice lacked the desired “wok hei” flavor, with the rice being damp.\n\nOn a positive note, the mutton skewers were still good, and the red bean pancake was a pleasant surprise, nicely done.\n\nThe staff were pleasant, and the service was prompt. I hope the cooking standards at this branch can match those of the main outlet. Overall, I look forward to returning.",
      "time": 1731768574,
      "translated": false
    },
    {
      "author_name": "Weihaw",
      "author_url": "https://www.google.com/maps/contrib/105421090116567994381/reviews",
      "language": "en",
      "original_language": "en",
      "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUuRbqbfn0O15HJ_FvNeObRTimVVJa6cFvG-iNl-AQIVrseT54m=s128-c0x00000000-cc-rp-mo-ba2",
      "rating": 1,
      "relative_time_description": "3 weeks ago",
      "text": "What a disappointment and got cheated by good reviews.\n1. Mala dry pot (SGD 20+)\nHave all the ingredients we ordered but the base is tasteless.\n2. Skewers (SGD 20+)\nInstead of cumin or chili powder, they poured huge pinch of chicken stocks or whatever MSG. There's no taste of the skewers other than the powder they put on it.\n\nIt's a self ordering, online self payment store. But got charged for service charge.",
      "time": 1745936747,
      "translated": false
    }
  ],
  "types": [
    "restaurant",
    "food",
    "point_of_interest",
    "establishment"
  ],
  "url": "https://maps.google.com/?cid=9474921222625805140",
  "user_ratings_total": 760,
  "vicinity": "1 Pasir Ris Close, #01-310 E!Avenue"
}